[{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"By closing his eyes, holding his hands over his ears and repeating loudly “I’m not listening”?\n\n","date":"August 8, 2013 at 10:44 pm","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-40784","author":"Andy Weiss","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"I think the word ‘unconditionally’ is important here. ‘True scientists’ don’t accept anything ‘unconditionally.’ However, I can understand very well their accepting the date as established.\nHowever muddled the processes leading up to the sample taking, and however irregular the management of the results, there is no suggestion in Philippe Bourcier de Carbon’s list, that the samples purported to be from the shroud were not from the shroud, or that the date of those fragments was not as reported. Bruno Bonnet-Eymard, of course, does think that the samples were deliberately switched, but his evidence is tenuous and circumstantial.\nThat takes us to Benford, Marino and Rogers, who without doubting the genuineness of the samples or the integrity of the tests, have to establish that between 70% and 90% of the tested material was interpolated into the shroud, in such a way as to be invisible to the naked eye. This is far from established on a number of counts, of which I will address two.\n1) In their “Evidence for the skewing of the C14 Dating” paper (http://www.shroud.com/pdfs/marben.pdf), Benford and Marino present a diagram of where they think a patch was attached.\nHowever, this would only produce the required dates if the 12 sub-samples actually tested were cut in ribbons from top to bottom of the original same strip. If the samples were cut ‘horizontally,’ then one would expect some dates to be entirely 16th century, some to be entirely 1st century, and only, possibly, a middle one to be a mixture of the two. As we know, a substantial portion of the Tucson sample was not dated at all, but retained. The dated fractions would therefore be almost entirely 16th or 1st, with no intermediates. We also know that the Zurich sample was first cut horizontally into two pieces, and then these two further divided. The dates obtained by the Zurich labs do not match a “patch” scenario.\nA refinement of the “patch” scenario is the “interweaving” scenario. In this case the repair is not hypothesised to be a patch replacing a hole, but a replacement of up to 90% worn out threads across the entire sample area, leaving only a few (between 3 in ten and 1 in ten) of the original threads behind. It is not clear what the extent of this interweaving beyond the sample area might be.\n2) It must be noted that the huge amount of 16th century or later material cannot be from additions (paint, glue, bacteria) to the cloth, as this was thoroughly disposed of by the cleaning procedure; it must come from the replacement threads themselves. There are various theories about these threads: they are all made of 16th century cotton, they are made of 16th century cotton interspersed with 16th century linen, or they are 16th century cotton interspersed with 1st century linen. Sadly, nobody has been able to study more than a handful of these threads, and what they have found is inconclusive. Rogers (http://www.shroud.it/ROGERS-3.PDF), Heimburger (http://www.shroud.com/pdfs/thibaultr7part1.pdf) and Fanti (http://www.shroud.com/pdfs/fantir7appendix.pdf) all found cotton mixed with linen. The question is, whether the proportion of cotton to linen is sufficiently different between the C-14 area threads and the rest to show that the two are different. Rogers doesn’t say what the proportion of cotton to linen was in his selection. Heimburger studied a 1cm Raes length of thread extensively, and concluded: “R7 [the thread he studied] is definitely some kind of blended thread: cotton (10%-20%)/linen (80%-90%).” Fanti studied about 0.5mm of a thread extracted from the C-14 area and concluded: “The relatively small percentage of cotton fibres of (4/188=) 2.1% is in agreement with the hypothesis that cotton was a contaminant in the ambient where linen threads were prerared.” Mysteriously, Villarreal (http://www.ohioshroudconference.com/a17.htm) conducted FTIR experiments on three similar threads, one of which was purported made of two ends stuck together with glue (for some reason sometimes referred to as a splice), and found they were all cotton. These three conclusions appear inconsistent. The main body of the cloth appears to contain traces of cotton, noticed by McCrone, Maloney and even Rogers, but as far as I know no-one has quantified it.\nI agree wholeheartedly that the unconditional acceptance of the C-14 date is not the mark of a ‘true scientist,’ but submit that the unconditional rejection of it is even less so.\n\n","date":"August 9, 2013 at 9:17 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-40818","author":"Hugh Farey","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"The “interweaving” theory is based on statements of Mr. Ehrlich, owner of Without A Trace, Inc., a company of textile repairs, in private communication to Benford and Marino. Mr. Ehrlich asserted that Flury-Lemberg didn’t know the “French Weaving” medieval technique of invisible mending. Flury-Lemberg refutes it in a brief but forceful article: “invisible mending” is invisible only to inexpert eyes and it is impossible in linen. In the web page of Without A Trace Inc. this claim is confirmed. Only for slight fabrics and small holes (no more 1cm). And it is made by mixing threads of the same cloth. If you mix threads of different tissues the repair will be clearly visible. This was confirmed by Mr. Ehrlich to a “forist” (Rich) that asked Mr. Marino in this forum, without answer. So you can’t mix threads from 1rst Century with others from the 16th Century, as supposed in “invisible mending” theory.\nMoreover:\na) Nobody has ever seen an invisible mending or present direct evidence of it.\nb) Nobody has ever studied invisible patches. There is not any book, any article, any study about invisible patches. I’m obviously speaking of textile experts and invisible mending not visible to experts with microspcope, microphoto and so.\n\n","date":"August 10, 2013 at 2:56 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-40869","author":"David Mo","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"“Only for slight fabrics and small holes ”\nMust say:\n“Not for slight fabrics and just for small holes”.\nSorry.\n\n","date":"August 10, 2013 at 2:59 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-40870","author":"David Mo","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"Just one note, Hugh.\n\nHugh Farey :\nI think the word ‘unconditionally’ is important here. ‘True scientists’ don’t accept anything ‘unconditionally.’ However, I can understand very well their accepting the date as established.\n1) In their “Evidence for the skewing of the C14 Dating” paper (http://www.shroud.com/pdfs/marben.pdf), Benford and Marino present a diagram of where they think a patch was attached.\nHowever, this would only produce the required dates if the 12 sub-samples actually tested were cut in ribbons from top to bottom of the original same strip. If the samples were cut ‘horizontally,’ then one would expect some dates to be entirely 16th century, some to be entirely 1st century, and only, possibly, a middle one to be a mixture of the two. As we know, a substantial portion of the Tucson sample was not dated at all, but retained. The dated fractions would therefore be almost entirely 16th or 1st, with no intermediates. We also know that the Zurich sample was first cut horizontally into two pieces, and then these two further divided. The dates obtained by the Zurich labs do not match a “patch” scenario.\n.\n\nYou mean this: https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcTEbSEnu9X_8at5N6REamUYuoAvFj-AZUdRV0uEfj4w7Ofx-g-b5Q ?\nBut this is not a diagram of the patch! This a GRAPH for proposed percentage of 1st vs 16th  centuries material in the carbon-dated sample. BTW: the patch not necessarily must come from 16th century. Several repairs were made later, for example in 1694 by Sebastian Valfrè, and in 1868 by Clotilde of Savoy, the latter IMHO is the main suspect.\n\n","date":"August 10, 2013 at 6:58 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-40883","author":"O.K.","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"No. You’re wrong. I agree it would be more sensibly interpreted as a graph of the proposed percentages of interpolated material, but that is not how the diagram is labelled or discussed in the text. “PINK = 16TH CENTURY PATCH; YELLOW = ORIGINAL FIRST CENTURY MATERIAL” says the caption, and in the text “A striking similarity can be observed between the angle at which the C-14 rate changes and the angle at which the disparate weave intersects the Shroud weave.”\n\n","date":"August 10, 2013 at 8:35 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-40892","author":"Hugh Farey","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"Maybe, anyway this is now a history. The only hypothesis that makes sense to me is that this particular corner was once torn apart (which is quite plausible, because it was the place where Shroud was usually held during various exhibitions etc.), and had to be carefully reconstructed, thread by thread -using linen, perhaps with some minor cotton contaminants. There are various opinions whether it is possible, but if it is, there would be no visual difference to original cloth. Warps original, wefts new. All carefuly attached to original cloth. There are several stitches in that area, one made by Princess Clothilde (Wilson, Blood & Shroud, figure 20). Anyway, we know now that the sidestrip is identical like the rest of the cloth, and was carefully aattached to main body. So it is perhaps posibble. \nNow some calculations using data from here:\nhttp://depts.washington.edu/qil/datasets/uwten98_14c.txt\n    Year             Year BP\n    1865            117\n    1695            115\n    1535            301\n     25               1983\nLets assume 70 % of new material vs 30 % of old.\nThen:\nIf the repair was performed around 1865 or 1695, we have:\nYear  BP           Year (closest)\n632.5               1385 (633 BP) or 1305 (627 BP)\nIf the repair was performed around 1535, we have:\nYear  BP           Year (closest)\n771               1275 (767 BP).\nAlmost exactly where carbon-dating pointed!\nRemember, that the Damon et al 1988 paper was massacred by statisticians. Remmeber CHi-square value of 6.4, later corrected to 8.43 (or 8.76) by Haelst and others.\nRemember that the average weight of the Shroud is 20-25 mg/cm^2, while  weights of the samples were 36-43 mg/cm^2.\nThen, I would like to quote a classic, to all those who still mantain that carbon-daitng results are fine.\nIF IT HAD BEEN SO GOOD, SO WHY IS IT SO BAD?\n\n","date":"August 10, 2013 at 9:42 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-40896","author":"O.K.","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"O.K., thank you for taking into account my analysis re 1868 Clothilde of Savoy’s repairs as the main suspect (along with a 1st c. CE Judean ritual fumigation) to account for the skewing of the C14 dating of the TS.\n\n","date":"August 10, 2013 at 7:25 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-40885","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"Please, read 1863 NOT’1868′.\nReminder, on January 4, 2012 at 11:56 am (#7 Reply), by way of comment, I wrote:\n“Actually Ramsay is “right to a certain extent”.\nSuch a high contamination does not imply a medieval repair in terms of microreconstructions. XIXth century microreconstructions are most likely (either by the princess Clothilde of Savoy-Bonaparte or the Master of upholstery in the Royal court of Savoy, in 1863).”\n\n","date":"August 10, 2013 at 8:30 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-40891","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"For a detailed description of the 2 invisible mending techniques possibly used by Clothilde of Savoy see  relevant excerpts  from my 2007-2008 paper in French entitled: LINCEUL DE TURIN : FAUSSE RELIQUE OU FAUSSE DATATION Carbone 14 ? and subtitled: (Contre-enquête sur un fiasco scientifique) (on June 2013 on this very blog).\nBTW The very surname Clothilde can read as a wordplay on Cloth-(c)hilde. ;-)\n\n","date":"August 10, 2013 at 8:19 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-40888","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"Max,\n– Could these techniques account for the (apparent) uninterrupted banding through the sample area?\n– Can you give me the date in June?\n– Thanks.\n— Rich\n\n","date":"August 15, 2013 at 9:54 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-41340","author":"Richard Savage","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"…and Cloth hide(-and-seek).\n\n","date":"August 10, 2013 at 8:20 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-40889","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"\nO.K. :\nLets assume 70 % of new material vs 30 % of old.\nThen:\nIf the repair was performed around 1865 or 1695, we have:\nYear  BP           Year (closest)\n632.5               1385 (633 BP) or 1305 (627 BP)\nIf the repair was performed around 1535, we have:\nYear  BP           Year (closest)\n771               1275 (767 BP).\nAlmost exactly where carbon-dating pointed!\n\nSorry, I meant that radiocarbon pointed at 1273-1288 AD at 68 % significance. The mean date is of course 691+/-31 BP. http://www.shroud.com/nature.htm\n\n","date":"August 10, 2013 at 9:48 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-40897","author":"O.K.","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"Yes, I follow your reasoning. 70% of the Carbon dating area must be 16th century or later. That’s all the weft and nearly half the warp threads, or maybe 7/10 of both.\nSo, 1) Try examining Barrie Schwortz’s photos at http://www.shroud.com/pdfs/arizona.pdf. The piece photographed contains about 45 threads. If the interweave theory is correct, around 30 are new and 15 old. Can you identify which are which? Can invisible weaving really be that invisible?\n2) The next photo that needs examining closely is the x-ray of the foot of the cloth in http://www.shroud.com/pdfs/marben.pdf. (Figure 7). It is poorly reproduced here, but very clearly in Schwalbe & Rogers, Physics and Chemistry of the Shroud of Turin. There is continuous warp and weft banding right through the C-14 area, and no evidence of interpolated threads, although Benford and Marino, using a very poor copy in their paper, think they see one ‘break’ in one ‘intensity’ line.\n3) Next, the actual dates of the Damon Nature paper have never been queried by statisticians, let alone massacred. The best analysis of the data is by Riani, Atkkinson et al, who do demonstrate, using the data which they do not query, that there is indeed a clear chronological progression along the sample area. This accounts very well for the anomalous chi-squared value and its 5% significance, and does indeed suggest contamination, but it does nothing to suggest that any part of the sample area is from the 1st century.\n4) Finally, however invisible mending is carried out, it results in the new threads running alongside the old threads for some distance as they merge. Sadly I don’t have the much touted Shroud App, as I don’t have an iPad, but if the HD image is as clear as they say, it will surely be possible to examine the area around the C-14 excision and post a screen grab showing these parallel weavings. If the interweaving hypothesis is true there must be hundreds of them.\n\n","date":"August 10, 2013 at 11:28 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-40899","author":"Hugh Farey","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"\nHugh Farey :\nYes, I follow your reasoning. 70% of the Carbon dating area must be 16th century or later. That’s all the weft and nearly half the warp threads, or maybe 7/10 of both.\n\nNot neccesarily. “The diameter of the Shroud warp and weft threads is slightly different” (from Siefker & Spicer paper). And so are their volumes. And so perhaps weights of XVI century vs I century are slightly different.\nRemember that the average weight of the Shroud is 20-25 mg/cm^2, while weights of the samples were 36-43 mg/cm^2. EXPLANATION, PLEASE.\n\nHugh Farey :\nSo, 1) Try examining Barrie Schwortz’s photos at http://www.shroud.com/pdfs/arizona.pdf. The piece photographed contains about 45 threads. If the interweave theory is correct, around 30 are new and 15 old. Can you identify which are which? Can invisible weaving really be that invisible?\nHow can you VISUALLY distinguish between 16th century, and 1st century thread? If they are mixed together, I see no way. That’s why they call it INVISIBLE. For my untrained eye, weft threads on Arizona sample seem darker, however that’s just my own impression, and don’t be suggested.\n\nHugh Farey :\n2) The next photo that needs examining closely is the x-ray of the foot of the cloth in http://www.shroud.com/pdfs/marben.pdf. (Figure 7). It is poorly reproduced here, but very clearly in Schwalbe & Rogers, Physics and Chemistry of the Shroud of Turin. There is continuous warp and weft banding right through the C-14 area, and no evidence of interpolated threads, although Benford and Marino, using a very poor copy in their paper, think they see one ‘break’ in one ‘intensity’ line.\n\nI don’t argue, because I consider the patch going probably much deeper into cloth, than Benford and Marino thought.\n\nHugh Farey :\n3) Next, the actual dates of the Damon Nature paper have never been queried by statisticians, let alone massacred. The best analysis of the data is by Riani, Atkkinson et al, who do demonstrate, using the data which they do not query, that there is indeed a clear chronological progression along the sample area. This accounts very well for the anomalous chi-squared value and its 5% significance, and does indeed suggest contamination, but it does nothing to suggest that any part of the sample area is from the 1st century.\nDon’t manipulate my words. I haven’t said that statisticians showed that the cloth is from 1st century. I know what is the purpose of statistical tests. They simply show that 1260-1390 interval is UNRELIABLE, and the true age of the Shroud IS STILL UNKNOWN. The Shroud is probably older than 13-14th century (because of unknown younger contamination), but statistical tests DOESN’T SAY HOW MUCH! It could be from the 1st century, it could be from the 11th century. WE DON’T KNOW. We know (or better use the word ‘suppose’, as there are no certainities in statistics), however, that we cannot trust Damon et. al results.\nNote: if the reweave had been PERFECT, that is 7/10 ratio would be the same through the WHOLE SAMPLE (that means the threads would be spliced everywhere), the statistical tests would have shown NOTHING -they would argue that the data is consistent. Just like the data for Oxford and Zurich were self-consistent, it was Arizona which showed that something is strange with the sample, see Remi van Haelst paper:http://www.shroud.com/vanhels3.htm  So the hypothethical reweave was not so perfect, and anomaly was detected in statistical analysis.\n\nHugh Farey :\n4) Finally, however invisible mending is carried out, it results in the new threads running alongside the old threads for some distance as they merge. Sadly I don’t have the much touted Shroud App, as I don’t have an iPad, but if the HD image is as clear as they say, it will surely be possible to examine the area around the C-14 excision and post a screen grab showing these parallel weavings. If the interweaving hypothesis is true there must be hundreds of them.\n\nOnce again: How do you VISUALLY distinguish between 16th century, and 1st century thread?\nAnd once again, for all those who still believe in 1988 carbon dating:\nIF IT HAD BEEN SO GOOD, SO WHY WAS IT SO BAD?\n\n","date":"August 10, 2013 at 1:36 pm","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-40911","author":"O.K.","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"Thanks, OK, for your analysis.\nAa) The average weight of the shroud. I can’t find when this was established. When was the shroud weighed – and how? Presumably it was during the 2002 restoration, after the patches and backing cloth were removed. Was it rolled up and weighed then? Or is the rather precise mg/cm2 number an over-precise conversion of what was originally not much more than a guess, based on the overall weight and size of the whole thing?\nAb) Never mind. Accepting the average weight of the shroud for a moment, the C-14 sample is supposed to be of more than 50% heavier material than the rest of it. What does this mean in terms of an invisible reweave? That the threads are much closer together – no, because this would be clearly visible. That the threads are much thicker – no, because this would be clearly visible (and anyway Benford & Marino specifically point to what they think are thinner interpolations on the Zurich sample). That the admixture of cotton significantly increases the density of the thread – no, because flax fibres have a density of about 1.45g/cm3 while cotton fibres have a density of about 1.55g/cm3.\nAc) My explanation for the anomaly is the inaccuracy of the quoted mass of the whole shroud, coupled to local variations in weave density. Can you account for the increased density of the C-14 area?\n1) I don’t know what visual difference there would be between 16th and 1st century thread. I was arbitrarily assuming that there was some! Does that sound unscientific? Let’s have another try. Rogers thought he had discovered that the interpolated material had been dyed in order to match the colour of the shroud. I think it unlikely that the two colours would match so perfectly as to be indistinguishable, even under a microscope. Apart from that, new thread might be visibly thicker/thinner, looser/denser or even rougher/smoother. A demonstration that 15 of the Schwortz sample threads look different from the rest would be convincing, but I don’t find that.\n2) The banding seems clear right the way across the photos. Are you suggesting a patch over, say, 20cm wide and high? Only that would account for the uninterrupted stripes that are clearly observable.\n3) No again. Remi van Haelst and Riani & Atkinson demonstrate inconsistencies in the statistical analyses which are perfectly valid. However, to suggest that that means that no information at all can be derived from the radiocarbon results is absurd. Assuming that the raw data is acceptable, and at no point do our statisticians dispute that, a collection of 12 independent dates between 1200 and 1400 cannot be rejected with a simple, “It could be from the 1st century, it could be from the 11th century.” Statistically, that’s an imprecision vastly more unlikely than the precision quoted by the Nature paper.\n4) In this case, you don’t have to distinguish between threads of different ages; you simply have to show a bit of anomalous weaving, where two threads run alongside each other for a few millimetres, as the new thread is woven into the pattern. As I say, there must be hundreds of places where that happens.\n\n","date":"August 11, 2013 at 5:44 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-40955","author":"Hugh Farey","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"Hugh:  “The average weight of the shroud. I can’t find when this was established. When was the shroud weighed – and how?”. Pierluigi Baima Bollone in his “Sindone, 101 domande e risposte” (Ed. San Paolo, Cinisello Balsamo (MI) 2000) claims that the Shroud with ALL additions (patches, holland cloth etc.) weighted 2.5 kg. Emanuella Amrinelli in her  “La Sindone – Un’immagine Impossibile” (Edizioni San Paolo – Cinisello, Balsamo (MI), 1996) is more precise -2.450 kg. The Shroud is 437×111 cm. Thus the average weight WITH ALL ADDITIONS is 50.5 mg/cm^2. The sample of 7×1 cm, of the Shroud itself, weighted 300 mg, that is 42.85 mg/cm^2. The larger cut part of 8.6×1.6 cm weighted 478.1 mg (36.89 mg/cm^2).\nThe average weight of the Shroud itself is based on textile analysis. Maria Grazia Siliato in “Sindone Mistero Dell’Impronta di duemila anni fa” (Edizioni Piemme Spa., (AL) 1997) quotes  4 analyses:\nA. Timossi: 23 mg/cm^2\nG. Raes 25 mg/cm^2\nR. A. Morris 25 mg/cm^2\nG. Riggi 20+/-3 mg/cm^2\nHugh: “Or is the rather precise mg/cm2 number an over-precise conversion of what was originally not much more than a guess, based on the overall weight and size of the whole thing?” \nI can understand variety of say 25 %. But an error of 40-110 %? No way, Hugh, no way. \nHugh: “flax fibres have a density of about 1.45g/cm3”\nThe Shroud is about 0.34 mm, that is 0.034 cm, thick. Assuming 1cmx1cmx0.034 cm cuboid, and that threads occupy 50 % of its volume, we have a result of 24.7 mg/cm^2. To be 42.85 mg/cm^2, they must occupy 87 % of its volume.\nHugh: “My explanation for the anomaly is the inaccuracy of the quoted mass of the whole shroud, coupled to local variations in weave density. Can you account for the increased density of the C-14 area?”\n“Local variations” you say. Thus, YOU HAVE ADMITTED WITH YOUR OWN WORDS THAT THERE WERE VARIATIONS IN C-14 AREA.\n\n","date":"August 11, 2013 at 9:25 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-40964","author":"O.K.","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"Hugh: “I don’t know what visual difference there would be between 16th and 1st century thread. I was arbitrarily assuming that there was some!” \nHugh, don’t be naive. Had it been so, the whole C-14 dating would have been unnecessary ;-)\nHugh: “Apart from that, new thread might be visibly thicker/thinner, looser/denser or even rougher/smoother. A demonstration that 15 of the Schwortz sample threads look different from the rest would be convincing, but I don’t find that.”\nHugh, in every population of 45 threads, no matter of age, there would be 15 or so that are “visibly thicker/thinner, looser/denser or even rougher/smoother.” \nFrom Siefker & Spicer paper (L2.0):\n“Due to the fact that the threads and the cloth are handmade, both the number of fibers per thread and their diameter vary up to 50%”\nHugh: “The banding seems clear right the way across the photos. Are you suggesting a patch over, say, 20cm wide and high? Only that would account for the uninterrupted stripes that are clearly observable.” \nMaybe. Maybe the patch goes much deeper than everyone thought, with new vs old threads ratio gradually changing. BTW: the bandings go interrupted from the main cloth to he side strip, but WE KNOW that the side strip was carefully re-attached to the main cloth. So perhaps it is possible.\nHugh: “However, to suggest that that means that no information at all can be derived from the radiocarbon results is absurd. Assuming that the raw data is acceptable, and at no point do our statisticians dispute that, a collection of 12 independent dates between 1200 and 1400 cannot be rejected with a simple, “It could be from the 1st century, it could be from the 11th century.” Statistically, that’s an imprecision vastly more unlikely than the precision quoted by the Nature paper.”\nHugh: If 12 pairs of 1st and 17th century threads blended together were carbon-dated, each of the 12 datings would reveal the date of around 1000 AD. The average of 12 measurements would also be around 1000 AD, and statistical tests would show that the results ARE PERFECTLY CONSISTENT. The average spin of the electron is 0, but the only possibilities are either +1/2 or -1/2. I assume that you know a little bit about the basics of statistics.\nStatistical analysis show that the ASSUMPTION of normal (gaussian) distribution centered around 691 years BP, SHOULD BE REJECTED. Thus, WE ARE IN THE MIDDLE OF NOWHERE. The carbon dated material consist of a mix of older and younger material. IT IS UNKNOWN WHAT IS THE RATIO AND AGES OF OLDER AND YOUNGER. Manipulating those parameteres, the Shroud may be from 11 century AD, or 11 century BC.\nHugh: “In this case, you don’t have to distinguish between threads of different ages; you simply have to show a bit of anomalous weaving, where two threads run alongside each other for a few millimetres, as the new thread is woven into the pattern. As I say, there must be hundreds of places where that happens.”\nPerhaps thousands. And it not necessarily may be a problem. Remeber that the threads have limited lenght. Wilson in his 1978 book, Appendix D, gives a register of samples taken from the Shroud in 1973. The mentioned threads are 8 up to 28 mm long. Anomalies in weaving may be present everywhere, even at the opposite end of the cloth.\n\n","date":"August 11, 2013 at 9:50 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-40966","author":"O.K.","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"OK: Maybe. Maybe the patch goes much deeper than everyone thought, with new vs old threads ratio gradually changing. BTW: the bandings go interrupted from the main cloth to he side strip, but WE KNOW that the side strip was carefully re-attached to the main cloth. So perhaps it is possible.\nOK,\n– I had never seen the “deeper” possibility discussed.  Can you refer me to something?\n\n","date":"August 13, 2013 at 10:25 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-41189","author":"Richard Savage","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"That’s interesting. Gilbert Raes’s measurement comes from his tiny fraction of the shroud which he extrapolated to the whole thing and which, according to the patch hypothesis, was only partly composed of original shroud anyway. Verginio Timossi’s measurement comes from a copy of the shroud, not the original at all. RA Morris estimated the density of the Shroud from Compton scatter, again not by actually weighing the shroud, and gave a combined shroud/backing density of 30-40mg/cm2. Dividing this proportionately between the measured thickness for the backing and shroud (270/345) gave  about 20mg/cm2 for the shroud and 15mg/cm2 for the backing, although Schwalbe & Rogers considered the shroud value too low, considering “the comparatively open weave structure of the backing cloth.” I can’t find where Riggi gets his estimate from. The fact remains that nobody at all has ever actually weighed the shroud, with or without its backing cloth. \nFreer-Waters & Jull examined a fragment of the C-14 sample weighing 12.39mg. Their piece was photographed, with a scale, by Barrie Schwortz, and can be accurately measured as about 56 square millimetres. That makes a C-14 density of 22mg/cm2. That corresponds well with the overall calculated density in the paragraph above, but is in distinct disagreement with your 36.89mg/cm2, or even the Paris 1989 reported measurements (8.1 x 1.6 cm, weight 0.497g; density : 38.3mg/cm2). However, Brian Walsh disputes these measurements. Riani and Atkinson, using Walsh’s figures, give an original size of 8.1 x 2.1 cm, which would give a density of 29.2mg/cm2, and a trimmed size of 8.1 x 1.6 cm, which would give a C-14 density of 23.1 mg/cm2. All in all I do not find any of these figures sufficiently well established to agree that the C-14 sample has a different density from the rest of the shroud.\nFinally, I suspect that shroud cloth has local density variations all over. They are artefacts of the properties of the original hanks of thread of which it is made, and do not indicate patches of interweaving.\n\n","date":"August 11, 2013 at 1:34 pm","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-40980","author":"Hugh Farey","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"Still, only 7×1 cm part weighting 300 mg is important. That gives 42.85 mg/cm^2 Only little less then 50.5 mg/cm^2 for the whole set: Shroud +backing cloths. So what?\nYes, the Fee-Waters & Jull has the proper density. But it had never been carbon-dated (so the results of Damon et. al NOT neccesarily may apply there, that means WE DON’T know its true age). Have you ever considered the possibility that this is NOT a patch, but ORIGINAL part of the cloth?\nHugh: “Finally, I suspect that shroud cloth has local density variations all over. They are artefacts of the properties of the original hanks of thread of which it is made, and do not indicate patches of interweaving.” \nThey may be undistinguishable from patches for a naked eye, without proper scientific examination.\nIf you had not read this already:\nhttp://www.shroud.com/pdfs/chronology.pdf\nand Addendum:\nhttp://www.shroud.com/pdfs/addendum.pdf\n\n","date":"August 11, 2013 at 1:59 pm","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-40981","author":"O.K.","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"Sorry, I missed your last post as I was writing the one above. I fear I can’t agree with your statistics. It may be however, that I misunderstand your point, or possibly you misunderstand mine. I have never claimed that the distribution statistics say anything about the proportion of any adulteration, but before we can speculate about an admixture of different materials, we must first decide whether the dates are in anyway meaningful, and of course they are. If they are completely meaningless, then we don’t need to speculate about patching or interweaving, we can simply say they’re wrong, no better than guesswork, and give us no information about the date of the shroud. However, the thrust of Benford, Marino, Rogers and your own argument is not that the dates are meaningless, but that they represent adulterated cloth. I agree that the distribution statistics of the dates say nothing about the proportion of any adulteration, but they do clearly indicate that the result of the adulteration, if any, gives a 13th-15th century date.\n\n","date":"August 11, 2013 at 2:00 pm","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-40982","author":"Hugh Farey","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"Crossed again! Yes I’m familiar with those documents and do not deny the possibility that some parts of the shroud are not original. I just don’t think that the evidence adduced for it at the C-14 area is convincing.\n\n","date":"August 11, 2013 at 2:06 pm","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-40983","author":"Hugh Farey","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"Hugh, I don’t want to prove that this area was patched. I only want to show that patch hypothesis cannot be so easily rejected, as those who defend C-14 dating claim. Relying mostly on Flury-Lemberg’s opinion. \nWe can end this discussion at this point, if you want.\n\n","date":"August 11, 2013 at 2:12 pm","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-40987","author":"O.K.","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"Good idea. But thank you very much for introducing me to your own website!\n\n","date":"August 11, 2013 at 2:25 pm","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-40988","author":"Hugh Farey","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"\nRichard Savage :\n– I had never seen the “deeper” possibility discussed.  Can you refer me to something?\n\nNo. Just my thinking.\n\n","date":"August 13, 2013 at 10:28 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-41190","author":"O.K.","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"– So far, the banding seems to preclude the reweave hypothesis…\n– The “deeper” idea seems reasonable to me, but since it seems that none of the experts (except OK) has mentioned that as an explanation, there is probably a good reason not to.\n– Any one have any suggestions re “deeper” or otherwise?\n\n","date":"August 13, 2013 at 12:27 pm","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-41196","author":"Richard Savage","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"\nRichard Savage :\n– So far, the banding seems to preclude the reweave hypothesis…\n\nRichard, of course I wanted to say:\n“BTW: the bandings go UNINTERRUPTED from the main cloth to he side strip, but WE KNOW that the side strip was carefully re-attached to the main cloth. So perhaps it is possible.”\nSo IMHO it does not preclude reweave.\nRichard read this: \nhttp://www.shroud.com/pdfs/chronology.pdf\nand Addendum:\nhttp://www.shroud.com/pdfs/addendum.pdf\nThere you find more info. I’m getting a little bit tired of this discussion.\n\n","date":"August 13, 2013 at 2:08 pm","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-41201","author":"O.K.","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"OK,\n– Sorry to keep after this issue, but\n1) I don’t really understand how   “BTW: the bandings go UNINTERRUPTED from the main cloth to he side strip, but WE KNOW that the side strip was carefully re-attached to the main cloth. So perhaps it is possible.”   supports a potential reweave in the sample area.  And,\n2) I have read the two papers you site (more than once), but don’t see them explaining how a reweave wouldn’t interrupt the banding.  I’ll go back and look harder.\n— Rich\n\n","date":"August 13, 2013 at 4:19 pm","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-41212","author":"Richard Savage","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"My argument is that if the side strip had been re-attached to the main cloth, in the way that the bandings go uninterrupted from main cloth into it, so perhaps reweaved part with the same weave as the original cloth (but consistng of the mix of new nad old threads) could be reattached to it without interrupting the bandings.  But that’s just my observation, and better don’t refer to me.The side strip is attached with stichings, and several possible seams have been reported in the C-14 area -you have them in the papers I presented.\nBTW: Uninterrupted bandings argument is probably taken form this paper by Jackson http://www.shroud.com/pdfs/jackson.pdf He is presenting there an alternative (IMHO less plausible) theory of C-14 error, and from obvious reason he wants to dismiss other competing theories like reweaving. But sceptics very often take out of context this one particular sentence from Jackson’s paper, to prove that C-14 dating was correct.\n\n","date":"August 13, 2013 at 4:50 pm","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-41214","author":"O.K.","site":"shroudstory"},{"title":"How can any true scientist unconditionally defend the C14 dating?","post":"OK,\n– Thanks again.\n– So far, the “deeper” idea is my best hope for explaining the banding without discarding the reweave theory.  Though, I actually use the idea in a second way…\n– Perhaps, the reweave was done in such a way so as to not disturb the banding — like the reweave was simply done on top of the original material.  I’m sort of “reaching” here, but it’s the best I can do. \n– Anybody else have a potential explanation for the banding apparently continuing through the sample area?\n— Rich\n\n","date":"August 15, 2013 at 9:22 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","id":"comment-41337","author":"Richard Savage","site":"shroudstory"}]
