[{"title":"Important New Paper on the Carbon Dating Samples","post":"“This paper came out of an online conversation with Joe Marino and Paul Maloney, with additional input from Bill Meacham, Professor Emanuela Marinelli and Barrie Schwortz. I am deeply indebted to them for sharing their knowledge, wisdom and advice.”\nAll the people who shared their knowledge, wisdom and advice  are fully convinced that the Shroud is authentic. Where is the objectivity , the impartiality, the neutrality ?\n\n","date":"December 9, 2015 at 4:50 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-215965","author":"PHPL","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Where indeed, PHPL?  What we see here, yet again, is a parody of the scientific method. These people clearly never read something I came across years ago. It went something like: “When a scientist arrives each morning at the lab, he hangs his preconceptions along with his hat on the hook by the door.”\n\n","date":"December 9, 2015 at 4:59 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-215966","author":"Colin Berry","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Exactly like the the pro global warming scientists do ( not  )\n\n","date":"December 9, 2015 at 12:09 pm","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216023","author":"Paul","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"So people who believe the Shroud is authentic are not allowed to present new facts and develop an existing theory?  And can’t advise someone who independently advocates the theory?  But people who doubt the Shroud’s authenticity are allowed to go to their labs each morning and put forth their views and don’t have any preconceptions?  The fact that the data is not even alluded to is telling.\n\n","date":"December 9, 2015 at 5:48 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-215969","author":"Joe Marino","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"I should also point out that the late Ray Rogers had a preconception that I and my late wife were part of the “lunatic fringe.”  He thought he was going to disprove our theory in 5 minutes.  In fact, he was embarrassed that he ended up agreeing with us.  He changed his mind because that’s where the data led him.  That’s the scientific method at work.\n\n","date":"December 9, 2015 at 6:30 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-215974","author":"jmarino240","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Shame that the gifted (if occasionally over-zealous) Ray Rogers chose to test out those contamination ideas using misappropriated threads from the off-camera sampling, ones with a missing chain of custody, with the final credulity-stretching claims, notably that of the claimed ‘end-to-end-splicing’ of threads as a pre-microscope era repair mechanism. Why did he not write around, asking for leftover samples of whole fabric, as we know existed (like the Arizona one that BarrieS photographed)? Why did he submit his so-called “peer-reviewed” paper to his “own” journal, Thermochimica Acta, the one he helped found, with a Rogers paper in the very first issue, one on which he served for years on the editorial board?\nThere should never be the slightest hint of subterfuge OR agenda-embroidering in honest-to-goodness science. Science is tainted enough in the modern world without “religion” getting in on the act.\n\n","date":"December 9, 2015 at 6:56 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-215975","author":"Colin Berry","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Colin Berry, like this writer, has never had access to threads of the Shroud at anytime. Because of his predisposition against authenticity, all he can do is hurl invective against the scientists who did in fact have such access and those who have built on their work.\nI do not expert that Colin has ever attended a Shroud conference lest he be contaminated with personal contact with the individuals who now accuses of examining “misappropriated” samples (i.e. stolen). He is a very frustrated man who apparently can not adjust to the fact that there are others who disagree with him so he spends much of his dialogue picking at the reputations of those now unable to defend themselves.\nEvery time I read one of his posts I can’t help but think of Rumpelstiltskin’s tantrum when the queen reveals his name.\n\n","date":"December 9, 2015 at 7:35 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-215984","author":"John Klotz","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"“…he spends much of his dialogue picking at the reputations of those now unable to defend themselves.”\nYes, it’s most inconsiderate of those STURP team members to popping off as they do from their mortal coils, making it impossible to criticize them pre-mortem, so to speak.\nI’m 71. Those who want to criticize me in vivo, for fear of being condemned in years to come by the sensitive John Klotz’s of this world, should endeavour to get their shots in while they can, since what I see in the mirror each morning when shaving does not augur well for intimations of immortality.\n\n","date":"December 9, 2015 at 8:00 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-215988","author":"Colin Berry","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"For those willing to consider others’ opinions about Rogers’ reputation, please see http://shroud.com/pdfs/stlschwortz2ppt.pdf\n\n","date":"December 9, 2015 at 7:55 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-215987","author":"Joe Marino","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Your attempt to post under a new anonymous pseudonym hit the buffers, Joe, the obstacle in question being the WordPress software. First time postings under a new ID get held up for approval by the site’s host.\nPersonally, I prefer you as Joe Marino. The title “shroudie 1” should be an elected one, not self-awarded.\n\n","date":"December 9, 2015 at 8:57 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-215990","author":"Colin Berry","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"You simply don’t know what you are talking about. I was out and about when the posting arrived on my cell phone; someone calling himself shroudie1 made a constructive comment.  I approved it.  It turns out that it was Joe Marino accidentally using a moniker that he uses for other purposes.  He also posted the exact same message under his real names when he saw the mistake he made, thinking that that had fixed it.  He didn’t see what I was doing and I didn’t see what he was doing.  As soon as he saw the problem, sometime later, he emailed me asking me to fix it.  I did so.  \nAs for calling himself shroudie1.  So what?  You went about calling yourself sciencebod. So what?  And if it had been sciencebod1 would anyone have objected? No, of course not. I have a neighbor with a vanity licence plate that reads VIETVET1. So what?  \nColin, you are so busy half the time looking for what is wrong in other people that you go about imaging things that just aren’t true. \nBTW: There is another person using the nickname Joe.  It is not Joe Marino, who to my way of thinking is and should be voted shroudie1.  He deserves it.\n\n","date":"December 10, 2015 at 4:03 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216103","author":"Dan","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"I have nothing further to say on the subject of  shroudie1, the alter ego of Joe Marino. \nComparisons with my use of the sciencebod login are totally irrelevant, and indeed I strongly resent the comparison. Sciencebod was the name I coined for myself when setting up a site with a related name (“Science Buzz)”) but from the word go I revealed my true identity on the short bio which appears to this day on the home page:\nColin Berry, aka sciencebod, is a retired PhD researcher/teacher/academic who has worked in industry, medical schools, schools, food and biomedical research (mainly in the UK, but also in W.Africa and the United States). He’s best known for his work on RESISTANT STARCH, recently described as “the trendiest form of dietary fibre”. See also his specialist Shroud of Turin blog on http://www.shroudofturinwithoutallthehype.wordpress.com with over 200 postings to date.\n\n","date":"December 10, 2015 at 4:34 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216109","author":"Colin Berry","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"I, and I think, Mario, were the only ones who were knew who exactly was posting as “Joe”. I commented on this earlier.\n\n","date":"December 13, 2015 at 10:51 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216401","author":"Louis","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Thanks Pam, that’s a paper that has to be studied in depth.\n\n","date":"December 9, 2015 at 7:09 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-215979","author":"O.K.","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"It should be fairly easy to see if the dye has only been applied to the cotton. First pick out the cotton from the linen- not a very difficult task if it was used in a reweave and then see if the extent of the dye can be linked to it . . . .\n( I don’t see why the invisible weavers would have used cotton for the reweave that they would then have had to dye- who not repatch with linen and dye that?\nbut this is not my subject- I prefer to keep to documented relic routes!).\n\n","date":"December 9, 2015 at 7:26 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-215981","author":"Charles Freeman","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"“Thirdly the purpose of the dye and the additional cotton was to make the corner look like fire and water damage. The cut area has a similar colour to the fire and water damage immediately to its right although it was not damaged by fire in 1532.”\nHow can Pam Moon be so certain that the coloration “made to look like fire damage” was not in fact fire damage?  All 4 corners of the TS in Shroud Scope look as though they may have been lightly scorched by fire, which is not to say they were, merely that any thoroughgoing investigation of yellow-brown coloration would and SHOULD have addressed that possibility in detail, instead of inserting those dismissive final few words  Does anyone have a uv fluorescence photograph to hand of the entire TS, corners included?\nIncidentally, I posted yesterday the first of 3 postings on my own uv investigation of model imprintings by one or other thermally-assisted process.\nhttps://shroudofturinwithoutallthehype.wordpress.com/2015/12/08/shroud-of-turin-performance-characteristics-of-a-simple-uv-lamp-chosen-to-check-out-claims-that-are-dismissive-of-thermal-imprinting-mechanisms-part-1-of-3/\n\n","date":"December 9, 2015 at 7:31 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-215982","author":"Colin Berry","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"I assure you it was not an attempt to post under a new anonymous pseudonym, it was simply an error in filling out the boxes.  I posted that message under my own name, so why would I intentionally post the same message under an anonymous pseudonym?  What this does show, however, is that you have made an unfounded assumption.  For some, that could be a factor when they try to evaluate your scientific assertions.  Regarding “shroudie1,” I doubt if anyone would want to be awarded such as label, as it is somewhat a derisive term.  And the 1 has nothing to do with primacy–I chose a number as part of the string and 1 was as convenient as anything.  Whatever your talents are as a scientist, omnipotence is not one of them.\n\n","date":"December 9, 2015 at 9:17 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-215993","author":"Joe Marino","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Had your “shroudie1” comment not have been expeditiously removed, I could have used the two different time stamps and reverse-order of appearance under Recent Comments to show there were no “unfounded assumptions” on my part, that you had posted first as shroudie1, and then, finding it had not appeared, re-posted under your real name. But as I say, the hard evidence has been wiped, so I shall simply repeat that you were rumbled, not by someone making “unfounded assumptions” but one who is simply observant, who likes to tell things the way they are, and  who is curious to know why you would need to have adopted a new pseudonym in the first instance – but seemingly got caught out by the system.\n\n","date":"December 9, 2015 at 9:36 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-215997","author":"Colin Berry","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"I find your comments insulting.  When I reposted the 2nd time, I actually was going to insert “Apologies if this gets posted twice, I tried posting it before and it didn’t see it.”  Then I removed those 2 sentences, figuring that the first one wasn’t going to go through, even though I didn’t know why,  I didn’t even realize I had filled out the boxes wrong on the 1st one.  You’re incredible.  I’ll say it again–I made no intentional effort to adopt a new pseudonym.\n\n","date":"December 9, 2015 at 9:52 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-215999","author":"jmarino240","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"There’s nothing insulting about pointing out two identical comments appearing in my email inbox, the first at 12:55 from Joe Marino, the second at 13:46 from shroudie1, and finding BOTH those shown briefly under Recent Comments.\n  The new monicker shroudie1 was not a typo, you chose it, and you chose it for use on a site where you have commented many times previously. (I was particularly amused by the one back in Spring that said my researches had reached a dead end, and that I should look to miraculist explanations). I was less amused by your organizing a Shroudie conference last year that made no provision whatsoever for question/answer sessions, considering that to be a travesty of a conference, allowing daft viewpoints to go unchallenged.\nAs I say, I just tell things the way I see them, and I clearly see things different from you. Good day to you.\n\n","date":"December 9, 2015 at 10:08 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216000","author":"Colin Berry","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"This will be my last comment on this.  What’s insulting is that you keep insisting I was attempting to post a new anonymous pseudonym when I’m telling you I did not.  Why on earth would I do that in a string when i had already posted under my own name?  I may have gotten things confused but I’m not trying to pull the wool over anyone’s eyes. Your comment about me saying you should look to miraculist explanations is not accurate portrayal of the exchange.  Regarding the lack of a question and answer session, I’ve told you several times it was simply a matter of having too many presentations to have time for Q & A.  We made provisions for a post-conference online forum for people to ask questions to the speakers, through which much more could be accomplished than a 10 or 15 minute question and answer session.  You may tell things the way you see them, but that doesn’t make them right.\n\n","date":"December 9, 2015 at 10:27 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216002","author":"jmarino240","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"“Joe” is YC. He hás the protection of Shroud.com and. unfortunately, also Dan’s. There are double standards at work hére and I don’t see how what góes on here will be interesting to posterity.\n\n","date":"December 9, 2015 at 3:04 pm","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216039","author":"Louis","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Joe is YC, agreed. Joe Marino is not Joe.\n\n","date":"December 9, 2015 at 3:30 pm","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216041","author":"David Goulet","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"So, do you think this is correct? I am asking you because you you have at times taken on the role of judge here.\nOn my part I have not changed my views. See the first three paragraphs:\nhttps://www.academia.edu/8841978/Professor_Giulio_Fanti_discusses_the_controversies_in_the_realm_of_Shroud_studies\n\n","date":"December 9, 2015 at 4:17 pm","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216051","author":"Louis","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Judge? Well my confirmation name is Samson. :)  I think the realm of Shroud studies is indeed so contentious, at a personal level, that indeed ‘the powers that be’ have no interest to stir the pot further with new testing. But if the world can’t see Christ in the actions of those of us who call ourselves His followers, I doubt they’d see Him in the Shroud even it was proved authentic.\n\n","date":"December 10, 2015 at 9:40 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216126","author":"David Goulet","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Jesus said..,.. the secret lies there.\n\n","date":"December 10, 2015 at 9:45 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216127","author":"Louis","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"To Joe Marino:  I agree except that if the term shroudie1 is an honor, you deserve it in my book.\n\n","date":"December 10, 2015 at 4:06 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216105","author":"Dan","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"colin!…couldn’t stay away huh?\n\n","date":"December 9, 2015 at 10:37 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216006","author":"rick","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Correct. As it happens, I was away for some 2 months, putting up NO new postings on my own site, while tacking extra thoughts onto that last posting. But Diligent Dan tracked those tail-end addtions, making some of them the subject of new postings on this site. They inevitably attracted comments, not all them charitable or even fairminded, so one occasionally has to abandon the rest cure, returning to correct the record.\nIn any case it makes no sense to remain in splendid isolation indefinitely. No man is an island.\nThere’s another thing I could mention: I don’t think folk appreciate the subtlety of the imprint left on linen by toasted white flour AFTER washing with soap and water. It may be as subtle if not more so than Di Lazzaro’s laser-beam colorations, but with an important difference – I have images, which are negative, 3D enhancible, matching some if not all of the peculiar microscopic properties of the TS.  It’s especially irritating to see folk repeatedly claiming that no one has come close to reproducing the TS body image when they clearly can’t be bothered to keep up with new developments. It’s understandable they should miss what’s on my site with its low-to-middling  Google ranking. It’s harder to forgive them for turning a blind eye to what appears on this site, sitting as it does at the top of page 1 Google returns for (turin shroud).\n\n","date":"December 9, 2015 at 11:02 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216011","author":"Colin Berry","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Pam Moon has asked me to post the following:  \n“‘Thank you Dan for presenting the work so beautifully and drawing people’s attention to it.  And thank you to those who have read the paper.  I realise I have omitted one important thank you, which is to Donna Campbell.  When I showed her Barrie’s Arizona images she said that the Shroud fibres looked “too orange.”  It was that thought that allowed me to understand some of the problems of colour in Figure 1 (page 3) after Joe sent the image. \nThe question why the Shroud was dyed is an interesting one.  But it is the speculative end of the paper: at present I am waiting for bloggers and Shroud experts to find the hard science that refutes the dye theory; if such science exists.  Thanks again to all who have taken the trouble to read the paper.’\n\n","date":"December 9, 2015 at 10:55 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216010","author":"jmarino240","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Was there any dye on the cotton fibres found on the Oxford and Arizona samples? I have never read that there was.\nI wish that someone would actually reproduce what they think tHe Shroud sample is made up of, how  much cotton, how much linen, whether this was original or added, what was dyed or coloured, the whole sample or just part of it, and then set out a scenario which brings us to the carbon date which, for those who think the Shroud is first century, needs quite a difficult combination of textiles of different dates to arrive at. Anyone prepared to have a go? .\n\n","date":"December 9, 2015 at 11:39 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216020","author":"Charles Freeman","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"P.s. Has anyone related the ‘frosty’ surface to the presence of calcium carbonate found by STURP ?\n\n","date":"December 9, 2015 at 11:41 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216021","author":"Charles Freeman","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Have you read:\n“Talks on Natural Dyes and\nNatural Fibres” by\nTeresinha Roberts ?\nLink:\nhttp://www.teresinharoberts.co.uk/Talks/talks.html\n— — —\nI have found an example of a short piece\non the need to use appropriate tools of\ninvestigation (= microscopes!)…:\n>… If you look at a yarn dyed with madder under\nthe microscope, you will see a subtle variation of colour.\n>A yarn dyed with the synthetic equivalent of madder\n(alizarin and purpurin) does not have this wealth\nof colour variation and looks much more uniform. …\nLink:\nhttp://www.wildcolours.co.uk/html/natural_dyes_comparison.html\nApart the old “Summary of Raes observations.doc.\nRaymond N. Rogers: 1st October 2001.”\n[…that appears in “Appendix I”]\nI have not yet found particular words describing\nthe use of microscopy nor colorimetric tools…\nBut (perhaps) I am only hasty in my previous\nfast search…\nThen I’ll try late, probably tomorrow…\nwhen I’ll better with my teeth (unfortunately\nthis morning the dentist has extracted one\ntooth that seemed enough healthy at its\nroot, but rather destroyed at the top …).\nPerhaps this “forced physical environment”\nmakes me rather acid and aggressive in\nthis comment on a new useful paper.\nIn other words:\nit’s a poor comment like that of\nan “angry black guy” because,\nin my opinion, that dental work\nis not yet  finished: there is the lack of\ncare for the lateral tooth, near that extracted…\nSo… unfortunately\nI show a distinct change in focus, due\nto my (hasty) consideration of how can be\nof little weight certain (perhaps interesting)\nconsiderations without the support of\nstrong instrumental evidence.\nI would really like to stop here with this\ndisgraceful whining on a paper that,\napparently, doesn’t seem to consider\nthe hypotheses of Adrie van der Hoeven…\n\n","date":"December 9, 2015 at 11:15 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216013","author":"piero","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Did anyone else notice that much of the thread above, with only a few exceptions, had practically nothing to do with the substance of Pam Moon’s paper, and that respondents could hardly avoid being entrapped by this ploy?  In military terms, I think it’s called “diversionary tactics”!  There’s a lot of it about!\n\n","date":"December 9, 2015 at 1:12 pm","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216035","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"I love a detailed, well-presented, well-illustrated paper like this, even if I disagree with it! I think Pam has argued her case as well as possible, and I like the reconstructions of the radiocarbon corner (so similar to my own, dear reader, as you will recall…)\nHowever, among the throwaway remarks upon which some of the rest of the paper depends is this, in the second paragraph of page 2: “The Holland cloth at A was covered by a patch (see detail) which had been removed before this photograph was taken.” I don’t believe this is true. I have never heard that a patch was sewn on over the Holland cloth between 1978 and 1988, and the X-Ray photos of 1978 most definitely show no patch, so where did that idea come from?\nThe second paragraph of page 4, and an accompanying illustration, drags in the Quad Mosaics again. “There is a density of colour in the fabric taken for radiocarbon date in Barrie Schwortz’s image and the unusual dark green in the corner of the Quad Mosaic is not seen elsewhere on the Shroud.” Actually the unusual dark green is seen in almost every corner of each of the four mosaics, or at least a colour so similar that a picture of the dorsal torso was mistaken for the picture of the ventral legs in a documentary devoted to that very subject.\nPart of the point of the paper is that a dye was rubbed onto the ‘mended’ Shroud in order to match the colours. Well it was a pretty poor shot, wasn’t it, since the dye is, according to both Rogers and Pam, so conspicuously different from the cloth it was supposed to emulate.\nAt the top of page 6 Rogers is quoted as saying, “17) The colored encrustation does not seem to stick to linen as well as cotton. Some linen fibers appear to be nearly clean, but the cotton fibrils can be heavily encrusted in the same thread sample. This suggests that the cotton was added to the Raes threads to make dyeing possible. The cotton in the threads would have made color matching easier. Linen is difficult to dye or stain.” I think this last sentence is naive. Dyed linen is perfectly common. Linen may be more difficult to dye than cotton, but that’s a relative term. Furthermore, ‘encrustations’ are not evidence of dye. Dye, as Teresinha Roberts points out on page  10, is irrevocably bonded to the fibres of the material being dyed. Encrustations are easily removed.\nThe bottom of page 6 shows one of the Raes threads, which, it is claimed “is a splice of linen and cotton held together with a terpene crust.” I don’t think this is the same thread which Villarreal claimed was that. Either way, it is not a splice but an end-to-end joint, which has no structural strength whatever. “One end of the yarn is a different colour to the other.” I disagree. I think the colour here is an artefact of the lighting.\nOn page 2 and page 7 Pam notices that the dye has penetrated both the radiocarbon corner and the Holland cloth adjacent and underneath it. This is in contradiction of Rogers’ Thermochimica Acta paper, page 191, “There was absolutely no coating with these characteristics on either the Holland cloth or the main part of the shroud.” It was this observation that led me to abandon a hypothesis I put forward almost two years ago, on this site (Cat among the Pigeons, 14 Jan 2014): “Disappointingly, I cannot find a picture of the radiocarbon corner, including the backing cloth, taken after the sample was cut, but before the Holland cloth was replaced. Can anyone help? [I found one later – the ones Pam uses.]\nBecause I predict (dangerous), that the area that had been concealed under the radiocarbon sample area will be as white as the area that had been under the Raes sample area.\nHow to explain this? Was something smeared over that corner, and, for that matter, the burn holes as well, after the shroud had been stitched to the Holland cloth, to try to make the colours more uniform? Did it include a mixture of madder root dye and gum arabic? And was it applied with a cotton pad? Are shreds of cotton, dyed with madder and glued down with gum arabic, found along the edges of the shroud adjacent to the Holland cloth – including the edges of the burn holes?\nIt’s new, it’s revolutionary, and you read it here first, folks!”\nLater on page 10, Rogers is quoted as saying that: “Ray Roger’s experiments with fibres from the Raes sample showed that the dye was removed with 6N HCl and the gum with concentrated HCl. The processes from Arizona, Oxford and Zurich are reproduced below and none of the laboratories used sufficient concentration of HCl to remove the dye or the gum.” While the above is perfectly true, Rogers also said that the gum was soluble in water, and all the cleaning processes used by the three laboratories were certainly capable of doing that.\nFinally, it is implied that the dye could have substantially affected the radiocarbon date. (e.g. page 1: “The dye which was not removed by the pre-cleaning of the samples invalidates the carbon date results.” Well, no it doesn’t. It may slightly affect the radiocarbon results (and according to Ray Schneider’s St Louis presentation it makes the Shroud appear older than it actually is), but it certainly doesn’t invalidate them.\nAll this from a rather quick first reading of the paper. Goodness me!\n\n","date":"December 9, 2015 at 5:22 pm","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216063","author":"Hugh Farey","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"HF:  “Part of the point of the paper is that a dye was rubbed onto the ‘mended’ Shroud in order to match the colours. Well it was a pretty poor shot, wasn’t it, since the dye is, according to both Rogers and Pam, so conspicuously different from the cloth it was supposed to emulate.”\nA little specious on that argument.  There’s an even chance that when the dye was applied, that it in fact DID match the cloth.  The colors could very well have progressed unevenly in their fading.\n\n","date":"December 10, 2015 at 11:38 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216139","author":"Nabber","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"HF, thanks for your “expert” comments on dyes:  ” Linen may be more difficult to dye than cotton, but that’s a relative term. Furthermore, ‘encrustations’ are not evidence of dye.”\n“Defects Caused by Deposits and Encrustations on Fiber” by Karl Mahall.\n(Springer Link)\nAbstract:\n“Oils, greases and waxes which are not removed before dyeing can cause reserving and, as with sizing residues, lead to dyeing unlevelness.  Precipitated dye or UNDISSOLVED DYE PARTICLES cause dye stains. Inappropriate finishes lead to the FORMATION OF CHALKY MARKS when the fabric is scratched.”\nLime deposits are mentioned as types of encrustations.\n\n","date":"December 10, 2015 at 11:56 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216142","author":"Nabber","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Two reasonable points, to be fair. The dye may have darkened, or the linen lightened, over the centuries. The former, I think, more likely than the latter, as there seems to be some concern that the linen may come to be the same colour of the image eventually, obscuring it altogether.\nAs for the encrustations, I should have been clearer. Once dyed, the dye is part of the cloth and cannot be removed. Any encrustations, including undissolved bits of dye, mordant or whatever, are not bound to the cloth and are easily removed by theradiocarbon cleaning regime. Encrustations may be evidence of dye not dying, if you like; they are not evidence that the cloth has received the dye.\n\n","date":"December 10, 2015 at 12:23 pm","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216145","author":"Hugh Farey","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"an high wax content gives a characteristic\nluster to linen fibers\nSo…\nI believe you have to investigate what was the kind of retting used for that linen material.\nI have never seen appear reasonable\nspeeches, based on accurate data obtained\nfrom the control of the luster of the fibers of the\nHoly Shroud … in comparison to the type of possible retting used to obtain this old material\n(See also : … papers with related experiments).\n\n","date":"December 10, 2015 at 12:51 pm","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216151","author":"piero","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Hugh, this is why you are easily my favorite Shroud skeptic. Your post are thoughtful, and address the data/points made directly. The same can not be said for many Shroud skeptics, some on this blog.\n\n","date":"December 12, 2015 at 10:27 pm","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216353","author":"Matthew L","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Matthew, I agree.\n\n","date":"December 13, 2015 at 8:24 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216379","author":"jmarino240","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"At the CIA headquarters in Langley, there is a wall of gold stars each one signifying an anonymous CIA agent who lost his/her life in service of the country but can not be identified publicly. \nIn my mind I envision a wall of honor for the Shroud community and there are several people who have earned a star who are no longer with us. Just a few of the many I could name: Frs. Rinaldi and Otterbein, Ray Rogers, most of the STURP team who are now deceased and of course, without doubt, Sue Benford who in fact pioneered the repair theory. \nIn US professional sports there are annual Most Valuable Player awards. I have remarked to Barrie Schwortz that the Shroud MVP for 2014 was Pam Moon who actually pried the photograph of the Oxford sample from Oxford for   examination by an expert on linen who found the evidence of repair. In fact, the Oxford sample photo debunks the statement of Mechitld Fleury-Lemberg’s statement that Shroud was the same all over. \nAs a matter of fact there is in Portugal a copy of the Shroud with pieces of the Shroud of Turin in each of the four corners. The pieces were essentially a part of the dowry of the Savoy Princess who became Queen Margaret of Portugal. [There was a TV production which described Mary Tudor as becoming “Queen Margaret of Portugal” but that was in error].\nThere were peer reviewed papers published by Sue Benford and Joe Marino while Sue was alive. The last one was published in Chemistry Today in 2008. https://www.shroud.com/pdfs/benfordmarino2008.pdf Sue passed away on Monday of Holy Week 2009.\nNo one, living or dead, should be beyond critique of their scientific work. However, Pam Moon’s work based upon expert examination of Oxford’s photograph of its sample prior to its destruction ought to have settled the issue of mending in the sample area. Pam is very much alive. Her most recent papers can be found at:\nhttp://www.shroudofturinexhibition.com/Shroud_of_Turin_exhibition/MIssing_corners_theory.html\nhttp://www.shroudofturinexhibition.com/Shroud_of_Turin_exhibition/Three_threads_files/BL%20Sebastian%20for%20website%201.pdf\nAt the CIA headquarters in Langley, there is a wall of gold stars each one signifying an anonymous CIA agent who lost his/her life in service of the country but can not be identified publicly. \nIn my mind I envision a wall of honor for the Shroud community and there are several people who have earned a star who are no longer with us. Just a few of the many I could name: Frs. Rinaldi and Otterbein, Ray Rogers, most of the STURP team who are now deceased and of course, without doubt, Sue Benford who in fact pioneered the repair theory. \nIn US professional sports there are annual Most Valuable Player awards. I have remarked to Barrie Schwortz that the Shroud MVP for 2014 was Pam Moon who actually pried the photograph of the Oxford sample from Oxford for   examination by an expert on linen who found the evidence of repair. In fact, the Oxford sample photo debunks the statement of Mechitld Fleury-Lemberg’s statement that Shroud was the same all over. \nAs a matter of fact there is in Portugal a copy of the Shroud with pieces of the Shroud of Turin in each of the four corners. The pieces were essentially a part of the dowry of the Savoy Princess who became Queen Margaret of Portugal. [There was a TV production which described Mary Tudor as becoming “Queen Margaret of Portugal” but that was in error].\nThere were peer reviewed papers published by Sue Benford and Joe Marino while Sue was alive. The last one was published in Chemistry Today in 2008. https://www.shroud.com/pdfs/benfordmarino2008.pdf Sue passed away on Monday of Holy Week 2009.\nNo one, living or dead, should be beyond critique of their scientific work. However, Pam Moon’s work based upon expert examination of Oxford’s photograph of its sample prior to its destruction ought to have settled the issue of mending in the sample area. Pam is very much alive. Her most recent papers can be found at:\nhttp://www.shroudofturinexhibition.com/Shroud_of_Turin_exhibition/MIssing_corners_theory.html\nhttp://www.shroudofturinexhibition.com/Shroud_of_Turin_exhibition/Three_threads_files/BL%20Sebastian%20for%20website%201.pdf\nOn Shroud.com there is an article by this writer which criticized the presentation of the Shroud in its “Finding Jesus” series. http://www.shroud.com/pdfs/klotzcnn.pdf Included are several illustrations including pictures of threads from the repair area at upwards 3000 dpi resolution.\n\n","date":"December 10, 2015 at 6:55 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216117","author":"John Klotz","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Klotz: “… the Savoy Princess who became Queen Margaret of Portugal”. Can you provide more details? I only find a Margaret of Savoy, Vicereine of Portugal (1589-1655):\nhttps://en.wikipedia.org/wiki/Margaret_of_Savoy,_Vicereine_of_Portugal\nAnd where is this copy of the Shroud?\n\n","date":"December 10, 2015 at 12:44 pm","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216150","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"“Pam Moon’s work based upon expert examination of Oxford’s photograph of its sample prior to its destruction ought to have settled the issue of mending in the sample area.” Indeed it did. There isn’t any.\n\n","date":"December 10, 2015 at 1:14 pm","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216155","author":"Hugh Farey","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Pam Moon has indicated to me that she will periodically be updating the paper as she gets new information.\n\n","date":"December 10, 2015 at 11:22 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216136","author":"Joe Marino","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Joe:\n>…she will periodically be updating the paper as she gets new information.\nThis is an useful information.\nI think I would have avoided writing my speech tinged\nwith “persecutory paranoia” (and madder…) if this very simple\ninformation had appeared before!\nI love detailed, well-presented, well-illustrated papers…\nI hate disorganized speeches…\nSorry.\n\n","date":"December 10, 2015 at 12:17 pm","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216144","author":"piero","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Pam Moon has asked me to post the following:  “”The paper has been revised and is resubmitted: http://shroudofturinexhibition.com/Shroud_of_Turin_exhibition/Dye_and_radiocarbon_date_files/Dye%208th%20Dec%20spectroscopy.pdf.\nI would like to thank blog contributors for their helpful advice. I apologise for writing that there had once been a patch – thank you Hugh.  I had omitted one of the key aspects of Ray Rogers’ work – spectroscopy.  That is now included in the review of his findings.”\n\n","date":"December 13, 2015 at 8:22 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216377","author":"jmarino240","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Joe, have I understood you correctly? Have you given up the patch (invisible reweaving) hypothesis?\n\n","date":"December 13, 2015 at 8:26 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216380","author":"Louis","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Louis, No.  Pam wrote “As there is strong evidence for dye in the radiocarbon date material it is worth exploring reasons for the presence of dye. This can only be speculative as there is no\ndefinitive explanation.\nThe most obvious answer is that additional cotton material was added to the corner and dyed to cover up the colour difference. There is significant textile evidence\nof the use of invisible reweave presented by Sue Benford and Joe Marino.28 Donna Campbell reported that the Oxford photographs may direct research toward ‘the\neffects of mends on the sample.’29 Therefore cotton was added to the corner and then the whole area was painted with dye to make a continual colour. Secondly,\nthe linen needed dyeing for a different reason and cotton was added to the corner to make that dyeing and colour matching easier. Rogers alluded to that:\n17) The colored encrustation does not seem to stick to linen as well as cotton. Some linen fibres appear to be nearly clean, and the cotton fibrils can be\nheavily encrusted in the same thread sample. This suggests that cotton was added to the Raes threads to make dyeing possible. The cotton in the\nthreads would have made color matching easier. Linen is difficult to dye or stain. 7\nThirdly the purpose of the dye and the additional cotton was to make the corner look like a different part of the Shroud: ‘the object must have been to match\ncolours.’7 The cut area has a similar colour to the fire and water damage immediately to its right although the corner was not damaged by fire in 1532. If the corner\nwas removed because of bacterial damage following the use of douse water and the linen was bleached to kill the organisms damaging the Shroud then dyeing the\narea was a very effective cover up. Fourth, a combination of all three of the above.” And finally, “Consequently, as Rogers wrote: ‘the radiocarbon sample can not be valid for dating the time at whichthe cloth was produced.’24\n\n","date":"December 13, 2015 at 8:45 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216385","author":"Joe Marino","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Thanks, Joe. I queried you because of my article on the research that you and Sue Benford conducted, posted on your homepage and elsewhere.\nProfessor Giulio Fanti mentioned a possible thirteenth-century patch in my interview with him, which you must have read. I think dates are important because more than one person seems to have made repairs on the Shroud.\n\n","date":"December 13, 2015 at 9:05 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216388","author":"Louis","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Hi Joe; and thank you for taking my comments seriously. However, I would still like a couple to be addressed, especially the one about Rogers insisting that there was no dye or gum on the Holland cloth. As you know, I originally attributed Rogers’s ‘dye’ not to any attempt to match new Shroud fibres with old, but to match the Holland cloth to the Shroud, just in the corners where pieces of the Shroud had been cut off, and possibly, although I don’t know how to check this, where it was visible through various unpatched holes. The dye, I thought, might have been smeared on, and some of it smeared onto the Shroud itself. But Rogers was quite positive that there was no dye on the Holland cloth. Pam’s paper suggests that she disagrees with this. It may be that Rogers only looked at Holland cloth threads from underneath the Shroud (the Raes corner in particular), where no dye had made contact.\nThe other point is that although the gum was hydrolysed by concentrated HCl, it did not require hydrolysis to remove it; water was entirely sufficient, as the gum dissolved in water.\nAnother point that occurs to me is the contradistinction found in this paragraph:\n17) The colored encrustation does not seem to stick to linen as well as cotton. Some linen fibres appear to be nearly clean, and the cotton fibrils can be heavily encrusted in the same thread sample. This suggests that cotton was added to the Raes threads to make dyeing possible. The cotton in the threads would have made color matching easier. Linen is difficult to dye or stain.”\nSurely this is evidence that the linen had actually absorbed the dye into it, while the cotton still had lumps of it sticking on the top, not penetrating the fibrils, and easy to remove. It would be interesting to know what Teresinha Roberts has to say about that.\n\n","date":"December 13, 2015 at 9:12 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216391","author":"Hugh Farey","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Pam Moon has asked me to post this: \n “Hi Hugh\nThank you for your questions.  Regarding the Holland cloth the possibility you suggested that the Holland fibres came from under the Raes sample where there was no dye makes sense.  It would be easy, as the Raes sample was cut, to add fibres of Holland cloth. \nDissolving in water: the section (page 6) was included to answer your previous question.  I found it  in Rogers’ emails circulated by Barrie and Joe.   The gum dissolves in water but once the ‘water evaporates, a colorless, easily seen film of gum is deposited around the fibre.’  Perhaps it is something to do with the tenacious, adhesive qualities of gums. Gum arabic is a major component of chewing gum.  It dissolves in water but when the water is gone it sticks. So the need for con HCl.\nI found the following quote from wikipedia which seems to confirm that:\n‘Gum arabic is used as a binder for water colour because it dissolves easily in water.  Pigment of any color is suspended within the acacia gum in varying amounts, resulting in watercolor paint. Water acts as a vehicle or a diluent to thin the watercolor paint and helps to transfer the paint to a surface such as paper. When all moisture evaporates, the acacia gum binds the pigment to the paper surface.’\nThanks also for the question about the difference between dye in linen and cotton.  Rogers is right that cotton is much easier to dye than linen: ‘the flax fibre is harder than cotton, and dyestuffs do not penetrate so readily into it.’ (Handbook of Textile Fibres J Gordon Cook pg 9).  So some of the linen fibres are clean and have resisted dye whilst the cotton is overloaded on the surface.  The depth of the dye through the fibre is referred to by Rogers.  In the image top 6 cotton fibres are shown coloured on the outside and nearly colourless on the inside;  Raes 14 is similar (see bullet point 18).  Writing this I realise for the first time that Rogers wrote the following in bullet point 18: ‘The outside of the (Raes 14) thread showed the deepest encrustation of any of the samples, except one end of Raes 1 (the spliced thread).’  So the colour change in Raes 1 is definitely dye.\nHowever, I will ask Teresinha about the questions when she has time to see me.  I suggested gum tragacanth because she had never used gum arabic for fabric.  She said she was happy to experiment with gum arabic and she will answer these questions much better than me.”\n\n","date":"December 13, 2015 at 3:13 pm","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216417","author":"jmarino240","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Thanks, Joe, and Pam, of course!\n\n","date":"December 13, 2015 at 3:23 pm","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216418","author":"Hugh Farey","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"I can’t understand how the three labs and Donna Campbell missed all this dyed cotton\n\n","date":"December 13, 2015 at 5:15 pm","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216425","author":"Charles Freeman","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"As the dye would make minimal difference to the radiocarbon date, it doesn’t really matter. Pam and Joe’s point is that the dye disguised interpolated threads. However, no such threads are visible, dyed or not, and ‘invisible mending’ or ‘interweaving’ is clearly visible at the scale of the close-up photography of Shroud 2.0, or the photos of the Oxford or Arizona samples now available, even if, as is usually the case, the threads used are taken from somewhere else on the same cloth.\n\n","date":"December 13, 2015 at 6:21 pm","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216430","author":"Hugh Farey","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Hugh. Do you mean’would be clearly visible’\nAnd the aragonite/ calcium carbonate/ gesso scenario looks very promising as a subject for further research.\n\n","date":"December 14, 2015 at 2:23 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216457","author":"Charles Freemsn","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"No examination was made of the chemical composition of the sample.\n\n","date":"December 13, 2015 at 5:22 pm","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216426","author":"Louis","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Yes, indeed, clearly visible under a microscope, not just a few wisps of loose fibres here and there, and certainly not end-to-end glued joints, but distinctly doubled threads over a few millimetres. These have not been observed.\nAs for the gesso, I’m not sure. As I understand it, gesso is essentially brittle and could not apply to a cloth intended to be rolled, folded or waved. This is the viewpoint of “Whips and Angels, Painting on Cloth in the Medieval Period” by Linnet Kestrel, and “Medieval Painted Flags, A Study” by Rebecca Robynson, both of whom think that gesso was omitted altogether in these circumstances. Cennino Cennini himself, the earliest source of medieval techniques, discusses movable cloth in Chapters 163 (curtains), 165 (flags) and 173 (including skirts) of “Il Libro dell’ Arte o Tratato della Pittura” and is a little less clear, but it is certainly not obvious that gesso was involved. In his advice for preparation of linen generally, however, he suggests applying gesso and them immediately scraping it all off again, as if to leave particulate gesso glued among the threads of the cloth, and that might have resulted in a flexible ground, and is probably the technique you are thinking of. I do not know how crumbly this would be when rolled or folded. If there is, or was gesso, on the Shroud, and if that gesso was made of calcium carbonate (it should be remembered that ‘gesso’ is simply Italian for ‘gypsum’, which is calcium sulphate as used by the Italians, so was somewhat inexactly used by non-Italians to describe a treatment for cloth using calcium carbonate), then it could be in any crushed form of limestone (calcite or aragonite), marble, or more probably chalk.\n\n","date":"December 14, 2015 at 5:45 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216464","author":"Hugh Farey","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"That view seems to be some progress. As for gesso, go through the information in the link I provided to Marco Rinaldi yesterday. I went to the V&A while I was researching medieval history in England, but that was to buy some pictures, nothing to do with the Shroud. If I had known about what was to come I would havê sought the opinions of the experts there.\n\n","date":"December 14, 2015 at 7:21 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216471","author":"Louis","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"And the V and A have the only other known three in one herringbone weave in linen- dated to the fourteenth century, but you have to make special arrangements to visit it in a store.\n My wife worked in the textile department at the V And A some years ago but it is quite difficult to get the expert opinion you want. Still you can e-mail them and sometime you come across a respondent is really helpful, other times you don’t even get a reply. The Metropolitan Museum in New York have also worked on medieval painted linens.\nYou have to search around for info. although Archetype Publications in the UK have relevant but expensive titles. I gave an introductory talk on painted linens the other day to a medieval historic churches group and someone suggested I write on book on them. No hope! You need to be able to mix the disciplines of art history, medieval displays ,church liturgies and the way linens were used in churches, and scientific understanding of sealants, pigments and gessoes to get anywhere productive and I am not qualified to do that!\n\n","date":"December 14, 2015 at 7:59 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216472","author":"Charles Freeman","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"I know about the three in one herringbone weave textile preserved there. It is silk, made in Turkey. V&A were contacted some years ago and responded without problems initially and then stopped when it came to the TS.\nDo you havê the transcript of your talk?\n\n","date":"December 14, 2015 at 8:22 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216473","author":"Louis","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"I think the piece Charles is referring to is linen, made probably in Italy, about 1350-1400, Museum number: 8615-1863.\n\n","date":"December 14, 2015 at 9:52 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216479","author":"Hugh Farey","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Thanks, I will check that.\n\n","date":"December 14, 2015 at 10:53 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216483","author":"Louis","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Sorry, I think I misunderstood your question. Interweaving is clearly visible (on other cloth) at the scale of the photographs I mentioned, but it is not visible (on the Shroud) on the actual photographs I mentioned. Ergo, the photographs do not demonstrate any invisible weaving on the Shroud.\n\n","date":"December 14, 2015 at 5:48 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216466","author":"Hugh Farey","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"Yes, I wanted to clarify what you said- no invisible reweaving. End of story, or it should be but it won’t be!\nThe more you read about gesso and primers the more clearly is that the variety of sealants on linens before they were painted is considerable, depending,I suppose ,on what was available. I did understand Cennini to mean that you expertly applied a very thin layer of gesso, left after scraping, so as to maintain flexibility.\nEveryone acknowledged the precarious nature of painted linens- which is why they were so cheap- inventories show that they were valued at about one twentieth to one tenth of a similarly painted wooden panel but you can’t fly a panel and a cloth was easier to carry about. In many recorded  cases, of course, the linens represented a cheap way of getting something for a specific one-off ceremony where long term durability did not matter.\nAs I have continually said, we need an expert on these linens to get involved. Many studies of banners ( flexible ones) do mention various forms of sealant so that we know if happened and the ingredients of some have been analysed. The question is whether we can relate the aragonite , the calcium( carbonate?) , to a sealant of some kind.  The suggestion that the calcium was found across the whole cloth including non- image areas is suggestive of some overall sealant, and this might  provide the base for the images that we see so clearly in depictions of the Shroud especially after 1578 when visibility from afar was such an important part of getting the crowds in. ( See Beldon Scott on displaying the Shroud.)\nSo long as no one else can provide any kind of other explanation for the images , I am sticking in this area as it seems the most probable explanation and ,as I have said numerous times before, I expect we will get some further support or dismissal within the next few years.\nJust off to California to see my son. David Sox had been in touch wanting to meet but he is away just the week I am there!\n\n","date":"December 14, 2015 at 7:06 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216470","author":"Charles Freeman","site":"shroudstory"},{"title":"Important New Paper on the Carbon Dating Samples","post":"I first read your last sentence too quickly and thought that David Sox was your son. Anyway, I think that David would have been proud to have Charles Freeman as dad.\n\n","date":"December 14, 2015 at 10:02 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","id":"comment-216481","author":"PHPL","site":"shroudstory"}]
