[{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Interesting that two robes, a belt and two cushion covers were radiocarbon dated, and all but one robe were found to be contemporaneous with St Francis. Would not the headline “Carbon dating confirms age of St Francis relics” be a little more accurate?…\n\n","date":"February 2, 2014 at 5:34 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-75911","author":"Hugh Farey","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Medieval relics are often contemporary with what they are supposed to be and very often genuine. Thomas Becket’s body was kept in Canterbury cathedral where we his was murdered and therefore we can be sure that his bones, until they were destroyed at the Reformation, were genuine. \nIt’s the relics that claim to come from before 1000 AD that are the difficult ones!\nThere are some intriguing cases where bones supposed to have been of Christian martyrs are actually found to be pre-Christian- Fanti’s dating of the Shroud(by one of his methods)  to many years before Christ is surely within this genre.\nWas it  Carsten Thiede who claimed to have found an early manuscript of St. Matthew’s Gospel that he dated with reference to a manuscript found at Herculaneum to the 60s AD (Vesuvius eruption AD 79). Experts in this field soon told him that the manuscript in question was convincingly  dated to the first century BC and so, if he was right that the scripts matched, he had truly beaten the field in having a Christian gospel that dated from before Christ!\n\n","date":"February 2, 2014 at 6:21 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-75918","author":"Charles Freeman","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"There are some intriguing cases where bones supposed to have been of Christian martyrs are actually found to be pre-Christian\nExamples?\n\n","date":"February 2, 2014 at 8:03 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-75938","author":"O.K.","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"O.K.  One case that is well known is the third century AD martyrs Felix and Regula whose purported bones (in Zurich, I think) dated from 50 BC. I can’t say I am really surprised, the relic world was full of old bits and pieces that were ancient and to which legends attached although usually testing shows them to be much later rather than earlier than the date they are supposed to be.\n\n","date":"February 2, 2014 at 8:09 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-75939","author":"Charles Freeman","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"A long time ago, in a galaxy far away, there was a similar furore over the dating of an alleged holy relic. Except in that instance, the AMS age-determinations from a single sampling site came back with the correct pro-authenticity answer. The theologians were outraged: how dare you come back with the correct answer, based on just a single sampling site? They wrote books, they set up websites, all protesting against the inherent evil of basing a test on a single sampling site. That went on year after year, decade after decade, and only ended when one of the militants, suffering gastric acidity, went in for a biopsy, and was told that he had the early stages of stomach cancer that was operable (“but of course you will want us to biopsy from more sites to be certain, won’t you?”). Instead, he had the operation immediately, the tumour was excised from his stomach, and the other “tumour” quickly disappeared from the body politic too.\n\n","date":"February 2, 2014 at 5:40 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-75914","author":"colinsberry","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Daveb commented that if the 1988 Shroud dating had come out 1st century, the skeptics would have objected to the methodology (and probably still would be objecting).  I agree 100%.  Carbon dating is not infallible, except seemingly in the case of the Shroud.  Generally in radiocarbon datings, when C-14 dates do not match other data, the C-14 data are routinely thrown out, except in the case of the Shroud.  Based on the basic rules of science, those who do not accept the results of the Shroud dating have a legitimate beef.\n\n","date":"February 2, 2014 at 9:21 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-75954","author":"Joe Marino","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"“If the 1988 Shroud dating had come out 1st century, the skeptics would have objected to the methodology (and probably still would be objecting).”\nBut on what grounds? It would be a much taller order to explain away a deficit of C-14 than an surplus. Why? Because One does not have the option of reeling off a never-ending series of conjectured contamination scenarios (invisible reweaving, bioplastic, thymol, carbon monoxide, bursts of neutron irradiation, inefficient sample-cleaning protocols etc etc) concluding (in some instances) with a smug, self-satisfied grin that the entire radiocarbon procedure is of course hopelessly flawed in its conception and should be abandoned forthwith.\n\n","date":"February 2, 2014 at 10:31 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-75975","author":"colinsberry","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"There are possibilities of contamination that makes the samples apparently older -peat or some other contamination with old organic materials, fossil fuels, and so on, although it is usually much easier to make the apparently samples younger.\n\n","date":"February 2, 2014 at 10:38 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-75977","author":"O.K.","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"I should be interested to know of an occasion when a carbon date has been “routinely thrown out” rather than “investigated until the anomaly is explained.”\n\n","date":"February 2, 2014 at 9:27 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-75956","author":"Hugh Farey","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"I have emailed archaeologist Bill Meacham for a  specific example.\n\n","date":"February 2, 2014 at 9:30 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-75958","author":"jmarino240","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Hugh, I would be interested in exactly opposite, an occasion (except the Shroud) when a carbon date has been “investigated until the anomaly is explained.” rather than “routinely thrown out”.\nIf carbo-date is evidently wrong, than it is usually thrown out 9and perhaps even unmentioned) due to unknown anomalies, and no one cares about the reasons. It would be simply a waste of time and not worthy of efforts.\n\n","date":"February 2, 2014 at 9:33 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-75959","author":"O.K.","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Doesn’t the person who paid for the C14 dating want to know why he wasted his money? Doesn’t the lab which stops getting commissions want to know how to improve its results? Sadly I am unfamiliar with what is routine at carbon-dating labs – are any of our commenters carbon daters by trade so can explain?\n\n","date":"February 2, 2014 at 10:09 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-75969","author":"Hugh Farey","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"And, try:\n“Anomalous radiocarbon dates from Easter Island”\n“Limestone and the problem of radiocarbon dating of land snail shell carbonate”\n“Anomalous radiocarbon ages from a Holocene detrital organic lens in Alaska and their implications for radiocarbon dating and paleoenvironmental reconstructions in the arctic”\nand any of the radiocarbon discussions about Richard III’s bones dug up in a Leicester car park.\nThere; I’ve done what you wanted. Any chance of finding one for me?\n\n","date":"February 2, 2014 at 10:18 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-75970","author":"Hugh Farey","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Here is Bill Meacham’s reply to Hugh’s question (#9):\nThere are hundreds or even thousands of examples, but usually these aberrant dates are attributed to something, either “contamination” or “old wood” or “an intrusive sample” etc. . Almost always there is no proof of such, the only evidence being that the date doesn’t agree with the context so it must be due to something. But the “reasons” proposed are merely guesswork to justify dismissing the aberrant date.\nI quote lots of examples in the pre-ShroudC14date article:\nhttp://www.shroud.com/meacham.htm\nHere’s one quote from that article regarding Late Minoan 1B chronology:\n“Betancourt et a1(1978:202) also discuss several dates that are too early or too late in the expected historical chronology, and conclude:\n‘One or two dates should never be used by themselves to establish a site’s chronology. So many dates have proven to be useless because of contamination and other causes that one can only establish a radiocarbon chronology with some degree of confidence if several dates from the same site fall into a consistent pattern that agrees with the stratigraphic sequence.’ ”\nRegarding Hugh Farey’s comment, the archaeologist or geologist is more interested in getting results that agree with the other data, so they will collect and submit more samples. The lab folks run their procedure and invariably attribute the “aberrant” date to some issue in the field.\n\n","date":"February 2, 2014 at 10:57 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-75982","author":"jmarino240","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"There are a few cases from Coptic Egypt where the Belgian Royal Institute for Cultural Heritage (IRPA/KIK) reviewed the radiocarbon dates from 400 textiles and found problems with one per cent of them.-  so I suppose three or four of the 400. The only one the report gave as an example of rejection was one where two radiocarbon dates were 285 years apart and this was considered unacceptable. The sample was retested and a third date was finally considered acceptable ( some of the textiles were dated from the archaeological context in which they were found ).(This helps answer OK’s question.)\n There has also been a lot of retesting of material from Tell el Dab’a (the ancient Avaris) in Egypt. This is because of discrepancies of a hundred years that have arisen in attempting to date the eruption on the island of Thera (Santorini) that other dating methods date to c 1628 BC but some material at Avaris believed to be associated with the eruption carbon-dated to c. 1500 BC.More recent tests apparently show that the radio carbon was perhaps out a hundred years in 3600-3500 years but there have been problems with some of these older dates anyway.\nThere are genuine problems areas- peat is one because samples can easily be mixed and it is difficult to unsort later peat that has become mixed with older peat. My limited experience of being on digs,many years ago, where samples were being elected for carbon dating is that one made very sure that samples were original/ uncontaminated  before they were sent off to an expensive lab. I can’t ever remember that more than one sample was sent from a single artefact – the trick, as the effort to select  the Shroud sample showed, was to get it right the first time. Cloth , as in the Coptic examples, is easier than peat to spot problems in because later material or material of a different textile can easily be spotted under a microscope and so one can be much surer than one has an original sample. and textiles are easier to clean from contamination than peat! This probably explains why the Coptic examples (mostly AD 400-1000)  have proved so accurate.\nThe discrepancies tend to be in the order of a few percentage point- the discrepancy argued for the Shroud is way outside this – we are hardly dealing with the conventional and well known minor, but important, discrepancies of a hundred or two hundred years discussed above.\n\n","date":"February 2, 2014 at 11:39 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-75989","author":"Charles Freeman","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Charles O.K. One case that is well known is the third century AD martyrs Felix and Regula whose purported bones (in Zurich, I think) dated from 50 BC.\n50 BC is circa 2050 years BP\n200 AD is 1850 AD, 300 AD is circa 1750 AD.\nI would say that 200 years offshot is nothing surprising and happens sometimes… Remember that C-14 dating is not a precise, but a statistical measure, and some deviation is expected.\n\n","date":"February 2, 2014 at 9:37 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-75960","author":"O.K.","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Yes, these discrepancies do arise (see my earlier posting)  but how can you be sure that the sample was of these two martyrs who may have been mythical anyway? The report I have read on them simply assumed that the myth of the martyrs attached to some old bones.\n\n","date":"February 2, 2014 at 11:42 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-75990","author":"Charles Freeman","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Maybe, or maybe not. Truly, we don’t know either way.\n\n","date":"February 2, 2014 at 12:28 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-75994","author":"O.K.","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"For those who are interestd, here are the results of internal, paleographical, and C-14 dating of some of the Dead Sea Scrolls:\n\nAs anyone can see, there are conflicts of about 200 years in some instances.\n(from James C. VanderKam, Manuskrypty znad Morza Martwego, Cyklady 1996, str. 31, Tabela 1)\n\n","date":"February 2, 2014 at 9:42 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-75961","author":"O.K.","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"“p.n.e.” means BC, “n.e.” AD or CE, “Data wewnetrzna” -internal dating, “Data paleograficzna” -paleographic dating, “Data AMS” -AMS dating.\n\n","date":"February 2, 2014 at 9:52 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-75966","author":"O.K.","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Hugh: There; I’ve done what you wanted. Any chance of finding one for me?\nCheck #13, and this:\nhttp://en.wikipedia.org/wiki/Carbon_dating_the_Dead_Sea_Scrolls\nWhen 4Q258 (#24) was tested at Tucson its result was so anomalous (129-255 or 303-318 CE) that the laboratory was asked to retest another sample from the same document. The second test (#21) yielded a result (50 BCE-130 CE) that was deemed more satisfactory.\nIf there are some systematic anomalies in many datings in one particular region, then of course some reasearch of its nature is performed. But not in every single case of anomalous dating. There are simply no resources for that.\nBesides, and taking the matter in a little bit cynical way, in case of anomalous dating both the customers and the Carbon-dating labs have common interest in throwing it out.\nThe customer -because he is not interested in revealing that his conclusions are in conflict with “infallible” C-14.\nThe laboratory -because it can mantain reputation of its own reliability, and general myth of C-14 infabillity.\n\n","date":"February 2, 2014 at 10:35 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-75976","author":"O.K.","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"\nO.K. :\nThere are possibilities of contamination that makes the samples apparently older -peat or some other contamination with old organic materials, fossil fuels, and so on, although it is usually much easier to make the apparently samples younger.\n\nBut that’s hardly likely to be the case with linen with its chemically-resistant cellulose fibres, capable of withstanding a series of treatments with acid, alkali etc, while all the time retaining its characteristic fibrous appearance under the microscope, nodes an’ all.  It’s hard to imagine adventitious contaminants of the kind you describe escaping detection during the visual monitoring that accompanies the clean-up procedures.\n\n","date":"February 2, 2014 at 10:48 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-75978","author":"colinsberry","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"<\\\n\nCharles Freeman :\nMedieval relics are often contemporary with what they are supposed to be and very often genuine. Thomas Becket’s body was kept in Canterbury cathedral where we his was murdered and therefore we can be sure that his bones, until they were destroyed at the Reformation, were genuine.\nIt’s the relics that claim to come from before 1000 AD that are the difficult ones!\nThere are some intriguing cases where bones supposed to have been of Christian martyrs are actually found to be pre-Christian- Fanti’s dating of the Shroud(by one of his methods)  to many years before Christ is surely within this genre.\nWas it  Carsten Thiede who claimed to have found an early manuscript of St. Matthew’s Gospel that he dated with reference to a manuscript found at Herculaneum to the 60s AD (Vesuvius eruption AD 79). Experts in this field soon told him that the manuscript in question was convincingly  dated to the first century BC and so, if he was right that the scripts matched, he had truly beaten the field in having a Christian gospel that dated from before Christ!\n\nMedieval relics are often contemporary with what they are supposed to be and very often genuine. Thomas Becket’s body was kept in Canterbury cathedral where we his was murdered and therefore we can be sure that his bones, until they were destroyed at the Reformation, were genuine.\nIt’s the relics that claim to come from before 1000 AD that are the difficult ones!\nThere are some intriguing cases where bones supposed to have been of Christian martyrs are actually found to be pre-Christian- Fanti’s dating of the Shroud(by one of his methods) to many years before Christ is surely within this genre.\nWas it Carsten Thiede who claimed to have found an early manuscript of St. Matthew’s Gospel that he dated with reference to a manuscript found at Herculaneum to the 60s AD (Vesuvius eruption AD 79). Experts in this field soon told him that the manuscript in question was convincingly dated to the first century BC and so, if he was right that the scripts matched, he had truly beaten the field in having a Christian gospel that dated from before Christ!<<\nAll of which goes to show how tenuous it is to base the authenticity of any object of historical interest on one test alone. People really believe that a C14 date of 1300 A.D. renders the cloak of St. Francis, who died a mere 75 years earlier, as inauthentic because the date was less than 100 years off? Really?\n\n","date":"February 2, 2014 at 11:21 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-75985","author":"Chesterbelloc","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"I think I understand. The expression “routinely thrown out” means different things to different people. William Meacham’s examples are good test cases. Anomalous dates for a coral reef result in thin sections being taken and contamination being suggested. Anomalous dates for some straw matting result in the discovery of an organic preservative. In eight quoted examples from Chao and Coleman (1981), six are explained by contamination. Anomalous dates due to volcanic activity, marine calcium carbonate, and other suggested contaminents are at least explained, if not over-investigated, but not summarily “thrown out.” But that’s obviously what Joe and William meant, so I think we agree with each other there. If the Shroud radiocarbon date is anomalous, then we do not summarily reject it, we attempt to explain it – and how! Outright trickery, the invisible patch, the madder root dye, skin oils, cotton and all the rest. In William Meacham’s cases above, the sample has nearly always yielded to some form of contamination, but in this case it clearly hasn’t – at least, not to everyone’s satisfaction. If it ever does, then I too will be happy to throw it out!\n\n","date":"February 2, 2014 at 1:14 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-75999","author":"Hugh Farey","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"“If the 1988 Shroud dating had come out 1st century, the skeptics would have objected to the methodology (and probably still would be objecting).”\nColin wrote “But on what grounds?”\nThe 1988 dating did not follow the 2 points mentioned in the article about the St. Francis articles:  \n“First, sampling should always be done in agreement with and under the guidance of scholars and people involved in the historical or archaeological problem. In addition, whenever possible, collecting several samples from the object to be dated (as we did in the case of the two frocks) is definitely the right approach in order to reduce the possibilities of ambiguities.”\nAlthough a planning meeting in Turin was held in 1986 that could have, if it had been followed, fulfilled the 1st point.  But when it came time to actually take the sample, all of that was thrown out the window.  And because only one sample was taken, there are, in fact ambiguities.\nSkeptics could object on the same grounds that pro-authenticity researchers have:  the whole dating exercise was not rigorous science.\n\n","date":"February 2, 2014 at 1:57 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76004","author":"jmarino240","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"So I check the web-site before retiring Sun evening, naturally delighted to see that Dan has seen fit to promote some comments I made, wake up Mon morning and discover that there’s already some 25 highly informative comments, several by those whose expertise and opinion I value and respect.  Thank you all, I’m glad my comments were able to provoke such an interesting and informative discussion. \nThere is obviously a major difficulty when it comes to taking samples from such a relic as the Shroud, as its custodians are naturally anxious to preserve its integrity; that it is an important “heritage” item is an understatement of its significance. The priority for its preservation is always going to compromise its scientific study, and perhaps we will never be able to discover everything we would like to know about it. There are clearly limits to what can be discovered with NDT methods alone. However when it comes to taking samples, there needs to be adequate assurance that they are truly representative of the whole.  This cannot be said to be the case for the 1988 C14 testing.   \nPerhaps we need to wait a bit longer before further investigations can yield more information, until such time as satisfactory techniques have been developed which are less invasive than they have been at present or in the recent past.\n\n","date":"February 2, 2014 at 3:46 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76023","author":"daveb of wellington nz","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Blind blogging the blind\nI think it is wonderful that we have a blog where anybody who ever took a high school science course can opine on scientific disciplines far afield from frog dissection (or was that biology?)\nThe fact is that a number of well qualified scientists have demonstrated the errors of the carbon dating and it begins and   with the choice of a single sampling area that was really inappropriate.\nJust ducking in but to those worshipers at the altar of Zurich, Oxford and Arizona carbon results, your god is dead. It’s about time you figured it out. I will point out just how despicable they were when I publish. By most ethical standards it was IN FACT corrupt. The supposed referee  of the process was jockeying for an endowed post at Oxford at   the same tin=me he was to insure the integrity of the process. Guess what – he got it six months after the results were announced\nOr to put it a bit inelegantly, when you defend the carbon dating you are [spitting] into the wind. Time to move on, seriously.\n\n","date":"February 3, 2014 at 7:39 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76169","author":"John Klotz","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"‘Just ducking in but to those worshipers at the altar of Zurich, Oxford and Arizona carbon results, your god is dead. It’s about time you figured it out. I will point out just how despicable they were when I publish. By most ethical standards it was IN FACT corrupt.’\nA word to the wise. Just make sure you understand how UK libel law works before you publish here, John. It could be expensive as the onus will be on you to prove your case.\n\n","date":"February 3, 2014 at 7:52 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76172","author":"Charles Freeman","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"The “supposed referee” being referred to is Michael Tite, then of the British Museum. Anyone foolish enough to think he needed a scientific scoop to land his next appointment has only to check his publications in Google Scholar to see how ludicrous is that proposition. Or maybe they think he was a stuffed shirt who was concerned purely with massaging his own credentials around 1988. If so, they could do a lot worse than check out this paper of his submitted to the University of Arizona’s radiocarbon journal advising of systematic errors in the BM’s radiocarbon data in the period running up to 1984.\nPreliminary statement on an error in British Museum radiocarbon dates\nM S Tite, S G E Bowman, J C Ambers, K J Matthews\nAbstract\nA  systematic  error has  been  identified in  radiocarbon measurements run in  the British  Museum  laboratory  between  approximately  mid  1980 and the end of 1984, when  all  dating was  halted for a  number of months. The measurements  potentially affected  have  numbers between about BM- 1700 and BM-2315,  and correspond roughly to date  lists XV to XIX  pub- lished  in  Radiocarbon.  The  error  is systematic,  giving  dates  that  are  too young by varying  amounts:  some  may have  been  underestimated  by 200- 300 years, whilst others  may be little affected. BM dates issued during this period should be used with caution. Dates obtained since mid  1985 are not subject to this  error as  evidenced by  repeated radiocarbon measurements of dendrochronologically-dated wood (see  for example  BM-2432, date list XX,  forthcoming). A  comprehensive  set  of experiments  to  clarify and quantify the  dis- crepancy is continuing. When sufficient  data are available a  full account of the problem  will be published. Submitters of a series of samples during the period in question will also  be notified individually. \nhttps://journals.uair.arizona.edu/index.php/radiocarbon/article/view/4291\nDoes that sound  to folk here like someone desperate to portray himself as someone whose institute and staff never puts a foot wrong, or someone simply after personal fame and fortune? I’d say he comes across above as a pretty straightforward kind of guy, making a public retraction in the very year that the Shroud was being dated under his overall direction. I would say the guy should be given a break. Call off the hounds.\nI invite John Klotz to reconsider his intemperate comment re the personal integrity of the 3 labs involved in the radiocarbon dating, and of the project referee (even if not mentioned specifically by name). Or is it considered OK by John Klotz, himself a lawyer specializing in internet libel  (specifically “flaming”etc according to his web page)  to blacken the names of individuals, but  in a manner that he knows would renders him immune from legal action – deploying non-specific job labels instead of actual names?  Is that OK by you, Dan Porter – having your site used as a vehicle for carefully crafted character attacks? I await your answer with interest.\n\n","date":"February 3, 2014 at 10:25 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76187","author":"colinsberry","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Noted.\n\n","date":"February 3, 2014 at 11:09 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76195","author":"Dan","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Despicable, eh? Christopher Ramsey? Timothy Jull? Douglas Donahue? Willy Woefli? Corrupt, eh? Not all the people denigrated have died, you know.\nA number of well qualified scientists, eh? Qualified in what way, exactly? More qualified at radiocarbon dating than the above?\nDangerous waters…\n\n","date":"February 3, 2014 at 9:15 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76182","author":"Hugh Farey","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Dangerous waters from both a legal standpoint and a Christian one, in my opinion. The growing bitterness between many involved in this debate is disheartening. C’mon guys, we have a tantalizing mystery here — let’s enjoy it together!\n\n","date":"February 3, 2014 at 12:06 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76206","author":"David Goulet","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"“Apart from that Mrs. Lincoln, how did you like the play? \n(Tom Lehrer)\n\n","date":"February 3, 2014 at 12:35 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76213","author":"colinsberry","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Back to the paper about the radiocarbon dating of the frocks and pillow of St. Francis of Assisi. I have it.\nIncidentally, the picture shown above does not seem to be the frock from the St Francis Church in Cortona or the frock from the Church of Santa Croce in Florence which are the relics in question in the paper.\nIn particular, the pictures of these 2 dated frocks do not show at all the obvious patches seen in Dan’s picture.\n7 samples were taken from the Cortona’s frock (SFC) and 6 samples from the Santa Croce frock (SFF). Why ?\n“Samples were taken following the advice of a textile conservator, who examined the manufacture of the relics. No darn or patches were present. Anyway we decided to sample several ,pieces from each frock, since both consisted of several woolen cloths sewn together ”\nLooking at the pictures I can’t see the “woolen cloths sewn together”.\nAnd the Shroud ?\nOf course the main part of the Shroud does not consist of several pieces sewn together.\nBut where does begin the main part of the Shroud ?\nThere are: the side strip, the missing corners, the Holland cloth (which itself consists of 3 different parts (why ?), the 1534 patches etc…\nThe structure of the TS is complex, particularly in the C14 corner..\n” At the 3 MV Tandetron accelerator of the LABEC laboratory in Florence, we have analysed textile relics by both Ion Beam Analysis and Accelerator Mass Spectrometry (…)”\nThis was never performed on the TS.\nThe radiocarbon concentrations of all the samples coming from a given frock are self consistent. In a given frock the samples came from different areas separated by 20 or 30 or more centimeters.\nThis is not the case for the Shroud dated samples which were only separated by some centimeters.\nMoreover we do know that the Raes/C14 corner is strongly anomalous.\n– The Quad Mosaic (QM) is significant. Yes it is. I studied the full-size QM photos and I compared them with the High-Res Photos taken by Barrie Schwortz at the same time (1978).\n– The fluorescence is significant. (Hugh this photo truly comes from the STURP fluorescence studies)\n– The cotton question is significant\n– The dye is significant.\n– The Rogers’ results re vanillin are significant.\nRiggi (who cut the samples) himself wrote that he had to eliminate the thin band between the side seam and the C14 samples because he saw some extraneous fibers….\nHow was it possible to choose such a bad small single sample to date the entire Turin Shroud ???  \nThis paper (dating of St. Francis relics) shows what is true science.\nUnfortunately, the Shroud C14 dating process was not a model of true science;\n\n","date":"February 3, 2014 at 5:32 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76259","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Thibault appears to be correct and I have the wrong photo. I used the photo from the Reuters article, assuming that this news agency was correct. Here is the caption from the Reuters: “The tunic of Saint Francis of Assisi is seen during a exhibition in Gubbio in this September 30, 2006 file photo. Carbon dating has cast doubt on the authenticity of one of four robes kept by Italian churches as relics of the medieval Saint Francis of Assisi, though another tunic, a belt and a cushion were found to be the right vintage. REUTERS/Daniele La Monaca.” I am removing the image from the blog posting.\n\n","date":"February 4, 2014 at 3:53 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76379","author":"Dan","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Thanks Thibault, but I don’t think the question is settled.\n1) Has anyone discussed the significance of the pale blue areas of the Quad Mosaic pictures. If the different colours represent different chemical compositons, then the entire shroud is divided into seveal bands of very different composition, without considering the green corners.\n2) If the disputed UV photo is genuine, then the Holland cloth under the shroud (and which was under the Raes sample before being cut off) fluoresces brightly. The exposed bits of the Holland cloth (the missing corners and the burn holes at the end of the cloth) do not fluoresce at all. Their fluorescence has been effectively smothered – by what?\n3) The cotton question is significant, but without some agreement as to how much there is and whether it is spun into the threads, woven into the cloth or merely surface contamination it doesn’t lead anywhere.\n4) I think the exposed Holland cloth and other holes were dyed to match the shroud, which dye accounts for the difference in colour on the shroud around these areas. I do not think the dye significantly affects the radiocarbon dating.\n5) There is insufficient evidence about the vanillin to determine whether it is significant or not.\n6) The radiocarbon corner was heavily attached onto the Holland cloth. The holes for the sewing are still clearly visible. These were the anomalous threads rejected by Riggi, together with the “side seam” which was probably reinforced in that area.\n7) Actually it was almost inevitable that the Shroud sample would come from that particular place. A hole in the material was probably rejected outright, leaving either an edge or a corner. The corner which was already damaged seemed the obvious choice.\n\n","date":"February 3, 2014 at 6:48 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76272","author":"Hugh Farey","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"“Charles Freeman:\n“A word to the wise. Just make sure you understand how UK libel law works before you publish here, John. It could be expensive as the onus will be on you to prove your case.”\nSince I have now been threatened for libel for something Gove reported 28 years ago, perhaps it is best that I leave this repetitive discussion. But as I said, the 1988 c-14 tests are no longer a serious issue because the anomaly issue.\nIt’s amazing how easy it is for our British brethren to challenge the scientific work of well established scientist like the late Ray Rogers. I have written what I intend to say about the carbon dating tests and it has been read by at least one or two people in UK without a threat of libel. \nThat’s the second time Charles Freeman has warned me about libel. I guess they know that you can’t libel a dead man so they are free to throw Rogers into the trash can while suppressing free debate on this blog about survivors in the carbon labs. \nOn the other hand, there is the United States Constitution and the following statute which is the law of this land (Since 1789). Also, because the Shroud is a matter of pyblic issues and I believe the particpants in the carbon dating were public figures there is a requirement of proving malice.\nIt can be done. I successfully represented an individual who sued a public figure for libel during a political campaign and we won. I defeated a motion for summary judgment and won the appeal by the City. The City then settled.\nTite’s participation in a internationally reported press conference, as well as his position with the British Museum would easily meet the public figure test.\nOh well, having seen Stonehenge once in my life, I guess that’s enough. I will miss the Hod Pole on the canal south of Bath though.\n“28 U.S. Code § 4102 – Recognition Of Foreign Defamation Judgments\n“(1) In general.— Notwithstanding any other provision of Federal or State law, a domestic court shall not recognize or enforce a foreign judgment for defamation unless the domestic court determines that—\n“(A) the defamation law applied in the foreign court’s adjudication provided at least as much protection for freedom of speech and press in that case as would be provided by the first amendment to the Constitution of the United States and by the constitution and law of the State in which the domestic court is located; or\n“(B) even if the defamation law applied in the foreign court’s adjudication did not provide as much protection for freedom of speech and press as the first amendment to the Constitution of the United States and the constitution and law of the State, the party opposing recognition or enforcement of that foreign judgment would have been found liable for defamation by a domestic court applying the first amendment to the Constitution of the United States and the constitution and law of the State in which the domestic court is located.\n“(2) Burden of establishing application of defamation laws.— The party seeking recognition or enforcement of the foreign judgment shall bear the burden of making the showings required under subparagraph (A) or (B)….”\nOne final word. That Tite was being considered for a position at Oxford at the same time he was the impartial monitor of the carbon dating tests is a conflict of interest, at least in this country. If you were suing someone and your judge or referee was seeking employment with the person you are suing, wouldn’t that be a conflict of interest even in England? Or do different rules of ethics apply to Oxford and Cambridge. It certainly would be a conflict here and one would hope across the pond also.\nOh, and by the way Charles, in this country the burden is on the defendant to prove falsity, not on the plaintiff to prove truth.\nAnd incidentally, that rule was established in the  trial of Peter Zenger before the Revolution. It was one of the things that bothered the Brits about those undisciplined colonists.\nA new Peter Zenger trial. I can hardly wait BUT be assured I will have reasonable grounds for what I say.\nhttps://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/\n\n","date":"February 3, 2014 at 7:15 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76273","author":"John Klotz","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"‘Since I have now been threatened for libel for something..’\n‘Also, because the Shroud is a matter of pyblic issues and I believe the particpants in the carbon dating were public figures there is a requirement of proving malice.\nIt can be done.’\nNo one is threatening you for libel, John. It is only that the way you express yourself about other people looks like you might write something libellous and wiser souls than you are warning you to concentrate on the actual issues not the personalities.\nActually I don’t think anyone is going to take you seriously enough to bother to take you to the courts – I now see Hugh has made the same point. It is simply am unpleasant way to conduct an academic debate.\n\n","date":"February 4, 2014 at 6:16 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76412","author":"Charles Freeman","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"For those who aren’t aware, Harry Gove had sent a letter to Sir David Wilson of the British Museum, describing the Shroud C-14 dating as “a somewhat shoddy enterprise.”  This is quoted on page 95 of Meacham’s book “The Rape of the Shroud.”  There Meacham describes his own letter to the British Museum, which he had copied to Gonella and STURP, along with a copy of the complete letter that Gove had sent to the British Museum.\n\n","date":"February 3, 2014 at 7:35 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76279","author":"jmarino240","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"I doubt if any of the scientists described as despicable and corrupt by John Klotz, or as frauds by Stephen Jones, would consider their reputations sufficiently damaged by these descriptions, considering the people who make them, to bother with legal action. I have no doubt they wish the protocols had been better adhered to, that the sampling was more rationally decided upon, and that the announcement of their findings had been better handled altogether. There were aspects of the whole procedure that were indeed shoddy and irregular, and both Gove and Sox have done well to describe them. However all that’s a far cry from the radiocarbon scientists being fraudulent, corrupt, or even despicable.\n\n","date":"February 3, 2014 at 8:21 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76291","author":"Hugh Farey","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"I think at a minimum, many people feel that because the exercise was so chaotic (down to getting versions of the sizes and weights of the samples, which should be basic and straightforward), why should the results be trusted?  If a physician is sued for malpractice and loses, he/she may have a good track record otherwise, but the focus is going to be on where he/she currently messed up.  And the best track in the world doesn’t negate the consequences of the malpractice.\n\n","date":"February 3, 2014 at 9:34 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76306","author":"jmarino240","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Hugh,\nI really am amazed that you make such casual judgments about those who challenge the carbon dating and casually besmirch their integrity and competence while giving accoladesw to the carbon dating labs. If I get my book publishd this year, hopefully before Summer, maybe befor Easter, you will see my view in depth. I ahve two and a half chpaters that cover carbon dating. Approximately\nOne thing I am doing is  trying to show that the the STURP team and other sindologists  are of men and women were able scientists and in many cases admirable human beings. Among the exhibits are John Heller and Father Rinaldi. I  deeply regret I was never able to make their acquaintance. There are several people on this blog who I actually regard as friends although our interaction is primarily in cyberspace. Frankly, you can tell a lot about a person by who they choose as friends. I think I have chosen well.\nI think one hallmark of a friend of mine would be respect for the qualifications and accomplishments of the STURP scientists. Otherwise, I have no time for fools, whatevr their acade=mic qualifications. Oops. it is it libel to call a fool a fool the UK.\nI have two full chapters and parts of two others, approximately 100 pages. To paraphrase Mark Antony, but with know irony, I come to bury the 1988 carbon dating, not to praise it.\n\n","date":"February 4, 2014 at 1:02 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76352","author":"John Klotz","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"“I really am amazed that you make such casual judgments about those who challenge the carbon dating and casually besmirch their integrity.”\nI have never made a casual judgement about anyone, nor casually besmirched their integrity.\nAny judgements I make are carefully considered and fully backed up by quotations (or mentions of omissions) from their own work. I have repeatedly and publicly praised the work of the STURP team, and used it in my own researches. I have repeatedly and publicly praised the subsequent work of Joe Marino, Sue Benford, Ray Rogers, Robet Villarreal and others who think the radiocarbon dating is more than a thousand years incorrect, and have great respect for their investigations, particularly those of the Los Alamos scientists.\nMaintaining this scrupulously generous attitude has earned me considerable opprobrium, but fortunately, I have always considered that intemperate judgements tell people more about the giver than the receiver.\n\n","date":"February 4, 2014 at 4:43 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76393","author":"Hugh Farey","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"John : ‘Otherwise, I have no time for fools, whatevr their acade=mic qualifications. Oops. it is it libel to call a fool a fool the UK.’\nI doubt it, but it may make you look all the more ridiculous as this debate goes on.\n\n","date":"February 4, 2014 at 6:18 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76413","author":"Charles Freeman","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"legalese yawn yawn what a bore\nI’m glad I live in a country (back to NZ from Aus a couple of weeks ago) where society isn’t dominated by libel, sueing etc.\nIt’s obscene\n\n","date":"February 4, 2014 at 3:53 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76380","author":"Matthias","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"I hear you.\n\n","date":"February 4, 2014 at 10:55 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76492","author":"David Goulet","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Matthias: Welcome back to NZ from the so-called lucky country. Let’s know where you are.  Are you in Wellingon? Maybe we can link up sometime.  There are disadvantages in the NZ legal system. The NZ Accident Compensation Act removed the right to sue those causing injury, and replaced it with a financially strapped penny-pinching government department to rule on compensation taxpayer funded pay-outs with levies on employers and motor registrations.  Several injustices occur as a result and are frequently reported.\n\n","date":"February 4, 2014 at 4:33 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76554","author":"daveb of wellington nz","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"“I think one hallmark of a friend of mine would be respect for the qualifications and accomplishments of the STURP scientists”\nGiven that STURP’s final report states that the Shroud remains a mystery, I think any reference to STURP’s accomplishments would need to be heavily qualified. As for qualifications, why recruit a thermochemist who immediately writes off pyrolysis as a image-forming mechansim and substitutes a bizarre hypothesis based on a reference to Pliny re linen technology, betraying a clear pro-authenticity bias in his thinking. Or an organic chemist specializing in porphyrin synthesis who is then re-branded a “blood expert”?\nIn any case, this respect for qualifications and accomplishments seems somewhat one-sided, Has our lawyer friend ever taken the trouble to research those of the man he has in his cross-hairs. I have, and they are impressive (and not a mention of the TS either)\nhttp://www.archaeological.org/michaelstite%E2%80%942008pomeranceawardscientificcontributionsarchaeology\n\n","date":"February 4, 2014 at 4:13 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76384","author":"colinsberry","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Oops. The link given does make brief mention of his TS association:\n\n","date":"February 4, 2014 at 4:18 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76388","author":"colinsberry","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"What started badly ended badly. That seems to have been the case with the 1988 carbon dating and is the reason for the controversy that is raging till today.\nDr. Michael Tite appeared at the round table convened by Cardinal Severino Poletto, so he was at least willing to listen to what people on the other side of the controversy had to say. Another of those present was the French author and Shroud scholar Daniel Raffard de Brienne, then the CIELT president, who came from an aristocratic family, was a descendant of a Duke of Athens, and a highly respected person in France. This is what he had to say in response to questions 5 and 6 in the interview:\n \n\n","date":"February 4, 2014 at 8:40 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76451","author":"Louis","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"I’m not sure that one’s ancestry is necessarily a qualification for respect, but certainly Daniel de Brienne held positions of responsibility, and his views should be taken seriously. It does indeed seem odd that more detailed accounts of the dating data have never surfaced publicly, and Riggi’s vague recollections of how the original piece was divided up, and the weights of the samples, are less than encouraging. However I wholly disagree that on that account alone, “this test has no scientific value at all.” I also wonder how de Brienne knows that: “It is certain the people responsible in the church were manipulated,” and: “In all probability the “C-14 affair” is a fraud to contradict the conclusions established in favour of the authenticity of the shroud during the course of all the preceeding research.” Did he leave a more detailed account of his ideas before he died, do you know? In an interview with a newspaper one does not necessarily justify ones views, but one ought to be able to demonstrate some substance to them elsewhere.\n\n","date":"February 4, 2014 at 9:13 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76461","author":"Hugh Farey","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"‘fraud to contradict the conclusions established in favour of the authenticity of the shroud during the course of all the preceeding research.”\n” All the proceeding research”??? I thought that the 1976 enquiry came out against authenticity and certainly STURP have never pretended to have established it. Anyone able to fill us in on what  ‘all’ this research actually is?\n\n","date":"February 4, 2014 at 9:43 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76471","author":"Charles Freeman","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"I would say that STURP’s “conclusions established in favour of the authenticity of the shroud” was more in the sense that they didn’t find any concrete evidence that it was a medieval forgery.  Barrie Schwortz has said he expected to find evidence of brush strokes in the 1st 30 minutes they were there and Ray Rogers said that if you gave him 15 minutes he would have it (the Shroud’s possible authenticity) shot full of holes (hence his reputation as a “gun-slinger”).  If, in fact, the Shroud was a forgery, one would expect that STURP would have found something major to indicate that but they didn’t.  And all of this once again points towards the idea that the C-14 dating, which is often wrong and dispensed with when trying to determine the date of an object, was wrong for some reason in the case of the Shroud.\n\n","date":"February 4, 2014 at 9:56 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76475","author":"jmarino240","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"‘I would say that STURP’s “conclusions established in favour of the authenticity of the shroud” was more in the sense that they didn’t find any concrete evidence that it was a medieval forgery’\nBut there may yet be such evidence- so this is hardly conclusive in favour of authenticity- we need some actual solid first century evidence that builds up a case for authenticity and that ,so far, has not been found. The evidence is largely circumstantial. I stick with my question about ‘all proceeding research’.\n\n","date":"February 4, 2014 at 1:45 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76533","author":"Charles Freeman","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"I confined my comment to STURP because that was the only full-scale  study.   The 1969-1973 Turin Commission study (published in 1976) was very  limited  in scope.  It had some who believed the Shroud was a forgery and  others  who believed it could have come from the 1st century.   Flury-Lemberg believes she’s found something that she believes at least   comes close to placing the Shroud in a 1st century context:   Flury-Lemberg  had originally been approached back in the early 1980s to  try to date the Shroud  by analyzing the structure of the cloth. She refused,  “because,” she says, “it  is impossible to get a serious result dating a  textile by textile analysis  alone.” In 1988, the keepers of the Shroud  permitted radiocarbon dating of the  relic — with unanticipated results. The tests  indicated that the cloth had been  made sometime between 1260 and 1390  A.D., and thus was a medieval forgery rather  than the actual burial shroud of  Christ. And yet, when Flury-Lemberg finally did  agree to head the  restoration and conservation of the linen in the summer of  2002, the Shroud had a far  different story to tell her. She first noticed that  the entire cloth was  crafted with a weave known as a three-to-one herringbone  pattern. “This kind  of weave was special in antiquity because it denoted an  extraordinary  quality,” she says. (Less fine linens of the first century would  have had a  one-to-one herringbone pattern). That same pattern is present on a  12th  century illustration that depicts Christ’s funeral cloth, which, she says,  is  “extremely significant, because it shows that the painter was familiar with   Christ’s Shroud and that he recognized the indubitably exceptional nature of  the  weave of the cloth.” Flury-Lemberg also discovered a peculiar stitching  pattern  in the seam of one long side of the Shroud, where a three-inch wide  strip of the  same original fabric was sewn onto a larger segment. The  stitching pattern,  which she says was the work of a professional, is  surprisingly similar to the  hem of a cloth found in the tombs of the Jewish fortress  of Masada. The Masada  cloth dates to between 40 B.C. and 73 A.D. The  evidence, says Flury-Lemberg, is  clear: “The linen cloth of the Shroud of Turin  does not display any weaving or  sewing techniques which would speak against  its origin as a high quality product  of the textile workers of the first  century.” \nThis can be found at:   http://www.pbs.org/wnet/secrets/previous_seasons/case_shroudchrist/interview.html\n\n","date":"February 4, 2014 at 9:24 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76608","author":"jmarino240","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"“This kind of weave was special in antiquity because it denoted an extraordinary quality,” she says. (Less fine linens of the first century would have had a one-to-one herringbone pattern). ”\nYes, Flury-Lemberg is quite right but what she does not add is that no example is known from pre-250 AD. The relevant article  on 3/1 is  Daniel De Jonghe ‘From the Roman horizontal loom to the 3/1 twill damask loom of the early medieval period’, in Penelope Walton Rogers, et.al. (eds.) The Roman Textile Industry and its Influence, Oxford, 2001, pp. 137-147.\nThe Masada stitch has been explored extensively in these posts and shown to be ,in fact, a common stitch used even up to this day, even by my wife when she was a theatre costume designer and used the same stitch to put together different materials. Wilson was thoroughly misleading on this, perhaps because he has never done any sewing!\n\n","date":"February 5, 2014 at 4:25 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76682","author":"Charles Freeman","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Various people, such as Flury-Lemberg and Rogers, have said that the shroud weave was not incompatible with Middle Eastern 1st Century manufacture. However it is also not incompatible with Medieval Scandinavian manufacture (lots of old 3/1 twills there), or dynastic Egyptian manufacture (Rameses’s belt), or all sorts of others. Being compatible with one known archaeology does not exclude it from being compatible with others. I believe Flury-Lemberg chose her words carefully.\nAnd where does the quotation about Flury-Lemberg’s 2002 examination of the shroud come from: “She first noticed that the entire cloth was crafted with a weave known as a three-to-one herringbone pattern.” This feature of the weave has been known for as long as the shroud has been examined and could not have been much of a surprise.\n\n","date":"February 5, 2014 at 4:45 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76684","author":"Hugh Farey","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"The quotation no doubt comes from her book “Sindone 2002” (Editrice ODPF,   Torino, 2003).\n\n","date":"February 5, 2014 at 1:50 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76783","author":"jmarino240","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Those quotes from MFL appeared in this source, which I tracked down on Google:\nhttp://www.pbs.org/wnet/secrets/previous_seasons/case_shroudchrist/interview.html\nYes, the error of a 1/1 “herringbone weave” is repeated there, probably not her words, but the writer’s. What needs stressing is that the “12th century” illustration being referred to is almost certainly our old friend the Hungarian Pray Codex. What most here, and MFL interpret as the TS in one of the illustrations is probably just thus patterned lid of a sarcophagus, and without certainty that it is not, cannot be casually slipped in as support for any argument re the provenance of the TS.\nThere was a suggestion on a Rolfe TV programme re the TS that it was MFL who was first to suggest that the groupings of little circles on that same shroud/lid was the illustrator signalling he had seen the Shroud (and somehow thought it appropriate to add burn holes to the de novo Shroud in the rock tomb). Methinks the lady should stick to her textiles, and leave the interpretation of ancient manuscripts (especially those with almost cartoon-like illustrations) to others who can look at a particular one in the context of scores or hundreds of others of the same era. Or perhaps she would like to hear my “expert” views of the weave pattern of the TS.\n\n","date":"February 5, 2014 at 4:47 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76685","author":"colinsberry","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"There is no indication that ancestry is necessarily a qualification for respect in #48, it was just mentioned as part of his bio. De Brienne was a staunch defender of conservative Catholicism and this was on his own initiative, he was not playing the role of Duke of Norfolk in France, some kind of leader of Catholicism in that country.\nGiven his position, he had access to Church authorities and prominent Shroud scholars, from whom he may have derived some of his conclusions, although Iam sure not everyone would agree with what was voiced in France, given what Ian Wilson wrote in the BSTS newsletters when he was the editor. \nDe Brienne wrote a number of books:\nhttp://danielraffarddebrienne.hautetfort.com/\n\n","date":"February 4, 2014 at 9:38 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76467","author":"Louis","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"\njmarino240 :\nI would say that STURP’s “conclusions established in favour of the authenticity of the shroud” was more in the sense that they didn’t find any concrete evidence that it was a medieval forgery.  Barrie Schwortz has said he expected to find evidence of brush strokes in the 1st 30 minutes they were there and Ray Rogers said that if you gave him 15 minutes he would have it (the Shroud’s possible authenticity) shot full of holes (hence his reputation as a “gun-slinger”).  If, in fact, the Shroud was a forgery, one would expect that STURP would have found something major to indicate that but they didn’t.  And all of this once again points towards the idea that the C-14 dating, which is often wrong and dispensed with when trying to determine the date of an object, was wrong for some reason in the case of the Shroud.\n\nSTURP’s chief fault, as I’ve said before, was in asking the wrong question. When you have an unusual negative image, with some of the properties of a modern photograph, why go spending so long looking for iron or other paint pigments? Why was there not greater attention given to the chemical alteration of linen fibres, to the precise depth of penetration, to the mechanical properties of image v non-image fibres,  to identifying the chemical nature of the diimide reduction products, e.g. by pyrolysis mass spectrometry. Why was there no attempt to isolate and positively identify “bilirubin” or “protoporphyrin IX”. Why did Rogers get hung up on hypothetical starch coatings, when there was a botanical layer called the primary cell wall that matched his guesstimates of image thickness? \nShall I tell you why? Because most of STURP’s personnel were drawn from the world of things (explosives, engineering, porphyrin structures etc) when they should have come from the world of real, fundamental open-ended science, i.e. the world of IDEAS!\n\n","date":"February 4, 2014 at 10:09 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76479","author":"colinsberry","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"CB does not realize that he is currently working on the basis of STURP’s work.\nInstead of being respectful towards this work he always try to denigrate it.\nWhen STURP was funded, we did know almost nothing about the nature of the TS image and blood stains.\nCB: ” STURP’s chief fault, as I’ve said before, was in asking the wrong question. When you have an unusual negative image, with some of the properties of a modern photograph, why go spending so long looking for iron or other paint pigments?”\nThe wrong question? Really?\nDoes CB know that it was THE question at the time (and later: see Mc Crone), i.e is it a paint, a dye or something else ? \nCB: “Why was there not greater attention given to the chemical alteration of linen fibres, to the precise depth of penetration, to the mechanical properties of image v non-image fibres, to identifying the chemical nature of the diimide reduction products, e.g. by pyrolysis mass spectrometry. Why was there no attempt to isolate and positively identify “bilirubin” or “protoporphyrin IX”.\nBecause, Adler, Heller and Rogers had only some samples from the surface of the TS.\nIncidentally, regarding Protoporphyrin IX, Adler wrote: ” We employed the vapor method as we had hoped to take a microspectrum of the converted material to establish that it was specifically protoporphyrin IX. Unfortunately, the sticky tape was specifically etched by the formic acid treatment and became optically intractable.. thus we were unable to provide the absolute final confirmation of the identity of the blood area material”.(“Blood on the Shroud of Turin”, Heller and Adler, Applied Optics, 19 (16, 1980))\nSTURP performed the best possible work at the time with the data they had.\nCB’s criticism of STURP is a perfect example of anachronism.\n.\n\n","date":"February 11, 2014 at 5:46 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-78423","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Thibault: in case you were not aware, I have severed my connection with this site, so shall respond on my own site in due course (not immediately).\nMy interest right now is with the martyred St.Lawrence of Rome, prompted almost two years ago by a comment here from Max Patrick Hamon, for the clue his manner of execution provides to an understanding of the medieval graphics on the Lirey pilgrim’s badge and indeed to the Shroud of Lirey (TS Mark 1). \nThat is all I wish to say here.\n\n","date":"February 11, 2014 at 6:14 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-78432","author":"colinsberry","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"In one of the previous messages\ndaveb of wellington nz February 2, 2014 at 3:46 pm\nwrote :\n>There are clearly limits to what can be\ndiscovered with NDT methods alone.\nSo, what are the exact limits about the “NDT methods alone” ?\nFor example :\nI am curious to see what is the result from the SPM controls\nabout the tunic of Saint Francis of Assisi …\nIn the past we have known what was the scientific truth :\n>”The tunic and cushion from Cortona were found compatible with the period\nin which Saint Francis lived but the one from Florence wasn’t,” said\nPier Andrea Mandò, director of the Nuclear Physics Laboratory\nin Florence, where the work was done by the Laboratory of\nNuclear Techniques for Cultural Heritage.\nSource :\nhttp://www.telegraph.co.uk/science/science-news/3305860/St-Francis-of-Assisi-robe-is-a-fake.html\nPerhaps (before to work [in vain] on linen fibrils from the Holy Shroud),\nit will be interesting to know what is the answer on these relics\nusing the NDT controls.\nWhat is your opinion ?\n\n","date":"February 4, 2014 at 10:18 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76483","author":"piero","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Piero: NDT = “Non-destructive Testing”.\nRemoval of samples from the cloth, representative or otherwise, is in a sense “destructive” of the original object, it is no longer strictly entire. NDT would tend to confine testing to microscope examination, or examination by benign lighting including raking light, UV, or infra-red, and there are clearly limits to what can be accomplished in this way. A considerable degree of forensic success was accomplished by detailed examination of the various photographs.  Any chemical or C14, or ultimate or yield strength testing of samples is destructive of the original samples. Yet at present, these methods remain essential if the properties of the cloth and its image are to be fully understood.\n\n","date":"February 4, 2014 at 4:22 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76551","author":"daveb of wellington nz","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Do you know the AFM measurements of nanoscale mechanical properties ?\nIn other words you have to read :\nProbing delicate samples : stiff AFM mechanics at soft forces\nhttp://iopscience.iop.org/0957-4484/labtalk-article/48521\nResearchers Jason Killgore and Donna Hurley at the National Institute of Standards and Technology in Boulder, US, achieved these results using an AFM technique called contact resonance spectroscopy. The method involves analysing the resonance frequency of a vibrating AFM cantilever when the probe tip is in physical contact with the sample of interest. \nFrom measurements of the contact-resonance frequencies, information is obtained about the interaction forces between the tip and the sample – for example, contact stiffness. Models for the tip-sample contact mechanics can then be used to relate the contact stiffness to mechanical properties such as elastic modulus … …\n\n","date":"February 5, 2014 at 10:58 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76746","author":"Piero","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"We have to avoid the great destructions .\n— —\nYou wrote :\n“Removal of samples from the cloth, representative or otherwise, is in a sense “destructive” of the original object, it is no longer strictly entire”\nthen there are the useful samples at disposal that were taken in the past from the Holy Shroud and we can work (if we have permission to use the precious samples !) using the advanced controls (= NDT with AFM techniques) on these samples.\nThe AFM produces images of materials at the nanoscale level and provides a true three-dimensional surface profile.\nUsing the CFM (Chemical Force Microscopy) we can understand the chemical features (chemical mapping\nthe explored areas).\nSee also : the chemical groups (-OH and/or -COOH or -CHO groups), lignins (See for example : the Wiesner test used by Ray Rogers and the vanillin loss from lignin … and this new way to control the textile material), etc., etc.\nPerhaps we can detect something of useful around the BIF.\nDo you agree ?\nAs I wrote in the past, there are two main ways :\n– AFM controls addressed towards the cellulosic DP detection\nand\n– AFM bending tests (three-point bending test, etc.)\nUsing atomic force microscopy (AFM), we can probe the mechanical properties.\nTo determine the mechanical properties, we have to perform three-point bending tests with an atomic force microscope …\nSo the question is the following :\nAre we able to use AFM bending experiments\nas a mechanical characterization method ?\nUntil now we have known that fibers are positioned on a structured substrate and deformed with the AFM cantilever\nand this is only the basic information …\nReferences :\nhttp://en.wikipedia.org/wiki/Three_point_flexural_test\nhttp://www.pcii.uni-bayreuth.de/rg_fery/en/projects/micromechanics_and_interactions/nanomechanics_of_fibers/index.html\n\n","date":"February 5, 2014 at 11:54 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76763","author":"Piero","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"CF at #56: ” “This kind of weave was special in antiquity because it denoted an extraordinary quality,” she says. (Less fine linens of the first century would have had a one-to-one herringbone pattern). ” Yes, Flury-Lemberg is quite right but what she does not add is that no example is known from pre-250 AD. ” \nIt may be that the Romans caught up with Middle East weaving complexity by around 250AD.  However there are any number of far more complex weaves than a 3:1 twill dating from the first millenium BCE.  Whether they’re in wool or linen is irrelevant. The point is they had the technology for complex weaves.  \nCF: “The Masada stitch has been explored extensively in these posts and shown to be,in fact, a common stitch used even up to this day, even by my wife when she was a theatre costume designer and used the same stitch to put together different materials.” \nThe comment concerning the Masada-like stitch was apparently made by Mme Flury-Lemburg.  Clearly she considered she had sufficient evidence to satisfy herself in order to make such a comment.  Possibly Mrs Charles Freeman is relying on a sketch from Ian Wilson, which perhaps does not adequately convey the features that Mme FL seems to have observed.  \nCSB: “Methinks the lady should stick to her textiles, and leave the interpretation of ancient manuscripts (especially those with almost cartoon-like illustrations) to others who can look at a particular one in the context of scores or hundreds of others of the same era. Or perhaps she would like to hear my “expert” views of the weave pattern of the TS.” \nIt would seem that Colin is not only now an expert on interpreting ancient manuscripts, but also claims to have achieved sufficient expertise in textiles to correct Mme Flury-Lemburg.\n\n","date":"February 5, 2014 at 6:07 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76698","author":"daveb of wellington nz","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"‘The point is they had the technology for complex weaves.’\nNo one doubts that-just look at the complexity of the Ramesses Girdle now in Liverpool. We are looking for examples of a specific  3/1 weave and, as yet, no others exist before about 250 and these in silk damask, other than apparently one workshop making 3/1 tunics in Egypt in the second century AD. It amazes me that people who claim to know so much about the Shroud have not done any wider reading on the issues but seem to recycle a number of ambiguous comments again and again.\n‘Possibly Mrs Charles Freeman is relying on a sketch from Ian Wilson, which perhaps does not adequately convey the features that Mme FL seems to have observed.’\n No, she looked at photocopies from the excavation reports after I had checked out from F-L’s comments which was the right stitch.Having seen the mess-up Ian Wilson made of reproducing the Della Rovere depiction of the body of Christ , even getting the arms the wrong way round, and his interpretation of the tetradiplon folds that show a cloth folded in double only three, not four, times, I would not work from him but rather the original work of professionals.\n\n","date":"February 5, 2014 at 11:40 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76759","author":"Charles Freeman","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Absence of evidence is not evidence of absence. This also applies to medieval scorch technology. It applies both ways. Just saying…\n\n","date":"February 5, 2014 at 11:54 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76762","author":"David Goulet","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Charles, there are said to be 3×1 weaves at V&A. Were you able to check this?\n\n","date":"February 5, 2014 at 12:38 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76771","author":"Louis","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Louis,I have not seen them but the V and A references are apparently ‘7027-1860’, ‘8615-1863’. It seems quite difficult to find out more although you should be able to make an enquiry to the textile department. I got one answer on a completely different topic when one of their staff gave me a list of articles of the medieval textile trade.\n\n","date":"February 5, 2014 at 2:26 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76788","author":"Charles Freeman","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Colin wrote above: ” Methinks the lady should stick to her textiles, and leave the interpretation of ancient manuscripts. . .”\nColin, listen to yourself. You go about acting like a polymath: an expert on ancient medals, Templar history and all manner of things and people while criticizing Flury-Lemberg for stepping out of what you have defined as her boundaries when it comes to expertise. It is getting old, this act of yours of being the junkyard dog of shroud research. It is tiresome. Two years ago you arrived on the scene and with no foundation in shroud science you started criticizing the work of fellow scientists like Al Adler, and Paolo Di Lazzaro by calling their work “Mickey Mouse science.” You called the folks at ENEA “idiots” and a “bunch of jokers.”  Lately you have been telling us all about Rogers. Those who knew him know that you have no idea what you are talking about. \nKim Johnson of the New Mexicans for Science and Reason wrote the following as part of an obituary for Rogers who was also a member of this skeptical society. “He was a Fellow at Los Alamos National Laboratory, and tried to be an excellent, open minded scientist in all things. In particular, he had no pony in the ‘Shroud of Turin’ horserace, but was terribly interested in making sure that neither proponents nor skeptics let their scientific judgment be clouded by their preconceptions. He just wanted to date and analyze the thing. He died on March 8th from cancer. He was a good man, and tried his best to do honest science.”\nI read hundreds of emails by Rogers. I read his papers. He didn’t go about blasting other people. He didn’t need to. \nMethinks Colin, the “sciencebod” as he calls himself, should stick to his field of chemistry, and leave the interpretation of ancient history (medals and the Hungarian Pray Codex) and the evaluation of other people’s performance and expertize to those who know what they are talking about. \nTwo years ago, when you started commenting in this blog, I had hoped for a helpful skeptic who was a good chemist. You have been that and you have made a valuable contribution. And actually, and I hate to admit it, your speculation about medals and the Pray Manuscript are fine and helpful, as well. We need to think more about these things. But these endless put downs of others. One wonders why.\n\n","date":"February 5, 2014 at 8:03 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76715","author":"Dan","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"My putdowns are a necessary antidote to the placing of STURP investigators on pedestals, with serious criticism from science generalists such as myself (I’m not simply a “chemist” btw) being considered taboo, especially if the individual has passed on.\nI was thinking of posting a summary of my totally inexpert musings on various aspects of the Shroud here first, Dan Porter, claiming it to be an unusually inclusive attempt to incorporate as much existing evidence of numerous different disciplines as possible (someone has to attempt it, albeit being labelled as pretentious by the Dan Porters of this world). Then and only then would I  park it on my own site and let the dust settle.\nWell, that’s no longer an option Dan Porter, thanks to the total failure on your part to show even-handedness on this site, allowing folk to insult me on an almost daily basis, rarely constrainig, and then jumpiing on me as soon as I refer to someone like Di Lazzaro as a Mickey Mouse scientist (which he is – it being his Mickey Mouse claims based on uv laser beams that renewed an interest in the TS that I acquired back in the late 70s).\nNope. I don’t care for editorial bias, anymore than I care for bias displayed by so-called scientists. Anyone seeking an UNBIASED view of the facts, weighing pros against cons, a two year labour of love, should take a look at my site in the next day or two.\nAdler? Rogers? They should have been alllowed peripheral roles only, and told NOT to give the STURP imprimateur to their model building that was unsupported. STURP was a busted flush when it had to admit that the TS remains a mystery. That’s because STURP research was derailed by the premature model-builders, displaying multiple blind spots tobvious to assorted professionals in other specialities. \nKindly stop labelling me a specialist, Dan. You do yourself no credit in attempting to pigeon-hole me in that manner.  Oh, and I also taught up to University entrance and pre-clinical medical school level for several years, so am quite accustomed to operating ‘out-of- specialist-research area’ as did, incidentally, Alan Adler and Ray Rogers and a few others one could name.. \nThe TS is a multidisciplinary research area, requiring folk, regardless of speciality  to venture opinions (as distinct from dogmatic assertions) based on broad scientific judgement.  And given the interface between science and religious belief – especially religious dogma-  they must also be prepared to put their heads above the parapet, and be prepared to blow the whistle on  any new research, especially that sent straight to newspapers and TV, that carries the slightest whiff of being agenda-driven (consciously or otherwise). That’s the nature of the beast – the misuse of science to promote agendas (like Di Lazzaro hoping his findings would  encourage folk to think about philosophy and theology. Only a Mickey Mouse scientist would have said that in his press releases).\n\n","date":"February 5, 2014 at 8:43 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76725","author":"colinsberry","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"But why are your putdowns healthy to the discussion yet when putdowns come your way “it’s a pox upon them”?\nIf you’re going to charge in here like Andy Capp on a Saturday night then expect a dustup. Why not come in on a Wednesday afternoon and share a quiet pint once in awhile?\n\n","date":"February 5, 2014 at 10:50 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76743","author":"David Goulet","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Well said Dan..\n\n","date":"February 5, 2014 at 2:16 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76786","author":"Mike M","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Charles:Louis,I have not seen them but the V and A references are apparently ’7027-1860′, ’8615-1863′. It seems quite difficult to find out more although you should be able to make an enquiry to the textile department. I got one answer on a completely different topic when one of their staff gave me a list of articles of the medieval textile trade.\nCharles, Thank you, I did maintain some contact with them around two years ago, however it reached a dead end because my query met with silence.\n\n","date":"February 5, 2014 at 2:51 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76791","author":"Louis","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"If indeed Charles is correct in asserting that there are no other 3:1 twill weaves in the Middle East before 250AD, and if indeed the Shroud is the authentic burial cloth of Jesus Christ, this may open the possibility that the cloth may have been imported to Palestine, conceivably by some Roman centurion formerly stationed at a Gallic garrison.  Does that one fly? Alternatively there has to be a first time for everything, and just maybe the Shroud cloth was the first example in the ME of attempting a 3:1 twill. Not then repeated, as with their equipment it may have proved too tiresome and difficult to do again.  Still, Mme Flury-Lemburg must have had a reason for making the Masada comment on the selvedge stitching. If it was a routine stitch as Charles asserts, then why could she not identify it as such? She would surely be aware of it. This then raises the question of wondering whatever happened to the remaning bolt from which the Shroud cloth was cut?  Probably it has since perished. A pity.\n\n","date":"February 5, 2014 at 3:20 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76801","author":"daveb of wellington nz","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"‘If indeed Charles is correct in asserting that there are no other 3:1 twill weaves in the Middle East before 250AD,’\nI only said that there were no SURVIVING examples but ,as I understand it, there is concurrent evidence that the looms able to make 3/1 were a later development.\n\n","date":"February 5, 2014 at 4:06 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76809","author":"Charles Freeman","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"So based on your findings it seems the Shroud, based on the weave, cannot be 1st century. Is this your conclusion?\n\n","date":"February 5, 2014 at 6:28 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76839","author":"David Goulet","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"As commented months ago, there seems to have been no reason for Jews to not use imported cloth Jews in Roman-occupied Palestine as long as there was no “mixing of kinds”. Leviticus 19:19 mentions the prohibition of mixing linen and wool.\n\n","date":"February 5, 2014 at 3:36 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76804","author":"Louis","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Louis. No, and as we have already discussed in an earlier posting, a Z twist for the yarn does suggest that the yarn was spun in Europe rather than the east, a tradition that continued well into the Middle Ages. One must remember that the end of the first century BC and the first century AD were an age of enormous expansion of trade after things had settled after the civil wars. Then there was the spread of Roman officials, legions ,etc. The excavators at Masada found Z spun threads that they assume came in with Roman soldiers from Europe (the weaves of these also correlated with European examples).\nBut this is all assuming that the Shroud is authentic, starting from there and THEN trying to fill in all the problems that arise from that.\n\n","date":"February 6, 2014 at 4:58 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76950","author":"Charles Freeman","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"It seems difficult to believe in a roman cloth (= the Shroud = … at sometime, someone, in Jerusalem sold some z-spun linen from somewhere … ).\nIs it possible to prove that particular idea ?\nWhere is the reliable proof ?\nHave you forgotten the discoveries in Palymira ?\n— —\nI have read ( http://digitalcommons.unl.edu/tsaconf/385/)\nthat :\n>Oriental silks were utilized especially in Palmyrene funerary contexts where they were cut into long strips with which to wrap individual mummies. These bodies had been chemically treated with bitumen and spices to preserve the flesh and the outward appearance of the deceased for as long as possible. …\n— —\nB.T.W. :\nI am curious about that information (= The Women of Palmyra–Textile Workshops and the Influence of the Silk Trade in Roman Syria. Epoch for that scenario : second century A.D.) : perhaps there was … also the silkmarine byssus …\nHave you found an interesting information on that question ?\nSee also :\n1a) Stauffer, Annamarie. “Textiles from Palmyra: Local Production and the Import and Imitation of Chinese Silk Weavings.” International Colloquium on Palmyra and the Silk Road, AAS. Vol. 42. 1996.\n1bis) Schmidt-Colinet, Andreas, Annemarie Stauffer, and Khālid Asʻad. Die Textilien aus Palmyra. Vol. 8. Ph. von Zabern, 2000.\n2) Title: The Textiles from Palmyra\nAuthor(s): SCHMIDT-COLINET, Andreas\nJournal: ARAM Periodical\nVolume: 7   Issue: 1   Date: 1995\nPages: 47-51\nDOI: 10.2143/ARAM.7.1.2002217\n\n","date":"February 6, 2014 at 1:42 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-77047","author":"piero","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Piero: I went to check the Palmyra site, but it was too slow to respond, maybe your posting resulted in a lot of other Shroudies checking it out and the site was overwhelmed? ;-) Luke says that Joseph “bought a Shroud”, but we don’t really know what the original purpose of the cloth was. Was it intended as Joseph’s own shroud for himself, or was it his temple garment, or was it just the only suitable piece of cloth he was able to lay his hands on in an emergency during Preparation Day, while the Jerusalem markets were closing down for a holiday? We don’t know!\n\n","date":"February 6, 2014 at 3:42 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-77065","author":"daveb of wellington nz","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"That’s right, Charles. It becomes clear that a lot more work will be needed in researching textiles.\n\n","date":"February 6, 2014 at 4:39 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-77076","author":"Louis","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Given the clashes seen above, I thought it worthwhile posting this link where Pope Francis gives some tips about how to use the internet.\nhttp://www.ilsussidiario.net/News/English-Spoken-Here/Arts-Entertainment/2014/1/25/INTERNET-Says-Pope-Francis-Toughen-up-people-/461834/\n\n","date":"February 5, 2014 at 4:12 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-76812","author":"Louis","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"There is a book by John Lupia :\nThe Ancient Jewish Shroud At Turin\n(Regina Caeli Press, 2010).\nHave you read that book ?\nLink :\nhttp://www.reginacaelipress.com/\nWas the Shroud of Turin an ancient Jewish tallit ?\nYou can read the following explanation :\n>The Ancient Jewish Tallit design was not unique but a common type of himation garment worn by the pagans (Greeks and Romans) as well, but without the sacred fringe in each corner called tzitzyot (plural of tzitzit).\n>This four arm slit garment was called an amphimaschalos, that it, double arm holed.\n>The long rectangular linen garment was folded in half so that each pair of arm holes lined up allowing the man to slide his hand and arm through each.\nDo you agree on that description ?\n>It was unknown before the 17th century that the tallit\nwas identifiable as the burial shroud of Jesus Christ,\nand the ancient Jewish tallit form was not known until the 20th century.\nDo you agree with that information ?\nUnder the address :\nhttp://greatshroudofturinfaq.com/Crazy/tallit.html\nWe can read :\n>The idea that the Shroud of Turin was Jesus’ tallit (prayer shawl) has been proposed by author John Lupia. This, he argues, confirms its authenticity. Unfortunately, Mr. Lupia’s arguments are, at best, tentative. He bases his conclusion on two weak citations from old literature (A.D. 1653 and 1903), some questionable translations of scripture by the author himself and some highly imaginative interpretations of the Gospels …\n>… … Mr. Lupia has not been able to convince any other scholar of the shroud.\nBut, under :\nhttp://www.amazon.com/The-Ancient-Jewish-Shroud-Turin/product-reviews/0982673906\nwe read :\n>Mr. Porter attempts to dissuade the reader that this book fails to demonstrate that the Shroud of Turin is an ancient Jewish tallit when the book is chock full of standard archaeological evidence and proof that it is confirming the identification, not merely presenting an unsubstantiated claim as he would have you think. Porter falsely alleges that this evidence and proof is solely based on “two weak citations from old literature (A.D. 1653 and 1903), when the book contains a myriad of witnesses and citations as well as graphic illustrations that prove the point remarkably.\nSo … Where is the truth ? …\n\n","date":"February 7, 2014 at 9:58 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-77246","author":"piero","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Piero, I think the “tallits”, prayer shawls, were longer in the biblical period, however we do not know if these were made of linen, they at least had to be in keeping with what is in Deuteronomy.\n\n","date":"February 7, 2014 at 11:38 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-77274","author":"Louis","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Here the ideas … or the reasoning (= how to proceed) : \nWe have to test the linen fibrils using the preliminar\nbending tests on treated materials (neutron irradiated,\nproton irradiated, etc.) in comparison with the other linen\nmaterial (not treated).\nSo we can observe what happens (= differences from\nthe set of data obtained) …\nand then you can see the shift (for example : in the case\nof neutron irradiated linen) on your set of data (graphic\nrepresentation).\n— — —\nHere a link :\nhttp://www.catscientific.com/how-to-prepare-linen-for-radiocarbon-dating/\n(= February 25, 2013, Bob Wilcox)\nHave you read that webpage ?\nHere some line :\n>Dating ancient samples such as linen is a delicate process\nmade more so by the scarcity of samples.  That’s why practice runs\nare made to refine the process by using small samples of regularly\navailable product that has been purposely neutron irradiated.\n>Process development is complex.  Among other things it involves\ncutting a well-washed sample of neutron irradiated linen into\nsmall squares such as 1 cm2.  The optimum sample size may\nvary depending on the texture of the linen.\n>These squares are homogenized to reduce samples\nto a size permitting accurate analysis of organic\nchlorine isotopes, an element present in linen as chlorine-35\nand -37. Neutron irradiation causes chlorine-35 to capture a\nneutron to make chlorine-36.\n>The analysis to determine the chlorine-36/chlorine-35 ratio\nis done on an accelerator mass spectrometer.  Otherwise stated,\nknowing the total chlorine content in the linen irradiated with\na known amount of neutrons would determine\nthe chlorine-36/chlorine-35 ratio to look for in the real sample. …\n— —\nIn my opinion the irradiated linen samples are more brittle, fragile …\nSo, performing the bending test we can observe this difference. \nThe main problem to solve is the following :\nwe have to work …\nHere a link :\nhttp://english.keskato.co.jp/products/kes_fb2.html\n>The tensile data obtained by this tester is approximately\nthe same value as that obtained in a strip-biaxial tensile measurement,\nbecause the mechanical unit uses wide specimen (20cm)\nwith 5cm space between the chucks.\n>As original sample length is 5cm with 20cm width,similar\ndata as strip biaxial test (biaxal test with one direction restricted)\nare obtained for tensile property …\n>Space between clamps: 1cm (maximum 20cm) \nBut … we have to use the advanced controls on linen fibrils\n(not fabrics)…\nIn other words : we have to modify the test …\nIs that a confused line of argument ?\n— —\nWhere is the correct AFM way ?\nI hope in your comments.\n\n","date":"February 7, 2014 at 11:48 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-77275","author":"piero","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"I see a complete lack of answers.\nSo…\nI beg your pardon about the possible confusion.\nFirst of all we have to know what can measure\nthe different apparels, because there are two\ndifferent levels of bending test :\nthe macro-bending and the micro- or nano-bending.\nThe AFM three-point bending test is in the field\nof micro- or nano-bending.\nIt’s easy to write the diagram of the segment of fiber\nunder analysis.\nDo you know Structural Mechanics ?\nIn my opinion this matter is useful\nalso in the case of thin layer on linen fibrils …\nSee, for example :  the thin-walled sections and the controls …\nA section is said to be thin-walled when one of its dimensions\n(the thickness) is clearly smaller than the others (see also : Bredt) …\n— —\nIn any case I hope to see the results obtained\nfrom the studies about the bending tests on treated linen\nmaterials (neutron irradiated, proton irradiated, etc.)\nin comparison with the other linen material (not treated).\nThese data are useful to discuss the dating and the BIF.\nUntil now we have not yet the useful works\n(Fanti don’t used the AFM systems) and then we have to wait …\n\n","date":"February 11, 2014 at 1:58 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-78361","author":"piero","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Prof. Fanti didn’t used the AFM but he s a Mechanical Engineer\nand then is able to write a Plan …\n\n","date":"February 11, 2014 at 2:02 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-78362","author":"piero","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Piero: I have not referred to the particular sources that you have given above.  However I am aware that there have been some speculations as to the original intended purpose of the Shroud cloth.  A A M van der Hoeven for instance has speculated that it may have been John Mark’s temple garment, “The Turin Shroud as John Mark’s temple garment”, A.A.M. van der Hoeven, http://www.JesusKing.info, October 14, 2011 . However there seems to be too much speculation for me and some confusion and inaccuracies in this particular paper, but it raises the question of just what purpose it may have served. Nevertheless vd Hoeven does include some interesting observations on the cloth, which suggest it may have served as a temple garment. \nHow did Joseph of Arimathea come by such an exceptionally fine cloth at such short notice on what was probably a public holiday = Preparation Day, when the markets probably closed early? The paschal lambs were being slaughtered at the temple at the time of Jesus’ death. Van der Hoeven offers one explanation.  Or was it Joseph’s own temple garment? Or did Joseph intend it as his own burial shround?  All these are possible answers, or perhaps none of them and something else! \nAda Grossi presented a paper at the Valencia Conference: “Jewish Shrouds and Funerary Customs: a Comparison with the Shroud of Turin”; Author: Ada Grossi; Valencia Shroud Conference, April 2012, which may shed furher light on the matter.\nI once had some Structural Mechanics as a practising Civil Engineer and so I follow some of your thread above. The sample sections you mention (5cm x 20cm)are however too large and invasive to apply to the Shroud, and would not be permitted. But I am hopeful that future tests using photospectroscopy with no need to take samples may prove the most promising line of enquiry to improve our knowledge and understanding of the nature of the textile composition of the Shroud.\n\n","date":"February 11, 2014 at 4:10 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-78389","author":"daveb of wellington nz","site":"shroudstory"},{"title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?","post":"Thank you for your answer !\nAs I wrote there are two kind of tests : at macro level and at micro- nano-level (= AFM bending tests).\nI am curious about your possible comments in the field of Structural Mechanics\n(AFM test and bending moment, etc.)…\n\n","date":"February 18, 2014 at 1:50 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","id":"comment-80394","author":"piero","site":"shroudstory"}]
