[{"title":"Jerry Coyne Pounces on the Earthquake Hypothesis","post":"One of the very great problems of Shroud science are the speculative theories that  can’t stand the light of day. Thus an elaborate concept is floated that is fodder for Shroud skeptics. There is enough hard scientific facts about the Shroud to support it’s authenticity in any court of law but not, perhaps, at the Oxford dining clubs.\nThe important point of the image is that it’s real and it’s there. Also, it was created at a time the body of Jesus was still in it and that the body appears to have disappeared before putrefaction exuded waste materials on to the fabric,\nAn argument that hypothesizes an earthquake  of unknown force at an unknown precise time and therefor  created the image may provide a some headlines, but those headlines as demonstrated by the earthquake theory are ultimately counter-productive.\nWe obviously need more science before we can “solve” the image problem. We are not there yet. However, the authenticity of the Shroud has, in my opinion been established  and the attributes if the image point in the direction of the Resurrection. \nIn my view, I must admit, if there was a Resurrection it would have entailed a process in itself that created he image. Ascribing the image to an earthquake is a distraction when the proponents capitalize on sensational reporting.\n\n","date":"February 21, 2014 at 8:17 am","url":"https://shroudstory.com/2014/02/21/jerry-coyne-pounces-on-the-earthquake-hypothesis/","cat":"carbon_14_dating","id":"comment-81143","author":"John Klotz","site":"shroudstory"},{"title":"Jerry Coyne Pounces on the Earthquake Hypothesis","post":"Since Jerry Coyne is incapable of discussing biological evolution honestly,  reading his views on religion is a waste of time. His colleague at the U. of Chicago, James Shapiro, advanced the theory that the new paradigm for the source of innovations in evolution is “natural genetic engineering,” replacing the old paradigm of “random mutations.” Coyne ridicules this idea. I’m not qualified to say who is right, but my guess is that Coyne just hates the word “engineering” because it implies that there is an engineer. Coyne is a fanatic as the link I gave to his blog yesterday proved.\n\n","date":"February 21, 2014 at 9:42 am","url":"https://shroudstory.com/2014/02/21/jerry-coyne-pounces-on-the-earthquake-hypothesis/","cat":"carbon_14_dating","id":"comment-81156","author":"David Roemer","site":"shroudstory"},{"title":"Jerry Coyne Pounces on the Earthquake Hypothesis","post":"Looks like a “straw-man” tactic.  Carpenteri’s ‘seismic neutron’ hypothesis is patently false, (like all other unspecified counter-evidence) therefore the Shroud is unauthentic, therefore religion is pseudo-science. An interesting sequence of non-sequiturs, if anyone can make any sense of the thread of Coyne’s argument.\n\n","date":"February 21, 2014 at 5:43 pm","url":"https://shroudstory.com/2014/02/21/jerry-coyne-pounces-on-the-earthquake-hypothesis/","cat":"carbon_14_dating","id":"comment-81236","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Jerry Coyne Pounces on the Earthquake Hypothesis","post":"Yes, you’re right; refuting Carpinteri as a way of claiming that Religion is pseudo-science is not unlike refuting Nazi eugenics as a way of claiming that Evolution is false. Every faction has a few “with friends like these who needs enemies” supporters, and Carpinteri is one of ours!\n\n","date":"February 21, 2014 at 5:52 pm","url":"https://shroudstory.com/2014/02/21/jerry-coyne-pounces-on-the-earthquake-hypothesis/","cat":"carbon_14_dating","id":"comment-81237","author":"Hugh Farey","site":"shroudstory"},{"title":"Jerry Coyne Pounces on the Earthquake Hypothesis","post":"Jerry Coyne has written for important publications and the trouble is that what he is proposing is metaphysical naturalism. If it is difficult to accept much of Christian philosopher Swinburne’s natural theology, it is even worse when it comes to Coyne. He doesn’t even seem to look before he leaps.\nCan he disprove that religion is natural and science is not? Even Freud, who dismissed religion as infantile neurosis, did not deny that there was a search for transcendence and it went beyond looking for “comfort in the mother’s womb”. This transcendence is what we could call faith, and faith is part of religion.\nLastly, why are scientists like Coyne so worried about the Shroud? Does it make them worry that they will be proved wrong? It looks like it does.\n\n","date":"February 21, 2014 at 7:48 pm","url":"https://shroudstory.com/2014/02/21/jerry-coyne-pounces-on-the-earthquake-hypothesis/","cat":"carbon_14_dating","id":"comment-81261","author":"Louis","site":"shroudstory"}]
