[{"title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins","post":"fantabulous. anyone write to chiver and stanford at the telegraph\n\n","date":"March 30, 2012 at 9:01 am","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","id":"comment-9786","author":"MouseInTheHouse","site":"shroudstory"},{"title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins","post":"Dawkins doesn’t have the qualifications to carry out this work.  He’s simply a biologist a little too in love with a theory that while elegant and absolutely valid, is not meant to answer every question in the universe.  Moreover, he lacks a little something called impartiality.  Someone as stubborn as Dawkins does not really have a scientific mind able to accept the possibility that he doesn’t know or understand something and to try to look for other answers.  Why in the world would any of us care what he thinks?\n\n","date":"March 30, 2012 at 9:45 am","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","id":"comment-9788","author":"Susana","site":"shroudstory"},{"title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins","post":"It is regrettable that Rolfe used Fanti’s paper for image criteria. The paper might be useful were it not for a sophomorically subjective, arbitrary and obviously biased scoring method put forth as an attempt to convince everyone that the image was formed by corona discharge. Does anyone agree?\nRichard Dawkins doesn’t have a Shroud blog that I know of. That is certainly a mistake in the open letter. He has a foundation blog that is probably a thousand times as big as this blog with many thousands of readers. His single shroud posting last December drew 353 comments. Do you really want his readers commenting on Fanti’s paper?  My recommendation is to use 3 or 4 criteria sourced from the ENEA work. That is what triggered Dawkins’ posting, after all.\n\n","date":"March 30, 2012 at 10:13 am","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","id":"comment-9790","author":"Paulette","site":"shroudstory"},{"title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins","post":"It’s nearly time someone got the ball rolling…and it sounds at the least,like a good place to start.\n\n","date":"March 30, 2012 at 10:22 am","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","id":"comment-9791","author":"john","site":"shroudstory"},{"title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins","post":"Honestly, I think that this kind of things do not contribute to provide a serious scientific image of the Shroud. It will only help fuel the controversy -once again near Eastern- on the media and not where a truly scientific discussion should be. This are the kind of things that will make the Shroud stay on the same shelf as UFO and yetis . Forever?. Unfortunately, this seems to be the fate of the SHroud studies. I don`t know if Fanti -after all someone from the academia- is actively cooperating with this new episode but it all is truly sad. WHy is it that those who claim most that more science on the SHroud is needed are the first ones to jump to the media, where obviosuly science facts cannot be discussed seriously?\n\n","date":"March 30, 2012 at 10:33 am","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","id":"comment-9792","author":"Gabriel","site":"shroudstory"},{"title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins","post":"Gabriel, I say Amen to what you just said !  Bravo !  I agree completely.  And I can add another question to the last question you ask :  Why is it that those who claim to be “authentic sindonologist” always seem to publish some new book on the Shroud that belong very often in the “paranormal” section of libraries ?  It seem to me that at least 90% of the new books on the Shroud these days always turn around some new (or old) controversy instead of being prudent and clever (as any good scientific book should be) !!!  \nIn other words, I can say that I have a deep (and bad) feeling that the vast majority of these authors do not seek the truth but, instead, they seek to be famous and make money !!!  Maybe some people could say to me that this is normal in the full media age we’re in, but I don’t agree with this point of view…  Personally, all I’m interested in regarding the Shroud is to know the truth.  Period.\n\n","date":"March 30, 2012 at 6:39 pm","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","id":"comment-9806","author":"Yannick Clément","site":"shroudstory"},{"title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins","post":"Why even offer to give money to a foundation whose only purpose is to mock and destroy religion, particularly Christianity?\n\n","date":"March 30, 2012 at 10:46 am","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","id":"comment-9794","author":"Johnson","site":"shroudstory"},{"title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins","post":"It’s no matter anyways, Dawkin’s won’t take on ANY challenge…He’s CHICKEN! …Won’t even take on William Lane Craig in debate lol.\nBawak, bawak, BAWAK!\n  ;-)\nR\n\n","date":"March 30, 2012 at 6:28 pm","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","id":"comment-9804","author":"Ron","site":"shroudstory"},{"title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins","post":"i think the challenge should be to duplicate the shroud since a 14th century man with one billionth of the technology we have now made this it should be a piece of cake. ha ha\n\n","date":"March 31, 2012 at 3:06 pm","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","id":"comment-9827","author":"paul","site":"shroudstory"},{"title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins","post":"It’s all in the stars people!   Seek and ye shall find!\nOne doesn’t have to be a rocket scientist; one just has to have a pair of good eyes.\nFact:  Pia Secondo took a photo of the face on the Shroud and then he developed the photo.  The image on his negative is the face we see of Jesus today (Shroud image). \nI duplicated this process with the Sudarium of Oviedo (the head napkin that covered the head of Jesus in the tomb).  I downloaded the Sudarium photo and then printed it out.\nI then took a photo with my digital camera and printed out that image.\nAnd unbelievably, there it was.  The Oviedo cloth contained the same face as that on the Shroud of Turin. \nThe Shroud scientists have also confirmed the blood spots on both the Shroud and the Sudarium line up exactly, and both have AB blood type.  These scientists concluded both head napkin and shroud covered the same man.\nI then downloaded the “Hand of God” image taken by the NASA Chandra telescope.  This pulsar is 17,000 light years away (equivalent to 1700 years ago).\nAfter downloading the Chandra image, I placed all three side by side.  Amazingly all three photos are of the same man.  No doubt about it!\nWith that in mind, the image of Jesus has appeared on two different cloths and once in the stars.  The Chandra image even contains a crown of red stars.  Check it out on Google images (Hand of God, Chandra telescope).\nGod has shown you His image and His wounds on both the Sudarium and the Shroud and He has shown you His exact image in the stars (1700 years ago)\nHow much more proof does one need?  \nAnd how does Dawkins explain the DNA double-helix and all the genetic coding of humans, plants and animals?  Only God could accomplish such engineering.\nDoes Dawkins believe the entire DNA chain just materialized in some primordial soup?  Amino acids maybe, but not DNA.  The probability of that happening is trillions to one.  \nThere are many who align themselves with Dawkins’ views, but I am of the opinion, like the old cliche,  “A one-eyed man is King in the land of the blind”\nBest,\nTamara Beryl Latham\n\n","date":"April 1, 2012 at 12:07 am","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","id":"comment-9831","author":"Tamara Beryl Latham","site":"shroudstory"},{"title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins","post":"David, \nIt is just too bad you don’t reserve the £20,000 to REALLY solve the mysterious image formation process of a human male body covered in blood on the Turin Shroud, namely to have an “open-minded Shroud researcher dream team” reconstruct the Shroud man’s burial in keeping with the most likely hypothesis the Shroud is Yeshua’s. \nWhen studied in the light of the Gospels, the Oral Torah (see tractates Semahot, Sanhedrin, Pessah and Sabbath), the Judean burial customs and practices of the Second Temple period (mostly pre-70CE Judaism History & Archaeology), archaeoastronomy (to determine the exact burial minimum & maximum time frames for Yeshua’s emergency burial on a Sabbath eve), philology (to take into account Hebrew time markers; Hebrew & Greek action & object markers), ancient textiles, paleopathology and archaeological blood pattern analysis, all points to one naturalistic/ritualistic direction and nothing to the contrary: an “(absolo)vaporographic mordanting” based on gradual linen-cloth-to-body loss of direct contact mechanism. \nThis most likely burial scenario to be tested and control via a very specific archaeological experiment implies the following:\nFirst, Yeshua’s naked body (still in hypothermia at 41-42° C?) covered in dried or drying bloody wounds and resting in extra height on two stones in the tomb antechamber, was tautly wrapped lengthwise in a lengthy burial sheet of fine linen (or inner shroud) soaked with an alkaline solution (warm waters mixed with the ashes of the Red Heifer and/or rich in Jerusalem limestone?) and then his legs and torso compressed/fastened widthwise, with fresh antiseptic insect repellent aromatic plants (together with a prayer shawl used as shorter shroud?), in two long strips first cut off/torn off from the main burial sheet and a shorter strip and/or a gauze veil to tie around the head (together with three wooden pieces — cut off/sawed off the Titulus crucis? — to be used as a “small jaw box” to make up for a faulty skullcap?).\nOnce his body was thus tightly wrapped up in linen, it was subjected to myrrhic-aleotic fumigation and left to dry up first on its left and then right side. Finally, his tightly wrapped up body was taken down to the tomb chamber and placed in supine position inside the sole funerary niche on a bed of blended myrrh and aloes to keep it from putrefying and the burial cave entrance sealed by a large stone disc. [In anticipation of honorary visits, his linen wrappings were to be anointed with the perfumed spicy oils the women had prepared immediately after the Sabbath and brought at the first hour of the first day of the Judean week (Sunday) to mask the stench of his decomposing corpse. However the anointing was not done as they found the tomb empty of Yeshua’s body on that very day]\nIn fraternitas sindonis\n\n","date":"April 6, 2012 at 5:29 am","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","id":"comment-10005","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins","post":"Correction: “a vaporographic mordanting” (of a thin impurity layer) based on (inner-) shroud-to-body gradual loss of direct contact mechanism (as the compressed inner shroud got taunt again through shrinkage)\n\n","date":"April 7, 2012 at 9:28 am","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","id":"comment-10061","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins","post":"additional correction: “got tautly again”\n\n","date":"April 7, 2012 at 9:41 am","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","id":"comment-10062","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins","post":"+++ correction: “got TAUT again” (sorry)\n\n","date":"April 7, 2012 at 9:43 am","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","id":"comment-10063","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins","post":"“Got taut again through shrinking”\n\n","date":"April 7, 2012 at 9:45 am","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","id":"comment-10064","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins","post":"Max, I agree with you that the money would be better off used in other ways 100%, but I have a problem with one technical part of your hypothesis (again), sorry. It has to do with the ‘assumed’ body temperature. Take note; I am not a doctor or a medical student but have been doing alot of research into this matter. With that clear; I can not see the body ever reaching a temp of 40C or even close. My Reasoning; The body had lost an excessive amount of blood well before death, this alone would lower the body temperature to a very low state, already causing the body to compensate, but then after death the body hung from the cross for atleast an hour and stayed out in the air for atleast two hours before being wrapped in the Shroud in the tomb. By this point the body temperature, one would ‘assume’ would be quite low already. The Shroud image shows no signs of putrefaction, no bloating, therefore one assumes the body left the Shroud before then and before any temperature increases due to internal decay could accumulate. One should expect the body temp would have continued to go lower due to the enviroment i.e; a cool tomb and cool temperatures.\nI may be completely wrong here, but from my studies it does not seem reasnable to expect the body to reach temeratures in the range you mentioned. If there is an expert in this field on this blog that can shed some light on this, I would be happy to hear it.\nRon\n\n","date":"April 7, 2012 at 10:08 am","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","id":"comment-10065","author":"Ron","site":"shroudstory"},{"title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins","post":"Correction: “in HYPERthermia”\n\n","date":"April 6, 2012 at 5:38 am","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","id":"comment-10006","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins","post":"Miguel Lorente Acosta MD, PhD, Forensic Doctor, University of Granada wrote about “Body Temperature” in conjunction with the Turin shroud wrote: \n“The human being is a homoeothermic animal that maintains its temperature due to a set of exothermic processes. When death occurs and these processes come to a stop, a progressive cooling of the body (already a corpse) begins until the body temperature matches the ambient temperature. This gradual process is known as cadaveric cooling or algor mortis.\nThe decrease of a corpse’s temperature takes place after a certain amount of time. At first, there is a plateau of thermal balance that can last up to two hours, and after that, the temperature decreases progressively.\nSometimes this evolution goes through a phase of hyperthermia, an increase rather than a decrease of the corpse’s temperature, but this only happens in extraordinary situations provoked by certain causes of death.\nIn the case of the studies of the Shroud of Turin, the evaluation of body temperature is only an indirect element that may have helped the formation of the image, as it facilitates the diffusion of the products from the contact (weft) side to the external (warp) side. The existence of hyperthermia would have helped the diffusion of the products and contributed to creating a delimitated and photographic image, since it would have acted along with the sweat produced by the sympathetic activation of shock which, due to its own composition and to the presence of other products derived from the blood, would have contributed to the formation of the image on the Shroud with the characteristics that we can observe today.\nIf Jesus had died of traumatic shock with an important hypovolemic component and with the multiple wounds distributed throughout, – especially if we keep in mind that the body was taken to the tomb, a cold and humid hollow in a rock, late in the afternoon, and that it was washed – the body’s temperature when it came into contact with the linen must have been inferior to average body temperature. This would have made the diffusion of the degradation products and the formation of the image on the side of the linen that did not come into direct contact with the body rather difficult. If, as we have discussed, he had not yet been dead, his physiopathological characteristics would have more than likely caused a hyperthermia that would have contributed to the formation of the images that we can observe on the Shroud.”\nHyperthermia is not “a must” within the economy of the scenario I propose. However, it just cannot be totally ruled out. Besides this possible internal heating source, the use of warm waters together with body aleotic/myrrhic-aloetic fumigation, as external-heating sources might well account for maintaining an elevated body temperature.\n\n","date":"April 7, 2012 at 12:27 pm","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","id":"comment-10080","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins","post":"Note: As he is neither a paleopathologist nor a forensic archaeologist familiar with Late Antique crucifixion theme, a forensic doctor has a mostly theoretical and incomplete knowledge of crucifixion victims to say nothing of pre-70CE Judean burial practices and customsl. His professional opinion ought therefore to be received with caution.\n\n","date":"April 8, 2012 at 7:15 am","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","id":"comment-10144","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins","post":"As far as i am concerned I have discovered an Australian film scientist who has solved the mystery of the Shroud of Turin by discovering the second Shroud check this out name is Vincenzo Giovanni Ruello. Using a simple film system he discovered the alive face of Christ in the St Peters Veronica Veil","date":"April 8, 2012 at 10:26 am","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","id":"comment-10157","author":"Peter Ford","site":"shroudstory"},{"title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins","post":"The shroud images were made by God literally “painting them on” like an artist painting a picture. This happened in a moment SHORTER THAN WE CAN MEASURE, and it has such images on the shroud as Michael the angel on the neck, the glorified Jesus on the chest, God’s image over the crown of thorns, satan’s face on the end of the pig tail shaped hair cut, and his face again in the lake of fire but all melted and deformed and smoking and flaming in the intense heat, located on the lower back. There is also 2 drum stick match stick or timpani beater like objects over the heart of Jesus, shaped in a pattern between a “V” and “X.” So if you can give me something for telling you, or at least buy the photos mentioned below, and we can arrange a secure method to make sure we do not get “ripped off.” I am completely trustworthy but that may not make you convinced just because I “say so.” My website is usaprayermission.com and I comment more about this on there too. — The shroud was more than likely in my opinion as record claims, boiled in oil and burned and washed and steamed throughout the centuries without so much as a slight fading or removal of the image. I totally believe God has and will eternally protect and preserve this image… \n(Edited to remove commercial message. )\n\n","date":"April 13, 2012 at 9:33 am","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","id":"comment-10336","author":"Joe Bonnette","site":"shroudstory"}]
