[{"title":"Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin","post":"Further to the findings of Sue Benford and Joe Marino, Rogers made his studies on Vanillin (chemically 4-hydroxy-3-methoxybenzaldehyde) content of the samples used for C-14 tests. Lignin is a chemical compound present in the flax plants used to make linen cloths. One of the major products obtained from the breakdown of lignin is vanillin. As linen ages, the vanillin content diminishes and eventually becomes untraceable in the course of time. Thus, by measuring the amount of vanillin remaining on the cloth, one might be able to estimate the age of the cloth. Rogers believed that vanillin was detectable in the sample taken for radiocarbon testing. Thus, it must date from medieval times. He believed that vanillin was also present in the ‘Holland cloth’ used to back the Shroud. However, he could not detect it in material taken from the rest of the Shroud.\nHad the findings of the C-14 test that the Shroud belongs to the 13th or 14 century been correct, it should have retained about 37% of its vanillin, reasoned Roger.  Not only does this verify that the carbon 14 sample is chemically different from the rest of Shroud, it proves that the carbon 14 sample contains much newer material. Further, examining the loss of the chemical vanillin in the Shroud, Rogers estimated that it is between 1,300 and 3,000 years old!\n\n","date":"January 19, 2011 at 9:14 pm","url":"https://shroudstory.com/2011/01/19/joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-2243","author":"Chidambaram Ramesh","site":"shroudstory"},{"title":"Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin","post":"This post pointed out an important fact dealing with intrusion material which I can’t help quoting “so many scientists didn’t anticipate the problem given that there were ample warning signs at the time.”\nAs far as I remember no one mentions Dr. John Tyrer’s advice on that matter, but I think it’s worth remembering.\nDr. John Tyrer a british textile expert published an article on the Shroud in textile journal Textile Horizons December 1981 entitled «Looking at the Shroud of Turin as a Textile» and after analyzing photographs of the Shroud ,just by looking at the place where Raes sample had been taken he stated “There is therefore some doubt as to wheter the sample described by Professor Raes as Piece II is the edging strip or part of a patch.IT IS IMPORTANT THAT THIS MATTER BE RESOLVED IF IT IS INTENDED THAT THE FORTHCOMING CARBONDATING TESTS ARE TO BE MADE ON RAES SAMPLE.THE PATCH IS PROBABLY MEDIEVAL.”\nThis was written in 1981.Is this the first clue to help invalidate radiocarbon test dating of the Shroud?\nI guess radiocarbon labs ignored this advice.\nIf someone is interested to read it the article is available in http://www.shroud.it  scientific articles \n                                       best regards\n                                       Maria da Glória \n                              Centro Português de Sindonologia\n\n","date":"January 20, 2011 at 10:21 am","url":"https://shroudstory.com/2011/01/19/joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-2248","author":"Maria da Glória Gonçalves Barroso","site":"shroudstory"},{"title":"Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin","post":"It was contact with a ufo that caused that imprint in the cloth..\n\n","date":"July 15, 2013 at 3:16 pm","url":"https://shroudstory.com/2011/01/19/joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-39030","author":"jenny","site":"shroudstory"}]
