[{"title":"John Klotz Delivers the Knockout","post":"There is a link in my CNN loses Jesus piece that doesn’t seem to work. The address of my blog that contains reviews of Quantum Christ and information on ordering it is:\nhttp://johnklotz.blogspot.com\n\n","date":"March 20, 2015 at 4:55 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-193844","author":"John Klotz","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"Hi John\nThank you very much for your excellent essay\nSampath\n\n","date":"March 21, 2015 at 5:02 pm","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-193968","author":"Sampath Fernando","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"sorry to diverge but just (another!) thought on the Pray Manuscript….sorry \nI’ve been looking at it tonight and would like to make a few observations:\n– the ‘cross’ or ‘+’ symbols in the middle of the rectangular object under the angel’s feet are curious…why has the artist changed the otherwise pyramid patterned object in the middle?\n– the red streaks are adjacent to this different pattern located centrally on the object\n– I speculate that the +’s might represent the body image on the shroud, with the red lines next to it representing the blood\nAnother observation. The cloth sitting on top of the rectangular object looks so small as to be representing the head cloth. If so, one would expect the shroud to be portrayed too. Does that support the case for the rectangular object to represent the shroud?  \nI realise this is all pretty speculative\n\n","date":"March 20, 2015 at 5:22 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-193845","author":"Thomas","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"Thomas,\nAs I note the Pray Codex is not a work of great are but is a drawing of the burial of Jesus. It clearly represents the “burn holes” in the same configuration as the Shroud. Ian Wilson points out other concurrences.\nWhy are the four holes there at all? Why did the artist add them? How is it that it replicates those found on the Shroud. ARE THERE ANY OTHER REPRESENTATION OF THE FOUR BURN HOLES IN ART REPRESENTING THE BURIAL OF JESUS THAT PREDATE THE PRAY CODEX? Did the purported forgers of the Shroud two centuries after the Pray Codex copy the Pray Codex? That’s a pretty ridiculous idea isn’t?\nAre you aware of the intrinsic involvement of the law of probabilities in Quantum mechanics? When I first learned of that several three or four decades ago, I had a brief crisis of faith. So too did Albert Einstein who objected saying “God does not play dice with the Universe.” Then I settled the issue when I asked “Whose law is the law of probabilities. Why should chaos be ordered at all?”\nThat struggle is reflected in the first five sentences of the Introduction of “Quantum Christ.”\n“We do not order our lives by proof beyond a reasonable doubt. Every day we make decisions after weighing the available facts. But almost always we have doubts. Fear the person who has no doubt. Think George Armstrong Custer.”\nFor those unfamiliar with the history of the American West, Custer was a leader renowned for his bravery and daring who led his regiment, the Seventh Cavalry into a horrible slaughter at the Battle of the Little Big Horn.\nThe odds against the fact that the artist of the Pray Codex did NOT copy either the Shroud of Turin or a copy of the Shroud of Turin are astronomical. Any one object? Show me any other representations of the holes in that precise configuration before 1260CE that involves the burial of Jesus. \nThe Shroud of Turin and the Pray codex are existing physical  objects. They are facts.\n\n","date":"March 20, 2015 at 5:52 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-193847","author":"John Klotz","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"“The odds against the fact that the artist of the Pray Codex did NOT copy either the Shroud of Turin or a copy of the Shroud of Turin are astronomical”\nThe odds were thoroughly  discussed  on this  blog recently.\nhttps://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/\nIf two persons decide to depict Jesus’ shroud, there will always be some resemblances, some similaries  between these  two depictions even if the only thing that connects them is Jesus’ shroud.\nIf I decide to draw a horse , it doesn’t mean that I am copying someone’s else drawing. I am just drawing a horse , and yes, it will definitely bear some resemblance with other people’s horse drawings that I never saw and will never see.\n\n","date":"March 20, 2015 at 6:33 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-193849","author":"PHPL","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"An astounding lack of logic.  If you were drawing a white horse with four brown, round, and connected spots, the resemblance would certainly indicate you had seen that horse drawn before.  The probabilities that it would be a coincidence are staggeringly small, as to be meaningless.\n\n","date":"March 20, 2015 at 7:35 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-193852","author":"Nabber","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"There are two examples of later copies of the Shroud in the paper. One interesting fact about the Lier Shroud is that the copy actually shows the differences in the burn holes as the instrumentality burned down through four layers. Some the holes decrease in sign and nearly disappear  entirely, See CNN paper, p. 5 Compare the actually configuration p. 4 with the Lier Shroud.\n\n","date":"March 20, 2015 at 8:07 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-193854","author":"John Klotz","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"I don’t believe you have read the discussion of my paper which discusses this in some detail.\nThe fact that distinguishes the Shroud of Turin from the copies of it are that the burn holes in the Shroud of Turin actual holes burned through the cloth. The copies have painted burn holes. See pages 3-6 of the paper posted on Shroud.com. It’s free!\n\n","date":"March 20, 2015 at 7:53 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-193853","author":"John Klotz","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"This reply was addressed to PHPL\n\n","date":"March 20, 2015 at 8:08 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-193855","author":"John Klotz","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"All this has been previously discussed before at length on several websites including this one  by people much more qualified than PHPL, John Klotz or Nabber,  and I don’t want to start a long and endless discussion, \nIf I follow  shroudies’ logic,  the guy who drew the Codex Pray (a very bad draughtsman by the way) cared about minor details like holes, (or was it just a decoration .. ?) but why didn’t he drew   the much more important significant  beard and moustache ?? Why is it that in the Shroud of Turin image, the right palm is over the base of the left hand, while in the Pray codex, the arms intersects above the wrists ?? \nAs I wrote above, two drawings depicting the same subject  can obviously share a few similarities, but this doesn’t mean that there is any connection between these two drawings as such. \n.\n\n","date":"March 20, 2015 at 9:15 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-193859","author":"PHPL","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"I can only guess that you didn’t read my paper as suggested. \nJCK\n\n","date":"March 20, 2015 at 9:18 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-193860","author":"John Klotz","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"“As I wrote above, two drawings depicting the same subject can obviously share a few similarities, but this doesn’t mean that there is any connection between these two drawings as such.” –PHPL\nTo repeat yourself as if no one had said anything doesn’t mean your statements will stand up.  \nThe similarity of the four holes (in an “L” shape) between the two has created a probability of one copying the other that approaches, very closely, certainty.  The problem of some other details not being copied (especially after 4 decades) has nothing logically to do with that first probability.  \nYou don’t know my qualifications, by the way, and evidently you are purposedly ignoring those of John Klotz.\n\n","date":"March 20, 2015 at 3:47 pm","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-193893","author":"Nabber","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"Even a broken clock is right twice a day and you nail it perfectly  when you write about the glaring differences .\n\n","date":"March 21, 2015 at 8:52 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-193946","author":"PHPL","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"“Later studies that included photographs at resolution as high as 3650 dpi demonstrated that the area tested was anomalous and not representative of the Shroud as a whole are largely ignored by skeptics.” I dispute that. These studies are in fact largely ignored by authenticists, in that they are assumed correct and quoted as gospel without any reference to what they actually say. Non-authenticists, on the other hand, have studied them in considerable detail, such that we can say with authority than any contamination of the radiocarbon corner of the shroud made it appear older, not younger, than it really is, and that there is no visible evidence, at any magnification, either of the enormous contamination or the enormous interweaving which would be necessary to discredit the radiocarbon date.\nThere is, as Dan and Prof. Ramsay say, evidence for an earlier date than the radiocarbon tests suggest, but so far a medieval date from those tests alone has not been discredited on their own terms, statistically or observationally.\n\n","date":"March 20, 2015 at 10:45 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-193869","author":"Hugh Farey","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"Hi Hugh,\n                    I see there’s someone named  Hugh Farey who  posts videos on youtube, is that you ?\n                    I must tell you that I’m pretty shocked by the way that Stephen E. Jones talks and refers to you on his blog. I do understand that someone may occasionally behave inappropriately by loosing his temper, but this guy seems unable (or has absolutely no intention ) to talk and communicate with you in a decent and civilized manner. Is all this normal ? You should perhaps consider ignoring him completely or start retaliating .\n                     Cordialement\n                     Patrick\n\n","date":"March 20, 2015 at 11:30 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-193875","author":"PHPL","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"Yes, I do lots of odd things, but most people find me friendly enough. I take my Christianity quite seriously though, and genuinely have no grudge against anybody. I have misjudged people’s views in the past, and upset others, and I truly wish I hadn’t, but I have always thought that personal animosity reflects more on the accuser than the accused, and try not to feel it myself. I think I’m quite successful – after all, I’ve had lots of practice!\n\n","date":"March 20, 2015 at 2:07 pm","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-193885","author":"Hugh Farey","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"https://www.academia.edu/11355553/Dr._Paolo_Di_Lazzaro_explains_his_research_on_image_formation_on_the_Shroud_of_Turin\nHugh, Professor  C. Ramsey changed his mind, as is evident in the above interview.\n\n","date":"March 20, 2015 at 1:06 pm","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-193882","author":"Louis","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"No, it isn’t. Ramsay’s opinions, new or old, are not stated in the interview. As far as I know he has not retracted his opinion that while the radiocarbon data have not been successfully challenged, other evidence suggests that the Shroud needs more investigation before a 1st century provenance can be conclusively rejected.\n\n","date":"March 20, 2015 at 2:19 pm","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-193887","author":"Hugh Farey","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"Hugh,\nHave you read the papers by Pam Moon and Donna Campbell that I cited and gave citations for? You must no Pam. I suspect she’s a member of the BSTS and has been organizing Shroud exhibition in England for decades. \nCould you honor us with citations available on the Internet that supports your claims? Both Moon’s and Campbell papers are illustrated so you can see for yourself. Campbell’s was based upon a photograph of the Oxford sample before it was destroyed during the carbon testing. Any post 1988 paper that discusses Oxford’s sample must use the same photograph. I doubt such a paper exists. Any rebuttal of Campbell would have to use the same photograph.\nDid you notice in my paper how Oxford was advised of cotton in there sample that was not modern contamination PRIOR to the destruction of the sample in testing. That’s from an article in the BSTS newsletter.\nCitations please!! I get a little tired of people responding to papers replete with citations without citing a single available source that supports their position. Your argument isn’t with me, its with published authors beginning with Ray Rogers and 3000+ DPI photographs showing encrusted fibers.You are entitled of course to your opinion but when seeking to rebut conclusions drawn from published papers and physical evidence, if you can’t respond in kind you are as a former President of  the US with a rustic background once  said “hollerin down a rain barrel.”\n\n","date":"March 21, 2015 at 6:12 pm","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-193969","author":"John Klotz","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"I quite agree, John; I’m a fanatical “primary sources” man myself. However, as in this case I had only recently proposed my claim, I hoped it would not be necessary to re-quote all my observations in detail.\nClaim: “We can say with authority than any contamination of the radiocarbon corner of the shroud made it appear older, not younger, than it really is.” This is based on John M. Morgan III’s paper ‘Digital image processing techniques demonstrating the anomalous nature of the radiocarbon dating sample area of the Shroud of Turin’ at http://www.academicjournals.org/article/article1380798975_Morgan.pdf, where he shows that the radiocarbon samples are increasingly contaminated the closer they are to the corner, and on Ray Schneider’s St Louis paper, ‘Dating The Shroud Of Turin: Weighing All The Evidence’ at http://www.shroud.com/pdfs/stlschneiderpaper.pdf, where he shows a 99.93% correlation between the radiocarbon dates and the UV-fluorescence.\nClaim: “There is no visible evidence, at any magnification, either of the enormous contamination or the enormous interweaving which would be necessary to discredit the radiocarbon date.” I don’t believe anyone disputes that massive contamination would be necessary to convert a 1st century date into a medieval one. None of Donna Campbell’s investigation in to the Oxford samples, or of Freer-Waters’s investigation into a reserved piece of the Tucson sample, show anything like the contamination required. Campbell’s conclusion is a model of professional restraint, and the closest she can get to evidence for the massive contamination required is a mention of the discrepancy in the spacing of the threads, which “could suggest the use of different yarns.” And of course I noted the discovery of cotton fibres by the Oxford lab. I’ve no doubt all the labs discovered all sorts of things covering their samples; that’s why they examined them microscopically and cleaned them with ultra-sound and vacuum-pipettes. Similarly, nothing in Rogers of any of the LANL scientists’ finding comes even remotely close to the 65/35 modern/ancient proportions required for the job.\nIf there has ever been any serious photographic evidence that more than 60% of the radiocarbon corner or any other part of the shroud was not original material, I have yet to see it, and I’m afraid you have too.\n\n","date":"March 21, 2015 at 6:57 pm","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-193971","author":"Hugh Farey","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"What Rogers determined is that the linen was new. Contamination is not the correct analysis. At St. Louis, John Jackson made the argument about contamination – it missed the point. Also, the cotton that was found was at least in part removed. Source BSTS newsletter cited in my piece. \nThe SEM 3000+ DPI images speak for themselves.\nThanks for the citations. I will check them out but not for a week or so because I am traveling next week and won’t be back until a week from today.\nI must say though, I am very happy with Campbell’s scholarship and Pam’s research on the repairs that were made.\n\n","date":"March 21, 2015 at 8:18 pm","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-193981","author":"John Klotz","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"Hugh,\nI took the time to review the papers. I find nothing in them to contradict Rogers and both concur that the testing area is anomalous and the carbon dating flawed. Are you citing them for the proposition that the testing was anomalous?\nAre you conceding that the sampling site was anomalous but that results of the anomalous area prove the Shroud inauthentic.\nOne thing about the distribution of the samples. A greater part was not given to the labs but was retained by Turin and wound-up where the principal scientific adviser was Gonella. He was responsible for threads from that area eventually being delivered to Adler and then Rogers. \nWhat was proposed by Morgan was Multi-Spectral Digital Imaging, a proposal I certainly endorse and whose applicability I discuss in “Quantum Christ” in Chapter 14, Provenance. I begin with the use of MDI to ascertain the provenance of a mysterious, enchanting drawing of a young Renaissance princess (for movie buffs  cf Portrait of Jennie). I reproduce the image in Quantum Christ. Given her history and what happened to her,  it is truly a haunting image. \nThe point is that the sample area actually tested was not on the edge but from the middle  of the cut area upwards. See the diagrams in both Morgan and Schneider.\n\n","date":"March 22, 2015 at 9:17 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-194022","author":"John Klotz","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"Hugh: “Claim: “We can say with authority than any contamination of the radiocarbon corner of the shroud made it appear older, not younger, than it really is.” This is based on John M. Morgan III’s paper ‘Digital image processing techniques demonstrating the anomalous nature of the radiocarbon dating sample area of the Shroud of Turin’ at http://www.academicjournals.org/article/article1380798975_Morgan.pdf, where he shows that the radiocarbon samples are increasingly contaminated the closer they are to the corner….”\nNo Hugh. Morgan’s paper has nothing to do with the amount of ‘contamination’ of the C14 corner. It has to do with the surface chemistry as shown by the UV-Vis fluorescence photograph.\nThe problem comes from the term ‘contamination’.\nWhat Morgan demonstrated is:\n1) that the mean surface chemistry of the C14 sample/region is truly (statistically) different from the surface chemistry of a typical TS neighboring area.\n2) that the mean surface chemistry of each of the Arizona #1, Zurich and Oxford samples is truly (statistically)  different from the surface chemistry of a typical TS neighboring area.\n3) that there is an almost perfect correlation between the calendar C14 age of a given sample (Arizona#1 etc..) and the surface chemistry as measured by the z-score in the UV-Vis image.\nIt means ONLY that the surface contamination of Arizona1 is smaller that the surface contamination of Oxford.\nSurface chemistry (UV-Vis photograph analysis) is likely correlative to the Dye found by Rogers (as Morgan wrote), NOT to the composition of the fabric itself.\nTherefore, I completely disagree with your claim: ”  “We can say with authority than any contamination of the radiocarbon corner of the shroud made it appear older, not younger, than it really is.”\nYou are confusing surface contamination (likely Rogers’s dye, which has been eliminated by the C14 standard cleaning procedures) and “contamination” of the fabric itself by “new” pieces of threads.\nI hate the word “contamination”.\n\n","date":"March 22, 2015 at 10:19 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-194025","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"I have seen statements by him where he is not optimistic, therefore not even I. Wilson was able to convince him.\n\n","date":"March 20, 2015 at 5:33 pm","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-193900","author":"Louis","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"Oh, I agree with that. A willingness to invite further investigation is not a ringing endorsement of authenticity, but then, I don’t think Ramsay was ever that ‘optimistic.’\n\n","date":"March 20, 2015 at 6:38 pm","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-193904","author":"Hugh Farey","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"Quite correct, but even then he is open minded, he is Christian.\n\n","date":"March 20, 2015 at 6:47 pm","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-193906","author":"Louis","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"I disagree with John. How could CNN lose Jesus if they never found Him?\n\n","date":"March 20, 2015 at 5:35 pm","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-193901","author":"Louis","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"ha!…like that one Louis!\n\n","date":"March 20, 2015 at 9:47 pm","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-193917","author":"rick","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"Rick, if they did find him it would not lead to a documentary. Documentaries generally offer suspense to draw a large audience, fill coffers and the rest.\n\n","date":"March 21, 2015 at 7:16 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-193943","author":"Louis","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"The BBC documentary from a few years back had a good demonstration of how the marks on the shroud correspond to folds of how it may have been lifted up mechanically in Constantinople. And there are the art studies showing how the shroud shares characteristics with Eastern icons going back to the 7th century at least.  With the Hungarian Pray ms. and the document found in the Vatican archives a few years back, there is strong historical evidence that the shroud, or something that looked just like it, was around much earlier than 1260.\n\n","date":"March 20, 2015 at 9:12 pm","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-193913","author":"Matt K.","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"Contamination is a serious problem when it comes to carbon dating the Shroud, it is likely to have skewed the 1988 results and no one can be sure that it can be removed. The problem goes beyond threads and surface contamination.\nIan Wilson has provided a number of reasons in his book “The Shroud. The 2000-year-old-mystery solved”.\n\n","date":"March 22, 2015 at 10:32 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-194028","author":"Louis","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"Finding Jesus?\nOne important fact in the life of Jesus: He did not exclude anybody. Pope Francis shows how to do it:\nhttp://finance.yahoo.com/video/cheer-prisoners-popes-coming-lunch-113918609.html\n\n","date":"March 22, 2015 at 6:29 pm","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-194075","author":"Louis","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"What might solve the puzzle is the use of a modern instrument, in short, in a way analogous to the pendulum that allowed Foucault to demonstrate the rotation of the Earth.\nLink:\nhttp://en.wikipedia.org/wiki/Foucault_pendulum\nSo I think you have understood my allusion to nanomechanical tests on Young’s modulus …\nOtherwise, in other words:\nthe nanomechanical tests on Young’s modulus without the destruction\nof the material (the precious sample of linen! …\n\n","date":"March 23, 2015 at 11:14 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-194138","author":"piero","site":"shroudstory"},{"title":"John Klotz Delivers the Knockout","post":"“Finding Nirvana”:\nhttp://www.bbc.com/news/world-asia-china-32032790\nActually Nirvana in this case means “nothingness”, but who can imagine absolute nothingness? Scientists say that nothing comes from nothing and nothing goes to nothing.\nNirvana does not answer the question, Why is there something instead of nothing?\n\n","date":"March 25, 2015 at 11:05 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","id":"comment-194375","author":"Louis","site":"shroudstory"}]
