[{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"What Went Wrong With the Shroud’s Radiocarbon Date?\n Nothing.\n\n","date":"December 19, 2014 at 10:20 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-177775","author":"PHPL","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"Who knows what happens with a different point of the Ancient Sheet?\n\n","date":"December 19, 2014 at 11:22 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-177792","author":"piero","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"Should have said, “Know nothing”….\n\n","date":"December 19, 2014 at 3:38 pm","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-177827","author":"Nabber","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"“Nothing can be said”… This should be the correct judgment resulting from the situation that has been produced from the 1988 radiocarbon tests.\nDo you feel happy with that definition?\nI remember another kind of explanation about the blood:\n>Prodigiosin is the red pigment produced by many strains of the bacterium Serratia marcescens, other Gram-negative, gamma proteobacteria such as Vibrio psychroerythrus and Hahella chejuensis. It is in a family of compounds termed “prodiginines”, which are produced in some Gram-negative gamma proteobacteria, as well as select Gram-positive Actinobacteria (e.g. Streptomyces coelicolor).The name “prodigiosin” is derived from “prodigious” (i.e. something marvelous).\nLink:               http://en.wikipedia.org/wiki/Prodigiosin\nThe ability of pigmented strains of Serratia marcescens to grow on bread has led to a possible (… or only vaguely presumed) “explanation” of Medieval transubstantiation miracles, in which Eucharistic bread is converted into the Body of Christ.\nBut, in the case of the Holy Shroud, this red pigment seems not credible as explanation for the blood stains. Are there any objections on your part about my statement?\n— — — —\nWhat has always intrigued me is the remote possibility of dating the blood present on the shroud. Maloney\n(Read the Appendix III of the paper by Maloney = “Dialogue between Ray Rogers and Bryan Walsh”) shows an interesting exchange of messages between Rogers and Bryan Walsh …\nRay Rogers response (here short excerpts):\n > I am retired. … …\n > … This is a 3-D problem …\n > I made some 1-D estimates, but I did not even published them. …\n and finally a nice problem to solve:\n > … … Remember there are blood spots all over the cloth, and sulphoproteins evolves H2S at low temperatures (Here’s my note [PI]: … and what are those temperatures, exactly?) and they evolve hydroxyproline through roughly the same temperature ranges. Only blood spots near the scorches showed degradation. … …. …\nand then it came out the history of the thermal decomposition of the blood (with production of H2S) seen as an index of validity for the analysis of the loss from Vanillin Lignin. An interesting problem.\nWhat do you think?\nI believe it can be solved with the use of advanced AFM techniques for control.\n—- —-\nI have just found a paper where you can see the image for\nRBC (=Red Blood Cell) Equilibrium Shape.\n(Straigth line: Equilibrium shape that arises from bending energy minimization and which was used in the calculations to derive eigenmodes of the bending deformation energies …):\nTitle of that paper:\nSpatially-Resolved Eigenmode Decomposition of Red Blood Cells Membrane Fluctuations Questions the Role of ATP in Flickering\nby\nBoss D, Hoffmann A, Rappaz B, Depeursinge C, Magistretti PJ, et al. (2012)\n PLoS ONE 7(8): e40667. doi:10.1371/journal.pone.0040667\nLink:\nhttp://www.plosone.org/article/info%3Adoi%2F10.1371%2Fjournal.pone.0040667\nTemperature plays important roles in RBC deformability (see also the shear modulus, etc. …). So, we have to study the following argument:\n“Shape and Biomechanical Characteristics of Human Red Blood Cells different Temperature conditions”.\nSo before you run the work (= adequate AFM controls) you must well know how to behave these RBCs under different temperatures…\nDo you agree with me?\n\n","date":"December 20, 2014 at 6:15 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-177956","author":"piero","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"Errata corrige:\nfor the analysis of the loss from Vanillin Lignin. \nInstead of:\nfor the analysis of the loss of Vanillin from Lignin.\n—————–\n\n","date":"December 20, 2014 at 6:20 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-177957","author":"piero","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"Piero\nThere was a message for you on another thread yesterday:\n“December 19, 2014 at 7:03 pm\nReply\nPiero, you refuse to pick up the gauntlet. Why is that so? Can you answer my question? If not, then please put an end to this rubbish about the dye. What you must do is to provide convincing arguments about why the dye had something to do with the partial head image seen on the Jospice Mattress. If you do that I will withdraw my paper. Here it is again:\nhttps://www.academia.edu/4691379/Can_the_Jospice_Mattress_imprint_be_compared_to_the_Image_on_the_Shroud\nLook at the partial head image carefully and ponder about about what Father Francis O’Leary had to say.”\n\n","date":"December 20, 2014 at 8:36 pm","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-178077","author":"Louis","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"I was talking about the “Vanillin loss from Lignin”, ù\nbloor rec cells and different levels of Temperature, etc. …\nWhy do you change the subject?\nNow you know very well that you can do the cold dyeing of polyamide … and then…\nWhat should I tell you different?\nThe head is not seen …\nIn short:\nWhat do you expect from me?\nHere’s what I can tell you:\nYou should not get into the persecution around\nthat incontrovertible argument: the cold dyeing for polyamide 6 !…\nYou must inform yourself in a well manner on the issue of cold dyeing (for polyamide 6)!\n\n","date":"December 22, 2014 at 11:14 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-178425","author":"piero","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"Errata corrige:\nI was talking about the “Vanillin loss from Lignin”, ù\nbloor rec cells and different levels of Temperature\nInstea of\nI was talking about the “Vanillin loss from Lignin”,\nRed Blood Cells and different levels of Temperature, etc.\n-*-*-*-*-*-*-*-*-\nLouis,\nYou must not create confusion!\nI see no head in Jospice Imprint\nand then it is useless to speak of “head”\nif the head there is not in that\nstrange imprint!\n\n","date":"December 22, 2014 at 11:19 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-178427","author":"piero","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"Piero, please read the paper carefully as well as see what Father Francis O’Leary called the “face” and which  I prefer to refer to as a partial head image.\nIf you cannot do that then you are not being objective.\n\n","date":"December 22, 2014 at 7:21 pm","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-178541","author":"Louis","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"PHPL;\nPatrick, there are many hypotheses to explain why the carbon dating results were skewed and this is what complicates the matter. I am inclined to agree with Ian Wilson, Professor Christopher Ramsey and can also understand why the Church is cautious. See the last question in the following interview:\nhttps://www.academia.edu/8841978/Professor_Giulio_Fanti_discusses_the_controversies_in_the_realm_of_Shroud_studies\n\n","date":"December 19, 2014 at 6:54 pm","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-177858","author":"Louis","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"Ramsey? I doubt you agree with Ramsey. \n“We’re pretty confident in the radiocarbon dates”. (…)  “There are various hypotheses as to why the dates might not be correct, but none of them stack up”. Etc.\nStatement made to The Telegraph, Friday 27 January 2012. “The Turin Shroud is fake. Get over it”, http://blogs.telegraph.co.uk/news/tomchiversscience/100125247/the-turin-shroud-is-fake-get-over-it/\n\n","date":"December 21, 2014 at 2:47 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-178136","author":"David Mo","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"Ramsey: ” It’s also been hypothesized that the patch we tested was a modern repair, but most of us agree that’s implausible, because the weave is very unusual and matches the rest of the shroud perfectly”\nIs it truly an argument against the “repair hypothesis”?\nIt is not more difficult to perform French reweaving on a 3/1 herringbone weave than on a plain weave for example.\nWith due respect to Prof.Ramsey, this sentence has nothing to do with the problem.\nPaul Malloney’s paper is truly a must read.\n\n","date":"December 21, 2014 at 2:08 pm","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-178235","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"Other than using a contaminated piece to do the Carbon Dating Test and obtaining very controversial results, there are no other reasons to tell that Shroud of Turin is fake thing.\n\n","date":"December 22, 2014 at 11:26 pm","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-178590","author":"Sampath Fernando","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"Perhaps Mr. Ramsey doesn’t know the existence of such strange entity named by the sindonists “invisible mending”. You can send him some samples or some bibliography on this fantastic subject. He would be more fortunate than I, because I have asked you (and many other sindonists, Mr. Marino included) for these both things and I’m still waiting your answer. \nWith due respect to you, can I insist? I only demand: \n1. A sample of invisible mending that will be undetectable for microscopes and experts.\n2. Some bibliography on this matter. \nThank you.\n\n","date":"December 22, 2014 at 3:43 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-178360","author":"David Mo","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"1. It should perhaps (I repeat perhaps) be possible if the experts did not have in mind this possibility and look at it specifically. They probably looked at this corner to verify the weave, the lack of obvious anomalies and extraneous threads etc.. They also saw the Shroud for the first time.\nIn other words, to my knowledge, with due respect to them, they were not prepared to eliminate this possibility, simply because at the time they could not imagine such a hypothesis.\nChristophe Moulhertat (probably the best expert in ancient cloths in France) wrote :” Si on a des fils trafiqués avec une volonté de cacher la chose, il faut déjà y penser, et être équipé pour pouvoir voir ça. Sinon, si le réparation est bien faite, on peut passer à côté. Il faut vraiment une analyse fine”.\nThe important words are “il faut déjà y penser” (you must first have to think about that [invisible mending]).\nHowever, I agree that it is difficult to accept such a mistake from true experts.\nBut the fact is that the properties of some of the Raes/C14 corner threads are not similar to that of the main cloth (cotton, dye and vanillin).\nThere is also the possibility that the Raes/C14 corner consists of a mixture of portions of ancient threads spliced together with portions of modern threads.\nIn this case, it would be truly invisible.\nMoulherat was shocked by the fact that the radiocarbon sample came from a single small area of the Shroud.\nThis was the big mistake.\nAs I wrote in my presentation in Saint-Louis, there is a conflict between the findings of the textile experts and Rogers’ findings.\nBoth of them are reliable.\nConclusion: The Shroud must be re-dated.\n2. Bibliography?\nIn 2008, I purchased the  “Frenway System of French Reweaving, subtitled “Detailed and Complete Instructions in the Art of French Invisible Reweaving” and I gave this book to Sue and Joe Marino during the Ohio conference.\nAt the time, Paul Maloney already had this book and some interesting drawings and comments are in his paper. \nYou are asking for bibliography on this  matter.\nWhy don’t you try to find yourself the “bibliography on this matter” ?\n\n","date":"December 22, 2014 at 4:03 pm","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-178498","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"I beg your pardon, M. Heimburger, but you have not answered any question I asked you:\n1.Where is the example of an “invisible mending”?\n2.Bibliography???? Yes, I know this “bibliography”. Mr. Marino and you quoted a simple and anonymous handbook for distance learning of textile patches. There is not any reference to an “invisible mending” that flees away from experts with microscopes. Please, I am demanding for an academically correct bibliography. \nYour give some reasons that amaze me. The experts who are searching for some patch or mending in the corner of the Shroud don’t found any mending because they are not searching an “invisible mending”. Excuse me:\nFirst of all you ought to present some evidence that an “invisible mending” exists. Examples and bibliography, you know. Secondly, M. Vial, Prof. Testore, Mme. Flury-Lemberg (experts) and John Jackson (not expert) were just searching for some kind of subtle mending, and they found nothing. \nConclusion: or the “invisible mending” is similar to other metaphysical (no visible) entities, as flogisto, materia prima or platonic ideas, or the “invisible mending” doesn’t exist. I prefer the last. \nExcuse my dry style in writing: I’m in a hurry and my English is not good.\n\n","date":"December 23, 2014 at 4:16 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-178635","author":"David Mo","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"David Mo:\nNão foi feito nenhum exame da composição química da amostra. Os protocolos do Professor Carlos Chagas foram jogados na lixeira e uma única amostra foi tirada.\nTranslation: The chemical composition of the sample was not examined. Professor Carlos Chagas’ protocols were thrown into the waste paper basket and a single sample was taken.\n\n","date":"December 23, 2014 at 9:07 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-178672","author":"Louis","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"Louis: The analysis of the chemical composition of the samples is not needed in radiocarbon dating and usually is not done. The homogeneity of the sample is guaranteed by an optical inspection (microscope) and other contaminant agents are removed by washing technics. \nI don’t know any other radiocarbon dating with a protocol similar to Chagas’ proposal.  Of course, I am not an expert in radiocarbon dating. Neither Chagas was. \nMaybe the Chagas’ protocols were “jogados na lixera” because they were “muito pesados”.\n\n","date":"December 24, 2014 at 2:56 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-178853","author":"David Mo","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"David Mo:\nEach object is a different case. Some years ago,before I began writing on the Shroud, I bumped into “Lindow Man” and photographed it while researching medieval history in England. It had nothing to do with what I was researching but the photograph came in handy when Ian Wilson mentioned that the carbon dating was controversial in a Shroud book, there was a discrepancy of 800 years. Last year I obtained what I suppose is up-to-date information. You can see the photograph and read something about the dating here:\nhttps://www.academia.edu/7893085/The_Quest_for_Jesus_in_Shroud_research\nProfessor Carlos Chagas drew out a well-researched protocol. I agree that these were “muito pesados”, but that was a necessity due to the fact that the dating procedure had to be “completo”.\nThe Carmelite monk turned cardinal Anastasio Ballestrero found himself in a situation for which he was not prepared. He was almost a puppet in the hands of the laboratories and changed his mind after the dating was announced.\nRome has not accepted the carbon dating,but that, as I wrote earlier, is in one of the three drawers mentioned.\n\n","date":"December 24, 2014 at 10:58 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-178931","author":"Louis","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"Do we know whether  ‘Rome’ or ‘Turin’ has formally rejected the carbon dating? As late as 2000 Gonella was vigorously defending it (in the published proceedings of the Shroud Conference of that year in Turin). I can’t imagine that Gonella would have gone into print having made such a vigorous defence of the dating without asking someone higher up in Turin.\nIt is important to get this right. I  have never found any evidence of any formal repudiation or are you suggesting that Rome /Turin have simply, unwilling to back Gonella, not made any formal acceptance of it. \nLindow man is not a valid comparison. ‘ He’ was one of those peat contaminations, a well known class of its own as peat is so vulnerable to disturbance – completely different from a textile that has been microscopically examined to identify and remove an errant cotton fibre (Oxford) and then cleaned before testing.\n\n","date":"December 24, 2014 at 1:16 pm","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-178957","author":"Charles Freeman","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"The late Daniel Raffard de Brienne, who was President of CIELT, France, was one of the Shroud scholars invited to the Round Table in Turin and we were able to exchange some views about the Shroud after that. He was amused with the fact that some of those in the anti-authenticity camp requested another carbon dating test during the discussion. We also dwelt on the attitude of Professor Luigi Gonella, however de Brienne, although disagreeing with his position, refused to attack him because he found him to be a very friendly man.    \nIt is not surprising that Professor Gonella was defending his position as late as 2000. Did he have any choice? Perhaps it had something to with face-saving, given that he trampled on the well-researched protocols of Professor Carlos Chagas, far more qualified than him, and we do not know what went on behind the scenes for him to get his way in 1988. It is doubtful that he needed any “nihil obstat” from “someone higher up in Turin”. The relic is not a part of the “depositum fidei”. If it was, one can be sure that it would be placed on the high altar of Saint Peter’s Basilica.\nThere is some relevant literature to read. It is Ian Wilson’s book “The Shroud. Fresh light on the 2000-year-old mystery”. I will suggest pages 123-141, particularly page 140, where he cites a few lines from a paper on the dating of the Shroud in the prestigious “Journal of Research of the National Institute of Standards and Technology” in 2004.\n\n","date":"December 24, 2014 at 2:32 pm","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-178967","author":"Louis","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"Charles and Louis: \nThe Catholic Church maintains the Shroud cult as a sample of religious spirituality and an impeller of the faith. The exhibitions of the Shroud don’t imply any assert of authenticity.\n It is true that some official statements mention the shroud as “a relic”, but others as “an icon”. There is not any official statement that says directly that the Shroud is a true relic neither that the radiocarbon dating is valid. The official statement of 1988 plays with a calculated ambiguity. It recognizes that the results of the radiocarbon dating are “compatible” (with what?) and that the scientific advisor that had peered the report of the labs confirms the 95% of certainty… but the report also adds that the origin of the image continues to remain a mystery that needs to be investigated.\nIn my opinion the Catholic Church cannot clearly state the inauthenticity of the cloth without an intern conflict with many believers and without losing an important centre of propaganda. But they cannot launch a battle against scientists without a loss of reliability in the intellectual world, at least. The shadow of Galileo is long. \nThe Church’s opinion about this point doesn’t matter for me. I think it is not based on the truth but on some “political” considerations. \nI consider that the stories of Ballestrero, Gonella et alia are very unimportant if not pure hearsay. They are auto-justificative narratives.\n\n","date":"December 25, 2014 at 4:13 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-179084","author":"David Mo","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"Hello David Mo:\nPope John Paul II left the question to science, however at the same time the relic is preserved in such a way that it is practically written all over the walls that the 1988 carbon dating results are not considered to be definitive.\nAll attempts to reproduce the image have fallen short of the mark and books saying that it is a medieval production have also not been convincing.\nThe relic is not a part of the deposit of Faith and as I have said more than once, even if it is “proved” to be genuine many questions will remain to be answered.\nIf you read Ian Wilson’s last Shroud book with an open mind you will reach the conclusion that there are no “stories” when it comes to the roles of Cardinal Anastasio Ballestrero and Professor Luigi Gonella. Everything went wrong from beginning to end. If there will be any progress today it will be a different story, for we now have the highly-qualified Archbishop Marcelo Sánchez Sorondo as Chancellor of the Pontifical Academy of Sciences.\nI am not one to believe that science can answer all our questions. Many scientists sometimes do not know what they write, keep on changing their theories or are unwilling to address metaphysical questions because they are unable to do so. You can see clear examples in the introduction to:\nhttps://www.academia.edu/4700001/What_do_we_know_about_the_Bible_An_interview_with_Joseph_A._Fitzmyer_SJ\nWhat they do is to mix scientific theories with metaphysics, trying to find an easy way out, but that is scientism, which does not necessarily correspond to reality.\nThere are questions that hardliners in the field of science, whether tackling physics or biology,are unwilling to address. However that is for the next Shroud article…..\n\n","date":"December 25, 2014 at 9:46 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-179125","author":"Louis","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"David Mo:\nVocê leu cuidadosamente o que eu escrevi? Não falei que concordava com o Professor Ramsey em tudo que ele disse. É importante ver antes de saltar.\nDid you carefully read what I wrote? I never said that I agreed with everything that Professor Ramsey said. It is important to look before leaping.\n\n","date":"December 21, 2014 at 8:43 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-178178","author":"Louis","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"Pot ser el vostre comentari no era clar perquè barrejava molt diverses opinions sobre la validesa de la datació de radiocarboni. Vostè no pot incloure al mateix calaix a Wilson and Ramsey.\nTranslation:\nMay be your comment was  not clear for you mixed very different opinions on the validity of the radiocarbon dating. You cannot include in the same drawer Wilson and Ramsey. \nAny way, if you agree with the reasons of Ramsey, I’ll be glad. I also agree.\n\n","date":"December 22, 2014 at 3:13 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-178355","author":"David Mo","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"David Mo:\nI agree with Professor Ramsey only about one thing and there is reference to it in the last question of the following interview:\nhttps://www.academia.edu/8841978/Professor_Giulio_Fanti_discusses_the_controversies_in_the_realm_of_Shroud_studies\nIan Wilson and Professor Christopher Ramsey are in different drawers, both are believing Christians but do not share the same views about the Shroud.\nThere is yet another drawer: for the Church.\nIt is clear in the question.\n\n","date":"December 22, 2014 at 7:39 pm","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-178544","author":"Louis","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"I found Paul Maloney’s paper interesting for various reasons, and would like to draw attenton to a couple of points which are worth mentioning.\n1) Maloney compares some cotton fibres found within threads in the Raes sample, with “a lot of extraneous cotton” fibres found only on the surface of threads over the rest of the Shroud. However, the STuRP team did not extract any threads, only fibres, on their sticky tapes, which must obviously have come from the surfaces of the threads. Maloney does not say how he knows about the the inside of the ‘main body’ threads.\n2) I found it very interesting that “all of the implications” were that the position from which the radiocarbon sample was to come was the Raes corner as early as November 1987. I wonder what Riggi and Gonella argued about on the morning of the cutting!\n3) Another interesting point concerns the attaching of new threads when old ones run out, particularly with reference to the Egyptian cloth (Figure 7, Page 25, and the diagram on Page 26). There is no way that the photos on Pages 12 (Figure 7) and 15 can be ‘splices’ in any recognised sense of the world. Any attempt to unravel the ends of two submillimetre threads by a few mm and then to reravel them together in such a way that they do not come apart (which is what a splice is) would be wholly fruitless, and in this case I do not even believe they are two ends of different threads anyway.\n\n","date":"December 21, 2014 at 6:37 pm","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-178269","author":"Hugh Farey","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"Dear Hugh,\nAbout point 1.\nYou are right about the facts.\nBut…\nRemember my own study of Raes#7.\nhttp://www.shroud.com/pdfs/thibaultr7part1.pdf\n– Many cotton fibers obviously mixed with linen fibers: it is NOT a surface contamination.\n– Cotton fibers are not at all evenly distributed: taking in account only the more or less\n“complete” cotton fibers (i.e., fibers forming long bundles or sometimes “nodes” or\nindividual relatively long fibers) there is about 15% of cotton in the outer part (from 0% to\n28% depending on the location studied) and about 10% of cotton in the core of the thread. In addition many short pieces of broken cotton fibers are found everywhere. \nNow, if you apply a sticky tape on this Raes thread, what do you expect to see under the microscope? Many cotton fibers. I am right?\nIn other words, if the main Shroud had the same linen/cotton content than the Raes/C14 corner, all or most of the STURP sticky samples (which were much larger than a single thread) would show a large number of cotton fibers. \nBut Rogers did not find any “old” cotton fibers in the STURP samples (except some modern fibers probably coming from the cotton gloves used in 1978).\nThis explains why Rogers wrote that the shroud is almost pure linen.\nPaul Maloney did look at the Frei samples (surface samples), as well at some STURP surface samples.\nHere is what he wrote in a message to SSG:\n“As many of you know I spent more than 500 hours at the microscope studying\nMax Frei’s sticky tapes. I conducted my studies first using an E. Leitz and\nthen on a Nikon Optiphot. So, let me say first that on all of those tapes\nthere is, in fact, cotton. BUT this statement, as put, is hardly\nscientific because I have not identified for you the sources for the cotton\non the Shroud or on the tapes versus cotton IN the Shroud. Please note that\nI am making a distinction between cotton ON the tapes, cotton IN the Shroud,\nand cotton ON the Shroud.\nFirst, cotton ON the [Frei] tapes. I found ample amounts of cotton, white, clean\ncotton located SOLELY on the leads of the tapes. But there is a ready\nanswer for this source. Max Frei borrowed the gloves from STURP–I believe\nit was Bob Dinegar, at Frei’s request, who got the cotton gloves for him.\nThose cotton gloves came from the United States and are not made of\nGossypium herbaceum. This cotton came from the tips of the cotton gloves as\nMax Frei took his samples. So we can rule out any new cotton fibers on the\nleads of the tapes as being relevant to our discussion.\nSecond, cotton ON the surface of the Shroud. I found trace amounts of\ncotton, randomly positioned, on the BODIES of the tapes. Nearly all of this\ncotton was colored in some way (i.e. dyed). Thus, it must be interpreted as\noriginating from the clothing of those who were in contact with the Shroud\nduring its history–including its recent history (1978 or prior).\nThird, cotton IN the weave or IN the spun threads of the Shroud. I have\ncategorically NEVER attested cotton anywhere on any of the Frei tapes,\neither bodies of the tapes, or leads of the tapes, that was co-spun with\nlinen fibers which, to me at least, would constitute some evidence for a\nco-mixture of cotton and linen on the main part of the Shroud and existing\nthere as part of the original weaving of the cloth. Furthermore, I accept\nRay Rogers’ own research that the cotton co-mixed in the yarn is of\nrelatively modern origin and limited to the area that Joe Marino and M. Sue\nBenford had originally identified as a repaired area: the so-called “Raes\nCorner” of the Shroud.\nFinally, independently, I had the privilege of examining three of STURP’s\ntapes which came from the main body of the Shroud cloth. Those tapes are 6\nAF, 3 BF, and 3 EF. Nowhere on those three tapes did I find ANY cotton!\nAll of the fibers are linen!\nSo far as I can tell, there should be no argument as to whether the Shroud\nwas entirely the co-mixture of cotton and linen because there is simply no\nfactual evidence to support it”.\nRegarding cotton, there is a big difference between the Raes/C14 corner and the main Shroud.\n\n","date":"December 23, 2014 at 3:44 pm","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-178728","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"Thanks, Thibault, that clarifies Maloney’s position well. I am still somewhat ambivalent about the cotton, but it is certainly worth more investigation.\n\n","date":"December 23, 2014 at 7:18 pm","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-178761","author":"Hugh Farey","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"Thanks Hugh, I understand tour position (more investigation is needed).\nMerry Christmas to you and to all.\nThibault.\n\n","date":"December 24, 2014 at 2:11 pm","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-178965","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"Charles wrote “Do we know whether ‘Rome’ or ‘Turin’ has formally rejected the carbon dating?”\nThe Vatican Press Office came out in 1990 with a statement saying the 1988 results did not match with all of the data collected by the 1978 examination.\nAlso, it’s unlikely the Vatican would have allowed exhibitions in 1998, 2000, 2010 and the upcoming one in 2015 if they felt that the 1988 evidence conclusively proves the Shroud is a fake.\n\n","date":"December 24, 2014 at 6:50 pm","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-179003","author":"Joe Marino","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"Well, as you may know, Joe, I don’t think it was ever intended to be a fake but to be part of the Easter ceremonies celebrating the Risen Christ and venerated as such from the day it was made. Like so many other objects of veneration it gained added significance in the eyes of some with time. The Church is simply continuing a traditions of seven centuries of veneration even since Clement VII recognised that a pilgrimage to see an exposition deserved an indulgence ( (1390). As the Church made clear then and still does, this does not make it authentic but rather a means of meditating on the Passion of Christ. Whether individual members of the Church regard it as authentic is another matter.\nHave a peaceful Christmas.\n\n","date":"December 25, 2014 at 3:02 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-179074","author":"Charles Freeman","site":"shroudstory"},{"title":"Just Published:  What Went Wrong with the Radiocarbon Date?","post":"“… the 1988 results did not match with all of the data collected by the 1978 examination”\nNot really a revelation !\n\n","date":"December 25, 2014 at 1:46 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-179059","author":"PHPL","site":"shroudstory"}]
