[{"title":"Liar, please abandon this foolishness","post":"As at March 2008, the prestigious Oxford University and Dr Ramsey still hadn’t twigged that the fundamental issue was the failure to follow proper scientific protocols in the sampling regime, with the consequential result that the sample was not representative – in fact an outlier, with its singular cotton contamination, probably from early in the Middle Ages.  I also note that as at May 2008, they had seemed to researched the CO contamination issue canvassed by John Jackson, with negative results, but possibly not subjected the CO test samples to high temperature heating such as that from the Chambery 1532 fire that may have had some effect on the absorption of CO.  I also note that in David Rolfe’s recent video, posted here on Dec 21, that the CO question was still being treated as a live issue, which would seem to make it a little dated, unless other related CO issues were still open, such as the question of heating,  As noted above, the Thomas Stielau comment is ill-informed, and precipitate.\n\n","date":"January 1, 2013 at 7:00 am","url":"https://shroudstory.com/2013/01/01/liar-please-abandon-this-foolishness/","cat":"carbon_14_dating","id":"comment-21417","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Liar, please abandon this foolishness","post":"Mr. Stielau posted stale news. As for Dr. Christopher Ramsey, he is willing to entertain proposals for a new CD test but at the rates things are going in the realm of Shroud studies where there are many hypotheses and no agreement about what exactly went wrong it is difficult to proceed. It also looks that Mr. Steilau is not aware that Dr. Michael Tite was present at the Round Table convened by Cardinal Severino Poletto. Remember: if a piece of the TS is subjected to C14 again and no 1st century date is obtained no attention will be paid to pleas for yet another test.\n\n","date":"January 1, 2013 at 7:47 pm","url":"https://shroudstory.com/2013/01/01/liar-please-abandon-this-foolishness/","cat":"carbon_14_dating","id":"comment-21442","author":"Louis","site":"shroudstory"}]
