[{"id":"comment-206006","author":"robert_a_rucker","post":"The three C 14 dating laboratories did not obtain the same value for the C 14 date of the Shroud, and more than one statistical analysis of their results indicate that there is only a 5% chance (or less) that the three values are within the measurement uncertainties of each other. It should therefore be concluded that there is probably something causing the difference. When the three values are plotted with their measurement uncertainties as a function of the distance of the sample points from the end of the Shroud, the slope or gradient to the values is obvious. I believe that I know why there is a slope to these values. Last year, I used the MCNP nuclear analysis computer code to calculate the effect of neutrons being released homogeneously from the body of Jesus in the resurrection. I reported my results at the Shroud conference in St. Louis in 2014. The title of my presentation was “MCNP Analysis of Neutrons Released from Jesus’ Body in the Resurrection.” This Power Point presentation and the narration to it are available at shroud.com or by doing a Google search on the title. In these computer calculations, when I assumed that neutrons are homogeneously released from Jesus’ body (probably due to the resurrection), my results agree with three items: the uncorrected C 14 date for the Shroud of Turin of 1260 AD, the correct slope of the C 14 date across the three sample locations, and the correct C 14 date for the Sudarium of Oveido of about 700 AD. Therefore, the three C 14 dates have a slope or gradient as a function of distance from the end of the Shroud because of the distribution that the neutrons naturally take in the tomb when they are emitted homogeneously from the body. The shape of the neutron distribution in the tomb assuming that neutrons are homogeneously emitted from Jesus’ body is a cosine shape. The sample location used in the C 14 dating was near the feet at the bottom of the Shroud. Thus, the neutron density was near a minimum at the sample location due to the cosine shape, but increasing rapidly as you move the sample point away from the end of the shroud again due to the cosine shape. So the cosine shape of the neutron distribution in the tomb explains the slope across the three C 14 dates obtained by the three laboratories. This is evidence that there were neutrons released from Jesus’ body, and if so, then some of the neutrons would have been absorbed in the N 14 in the Shroud to produce new C 14 atoms in the Shroud which would be indistinguishable from the original C 14 atoms in the Shroud, which would produce a much more recent C 14 date than the actual date for the Shroud. In other words, if Jesus was resurrected from the dead, then radiation including neutrons may have been emitted from the body in the process, and if neutrons were emitted from Jesus’ body while it was in the tomb, then C 14 dating would be expected to give a more recent date than the actual date. Robert A. Rucker (robertarucker@yahoo.com).","date":"2015-07-17","mins":"4:18 am","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","title":"BSTS Article by Hugh Farey"}]
