[{"id":"comment-206489","author":"robert_a_rucker","post":"There is always a problem in communicating a technical subject to laymen, but I spent much time on this presentation to put the cookies on the bottom shelf if at all possible. The response of the people at the conference indicates that I succeeded in this effort, at least for the most part. Several laymen came up to me after the presentation and indicated that they were surprised, even amazed, that they understood the presentation. One couple told me this several times as I encountered them during the remainder of the conference. Admittedly, my presentation will not be understood by those only willing to put in a few minutes on it, but an hour or two of time should be sufficient. On the topic of an independent review, this is something that I very much want to obtain because it is standard operating procedure in the nuclear industry. But consider the problems in finding an appropriate peer reviewer in this situation. He or she would need to have preferably 10 to 15 years of experience in running the MCNP nuclear analysis computer code in order to check my computer calculations, and to not have worked with me on anything that I have already done in order to be an independent reviewer, and have about 50 to 100 hours of preferably full time available for the review, and have a sufficiently strong interest in the Shroud of Turin that would motivate him to be willing to work this 50 to 100 hours without charge, since I have no funding for this project. The plan for my path forward is to update my MCNP computer calculations to confirm certain technical issues with how I am running the calculations and to update my results to take into account my new understanding of the Tucson lab’s subsampling procedure. I will then write a WORD document on my results. These new calculations and the corresponding WORD document can then be used for an independent review. I will probably have to seek an appropriate peer reviewer from among my friends in the nuclear criticality safety industry that have retired. I will then have the task of persuading them to do the work for free. I hope this gives you a better understanding of the situation. Bob Rucker.","date":"2015-07-24","mins":"5:48 pm","url":"https://shroudstory.com/2015/07/17/another-reaction-to-ray-rogers-paper-on-radiation/","cat":"image_theory","title":"Another Reaction to Ray Rogers’ Paper on Radiation"}]
