[{"id":"comment-213875","author":"robert_a_rucker","post":"It is my opinion that enough evidence has accumulated that we should now realize that there was no invisible repair/reweave in the C14 sample area, and that the solution to the C14 dating problem is what I presented at the St. Louis conference in 2014. I showed that MCNP nuclear analysis calculations indicate that if 3.0 x 10^18 neutrons are emitted uniformly in the body while it was in the shroud in the tomb, then three mysteries related to C14 dating are solved: 1) Neutron absorption in N14 in the shroud creates new C14 in the shroud that is identical to the original C14 in the shroud so that the C14 date is shifted from 30 AD to 1260 AD. The dating laboratories, not realizing that the shroud had been through a neutron absorption event, would have misinterpreted their result by assuming the wrong C14 decay curve. 2) The results reported by the three dating laboratories were not in good agreement with each other. Statistical analysis indicates only a 5% chance that their results were within their measurement uncertainty, so that the differences were probably (95% probability?) caused by something. Plotting their results as a function of the distance from the end of the shroud indicates that there is a slope or gradient of 42 to 57 years per cm across their data depending on the sampling done in Tucson. This slope in the C14 dates from the three laboratories agrees with the MCNP nuclear analysis calculations, which calculate that a uniform neutron emission in the body causes a neutron distribution in the tomb which produces just this range in the C14 dates across the sample region, so that the disagreement between the laboratory values is the result of the slope of the neutron distribution at the sample location resulting from homogeneous emission of neutrons in the body. 3) These same MCNP calculations predict that a piece of cloth placed on the side bench about a foot in front of the back bench where the body in the shroud was located would date to about 700 AD. This location in the tomb is a natural location for the person working on the body in the tomb to lay the face/head cloth. According to tradition, the Sudarium of Oviedo is the face/head cloth of Jesus. It was C14 dated to 700 AD, in excellent agreement with the MCNP results. We should realize the importance of not making the common a priori presupposition of naturalism, so that we not automatically rule out anything that is beyond the laws of science as we currently understand them, so that we can follow the scientific evidence where it leads. When this is done, I believe that the scientific evidence indicates that the solution to the enigma of the shroud is that a burst of radiation occurred within the body that did three things: 1) It caused the image, perhaps either by protons or ultraviolet based on experiments. 2) It thrust the blood off of the body, heated it turning it into a liquid, and thrust it against and into the fibers of the shroud, and 3) It caused the shift in the C14 date from 30 to 1260 AD and the slope in the C14 dates as discussed above. Bob Rucker.","date":"2015-10-29","mins":"8:02 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"}]
