[{"id":"comment-15866","author":"carlos_otal","post":"Es muy difícil mantener la NEUTRALIDAD, la objetividad, en un tema como el de la Sábana Santa. Y me refiero tanto a defensores como a los no defensores de la autenticidad. “I can only repeat the consensus of professional historians that there is no documentary evidence for the existence of the Shroud before the fourteenth century not a single mention of a cloth with a double image anywhere.” ¿Hay evidencia documental de la existencia de alguna Sábana con simple imagen del cuerpo entero (no doble) anterior al siglo XIV? Carlos Otal.","date":"2012-09-05","mins":"5:02 am","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson"},{"id":"comment-15867","author":"carlos_otal","post":"Mi pregunta va dirigida a Charles Freeman. ¿Hay evidencia documental de la existencia de alguna Sábana con simple imagen del cuerpo entero (no doble) anterior al siglo XIV? Carlos Otal.","date":"2012-09-05","mins":"5:09 am","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson"},{"id":"comment-15884","author":"carlos_otal","post":"Charles Freeman: Le agradezco la respuesta a mi pregunta :¿Hay evidencia documental de la existencia de alguna Sábana con simple imagen (no doble) anterior al siglo XIV? Su repuesta es un claro NO. (Todos conocemos que la Sábana de Cadouin no tiene imagen). Nicolotti me respondió en su comentario (September 3, 2012 at 10:25 am | #49) referente a lo que Robert de Clari podría haber visto, aunque él, Nicolotti no cree que el testimonio sea cierto: Podría ser cualquier tela con la imagen de Cristo muerto, como muchas estaban en ese momento” Nicolotti, siendo un gran erudito, SE EQUIVOCA. No existían MUCHAS en ese momento. No conocemos NINGUNA sabana que pretendiera ser mortuoria con la imagen de Jesús, salvo para los que quieran admitir como válido el testimonio de Robert de Clari (yo lo acepto como muy probablemente válido) No existe evidencia documental de ninguna Sábana con Imagen de Jesús anterior a la Sabana de Lirey (Sábana Santa). Carlos Otal Pd. No he leido a Ian Wilson ni quiero leerlo. No me interesa..","date":"2012-09-05","mins":"8:53 am","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson"},{"id":"comment-15682","author":"carlos_otal","post":"Ron, estoy de acuerdo con usted. Veamos la liturgia de la época. En la liturgia bizantina del 16 de agosto se identifica el Mandylion con un LIENZO MORTUORIO, la frase “A final burial cloth you wore when dead” no ofrece NINGUNA DUDA. “On the same day memorial of the entry of the Image Not Made By Hand of our Lord and God and Saviour Jesus Christ, brought from the city of the Edessenes to this god protected Queen of cities. Verses Alive you wiped your face upon a cloth, A final burial cloth you wore when dead.” [“Commemoration of the translation from Edessa of the Icon of our Lord Jesus Christ Not Made With Hands, or the Mandylion; and of the Holy Martyr Diomedes.”] http://anastasis.org.uk/16august.htm Carlos Otal.","date":"2012-09-01","mins":"4:47 am","url":"https://shroudstory.com/2012/08/23/scholarly-incompetence-or-dishonesty/","cat":"history","title":"Scholarly Incompetence or Dishonesty?"},{"id":"comment-15422","author":"carlos_otal","post":"Ustedes suelen proponer el tener una MENTE ABIERTA. Aunque sea a manera de especulación o de ficción, a manera de ejercicio mental, ¿cómo habría sido la historia de la Sábana si la imagen hubiera tenido un GRAN PERIODO de LATENCIA? http://lasabanaylosescepticos.blogspot.com.es/2012/08/una intuicion.html Carlos Otal.","date":"2012-08-24","mins":"3:47 am","url":"https://shroudstory.com/2012/08/23/scholarly-incompetence-or-dishonesty/","cat":"history","title":"Scholarly Incompetence or Dishonesty?"},{"id":"comment-15708","author":"carlos_otal","post":"Yannick: Yo NO he leido a Ian Wilson (¡OH!). ¿ Será usted el que esté fuera de pista?. No creo que la traducción utilizada en la liturgia ortodoxa sea incorrecta, y usted NO HA ENTENDIDO lo que escribe Mark Guscin (afortunadamente el texto está escrito en ESPAÑOL) Refiere lo encontrada por él en 3 manuscritos del Sinaxaryon en el Monasterio de Iveron: “Es precisamente aquí donde los manuscritos del Synaxarion se hacen interesantes, puesto que Abgar dice a Ananias que traiga una descripción del rostro, del pelo y de todo el cuerpo de Jesús. En otras palabras, la imagen que se llevó a Edesa era algo que haría visible el cuerpo entero de Cristo. Este texto litúrgico de la iglesia ortodoxa nos dice que la Imagen de Edesa era de todo el cuerpo de Jesús de Nazaret.” “LA SÍNDONE Y LA IMAGEN DE EDESA”. Investigaciones en los monasterios del Monte Athos (Grecia) por Mark Guscin 2003. Http://www.redentoristas.org/sabanasanta/archivosiconos/sindoneedesamarkguscin.pdf Marck Guscin cree muy probable la MISMA IDENTIDAD de la imagen de Edesa y la Sábana Santa..","date":"2012-09-01","mins":"10:08 pm","url":"https://shroudstory.com/2012/08/23/scholarly-incompetence-or-dishonesty/","cat":"history","title":"Scholarly Incompetence or Dishonesty?"},{"id":"comment-15718","author":"carlos_otal","post":"La liturgia ortodoxa parece referirse a 2 iconos, Mandylion y Keramion, no a 3 iconos como usted interpreta: “On the same day memorial of the entry of the Image Not Made By Hand of our Lord and God and Saviour Jesus Christ, brought from the city of the Edessenes to this god protected Queen of cities. Verses Alive you wiped your face upon a cloth, A final burial cloth you wore when dead. For the Tile Maker of all, my Christ, a tile once made By hand now bears your form not made by hand”. Carlos Otal.","date":"2012-09-02","mins":"7:38 am","url":"https://shroudstory.com/2012/08/23/scholarly-incompetence-or-dishonesty/","cat":"history","title":"Scholarly Incompetence or Dishonesty?"},{"id":"comment-15424","author":"carlos_otal","post":"¿Qué son esos círculos ( 4 y 3) que muestra la imagen propuesta, Image of Edessa (11th century), Sakli church, Goreme.? Carlos Otal.","date":"2012-08-24","mins":"4:02 am","url":"https://shroudstory.com/2012/08/23/scholarly-incompetence-or-dishonesty/","cat":"history","title":"Scholarly Incompetence or Dishonesty?"},{"id":"comment-15719","author":"carlos_otal","post":"Mi mensaje anterior va dirigido a Yannick. Carlos Otal.","date":"2012-09-02","mins":"7:40 am","url":"https://shroudstory.com/2012/08/23/scholarly-incompetence-or-dishonesty/","cat":"history","title":"Scholarly Incompetence or Dishonesty?"},{"id":"comment-16614","author":"carlos_otal","post":"Nicolotti NIEGA la verdad del tesstimonio de Robert de Clari. Yannick NIEGA la verdad del testimonio de Gregorio Referendario…….. Yannick insiste en CONFUNDIR el Mandylion ( lo que describió Gregorio Referendario impreso con SUDOR Y SANGRE POR EL DEDO DE DIOS) con los ICONOS del Mandylion ( SIN SUDOR Y SIN SANGRE realizados por el artista). ¡ABERRANTE! Carlos Otal.","date":"2012-09-20","mins":"4:54 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16625","author":"carlos_otal","post":"Conozco perfectamente el artículo de Mark Guscin. Ustedes CONFUNDEN lo que Gregorio Referendario DICE VER y lo que Gregorio Referendario INTERPRETA sobre aquello que ve. Son cosas muy distintas y necesitan del ANÁLISIS. ¿Qué ve? 1. Manchas MONOCROMAS 2. Manchas de SANGRE ¿Qué interpreta? 1. Las manchas MONOCROMAS deben ser de SUDOR 2. Las manchas de SANGRE deben ser del SUDOR DE SANGRE y de la SANGRE del costado. ¿Por qué interpreta así? 1. Porque existen unas LEYENDAS ANTERIORES que relacionan el lienzo con Getsemaní etc,etc, etc y necesita ASUMIR sus contenidos. 2. Porque Gregorio Referendario NO PUEDE DISTINGUIR si los ojos están ABIERTOS O CERRADOS. [al igual que sucede, y es un ejemplo, en la Sábana Santa, LE RECUERDO que VIGNON basó su signo 14, OJOS GRANDES MUY ACENTUADOS, precisamente en eso, LOS OJOS EN LA SABANA PUEDEN PARECER ABIERTOS ( el negativo fotográfico resuelve la duda y están CERRADOS] ¿Qué puede ser cierto (OBJETIVO) de su testimonio? 1. Manchas MONOCROMAS que sugieren un ROSTRO y manchas de SANGRE. 2. NO existencia de colores pictóricos. A. No pueden ANTEPONER la leyenda a LA OBSERVACIÓN DIRECTA DEL LIENZO que realizó Gregorio Referendario. B. Tienen que JUSTIFICAR por qué los ICONOS del Mandylion no muestran manchas de SUDOR y manchas de SANGRE. C. Tienen que ENTENDER que sobre una imagen realizada con MANCHAS DE SUDOR y SANGRE ( y Mark Guscin NO NIEGA la presencia de esas manchas), no se puede DISTINGUIR entre VIVO o MUERTO, entre ojos ABIERTOS y ojos CERRADOS. D. Tienen que CONSIDERAR que probablemente Gregorio Referendario INTERPRETÓ como una imagen de Jesús VIVO ( para ser fiel a la leyenda) lo que era una imagen de Jesús MUERTO ( la sangre del costado le desconcierta). E. Y todo esto, en principio, es INDEPENDIENTE de que se crea o no se crea en la identidad del Mandylion con la Sábana de Turín. Carlos Otal.","date":"2012-09-20","mins":"6:40 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16381","author":"carlos_otal","post":"Estoy de acuerdo con Stephen, con 4 PLEGADOS se obtiene ese resultado. Le sugiero a Stephen una manera MÁS SIMPLE y que haría MÁS SUGERENTE la palabra “tetradiplón. Imagino la Sábana dividida en 4 cuartos, a los que denomino desde la parte superior a la parte inferior: Primer cuarto (A)………..Imagen DORSAL Segundo cuarto (B)……..Imagen DORSAL Tercer cuarto (C)……. Muestra el ROSTRO de la imagen, el tórax, los brazos etc, etc.Imagen FRONTAL Cuarto cuarto (D)…….. Muestra las piernas, pies, etc. Imagen FRONTAL PLIEGO la Sábana por el REVERSO ( NO IMAGEN). 1. A sobre B. Primer cuarto sobre (on) el Segundo cuarto. 2. D sobre C .Cuarto cuarto sobre (on) el Tercer cuarto. 3. D sobre A. Cuarto cuarto sobre (on) el Primer cuarto. Tengo DELANTE DE LOS OJOS la imagen FRONTAL de C (Tercer cuarto) con el ROSTRO, tórax, brazos etc de Cristo. – Tengo la Sábana en 4 PANELES ( sugiere el TETRA) 4. Pliego C por la mitad (DOBLO Y DUPLICO) y obtengo un panel con el ROSTRO como muestra Stephen. 8 paneles, 4 plegados, y en el último plegado he DUPLICADO EL TETRA. [Lamento la BARRERA del idioma] Carlos Otal.","date":"2012-09-17","mins":"4:51 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16737","author":"carlos_otal","post":"¡Así que los eruditos historiadores bizantinos conocen “cientos” y la Iglesia Orrtodoxa SÓLO conoce 4 !. Parecen muy POCO serios los eruditos bizantinos cuando los temas “rozan” a la Sábana Santa, ¡por si acaso…..! “According to the Prologue there are known 4 Not Made by Hand Images of the Saviour: 1) at Edessa, of king Abgar – 16 August. 2) the Kamulian, – Sainted Gregory of Nyssa (Comm. 10 January) wrote about its discovery, while according to the Monk Nikodemos of the Holy Mount (+ 1809, Comm. 1 July), the Kamulian image appeared in the year 392, but it had in appearance an image of the Mother of God – 9 August. 3) in the time of emperor Tiberius (578 582), Saint Mary Syncletika (Comm. 11 August) received healing from this. 4) on ceramic tiles – 16 August.” Carlos Otal.","date":"2012-09-22","mins":"9:00 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16511","author":"carlos_otal","post":"Yo no he leido a Ian Wilson. He emprezado a leer su artículo: “Many questions concerning the Mandylion hypothesis proposed by Ian Wilson !!!” ¡Y he tenido que PARAR la lectura en el Fact #1! “Fact #1 : Every known reproduction of the Mandylion ALWAYS represent a living Christ with his eyes wide open and without any signs of injuries, bruises or bloodstains. The most important thing to note is the fact that many of them were done during the time the relic was kept in Constantinople and publicly showed at least once a year, from 944 until 1090 (at least). Many of these copies were probably done by artists who were able to see the relic with their own eyes, or at least, who were able to get precise information about his physical aspect from eyewitnesses who had seen it in Constantinople. But despite that fact, absolutely none of these copies that have survived until this day represent a bloody and beaten Christ, easily associated with his Passion, the way we see it on the Shroud of Turin. If Wilson’s hypothesis is correct, WHY is this so ???” ¡Qué confusión! Usted, Freeeman, etc, etc, CONFUDEN leyendas, interpretaciones, textos, iconografía etc, etc, etc 1. ¿Recibió la ciudad de Constantinopla el Mandylion en el 944?. SI ¿Vió Gregorio Referendarius el Mandylion cuando escribió su discurso? SI ¿Vió Gregorio Referendarius pigmentos o colores pictóricos en el Mandylion? NO ¿Vió Gregorio Referendarius manchas de SANGRE en el Mandylion? SI ¿Vió Gregorio Referendarius manchas de SUDOR en el Mandylion? SI ERGO el MANDYLION que recibió Constantinopla el 944 y vió Gregorio Referendarius NO ESTÁ REPRESENTADO por la ICONOGRAFÍA DEL MANDYLION. 2. En el SUPUESTO de que el ROSTRO del Mandylion hubiera sido el ROSTRO de la Sábana Santa, en el Mandylion Sábana: – NO se puede advertir si los OJOS están abiertos o cerrados ( sólo en el NEGATIVO fotográfico se advierten CERRADOS) – NO se puede advertir si el ROSTRO representado está VIVO o MUERTO – El icono bizantino es ATEMPORAL y sujeto a leyes estrictas incluso sobre el COLOR, proporción, etc,etc – El artista bizantino NO tiene recursos pictóricos para realizar un ICONO sólo con pigmentos representando SUDOR y pigmentos representando SANGRE. (al igual que sucede HOY con los frustados intentos de REPRODUCCIÓN) – El icono bizantino NO PODRÍA REPRESENTAR lo visto por Gregorio Referendarius. – ERGO los iconos del Mandylion NO REPRESENTAN LA REALIDAD del Mandylion, son una INTERPRETACIÓN de esa realidad, y como toda interpretación, sujeta a ERROR. 3. SOLUCIONE esos pequeños problemas, Yannick. Carlos Otal.","date":"2012-09-19","mins":"12:48 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16518","author":"carlos_otal","post":"…Y es evidente que Gregorio Referendarius está hablando del Mandylion como una imagen MONOCROMA, “embellecida” con la sangre del Señor. Carlos Otal.","date":"2012-09-19","mins":"1:14 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16521","author":"carlos_otal","post":". He referido un SUPUESTO Mandylion Sábana, no he afirmado su identidad, porque se dan SIMILARES circunstancias de dificultad para advertir en el ROSTRO si los ojos están abiertos o cerrados y si corresponde a un vivo o a un muerto……. . Lo que DIFICULTARÍA la interpretación de la imagen que pudiera hacer Gregorio Referendario. . Lo que DIFICULTARÍA todavía más la interpretación artística Usted ESCAPA o HUYE de lo que yo he ARGUMENTADO. EL ARGUMENTO: . El Mandylion que vió Gregorio Referendario NO ESTÁ REPRENTADO por el Mandylion de la iconografía. . El Mandylion que vió Gregorio Referendario, era MONOCROMO embellecido con SANGRE …..y NO ESTÁ REPRESENTADO por el Mandylion de la icongrafía ( ¿dónde esta la sangre?) . Y esto es lo PRIMERO que necesita una EXPLICACIÓN o una ACEPTACIÓN. Si lo que es EVIDENTE no se acepta, todo lo demás que se argumente es un bla, bla, bla, bla,……. Que no conduce a NADA. Carlos Otal.","date":"2012-09-19","mins":"2:02 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16541","author":"carlos_otal","post":"Art Science: 1. Estoy de acuerdo y es lo lógico, los ojos se cierran cuando se acerca a la cara una toalla por reflejo……y para limpiar los párpados 2. Una toalla puede tener un gran tamaño. La iconografía de Jesús lavando los pies a sus discípulos suele mostrar toallas de gran tamaño. – “…..4 He riseth from supper, and laid aside his garments; and took a towel, and girded himself. 5 After that he poureth water into a bason, and began to wash the disciples’ feet, and to wipe them with the towel wherewith he was girded.” John 13:4 5. – un fresco de Pompeya muestra una toalla de gran tamaño que podría servir como hymation. En ambos ejemplos podría la toalla doblarse en 8 paneles perfectamente. Carlos Otal.","date":"2012-09-19","mins":"10:08 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"}]
