[{"id":"comment-15951","author":"carlos_otal","post":"Daveb, el navegador Google Chrome traduce automáticamente TODOS (casi todos) los idiomas. Son traducciones malas, pero suficientes casi siempre para entender los comentarios. Carlos Otal.","date":"2012-09-06","mins":"5:08 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","title":"A different approach to what some see as problems with the image on the Shroud of Turin"},{"id":"comment-15991","author":"carlos_otal","post":"Ron: “También hay que tener en cuenta que en la fase de estado, la rigidez es de tal intensidad que puede originar desgarros el forzarla y, añade el propio Gisbert, que en la segunda fase o período de estado, la rigidez es prácticamente invencible sin producir desgarros o fracturas. Hoy se sabe,y la experiencia lo confirma, que cuando la rigidez está establecida el esfuerzo que debe aplicarse es considerable, pudiendo originarse roturas fibrilares, luxaciones o malposiciones articulares, fenómeno repetitivo en las salas de autopsia cuando se vence la rigidez para iniciar la necropsia. Es éste un punto que debe considerarse también en el caso que estudiamos porque la subluxación del hombro, cuya explicación se ha intentado de tantas formas, tiene claramente este origen. ” “MOMENTO EN QUE SE PRODUJO LA IMAGEN SINDÓNICA.VALORACIÓN DE LA MEDICINA LEGAL”. Prof.Dr.José Delfín Villalaín Blanco .Catedrático de Medicina Legal. [ la Medicina Legal es la medicina forense] Carlos Otal.","date":"2012-09-07","mins":"11:36 am","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","title":"A different approach to what some see as problems with the image on the Shroud of Turin"},{"id":"comment-15943","author":"carlos_otal","post":"Hay propuestas MUY ESTÚPIDAS que siguen manteniendo su ECO en las páginas escépticas : ¡ No poder ALCANZAR con las manos los genitales, estando tumbados.! No conozco si existe un origen anterior de esa estúpidas propuesta. La leí por vez primera en la revista del CSICOP “Pensar”: “Cualquier persona que quiera simular la posición del supuesto”cadáver”, puede hacer lo siguiente: acostarse en el suelo boca arriba, dejar reposar los codos sobre el suelo, tomar una de las muñecas con la otra mano, Y SIN DESPEGAR LOS CODOS DEL SUELO, tratar de ocultar los genitales… lograr esta posición es tan imposible como morderse el codo. Es claro que el falsificador que pintó la imagen tuvo bien claro que sería poco decoroso mostrar los órganos genitales del Nazareno en un lienzo que se iba a exponer públicamente para atraer peregrinaciones.” “Las anomalías ignoradas del “sudario” de Turín”. Hernan del Toro.”Pensar”.Volumen 1 Número 1 Enero/Marzo 2004 [PENSAR era una publicación del CSICOP de Colombia, en idioma español (castellano) Committee for the Scientific Investigation of Claims of the Paranormal Center for Inquiry International Presidente: Paul Kurtz .Director Ejecutivo: Barry Karr] http://www.pensar.org/2004 01 turin.html Escribe el autor del artículo, y lo RESALTA en letra “itálica” ( yo lo he escrito aquí con letra “mayúscula”). ” …..Y SIN DESPEGAR LOS CODOS DEL SUELO……”, Es condición “sine qua non” ( condición necesaria e imprescindible) que la articulación del codo quede FIJA contra el suelo para así no poder alcanzar los genitales……¡ ni la BOCA, ni la NA Ri Z, ni la OREJA, etc,etc,! Hay que ser MUY TORPE para no advertir la TRAMPA, y la mayoría de los “copistas escépticos” prescinden de esa frase (“….Y SIN DESPEGAR LOS CODOS DEL SUELO……”,) causando estupor en los lectores NORMALES, que alcanzan sus genitales con las manos estando tumbados sin el menor problema……. ¿Por qué tendrían que estar los CODOS del Hombre de la Sábana PEGADOS al suelo? Es una ESTUPIDEZ de los escépticos “organizados”, en realidad ateos cristófobos. Carlos Otal.","date":"2012-09-06","mins":"3:45 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","title":"A different approach to what some see as problems with the image on the Shroud of Turin"},{"id":"comment-18745","author":"carlos_otal","post":"The lignina IS NOT a polysaccharide La lignina es un POLÍMERO del fenilpropano. Carlos Otal.","date":"2012-11-02","mins":"8:13 pm","url":"https://shroudstory.com/2012/11/02/an-image-formed-by-the-yellowing-of-lignon/","cat":"image_theory","title":"An image formed by the yellowing of Lignin?"},{"id":"comment-4341","author":"carlos_otal","post":"Pienso que en el fondo del debate sobre monedas y flores, ya sea consciente o subconscientemente, subyace la reacción de Maillard a la que Rogers atribuye el COLOR de las fibras del lino. Como cualquier otra teoría vaporográfica la reaccion de Maillard NO puede justificar la imagen, ni de monedas y flores si es que las hubiera, ¡ ni la imagen del Hombre de la Sábana!. Podría haber justificado el COLOR , no su ordenación como IMAGEN…….pero ni siquiera el color es admisible es este caso específico de la Sábana de Turín. La presencia del RIGOR MORTIS, patente en la imagen, indicando la persistencia de elevada cifras de ácido láctico NO es compatible con el inicio de la DESCOMPOSICIÓN de las proteinas y producción de las aminas CADAVERINA, PUTRESCINA y afines, necesarias en la reacción de Maillard que propuso Rogers. La descomposición se inicia una vez ha CESADO el rigor mortis. Rogers, al que tanto debemos en el estudio de la Sábana, se equivocó en este punto, el cuerpo de Jesús de Nazaret NO sufrió la corrupción, no pudo producir cadaverina, putrescina y afines, y por tanto no pudo haber ninguna reacción de Maillard que diera color a la Sábana. Para los que creemos en la verdad de ” ni permitirás que tu santo vea la corrupción”, Hechos 2:22 33, la producción de aminas aromáticas, cadaverina y putrescina procedentes de la CORRUPCIÓN, DESCOMPOSICIÓN o PUTREFACCIÓN de las proteínas corporales del Hombre de la Sábana, precisas en la reacción de Maillard que propone Rogers, NO es aceptable ……..y para Turín creo que tampoco. Carlos Otal.","date":"2011-10-25","mins":"6:11 pm","url":"https://shroudstory.com/2011/10/25/more-on-max-patrick-hamon-and-the-coin-on-eye-issue/","cat":"image_theory","title":"More on Max Patrick Hamon and the Coin-on-Eye Issue"},{"id":"comment-13630","author":"carlos_otal","post":"Anoxie: Cadaverina y putrescina……NO Temperatura……………………NO Reaccion de Maillard………..NO Hipotesis de Rogers,,,,,,,,,,,,NO (corneliotel o carlos).","date":"2012-07-09","mins":"2:34 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis"},{"id":"comment-16600","author":"carlos_otal","post":"No entiendo. ¿Cree que una radiación, por ejemplo la UV, NO ACTUARÍA sobre la “capa de impurezas” propuesta por Rogers produciendo cromóforos? Garlaschelli obtiene los cromóforos mediante el ácido sulfúrico….¿o no son cromóforos? Carlos Otal.","date":"2012-09-20","mins":"3:01 pm","url":"https://shroudstory.com/2012/09/20/speaking-of-the-the-mannix-proposal-to-test-the-maillard-reaction/","cat":"image_theory","title":"Speaking of the the Mannix proposal to test the Maillard Reaction"},{"id":"comment-18532","author":"carlos_otal","post":"Thibault: ¡Muy buen trabajo y magníficas fotografías! Carlos Otal.","date":"2012-10-29","mins":"10:21 pm","url":"https://shroudstory.com/2012/10/21/thibault-heimburger-now-i-know-for-sure-that-the-ts-body-image-is-not-a-scorch/","cat":"image_theory","title":"Thibault Heimburger: Now, I know for sure that the TS body image is not a scorch"}]
