[{"id":"comment-16857","author":"carlos_otal","post":"¿Ha VISTO usted alguna vez el trozo de Sábana que fue cortado para la datación con el C14? Flury Lemberg NO participó en la elección del trozo que fue cortado,así que DIFICILMENTE podría conocer esa zona con anterioridad. Vea el ANTES y el DESPUES en mi blog: http://lasabanaylosescepticos.blogspot.com.es/2006/01/la zona de donde se cort.html [la fotografía del ANTES es muy poco conocida, solicité a Dan que la bajara a su blog pero no lo ha hecho] Son fotografías de GRAN RESOLUCIÓN en las que podrá observar el GRAN DETERIORO de la parte cortada para el C14, además de constatar que fue MUCHO MAYOR que lo que indicó NATURE ( 1×7 cm). Puede haber REMIENDOS y cualquier cosa que a usted se le ocurra……….. No conocemos además que partes exactas de la muestra cortada fueron las enviadas a los laboratorios. Casi TODA la parte deteriorada ya no se observa DESPUÉS de cortar la muestra, y mal la pudo ver por lo tanto Flury Lemberg. ¡Mala elección en el corte! Carlos Otal.","date":"2012-09-24","mins":"10:51 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-16903","author":"carlos_otal","post":"Zurich sample: ¡IMPOSIBLE! http://archiv.ethlife.ethz.ch/e/articles/sciencelife/turin.html Carlos Otal.","date":"2012-09-25","mins":"3:23 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-16922","author":"carlos_otal","post":"Ncalibey: http://www.shroud.com/pdfs/benfordmarino.pdf Carlos Otal.","date":"2012-09-25","mins":"10:35 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-16920","author":"carlos_otal","post":"Official photos do not exist. Pero SÓLO existe tejido con ese hilado en la Sábana de Turín y en la reserva del Victoria and Albert Museum. La foto de la muestra Oxford fue proporcionada por el Prof.Hedges ( Laboratorio de Oxford) a instancia de Bonnet Eymard el 16 de noviembre de 1990. No lleva escala, fecha ni sello. Http://lasabanaylosescepticos.blogspot.com.es/2006/01/oxford.html La foto en color de la muestra Zurich (Z1) fue proporcionada por el Prof:.Wölffli ( Laboratorio de Zurich) en 1988 a instancia de Bonnet Eymard. Http://lasabanaylosescepticos.blogspot.com.es/2006/01/zurich 1988 buscad y encontrareis.html La foto en blanco/negro de la muestra Zurich (Z1) es la misma foto que la anterior en color, fue publicada en E.T.H Yearbook 4988, page 48 “Masse des Turiner Grabtuch (Zurich) 1.4 x1.8 cm. Abbildung mit mm. Masstab.” http://lasabanaylosescepticos.blogspot.com.es/2006/01/no valen los milagros para resolverlo.html – El foto montaje http://archiv.ethlife.ethz.ch/images/turin tuch l.jpg publicado por E.T.H en 2005 fue realizado por el laboratorio de Zurich para la BBC. Bonnet Eymard lo describió en 1988 viéndolo en el despacho del Prof. Wölffi. Z1 es la muestra por el REVERSO (?). Se dividió en Z1.1 y Z1.2 Z1.1 se dividió en 3 sub muestras, Z1.1.1….Z1.1.2…..y.. Z1.1.3, sobre las que se realizó la datación por el C14. Z1.2 se dividió en 2 sub muestras según “Table 1 Basic Data (individual measurements)”. Nature, Vol. 337, No. 6208, pp. 611 615, 16th February, 1989. ( They are not in the photomontage). “The Zurich group first split each ultrasonically cleaned sample in half, with the treatment of the second set of samples being deferred until the radiocarbon measurements on the first set had been completed. The first set of samples was further subdivided into three portions. One third received no further treatment, one third was submitted to a weak treatment with 0.5% HCL (room temperature), 0.25% Na OH (room temperature) and again in acid, with rinsing in between. The final third was given a strong treatment, using the same procedure except that hot (80° C) 5% HCL and 2.5% Na OH were used.” Nature, Vol. 337, No. 6208, pp. 611 615, 16th February, 1989 – “The shroud was separated from the backing cloth along its bottom left hand edge and a strip (~10 mm x 70 mm) was cut from just above the place where a sample was previously removed in 1973 for examination. The strip came from a single site on the main body of the shroud away from any patches or charred areas. Three samples, each ~50 mg in weight, were prepared from this strip. The samples were then taken to the adjacent Sala Capitolare where they were wrapped in aluminium foil and subsequently sealed inside numbered stainless steel containers by the Archbishop of Turin and Dr Tite. Samples weighing 50 mg from two of the three controls were similarly packaged. The three containers containing the shroud (to be referred to as sample 1) and two control samples (samples 2 and 3) were then handed to representatives of each of the three laboratories together with a sample of the third control (sample 4), which was in the form of threads.” Nature, Vol. 337, No. 6208, pp. 611 615, 16th February, 1989. How obtains a rectangular sample of dimensions 1.8 x 1.4 cm aprox. From a rectangular strip of fabric of ~10 mm x 70 mm ? Without MIRACLES! – LA TRAZABILIDAD ES NULA. Carlos Otal.","date":"2012-09-25","mins":"10:23 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-16994","author":"carlos_otal","post":"¡OK, Richard! Carlos Otal.","date":"2012-09-27","mins":"2:25 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"}]
