[{"id":"comment-15758","author":"carlos_otal","post":"¡Teníamos pseudo ciencia y ahora tenemos pseudo historiografía! ¡Ja,ja,ja…! ¡Gracias a los “auténticos eruditos”, como Nicolotti, sabemos que “the Picard crusader Robert de Clari in Saint Mary of Blachernae did not see the Shroud, but rather a silk veil, in front of an icon of the Virgin, than every Friday would have risen miraculously”! ¡Eso es ERUDICIÓN! Son muy interesantes algunos de los comentarios de Marinelli sobre los últimos libros de Nicolotti: “A small cloth to be destroyed” http://www.shroud.com/pdfs/n75part8.pdf “Wiping the slate clean” http://www.shroud.com/pdfs/n74part8.pdf Es muy afortunado que existan los Wilson, Scavone, Guscin, Marinelli, etc, etc Los ataques DESAFORTUNADOS de Yannick hacia Ian Wilson creo que sirven para hacer más fans de Wilson ¡Lea, compare…… y elija! Personalmente este debate me está sirviendo para reforzar la idea de que la imagen de Edesa era lo que hoy conocemos como Sábana de Turín. !Anteriormente no lo tenía tan claro!.","date":"2012-09-02","mins":"9:42 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15763","author":"carlos_otal","post":"Yo no he hablado de la hipótesis de Wilson. Hablo de la identidad de la imagen de Edesa y la Sábana de Turín. ¿es usted periodista? ¿es usted historiador? ¿qué criterios tiene para decidir quiénes son los “verdaderos eruditos”? ¿no encuentra extraño que los “eruditos” que atacan la identidad de la imagen de Edesa con la Sábana de Turín sean anti Shroudies? ¿no cree que eso tiene mucho más que ver con su sesgo anti Sudario? ¿quiénes son los “verdaderos eruditos” que CREEN en la autenticidad de la Sábana de Turín? ¿Usted quizás? Carlos Otal.","date":"2012-09-02","mins":"10:39 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15776","author":"carlos_otal","post":"Nicolotti: El problema No suele ser el dato, el problema es la INTERPRETACIÓN DEL DATO. ¿Cómo se digiere o “se come” el ser HIPERCRÍTICO con el dato y ACRÍTICO en su interpretación? ¿Cómo se digiere o “se come” que Robert de Clari NO VEA la imagen de Jesús y SI VEA la imagen de la Virgen? (es tan sólo un ejemplo de “su manera” acrítica de INTERPPRETAR) ¿Cuál es la “fórmula”? ¿ Se enseña quizás en la Universidad también? Carlos Otal.","date":"2012-09-03","mins":"8:00 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15781","author":"carlos_otal","post":"En el supuesto poco probable de que Robert de Clari no hubiera visto la imagen de Nuestro Señor, él afirma que TODOS los viernes se podía ver en Sainte Marie de Blakerne. El testimonio sigue siendo VÁLIDO para la presencia de una Sábana con la imagen del Señor ( que a usted obviamente le desagrada) y desconocemos si él fue o no fue testigo presencial, con mayor valor el dato si fuere testigo presencial. Su problema es: 1. Probar que NO la vió. Usted NO puede probarlo. 2. Probar que es FALSO el contenido de la frase “et entre ches autres en eut un autre des monstiers que on apeloit me dame Sainte Marie de Blakerne ou li Sydoines la ou Notre Sires fu envelopes i estoit, qui cascuns de venres se drechoit tout drois, si que on poit veir la figure de Notre Seigneur” , o sea que en Sainte Marie de Blakerne NO se mostraba los vierne la sydoines donde se veia la figura de Nuestro Señor. Usted NO puede probarlo. La viera o no la viera el testimonio de Robert de Clari es muy favorable a la presencia de una Sábana con la Imagen de Nuestro Señor en Constantinopla. Carlos Otal.","date":"2012-09-03","mins":"9:29 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15801","author":"carlos_otal","post":"Nicolotti: Le agradezco sinceramente que muestre en sus comentarios su “forma” de pensamiento, es ESCLARECEDORA. Usted además entiende y escribe perfectamente el español, así que doblemente le agradezco su respuesta. 1. “Antes has dicho que Clari vió la Sydoine.” ERRÓNEO. En ningún momento he hecho ESA AFIRMACIÓN. (¡muéstrela si puede!). Yo he dicho: ¿Cómo se digiere o “se come” que Robert de Clari NO VEA la imagen de Jesús y SI VEA la imagen de la Virgen? y En el supuesto poco probable de que Robert de Clari no hubiera visto la imagen de Nuestro Señor, él afirma que TODOS los viernes se podía ver en Sainte Marie de Blakerne. 2. ” « La viera o no la viera….”. No, Carlos. La viera o no la viera no es lo mismo.” TENDENCIOSO. Usted, Nicolotti, ha entendido perfectamente mi escrito e el que dije: “……y desconocemos si él fue o no fue testigo presencial, con mayor valor el dato si fuere testigo presencial.” ¿o quizás no enténdió el significado de “CON MAYOR VALOR SI FUERE TESTIGO PRESENCIAL”? 3. “La transcripción de la versión francesa, que me has dado, no es buena. Curiosamente la veo en el Internet. Tal vez ha copiado desde allí?” TENDENCIOSA Y EQUIVOCADA SUPOSICIÓN (marginal a la bondad o no bondad de la traducción) He utilizado una de las varias traducciones que tengo, en este caso la utilizada por Mark Guscin en su artículo “LA SÍNDONE Y LA IMAGEN DE EDESA”: “De interés especial es lo que observó en la iglesia de Santa María en Blachernae: “et entre ches autres en eut un autre des monstiers que on apeloit me dame Sainte Marie de Blakerne ou li Sydoines la ou Notre Sires fu envelopes i estoit, qui cascuns de venres se drechoit tout drois, si que on poit veir la figure de Notre Seigneur”, lo cual en español significa “Y entre otras, había otra iglesia que llamaban Mi Señora Santa María de Blachernae, donde se guardaba la sydoine en que se había envuelto Nuestro Señor. Se levantaba cada viernes para que el cuerpo del Señor se pudiera ver con claridad”.” Pero podría haber utilizado la de Dembowski: “There was a Church which was called of My Lady Saint Mary of Blachernae, where there was the shroud (syndoines) in which Our Lord had been wrapped, which every Friday, raised itself upright so that one could see the form (figure) of Our Lord on it, and no one either Greek or French, ever knew what became of this shroud (syndoines) when the city was taken [by the Crusaders]” (Robert de Clari, La Conquete de Constantinople, ed. Ph. Lauer [Paris, 19241, P. 90, 11.42 50). O alguna de las que utiliza Scavone: “Et entre ches autres en eut un autre des mousters que on apeloit medame Sainte Marie de Blakerne, ou li sydoines la ou nostres sires fu envelopes, i estoit, qui cascuns desvenres se drechoit tous drois, si que on i pooit bien veir le figure nostre seigneur, ne seut on onques ne Griu ne Franchois que chis sydoines devint, quant le vile fu prise”. Y “In the church of Our Lady of Blachernae the sydoines of Jesus stood up straight every Friday [cascuns devenres se drechoit tous drois] so that the figure of Our Lord could be plainly seen there.” O la de P.Savio: “et entre ches autres en eut un autre des monstiers que on apeloit me dame Sainte Marie de Blakerne ou li Sydoines la ou Notre Sires fu envelopes i estoit, qui cascuns de venres se drechoit tout drois, si que on poit veir la figure de Notre Seigneur”. No afectan al contenido de mi comentario. 4. El hecho del analfabetismo, estar escrito por otra persona alfabetizada, estar escrito en Francia, cometer errores en la descripción de Constantinopla, su credulidad, etc, etc NO MODIFICAN sustancialmente el que Robert de Clari relate algo TAN SIMPLE como la existencia de una ceremonia de culto en que se muestra la “sydoines” con la imagen de Jesús. 5. ” Podría ser cualquier tela con la imagen de Cristo muerto, como muchas estaban en ese momento” ¡OHHHHHHHHH! PURA ESPECULACIÓN. Si hubiera existido la posibilidad de existencia de ALGUNA tela con la imagen de Cristo muerto, ya se habrían encargado ustedes de DEMOSTRAR SU INEXISTENCIA, ¡por si acaso! 6. “Así que este testimonio no cambia nada, sino para demostrar (si fuera verdadero, y yo no lo creo) que ya en el siglo 13 alguien dijo que existian sàbanas con imagen”. MODIFICABLE. Este testimonio sirve para demostrar ( si fuera verdadero, y o SI lo creo), que muy a principios del siglo 13 alguien dijo que existía en Constantinopla UNA sábana con la Imagen de Jesús. [que es lo que he mantenido en otros foros de debate] 7. Dije al PRINCIPIO de este comentario que su “forma” de pensamiento era ESCLARECEDORA. Usted, Nicolotti, en este breve “debate” conmigo en un blog de Internet ha cometido errores ( yo no he afirmado que Robert de Clari viera la Imagen de Jesús, dije sólo que era probable), ha sido tendencioso, ha supuesto equivocadamente y ha especulado sin fundamento sólido ( “podría ser cualquier tela…..”). 8. Lo cual me hace suponer con un cierto fundamento dada esta breve experiencia, que esas “cualidades no deseadas” podrían trasladarse a parte de sus otros escritos…….. Carlos Otal.","date":"2012-09-03","mins":"3:32 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-4650","author":"carlos_otal","post":"“Ved mis manos y mis pies:soy yo mismo.Tocadme y daos cuenta que un espíritu no tiene carne ni huesos como veis que yo tengo”. Lucas 47.39. Lucas refiere una resurrección FÍSICA, antes MUERTO y ahora VIVO, Carlos Otal.","date":"2011-11-07","mins":"3:02 pm","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","title":"A Guest Posting by Giulio Fanti"}]
