[{"id":"comment-20611","author":"carlos_otal","post":"¡Daveb,magnífica respuesta! Yo estoy totalmente de acuerdo. Carlos Otal.","date":"2012-12-18","mins":"5:28 am","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"id":"comment-20691","author":"carlos_otal","post":"Los escritos de Yannick rozan el PANFLETO….y además no quiere entender la posición del que considera su adversario ( su fijación con el Prof. Giulio Fanti es una OBSESIÓN). Los cristianos creemos en la Resurrección de Jesús gracias a la FE, La impronta corporal de Jesús muerto que presenta la Sábana Santa demuestra la muerte de Jesús. Los líquidos y gases producto de la descomposición del cuerpo muerto de Jesús habrían destruído la impronta corporal del cuerpo de Jesús entre las 40 72 horas de su contacto con la Sábana. – El HECHO de que la impronta corporal de Jesús muerto se muestre en la Sábana Santa es prueba de la RESURRECCIÓN, lo que es coincidente con nuestra FE cristiana. [ La “estrategia escéptica” futura (¡ ya se va observandodo!) será NEGAR la resurrección física de Jesús y postular que el cuerpo de Jesús fue robado por sus amigos o enemigos…..] – El estudio de TODAS las causas físicas o químicas que hayan podido intervenir en la formación de la impronta corporal de Jesús muerto PREVIAS A PERDER EL CONTACTO FÍSICO CON LA SÁBANA es objeto de la Ciencia……y eso, aunque a Yannick no le guste, incluye si la desmaterialización de la “materia” (un supuesto teórico) puede perturbar la estructura del tejido de la Sábana. Carlos Otal.","date":"2012-12-19","mins":"6:48 am","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"id":"comment-20740","author":"carlos_otal","post":"¡Creo que el FANÁTICO es Yannick! Debe explicar qué sucedió con el cuerpo…… El Evangelio indica claramente que Jesús tenía cuerpo físico y NO ERA un espíritu: Luke 24: 36 46 “36 While they were still talking about this, Jesus himself stood among them and said to them,”Peace be with you.” 37 They were startled and frightened, thinking they saw a ghost. 38 He said to them, “Why are you troubled, and why do doubts rise in your minds? 39 Look at my hands and my feet. It is I myself ! Touch me and see; a ghost does not have flesh and bones, as you see I have.” 40 When he had said this, he showed them his hands and feet. 41 And while they still did not believe it because of joy and amazement, he asked them, “Do you have anything here to eat?”42 They gave him a piece of broiled fish, 43 and he took it and ate it in their presence. 44 He said to them, “This is what I told you while I was still with you: Everything must be fulfilled that is written about me in the Law of Moses, the Prophets and the Psalms.” 45 Then he opened their minds so they could understand the Scriptures. 46 He told them, “This is what is written: The Christ will suffer and rise from the dead on the third day,” Yannick NO CREE en la resurrección del cuerpo de Jesús, así que debe ACLARAR cual es su pensamiento. Carlos Otal.","date":"2012-12-19","mins":"4:41 pm","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"id":"comment-20749","author":"carlos_otal","post":"“……..but even miracles have physical corollaries”. ¡Exacto, Hugh! Y a eso me refería cuando yo escribí en un anteriorior comentario: “ El estudio de TODAS las causas físicas o químicas que hayan podido intervenir en la formación de la impronta corporal de Jesús muerto PREVIAS A PERDER EL CONTACTO FÍSICO CON LA SÁBANA es objeto de la Ciencia……y eso, aunque a Yannick no le guste, incluye si la desmaterialización de la “materia” (un supuesto teórico) puede perturbar la estructura del tejido de la Sábana.”. Carlos Otal.","date":"2012-12-19","mins":"6:15 pm","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"id":"comment-3150","author":"carlos_otal","post":"Estimado Dan: El traductor automático del Google Chrome hace una traducción totalmente PERVERSA del inglés al español de la frase de Benedicto XVI: “In any case, the aspect of this relic (the Shroud of Turin) is, in principle, RECONCILIABLE with the two reports (the one from the gospel of John and the one from the Synoptic gospels).” “En cualquier caso, el aspecto de esta reliquia (la Sábana Santa de Turín) es, en principio, IRRECONCILIABLE con los dos informes (el del evangelio de Juan y el de los evangelios sinópticos). [ IRRECONCILIABLE = NO CONCILIABLE] La traducción CORRECTA es justamente lo contrario: “En cualquier caso, el aspecto de esta reliquia (la Sábana Santa de Turín) es, en principio, CONCILIABLE con los dos informes (el del evangelio de Juan y uno de los de los evangelios sinópticos). Un cordial saludo C.O.","date":"2011-05-17","mins":"8:16 am","url":"https://shroudstory.com/2011/05/16/jesus-of-nazareth-holy-week-from-the-entrance-into-jerusalem-to-the-resurrection/","cat":"books","title":"Jesus of Nazareth: Holy Week: From the Entrance Into Jerusalem To The Resurrection"},{"id":"comment-20750","author":"carlos_otal","post":"Corrección : “……anterior comentario” ( NO “…anterioriorior comentario”).","date":"2012-12-19","mins":"6:19 pm","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"id":"comment-3156","author":"carlos_otal","post":"Estimado Yannick Clément: Es lo mismo que digo yo, aunque es probable que mi comentario sólo sea claramente inteligible para aquellos que lean DIRECTAMENTE en español mi comentario sin traducción. El hecho de que el Papa utilice el término RELIQUIA para referirse a la Sábana de Turín lleva además implícito el reconocimiento de su AUTENTICIDAD. Un cordial saludo..","date":"2011-05-17","mins":"4:36 pm","url":"https://shroudstory.com/2011/05/16/jesus-of-nazareth-holy-week-from-the-entrance-into-jerusalem-to-the-resurrection/","cat":"books","title":"Jesus of Nazareth: Holy Week: From the Entrance Into Jerusalem To The Resurrection"}]
