[{"id":"comment-136454","author":"russ_breault","post":"Great timing on this image, I was looking for something to illustrate Gregory’s sermon on August 16, 944. This is perfect..","date":"2014-07-09","mins":"12:57 am","url":"https://shroudstory.com/2014/07/08/a-long-cloth-mandylion/","cat":"art","title":"A Long Cloth Mandylion?"},{"id":"comment-171887","author":"russ_breault","post":"Many people have asked me about this. They ask me about the apparent difference in appearance, most notably the shorter hair. I just tell them its proof they have barber shops and hair salons in heaven!.","date":"2014-11-18","mins":"11:17 am","url":"https://shroudstory.com/2014/11/18/akiane-kramarik-the-prince-of-peace-and-the-shroud-of-turin/","cat":"art","title":"Akiane Kramarik, The Prince of Peace and the Shroud of Turin"},{"id":"comment-101967","author":"russ_breault","post":"I am confident that if we were to overlay the Shroud over the image almost anyone, we would find 40 50 points of congruence. However, at some level, the points of congruence must become statistically significant as in the case of the Justinian coins–particularly the Tremesis coin, and the Sinai Icon from the Monastery of St. Catherine. These are at the 180 range regarding points of congruence and my view must be considered more than random or accidental..","date":"2014-04-21","mins":"10:34 am","url":"https://shroudstory.com/2014/04/21/heaven-is-for-real-the-akiane-prince-of-peace-the-isa-mosaic-and-the-shroud-of-turin/","cat":"akiane_kramarik","title":"Heaven is for Real, the Akiane Prince of Peace, the ISA Mosaic and the Shroud of Turin"},{"id":"comment-19619","author":"russ_breault","post":"Dan, Not sure if this is the best place to write this but I am interested in developing a secondary presentation to be called “Secrets of the Shroud”. In this presentation I want to cover many of the unique data points that are often left out of a general overview for time sake. These could be details related to the blood, the image, the cloth itself and even nuances of history. I would love to hear from your knowledgeable readers some of their thoughts on what to include..","date":"2012-11-29","mins":"1:18 am","url":"https://shroudstory.com/2012/11/28/do-nobody-knows-nothing/","cat":"art","title":"Do Nobody Knows Nothing?"},{"id":"comment-197847","author":"russ_breault","post":"Dan, I can understand how an artist may be able to paint something free hand that is the size of a standard canvass. However, a 14 foot linen cloth may be a different story. This is why Isabel develops an underlying “cartoon” first to make sure the proportions are correct. I have a replica and it is a BIG canvass to try to “paint” free hand..","date":"2015-04-28","mins":"10:57 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","title":"Having Nightmares"},{"id":"comment-47250","author":"russ_breault","post":"I don’t know what Isabel’s credentials are as a physicist, but her credentials as a world class artist speak for itself. She is a genuine prodigy to have been commissioned to paint a 400 square foot mural in the Vatican at age 14. Her testimony as an artist is critically important because, if the Shroud is not authentic, it MUST be the work of an artist. And who better to analyze it but another artist who is familiar with medieval art techniques and materials..","date":"2013-10-12","mins":"1:43 pm","url":"https://shroudstory.com/2013/10/12/in-case-you-missed-isabel-piczeks-wonderful-paper/","cat":"art","title":"In case you missed Isabel Piczek’s wonderful paper"},{"id":"comment-144826","author":"russ_breault","post":"The video says this is a second century icon image. Is there any information on where this is found? I do find the frontal facing image with long hair and beard interesting if indeed it is from second century..","date":"2014-08-19","mins":"4:32 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-144862","author":"russ_breault","post":"Thanks for your nice comments regarding Shroud Encounter. The info you provided is helpful..","date":"2014-08-19","mins":"9:35 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-140010","author":"russ_breault","post":"Max, thanks for re posting all of your prior posts. Very helpful!.","date":"2014-07-23","mins":"3:23 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","title":"Origin of the Gammadia"},{"id":"comment-139875","author":"russ_breault","post":"Aldo Guerreschi demonstrated very clearly that the water stain pattern was probably a result from when the Shroud was folded in a particular manner and rolled up to be kept in an urn similar to how the Dead Sea Scrolls were kept. If water or condensation got into the bottom of the urn it would create the same water stain patterns as seen on the Shroud. I usually say the stains are from the dowsing of the 1532 fire but it is probably not the case given the repetitive pattern of the water stains over the entire cloth. This relates to the “L” shaped pattern of holes as Mario posted above in that it seemed to be a Jewish symbol circa first century. So now it has me wondering if the burn hole pattern was just an accident with a Byzantine censor (as I usually say) or a more deliberate symbol applied by first century Jews who may have kept the cloth in an urn until it was taken out of Jerusalem two years prior to 66 when the uprising began that led to the destruction of the temple. According to Eusebius the faithful were “warned by the Holy Ghost” to leave Jerusalem around 64. Eusebius writes that all the sacred objects related to Christ were taken to Syria and were dispersed to Beruit, Pella and Edessa. Is it possible that as a symbol of ancient Judaism that the burn hole pattern was kind of Jewish “branding” to establish its authenticity? I am just speculating…but it has my juices going..","date":"2014-07-22","mins":"9:42 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","title":"Origin of the Gammadia"},{"id":"comment-139867","author":"russ_breault","post":"I did some additional research and it appears that the Gamma symbol is the third letter of the Greek alphabet and also because of the three points on the symbol similar to a backwards “7” it is the oldest symbol of the Trinity. I have no idea if it has any relation to the burn holes on the Shroud but it would fascinating to find a connection..","date":"2014-07-22","mins":"8:39 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","title":"Origin of the Gammadia"},{"id":"comment-139903","author":"russ_breault","post":"Here is another image showing the Gammadia symbol on an altar cloth showing Abel and Melchezidek. The use on an altar cloth is intriguing because the L shaped pattern of holes is shown 4 times on the Shroud–two times where the front image can be seen and two more where the dorsal image can be seen. Http://ldstempleendowment.blogspot.com/2010/03/garments veil and gammadia markings 03.html.","date":"2014-07-22","mins":"11:45 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","title":"Origin of the Gammadia"},{"id":"comment-139909","author":"russ_breault","post":"I am trying to figure out why the “L” symbol came to mean victory over death for the early Jewish believers circa first century. It could also symbolize a general belief in the resurrection–not necessarily Christian ie, the Pharisees believed in the resurrection whereas the Sadducees did not. Could it be because the bottom part of the L represents the body in death where as the vertical part of the L represents the body rising from the dead? Did the Jews at Masada place this emblem on their clothes because they knew they would all die at the hands of the Romans but believed they would see each other again at the resurrection? Not one Jew was found alive when the Romans reached the summit..","date":"2014-07-23","mins":"12:52 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","title":"Origin of the Gammadia"},{"id":"comment-124758","author":"russ_breault","post":"I use a series of these exhibition etchings in my lecture in dealing with the C 14 debacle. At the very least it demonstrates the absolute insanity of choosing either of the outside corners where we know it had been held and handled hundreds of times. Here is a clip from one of my lectures, the etchings start about 8 minutes into the clip. Https://www.youtube.com/watch?v=e 7 Ge ul6hs.","date":"2014-05-26","mins":"8:51 am","url":"https://shroudstory.com/2014/05/26/pictures-of-ostentations/","cat":"art","title":"Pictures of Ostentations"},{"id":"comment-188060","author":"russ_breault","post":"I agree Dave. That is the first thing I noticed is how faint the image looks contrary to Charles’ premise..","date":"2015-02-01","mins":"8:59 am","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","title":"Picture for Today"},{"id":"comment-124781","author":"russ_breault","post":"You are right Hugh. In fact I usually do correct that statement during the Q&A. The question always comes up, “Why haven’t they carbon dated it again?” That is when I reveal the sad news it was the Church itself who made the decision as to how many labs were involved, where the sample(s) would be cut and the location. No wonder they haven’t asked for another test! If the 1988 test results are questionable…it is their own fault for allowing aesthetics to supersede a rigorous protocol. However, I do not hold the carbon labs blameless. They knew the risks of taking one sample and the risks of a sample taken from the corner edge. Did they raise a protest? Not to my knowledge..","date":"2014-05-26","mins":"10:06 am","url":"https://shroudstory.com/2014/05/26/pictures-of-ostentations/","cat":"art","title":"Pictures of Ostentations"},{"id":"comment-25605","author":"russ_breault","post":"That is an excellent concise statement and one De Wesselow, as an art historian would completely agree with. Well said..","date":"2013-02-25","mins":"9:15 am","url":"https://shroudstory.com/2013/02/25/the-art-of-the-impossible/","cat":"art","title":"The Art of the Impossible?"},{"id":"comment-184028","author":"russ_breault","post":"Charles, what about these pictures from the Holkham Bible has ANY resemblance to the Shroud? I don’t see any comparable details except the beard, long hair and that he is naked. So what? As far as the blood, there is no resemblance at all to what is seen on the Shroud. You are simply trying to lead people–the uninitiated– to a conclusion that simply cannot be sustained by the facts. It is time to give up. Colin Berry destroyed your calcium carbonate theory as “proof” for you gesso hypothesis..","date":"2015-01-17","mins":"7:55 am","url":"https://shroudstory.com/2015/01/17/squiggles-of-blood-on-the-head-almost-identical-to-holkham-bible/","cat":"art","title":"Squiggles of Blood on the Head Almost Identical to Holkham Bible?"},{"id":"comment-47570","author":"russ_breault","post":"I think the most convincing are the two Justinian coins–first coins ever minted with an image of Jesus in 692. The Tremesis is amazing and the Solidus also quite convincing but the clincher for me is a the double line across the neck on both coins which corresponds exactly with a fold mark seen on the Shroud. One might dismiss face, hair or beard similarities but the fold mark is unique to the Shroud and very significant in my view..","date":"2013-10-15","mins":"11:22 am","url":"https://shroudstory.com/2013/10/15/three-examples-of-artistic-likeness/","cat":"art","title":"Three Examples of Artistic Likeness"},{"id":"comment-132086","author":"russ_breault","post":"Great post OK. I have long believed the HPG is the smoking gun that definitively links the Shroud to Constantinople. As I remind audiences, if the Shroud disappeared in 1204…that is already older than the oldest carbon date of 1260…and it didn’t just get there in 1204, it had been there for hundreds of years…most likely since 944..","date":"2014-06-21","mins":"10:02 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"}]
