[{"id":"comment-181345","author":"russ_breault","post":"Remember, Dr. Gilbert Lavoie did a lot of this blood experimentation back in the 1980’s and his results along with photos are published in his book, “Unlocking the Secrets of the Shroud.” Art Lind collaborated with Gil for the paper he presented..","date":"2015-01-04","mins":"5:19 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-121981","author":"russ_breault","post":"Yannick’s comment is right on the mark. Perhaps not everything Vignon identified can be considered unique to the Shroud image but there is a global pattern that allows everyone in the world, whether they believe or not, to see a picture of the Shroud face and know it is Jesus. Regarding comments as to which one came first…the Shroud or the icon, keep in mind that the earliest descriptions of the Mandylion/Image of Edessa are “The True Likeness” and “Not Made by Human Hands.” I think even in the 6th century, people were smart enough to know whether something was made with paint or not. Seeing that the Shroud conforms exactly with the “True Likeness” as depicted in various icon images and we know today from science that it is not the result of artistic substances, ie…”Not Made by Human Hands.” It is both logical and certain that the Shroud is in fact the original True Likeness discovered or perhaps rediscovered in 525..","date":"2014-05-20","mins":"8:36 am","url":"https://shroudstory.com/2014/05/20/the-vignon-markings-issue-a-promoted-comment/","cat":"art","title":"The Vignon Markings Issue:  A Promoted Comment"},{"id":"comment-122103","author":"russ_breault","post":"Most alleged relics were small pieces of bone, hair, clothing, etc. Nothing on the order of the Shroud. And most alleged relics were associated with various saints..","date":"2014-05-20","mins":"1:15 pm","url":"https://shroudstory.com/2014/05/20/the-vignon-markings-issue-a-promoted-comment/","cat":"art","title":"The Vignon Markings Issue:  A Promoted Comment"}]
