[{"id":"comment-8761","author":"russ_breault","post":"Nick, That is a wonderful testimony you have shared. Father Peter Rinaldi of the Holy Shroud Guild always said we need to lead people “through the linen to the Lord.” The Shroud may or may not be authentic but it certainly testifies to the historical events of the crucifixion and resurrection. It lines up perfectly with Scripture which makes it a perfect tool to explore what happened to Jesus as we also explore the mystery of the Shroud itself. The very fact that the Shroud remains a mystery is amazing itself. If it was an obvious work of art, we would have figured that out a long time ago. Kudos to your new found faith!.","date":"2012-02-26","mins":"5:04 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture"},{"id":"comment-8756","author":"russ_breault","post":"This is very good comprehensive summary of facts that might form a case for the Shroud’s authenticity. I guess it is a matter of style, but I prefer to leave the Shroud as a mystery, a fabulous mystery in the same league as the pyramids or Stonehenge…all of which remain unsolved at their core regarding who and how they were made…many theories but no definitive answer. As you lecture, make every effort to refrain from dogmatism. The Shroud could be authentic. Thats it, that is as far as we can take it. Who knows…maybe there is a medieval artist out there who predated Leonardo by at least 100 years, and we don’t know who he is, or how he did it. Not likely I grant you yet still a possibility. In fact if the Shroud was on trial we would have to look at two burdens of proof…”beyond a reasonable doubt” for a criminal trial and “preponderance of evidence” for a civil trial. Personally, I don’t think will ever get to “beyond a reasonable doubt.” Preponderance of evidence I would agree with…but that really only means there is better than a 50% chance of it being authentic. But that is ok. It is fun to explore the mystery, and as we do, we encounter the heart of the gospel. I love letting the audience decide. Is it possible? Did God preserve an image of himself for an age when we communicate more with images than we do with words? Is it silent witness to the one miracle that had no eyewitnesses? All these are tantalizing and wonderful things to ponder. But at the end of the day, it is up to each person to decide..","date":"2012-02-26","mins":"11:56 am","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture"},{"id":"comment-125006","author":"russ_breault","post":"Using the Shroud as a tool for Christian education is terrific idea. One young woman at a lecture commented that “the Shroud makes it real.” In the 21st century, as the Church struggles against pervasive secularism and a new and aggressive form of atheism, the Shroud stands as a witness for the core message of Christianity…the bulls eye of the faith. Some evangelicals assert that God would not use something like the Shroud. Why not? Jesus said, “If you have SEEN me, you have SEEN the father.” Paul describes Jesus as, “the image of the invisible God.” Certainly something dramatic changed between the OT where no one, not even Moses saw the face of God…to the NT where everyone beheld the glory of God in the face of Jesus. In Acts 1:3, it says, “After his suffering he showed many convincing proofs that he was alive.” Is it not possible that the Shroud is a “proof” for all generations? In the 21st century we communicate more images than we do with words. Perhaps the Shroud was preserved for this time in human history more than any other and has the same message as Scripture, “I am the way, the truth and the life…”.","date":"2014-05-27","mins":"7:47 am","url":"https://shroudstory.com/2014/05/27/the-shroud-as-a-sunday-school-tool/","cat":"news_&_views","title":"The Shroud as a Sunday School Tool"},{"id":"comment-8771","author":"russ_breault","post":"Paul, I think you are missing my point. The Shroud remans an unsolved mystery. In that same vein, so are Stonehenge and the Pyramids. As a lecturer and a presenter, I have been invited to some of the best universities in the country (Duke, Penn State, Cal State, and many others). I am totally focused on how to get the world at large to embrace the Shroud as a legitimate artifact to study and explore. And the only way (IMO) is by focusing on the mystery and losing the dogmatism. Once we become so oriented towards claiming and proving it to be authentic, we lose the very people we are trying to reach with the message of the Shroud. I am all for building a case for authenticity. However, carbon 14 will remain an issue until it is dated again. There remain many reasonable questions that do not yet have adequate answers. I am happy with the Shroud being a mystery. Who can argue with that? Whether it is authentic or not, it remains a mystery. That is what makes it fascinating. If we had all the answers, it wouldn’t be nearly as interesting. Again, if I didn’t make it clear, I am speaking to my approach in taking the Shroud outside the walls of the Church..","date":"2012-02-26","mins":"11:31 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture"},{"id":"comment-38709","author":"russ_breault","post":"I agree with you Dave. How someone can spin the finding of a plain weave cloth as proof against the Shroud is nonsense. It is clearly written in Scripture, “Joseph of Arimathea, A RICH MAN PURCHASED A FINE LINEN CLOTH”. The Scripture itself lets us know that the cloth was not plain and not ordinary. In fact, Joseph was a Pharisee, he had access to the temple and the temple store. The high priest was commanded in Deuteronomy before entering the Holy of Holies to perform the sacrifice, to take off his ordinary clothes and put on clothing made of “fine twisted linen” which represented the holiness of God. Seems likely that the Shroud was made of fine twisted linen (3:1 herringbone twill with a Z twist) and was purchased directly from the Temple. Joseph was sending us a message. He knew who Jesus was, and he IMO, purchased linen worthy of a high priest about to enter the Holy of Holies..","date":"2013-07-07","mins":"7:10 pm","url":"https://shroudstory.com/2013/07/07/nbc-news-on-the-archaeology-of-christianity/","cat":"history","title":"NBC News on the archaeology of Christianity"},{"id":"comment-142986","author":"russ_breault","post":"Here are the facts. Hitler visited Italy in 1938, two months after he invaded Austria and obtained the “Spear of Destiny”. One of the cities he visited was Turin. His henchmen began asking questions about the King’s Sacred Relic. After just stealing the Spear of Destiny from the Hoffburg Museum in Vienna, no wonder the King was concerned. Hitler invaded Poland on Sept 1, 1939. Within two weeks the Shroud was secretly removed from Turin and brought to Rome for 18 days and then moved to Montevergine about 150 miles south of Rome in the hills near Avellino. Why was the Shroud moved? Until 2010 it was thought to keep it safe from Allied bombs but Italy did not enter the war until June of 1940 after Hitler invaded France. So the real reason must have been to keep away from Hitler as new documents indicate. In April of 1943, the Nazis came looking for the Shroud in Turin only to find out it was moved to a secret location. At this time a press release was issued by the Vatican and carried by the NY Times that the Shroud had been moved to a safe location. This announcement no doubt came after the Nazis came looking for it. Did they find out where it was taken? In Sept of 1943, the Nazis stormed the monastery under cover of darkness claiming they were looking for Allied spies. The Abbot ordered all the monks to gather in the choir chapel where the Shroud had been secretly encased inside the Altar. None of the monks knew it was there. The Nazis searched room by room and when they came to the Choir Chapel and saw the monks gathered in prayer, one of the officers said, “Don’t bother the monks, let them pray.” And so the soldiers left not finding any spies nor the Shroud. Were they specifically looking for the Shroud? No one really knows. That is the story. In my presentation I document Hitler’s obsession with the occult, how he coveted the Spear of Longinus, how he and Himmler were both obsessed with finding the Holy Grail and also the Shroud. Unlike all the art works stolen as documented in the recent movie, Monuments Men, Hitler’s desire for religious artifacts stemmed from his belief they would give him supernatural power in his bid for world domination. One last thing, in his twisted mind he had convinced himself that Jesus was of an Arian bloodline and was not a Jew–hence his obsession with finding things related to Christ..","date":"2014-08-08","mins":"12:04 pm","url":"https://shroudstory.com/2014/08/08/from-shroud-encounter-the-day-the-shroud-foiled-hitler/","cat":"history","title":"Revised: The Day the Shroud Foiled Hitler"},{"id":"comment-30019","author":"russ_breault","post":"Looks interesting! How can we get the full article? Publication only allows you to see the abtract..","date":"2013-04-09","mins":"8:42 am","url":"https://shroudstory.com/2013/04/09/paper-chase-new-peer-reviewed-article/","cat":"history","title":"Paper Chase:  New Peer Reviewed Article"},{"id":"comment-19912","author":"russ_breault","post":"Thanks Dan, here is an example of what I might include. This comes from Dr. Gil Lavoie’s work. On the Shroud we see blood that appears to be in the hair. Its not in the hair. The blood was on the face. Since the image came later, the blood only appears to be in the hair when you pull the cloth flat. This is a powerful proof point that the cloth indeed wrapped a corpse. Now why the image is vertically collimated is anyone’s guess..","date":"2012-12-06","mins":"9:32 am","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","title":"Secrets of the Shroud:  What say you all?"},{"id":"comment-174476","author":"russ_breault","post":"If you want to watch and listen to Jack Markwardt, go to: http://www.shrouduniversity.com/stlouis14.php All the audio problems have been resolved. Jack has gave two papers..","date":"2014-12-03","mins":"10:58 am","url":"https://shroudstory.com/2014/12/03/the-shroud-of-turin-is-not-the-image-of-edessa/","cat":"history","title":"The Shroud of Turin is not the Image of Edessa?"},{"id":"comment-44992","author":"russ_breault","post":"Great point John. “As far as the Pray Codex is concerned, we have several points of comparison. It is clearly a shroud. Is there any other work of art or artifact that has more points of comparison to the Pray Codex than the Shroud. If so, I haven’t seen it. Has anyone?” In my opinion the HPM is the smoking gun that places the Shroud in Constantinople in 1204…which is 56 years older than the oldest carbon date. Doesn’t seem like much, but the Shroud didn’t just get there in 1204. It is most likely the same cloth that arrived in 944. The point is simple. The carbon date is wrong. How wrong? No one can say. Does it prove it to be first century? No. But it does prove the carbon date is wrong. So for anyone looking for the alleged medieval artist, stop looking in the 14th century..","date":"2013-09-21","mins":"2:04 pm","url":"https://shroudstory.com/2013/09/21/so-is-that-the-shroud-of-turin-depicted-in-the-hungarian-pray-codex/","cat":"history","title":"So is that the Shroud of Turin depicted in the Hungarian Pray Codex?"},{"id":"comment-55823","author":"russ_breault","post":"It is interesting and I like the comparison to Elijah’s mantle. Perhaps Paul asked for these things but there is no evidence that Timothy came through. Perhaps the Shroud remained in Turkey for some reason. I agree with Dave that Paul did not need the Shroud as some evidentiary proof of the resurrection. Paul frequently refers to the “power” that accompanied his preaching. This was not long after Pentecost and no doubt people getting healed or delivered was all the evidence they needed..","date":"2013-12-03","mins":"2:45 pm","url":"https://shroudstory.com/2013/12/03/translation-when-you-come-bring-the-shroud-of-turin/","cat":"history","title":"Translation: When you come, bring the Shroud of Turin"}]
