[{"id":"comment-127935","author":"russ_breault","post":"I think the person best able to address the 3 D attributes of the Shroud is Ray Downing, who is generally very skeptical of “shroud science”. I had dinner with him and his wife Maria at an event near Albany, NY about a month ago. In fact, the one compelling piece of data that would cause him to consider the Shroud’s possible authenticity is the apparent distance information that appears to be encoded into the image. The only reason he was able to extract a 3 D image from a flat surface without distortion is because the information or data is there…in other words…it must have wrapped a real human form for that to be possible..","date":"2014-06-09","mins":"6:16 am","url":"https://shroudstory.com/2014/06/08/speaking-of-3d/","cat":"3d","title":"Speaking of 3D"},{"id":"comment-211252","author":"russ_breault","post":"Yes, The Real Face of Jesus? is one of the best documentaries made (2 hours) and focuses on the work of 3 D animator Ray Downing using state of the art technology. I had dinner with him and his wife Maria a few years ago. Ray is not yet convinced the Shroud is authentic but he is totally convinced the Shroud contains unique data that allows for an accurate 3 D rendering of the image. There is no way he should be able to extract a 3 D image from a flat surface without distortion and yet that is precisely the case..","date":"2015-09-26","mins":"8:05 am","url":"https://shroudstory.com/2015/09/26/the-vp8-cinderella-question/","cat":"3d","title":"The VP8 Cinderella Question"},{"id":"comment-150925","author":"russ_breault","post":"Where the Maillard reaction breaks down for me, is I don’t see how gas would uniformly emit from a decaying body at the same intensity whether from the torso, orifices or from extremities. The uniform intensity of the image, top to bottom and front to back, is one of its most profound attributes. As Eric mentioned, Rogers knew that the Maillard reaction alone could not be responsible for the highly resolved image we see on the Shroud. IMHO, there is something else at work. What that may be is anyone’s guess..","date":"2014-09-14","mins":"8:45 am","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level"},{"id":"comment-210514","author":"russ_breault","post":"I had to download and save/print as a pdf..","date":"2015-09-16","mins":"6:30 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","title":"Faint Images:  The Case of the Shroud of Arquata"},{"id":"comment-32884","author":"russ_breault","post":"The whole argument that the Shroud looks “too perfect” is ridiculous. Notice how all the pictures of the Shroud they claim are “too perfect” are all in the photo negative. Funny how the alleged artist had no clue that such an image even existed but was discovered 600 years later. He would not have purposely created a negative image–and why bother? It is only revealed via photography. So this image described as “too perfect” was just an accidental bi product of the forger’s technique? That sounds a little too perfect for me..","date":"2013-05-04","mins":"9:03 am","url":"https://shroudstory.com/2013/05/04/a-mysterious-work-of-art/","cat":"image_theory","title":"A mysterious work of art?"},{"id":"comment-8467","author":"russ_breault","post":"This is not an adequate explanation either. He is suggesting that pressure somehow resulted in a greater concentration of darkened fibers such as the tip of the nose. Yet we already know that the image is NOT pressure sensitive since the image intensity is the same on the dorsal image which would have borne the full weight of the body…or in this instance, the alleged statue which was no doubt made out of metal to be an even conductor of heat. Can you imagine the weight of that thing? Have you picked up a bronze bust? Kim Dreisbach had several in his collection. They are heavy…I can’t imagine the weight of a full bronze body. I don’t think there is any doubt that heat would cause a pressure sensitive effect, even if placed on sand. The dorsal image would have a different density versus the frontal where the cloth was simply draped over the front of the supposed statue. Any experiment to relicate the shroud in this fashion must replicate the entire shroud otherwise it is irrelevant..","date":"2012-02-19","mins":"12:58 pm","url":"https://shroudstory.com/2012/02/19/i-dont-get-it-writes-a-reader-about-colin-berrys-hypothesis/","cat":"image_theory","title":"I don’t get it, writes a reader about Colin Berry’s Hypothesis"},{"id":"comment-172562","author":"russ_breault","post":"One more comment regarding Charles’ painting theory. He alleges that in earlier centuries…before the paint flaked off, the loin cloth was more pronounced, which is why it is featured in nearly all copies or replicas. However the Lier copy from 1516 barely shows any such loin cloth and the image is noticeably faint. The Exhibition Poster from 1663 also shows the image very faint versus the darker images we find on other copies. Regarding the loin cloth, if there was any attempt to copy with realism what was seen on the original Shroud, why do all the loin cloths vary so much? From 1579 it looks like a bath towel, others look like boxer shorts and yet others look like a stuffed diaper. There is no consistency whatsoever regarding the presumed loin cloth. Maybe that is because it never existed on the original and therefore invites artistic license!.","date":"2014-11-22","mins":"1:47 pm","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","title":"Image of the Resurrection?"},{"id":"comment-8473","author":"russ_breault","post":"Do you also assume that the blood was somehow applied prior to this alleged imprinting? All observations are that there is no image under the blood indicating it was applied first followed by the image. Also, we know now with certainty that the Shroud today is the same one stolen from Constantinople in 1204. Historical references would indicate the artist who crafted the Hungarian Pray Manuscript was an eye witness to that cloth sometime between 1160 to 1170. It had obviously been there for some time as well. Does your theory have any precedent in the Byzantine era? The western fascination with relics and all the consequent fakes largely started after the 4th Crusade..","date":"2012-02-19","mins":"3:28 pm","url":"https://shroudstory.com/2012/02/19/i-dont-get-it-writes-a-reader-about-colin-berrys-hypothesis/","cat":"image_theory","title":"I don’t get it, writes a reader about Colin Berry’s Hypothesis"},{"id":"comment-172546","author":"russ_breault","post":"Charles proposes that the Shroud was painted and the paint has now all flaked off. One of his proof points is that copies or replicas of the cloth all show a much darker image than we see now. Perhaps he is right. Or perhaps the image has grown more faint over time by natural means or perhaps there is a third option. I lecture extensively on the Shroud. When showing images of the Shroud, I often use the more contrast enhanced images from Enri–1931. He used monochromatic film which enhances lights and darks. Why would I do this? SO THE AUDIENCE CAN SEE THE IMAGE! Is it not likely that copies of the Shroud were made so people could see it? Think of how the replica would have been displayed, in a dark church with no electric lighting. Add to the problem of how one might paint something so faint in the first place. Why not paint it so everyone can see it…even from the back of the church? (As a note: Barrie’s pictures from 1978 are perfectly accurate in terms of color–but as a result the image is more faint. Post 2002 restoration images are even harder to see because of a brighter backing cloth which has somehow effected the contrast.).","date":"2014-11-22","mins":"11:55 am","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","title":"Image of the Resurrection?"},{"id":"comment-48554","author":"russ_breault","post":"What happened to Walter Mc Crone? I thought the esteemed chemist determined it was nothing more than iron oxide suspended in a thin binder to create a jewelers rouge? And of course the paint was nothing more than vermilion. Why would anyone give notice to other theories when the founder of the Mc Crone Institute has already issued his decree? Didn’t he debunk the Vinland Map? Why consider other theories? Just saying….","date":"2013-10-23","mins":"4:38 pm","url":"https://shroudstory.com/2013/10/23/is-the-shroud-of-turin-a-medieval-photograph/","cat":"image_theory","title":"Is the Shroud of Turin a Medieval Photograph?"},{"id":"comment-51489","author":"russ_breault","post":"Now we are back to the scorch hypothesis? Does anything ever die? I think Thibault Heimburger did a good job dealing with this issue. Https://shroudofturin.files.wordpress.com/2012/10/scorch paper en.pdf.","date":"2013-11-15","mins":"2:06 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-58484","author":"russ_breault","post":"I submitted this to Dan a few months ago. It is a little video called “The Mystery is the Message.” https://vimeo.com/71629598.","date":"2013-12-12","mins":"2:55 pm","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"},{"id":"comment-8581","author":"russ_breault","post":"Dan, this is a good summary of Roger’s theory. I believe that a maillard reaction may account for something. I remember early discussions of this when it was first proposed and many still wonder whether such reaction can account for the photo like quality of the face. It is very possible that more than one thing is responsible for the totality of the image. What still bothers me is the dorsal image. Gases tend to rise. One would think there would be a difference of image intensity between the dorsal and frontal images, yet that is not the case. I am in the maillard plus camp…maillard plus something else. Not sure what, but I can certainly speculate!.","date":"2012-02-21","mins":"10:19 am","url":"https://shroudstory.com/2012/02/21/of-the-crowns-of-fibers-and-the-shroud-of-turin-image/","cat":"image_theory","title":"Of the crowns of fibers and the Shroud of Turin image"},{"id":"comment-49711","author":"russ_breault","post":"Would love to get Ray Downing to comment on this. He is the 3 D animator who developed “The Real Face of Jesus” for History Channel. In a conversation with him, he assured me that he was able to extract a 3 D image from a 2 D surface because the data is there to allow for it..","date":"2013-11-03","mins":"8:40 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","title":"Maybe the 3D data doesn’t mean what we think it does"},{"id":"comment-9277","author":"russ_breault","post":"Thanks for the onion skin comparison, that the skin of an onion is 1000x thicker than image layer on the Shroud. Great word picture. It is hard to articulate to an audience. One I have been using is as follows: Each thread is composed of about 200 microfibers. The image penetrates only the top two AND only effects the top of the fibers. Therefore the image penetrates less than 1% of a single thread. The impurity layer can best be described as being similar to a soapy film..","date":"2012-03-13","mins":"10:51 am","url":"https://shroudstory.com/2012/03/13/revisiting-rogers-evaporation-concentrations-for-scorching-an-image/","cat":"image_theory","title":"Revisiting Rogers’ evaporation concentrations for scorching an image."},{"id":"comment-8919","author":"russ_breault","post":"I agree, this is a great read and a great summary of why the “hot statue” theory is untenable. Funny how all the proponents of such a theory never bother to actually recreate the Shroud thereby proving their hypothesis. Rather their meager attempts have thus far have falsified it according to the basic rules of the scientific method..","date":"2012-03-04","mins":"10:45 am","url":"https://shroudstory.com/2012/03/04/stephen-jones-has-an-important-posting-on-heated-bas-relief-images/","cat":"image_theory","title":"Stephen Jones has an important posting on heated bas relief images"},{"id":"comment-155035","author":"russ_breault","post":"Mc Crone’s copy created by his artist friend was examined by others including Dr. Gilbert Lavoie who debated Mc Crone on Chicago radio. Following Mc Crone’s instructions, the image soaked all the way through the cloth and was visible on the other side, STURP has already determined there is no evidence of capillary action. No liquids were applied to create the image..","date":"2014-09-24","mins":"10:03 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-8928","author":"russ_breault","post":"Colin, your comparison to Piltdown man is exceedingly weak. How does part of a skull and a jawbone fraudulently hyped as the missing link in any way compare with the Shroud? All the detractors of the Shroud allege that it was the work of an artist in some way shape or form. If that is the case, then certainly the process or technique used by the alleged artist should be able to be replicated. Its that simple. So far Mc Crone, Nickell, Allen and others have all been proven wrong. None of them to date, including you have made a credible copy using some alleged medieval technique. It is a reasonable request. If it is the work of an artist, it shouldn’t be that hard to prove..","date":"2012-03-04","mins":"3:35 pm","url":"https://shroudstory.com/2012/03/04/stephen-jones-has-an-important-posting-on-heated-bas-relief-images/","cat":"image_theory","title":"Stephen Jones has an important posting on heated bas relief images"},{"id":"comment-111738","author":"russ_breault","post":"I recall trading messages with Rogers on the SSG. Dan is correct. Although Rogers was looking for a natural explanation for the image, he acknowledged that the lack of decomposition stains supported the biblical claim of resurrection. He wasn’t trying to deny that a miracle occurred, only that the image itself was not miraculous. While I personally don’t agree with the logic of his argument, that is where he was coming from..","date":"2014-05-05","mins":"8:33 am","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","title":"To Yannick on Science and Philosophy"},{"id":"comment-42870","author":"russ_breault","post":"Excellent summary and analysis. I will confess to being guilty as charged as one who holds to a “magical” explanation. One of the reasons is that Rogers himself wasn’t convinced that the maillard reaction alone could explain the high resolution image we see especially of the face and hands. Second, it is hard to imagine that gas emitting from a decaying body could produce an image of identical intensity top to bottom and front to back. Others who have experimented or explored this theory have also indicated that such emission of gases would be more pronounced around bodily orifices but this is not the case. Rogers did not support any supernatural cause of the image yet he acknowledged that the lack of decomposition stains on the cloth supported the resurrection hypothesis. Unless we assume that the body was stolen and the cloth left behind…or that Jesus woke up found Mary Magdalene and headed for the coast of France, then somehow and in some way the body literally disappeared. There are too many verses of scripture that suggest light was involved. So while current experiments with lasers don’t explain everything neither does gas emitting from a decaying body. Perhaps the answer is not an all or none approach but a combination of causes..","date":"2013-09-04","mins":"7:22 am","url":"https://shroudstory.com/2013/09/04/thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","title":"Thoughts on the newly published paper by Ray Rogers (REVISED)"},{"id":"comment-112284","author":"russ_breault","post":"I do not accept the Maillard theory primarily because it is based on gaseous emissions (of ammonia that somehow interacted with a carbohydrate layer.) One of the key attributes of the Shroud image is the intensity of the image is uniform top to bottom and front to back. No difference in image intensity. To think that gaseous emissions could have created such a uniform image is beyond reason. Gas does not escape a decaying corpse in any uniform manner. Thicker parts of the torso would exhibit more decay and therefore more gas emissions. Natural orifices in the body would offer the path of least resistance and should also show more gas emissions. This is not seen on the Shroud. Vignon proposed gas and was dismissed early in Shroud research. Why this is any different is beyond me. Rogers has made important contributions, this is not one of them IMHO..","date":"2014-05-05","mins":"8:52 pm","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","title":"To Yannick on Science and Philosophy"},{"id":"comment-42170","author":"russ_breault","post":"Part of exploring the Shroud is looking at the clues. Some of those clues come from science, others from history. If the Shroud is authentic then there must be clues in the bible as well..","date":"2013-08-27","mins":"8:27 pm","url":"https://shroudstory.com/2013/08/27/when-is-a-scorch-not-a-scorch/","cat":"image_theory","title":"When is a Scorch NOT a Scorch?"}]
