[{"id":"comment-213507","author":"russ_breault","post":"Add this to the arsenal as well, from Hebrews 2:3 4 “This salvation, which was first announced by the Lord, was confirmed to us by those who heard him. God also testified to it by signs, wonders and various miracles, and by gifts of the Holy Spirit distributed according to his will.”.","date":"2015-10-24","mins":"12:42 pm","url":"https://shroudstory.com/2015/10/24/and-now-you-have-something-to-do-this-weekend/","cat":"other_blogs","title":"And now you have something to do this weekend"},{"id":"comment-180552","author":"russ_breault","post":"I find it both strange and ironic that people who believe God exists at the same time assert we can find no evidence of His existence. I will never understand this point of view. Apply Occum’s Razor to the subject of creation and the answer is quite obvious. If it walks like a duck… But not when it comes to the debate over origins. Apparently common sense has no place in this debate. Any time an evolutionist mentions “design” it must always be preceded with the adjective “apparent” because it is not actual design but only apparent. Try applying this logic to anything else in life and you would be a candidate for psychiatric care. The earliest symbol of the Christian faith is the fish because Jesus said “follow me and I will make you fishers of men.” I have determined that the fish in question is a COD. It stands for Complexity, Order and Design. All of life demonstrates these three primary attributes. I will never believe that randomness and chance (even with adding natural selection and time to the equation) can ever produce living structures characterized by COD. This is achieved through plan and purpose which can only be derived from intelligence..","date":"2015-01-01","mins":"10:05 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-167162","author":"russ_breault","post":"It is not a huge revelation that we all filter information according to our world view, our preconceived ideas and opinions. It is standard psychology that information that conflicts with our world view creates cognitive dissonance and must either be rejected (most likely) or accepted and integrated (less likely). For those who hold strong opinions, conflicting information must be very persuasive to effect a change in that opinion. We cannot tolerate being in a state of confusion so we form opinions that integrates information in accordance with our world view and rejects everything else. The white lab coat of pure objectivity is an illusion. Everyone has a bias and no one has all the information available on a given topic. This is exactly why the legal system of prosecutor and defense with 12 jurors is so important. Not only will both lawyers present radically different views of the facts it is now up to 12 individuals to come to a reasoned consensus. Each juror heard something different from the testimony of witnesses and evidence presented by both sides. It is the closest we will ever get to the truth–and even then they get it wrong from time to time. I have often said that when it comes to the Shroud, we cannot get to a verdict that is “beyond a reasonable doubt” as in a criminal trial. However, I believe the “preponderance of evidence” will support authenticity. But then again, thats my opinion based on my world view!.","date":"2014-10-31","mins":"6:04 am","url":"https://shroudstory.com/2014/10/31/how-knowledge-is-created-the-shroud-of-turin/","cat":"other_blogs","title":"How Knowledge is Created:  The Shroud of Turin"},{"id":"comment-167363","author":"russ_breault","post":"Exactly!.","date":"2014-10-31","mins":"3:59 pm","url":"https://shroudstory.com/2014/10/31/how-knowledge-is-created-the-shroud-of-turin/","cat":"other_blogs","title":"How Knowledge is Created:  The Shroud of Turin"},{"id":"comment-213411","author":"russ_breault","post":"She can be forgiven for linking Mc Crone to the C 14 tests, he did call for the tests to be done. But as an art critic, the most important part of the article is the last half. She skillfully counters Mc Crone’s attribution of two paintings now in Florida, one to Da Vinci and the other to Raphael. She challenges his assessment based on her intricate knowledge of both artist’s style and technique. She is not the only one to question Mc Crone’s judgement in the realm of art. This is important because in the world of chemistry he carries high credentials yet where he inserted himself into art authentication, many seriously question his methodology and expertise. This article is just one example..","date":"2015-10-23","mins":"5:54 am","url":"https://shroudstory.com/2015/10/23/proof-that-art-experts-are-not-always-right/","cat":"other_blogs","title":"Proof that art experts are not always right"},{"id":"comment-205235","author":"russ_breault","post":"Hey Dan, glad to see the Shroud made it to the top of his list of relics!.","date":"2015-07-11","mins":"7:07 am","url":"https://shroudstory.com/2015/07/11/ignorance-with-wings/","cat":"other_blogs","title":"Ignorance with Wings"},{"id":"comment-8709","author":"russ_breault","post":"Well said Dan–both post and comment!.","date":"2012-02-25","mins":"10:45 am","url":"https://shroudstory.com/2012/02/25/the-coloration-is-a-caramel-like-product-or-the-product-of-an-aminocarbonyl-reaction/","cat":"other_blogs","title":"The coloration is a caramel-like product or the product of an amino/carbonyl reaction"}]
