[{"id":"comment-200421","author":"russ_breault","post":"The old saying is that if you repeat a lie often enough people will believe it. I find it strange that all of the forensic pathologists who have studied the Shroud say the man was dead. I guess their testimony doesn’t mean anything..","date":"2015-05-28","mins":"7:39 am","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"id":"comment-168693","author":"russ_breault","post":"A few years ago I did a presentation for the American Chemical society called “The Battle of the Chemists.” In it I compared Mc Crone’s findings and his methodology with the findings of Dr’s Alan Adler and John Heller using the same instruments (SEM) but with a different and more thorough methodology and consequently found something quite different. Now it appears we have the battle of the historians. Enter Thomas de Wesselow, Postdoctoral Research Associate at Cambridge University, studied art history at Edinburgh University and was a research scholar at the British School in Rome—seems to have all the academic credentials one would need to have a legitimate dog in the fight. Here is the take away quote from his book, The Sign (2012): “Accepting the carbon date (as true), art historians should have leaped on the Shroud as on of the most fascinating visual creations of the medieval period, a true masterpiece of devotional imagery. Strangely though, they have remained almost entirely silent. The reason is simple: the negative photo of the cloth is an unmistakable sign that the Shroud’s famous image could not have been created by a medieval artist. Technically, conceptually and stylistically the Shroud makes no sense as a medieval artwork. The field of art history has had over a century to study the Shroud since it was first photographed. And in all that time no art historian has ever ventured to attribute it to a medieval artist.” End quote. So I guess kudos are in order for Charles Freeman in that he has gone where no art historian has yet to venture–however he has yet to address de Wesselow’s key assertion that “technically, conceptually, and stylistically the Shroud makes no sense as a medieval artwork.” As a personal comment, It does seem rather bizarre that the Shroud is a perfect negative which means the reverse positive image we see through photography would have been a complete accident–totally unknown to the alleged artist who crafted the image. That seems to stretch credulity to the breaking point..","date":"2014-11-04","mins":"3:47 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-101672","author":"russ_breault","post":"The extreme superficiality of the image, effecting only the top one or two micro fibers implies that, by way of explanation, that if someone shaved the surface of the cloth the image would disappear..","date":"2014-04-20","mins":"11:24 am","url":"https://shroudstory.com/2014/04/20/myra-adams-the-larger-question-for-easter-sunday-is-how-did-the-shroud-survive/","cat":"press_coverage","title":"Myra Adams:  The larger question for Easter Sunday is how did the Shroud survive"},{"id":"comment-192993","author":"russ_breault","post":"Rick, I almost always tell people that I am 90% certain it is authentic, I will always give 10% to the possibility that it is the work of some medieval artist who predated Leonardo by several hundred years, we don’t know who he is, we don’t know how he did it, and he never did anything else of any significance. I guess that is possible but not very likely in my opinion. As far as whether Jesus left something behind, he surely did. In fact it was the “linen cloth lying there” that was the first piece of evidence that Jesus rose from the dead. The only question is whether the Shroud of Turin is the same cloth..","date":"2015-03-09","mins":"5:46 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"id":"comment-209945","author":"russ_breault","post":"I read “The Untold Story of the Holy Shroud” by Carlos Evaristo and was impressed by how much support the history of the cloth while in possession of the Savoy’s gave credence to the reweave theory..","date":"2015-09-09","mins":"5:54 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"},{"id":"comment-193055","author":"russ_breault","post":"My whole mission for the past 35 years is finding and using the middle path. I fully recognize there are gaps in the data. C 14 is not a settled issue one way or the other. That said, do we just sit on our hands until we have absolute proof? I will be in heaven with the angels before that happens. The middle path is this: Can we use the Shroud for its phenomenal witness for Christ even though we don’t have absolute proof of authenticity? And the answer is a resounding YES as long as we recognize the message is what matters. Either the Shroud is the authentic burial cloth of Christ or it represents the biblical truths upon which it is based. I always say, “Explore the Mystery–Encounter the Message”. The message remains the same regardless of authenticity. Do I think it is authentic? Yes. Do I hope it is authentic? Yes. Can I prove it absolutely? No. Can I still use it effectively as a unique way of telling the “Greatest story ever told”? Absolutely! The enduring mystery of the Shroud is what makes it so compelling. “It is the glory of God to conceal things, but the glory of kings is to search things out.” Proverbs 25:2 ESV.","date":"2015-03-10","mins":"10:48 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"id":"comment-29215","author":"russ_breault","post":"The sad truth is that the media will rarely pick up a positive story about Christianity outside of Holy Week or Christmas. These are the two times they are actually looking for stories with a Christian theme. Otherwise its back to business bashing the Church and any kook who claims to be believe. The fact that Fanti chose to publish in a book first doesn’t surprise me. It allowed him to control when and what was released to the media and it worked. The story was picked up all over the world. One never knows IF a paper will be accepted or WHEN they will publish AND it is surely frowned upon to submit to more than one journal at a time so the process leaves the author completely powerless. Fanti controlled the situation and I don’t blame him. I agree with others that he now needs to publish in English and hopefully to a respectable journal…but if it is turned down…so what…his book is published and the media ran with it. It ended up being a trifecta for the Shroud with the Pope’s exhibition, Shroud 2.0 AP and Fanti’s book..","date":"2013-04-03","mins":"10:33 am","url":"https://shroudstory.com/2013/04/03/giulio-fanti-tie/","cat":"books","title":"Giulio Fanti’ Tie"},{"id":"comment-82938","author":"russ_breault","post":"The morning of the resurrection, Jesus said to Mary, “Why do you seek the living among the dead?” In similar fashion, one might ask, “Why do you look for a naturalistic explanation when clearly the event in question is beyond anything natural?” The only “natural” explanation would involve the bloodstains being in contact with a corpse. There is no such explanation for the image. The only natural explanation for the image would be that it is the result of some medieval artistic process. If this shroud did indeed wrap the body of Jesus, it is pointless to invoke ball lightning, or neutron radiation from an earthquake or anything else, because none of these theories deal with the fact that the body disappeared. Any theory that assumes this cloth belonged to Jesus must account for the missing body..","date":"2014-02-27","mins":"1:39 am","url":"https://shroudstory.com/2014/02/26/giulio-fantis-book-launched/","cat":"books","title":"Giulio Fanti’s Book Launched"},{"id":"comment-189096","author":"russ_breault","post":"Glad it is getting good press. I am surprised they used the title of an earlier book on the Shroud by the same title in 1974 by Thomas Humber. It was republished in 1978 as Sacred Shroud. It should actually be called the First Gospel!.","date":"2015-02-04","mins":"10:47 am","url":"https://shroudstory.com/2015/02/04/a-most-anticipated-book-of-spring-2015-about-the-shroud-of-turin/","cat":"books","title":"A Most Anticipated Book of Spring 2015:  About the Shroud of Turin"},{"id":"comment-30762","author":"russ_breault","post":"Regarding Father Peter Rinaldi, he would always say that you can’t leave people at the Shroud, but that you need to lead them “from the linen to the Lord.”. He never wanted people to base their faith on the Shroud but that it simply yet prodoundly points the way..","date":"2013-04-14","mins":"10:55 am","url":"https://shroudstory.com/2013/04/13/john-klotz-unpacks-details-about-the-1988-debacle/","cat":"books","title":"John Klotz unpacks details about the 1988 debacle"},{"id":"comment-83182","author":"russ_breault","post":"If the Shroud of Turin belonged to Jesus, then it was subjected to a resurrection event. Science needs to figure out how a 180 pound man converted to light in less than a second and didn’t level Jerusalem in the process! IMHO..","date":"2014-02-27","mins":"5:58 pm","url":"https://shroudstory.com/2014/02/26/giulio-fantis-book-launched/","cat":"books","title":"Giulio Fanti’s Book Launched"},{"id":"comment-208610","author":"russ_breault","post":"Simon Brown is very pro Shroud and a strong evangelical at the same time. His view is that the Shroud should be used or promoted in the context of world evangelism. He tends to overstate things but I admire his zeal..","date":"2015-08-20","mins":"8:06 am","url":"https://shroudstory.com/2015/08/20/new-book-on-the-shroud-of-turin-2/","cat":"books","title":"New Book on the Shroud of Turin"},{"id":"comment-185806","author":"russ_breault","post":"Papers may be corrected but not videos. I have no plans to take it down. I can add a correction if need be to the metadata that describes the video..","date":"2015-01-23","mins":"5:52 pm","url":"https://shroudstory.com/2015/01/23/should-a-st-louis-conference-paper-be-withdrawn/","cat":"paper_chase","title":"Should a St. Louis Conference Paper be Withdrawn?"},{"id":"comment-168412","author":"russ_breault","post":"So someone depicts Christ with more scourge marks than the artistic norm at the time and that’s proof the Shroud is an Easter prop? All the paint just happened to flake off? I might add that none of these images show any anatomical realism–they just show the body scourged more than usual. How these images from the Holkham bible are used as a reference point seems a little obtuse..","date":"2014-11-03","mins":"7:59 pm","url":"https://shroudstory.com/2014/11/03/the-holkham-bible-recently-much-mentioned/","cat":"books","title":"The Holkham Bible Recently Much Mentioned"},{"id":"comment-182196","author":"russ_breault","post":"Charles, if the gesso you mentioned was applied to the cloth ahead of time as a preparation to receive the paint pigments, why does the blood soak all the way through? Wouldn’t the same gesso have kept the blood on the surface as well? Blood is no more liquefied than paint. Then of course, if it is not blood at all but only vermilion as Mc Crone alleged, then again, why did it soak through yet paint forming the body image remained only on the surface? You can allege that that the supposed artist in question applied gesso after the blood, however I would find this to be a tortured hypothesis indeed. Knowing where the blood was supposed to go prior to the application of the image would be nearly impossible and clearly unnecessary for it to function as an Easter prop as you have postulated..","date":"2015-01-09","mins":"12:49 pm","url":"https://shroudstory.com/2015/01/08/an-early-morning-google-find/","cat":"video","title":"An Early Morning Google Find"},{"id":"comment-182266","author":"russ_breault","post":"Why does this sound like nothing that can be related to the Shroud? Gesso? I guess not! “Gesso”, also known “glue gesso” or “Italian gesso”[2] is a traditional mix of an animal glue binder (usually rabbit skin glue), chalk, and white pigment, used to coat rigid surfaces such as wooden painting panels as an absorbent primer coat substrate for painting. The colour of gesso was usually white or off white. Its absorbency makes it work with all painting media, including water based media, different types of tempera, and oil paint. It is also used as a base on three dimensional surfaces for the application of paint or gold leaf.[3] Mixing and applying it is an art form in itself since it is usually applied in 10 or more extremely thin layers. It is a permanent and brilliant white substrate used on wood, masonite and other surfaces. The standard hide glue mixture is rather brittle and susceptible to cracking, thus making it suitable for rigid surfaces only. For priming flexible canvas, an emulsion of gesso and linseed oil, also called “half chalk ground”, is used.[4] In geology, the Italian “gesso” corresponds to the English “gypsum”, as it is a calcium sulfate mineral (Ca SO4·2 H2 O). Funny how no binder was found on the Shroud, no evidence of animal protein, and it is certainly not a rigid surface. The notion that gesso was used to treat the Shroud seems far fetched at best. IMHO.","date":"2015-01-09","mins":"11:44 pm","url":"https://shroudstory.com/2015/01/08/an-early-morning-google-find/","cat":"video","title":"An Early Morning Google Find"},{"id":"comment-174676","author":"russ_breault","post":"Thanks Mike and David. It is my happy contribution. Barrie does Shroud.com–the world’s primary archive and research site, Dan does the daily blog and I try to do streaming media. Seems like a good balance of labor and resources..","date":"2014-12-04","mins":"7:20 pm","url":"https://shroudstory.com/2014/12/03/revised-st-louis-conference-videos/","cat":"other_sites","title":"Revised St. Louis Conference Videos"},{"id":"comment-77518","author":"russ_breault","post":"David, the evidence for the image appearing faintly on the other side of the cloth is not well accepted. It is very hard to discern, if at all. And as Dan always points out, our mind is prone to play tricks on us causing us to “see” what is really not there. However, if the image on the reverse side is really there, it is not because any substance soaked through to the other side as with the blood and water stains. In fact it would lend support to Jackson’s collapse theory..","date":"2014-02-08","mins":"1:52 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-189572","author":"russ_breault","post":"They interviewed me for the Shroud segment but I have no idea how this is going to come out. The best we can hope for is something balanced..","date":"2015-02-06","mins":"12:35 am","url":"https://shroudstory.com/2015/02/05/set-your-dvr-an-unprecedented-cnn-event-on-march-1/","cat":"video","title":"Set Your DVR:  An Unprecedented CNN Event on March 1"},{"id":"comment-39159","author":"russ_breault","post":"All the deep things of God are all mysteries. Who can really understand the incarnation–much less the resurrection? How does someone calm a storm with a command? How does someone feed five thousand with a boy’s lunch? All of these are mysteries beyond our human understanding. If the Shroud was an obvious work of art–we would have figured that out years ago. So it stands to reason that the Shroud, if authentic, would defy explanation despite thousands of hours of scientific analysis. In my view, one of the strongest arguments for the Shroud’s authenticity is that it remains a mystery..","date":"2013-07-17","mins":"10:02 pm","url":"https://shroudstory.com/2013/07/16/the-investigator-new-film-about-the-death-and-resurrection-of-christ/","cat":"movie","title":"The Investigator:  New Film About the Death and Resurrection of Christ"},{"id":"comment-77753","author":"russ_breault","post":"My rudimentary understanding of Gnosticism was that they rejected the belief that Jesus came in the flesh because they considered the physical world to be evil. That would have made Jesus evil too. Consequently they believe that he only came in spirit thus denying the incarnation. It seems that John wrote the book of First John to expressly confront some of these early Gnostic views. So why in the world would a Gnostic artist create a burial shroud with the image of a crucified man when that only seems to confirm that Jesus did indeed come in the flesh. I further believe that early iconographic representations of Jesus whether independent or based on the Shroud itself such as the Sinai Icon, were meant to be clear statements that Jesus did indeed come in the flesh…and here is a picture..","date":"2014-02-09","mins":"9:42 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-181032","author":"russ_breault","post":"I guess the question is whether the Italian professor is Fanti or Garlaschelli..","date":"2015-01-03","mins":"10:08 am","url":"https://shroudstory.com/2015/01/03/television-an-italian-professor-believes-he-has-the-answer/","cat":"video","title":"Television:  An Italian Professor believes he has the answer."},{"id":"comment-153329","author":"russ_breault","post":"Dave, I agree with you. Unfortunately I could not see the slides. I told them which ones to use but they messed up the order so what I was describing was not what was being shown. Too bad. Very disappointing..","date":"2014-09-21","mins":"7:34 pm","url":"https://shroudstory.com/2014/09/20/time-out-productions-presents-russ-breault/","cat":"video","title":"Time Out Productions presents Russ Breault"}]
