[{"id":"comment-214411","author":"chuck_hampton","post":"All “natural” models have failed. Every model has failed except Jackson’s. If it were “normal/natural” we would have at least one other example. Let’s not kid ourselves. We are talking about Jesus, not washington or pliny or even Moses. Accept it. The Image is one if a kind so far. The bloodstains even testify..","date":"2015-11-08","mins":"6:13 pm","url":"https://shroudstory.com/2015/11/07/a-guest-posting-by-o-k/","cat":"guest_posting","title":"A Guest Posting by O.K."},{"id":"comment-213503","author":"chuck_hampton","post":"Thanks again Joe!! What? Jesus didn’t perform spectacular signs? The Shroud (the sign of Jonah) is the sign He promised a wicked and adulterous generation. The current generation qualifies. And the Burial Cloth of Jesus is far more spectacular than walking on water, raising Lazarus, or feeding 5000 with a sack lunch..","date":"2015-10-24","mins":"11:08 am","url":"https://shroudstory.com/2015/10/24/and-now-you-have-something-to-do-this-weekend/","cat":"other_blogs","title":"And now you have something to do this weekend"},{"id":"comment-208203","author":"chuck_hampton","post":"The Lord Himself still authenticates His burial cloth. Truth (or even a ridiculous probability of what’s true) is certainly not dependent on anyone’s opinion. The Pope agrees I might assume. He may also agree that it is beginning to finally having its full intended effect, thanks to people like Joe Marino and John Jackson and so many other amazing shroudies around the Earth. “This Gospel of the Kingdom must be preached to all kingdoms.” Imperative. Go!!.","date":"2015-08-13","mins":"8:27 pm","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"id":"comment-213930","author":"chuck_hampton","post":"Nicodemus did not supply anything but myrrh and aloes; not linen. John 19:39 NASB Nicodemus, who had first come to Him by night, also came, bringing a mixture of myrrh and aloes, about a hundred pounds weight. Jn 19.","date":"2015-10-30","mins":"11:58 am","url":"https://shroudstory.com/2015/10/29/ye-denizens-of-shroudsponge/","cat":"other_blogs","title":"Ye Denizens of Shroudsponge"}]
