[{"id":"comment-196753","author":"chuck_hampton","post":"My understanding was that there was a very faint image of the face on the reverse. Has anyone else heard of this and if so why was it not mentioned in the interview above I wonder? Chuck Hampton – Dallas, TX.","date":"2015-04-18","mins":"5:07 pm","url":"https://shroudstory.com/2015/04/17/in-the-interest-of-scientific-openness/","cat":"press_coverage","title":"In the Interest of Scientific Openness"},{"id":"comment-212690","author":"chuck_hampton","post":"Thank you Dan for your indispensible levity. The Burial Cloth of JESUS seems to upset folks just like His Name does. Curious..","date":"2015-10-16","mins":"2:09 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-213402","author":"chuck_hampton","post":"All I know is that Mark has surprised every time. This will make you think about this conundrum again. Image formation is really the crux and Mark Antonacci has brought this to our attention alla Dr John Jackson for the public to evaluate all over again. As technology advances the secrets become apparent and exposed. A new physics/ force. It’s a recording of the suffering, death, burial and Resurrection of The Son if God, the Gospel. Let’s spread the news!!! Time is short.","date":"2015-10-23","mins":"2:36 am","url":"https://shroudstory.com/2015/10/22/new-book-by-mark-antonacci-is-available/","cat":"books","title":"New Book by Mark Antonacci is Available"},{"id":"comment-214071","author":"chuck_hampton","post":"Mark means “proof beyond any reasonable doubt” in the legal sense, not 100% scientific proof (not sure that even exists) or like proving a math theorem. Mark’s a lawyer. As far as the historicity of His Bodily Resurrection is concerned; that kind of proof has been long established, without the Cloth. Mark is using the Shroud as exhibit A in this sort of line of evidence concerning this event. History matches the observations. Occam’s razor. Just like any jury member, you decide the best answer to ALL of the evidence. Unbiased. Jackson himself would agree that the probability Jesus’ Resurrection being in some way responsible for the data is a very high probability..","date":"2015-11-01","mins":"10:38 pm","url":"https://shroudstory.com/2015/10/31/proof-of-the-resurrection/","cat":"books","title":"Proof of the Resurrection?"},{"id":"comment-214366","author":"chuck_hampton","post":"The coin(s) are an important data treasure concerning the nature of the image formation process, the energy responsible. The energy passed through the coins, interacting with those atoms enough to leave an image with surprising resolution on a linen cloth. WOW!.","date":"2015-11-07","mins":"8:00 pm","url":"https://shroudstory.com/2015/11/06/now-you-can-read-it-online/","cat":"paper_chase","title":"Now you can read it online"},{"id":"comment-214367","author":"chuck_hampton","post":"Dr Haas (SMU) said to me back in 1990 that many ion ratios could be examined the next time a REAL sample(s) is made available. The clues to the nature of the event are just waiting to be discovered..","date":"2015-11-07","mins":"8:06 pm","url":"https://shroudstory.com/2015/11/06/now-you-can-read-it-online/","cat":"paper_chase","title":"Now you can read it online"},{"id":"comment-214368","author":"chuck_hampton","post":"I meant isotope, not ion..","date":"2015-11-07","mins":"8:07 pm","url":"https://shroudstory.com/2015/11/06/now-you-can-read-it-online/","cat":"paper_chase","title":"Now you can read it online"},{"id":"comment-214550","author":"chuck_hampton","post":"Even when I “try” to see these with a larger than life 2nd generation negative from Enrie’s 1931 photo of the face and chest – nothing. The coin over the right eye is the only other image detected by my eyes. Red herring?.","date":"2015-11-12","mins":"7:43 pm","url":"https://shroudstory.com/2015/11/11/psychological-influences-in-seeing-inscriptions-on-the-shroud-of-turin/","cat":"paper_chase","title":"Psychological Influences in Seeing Inscriptions on the Shroud of Turin"}]
