[{"title":"NBC News on the archaeology of Christianity","post":"“In support of the skeptics, a second burial shroud that dates to the time of Jesus is of a completely different style than the Turin shroud.”\nIn our modern society, we sometimes have oak coffins, walnut, pine and even cardboard, and even urns with ashes! I’m not sure if they bury Maori royalty in totara or matai! What’s an archaeologist of the future to conclude? One cardboard coffin doesn’t invalidate walnut! One 1st century Judaic plain Shroud doesn’t invalidate an expensive linen Shroud from the same culture! Not until the 2nd century did it become fashionable for plain weave shrouds, after Gamaliel II set an example for others to follow. NBC struggling to strike a “balanced” news item!!??\n\n","date":"July 7, 2013 at 7:08 am","url":"https://shroudstory.com/2013/07/07/nbc-news-on-the-archaeology-of-christianity/","cat":"history","id":"comment-38691","author":"daveb of wellington nz","site":"shroudstory"},{"title":"NBC News on the archaeology of Christianity","post":"off topic, but I’m interested in challenging the so-called conventional wisdom about the “wrist wound”. According to my measurements on Shroud scope, the placement of the wound would sit pretty much in the middle of the back of my hand, if I measure back from the finger tips, some 4-5cms above the wrist. So what is the basis for it being on the wrist?\nNow this doesn’t mean authenticity is dispelled, of course.\nAlso, according to my measurement, the fingers on the Shroud man are NOT super long either, in fact they are very similar to my own\n\n","date":"July 7, 2013 at 7:40 am","url":"https://shroudstory.com/2013/07/07/nbc-news-on-the-archaeology-of-christianity/","cat":"history","id":"comment-38692","author":"Matthias","site":"shroudstory"},{"title":"NBC News on the archaeology of Christianity","post":"That is a fairly good, short synopsis.  I like the wording referring to skeptics “in support” since the fact it is a different style cloth has no bearing on the issue, as Dave points out.  I think, Dave, it really shows a lack of objectivity on the side of the skeptic with that wording.\n\n","date":"July 7, 2013 at 9:52 am","url":"https://shroudstory.com/2013/07/07/nbc-news-on-the-archaeology-of-christianity/","cat":"history","id":"comment-38695","author":"Andy Weiss","site":"shroudstory"},{"title":"NBC News on the archaeology of Christianity","post":"I agree with you Dave.  How someone can spin the finding of a plain weave cloth as proof against the Shroud is nonsense.  It is clearly written in Scripture, “Joseph of Arimathea, A RICH MAN PURCHASED A FINE LINEN CLOTH”.  The Scripture itself lets us know that the cloth was not plain and not ordinary.  In fact, Joseph was a Pharisee, he had access to the temple and the temple store.  The high priest was commanded in Deuteronomy before entering the Holy of Holies to perform the sacrifice, to take off his ordinary clothes and put on clothing made of “fine twisted linen” which represented the holiness of God.  Seems likely that the Shroud was made of fine twisted linen (3:1 herringbone twill with a Z twist) and was purchased directly from the Temple.  Joseph was sending us a message.  He knew who Jesus was, and he IMO, purchased linen worthy of a high priest about to enter the Holy of Holies.\n\n","date":"July 7, 2013 at 7:10 pm","url":"https://shroudstory.com/2013/07/07/nbc-news-on-the-archaeology-of-christianity/","cat":"history","id":"comment-38709","author":"Russ Breault","site":"shroudstory"},{"title":"NBC News on the archaeology of Christianity","post":"\nRuss Breault :\nI agree with you Dave.\n How someone can spin the finding of a plain weave cloth as proof against the Shroud is nonsense.\n\nGentlemen, it is NBC and that is enough to say for those who watch them and others and can compare.\nThey have an agenda.\n\n","date":"July 7, 2013 at 9:15 pm","url":"https://shroudstory.com/2013/07/07/nbc-news-on-the-archaeology-of-christianity/","cat":"history","id":"comment-38711","author":"jesterof","site":"shroudstory"},{"title":"NBC News on the archaeology of Christianity","post":"NBC is still on the air?!?!?!  ;)\n\n","date":"July 8, 2013 at 1:45 pm","url":"https://shroudstory.com/2013/07/07/nbc-news-on-the-archaeology-of-christianity/","cat":"history","id":"comment-38735","author":"Chris","site":"shroudstory"},{"title":"NBC News on the archaeology of Christianity","post":"This is funny, the people at NBC did not read the Gospel accounts before commenting and seem to have assumed that there was just one store, some sort of Marks & Spencer, where burial cloths could be obtained.\n\n","date":"July 8, 2013 at 10:43 am","url":"https://shroudstory.com/2013/07/07/nbc-news-on-the-archaeology-of-christianity/","cat":"history","id":"comment-38729","author":"Louis","site":"shroudstory"},{"title":"NBC News on the archaeology of Christianity","post":"Didn’t they know that Marks & Spencer close after mid-day on Preparation Day?\n\n","date":"July 8, 2013 at 3:56 pm","url":"https://shroudstory.com/2013/07/07/nbc-news-on-the-archaeology-of-christianity/","cat":"history","id":"comment-38742","author":"daveb of wellington nz","site":"shroudstory"},{"title":"NBC News on the archaeology of Christianity","post":"They probably didn’t bother to check that either because M&S doesn’t advertise with them.\n\n","date":"July 8, 2013 at 5:07 pm","url":"https://shroudstory.com/2013/07/07/nbc-news-on-the-archaeology-of-christianity/","cat":"history","id":"comment-38744","author":"Louis","site":"shroudstory"}]
