[{"title":"Newly Published Paper:  Othon de La Roche and the Shroud by Alessandro Piana","post":"The late Daniel Raffard de Brienne was pursuing some research but had no success. He was unjustly accused of being biased in favour of his ancestor Walter V de Brienne, Duke of Athens. However, there was a link with Othon de la Roche and consequently the chest lying at the Ray-Sur-Saône Castle:\nhttps://www.academia.edu/9156258/Shroud_Studies_in_France\n\n","date":"November 26, 2014 at 9:08 am","url":"https://shroudstory.com/2014/11/26/newly-published-paper-othon-de-la-roche-and-the-shroud-by-alessandro-piana/","cat":"history","id":"comment-173104","author":"Louis","site":"shroudstory"},{"title":"Newly Published Paper:  Othon de La Roche and the Shroud by Alessandro Piana","post":"The mystery lies not so much in Jeanne de Vergy being a direct descendant of Othon de la Roche as in a possible family connection between the De Molay and De Vergy families\nOn May 22, 2013 at 6:26 pm and May 23, 2013 at 5:02 am, I wrote:\n“Have (you) ever heard of the De Molay De Vergy family? If not see Acta Templarorium or La prosopographie des templiers by Jean-luc Alias, p. 269.”\n“The fact is no medieval historian really know Jacques de Molay’s place of birth. Indeed there are three possibilities… and one of them is directly linked with the De Molay De Vergy family.”\n\n","date":"November 26, 2014 at 9:53 am","url":"https://shroudstory.com/2014/11/26/newly-published-paper-othon-de-la-roche-and-the-shroud-by-alessandro-piana/","cat":"history","id":"comment-173113","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Newly Published Paper:  Othon de La Roche and the Shroud by Alessandro Piana","post":"The links between Othon de la Roche and Jeanne de Vergy acquiring the Shroud were first presented by Daniel Scavone at the 2008 Ohio conference.  Scavone reviews the various alternative hypotheses for the “missing years” 1200 – 1400, and seems able to dispose of them in favour of Othon arranging to consign the Shroud from his signeurship at Athens to his home cathedral in Besancon in Burgundy.  The claimed family tree links between Othon and Jeanne are shown as Fig 31 in Wilson 2010, but I note they were recently challenged on this site by either Rinaldi or Nicolotti.  \nScavone’s thesis is that as Burgundy was close to the German border and a target for the Empire with Roman pontiff sympathies, while the Charnay-Vergy families were French with Avignon anti-pope sympathies, Jeanne de Vergy arranged to rescue the Shroud from Besancon for France.  She later arranged to replace her Besancon requisition with a copy which has been discussed elsewhere on this site, and may have led to the D’Arcis confusion on the matter. \nScavone’s paper has some 33 footnotes and a copious bibliography of references. \n“BESANÇON AND OTHER HYPOTHESES FOR THE MISSING YEARS: THE SHROUD FROM 1200 TO 1400”  by Daniel Scavone, University of Southern Indiana, Evansville.\nhttp://ohioshroudconference.com/papers.htm\n\n","date":"November 26, 2014 at 2:39 pm","url":"https://shroudstory.com/2014/11/26/newly-published-paper-othon-de-la-roche-and-the-shroud-by-alessandro-piana/","cat":"history","id":"comment-173153","author":"daveb of wellington nz","site":"shroudstory"}]
