[{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Well, if Goofy is supposed to illustrate the power of Fourier transforms, then all I can say is, “Where is the useful new information after removing the banding?” Let me think now – Goofy – what was the name of his pal? Ah yes, that explains all.\nNo explanation I see for how an imprinted image of a crease can display on the problematical “banding” area as if it were not there.\nLooks like I shall have a good opener to my new site, with a classic example of disingenuous barrel-scraping on the part of the Sindonology so-called experts to explain away otherwise embarrassing details…\n\n","date":"March 14, 2012 at 12:19 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9308","author":"colinsberry","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"My new site is now up-and-running. Enjoy…\nClutching at straws \n\n","date":"March 16, 2012 at 3:49 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9378","author":"colinsberry","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"I love how the whole banding drives Colin to distraction. It so completely undercuts his bankrupt medieval scorch theory he has to somehow discount it. So far, not convincing . . . at all.\n\n","date":"March 16, 2012 at 8:16 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9388","author":"Chris","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"I don’t want to react to the main topic about Colinsberry.  But I want to talk a bit more about the banding effect in the face region of the Shroud.\nThe FACT that the banding effect give the impression (just an impression) of a lack of image on each side of the face was consider by many Shroud researchers as a sign that a chin band had been used in Jesus burial.  I think the image obtain by Barrie that show that there really is an image on each side of the face discard that hypothesis.  It’s another clue that tell me that Jesus burial on Friday was done in a big hurry.  In that context, I don’t see any washing of the corpse, I don’t see any unction with spices, I don’t see any other thing than a few men that put a crucified body still covered with dirt and blood inside a burial shroud.  All the rest of the procedure was most probably planed on Sunday morning.  That’s what the Shroud image and blood tells me…\nAnd on this particular topic, here’s another quote from the great article published by Maurus Green in 1969 (Max, this one’s for you !!!) : “The body had to be buried without the usual washing and anointing (which the women intended to supply on the Sunday morning) before the start of the Sabbath at sundown.”  The one who said that is not Green himself but Father Benoit, a Dominican.  I agree completely with this way to see the burial on Friday and I really think the Shroud offers many evidences to support this idea.\n\n","date":"March 14, 2012 at 1:24 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9312","author":"Yannick Clément","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Before someone say that he disagree with the way I see the burial of Jesus on Friday, I want you, the reader, to ask yourself those 2 questions that are related to logic thinking :\nWhy the people who did the partial burial rite on Friday would have wanted to lose any time and energy to wash the body, put a chin band, make an anointment of the body or any other possible action normally associated with a Jewish burial rite when they knew perfectly well that they needed to come back on Sunday morning because of their lack of time and preparation related with the sudden arrest and death sentence of Jesus and also with the Sabbath and the Passover Feast that was about to begin ???  \nIn this particular context of high nervousness and the fact that they were surely in a big hurry, don’t you think that the most logical way to see things is to supposed the Friday burial was done in the simplest way possible by dropping the corpse in a Shroud (without losing time to tight the body with strips of linen because they knew they had to anoint the body on Sunday morning), then put this loosely enshrouded corpse on a stone inside the tomb and then roll the rock to close the door of the tomb ?  \nPersonally, I don’t see any good and logical reason why they would have done something else that this basic pre-burial rite on Friday.  My way to see things is based on the Gospel accounts and backed-up by many evidences that are present on the Shroud.  By the way, to me, the fact that the Shroud can back-up so well the Gospel accounts is another very important aspect that comforts his authenticity.\n\n","date":"March 14, 2012 at 3:41 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9314","author":"Yannick Clément","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Yannick, I can see you are still the victim of your “I think I DON’T see” intellectual blindness and visual syndrome! Is it really HOPELESS? \nI personally knew André Marion (†2009). Marion, as a non-epigraphist & non-palaeographer that could not read or write late ancient Greek, DID misread several ghost letters/inscriptions he detected in the two squared U shaped boxes framing up the Shroud face. \nVery early in 1997 (that is well before Guscin and Schwortz were even aware of the problem, I had told him about it and even suggested more correct alternative readings to his misreading). \nNow when it comes to the same Shroud face image areas and to optics (and no longer to either palaeography or epigraphy), allow me to side with the French Professor of optics, CNRS researcher and optical engineer rather than with you and your 2 gurus Green & Schwartz: using his microdensimeter, André Marion DID detect SOMETHING (namely ghost-letters/inscriptions) on both 1931 Enrie and 1978 Miller Shroud face photographs. That is an optical fact except to those who cannot discriminate between postive and negative optical illusions. Too bad one of Faral’s books DID infect the topic (so much so, Yannick you MOST WRONGLY went as far as “thinking” the vatican archivist had worked along with Marion!\nThe optic fact is, there is no lack of (letter/incription) images on each side of the Shroud face INDEED!\n\n","date":"March 14, 2012 at 3:47 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9315","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Additional correction: “between positive and negative optical iilusions (in terms of images and inscriptions)”\n\n","date":"March 14, 2012 at 4:03 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9317","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"It was “just so cool” the way Murra (at Frascati, in 2010, i.e. only 6 months after Marion’s death) and Schwortz (hiding behind Guscin) most UNFAIRLY and TOTALLY discredit André Marion’s research work…\n\n","date":"March 14, 2012 at 4:27 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9319","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Correction: “The optical fact”\n\n","date":"March 14, 2012 at 3:49 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9316","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Actually, an infamy headband (written both in Greeek & Latin at least) might well have been used as a chin band here!\n\n","date":"March 14, 2012 at 4:14 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9318","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Max, you’re free to think what you want versus what you think you see on the Shroud ! ;-)  And so am I !!!  Sorry but I don’t see half of the thing you claim to see…\n\n","date":"March 14, 2012 at 4:36 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9320","author":"Yannick Clément","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Yannick\nAs long as you won’t be have the trained sight-and-brain for forms in terms of ANCIENT images and inscriptions to discriminate between positive and negative optical illusion, you’ll NEVER know what is the real thing as most who currently “think they don’t see/or see”.\n\n","date":"March 14, 2012 at 5:44 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9325","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"I don’t know about anyone else, but ” I see lettering” on the right side of the image face, starting from the step 1 picture and progressively gets more prominent. From step 1, I can see the letter E, maybe a C. By step two 2nd picture; epsilon, C and E are quite prominent. Maybe Fraile was onto something here, but a little off track? It would seem to me that if these markings are really there they are too flat to have been created during the formation of the body/face image, maybe somehow imprinted afterwards? …just simple conjecture. But no one can tell me those markings are not there, but they may just look like lettering and just be a remnant of banding etc;\nBut as for the supposed banding along both sides of the face, I never agreed with this being caused by banding but moreso a remnant of the actual image formation, as in the fact the side imgaes are not present on the whole Shroud image, this can be the same, seeing as the cloth would have been laying more on a vertical axis across the sides of the face at this point, hense no image created? \nR\n\n","date":"March 16, 2012 at 4:57 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9382","author":"Ron","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Corrections:\nYannick,\nAs long as you won’t have the trained sight-and-brain for forms to discriminate between positive and negative optical illusion in terms of ANCIENT images and inscriptions, you’ll NEVER know what is the real thing like most who currently “think they don’t see/think they see”.\n\n","date":"March 14, 2012 at 6:16 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9327","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Back to Fourier transforms!  Hardly “computer mumbo-jumbo” as asserted by Colin.  I still have on my bookshelf a (translated) copy of Joseph Fourier’s classic work “Analytical Theory of Heat” he wrote in 1878 and where he gave the first exposition of expressing any general function in terms of trig series.  The F transforms formed part of the standard undergraduate Applied Maths syllabuses even in li’l ole NZ varsities fifty years ago; I imagine they still do.  I recalled we used them for solving differential equations.  I also recall my work colleagues in Communications Engineering regularly used them in filter design. They may not have appeared in any chemistry or archaeocryptology specialty.\nI did specialise in my career for a period of some eight years, in railway bridge design as it so happens.  One thing I discovered, is that although one needs specialists, it tends to give one too narrow a focus, and can sometimes lead to softening of the brain, even an arrogance, to ignore other important dimensions of life, and to develop a supercilious disrespect of others’ knowledgable contributions.  Charles Sale’s work “The Specialist” is a classic work which should be consulted by those infected with such a disease.\n\n","date":"March 14, 2012 at 8:02 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9328","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Still more ad hom. Here’s a sample, taken almost at random, from the science buzz site of the individual whom you ludicrously try to portray as a specialist. You could not have chosen a more inappropriate example. My record as a commenter on ALL topics of scientific interest (and the occasional mathematical one too) speaks for itself. And you – what is your contribution to the blogosphere – outwith this SPECIALIST site? How many sites have you set up?\nMisrepresentation is, and always has been, the name of the game here – like Dan’s claiming above that I denied the existence of banding. I did nothing of the sort. I simply said it was not the primary reason for the bilateral loss of peripheral image – and indeed Barrie Schwortz’s photo-enhancement, shown above, with raising of the luminance on the B/W photograph (which incidentally is equivalent to lowering the luminance on the actual Shroud image) without the need for Fourier transforms should serve to prove my point. The Fourier transforms are being used to window-dress a dud hypothesis that is full of self-contradictions, like that crease I mentioned. The dud hypothesis (banding) simply attempts to preempt discussion as to the real reasons for bilateral loss of peripheral image symmetrically on both sides of the face – which is more likely a result of the imprinting mechanism, NOT the banding. \n Once again I must thank Dan for supplying so egregious an example for my new site of the shameless misapplication of a specialist technical tool – mathematical in this instance – one  designed to make the gullible think there is “more than meets the eye” where the Shroud is concerned. It is of a piece with Di Lazzaro’s uv laser beams, which is where this NON-SPECIALIST came in…  \nNow awaiting moderation…  yet another symptom of the control freak mindset which, if the truth be told, is what the Shroudie circus and roadshow is all about..\nThis comment will now be copied and pasted to my own site.\n\n","date":"March 15, 2012 at 3:26 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9337","author":"colinsberry","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"To the non-specialist Daveblablabla, \nPr Marion knew “a little bit more” than you seem you do about the F transforms applied to the Shroud face images/photographs. In the hypothesis the Shroud is Yeshua’s, he DID detect SOMETHING which I find archaeo(crypto)logically consistent with the possible presence of an infamy linen headband used as a possible chin band (Shab. 23, 5). More tests, measures and an original but strict methodology are still needed here to irrefutably resolve the “I think I see/I think I don’t see” visual dead end. However, the possibility just cannot totally be ruled out just because YOU THINK as a hardened-brain non-specialist you know better than Pr Marion and me and CREDIBLY can discriminate between mere optical illusions (whether positive and negative) and Shroud image intrinsic characteristics in terms of faint/ghostlike ancient inscriptions.\n\n","date":"March 16, 2012 at 5:32 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9359","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Corrections: “Pr Marion knew “a liitle bit more” about the F transforms applied to the Shroud face images/photographs than you do.”\n\n","date":"March 16, 2012 at 5:54 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9360","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Correction: “(whether positive or negative)”\n\n","date":"March 16, 2012 at 5:55 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9361","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Too bad it still seems you are not really aware of the desease you are badly infected yourself namely Blablabla!\n\n","date":"March 16, 2012 at 7:15 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9363","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"To the best of my knwoledge the only paper published in a peer-reviewd journal on a study with the Fourier Transform is the one by Marion in Opt. Eng. 37(8) 2308-2313 (August 1998). A quick consultation, indicates that in the field of Optics in 1998 there were 47 journals and Optical Engineering was in position #24. This paper by Marion went through a peer-review process and was published because the methodology followed was -at that time- a standard one, widely used and accepted by the rest of the scientific community in the fields of optics and image analysis. This also applies to the point of the Fourier transform, although in this paper the author only writes a few lines on it.\n“It is an isotropic image. The Fourier transform of the image shows no preferential frequencies, proving that no preferential direction exists in the image itself. Consequently, it is difficult to imagine that this image could have been made directly by a human hand.”\nIn my opinion, this a solid conclusion that the Fourier transform technique can provide: the existance or not of preferential directions.\n\n","date":"March 15, 2012 at 7:40 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9339","author":"Gabriel","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Thinking about it, I would also add that the lack of a preferent directionality detected by the Fourier transform technique is also a very strong argument against a scorch for the same reasons as against painting .\n\n","date":"March 15, 2012 at 9:35 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9341","author":"Gabriel","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Gabriel, I don’t understand why you think that about a scorch. I’m not doubting you. I just don’t understand. Can you explain?\nI do think the banding means that a scorch is almost certainly out of the question since I think is very doubtful that scorching can produce halftone effects at the fiber level. Halftone effects are essential for background noise to have the effect it does on the image.\n\n","date":"March 15, 2012 at 10:32 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9345","author":"Paulette","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Paulette, the scorch technique (if I can understand anything at this point of the discussion!!) involves pressing the cloth and therefore, a preferential direction due to pressing  should be detected with a FFT analysis on the final image. The absence of such a directionality as described by Marion, in my opinion rules out or at least makes very difficult the hypothesis of scorching. I mean, one should expect to find a trail of the pressing stage in the form of a prevailing directionality and this should appear in the FFT analysis. However, the image seems to be isotropic.\nNevertheless, as with many other aspects of the SHroud there is not a good image for research available to anyone so all we can do -even with the banding effect described- is to believe someone`s results. I mean, I have many questions and difficulties with the results shown here so far for the same reason:they cannot be reproduced independently because original material (graphical or other) is not available. For this reason, discussion on these topics is possible but will never be scientific, since one of the foundations of science is the reproducibility of results by independent researchers. Therefore, please take my opinion as nothing more than a comment.\n\n","date":"March 15, 2012 at 11:10 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9347","author":"Gabriel","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"I was not aware of the banding. This is clearly suggestive that the shroud goes far back in history well before Europe’s middle ages. It is clear proof too that the image can not be a scorch. Thanks so much.\n\n","date":"March 15, 2012 at 7:55 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9340","author":"monica darik","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Dan, hay un fenómeno MUY curioso que describió hace algunos años un comentarista de nick Tony. Solicitó ayuda pero sólo obtuvo burlas.\nSe produce en las pantallas de los ordenadores portátiles, ignoro si son TFT o LCD (entiendo muy poco de ordenadores). El portatil mío es un HP Pavilion de 17 pulgadas y tendrá 6 o 7 años (ignoro si en los modernos se produce el fenómeno).\nSi observamos el rostro del Hombre de la Sábana ( por ejemplo el “Face only vertical” en el Shroud Scope de Mario Latendesse) y vamos inclinando la pantalla del ordenador hasta el máximo y luego el propio ordenador, vamos como la imagen pasa del negativo al positivo ( o viceversa) paulatinamente, “como si” se fueran SELECCIONANDO por CAPAS las intensidades tonales permitiendo observar MEJOR detalles que pasan inadvertidos.\nEl fenómeno, además de BELLO, creo que merecería atención por parte de los que entienden del tema (pantallas de ordenadores)\n\n","date":"March 15, 2012 at 9:36 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9342","author":"corneliotel","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Me he tenido que volver a “loguear” y ahora aparezco como “corneliotel\nSoy “co”, Carlos Otal\n\n","date":"March 15, 2012 at 9:39 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9344","author":"corneliotel","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"By the way, Dan, some of the final residuals might be attributed to the original image format I understand the process was applied to the photograph distributed by the Archidiose of Torino. I suppose that after scanning FFT was applied but only TIFF format is appropiate for image processing since other popular formats like JPG tend to distort the pixel values\n\n","date":"March 15, 2012 at 3:01 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9350","author":"Gabriel","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Dan you wrote: “Barrie Schwortz did some of the earliest technical work to show one optical illusion effect of the banding.”\nAcually, the U shaped box interference on each side of the Shroud face image should not be too easily identified with mere optical illusion effect of two symetric vertical banding patterns framing up the face. It might well be that caused by the imprint left by an object: a linen infamy headband used as chin band.\n\n","date":"March 16, 2012 at 8:21 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9365","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"May no Shroud stone lay unturned!\n\n","date":"March 16, 2012 at 8:52 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9368","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"I wonder what this process does to the rest of the body images. Seems to be spot on with the face.\n\n","date":"March 16, 2012 at 10:25 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9370","author":"Chris","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Yannick, Rabbi Yeshua’s burial was performed in “half an hour”, really?\nSince I read your comments on this blog, you currently keep rehashing Rabbi Yeshua’s burial was made in haste after sunset (that is within about half an hour or so) and his shroud just draped about his body or loosely bound for the women to wash and anoint his body at the first morning hour of the first day of the Hebrew week, that is just after the Shabbat, on the third day of Yeshua’s death. Such a view (or should I better say “preaching”) presupposes:\n1/Yossef Ha-Ramathayim (both a member of the Sanhedrin/Judean Supreme Court and a secret disciple of Rabbi Yeshua), waited until shqiya/sunset (18:08/18:38 p.m.) that is a minimum of 3 hours AFTER his master’s violent death on the Golgotha (at 15:04/15:34 p.m.) BEFORE he actually went to Pilate’s and ask him for Yeshua’s body and then bought a linen shroud to bury him. Are you serious? Do you really think Yossef Ha-Ramatayim would have also run the risk not to abide by Deuteronomy 21: 22-23 and wait to the very last minute for taking down himself or having Rabbi Yeshua’s body be taken down from the cross and buried?\nIt does seem you totally overlook “one little circumstantial fact”: in the Second Temple period, any working activity was to stop at midday “on preparation day” that is on the very eve of the great Shabbat of PessaH/Passover (PessaH 4, V). How then could possibly Joseph of Aramathia have bought a shroud after sunset and before dusk on that specific day when Jerusalem weavers’ workshops, stores and shops had all been closed for more than 6-6½ hours? This is a total exegetical non sense.\nUnless one is ignorant of the ethnic milieu and thinks a Judean of the Second Temple period would have waited until sunset on “preparation day” and go and buy a shroud long after all the weaver’s workshops and linen shops had closed, this reconstruction of the event chronology is most unlikely. In all likelihood, Yossef Ha-Ramathaym had already bought a fine linen shroud for himself in anticipation of his own death and used it to wrap Yeshua’s body “with his shed innocent blood”. As a disciple of Yeshua, didn’t Yossef go as far as using his own recently hewn garden-tomb near-by to bury his master executed as a criminal and thus to both abide by Sanhedrin 6: 46b and spare some precious time to proceed to his burial?\n[Precision: the women bought the spices not just BEFORE but just AFTER the sabbatical rest. Mark (16: 1) raises the ambiguity which could result from the chronologically biased relation/presentation of the same fact in Luke (23: 56).]\n2/ Modern time markers such as ‘evening’, ‘sunset’, ‘twilight dusk’ philologically cover the same realities for a Judean of the Second Temple period. Far from it!\nWith respect to the time frame for Yeshua’s burial, here are the ancient biblical Hebrew words & expressions for the time markers from noon to night used in the Second Temple period yet currently overlooked by Shroud researchers/old students and exegetes:\n1/Tsot ha-yom (or “midday”) refers to that time of the day at equal distance between sunset and sunrise.\n2/Tsohorayim (dual form of Tsohar, “dazzling light” or “zenith”) literally means “two dazzling lights” or “two zeniths” and refers to ‘both morning and evening lights’ merging into ‘noon’.\n3/Erev (“evening”) may indifferently refer to the 1st or the 2nd evening. Rabbi Yeshua died exactly between the first and the second evening (at the 9th hour).\n4/Beyn ha-arbayim literally means “between the two evenings,” —- arbayim being the dual form of erev, “evening.” The afternoon was divided into two halves: from noon to mid afternoon and from mid afternoon to sunset or put in other words from early to late evening (See Exodus 29:38-41, “They shall slaughter it [the paschal lamb]… beyn ha-arbayim”). For the covenant people, the entire day revolved around the offering of the two Tamid lambs: that of the morning and that of the evening. In a paper entitled « En Vue de la Solution Archéologique de l’Énigme » I presented in Turin in 1998, I wrote: « Le deuxième sacrifice quotidien du Temple (Numbers 28: 4-8) dit sacrifice du “soir” (evening sacrifice) se déroulait vers le milieu de l’après-midi (mid afternoon) et pouvait être avancé d’une heure (une veille de Pâque) voire même de deux heures (lorsque cette grande fête « allait-il du milieu du jour (from midday)  jusqu’à la deuxième immolation en milieu d’après-midi (until mid afternoon) et, « le deuxième soir », de la deuxième immolation du milieu d’après-midi (from mid afternoon) jusqu’au crépuscule du soir (until twilight dusk)».\n5/Shqiya, “sunset”; the sun set at 18:38 p.m. on April 7th 30CE and 18:08 p.m. on April 3rd 33 CE.\n6/Beyn ha-shemashot which literally means “between the suns” is an expression for “dusk” or “twilight” between the setting sun and the rising moon (which reflects the light of the sun).\n7/Layla, “night”; typically layla is taken to be when you can see three stars in the sky in reference to tset ha-kokhavim, the first “three stars coming out” to announce a new day (here the great Shabbat of PessaH). The 3rd star respectively appeared at 19:38 p.m. on April 7th 30CE and19:08 p.m. on April 3rd 33 CE. Owing to a lunar eclipse or the Ruah Qadīm, “east wind” (Khamsin/Sharav); a wind blowing from the desert of Judea, the whole city of Jerusalem was plunged into darkness from tsohorayim (“noon”) to beyn ha-arbayim (“between the two evenings” that is the 9th hour of the day; 15.34 p.m. on April 7 30 CE/ 15.04 p.m. on April 3 33 CE). In other words, for 3h34/3h04, on the very day Rabbi Yeshua died on the cross, it was also night, “layla” on that very day in the eye of a Judean of the Second Temple period.\nHence, the actual maximum time-frame for Rabbi Yeshua’s burial was 4h04. If we now take off 30-45mn to Pilate’s and back + 30-45mn to take down Yeshua’s body from the cross and carry it to the garden tomb near-by, we are left with a minimum time-frame of about 2h30. It totally rules out the pseudo “0h30” left for Yeshua’s burial time-frame burial as the very notions of ‘evening’, ‘sunset’  ‘twilight dusk’ and ‘night’ as time markers, do not philologically cover the same realities for a Judean as they do for a 20th-21st reader relatively or totally unfamiliar with the Judean ethnic milieu of the Second Temple period.\nWithin a minimum of 2h30, Rabbi Yeshua’s buriers had enough time to pre-wash his body (i.e. to re-dampen most of his wounds – to the sole exception of those likely to flow so as to keep his blood with his body as much as possible), purify his shed innocent blood via his lengthy inner shroud (Gr. sindôn/Heb. sadin) soaked with a watery solution (ashes of the Red Heifer?) and tightly wrap it up, with fresh aromatic medical insect repellent plants, in linen clothes and strips.\nIn the Judean ethnic milieu of the time, the tradition was to visit the deceased on the three days immediately following his burial. Anointment was part and parcel of the Judean burial rite as it allowed preventing bad smells on those subsequent visits. Because this part of the rite was not done, the women had to buy and prepare spicy oils to anoint Rabbi Yeshua after the Sabbath and come back to the tomb very early on the third day. They definitely had not to wash the deceased’s naked body at all but just to anoint his linen wrappings. Hence, to the sole exception of the anointment ritual, Rabbi Yeshua’s “primary” burial rite according to the Judean funerary custom of the Second Temple period might well have been duly completed within a minimum of a two-hours-and-a-half time-frame.\n\n","date":"March 17, 2012 at 2:34 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9401","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Correction: “In a paper entitled « En Vue de la Solution Archéologique de l’Énigme » I presented in Turin in 1998, I wrote: « Le deuxième sacrifice quotidien du Temple (Numbers 28: 4-8) dit sacrifice du “soir” (evening sacrifice) se déroulait vers le milieu de l’après-midi (mid afternoon) et pouvait être avancé d’une heure (une veille de Pâque) voire même de deux heures (lorsque cette grande fête tombait un Shabbat) (PessaH 5:1). le premier sacrifice avait lieu le matin. Ainsi “le premier soir” allait-il du milieu du jour (from midday) jusqu’à la deuxième immolation en milieu d’après-midi (until mid afternoon) et, « le deuxième soir », de la deuxième immolation du milieu d’après-midi (from mid afternoon) jusqu’au crépuscule du soir (until twilight/dusk)».”\n\n","date":"March 19, 2012 at 11:27 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9449","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Correction:”5/Shqiya, “sunset”; the sun set at 18:08 p.m. on April 7th 30CE and 18:38 p.m. on April 3rd 33 CE.”\n\n","date":"March 17, 2012 at 2:46 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9402","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Just forget the last correction.\n\n","date":"March 17, 2012 at 2:52 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9403","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Muy interesante, Max.\n\n","date":"March 17, 2012 at 4:54 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9404","author":"corneliotel","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"There’s a lot of blablabla up there but not much from me!!!\n1) The only significant comment I made about Fourier Transforms, was that they were a fairly common mathematical tool for all sorts of purposes and should not be dismissed as merely “computer mumbo-jumbo” as one such posting has it.  It does not surprise me at all that someone called Pr Marion found a use for them in some kind of visual analysis.  If I’m to be challenged, I’d sooner it be based on something I said, rather than something I hadn’t, or that someone else is responsible for saying!\n2) Max’s comment #32, note 7;  He’s obviously done some astronomy research on times of sunset, sunrise, three stars appearing etc, and I assume he has the correct calculations.  However there’s some little confusion concerning eclipses.  Only Luke says “with the sun eclipsed”, other gospels merely say it was dark.  The only way that there can be a SOLAR eclipse is for it to occur after Old Moon and before New Moon when the sun becomes hidden; But this timing does not fit in with the time of Pasch which occurs at Full Moon!  You can have a LUNAR eclipse at Full Moon, but if so, it would not appear so remarkable as to darken the sky in the afternoon and would not cause comment; Only the face of the Full Moon would become hidden.  The sun would still be visible.  The cause of the darkness has to be the Ruah Qadim, the Dust Storm.\n3) Obviously Joseph of Aramathea must have intended both the tomb and shroud for his own burial, for them to be so immediately available to him,  If the present Sindon we know was in fact the Shroud he used, then it was not the sort of weave that one would buy off the shelf, he’d obviously imported it or purchased it sometime beforehand, possibly from Syria, assuming he had originally intended.that this expensive cloth be used for a Shroud rather than for some other purpose.\n4) Even allowing Max his 2 1/2 hours for observing the prescribed burial rites, I see a problem in the way that the image appears, and his assertion that the body was completely wrapped.  The problem is that there is no lateral image, which if some natural process was involved, would surely show up if the body was completely wrapped.  But both the frontal and dorsal image appear as they would in a frontal and dorsal photograph, with no lateral imaging at all.\nWhat kind of process could have limited the image in this way?  Are we expected to think that there were a pair of convenient lightning bolts taking frontal and dorsal images and projecting them onto the cloth? Or if they came from some mysterious power from within Rabbi Yeshua that he was able to command so that only frontal and dorsal images would show?\nIf a natural process is the cause of the image, then It is rather more credible to see the body laid on the bottom half of the cloth where the dorsal image will appear, and for the top half to be brought over the head and over the body for the frontal image to form, without any further wrapping.  The top half of the cloth could be weighted down with some of the 100 lb of mixture left over.  This to my mind is the only credible way that no lateral image would show up.  Otherwise, please explain why there’s no lateral image!!\n\n","date":"March 19, 2012 at 7:36 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9444","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"“Someone called” Daveb wrote:\n“The cause of the darkness has to be the Ruah Qadim, the Dust Storm” (also called Sharav or Khamsin). The fact is he changed his mind and made HIS OWN my Khamsin/Sharav/Ruah Qâdim hypothesis as it might well better work than his previous lunar eclipse hypothesis he now criticizes. He also took up as “OBVIOUS” my own hypothesis about Joseph’s shroud.\nHe also wrote: “I see a problem in the way that the image appears, and his assertion that the body was completely wrapped. The problem is that there is no lateral image, which if some natural process was involved, would surely show up if the body was completely wrapped.” Once or twice on this blog to account for the lack of lateral imaging, I already wrote that fresh aromatic, medical insect repellent plants and floral heads (Gr. aromaton) most likely were laterally placed on the shroud and then compressed through wrapping against Rabbi Yeshua’s naked body.\n\n","date":"March 19, 2012 at 11:05 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9446","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"…much like in a herbal…\n\n","date":"March 19, 2012 at 11:33 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9450","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"My “idea” of what conspired, and from much of my readings, formulates pretty well with what Max as stated on what occured after Jesus died. The time of 2-2.5 hours fits in well with what has been deduced from research and findings from the Sudarium of Oviedo. These findings being; The Sudarium was placed upon the head of Jesus ‘shortly’ after death, whilst still on the cross. An hour or so later the body was removed from the cross and layed partially face down at the foot of the cross and stayed for approximately another 45 minutes, then the Sudarium was properly wrapped completely around the head of Jesus and the body was moved to the tomb, approximately another 10 minutes, where it was then apparently removed. This gives us a time of 2 to possibly 2.5 hours between death and tomb, if then we accept the time of death between 3-3:30 pm, that puts us in the tomb approximately at 5 to 6pm. Giving a minimum of one hour in the least of scenarios and 2.5+ hours for the max time for the burial preparations… \nAs for Max’s wrapping hypothesis, I have problems with it, some I have mentioned before. I just find it unlikely they would have wrapped the body twice using two different clothes and if the first cloth had been soaked with water & spices or whatever had been placed on it, there should be chemical signs of this still noticeable today, which so far have not been found, to my knowledge. If one wants to use the term othonias as plural, one must accept there MAY HAVE been other cloths there also, as most likely there could have been another large cloth used to transport Jesus from the cross to the tomb, but would have not been used in the wrapping, as it would have been “unclean”.\nAs for the ‘dust’ storm idea, (the darkening of the sky), although it sounds reasonable at first, one must wonder; If this storm was a regular occurence, regularly witnessed and even possibly given a name at the time, why such a mystical attitude given to it in scriptures?? Something definately “UNUSUAL” and not to the ‘NORM’ must have occured instead. That is my simple reasoning against the Sharav or Khamsin hypothesis. Why didn’t they just call it for what is was; a dust storm, the Sharav the Khasmin? Instead they just say the whole ‘SKY’ was darkened.\nRon\n\n","date":"March 19, 2012 at 4:21 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9451","author":"Ron","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"I must correct an error in my first paragraph, which is very essential: that being the times. First “from my understanding”, the death of Christ occured on the 1st of April 33ad, not the 3rd day as that was the day of ressurection. On April 1st 33ad the sun set at 6:33 pm (approx) that then changes the times allowed for burial preparation to anywhere from 30 minutes to 1 hour 30 minutes (approx); If my Sudarium findings are adhered too. Although this may leave just 30 minutes in one regard, one must also be aware of the next comment… \nI have also found in my readings of the Tulmud, Mishna that there were concessions for burials on the EVE of a Sabbath or Passover, whereas the stipulation ‘excused’ the buriers, and allowed the burial procedures to continue into the Sabbath, so as the body may be properly interred before darkness fell. Jewish law was very adamant that no body should be unburied overnight….Max you seem pretty knowledgeable on the Talmud, Mishna, Am I correct in these findings?\nRon\n\n","date":"March 20, 2012 at 3:31 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9478","author":"colinsberryRon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Also, Joseph of Arimathea being who he was would no doubt be aware of this ‘stipulation’ in the law, as would also the sanhedrin. I realize this statement may bring alot of rebuttal as scriptures mention the burial was done in haste, but like many things it is just a ‘thought’ which can possibly add some insite to the complexity of this topic….Maybe the burial was not done in such haste?\nR\n\n","date":"March 20, 2012 at 3:57 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9480","author":"Ron","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"If you look carefully at the Shroud Ron, you’ll notice pretty easily that the burial was most probably done in haste, just like it is said in the gospels…\n\n","date":"March 20, 2012 at 4:33 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9481","author":"Yannick Clément","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Who is “colinsberryRon”? Is this a software glitch? I had nothing to do with the above comment (but have had two comments of my own held back).\n\n","date":"March 21, 2012 at 2:27 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9487","author":"colinsberry","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"I have no idea. And I have no idea what you are talking about regarding held comments.\n\n","date":"March 21, 2012 at 5:29 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9489","author":"Dan","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Hello Colin,\nThe two possible dates for the death of Yeshua on the cross on a Friday, Preparation Day, Nissan 14, are:\nA) On April 7th of 30 CE (the most likely)\nB) On April 3rd of 33 CE (the best alternative; look at the website bethlehemstar.net).\n\n","date":"March 23, 2012 at 7:02 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9541","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Gregorian calendar (as opposed to Julian clendar)\n\n","date":"March 23, 2012 at 7:07 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9542","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Both historically and archaeoastronomically speaking, here is the best alternative to account for the darkening of the sun on Yeshua’s death on the cross:\n-Either it did actually happen one “April 7th of 30 CE” and if so, the “black breath” of the Ruah qâdim (“east wind”, also called Sharav/Khamsin), blowing from the desert of Judea, is the most likely phenomenon to have occurred to account for the darkening of the sun.\n-Or it did actually happen one “April 3rd of 33 CE” and if so, the same “black breath” or dust tempest has been followed by the rising of a moon already bloody/in eclipse that evening/second evening, thus fulfilling Joel’s prophetical “blood moon” vision. \nIn the second alternative, Ron you  might well be right. Beyond Matthew’s mere embellishment or dramatic literay emphasis, “something definitely “UNSUAL” and not to the norm” would have occurred then.\n\n","date":"March 24, 2012 at 6:05 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9566","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"See passage in Joel (2:31).\n\n","date":"March 24, 2012 at 6:36 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9569","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Ron, you must also be aware that the biblical Hebrew expression “beyn ha-shemashot” (which literally means “between the suns”) is an expression for “dusk” or “twilight”. As such it can be understood two ways: either meanng “between the setting and rising moon (which reflects the light of the sun)” or from the late evening to the apparition of the third star on a New or Full moon day. The moon being then seen as “a second sun”, this ancient Judean astronomical “archeaoperception” might well account for Luke speaking of a “solar” eclipse instead of a lunar one.\n\n","date":"March 24, 2012 at 7:09 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9570","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Correction: “between the setting sun and the rising moon”\n\n","date":"March 24, 2012 at 7:15 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9571","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Someone called Max seems to continue having a perception and communication problem.\nNot only did he falsely accuse me of casting doubts on the Fourier Transform work, he now implies that I attributed the darkness to a lunar eclipse, which is just not credible.  I have never had a lunar eclipse hypothesis about the cause of the darkness;  Having had an active astronomy interest for some decades, I have been very well aware for many years that a SOLAR eclipse could not occur at Pasch depite it being so implied in Luke.  My reference to a LUNAR eclipse was merely an aside to say that it was possible to have had a LUNAR eclipse instead.  As the Full Moon would not rise until some time around 5:00pm to 7:00pm, it can hardly be attributed to have caused any kind of darkness in the early afternoon.  I have always suspected that if the darkness did indeed occur, (and all three Synoptics say it did) then it had to be some other phenomenon such as a dust storm.  The person called Max gave it a name and I merely did him the courtesy of alluding to it in my note above.\nI doubt if Max can claim proprietary rights over the origin of the Shroud as only a moment’s reflection will yield the answer – it is an expensive piece of cloth, perhaps not originally intended as a Shroud, but was pressed into service as being readily to hand. Joseph seems to have been the generous minded sort of fellow who would readily be open-handed about this act of generosity.\nConcerning Ron’s comments in his last para above, a regular dust storm may have been familiar to both Matthew and Mark, but it is entirely consistent with their scriptural intent to assign a supernatural significance to the timing of it in association with the crucifixion, and it heightens the drama.  Luke does not have the same familiarity with Jewish lore, and so assumes and attributes it to a solar eclipse, which is mistaken.\nAlong with Ron, I am not convinced by the wrapping hypothesis.  If the body’s sides were packed with insect repellent flora, then one should see some degree of graduation or fading at the edges of the two images, frontal and dorsal, where the “packing” starts, but the image edges seem to be relatively sharp.  I think the question remains open, and it seems to me that the photographic-like orthogonal projection of the image favours a mere draping of the cloth over the body, possibly with some temporary weighting using the ingredients left over.\nI don’t expect Max to agree with any of this, and I half-expect that he will find some deliberate way of misinterpreting what I have said.\n\n","date":"March 19, 2012 at 5:57 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9453","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Dave don’t misunderstand me here, I believe there is “ample” evidence that the Shroud was wrapped. The Shroud would have been layed down, body placed in position then the Shroud folded over the head and layed over the front/top of the body to the feet.Then the sides may have been tucked in and folded over onto the body; (There is evidence for this on the Shroud). This is then where the linen strip or strips come into play and were used to tie about the body therefore holding the shroud and body in position. I just don’t agree with Max’s double wrapping theory, with a moist first wrapping, thats all. The fact there is no side images is a conundrum for sure, even if the shroud was just draped, and one issue that has stumped everyone basically, except maybe those that believe the image is the work of a forger.\nR\n\n","date":"March 20, 2012 at 12:26 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9458","author":"Ron","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Could FIRST “someone called Daveb” explain/clear up the reason why he  wrote: \n“It does not surprise me at all that someone called Pr Marion found a use for them [F transforms] in some kind of visual analysis. ” \nWhy could not he simply wrote “Pr Marion” instead of “someone called Pr Marion”? Is it symptomatic of his way to systematically underrrating specialists such as Pr Marion or else of his secret desire to be called “someone called Daveb/Pr Daveb”?\nWhy the need in him to infer “on edgeways” “They [the F transforms”] may not have appeared in any […] archaeocryptology specialty (when I currently apply them in eidomatics)?” \nIs “someone called Daveb” DELIBERATELY underrating late Pr Marion and DELIBERATELY underating and misinterpreting me just because he hates specialists and professors and thinks, as a non-specialist”, he knows much better than any of them?\n\n","date":"March 19, 2012 at 6:54 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9454","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"A truly sad case! I’m not even going to bother giving any response to this kind of tripe.\n\n","date":"March 19, 2012 at 11:47 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9455","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"Hypocrisis suits you davelishly well Daveb!\n\n","date":"March 20, 2012 at 8:32 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9465","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"From now on I’ll just ignore you and your blabla which is typically that of the individual whom you ludicrously try to portray as a specialist.  It does seems (within a very short time) you bought in many of my ideas. One should not be surprised that within a very short time too you go as far as putting in edgeways you had “new ideas of yours” on the Shroud when actually they just dont come from you.\n\n","date":"March 20, 2012 at 9:11 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9466","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"I am off from this debate.\n\n","date":"March 20, 2012 at 9:23 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9467","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"\nYannick Clément :If you look carefully at the Shroud Ron, you’ll notice pretty easily that the burial was most probably done in haste, just like it is said in the gospels…\nThere you go again Yannick, assuming I haven’t looked at the Shroud carefully? and you are somehow more an expert then I? Sorry but I don’t see “pretty easy” evidence that the body was “most probably” buried in haste. Actually there are signs that it wasn’t, you can refute this as you have but it doesn’t change the matter….Just don’t assume you may have a better understanding of what IS shown by the Shroud.\nRon\n\n","date":"March 20, 2012 at 5:24 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9482","author":"Ron","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"If you consider that the body wasn’t washed, it is pretty evident that the burial was done in haste.  But I know many people follow Zugibe’s hypothesis about the partial washing.  Not me.  That’s why I think it’s pretty evident that the burial was done very partially.  That’s just my opinion.\n\n","date":"March 21, 2012 at 8:28 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9491","author":"Yannick Clément","site":"shroudstory"},{"title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”","post":"\nDan :I have no idea. And I have no idea what you are talking about regarding held comments.\nHi Dan and Colin, that was my post, as I clicked the post comment button a whole bunch of letters popped up and next thing I know it shows colinsberryR lol, …I tried emailling Dan but it kept coming back an error, the emails would not go thru. Anyways I had to go to work and forgot to post the issue here, …sorry!\nI think there may be a glitch somewhere.\nRon\n\n","date":"March 21, 2012 at 6:23 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","id":"comment-9490","author":"Ron","site":"shroudstory"}]
