[{"title":"Paper Chase:  Kim Dreisbach in Dallas 2005","post":"I love this paper by Kim Dreisbach, and have referred to it from time to time.\nMozarabic proper refers to those Christians who lived under Moslem domination in Spain.  However the so-called Mozarabic rite (more accurately Old Hispanic) was well developed even before the Visigoth period, its final form being determined by St Isidore of Seville, (d.636) before the Muslim invasion.   \nThe reference to ‘vestigia’ corresponds to the scripture text John 20:6-8.  None of the four Greek texts from the parallel Greek web-site, nor Jerome’s Vulgate text, refer to the imprints on the cloths.  It would seem to be an early inference taken from the text of v.8: “8 Then the other disciple also went in, the one who had arrived at the tomb first, and he saw and believed.”  It raises the question of what was it that he saw that made him believe. \nDreisbach quotes a few other interesting early liturgical sources, which I’ve recently mentioned to a few other Eucharistic Ministers at my local church.  The EMs are required to spread a corporal cloth on the altar before Mass on which the sacred elements are placed.\nKim observes: \nAs early as A.D. 325, Pope Sylvester I established:\n‘that Mass be celebrated on an altar covered with a cloth of linen consecrated by the\nBishop, as if it were the clean Shroud of Christ.’\nTheodore of Mopsuestia (ca. A.D. 350-428) expresses this motif’s incorporation into the liturgy, describing the role of the deacons in the liturgy as follows:\n‘When they bring up (the oblation at the offertory) they place it on the altar for the\ncompleted representation of the passion so that we may think of Him on the altar as if He\nwere placed in the sepulchre after having received the passion … the deacons who spread\nthe linens on the altar represent the figure of the linen cloths at the burial….’  \nThere are also some fascinating comparisons with the burial and resuscitation of Lazarus.  If you as yet unacquainted with it, I fully recommend a read of this paper.\n\n","date":"September 23, 2014 at 6:10 am","url":"https://shroudstory.com/2014/09/23/paper-chase-kim-dreisbach-in-dallas-2005/","cat":"history","id":"comment-154137","author":"daveb of wellington nz","site":"shroudstory"}]
