[{"title":"ABR: The Shroud of Turin’s Earlier History: Part One: To Edessa","post":"For a guy like me who know for a fact (a physico-chemical fact to say it best and I’m not even talking about the huge historical evidence) that the Shroud and the Mandylion are two seperate objects, I’m glad to realize that the “Mandylion dogma” is only present in the pro-Shroud circle (circus would be a better choice of words).\nBe sure of one thing :  I prefer facts beside dogmas and I think that anyone who got a bit of desire for authentic truth should do the same. And I want to add that this is true, not only for the pro-Shroud world but also for the Catholic religion…\nSure it would be good to know the ancient history of the Shroud but the reality is this :  there are absolutely no solid evidence about the presence of the Shroud of Turin before the second half of the 12th century in Constantinople (thanks to the Pray Codex and the testimonies of Mesarites and de Clari).  Before that time, any credible, honest and professional history would dare to say that there is a tangible evidence of its presence anywhere…  Scavone and Wilson can claim anything they want, that will never change a thing about this REALITY.\n\n","date":"March 15, 2013 at 8:33 am","url":"https://shroudstory.com/2013/03/15/abr-the-shroud-of-turins-earlier-history-part-one-to-edessa/","cat":"history","id":"comment-27350","author":"Yannick Clément","site":"shroudstory"},{"title":"ABR: The Shroud of Turin’s Earlier History: Part One: To Edessa","post":"I made a little mistake in the end.  Here it is again :\nBefore that time, any credible, honest and professional HISTORIAN would dare to say that there is a tangible evidence of its presence anywhere… Scavone and Wilson can claim anything they want, that will never change a thing about this REALITY.\nSorry. I always type too fast…\n\n","date":"March 15, 2013 at 9:26 am","url":"https://shroudstory.com/2013/03/15/abr-the-shroud-of-turins-earlier-history-part-one-to-edessa/","cat":"history","id":"comment-27354","author":"Yannick Clément","site":"shroudstory"},{"title":"ABR: The Shroud of Turin’s Earlier History: Part One: To Edessa","post":"Its nice to see a Shroud article on this website.\n\n","date":"March 15, 2013 at 9:48 pm","url":"https://shroudstory.com/2013/03/15/abr-the-shroud-of-turins-earlier-history-part-one-to-edessa/","cat":"history","id":"comment-27396","author":"Louis","site":"shroudstory"},{"title":"ABR: The Shroud of Turin’s Earlier History: Part One: To Edessa","post":"Thank you Dan for taking note of The Shroud of Turin’s Earlier History. It is, of course, not meant to be a major work a la Crispino, Scavone, Wilson, etc. but rather a brief look at the Shroud’s earlier history for interested lay people. I’ve been checking your site for only the last year or so; I’m sure you must have dealt with these issues before. The Associates for Biblical Research are interested in a wide range of topics, and especially in biblical archaeology; they are doing first hand, primary work at what they believe is the O.T. city (actually small frontier fortress for the city-state of Jerusalem) of Ai. Your readers are welcomed to review the many articles found on-line at http://www.biblearchaeology.org/\nI see Yannick draws a line for “solid evidence” down the middle of the 12th cen., and believes that Wilson and Scavone are not among the “credible, honest, and professional historians” for trying to make some sense out of all the earlier “soft” evidence. Is Yannick sure in his judgement? The Part 1 article dealt with the following factual evidence: the choice of a “true likeness” Jesus face in a pivotal area for the development of Christian art (Edessa and environs) just at the time the Edessa Image was gaining regional fame, an acheiropoietos (not man made) image on a sindon (linen), tetradiplon folding, faint and moist-like, and understandable confusion due to the icon’s seclusion – all with obvious connections to the Shroud and fairly noticed by Wilson and then Scavone. But this was just Part 1; will Yannick be more charitable after Part 2?\n\n","date":"March 18, 2013 at 4:34 pm","url":"https://shroudstory.com/2013/03/15/abr-the-shroud-of-turins-earlier-history-part-one-to-edessa/","cat":"history","id":"comment-27692","author":"John Long","site":"shroudstory"}]
