[{"title":"Paper Chase:  New Peer Reviewed Article","post":"Looks interesting!  How can we get the full article?  Publication only allows you to see the abtract.\n\n","date":"April 9, 2013 at 8:42 am","url":"https://shroudstory.com/2013/04/09/paper-chase-new-peer-reviewed-article/","cat":"history","id":"comment-30019","author":"Russ Breault","site":"shroudstory"},{"title":"Paper Chase:  New Peer Reviewed Article","post":"You can buy it.\nTristan examines three hypotheses, basically the fake, the miracle and the naturally formed, according to a historiographical methodology proposed by Christopher Behan McCullagh. He concludes that the most probable explanation for the formation of the image is by a miracle.\nI disagree with his methodology, his premises (based on Fanti’s list of shroud data), and his conclusions. Others may not.\n\n","date":"April 9, 2013 at 9:14 am","url":"https://shroudstory.com/2013/04/09/paper-chase-new-peer-reviewed-article/","cat":"history","id":"comment-30024","author":"Hugh Farey","site":"shroudstory"},{"title":"Paper Chase:  New Peer Reviewed Article","post":"Heythrop is Jesuit-run, therefore it is no surprise that they have been tolerant in publishing the paper that may eventually be proved to be wrong in its conclusion if it is based on data that can, in turn, be shown to be faulty,\n\n","date":"April 9, 2013 at 10:57 am","url":"https://shroudstory.com/2013/04/09/paper-chase-new-peer-reviewed-article/","cat":"history","id":"comment-30037","author":"Louis","site":"shroudstory"},{"title":"Paper Chase:  New Peer Reviewed Article","post":"Dear Casabianca Tristan,\nAs an historian, I would like to read your article assessing the historicity of the Turin Shroud.  The Heythrop Journal allows acces only to subscribers or via payment by non-subscribers.  Will you kindly send a copy of your paper to me at sindon@globalweb.net, perhaps with permission to make it available to SSG members, or you might ask Dan to publish the paper on his blog.  Many thanks.  Diana Fulbright\n\n","date":"April 14, 2013 at 4:45 pm","url":"https://shroudstory.com/2013/04/09/paper-chase-new-peer-reviewed-article/","cat":"history","id":"comment-30800","author":"Diana Fulbright","site":"shroudstory"}]
