[{"title":"Paper Chase:  Z Twist Again","post":"‘They were Z-spun, which is not characteristic of the weaving technique in the country during this period.’\n‘The traditional spinning in Israel was S-spun and therefore it is assumed that the textile was imported.’\nThese finds seem to support the traditional view about Z spin- I don’t know where  Gorny got his idea from although there are cases, not relevant so far as the Shroud is concerned, where the spin is S but two threads are twisted together with an Z twist. I don’t know the Tunic of Argenteuil but perhaps someone can tell us whether it is the spun yarn or the twist of separate yarns that is Z in this case. If the latter I believe that a Middle East origin is quite possible.\n\n","date":"January 1, 2014 at 10:43 am","url":"https://shroudstory.com/2014/01/01/paper-chase-z-twist-again/","cat":"history","id":"comment-70841","author":"Charles Freeman","site":"shroudstory"},{"title":"Paper Chase:  Z Twist Again","post":"The source for Górny is probably Andrè Marion, Gerard Lucotte, Ii>Tunika z Argenteuil i Całun Turyński (the polish edition of Le linceul de Turin et la tunique d’Argenteuil), Wydawnictwo M, Kraków 2008 pg. 184-187. There are several quotes from a report by Isabelle Bèdat and Sophie Desrosiers, textile experts. \nAccording of them wefts and warps (it was impossible to detrmine which were which) were highly Z-twisted. Simple weave. Density is 14.75 threads/cm, in case of vertical threads, and 15.4 threads/cm for horizontal. The color is similar with small shade differences. The material is sheep wool. The material is heavily contaminated by organic material (so the C-14 datings were probably unreliable). The Tunic is madder colored.\nIt is impossible to determine whether the Tunic was made in Palestine -the Z twist was quite rare there, but such possibility cannot be excluded. Marion and Lucotte refer to R.  Pfister, report from 1934 about Palmyra textiles, suggesting that Z twist was common in Syria in that time.\n\n","date":"January 1, 2014 at 11:20 am","url":"https://shroudstory.com/2014/01/01/paper-chase-z-twist-again/","cat":"history","id":"comment-70848","author":"O.K.","site":"shroudstory"},{"title":"Paper Chase:  Z Twist Again","post":"?Late Ottoman – so nineteenth or early twentieth century AD?\n\n","date":"January 1, 2014 at 10:46 am","url":"https://shroudstory.com/2014/01/01/paper-chase-z-twist-again/","cat":"history","id":"comment-70842","author":"Charles Freeman","site":"shroudstory"},{"title":"Paper Chase:  Z Twist Again","post":"The day after I’ve published a link to the HA paper, Di Lazzaro spots this article. What a coincidence! A miracle, I’d say. Di Lazzaro would rather quote his REAL source, since his IP is recorded in my website stats. By the way: the linen is from the late Ottoman period. But I fear he didn’t understand what it meant.\n\n","date":"January 1, 2014 at 10:47 am","url":"https://shroudstory.com/2014/01/01/paper-chase-z-twist-again/","cat":"history","id":"comment-70844","author":"lombatti","site":"shroudstory"},{"title":"Paper Chase:  Z Twist Again","post":"Do people really obsess with who spotted something first?  Do they really check log files and do the detective work of figuring out to whom an IP address belongs? I’m more interested in who was kind enough to pass along the link then in who was first. Yes, it was Ottoman and probably less significant. Actually, it reminds us about trade even before then. The Romans maintained over 60,000 miles of roads that ran from Gaul and Spain all the way to Persia. Across those road traveled spices, dried foods, grains, olive oil, wool, cotton, leather, wood and leather goods, dyes, live animals, human slaves: going to and fro between major cities. Jerusalem was one such city with a population near 50,000 to 80,000 people. All major cities had thriving markets where you could buy goods from all over the known world to support necessities of life and unique cultural lifestyles, as well. One would surely find linen goods, too, for bedclothes, table coverings, draperies and clothing, maybe even for burial shrouds. Now it wasn’t like Amazon.com but it is still likely, I’m just guessing, of course, that at sometime, someone, in Jerusalem sold some z-spun linen from somewhere. It is classic black swan thinking and I know some skeptics don’t like to ponder such possibilities. But then again, there are black swans in this world. Are you tracking my IP address, as well? Happy New Year.\n\n","date":"January 1, 2014 at 11:35 am","url":"https://shroudstory.com/2014/01/01/paper-chase-z-twist-again/","cat":"history","id":"comment-70851","author":"Dan","site":"shroudstory"},{"title":"Paper Chase:  Z Twist Again","post":"Do you really think that reading news on my website and reporting them to you as if Di Lazzaro has ever read once in his life HA to be a honest action? It’s a matter of deontology. That’s all.\n\n","date":"January 1, 2014 at 12:27 pm","url":"https://shroudstory.com/2014/01/01/paper-chase-z-twist-again/","cat":"history","id":"comment-70855","author":"lombatti","site":"shroudstory"},{"title":"Paper Chase:  Z Twist Again","post":"Antonio, that’s fine. I’m really interested in skeptics and believers working together towards the truth. I think we achieve more with pens than swords. So let me say that I’m sure that everyone appreciates your effort in finding and reporting the link to HA.  On behalf of all of us, thank you.\n\n","date":"January 1, 2014 at 1:24 pm","url":"https://shroudstory.com/2014/01/01/paper-chase-z-twist-again/","cat":"history","id":"comment-70861","author":"Dan","site":"shroudstory"},{"title":"Paper Chase:  Z Twist Again","post":"Pollens on the Shroud demonstrate that it was at some time in Palestine, and exposed there during the months of March and April. Its known history suggests that it was not there after the first millenium. Consequently there has been a presumption that it was manufactured in the Middle East, most likely Syria. The 1934 source quoted by O.K. needs further investigation to ascertain if R Pfister was correct in asserting that Z twist was common in Palmyra, presumably in the first century. \nFlury-Lemburg is on record as asserting that nothing in the weave suggests that it could not have been made in Syria. \nHowever there are also specifically Mediterranean and French pollens.  It has been assumed that these accumulated post-1355, because of its known history there.  Might it have been much earlier? I suspect that C-14 testing has not yet advanced to the stage whereby small grains such as pollen dust can be reliably dated. \nIt is known that Z-twist textiles were recovered at Masada, whether they were manufactured locally, or imported, so Z-twist was at least not utterly unknown there. \nDo we need to consider the possibility that the linen of the TS was manufactured in Northern Europe, perhaps acquired by a Roman centurion, and subsequently taken to Palestine. Joseph of Aramathea is said to have purchased a new shroud, so it could hardly have been acquired during the Gallic wars of 58-50BC, some 80 years previously. But there may well have been Roman garrisons stationed in Gaul during the early 1st century. \nThe Silk Road to Samarkand can likely be discounted, because as far as I’m aware, there are no known oriental pollens. \nJust thinking outside the square!  The Palestinian pollens are too significant to be discounted.  It was there!\n\n","date":"January 1, 2014 at 3:25 pm","url":"https://shroudstory.com/2014/01/01/paper-chase-z-twist-again/","cat":"history","id":"comment-70875","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase:  Z Twist Again","post":"To Daveb of Wellington\nMy sincere congratulations on your  always excellent comments.\nYou wrote «…I suspect that C-14 testing has not yet advanced to the stage whereby smallgrains such as pollen dust can be reliably dated.»\nI suggest you to read the interesting proposal of Dr. Stephen Jones http://www.shroud.com/pdfs/n66part6.pdf\n                                                                         regards\n                                                        Antero de Frias Moreira\n(                                           Centro Português de Sindonologia)\n\n","date":"January 2, 2014 at 7:58 am","url":"https://shroudstory.com/2014/01/01/paper-chase-z-twist-again/","cat":"history","id":"comment-71082","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Paper Chase:  Z Twist Again","post":"The controversy regarding pollen grains has still not been resolved, everything is at a standstill. Professor T. Litt contested the findings of Uri Baruch, and Professor Avinoam Danin defended the latter, also saying that the German scientist had not handled the grains as he should have done.\nMy suggestion, given on this blog some months ago, is that there should be a comparison between what U. Baruch found, what is still in the hands of Dr. Alan Whanger and what was vacuumed off the Shroud during the restoration work.\n\n","date":"January 2, 2014 at 9:35 am","url":"https://shroudstory.com/2014/01/01/paper-chase-z-twist-again/","cat":"history","id":"comment-71116","author":"Louis","site":"shroudstory"},{"title":"Paper Chase:  Z Twist Again","post":"Antero, Thank you for your kind comments. I had not been aware that C-14 testing of pollen grains is indeed quite feasible using AMS method.  That is a most interesting and well-thought out paper, certainly one of the better contributions I have read from Stephen Jones. Problem is clearly one of cost and funding the experiments, which apparently can quickly spiral out of control. Agreement to destructive testing from present owners of the pollen grain samples would obviously be necessary. Testing of selected northern European samples, might reveal if the source of the linen could have been there. \nRe status of pollen grain samples: The Frei sampling has proper integrity.  Prof. Litt considered Barruch’s work unsafe as he had not removed the samples from the tapes, whereupon Danin disowned the 1999 paper. Ian Wilson’s 2010 book tabulates a comprehensive list from one published posthumously on Frei’s behalf by Prof Heinrich Pfeiffer. \nNo. of site-specific varieties listed by Pfeiffer, as tabulated by Wilson: Dead Sea – 8; Jerusalem environs – 6; Anatolia & southern Israel -8; Desert & semi-desert – 9; Western Europe & Mediterranean – 19.\n\n","date":"January 2, 2014 at 3:25 pm","url":"https://shroudstory.com/2014/01/01/paper-chase-z-twist-again/","cat":"history","id":"comment-71233","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase:  Z Twist Again","post":"There’s more to Uri Baruch’s work than that. In an appendix to “Floristic Indicators for the Origin of the Shroud of Turin,” he appears to have examined the slides that Frei himself had made, for examination, in the manner described in his Shroud Spectrum article, after extracting individual grains of pollen from the tapes. They are listed as MS01, MS02, etc., not as 6b/d or 4c/a, and are labelled with the specific pollen type Frei claimed to have identified. I think disowning Baruch was a convenient way of getting rid of the embarrassing over-specificity of Frei’s original identification. Litt’s identifications, or lack of, have never been published, except for his re-identifying the Gundelia as Carduus. Although Carduus thistles of one kind or another are found almost globally, one specific Israeli species (C. argentatus) was immediately assumed to have been the source of all the “Gundelia” pollen on the notorious Slide 6b/d. It’s possible, it’s convenient, but it’s not science.\n\n","date":"January 2, 2014 at 4:28 pm","url":"https://shroudstory.com/2014/01/01/paper-chase-z-twist-again/","cat":"history","id":"comment-71253","author":"Hugh Farey","site":"shroudstory"},{"title":"Paper Chase:  Z Twist Again","post":"Carduus argentatus is not listed in Pfeiffer’s table. Thistle – C. personata Jacq. is one variety of 19, in List 1 specific to Western Europe and Mediterranean. Gundelia tournefortii L. is one of 8 varieties listed as specific to salty environments, particularly the Dead Sea. Is that Science??!!\n\n","date":"January 2, 2014 at 4:56 pm","url":"https://shroudstory.com/2014/01/01/paper-chase-z-twist-again/","cat":"history","id":"comment-71265","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase:  Z Twist Again","post":"All Pfeiffer did was to list Frei’s 58 plant types (56 species and 2 genera) in a slightly different way. He did not examine the original tapes or slides. Frei identified Carduus personata (found all over the place), but not Carduus argentata (found around the Mediterranean). Litt considered that Frei’s Gundelia tournefortii (exclusively Middle Eastern) was in fact Carduus sp. (found everywhere). Of the 8 species that Pfeiffer says are specific to the Dead Sea, at least half are insect pollinated and could not have had their pollen blown  onto a cloth in in Jerusalem (or anywhere else). Nor would their flowers have been easy to collect on the afternoon of Jesus’s death. The first one, Athaea officinalis, or Marshmallow, is not specific to the Dead Sea, is insect pollinated, and does not flower until August. Curious.\n\n","date":"January 2, 2014 at 7:02 pm","url":"https://shroudstory.com/2014/01/01/paper-chase-z-twist-again/","cat":"history","id":"comment-71307","author":"Hugh Farey","site":"shroudstory"},{"title":"Paper Chase:  Z Twist Again","post":"Knowing your passion for dissent, I’m a little surprised at your omission of the NZ kowhai and manuka, the Australian jacaranda and the Chinese lotus blossom.\n\n","date":"January 2, 2014 at 11:01 pm","url":"https://shroudstory.com/2014/01/01/paper-chase-z-twist-again/","cat":"history","id":"comment-71362","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase:  Z Twist Again","post":"There is one incorrect statement being repeated above. Professor Avinoam Danin never disowned Uri Baruch, on the contrary he thinks highly of the Israeli technology Baruch used. From what he said it can be gauged that he felt Professor T. Litt had not handled the pollen grains correctly, as can can be seen in the last two paragraphs of article no. 7, “Shroud Studies bring Good News” in the link:\nhttp://newvistas.homestead.com/MediaRePatch.html\nIf it is so easy to date the Shroud using  C14 on the pollen grains it would have been in Turin’s agenda, but that is not the case. It is just one indicator and, as things stand, nothing can be said with certainty, as Ian Wilson admits in his book. That is why the suggestion was: bring together what Uri Baruch examined, what is still with Dr. Alan Whanger and what was vacuumed off the Shroud during the restoration work.\n\n","date":"January 2, 2014 at 5:13 pm","url":"https://shroudstory.com/2014/01/01/paper-chase-z-twist-again/","cat":"history","id":"comment-71272","author":"Louis","site":"shroudstory"},{"title":"Paper Chase:  Z Twist Again","post":"Can we compare the Shroud with other linens of known ages to see if it’s pollen load is consistent with an older linen or more modern one? Do most medieval linen have 58 plant types represented?What density per inch on the linen itself?\n\n","date":"January 2, 2014 at 10:51 pm","url":"https://shroudstory.com/2014/01/01/paper-chase-z-twist-again/","cat":"history","id":"comment-71359","author":"David Goulet","site":"shroudstory"},{"title":"Paper Chase:  Z Twist Again","post":"Hugh Farey and David Goulet have raised very good points in the above discussion, which will put to rest any call for carbon dating of the pollen on the Shroud.\n\n","date":"January 3, 2014 at 9:04 am","url":"https://shroudstory.com/2014/01/01/paper-chase-z-twist-again/","cat":"history","id":"comment-71580","author":"Louis","site":"shroudstory"}]
