[{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"Dan(iel Scavone) wrote: “I hope to have shown that the Besançon hypothesis is the only one that truly fills the chronological void commonly called “the missing years” of the\nhistory of the Shroud of Turin.”\nDespite my deep respect for Dan(iel Scavone), I totally disagree with him: the Templar hypothesis IS ACTUALLY the only one to truly fills the chronological void and I can easily prove it. Will you, Dan (Porter) PUBLISH  a couple of images that just prove the exact opposite of Dan(iel Scavone)’s thesis if I send them? I already sent you, Dan (porter) the Shroud image of the Grail chalice  of Christ blood and you just ignored it. Nearly a month ago, I also sent the 6 first pages of my Torun paper which prove how wrong you were about the coin-on-eye issue. You havent published them. \nShall I understand you are not in a very great haste to publish on your blog  what just contradicts your opinion about the Shroud…\n\n","date":"December 30, 2011 at 4:09 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6311","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"That is a paper committed to a conference proceeding. And what you have sent me is partial. Does it for instance include your bibliography?  When I get a release from the conference and a complete paper I will publish it. All you do on this site is state things, often with extraordinary amounts of all uppercase shouting, that you never substantiate. \nWill I publish two images that disprove Scavone. Sure. Send them. Be sure to provide an explanation of why and how the prove Scavone wrong. I must have an explanation before I’ll publish pictures.\n\n","date":"December 30, 2011 at 5:32 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6316","author":"episcopalian","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"For iinstance, the Shroud image of the Grail chalice of Christ blood I sent you,DOES SPEAK (or shout, if you prefer) for itself. Do you really need an explanation? Dan?\n\n","date":"December 30, 2011 at 7:36 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6319","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"If I am wrong, your blog viewers will just see how wrong I am. What are you afraid of, Dan?\n\n","date":"December 30, 2011 at 4:37 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6313","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"I don’t know what drum Mr. Hamon is beating but if it’s the Templars what the about the Cathars? Don’t forget them :)\nThe Templars, like DaVinci,  are “usual suspects” of history. Cf Holy Blood, Holy Grail and Dan Brown. If someone has two pictures that prove the Templar theory, times awaisting. Let’s see them and explain how they prove the Templars had it. Oh, by the way, did anybody note the evidence that the Templars were not an official presence at the sacking of Constantinople although there may have been a handful  free booting Templars there, does anyone know their names?. The Fourth Crusade wasn’t their show. Not every French knight was a Templar.\n\n","date":"December 30, 2011 at 7:18 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6318","author":"John Klotz","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"Excellent comment.  Read my post below…  This Templar thing doesn’t rely on a solid documentary base.  It’s all extrapolations, suppositions, speculations, etc.  Ian Wilson seem to be a master in the art of speculation and a lot of pro-authenticity people believe blindly in what he wrote !\nJoseph Goebbels (Propaganda Minister for Hitler) was right when he said : “The bigger the lie, the more it will be believed.”\nTo me, Wilson is a master in the art of propaganda and his talent was so big that he sold a big bunch of books about the Shroud…\n\n","date":"December 30, 2011 at 7:48 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6322","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"I mean archaeology not fiction, John.\n\n","date":"December 30, 2011 at 7:38 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6320","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"Personally, I think the most “solid” hypothesis that exist today is the one Scavone prefer, i.e. the one of Othon de la Roche, simply because it has some solid documentary bases, on the contrary of the Templar hypothesis who only used extrapolations, suppositions, speculations, etc.  I always tend to prefer the hypothesis that gets the most solid factual base. \nBut, at the same time, I completely disagree with Scavone about the Mandylion hypothesis.  He defend the ideas of Ian Wilson almost blindly.  The best proof of that can be found here : http://www.shroudstory.com/scavone/scavone1.htm\nBut after I’ve made a deep study of the documentary sources (for an upcoming article I’m currently co-writing with a frenchman for his website dedicate to the Shroud), I came up to the conclusion that this hypothesis got so much problems attach to it that the chances for it to be true are VERY LOW, nevermind what most of the “pro-authenticity” historians and pro-authentiticy people in general think.\nIn fact, you know what I really think ?  I think all we can say with some good probability is that the Shroud was probably in Constantinople at least from the end of the 11th century and maybe the 10th century.  Before that ?  Very good question.  In the present state of our historical knowledge, I really believe this question is left wide open and personally, I wouldn’t feel confortable to propose one single hypothesis that could answer it properly.  I think nobody can.  I fact, for the moment, all we’re left with is extrapolations, suppositions, speculations, etc.  In science (whatever the field), when you rely on things like that, you walk in a VERY dangerous territory !  Unfortunatelly, Wilson have used plenty of those extrapolations, suppositions, speculations to build his Mandylion hypothesis and almost everybody in the Shroud world (all pro-authenticity) have believe him !  I just remember people that it is NOT the same at all when you walk outside the pro-authenticity circle of the Shroud where a bunch of historians have been really critical about this hypothesis…  After having said that, I just want to clearly state that it doesn’t mean that the Shroud is not authentic.  It mean that his ancient history is all but clear !  In fact, the most prudent thing is to say that it is still unknown…\nI wrote all this about the Mandylion because I want to make a parallel betweem Wilson hypothesis and the ENEA’s experiments and results.  For me, it’s kind of the same thing…  When a pro-authenticity news come in the media, many pro-authenticity people seem to put aside their critical sense to believe in it right of the bat…  It was (and still is) like that for many people regarding Wilson hypothesis, and I have a sense it is also like that regarding the ENEA news…  That’s my perception.\n\n","date":"December 30, 2011 at 7:39 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6321","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"Dan you wrote: “All you do on this site is state things, often with extraordinary amounts of all uppercase shouting, that you never substantiate”. The six pages of my Torun paper maKe it quite clear that your opinion on the coin-on-eye issue is totally biased… I sent you “substance” but you just keep not publishing it!\n\n","date":"December 30, 2011 at 7:58 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6323","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"Max, if the door is closed here, just propose it elsewhere !  There’s a lot of Shroud websites out there…\n\n","date":"December 30, 2011 at 8:02 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6324","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"Although Ian Wilson is more a Journalist than an historian and I very often disagree with him,  what I have discovered about the “Baphomet” does confirm his Mandylion hypothesis.\n\n","date":"December 30, 2011 at 8:17 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6325","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"You are quite right Yannick.\n\n","date":"December 30, 2011 at 8:18 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6327","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"On what ???  Reading your other post I thought you think I was wrong ! ;-)\n\n","date":"December 30, 2011 at 8:19 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6329","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"Max, you’re free to believe Ian Wilson my friend (as most of the pro-authenticity people do anyway)…  I’m not surprise at all.\n\n","date":"December 30, 2011 at 8:19 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6328","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"I just thought Dan and the blogviewers wanted to know more about the Turin Shroud enigma. I was wrong. In your eyes “the best comments” on this blogs are only those which confirm the blog consensus. The lesson here is clear: just dont go against the consensus. (a ready-to-think for Christian sceptics).\n\n","date":"December 30, 2011 at 8:26 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6331","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"I dont believe Ian Wilson. I made an iconographic and philological discovery that confirms his hypothesis. I check facts by myself. Do you/can you check facts by yourself Yannick? You are just reading about it….\n\n","date":"December 30, 2011 at 8:32 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6334","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"Well, in fact Scavone also supports a link between the Shroud, king Abgar, Edesa and……the Holy Grial\nhttp:/www.acheiropoietos.info/proceedings/PianaMYHSWeb.pdf\n\n","date":"December 30, 2011 at 8:35 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6335","author":"Gabriel","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"I know that and to me, that says ALOT about the bias he have regarding the topic of the ancient history of the Shroud…  This thing about the Grail is another PERFECT example of the extend use of extrapolations, suppositions, speculations, etc. in a work that his supposed to be scientific.  Also, it is another example of what I call “The Da Vinci Code Syndrom”, and the Templar thing for the history of the Shroud between 1204 and 1350 fits also in the same category.  Those guys (Scavone and Wilson) knows full well that when they use those kind of “mysterious” or “exotic” things (the grail, the knight templars, etc.), there will be more people to listen to them !  Never forget the truth that Joseph Goebbels once said…  The bigger the lie…\n\n","date":"December 30, 2011 at 8:51 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6338","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"Yannick, what do you really know about Templar or Grail Archaeology? I made a lecture on the Templar graffiti in Loches (France). Actually I am writing a book on them. The Templars Knights did know about the Shroud.\n\n","date":"December 30, 2011 at 9:04 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6341","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"Surely they knew about it.  I don’t question this aspect.  But there’s a big difference between knowing the existence of a relic and possessing it !\n\n","date":"December 30, 2011 at 9:10 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6343","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"They actually possed it and venerated it. Suffice to reread their written testimonies (see their two trials) and proceed to the archaeocryptology/archeoperception of their apparently contradictory descriptions of “the head in figuram baffometti”. .\n\n","date":"December 30, 2011 at 9:28 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6350","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"Max, did you knew the vast majority of those testimonies didn’t talked about a linen cloth at all but a wooden head or something similar ?  I’m not an expert like you but at least I know the vast majority of the testimonies we have (taken under torture, don’t forget this aspect) didn’t point out to the Shroud one bit…\n\n","date":"December 30, 2011 at 9:32 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6353","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"That is where precisely the archaeoperception comes in.\n\n","date":"December 30, 2011 at 9:48 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6355","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"Each templar who told about the Head described it according to his own level of education and perception which accounts for the different aspects or shapes the same object seem to take up.\n\n","date":"December 30, 2011 at 9:53 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6356","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"Don’t worry my friend !  I’m a free thinker…  Just ask my friend Barrie Schwortz !  He know me enough now that he will confirm this to you ! ;-)  Sincerely, I think thinking by yourself is dawm important regarding the subject of the Shroud because there’s so much garbage out there that the general public is often fooled by those lies.  And what is really tough to make up your mind precisely is this :  it seem that for every hypothesis about one particular aspect of the Shroud, there is another hypothesis that said exactly the opposite !!!  I think it has greatly to do with the polemic nature of the subject…\n\n","date":"December 30, 2011 at 8:39 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6336","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"Sorry, the previous link was wrong. Scavone’ s link between Grail and Shroud can be found in the next link\nhttp://www.acheiropoietos.info/proceedings/ScavoneGrailWeb.pdf\n\n","date":"December 30, 2011 at 8:42 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6337","author":"Gabriel","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"I dont defend the Mandyliuon hypothesis blindly as you wrongly.suggest, Yannick.\n\n","date":"December 30, 2011 at 8:53 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6339","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"I was talking generally for the Shroud world.  I wasn’t refering to you personally.\n\n","date":"December 30, 2011 at 8:58 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6340","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"How strange Christian sceptics have an opinion about the Grail or the Templars in conjunction with the Turin Shroud WHILE TOTALLY IGNORING  the Grail and Templar archaeology, iconography (graffiti included), philology and literature!\n\n","date":"December 30, 2011 at 9:18 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6347","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"Then, please show me a real strong and solid ancien source (I’m not talking about an extrapolation, a supposition or a view of the mind here) that tells the Templar really possessed the Shroud and show me a real and solid ancien source (again, not just a supposition) that tells the Grail had something to do at all with the Shroud of Turin or even the Mandylion !\n\n","date":"December 30, 2011 at 9:22 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6349","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"For instance, I already sent Dan the Shroud image (or likeness) of the Grail Chalice of Christ Blood. Too bad Dan iust censored it…. Anyway you can see the positive optical illusion by yourself: the chalice-like shape is right in the Shroud face vertical axis seen upside down. This is just one of the archaeoperceptive shapes that can take up the Grail…  It is not unlike a vision (as the Shroud image does “behave” like an oversized Rorschach). This is an archaeoperceptive fact! The Shroud image is of the stuff  that the medieval grail scenes are made of.\n\n","date":"December 30, 2011 at 9:39 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6354","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"Actually a Templar named Sabatier did talk about a long piece of linen cloth he venerated.\n\n","date":"December 30, 2011 at 10:13 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6357","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"I will send the iconic proof the “Baphomet” is the Turin Shroud-Mandylion ONLY IF Dan publishes the Shroud image of the Grail chalice of Christ blood I already sent him. If the blogdoor is still closed, I will leave for another website (so that Dan could breathe more at ease and safeguard the blog consensus).\n\n","date":"December 30, 2011 at 10:22 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6358","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"If it really was the Shroud of christ that was venerated by the Knight Templars and if some of their member really admit it, then WHY IN THE WORLD WOULD THEY HAD BEEN DECLARED HERETICS ???  In fact, I think there was only 2 of them who talk vaguely about something that could be taken as an image on a cloth…  If they really venerated a Christian relic of the Passion of Christ, then why they were all executed has heretics ?  Makes no sense at all Max.  Please, try to find something else…\n\n","date":"December 30, 2011 at 10:29 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6359","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"Yannick, it makes sense if you ‘consider’ that the King of France wanted it so, that is to eliminate the Templars. It is a well known fact that he was hugely in debt to them and lets’ say jealous and wanting of their wealth and power! …Enough reason right there I would think. As for the templars descriptions given during the trials; Anyone think they may have ‘sworn an oath’ to not reveal it’s true identity? Therefore all the vague descriptions? If they confessed to possessing such a relic, undoubtably the King or even the Church would have demanded possession of such.\nAs for the Templars and the Shroud, I personally am still undecided on whether they ‘possessed’ or just ‘knew’ and venerated it. I wouldn’t be so hard on Ian Wilson as he was going on the Friel’s supposed ‘find’, but as since recanted those ideas in a recent paper. I also believe Wilson’s argument for the Mandylion/Shroud theory does carry alot of weight and is backed by alot evidence; pictorially and literally.\nBut as for the Templars, which I think is the main topic here, although it has been mentioned they had little or no part in the Constantinople sacking, which is probably correct; IT has been deduced that the Shroud was taken to Athens afterwards. From there it would have most probably be taken to Bescanon, but by whom? Remember the Templars were the ‘Fedex’ of the time, santioned by the Church for such duty and in most probability could, or would have been commissioned in the safe delivery of the Shroud and other ‘trophys’. Therefore ‘likely’ they ‘knew’ of it’s existence. Other then that there is very weak evidence to the fact they possessed it, but slight evidence that they knew of or could have temporarily possessed it, “in holding’ for a period and venerated it…..This being my CONJECTURE from my readings and study of course.\nR\n\n","date":"December 31, 2011 at 9:17 am","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6371","author":"Ron","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"The templar hypothesis, like the Mandylion can be considered “sexy” or “attractive” but the reality is that they are FULL of speculations, extrapolations, etc.  The hypothesis of Othon de la Roche is quite less sexy I know.  But at least, it is based on some textual evidences, even if some of them have been put into doubt.  But in the end, this hypothesis seem to be more logical in the context of the 1204 sack of Constantinople.\nAnd now, for the Mandylion hypothesis, I would really loved to see the pictural evidence you talk about Ron !!!  Don’t you know that there’s NO, I repeat NO artistic copies of the Mandylion that show Christ face has a dead, beaten man, full of blood stains like we see on the Shroud !  A copy like that simply doesn’t exist my friend.  As I said, I’ve just completed a long review of many historians articles or books (like Scavone, Poulle in France and Guscin) on the subject and came to the conclusion that this hypothesis look like a castle of cards since there’s so much problems attach to it !  As I say :  when you really know every ancient sources relate to this subject, one need a great deal of FAITH to still believe this hypothesis is correct.  In fact, during my research, I’ve came up with 11 importan problems relate to it !  ELEVEN !  Not just one or two, ELEVEN ! \nOf course, in the pro-Shroud circle, all we ear is the good side of the medal and we never heard about all those problems relate to this hypothesis…  I repeat :  it’s like a castle of cards to me because of it’s great fragility.  Just an example :  in MANY lists of relics written by eye-witnesses who visited Constantinople from the end of the 11th century until 1204, we can read, in the same list, a mention of a shroud of Christ AND a mention of the Mandylion !  The only way Wilson and his supporters have been able to deal with this “contradiction” was to make believe that the Mandylion mentionned in those list is a simple copy of the original to perpetuate the Abgar legend and the Shroud mention there is in fact, the authentic Mandylion now unfold !  And what is highly important to note here is the FACT that Wilson and others based this SPECULATIVE idea (that seem to be there only to defend this hypothesis) is NOT BASED at all a reliable documentary source.  NOT A SINGLE ONE !  WE GOT HERE ANOTHER PERFECT EXAMPLE OF PURE SPECULATION BRING ON IN ORDER TO DEFEND A WEAK HYPOTHESIS.  \nIf we use Occam razor to analyse the presence of those numerous lists of relics, the simplest conclusion we can draw from those lists is that, from the end of the 11th century (at least) until 1204, there was a Shroud of Christ in Constantinople, ALONG with the Mandylion !\nIn the end, what I’m disgust with is not Ian Wilson personally (he’s free to sell what he wants and I’m free to disagree with his ideas) but it’s more the non critical mind of a lot of people in the Pro-Shroud world that REALLY bugs me !  Those people seem to consider this “weak” hypothesis (from my perspective and my researches) as it was a well accepted scientific theory !  As I said, outside the Pro-Shroud world, it is FAR from being true !  But nevertheless, everytime I heard an interview about the Shroud or a TV documentary, they always talk about this hypothesis as if it was a well accepted theory that is surely correct…  That’s what bugs me a lot !  Many Pro-Shroud people wants so much the Shroud to be confirmed as the authentic burial cloth of Christ that they put aside their critical judgement when it comes to those kind of Pro-Shroud hypothesis…  The same critical judgement they used when it comes to anti-Shroud hypothesis and ideas !  It’s sad but it’s true !\nI say to those people :  please, before thinking an hypothesis is good, read A LOT on the subject.  Go to the sources !  Often, those hypothesis are mainly based on speculations, extrapolations, assumptions, view of the mind, etc.  Not so great for a supposed “scientific” hypothesis…\n\n","date":"December 31, 2011 at 8:05 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6387","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"I just note one mispelling I’ve made in one important paragraph.  So here it is again : \nOf course, in the pro-Shroud circle, all we ear is the good side of the medal and we never heard about all those problems relate to this hypothesis… I repeat : it’s like a castle of cards to me because of it’s great fragility. Just an example : in MANY lists of relics written by eye-witnesses who visited Constantinople from the end of the 11th century until 1204, we can read, in the same list, a mention of a shroud of Christ AND a mention of the Mandylion ! The only way Wilson and his supporters have been able to deal with this “contradiction” was to make believe that the Mandylion mentionned in those list is a simple copy of the original to perpetuate the Abgar legend and the Shroud mention there is in fact, the authentic Mandylion now unfold ! And what is highly important to note here is the FACT that this idea proposed by Wilson and others (that seem to be there only to defend this hypothesis) is NOT BASED at all on a reliable documentary source. NOT A SINGLE ONE ! WE GOT HERE Of course, in the pro-Shroud circle, all we ear is the good side of the medal and we never heard about all those problems relate to this hypothesis… I repeat : it’s like a castle of cards to me because of it’s great fragility. Just an example : in MANY lists of relics written by eye-witnesses who visited Constantinople from the end of the 11th century until 1204, we can read, in the same list, a mention of a shroud of Christ AND a mention of the Mandylion ! The only way Wilson and his supporters have been able to deal with this “contradiction” was to make believe that the Mandylion mentionned in those list is a simple copy of the original to perpetuate the Abgar legend and the Shroud mention there is in fact, the authentic Mandylion now unfold ! And what is highly important to note here is the FACT that Wilson and others based this SPECULATIVE idea (that seem to be there only to defend this hypothesis) is NOT BASED at all a reliable documentary source. NOT A SINGLE ONE ! WE GOT HERE ANOTHER PERFECT EXAMPLE OF A PURE SPECULATION THAT WAS IMAGINED IN ORDER TO DEFEND A WEAK HYPOTHESIS.\n\n","date":"December 31, 2011 at 8:39 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6390","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"Typo correction name should read as; Frale.\n\n","date":"January 1, 2012 at 1:29 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6418","author":"Ron","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"It only makes no sense for someone BOTH TOTALLY IGNORANT of The TEMPLAR HISTORY and of THE REIGN OF PHILIP THE FAIR (I do think my “uppercase shouting” is here most appropriate, Dan)..\n\n","date":"December 30, 2011 at 10:55 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6360","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"Yannick, you are so naive…\n\n","date":"December 30, 2011 at 11:06 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6361","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"…or else you are too much in love with your pseudo-knowledege.\n\n","date":"December 30, 2011 at 11:13 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6362","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"\nYannick Clément :I just note one mispelling I’ve made in one important paragraph. So here it is again :\nOf course, in the pro-Shroud circle, all we ear is the good side of the medal and we never heard about all those problems relate to this hypothesis… I repeat : it’s like a castle of cards to me because of it’s great fragility. Just an example : in MANY lists of relics written by eye-witnesses who visited Constantinople from the end of the 11th century until 1204, we can read, in the same list, a mention of a shroud of Christ AND a mention of the Mandylion ! The only way Wilson and his supporters have been able to deal with this “contradiction” was to make believe that the Mandylion mentionned in those list is a simple copy of the original to perpetuate the Abgar legend and the Shroud mention there is in fact, the authentic Mandylion now unfold ! And what is highly important to note here is the FACT that this idea proposed by Wilson and others (that seem to be there only to defend this hypothesis) is NOT BASED at all on a reliable documentary source. NOT A SINGLE ONE ! WE GOT HERE Of course, in the pro-Shroud circle, all we ear is the good side of the medal and we never heard about all those problems relate to this hypothesis… I repeat : it’s like a castle of cards to me because of it’s great fragility. Just an example : in MANY lists of relics written by eye-witnesses who visited Constantinople from the end of the 11th century until 1204, we can read, in the same list, a mention of a shroud of Christ AND a mention of the Mandylion ! The only way Wilson and his supporters have been able to deal with this “contradiction” was to make believe that the Mandylion mentionned in those list is a simple copy of the original to perpetuate the Abgar legend and the Shroud mention there is in fact, the authentic Mandylion now unfold ! And what is highly important to note here is the FACT that Wilson and others based this SPECULATIVE idea (that seem to be there only to defend this hypothesis) is NOT BASED at all a reliable documentary source. NOT A SINGLE ONE ! WE GOT HERE ANOTHER PERFECT EXAMPLE OF A PURE SPECULATION THAT WAS IMAGINED IN ORDER TO DEFEND A WEAK HYPOTHESIS.\nI’d like to see these 11 important problems Yannick, in simple (point form) please. No drawn out interpretations.\nYou mention several “lists” which place the Mandylion and Shroud in Constantinople at the same time!! Lets see them so we can scrutinize them here….Even if it is true, I can think of several reasons, these lists, or more accurately the people whom had written them could have been wrong or misguided…not so simple.\nYou mention there is no paintings of the Mandylion showing Christ’s blood or suffering,…SO WHAT? What does this prove? Do any paintings show such, seriously Yannick. The Mandylion would have shown ‘Only the Face’, I have seen very few paintings, if any, depicting his facial wounds. Your point is useless.\nOh by the way the points I mentioned above about the the KING and Templars are facts, not a made up “sexy’ story.\nR\n\n","date":"January 1, 2012 at 2:04 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6420","author":"Ron","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"No painting show the Mandylion as a face like we see on the Shroud and you think it’s irrelevant ?  Really ?  Ron, I can’t believe you think that way.  It prove to me that YOU WANT this hypothesis to be true !  It’s a little bias I can see in your comment.  Sorry.\nSincerelly, take just the photo of the image of the Shroud face.  Look at it closely and tell me that no ancient artist of writer would have tell something about the “burial” aspect of this image in his work !?!  Seriously, you believe that ???  The ancient, contrary to what many people think, were not so dumb my friend !  If the Mandylion was a real burial cloth, i.e. the Shroud folded in 8, that show the face region only, you can bet your house that there would have been some clear artistic representation of the blood stains and some clear mention of this aspect of the relic in ancient documents.  The fact is :  there’s no CLEAR mention of it nowhere. 0.  Nada.  That don’t tell you something ?  And nowhere at all, in any ancient document, there is a direct allusion of the Mandylion as a BURIAL cloth.  No direct allusion at all that talk about that.  There is even no evasive allusion that could be interpret that way.\nAnd you can believe me when I say that there was many lists of relics that talk about a cloth with a facial image of Christ AND a burial shroud (often mention along other burial cloths – possibly strips of linen that would have come from the empty tomb along with the Shroud).  The most important mention like that (because of it’s clarity) is the testimony of Robert de Clari (a french knight of the 4th crusade that took part in the sacking of the city in 1204).  One year before the sack, in 1203, this guy saw the Shroud of Christ (with an image of the whole body on it) that was exposed every friday in the church of Our Lady of Blachernes (he most probably saw the Shroud of Turin) and, in the church of the Virgin of the Pharos (where the majority of Christ relics were normally kept), he saw a linen cloth with a tile (clearly the Mandylion because the tile that he mentionned was often directly related to the Mandylion in many versions of the Abgar legend).  This tile was named “the Keramion” (ancient greek term that can mean a vessel or something similar) in the Abgar legend.  \nAlso, did you know that, in 1247, saint Louis, the great kind of France, complete a deal with the Latin emperor of Constantinople, Beaudoin II (another frenchman) for the selling of 22 relics (mostly directly related to Christ) ?  It’s another very important part of the puzzle !  In the official listing of the relics include in this great deal (the emperor was in need of money in order to keep on his war against the Greek and the Bulgars), there is a direct mention of the 2 relics (the linen cloth with the tile) that Robert de Clari said he had seen in the church of the Virgin of the Pharos in 1203.  It’s almost sure that this pair of relics that was bought by saint Louis is the same that de Clari had seen 44 years earlier in Constantinople, and it’s almost sure that this was the Mandylion, along with his tile.  As I said, there’s no other relics of Christ that was ever associate with a tile.  So, there’s a very great probability that this duo cloth-tile was in fact the Mandylion along with the Keramion.  If it is so (the probability is very good), then we can be sure that the Shroud was a different relic than the Mandylion because, during the time this duo of relics (Mandylion-Keramion) was in the Sainte-Chapelle in Paris (from 1247 until 1789), we know for a fact that the Shroud of Turin was kept elsewhere.  Unfortunatelly, this duo of relics was lost during the french revolution of 1789 and we will never be 100% sure about the fact that it really was the Mandylion and the Keramion but the chances are VERY GOOD.  \nAgain, using Occam razor in this case, it is more likely that this tandem of relics was really the Mandylion and the Keramion and not mere copies of originals.   Why we can be so confident about that ?  Because of the testimony of Robert de Clari that I told you about, and also, because saint Louis paid a very high price for those relics in 1247.  In fact, he even pay them twice !  In 1242, he paid some sort of a rent.  And then in 1247, he finalized the deal with the emperor with another payment.  Also, before the first deal of 1242, he send some men of confidence to make sure that the relics he was about to bought were authentic.  In this historic context, it is VERY unlikely that saint Louis would have accepted to buy a false relic (a copy of the original) for a high amount of money.\nYou can read for yourself many interesting informations about saint Louis and his relics deal with the emperor of Constantinople here :  http://www.shroud.com/pdfs/n56part5.pdf\nThe author, Barta, like me, believe that this tandem of relics was really the Mandylion and the Keramion and, starting from there, if it’s true, then the Shroud cannot be the same relic as the Mandylion…  \nAll that is just a small amount of problems that the hypothesis of Ian Wilson has to face !  And to resolve those particular problems, all Wilson (and his followers) can do, is use speculations, suppositions, extrapolations, not based at all on a real and solid documentary source.  Sorry, but the few problems I just mentionned in this comment are based on true and reliable documentary sources…  It’s not a simple view of the mind !  It’s not something I just invent !  It’s something that is well written in many ancient document.\nMeditate on that.  Again, I want to state it clearly :  it’s not because there’s not a solid ancient history for the Shroud prior to the middle of the 10th century (in my opinion) that the Shroud true age is not 2000 years old.  There’s many possible explanation that can be logical to explain why there’s no solid documentary sources for the Shroud before 958.  So, don’t feel too upset if I’m right about the idea that the Mandylion hypothesis is probably incorrect.  That don’t mean at all that the Shroud is not genuine.\n\n","date":"January 1, 2012 at 11:46 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6444","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"I show no bias Yannick, unlike I can easily say about you on so many topics here…Diffusion vs. Light for one. As for the depiction of the face on the Mandylion; You originally, talked about any renditions not showing the blood or his suffering, not of the likeness, your changing the subject!…I’ll repeat; No paintings of the Mandylion, Shroud; show any suffering or blood wounds. (That I know of) Do you see any markings on any of the Pantocrator icons?…case closed.\nI would also disagree with you that some renditions of the Mandylion do not have similar traits to the face seen on the Shroud, this is definately untrue and you have to be near blind not to see them.\nAnother thing is you don’t think of the possible fact that hardly anyone would have seen the Mandylion, ‘UP CLOSE’, has it was “most probability” always kept in a chest. Only very few actually viewed it close up. So NO, people were not stupid back then , just they had very little CLOSE visual access.Close enough to discern certain details that is.\nRobert de Clari mentions no such ’tile’ you talk of Yannick, read his statement again.\nI’m not saying I don’t believe you on the “many lists” I’m just asking that you post them! So we all can scrutinize them. PLus you said earlier the Abgar legends and writings were irrelevant yet you use them here to back your point!\nI’m not even going to enter counterpoints to your King Louis paragraph, as you clearly make alot of assumptions and conjectures in there…especially in your third last paragraph.\nDon’t worry Yannick, I won’t get upset, but isn’t it a little premature or a little arrogant to say you are right, in your assumption?\nANd please I asked for point form ;-) …In other words keep it short and simple. It makes it hard to respond with long drawn out comments.\nThanks\nR\n\n","date":"January 2, 2012 at 4:01 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6478","author":"Ron","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"First, sorry for the lenght of my messages but since this topic is very complicated, it’s hard for me to do short comments.  \nFor my bias about the UV thing, it’s simple :  I follow the laws of nature and I’m fully aware that it’s impossible (in our universe at least) that a dead body can emit a powerful light like that !  ;-)  That’s it.  If keeping your feet on the ground and be rational can be considered as having a bias, then I have one and I’m proud of it !  That simply prove that I don’t fly high in the sky.  \nHere’s my point of view on this question :  I don’t believe it is scientifically “correct” or “fair” to look at supernatural hypothesis for image formation (like Fanti’s Corona Discharge or Di Lazzaro’s UV lasers) while science have not made a complete check-up of every possible natural hypothesis (done in every possible configurations and every possible set-up that we can imagine regarding a first century burial).  Why ?  Simply because a supernatural hypothesis is, by definition, not scientific in nature !  And the fact is that science has still a lot of work to do in order to test every possible natural possibilities.  Until that will be completely done (we’re not there yet), I just don’t see why we should even consider supernatural possibilities.  If the Shroud would be that of Julius Cesar, NOBODY would even think for a second that the body images on it have been produce by some flash of light !  And, by the way, Di Lazzaro and his team were not able to obtain a good result of coloration with a single instantaneous laser shot, did you knew that ?  This fact don’t fit very well with the Hollywood scenario of an instant flash of light coming from the body at the moment of resurrection ! :-)\nRon you wrote : “Do you see any markings on any of the Pantocrator icons?…case closed.”  I don’t see the connexion.  If the Mandylion and the Pantocrator are, like I think, copies from the Shroud, that don’t mean one second that the artist (or artists) who produced them wanted to do an exact replica of a dead Christ with a lot of blood stains !  In fact, we can see the opposite in the Pantocrator icon and we can supposed the opposite for the Mandylion (because of the copies we have today) :  it really seemed that this artist (or those artists) wanted to produce the image of a LIVING Christ !  And it’s the very same thing for some bearded Christ frescos we can see in some Roman catacombs.  That don’t mean the Shroud wasn’t the base for these artworks.  Ron, you seem to forget one MAJOR and MOST IMPORTANT fact here :  the period of time !  Effectively, before the 13th century, the mainstreem theological ideas didn’t fit well with a depiction of a suffering Christ full of blood and injuries.  In fact, almost every crucifix before the 13th century showed a Living and triumphant Christ on the cross (with no blood or really evident injuries) !  Even the depiction of Christ entombment contained in the Pray manuscript (that date from 1192 to 1195) doesn’t show Christ with blood or injuries !  It’s an historical fact that we have to wait until the 13th century before there was a real theological current that emphasized the suffering Christ and his Passion.  It was during that time that we saw the apparition of the way of the cross, of the Man of Sorrow icons, of bloody crucifix and things related to this (like the first stigmatized person : Francis of Assisi).  And I personally think that this new current that started in Europe and spread out elsewhere in Christendom was initiated by the fact that the many crusaders from the 4th crusade (like Robert de Clari) could saw the actual Shroud of Turin there and probably spread the word that the image was that of a suffering Christ.  This is just a personal feeling.  But one thing’s for sure :  during the 6th century, while the Mandylion and the Pantocrator first appeared in the east, the theological current was not at all in favor of a depiction of a dead and suffering Christ.  Today, we would say that it wasn’t “politically correct” during that period of time, not until the beginning of the 13th century, just when the Shroud disappeared from Constantinople.  I really think there’s a direct link here…  It seem that during these days, the focus was much more on the resurrected Christ of Eastern morning than on the suffering and dying Christ of the Good Friday.  So, in an historical context like that, IF the Pantocrator and the Mandylion were made by artists using the Shroud of Turin as a base for their artworks, it is totally understandable that they would have made the depiction of a LIVING CHRIST instead of a dead or suffering Christ.  When we deal with historic topics, we always have to put ourselve in the context of the time we study.\nYou also wrote : “I would also disagree with you that some renditions of the Mandylion do not have similar traits to the face seen on the Shroud, this is definately untrue and you have to be near blind not to see them.”  I don’t know where you took this idea my friend !  I NEVER wrote that !  In fact, here’s what I wrote in another post for another topic : “I think the Mandylion and the Pantocrator icons were all artistic works based on the real Shroud. I think it’s the most probable possibility to explain all the points of congruence we can see in the Pantocrators icons and also in the Mandylion copies we still have today.”  So you can see that the hypothesis I favored the most is that the Mandylion was a copy made directly from the Shroud but with one major difference :  the artist was doing a portrait of a Living Christ instead of a dead man (most probably because of the reason I just explain, i.e. because of the theological context of that time).\nQuote : “Robert de Clari mentions no such ’tile’ you talk of Yannick, read his statement again.”  Here my friend, you are in error !  Here’s what Scavone wrote about de Clari’s description : “Clari also saw elsewhere, in the relic treasury of the Pharos Church of the imperial palace (that treasury in Mesarites’ care two years prior), the two tabulae or cases which supposedly contained the famous Edessa towel (touaile) and the imaged tile (tiule).”\nBy the way, if you want to have a complete look at all the lists of relics we have from Constantinople, you can read the article post online by Scavone but, since his article is full of bias in favor of Wilson’s hypothesis, I don’t recommand to make a big deal of his comments.  Here’s the article (I’ve already post it here) :  http://www.shroudstory.com/scavone/scavone1.htm\nHe made a complete check-up of all the ancient sources that talk about a burial Shroud of Christ (and/or burial linens in plural) and/or a towel we can easily associate with the Mandylion (accompany sometimes by a tile we can easily associate with the Keramion).  I’ve made the same full check-up than him about all those ancient sources and came up with a totally different conclusion !  And I have to say that my conclusion is pretty much the same as the conclusion drawn by the late Emmanuel Poulle, a very good historian from France, even if I wasn’t aware of his work at the beginning of my reflection on this subject.  In fact, when I came across his work, I was really surprise by the closeness of his conclusion on the subject versus mine. \nQuote : “Don’t worry Yannick, I won’t get upset, but isn’t it a little premature or a little arrogant to say you are right, in your assumption?”  I don’t know if I’m arrogant by being confident in my analysis (even if recognize I’m not an historian).  All I know is that authentic historians like Poulle in France think like me on this topic, so I have a tendancy to think I’m not so off-track.  In fact, think about that fact Ron :  the only historians that really favored this hypothesis are those that came from inside the Pro-Shroud circles like Scavone and Guscin (even if he’s much more prudent than Scavone in his final judgement).  Outside the Pro-Shroud circles, the vast majority of historians are not at all fanatics or defenders of this hypothesis !  In fact, those historians are largely AGAINST this hypothesis.  This simple fact doesn’t tell you something Ron ???  It should…  Never underestimate the dangers of bias when it come to this subject.  Many people seemed to be so unsure about the fact that the Shroud is authentic (surely because of the C14 dating of 88) that they tend to blindly favored this hypothesis and simply see what they wants to see in ancient sources to make believe that the Shroud have a clear history from the first century all the way until today.  The reality is much more complex than this and the probability is high that the “unofficial” history of the Shroud will never be known for sure.  But again, that doesn’t mean one bit that the Shroud is not genuine…\n\n","date":"January 3, 2012 at 10:28 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6527","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"Yannick sometimes I find it can be impossible to debate with you. One issue is you seem to assume things, and BIG TIME; One; That you have full knowledge and understanding of the “Laws of Nature” and therefore energy cannot possibly come from a corpse, REALLY? Then I’d say your knowledge is far beyond all mortal humans! Science barely has a grasp of the nature of things, most is all theories. So because we don’t understand how something can be possible it automatically is supernatural and out of the range of science?…Bull!….Stay grounded if you like, but grounded also means ‘Constricted in imagination’ and without imagination, science would not exist. Remember when you stated at one time people thought earthquakes, floods were acts of God because they didn’t understand nature? …Notice any similarities in your thought? I see no danger in being ‘imaginative’ when dealing with science whatsoever and I’m glad I’m this way.\nTwo; Robert diClari, YES, never saw “a linen and a tile”, he states he ONLY saw the ‘containers’ or boxes which would have held them. So these items may not have even existed, just empty boxes. What we have here is just an eyewitness account of containers, nothing more!. Also the mention or possiblilty of the two artifacts existing at the same time ‘STARTED’ in Constantinople, not anytime before, in any writings whatsoever and as both items were never actually SEEN at the same time by any eyewitnesses, it makes it quite plausable that ‘maybe’ only one article actually existed and not both.\nThree; You assume your “authentic historian Poulle in France”, would be any better in deducing true history then Scavone or Wilson, WHY? Because he may have some letters after his name? Yannick you can be hypocritical also when it serves your means by accusing these men of being bias or pro-shroud. These people have done extensive studies, most of what they say comes from authentic translation of many documents, which they list references too. I could state ‘quite easily’ here; Any historians that do not agree with these hypothesis are biased, ignore or misinterpret historical documentation and basically may be against Shroud authenticity! How does that sound?\nWhen it comes to the renditions of the face on the mandylion and/or verse the Shroud etc; You have confused the issue so badly at this point, I can’t even think of a rebuttal. LOL. You keep changing the issue, I’m now confused at your point….\nSince English is a second language issue for you, I’m going to just chock alot of this up to misinterpretations and misunderstandings.\nR\n\n","date":"January 6, 2012 at 4:52 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6618","author":"Ron","site":"shroudstory"},{"title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008","post":"Before I even consider any supernatural hypothesis on image formation, I will wait until every possible natural hypothesis can be completely tested (and I mean in every possible scenario that can have some chance to be related to the Passion, death and emtombment of Christ).  Since we’re far from this moment, I don’t have to lose time with any supernatural hypothesis.  This is how science should work :  try first every possible natural hypothesis.  I’m sorry but it is IMPOSSIBLE that a dead body can emit a powerful UV light, a Corona discharge (except for the VERY VERY thin possibility that an earthquake could have caused it) or any form of radiation, unless there was some kind of a miraculous event that would have produced a burst of energy like that.  But the problem with this Hollywoodian scenario, is the fact that there’s nothing to support it in the STURP data, or in the gospels accounts, or in the official Catholic theology (I’m a Catholic, so I listen to the teaching of my religion even if I don’t always agree with everything)…  So, I’ll just wait for some natural hypothesis to be tested first.  And we have to understand that it’s not because one phenomenon is still unknown that it come necessarily from a direct act of God, even if the Shroud is supposed to be the one of Christ ! \nNow, for the testimony of Robert de Clari, it is possible that he didn’t saw the linen and the tile, but what do you do of the FACT that some 40 years later, saint Louis, the Kind of France bought many relics from Beaudoin II, the latin emperor of Constantinople and, in the official list of relics that were sold, Beaudoin wrote the same thing that de Clari had describe, namely a linen and a tile !  So, it’s wrong to supposed that the reliquaries that de Clari saw was empty (if he didn’t saw the relics themselves) !!!!  Do you see the King of France paying big money to buy some empty reliquaries Ron ?  Really ?  Doesn’t make sense.  Sorry.  And the thing is that most historian agrees that this duo of relics was in fact the Mandylion and the Keramion from the Abgar legend.  And if we used the Occam razor principle, we have to conclude that the probability that those historian are correct rank high in a probabilistic scale.  In fact, no other relic from the east have ever been associated with a tile, except the Mandylion (with the Keramion).  That’s not a supposition, that’s an historical fact !\nThe problem with this Mandylion hypothesis is the fact that, to work, you really need to make A LOT of special assumptions with his contrary to the Occam razor principle.  So, it’s only when an historian REALLY WANT this hypothesis to be correct that he’ll used and defend all those special assumptions, extrapolations, speculations, etc.  It’s a sad acknowledgement I know, but it’s true.  And in this context, who do you think will bring this hypothesis forward and defend it (almost blindly, without considering all the numerous contradictions that this hypothesis have to face) ???  THE PRO-SHROUD HISTORIANS OF COURSE !!!!!!  Poulle seemed to believe the Shroud could be genuine, but as a professional historian, he had to stick to the sources.  After a long inquiry of all the ancient sources he could find on the subject, he came to the conclusion that the Mandylion could not have been the Shroud of Turin folded in 8.  Of course, this is only his personal conclusion but after I read a lot on the subject and made a little inquiry of mine, I share completely is point of view.  The most probable road that the Mandylion took after the sack of Constantinople is the Sainte-Chapelle in Paris (came there around 1241 or 1242) and this relic stayed there until the french revolution of 1789 when it was lost (along with the tile).  So, if the Mandylion was kept all this time in Paris, then we have to conclude that the Shroud and the Mandylion are 2 separate relics.  Period.\nYou know what the bottomline if regarding the ancient history of the Shroud :  THERE’S NO DIRECT REFERENCE IN ANCIENT SOURCES OF THE PRESENCE OF A SHROUD OF CHRIST (OR JUST BURIAL LINENS, AS A MATTER OF FACT) IN THE CITY OF EDESSA !!!  THIS IS AN HISTORICAL FACT.  NO DIRECT REFERENCE AT ALL.  THERE’S NOTHING IN ANCIENT SOURCES TO SUPPORT ANY CLAIM THAT THE SHROUD OF CHRIST COULD HAVE BEEN KEPT ONE MINUTE IN EDESSA.  Of course, having said that, I have to also say that doesn’t mean that the Shroud of Turin was never kept in this city but THERE’S NO DIRECT REFERENCE IN ANCIENT SOURCE TO SUPPORT THIS POSSIBILITY.   If we check all the ancien sources before 1350 (when the “official” history of the Shroud begins in Lirey, France), we can retrace some references to the presence of a Shroud of Christ in Jerusalem, in the Jordan valley in Palestine, in Constantinople and in Athena, but none, I mean absolutely none for the city of Edessa.  This is the reality Ron !  I don’t invent anything here.  I report an historical fact.  That’s all.  Now, you do what you want with this information !  \nNow, regarding my english, you have to forget the mistakes I still make because I’m not 100% bilingual.  But I’m sure I speak better english than you can talk french !!! ;-)  In Canada, it seem that we (the French) are destinate to always accomodate you (the English).  You just have to go to Montreal to understand what I mean.  Every person who speak english in Montreal will meet a lot of Quebecers who will force themselves to speak english just to accomodate the newcomer.  It’s rare that the english will force himself to speak a little of french instead !  We are a nation that was conquered and we can see it in a situation like that…  That was my Canadian editorial of the day ! :-)\nFor the numerous copies of the Mandylion, the FACT is that there’s not a single copy that look like a burial cloth like the Shroud.  Not a single one.  No copies show some blood stains.  No copies show some bruises.  Zero.  And more than that, there’s not one single reference that we can found in ancient sources that make a DIRECT reference saying that the Mandylion was actually a burial cloth.  No reference.  Zero.  Here, I have to say it again :  This is the reality Ron !  I don’t invent anything here.  I report an historical fact.  That’s all.  Now, you do what you want with this information !  \nDon’t you found this strange that Wilson, Scavone, Dubarle and other defenders of this hypothesis (remember that it is just an hypothesis and not an accepted theory by the majority of the historians) NEVER mention those NUMEROUS DISCREPENCIES when they talk about the Mandylion ???  In the Pro-Shroud world, the public is only offered the good side of the coin, never the bad.  That’s the thing that I found a bit scandalous…\n\n","date":"January 8, 2012 at 8:46 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","id":"comment-6692","author":"Yannick Clément","site":"shroudstory"}]
