[{"title":"ABR: The Shroud of Turin’s Earlier History: Part Two: To the Great City","post":"Except for the fact that there is not a single byzantine expert out there who trust Wilson’s hypothesis (note that I’m not talking about Scavone who is not specialized in Byzantine history), I have nothing else to say about that wrong hypothesis of the Mandylion than what I already said last week:  https://shroudstory.com/2013/03/15/abr-the-shroud-of-turins-earlier-history-part-one-to-edessa/#comment-27350\nI just can’t help myself.  Everytime I see someone pretending that the Shroud ever spent some times in Edessa, I have to express my disagreement !\n\n","date":"March 26, 2013 at 10:39 am","url":"https://shroudstory.com/2013/03/26/abr-the-shroud-of-turins-earlier-history-part-two-to-the-great-city/","cat":"history","id":"comment-28407","author":"Yannick Clément","site":"shroudstory"},{"title":"ABR: The Shroud of Turin’s Earlier History: Part Two: To the Great City","post":"These four articles, “The Earlier History of the Shroud of Turin”, were written primarily for the Associates for Biblical Research readership.  ABR takes the Biblical documents seriously, even to the point of conducting primary archaeology in Israel.  Just as ABR has found much evidence consistent with Biblical Jericho, Ai, etc., I wanted to demonstrate that there are many historical reasons for seriously considering an early date for the Shroud.  I’m sure Yannick Clement is familiar with the evidences linking the Shroud with the Edessa Icon, both: on linen, not painted, much longer than a simple face cloth, faint and sweaty image, the most prominent picture in an area (Syria) playing an important role in the development of Christ-iconography, and while still in Edessa believed by some to be a full body image mysteriously connected to Christ’s Passion; after its arrival in Constantinople blood drops are noticed.  These and other evidences can be spun to other interpretations, but Scavone’s assessment is not pretension but sound judgement: “If one accepts the premise that there are subtle clues – not of any shroud, but precisely of the Shroud of Turin – in the literature surrounding the Edessa image, then the evidence in its favor seems to make good sense and approaches the level of proof.”  (Part 3 perhaps this week, Part 4 maybe by summer).\n\n","date":"March 26, 2013 at 1:25 pm","url":"https://shroudstory.com/2013/03/26/abr-the-shroud-of-turins-earlier-history-part-two-to-the-great-city/","cat":"history","id":"comment-28418","author":"John Long","site":"shroudstory"},{"title":"ABR: The Shroud of Turin’s Earlier History: Part Two: To the Great City","post":"I wish John luck in his enterprise, but he will never succeed in persuading our resident liberal Catholic in Quebec.  After Antioch was destroyed by the Persians in the 6th century, Edessa was the formost Christian city in the eastern empire, a major centre of Christian estern scholarship.  There are I think only two options for the Shroud’s whereabouts – either Edessa or Constantinople. It is a physical object – it had to be somewhere within a credible distance of Jerusalem.  But if not in either of these places, where else might it have been?  No-one has ever considered any other alternative!\n\n","date":"March 26, 2013 at 2:30 pm","url":"https://shroudstory.com/2013/03/26/abr-the-shroud-of-turins-earlier-history-part-two-to-the-great-city/","cat":"history","id":"comment-28420","author":"daveb of wellington nz","site":"shroudstory"},{"title":"ABR: The Shroud of Turin’s Earlier History: Part Two: To the Great City","post":"The only references to a SHROUD of Christ (I’m not talking about a face cloth or a towel showing the face of a living Christ with no bloodstains on it, which the people of ancient time were able to make the difference) before the apparition of the Shroud of Turin in Lirey, France in the middle of the 14th century ALWAYS place it in Palestine (whether it be Jerusalem or the banks of the Jordan river) or Constantinople.  There is absolutely no reference to a SHROUD of Christ in Edessa for any period of history.\nAgain, if we use Occam’s razor, the most rational path for the Shroud is this :  Jerusalem (or elsewhere in Palestine) to Constantinople to Europe.\nThere’s no need to think Edessa was one of the resting place of the Shroud between these era.  No ancient reference exist to make us thinking such a thing.\n\n","date":"March 26, 2013 at 3:33 pm","url":"https://shroudstory.com/2013/03/26/abr-the-shroud-of-turins-earlier-history-part-two-to-the-great-city/","cat":"history","id":"comment-28435","author":"Yannick Clément","site":"shroudstory"},{"title":"ABR: The Shroud of Turin’s Earlier History: Part Two: To the Great City","post":"John, I think you really should read my paper about this topic in which you’ll find a non-exhaustive list of problematic facts and observations concerning Ian Wilson’s Mandylion hypothesis.  Here’s the link : https://shroudofturin.files.wordpress.com/2012/06/clc3a9ment_questions-about-the-mandylion-hypothesis-of-wilson_2012-06-28.pdf\nI hope you’ll read it with an open-mind free of any preconcieve notions about this topic…\n\n","date":"March 26, 2013 at 3:36 pm","url":"https://shroudstory.com/2013/03/26/abr-the-shroud-of-turins-earlier-history-part-two-to-the-great-city/","cat":"history","id":"comment-28436","author":"Yannick Clément","site":"shroudstory"},{"title":"ABR: The Shroud of Turin’s Earlier History: Part Two: To the Great City","post":"Hi Yannick\nCan you please provide a link / links to the historic personal accounts of the mandylion / shroud you refer to in your paper, dating from the late 1100s / early 1200s.\nThanks\nMatthias\n\n","date":"March 27, 2013 at 6:01 am","url":"https://shroudstory.com/2013/03/26/abr-the-shroud-of-turins-earlier-history-part-two-to-the-great-city/","cat":"history","id":"comment-28476","author":"Matthias","site":"shroudstory"},{"title":"ABR: The Shroud of Turin’s Earlier History: Part Two: To the Great City","post":"Most of them come from a very good inquiry that was done by the late Emmanuel Poulle, who was a French historian very honest and professional.\nHere’s the reference : Emmanuel Poulle, Article « Les sources de l’histoire du Linceul de Turin » – Revue Critique – Extract from « Revue d’Histoire Ecclésiastique », Vol. 104 (2009), N° 3-4, 36 pages.\nHowever, I don’t think this particular paper is available online…  The most important thing to note is this :  after his researches about the Shroud ancient history, Poulle did not find the Mandylion hypothesis of Wilson credible at all, even though he believed the Shroud to be authentic.\n\n","date":"March 27, 2013 at 10:38 am","url":"https://shroudstory.com/2013/03/26/abr-the-shroud-of-turins-earlier-history-part-two-to-the-great-city/","cat":"history","id":"comment-28486","author":"Yannick Clément","site":"shroudstory"},{"title":"ABR: The Shroud of Turin’s Earlier History: Part Two: To the Great City","post":"Great piece. Although I am a shroud agnostic, I find some of this historical case quite compelling.\n\n","date":"March 27, 2013 at 5:53 am","url":"https://shroudstory.com/2013/03/26/abr-the-shroud-of-turins-earlier-history-part-two-to-the-great-city/","cat":"history","id":"comment-28475","author":"Matthias","site":"shroudstory"},{"title":"ABR: The Shroud of Turin’s Earlier History: Part Two: To the Great City","post":"If you are referring to my paper about the Mandylion hypothesis, then thank you very much!\n\n","date":"March 27, 2013 at 10:34 am","url":"https://shroudstory.com/2013/03/26/abr-the-shroud-of-turins-earlier-history-part-two-to-the-great-city/","cat":"history","id":"comment-28485","author":"Yannick Clément","site":"shroudstory"},{"title":"ABR: The Shroud of Turin’s Earlier History: Part Two: To the Great City","post":"Thanks Yannick. So you would say Poulle was a credible historian?\n\n","date":"March 27, 2013 at 4:38 pm","url":"https://shroudstory.com/2013/03/26/abr-the-shroud-of-turins-earlier-history-part-two-to-the-great-city/","cat":"history","id":"comment-28519","author":"Matthias","site":"shroudstory"},{"title":"ABR: The Shroud of Turin’s Earlier History: Part Two: To the Great City","post":"An honest one not driven by his faith, yes.  He followed the historical method of research properly, as it seems to me.\nJust like Barbet, Vignon and Legrand in France, he’s another Frenchman that I consider honest and who did his science without too much bias, even though he believed the Shroud to be genuine…\n\n","date":"March 27, 2013 at 4:42 pm","url":"https://shroudstory.com/2013/03/26/abr-the-shroud-of-turins-earlier-history-part-two-to-the-great-city/","cat":"history","id":"comment-28520","author":"Yannick Clément","site":"shroudstory"},{"title":"ABR: The Shroud of Turin’s Earlier History: Part Two: To the Great City","post":"Anyone who has read recent Shroud (history) books knows that the excavations being made in Sanlurfa can bring more concrete evidence in favour of the Edessa connection. The impact of the destruction can be felt in Shroud studies and, incredible as it may seem, the destruction continues even today. Only 57 of Iraq’s 300 churches, many of them ancient, are intact and the same will happen in Syria. Any hidden evidence in favour of Shroud authenticity may have been destroyed, thanks to Schwartzkopf, Obama, Kerry & Co.\n\n","date":"March 27, 2013 at 12:23 pm","url":"https://shroudstory.com/2013/03/26/abr-the-shroud-of-turins-earlier-history-part-two-to-the-great-city/","cat":"history","id":"comment-28497","author":"Louis","site":"shroudstory"},{"title":"ABR: The Shroud of Turin’s Earlier History: Part Two: To the Great City","post":"Mesarites said in 1201:\n“In this chapel Christ rises again, and the sindon . . . which wrapped the mysterious, naked body [of Jesus] after the Passion . . .”\nDe Clari said in 1204:\n“there was another of the churches which they called My Lady St. Mary of Blachernae, where was kept the sydoine [French] in which Our Lord had been wrapped, which stood up straight every Friday so that the figure of Our Lord could be plainly seen there . . .”\nWhilst it cannot be proven that these references relate to the shroud, there must be a good chance that they do.\n\n","date":"March 28, 2013 at 2:52 am","url":"https://shroudstory.com/2013/03/26/abr-the-shroud-of-turins-earlier-history-part-two-to-the-great-city/","cat":"history","id":"comment-28557","author":"Matthias","site":"shroudstory"},{"title":"ABR: The Shroud of Turin’s Earlier History: Part Two: To the Great City","post":"Exact.  Along with the Pray codex, those two quotes are the most compelling pieces of evidence to think that the Shroud of Turin was once kept in Constantinople, at least during the second half of the 12th century up until at least April 1204, when the Latin crusaders sacked the city and took with them all the treasures (including a lot of relics) of that great capital.\nBefore that era, there is no ancient reference that is clear enough for any credible historian to conclude that the Shroud was preserved somewhere, during one particular era…  Nevertheless, it’s interesting to note that there are many reference to the presence of a Shroud of Christ (or burial cloths in the plural) in Constantinople from 958 A.D. up until 1201, but all these reference don’t tell if there was an image or if there was bloodstains on the cloth. Therefore, it’s difficult to be certain if that particular relic of Christ was the same than the one described by Mesarites and de Clari at the beginning of the 13th century.\n\n","date":"March 29, 2013 at 5:58 pm","url":"https://shroudstory.com/2013/03/26/abr-the-shroud-of-turins-earlier-history-part-two-to-the-great-city/","cat":"history","id":"comment-28751","author":"Yannick Clément","site":"shroudstory"},{"title":"ABR: The Shroud of Turin’s Earlier History: Part Two: To the Great City","post":"Bela III (King of Hungary in late 1100s) spent a large amount of time in Constantinople, until 1172. He was close to marrying the Emperor’s daughter, and becoming heir to the throne.\nIt’s quite logical to think, given the very strong ties between Constantinople and Hungary at the time, that the Pray Codex image was modeled on the Shroud\n\n","date":"March 28, 2013 at 3:31 am","url":"https://shroudstory.com/2013/03/26/abr-the-shroud-of-turins-earlier-history-part-two-to-the-great-city/","cat":"history","id":"comment-28558","author":"Matthias","site":"shroudstory"},{"title":"ABR: The Shroud of Turin’s Earlier History: Part Two: To the Great City","post":"Totally true.\n\n","date":"March 29, 2013 at 5:58 pm","url":"https://shroudstory.com/2013/03/26/abr-the-shroud-of-turins-earlier-history-part-two-to-the-great-city/","cat":"history","id":"comment-28752","author":"Yannick Clément","site":"shroudstory"},{"title":"ABR: The Shroud of Turin’s Earlier History: Part Two: To the Great City","post":"Could it be the shroud of Turin be Jacquis De Molay\n\n","date":"July 26, 2013 at 12:07 am","url":"https://shroudstory.com/2013/03/26/abr-the-shroud-of-turins-earlier-history-part-two-to-the-great-city/","cat":"history","id":"comment-39750","author":"Pala","site":"shroudstory"}]
