[{"title":"Paper Chase: The Shroud of Turin’s Missing Years","post":"This hypothesis is the favorite of mine, but recently, thanks to Barrie’s website and his display of many copies of Shroud Spectrum International, I came accross another interesting (and totally different) hypothesis concerning those missing years of the Shroud.  If you read this paper from Dorothy Crispino (http://shroud.com/pdfs/ssi04part5.pdf), you’ll have a nice description of this particular hypothesis, which conclude that the Shroud was still in Constantinople many years after the sack of the city in 1204 and remained there until the Latin Emperor of the conquered city (Beaudouin II) would have sold it with many other relics associated with Jesus Christ to Saint Louis King of France, who would have eventually placed it in the Sainte-Chapelle of Paris and, eventually, the relic would have end up in the hands of the bravest knight of France, Geoffroy de Charny…  This is based on one particular way to interpret a few lists of relics written after the sack of Constantinople.  Interesting proposal.  Of course, the first and most important question that should be asked versus this particular hypothesis is :  Why there doesn’t seem to exist one particular document in France that describe, without any confusion, the presence of a long burial shroud of Christ in the Sainte-Chapelle.  Effectively, to my knowledge, the only thing that come close to this is the expression “a portion of the Shroud of Christ” or something like this…  And the second question (equally important) is :  How in the world did Geoffroy de Charny would have been given this very precious relic while it was much more common for the King to only give tiny portions of one particular relic when he wanted to make a gift to a friend or an ally king?\n\n","date":"July 13, 2013 at 7:45 pm","url":"https://shroudstory.com/2013/07/11/paper-chase-the-shroud-of-turins-missing-years/","cat":"history","id":"comment-38971","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Shroud of Turin’s Missing Years","post":"Complement :  According to Crispino’s hypothesis, Beaudouin II would probably have sold the Shroud to Saint Louis King of France during the year 1247, along with a lot of other relics of Christ…\n\n","date":"July 13, 2013 at 7:49 pm","url":"https://shroudstory.com/2013/07/11/paper-chase-the-shroud-of-turins-missing-years/","cat":"history","id":"comment-38972","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Shroud of Turin’s Missing Years","post":"interesting Yannick. What does “tars sindonis” translate as?\nSainte-Chappelle is truly beautiful!!!!\n\n","date":"July 13, 2013 at 10:26 pm","url":"https://shroudstory.com/2013/07/11/paper-chase-the-shroud-of-turins-missing-years/","cat":"history","id":"comment-38976","author":"Matthias","site":"shroudstory"},{"title":"Paper Chase: The Shroud of Turin’s Missing Years","post":"You went in the Sainte-Chapelle ?  I would like to have this opportunity once in my life !  Did you saw the Crown of Thorns ?  It is exposed to the public every first Friday of the month.  Note that it is a circlet of rushes without any thorns.  You can see a nice picture of it here: http://www.notredamedeparis.fr/spip.php?article11  \nThere were originally 3 thorns in it when Saint Louis bought it from Beaudouin II but, after that, the kings of France gave or sold them all to some friends or ally Kings.  In the nice DVD about the Shroud called “The Wonder of the Shroud”, Father Martin Haigh mentioned that the diameter of this circlet of rushes is compatible with the dimension of the image of the head on the Shroud and, therefore, could well be an authentic relic of the Passion, as it would have been used to keep the branches of thorns together on Jesus’ head, which is very logic when you think of it.  And what increase even more the possibility that this circlet of rushes could well have been used on the head of Jesus is the fact that it is made of rushes which could have been originally used by the Roman soldiers to make fires at night.  Effectively, the Gospel of John tell us that Jesus was arrested during a cold night (John 18, 18)…\n\n","date":"July 14, 2013 at 5:59 pm","url":"https://shroudstory.com/2013/07/11/paper-chase-the-shroud-of-turins-missing-years/","cat":"history","id":"comment-38992","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Shroud of Turin’s Missing Years","post":"Note :  Of course, I don’t pretend that such a relic of the Passion is surely authentic.  I just say that there is a real possibility (far from being a certainty) that it could be the case.  And of course, the main argument against this possibility is this rational reflection:  it is very hard to believe that some followers of Christ would have dare (or would have had the presence of mind if you prefer) to recover and preserved such a gruesome object (which would probably have been composed of the circlet of rushes and many branches of bloody thorns).\nQuestion:  I’m not sure if there are some bloodstains on this circlet of rushes that his kept in the Sainte-Chapelle.  If anyone knows, please share this info with me (with us)!  In all logic, there should be some bloodstains on it!\n\n","date":"July 14, 2013 at 6:04 pm","url":"https://shroudstory.com/2013/07/11/paper-chase-the-shroud-of-turins-missing-years/","cat":"history","id":"comment-38993","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Shroud of Turin’s Missing Years","post":"Meaning of “tars sindonis”…  This is a good question.  I just know that “sindonis” can be translate as “shroud” as well as many other generic terms for “cloth” but I don’t know the meaning of “tars”.  Would be nice if someone could bring us the correct answer.\nIn the end, I don’t think we can consider this mention from the Bishop of Mende (written in 1296) as a sure proof that there really was a long burial shroud of Christ kept in the Sainte-Chapelle of Paris during those years…  As I said, “sindonis” can mean a lot of things and if we put this mention in the context of the official list of relics written by Beaudouin II (which mention a “sudarii”, which can mean a portion of the shroud or a small cloth), I think this mention should be understand like this: there was surely a “cloth” associated with the burial of Christ in the Sainte-Chapelle but there are not enough évidences to know if this cloth was long or small or if it was just simply a tiny portion of the original shroud (remember that there are 2 missing corners on the Shroud !).\nBut, nevertheless, it would be nice to learn the exact meaning of “tars sindonis”.  Maybe this could help to understand better what the Bishop of Mende really meant.\n\n","date":"July 14, 2013 at 6:16 pm","url":"https://shroudstory.com/2013/07/11/paper-chase-the-shroud-of-turins-missing-years/","cat":"history","id":"comment-38994","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Shroud of Turin’s Missing Years","post":"Yannick, note 11 to Crispino’s paper mentions:\n“The reliquary with the label still exists but the receptacle is empty.”\nI think this is quite important. So we need to find out what “tars sindonis” means. Does it mean “The Shroud”…???\n\n","date":"July 15, 2013 at 5:04 am","url":"https://shroudstory.com/2013/07/11/paper-chase-the-shroud-of-turins-missing-years/","cat":"history","id":"comment-39008","author":"Matthias","site":"shroudstory"},{"title":"Paper Chase: The Shroud of Turin’s Missing Years","post":"The paper by Crispino mentioned by Yannick is certainly interesting, even more so when placed alongside Scavone’s paper, as the two interpret one particular incident involving Nicholas of Otranto quite differently, although there may be some ambiguity with the names, Crispino calling him Nicolas Idruntino, who may I suspect be the same person. Thus Crispino: “Nicolas Idruntino who, furthermore, writes that after the sack of 1204 he saw the precious relics of the Passion with his own eyes; the “othoni” and the “soudarion” among the others..”. \nOn page 6 of his paper, Scavone mentions the same reference and comments: “In this passage, the key words are “with our own eyes.” The question must be asked as to just where it was that Nicholas actually saw the linens. To answer this, we must add what he says in another context: that, in 1206, Benedict and he had traveled to Athens and to\nThessalonika debating the same questions of Church unification with the\nGreek theologians.” Scavone postulates that Nicholas saw them in Athens, that the list (mentioned by Crispino) is what was taken from Constantinople, and refers to the use of the Latin pluperfect tense and the Greek imperfect tense, as arguments that these were no longer in Constantinople.  \nThe two papers (Crispino & Scavone) need to be examined and considered very closely as to the relative weight to be given to each. For Othon de la Roche to have secured the Shroud, it had to be in Athens soon after 1204. Othon is also an ancestor of Jeanne de Vergy, and it would seem peculiar that Geoffrey de Charny would have been given such a valuable relic purported to be Christ’s burial cloth, in return for any kind of service he migh have rendered, notwithstanding that he was appointed to bear the oriflamme. As Crispino comments, it was more customary to give a small piece of such relics.\n\n","date":"July 14, 2013 at 5:34 am","url":"https://shroudstory.com/2013/07/11/paper-chase-the-shroud-of-turins-missing-years/","cat":"history","id":"comment-38981","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase: The Shroud of Turin’s Missing Years","post":"I’m pretty sure Crispino was talking about the same Nicolas of Otranto…  And where the two authors agree with each others is their understanding of the word “spargana” that they understand as meaning “shroud”…  But I think they are both wrong about that, because spargana can mean many things (Scavone talk about that in his paper) and the most normal translation for it would be “strips of linen” or something similar.  So, I really think that the most rational way to understand the list of relics of Nicolas is to think that he was able to see the relics of Christ that have been preserved in the Pharos Chapel during the sack of Constantinople of 1204 and, among them, he saw the linen strips associated with the Shroud.  Because of the word chosen (spargana), I really don’t think he saw the Shroud itself…  And I think, on the contrary to Scavone’s free speculations, that the most rational place he could have seen these relics is in the Pharos Chapel of Constantinople in 1207 because we know for a fact that he visited that city in that year and we also know for a fact that all the relics he mention (and that he saw with his own eyes) were sold to Saint Louis king of France in 1247 !  And because of the very good concordance between Nicolas’ list of relics and the list of relics written by Beaudouin II which were sold to Saint Louis in 1247, I think there is a very good probability that the “spargana” seen by Nicolas were the same as the “sudarii” that was sold to Saint Louis and I really doubt that this could be the\nwhole shroud…  Effectively, these 2 words have much more chances to mean “small cloth (or cloths)” or “strips of linen” than a real long burial cloth.  I think we can see this (or these) cloth(s) as being the other cloths (the Gospels of Luke and John used the word “othonia” for these cloths) that were used for the burial of Christ\n\n","date":"July 14, 2013 at 6:27 pm","url":"https://shroudstory.com/2013/07/11/paper-chase-the-shroud-of-turins-missing-years/","cat":"history","id":"comment-38995","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Shroud of Turin’s Missing Years","post":"If this reflection of mine is correct, then that mean that the main Shroud was probably out of Constantinople in 1207 when Nicolas of Otranto saw the relics that were still present in the Pharos Chapel, as well as when Baudouin II sold the batch of relics to Saint Louis in 1247…  And this would mean that the hypothesis involving a disappearance of the Shroud during the sack of Constantinople (possibly in the hands of Othon de la Roche) would be very probable.  Presently, just like Piana, I think this is the most probable scenario for the transfer of the Shroud from Constantinople to Europe at the beginning of the 13th century.\n\n","date":"July 14, 2013 at 6:33 pm","url":"https://shroudstory.com/2013/07/11/paper-chase-the-shroud-of-turins-missing-years/","cat":"history","id":"comment-38996","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Shroud of Turin’s Missing Years","post":"Assuming that the Image of Edessa/TS are one and the same object and was taken by de la Roche to France it is possible that, given the situation in France, he handed the relic over to the Knights Templar, with their heavily guarded monastery-fortresses, for safekeeping. Why did the knights keep quiet about what they had in their possession, only giving hints from time to time? Because the relic was stolen, not given as a present by the Eastern Church to the “Catholic” invaders, many of them mercenaries paid by the Doge of Venice, taking part in an ugly episode in the history of Christendom known as the Fourth Crusade.\nThe tell-tale signs are the Templecombe image, psalm 57 chanted by the knights during their special Masses and the round churches — based on the Church of the Holy Sepulchre — they built in several countries in Europe.\nIt is even possible that they knew about the existence of the relic before the year 1204, although they did not take part in the crusade and only infiltrated spies there. They may have thus known the whereabouts of the relic after Constantinople was sacked.\n\n","date":"July 14, 2013 at 5:47 pm","url":"https://shroudstory.com/2013/07/11/paper-chase-the-shroud-of-turins-missing-years/","cat":"history","id":"comment-38991","author":"Louis","site":"shroudstory"},{"title":"Paper Chase: The Shroud of Turin’s Missing Years","post":"Louis, You have mentioned on previous occaasions your views that the Templars held the Shroud.  I should be interested in your views on Daniel Scavaone’s paper: “BESANÇON AND OTHER HYPOTHESES FOR THE\nMISSING YEARS: THE SHROUD FROM 1200 TO 1400” he presented at the 2008 Conference in Ohio. You’re probably aware that he makes a case for Othon taking (or sending) it to his home church in Bensancon, for which there appears to be some tradition. I understand that Burgundy was independent territory at the time, although both France and German interests had designs on it. A strong point for his case is that he is a direct ancestor of Jeanne de Vergy, wwhereas I find it difficult to see how Geoffrey de Charney could have come by it otherwise except by way of her dowry. The weak point of his case is that much of the Besancon church records were destroyed, either by fire sometime around 1350, or in later centuries by the turmoil of the French Revolution.\nThe Templars may have known about it, or else something very similar, hence the Templescombe image, but what is the case for their actually having it in their possession? If Jeanne de Vergy had a copy made to replace the original she “rescued” from Besancon, this could go some way towards explaining the D’Arcis memo if there was some confusion as to which was the original.\nScavone’s paper can be found at:\nhttp://ohioshroudconference.com/papers.htm  Any comments?\n\n","date":"July 15, 2013 at 12:18 am","url":"https://shroudstory.com/2013/07/11/paper-chase-the-shroud-of-turins-missing-years/","cat":"history","id":"comment-39001","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase: The Shroud of Turin’s Missing Years","post":"Sindonis is surely Sindon or shroud. Is Tars Sindonis latin? Or old French?\n\n","date":"July 15, 2013 at 5:06 am","url":"https://shroudstory.com/2013/07/11/paper-chase-the-shroud-of-turins-missing-years/","cat":"history","id":"comment-39009","author":"Matthias","site":"shroudstory"},{"title":"Paper Chase: The Shroud of Turin’s Missing Years","post":"Sindon is a latin word that can mean many things Matthias.  Here are some possible meaning depending of the context of the text in which the term is used :  1- A thin fabric, of cotton, linen, or silk.  2- A piece of cotton or linen (which can be used for a long burial shroud as well as many other kind of cloths). 3- A wrapper. 4- A corporal. 5- A canvas of ship.  6- Other possible meaning exist.\nI have read once that this latin word was often used for cloths of a great dimension but I’m pretty sure it was also used sometimes for more tiny pièces of cloths…\nQuestion I have :  I wonder if the prefix “Tars” before the word “Sindonis” would not mean “part of” or something similar…\n\n","date":"July 15, 2013 at 8:10 pm","url":"https://shroudstory.com/2013/07/11/paper-chase-the-shroud-of-turins-missing-years/","cat":"history","id":"comment-39041","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Shroud of Turin’s Missing Years","post":"David, there are just too many papers from armchair historians and lawyers which do not get close enough to what is most probable. Barbara Frale has gone further, although she has been unsuccessful in filling in all the gaps, at least till today. Othon probably knew he could not ensure that the relic would be safe in his possession in the territory where he was for reasons you have stated. \nAs commented previously, only the Knights Templar left tell-tale signs, dropped hints during their depositions, Philippe le Bel came to know about this image that they “adored” and so on. What is meant by “something very similar”? Remember that one account talks about “four hands and four feet”.\n\n","date":"July 15, 2013 at 10:31 am","url":"https://shroudstory.com/2013/07/11/paper-chase-the-shroud-of-turins-missing-years/","cat":"history","id":"comment-39020","author":"Louis","site":"shroudstory"},{"title":"Paper Chase: The Shroud of Turin’s Missing Years","post":"Here’s a complementary comment for Matthias, Daveb and any other interested person : Today, I made a quick search on the internet and find out that Nicolas of Otranto mentioned by Scavone) and Nicolas Idruntino (mentioned by Crispino) are truly one and the same person…\nBut there is one thing very strange :  While Scavone say that Nicolas of Otranto wrote the words “Spargana/Fascia” in association with the Shroud of Christ in his list of relics, Crispino, on the other side, say that Nicolas Idruntino (the same man) wrote the words “Othoni” and “Soudarion” instead in his list of relics!  This is another very good example of how poorly the historical researches concerning the Shroud are often done…  Nevertheless, it should be noted that, in both cases, the words used refers to small cloths and both “Spargana” and “Fascia” can be used to describe strips of linen.  On the contrary, no matter what’s the correct reference (Scavone or Crispino), in no cases, we can honestly translate one of these words as meaning “a burial shroud” or “a long piece of linen” or something like that.  I repeat that all these words were very often used to described small cloths or even just strips of fabric (made of linen, cotton or another material).\nAlso, in the endnotes of Crispino’s paper, she give us a pretty good fact that can be used against the idea that the whole Shroud was once kept in the Sainte-Chapelle of Paris!  Concerning the reference of the Bishop of Mende who wrote that a “Tars Sindonis” was present in the chapel, Crispino wrote an endnote (#11) saying that “it is not known what happened to this relic after the French Revolution.  The reliquary with the label still exists but the receptacle is empty”.  So, taking this fact into account, we can conclude that if this relic was present inside the Sainte-Chapelle up until the French Revolution of 1789, it is then impossible that this cloth was the Shroud that was exposed in Lirey, France after the middle of the 14th century!  This is pure logic!  Also, the fact that the reliquary of this “Tars Sidonis” (note:  I would really like to know if the label used these same words to describe the relic that was once kept in the reliquary or if a different term was used) is still present today in the Sainte-Chapelle is another very strong argument against the idea that this cloth could have been the same Shroud that ended up in Lirey during the 14th century!  Effectively, in the case this relic would have been the real Shroud and if the king of France would have given this Shroud to Geoffroy de Charny before his death in 1356, it’s EVIDENT that he would have also given him the reliquary!\nSeriously, when we take into account all the different terms that were used to described the piece of cloth that was sold by Baudouin II to Saint Louis, kind of France in 1247 (i.e., the lists of relics written by Nicolas of Otranto, the one written by Nicolas Idruntino, the one written by Baudouin II himself and the description of the Bishop of Mende), we must conclude that this cloth was most probably another cloth or cloths (probably small, maybe some strips of linen) associated with the main Shroud of Christ or simply a tiny portion of this main Shroud, which would have been preserved in the Pharos Chapel during the sack of Constantinople of 1204, while the main Shroud (which was exposed instead in the Blachernes Church, if we believe the testimony of Robert de Clari) was probably taken away to the West by the French crusaders (maybe in the hands of Othon de la Roche).  Note : Cesar Barta make one comparative analysis between the fabric of the Shroud of Turin and the fabric of one tiny fragment of the cloth that was bought by Saint Louis, which was given to the Cathedral of Toledo by the king and show us that both cloths were different, on the base of their weaving styles, which is another strong argument against the hypothesis of Crispino that the main Shroud was once kept in the Sainte-Chapelle of Paris.\nNote:  If someone could give us the exact dimensions of the reliquary that was used to kept the “Tars sindonis” in the Sainte-Chapelle of Paris, that would greatly help to confirm my conclusion.  Effectively, if this “Tars sindonis” was really small or if it was composed of many small cloths or many strips of linen, then we must assume that the reliquary in question is also quite small…  So, if anyone knows the dimension of this reliquary, please let us know!  I really think that an expert should go to the Sainte-Chapelle and make some researches on the subject.  Maybe some interesting information and answers could still be found there, even today…\n\n","date":"July 15, 2013 at 8:18 pm","url":"https://shroudstory.com/2013/07/11/paper-chase-the-shroud-of-turins-missing-years/","cat":"history","id":"comment-39042","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Shroud of Turin’s Missing Years","post":"Good summary, Yannick.\n\n","date":"July 15, 2013 at 9:14 pm","url":"https://shroudstory.com/2013/07/11/paper-chase-the-shroud-of-turins-missing-years/","cat":"history","id":"comment-39047","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase: The Shroud of Turin’s Missing Years","post":"Thanks.  It is a subject which I have studied pretty well.  Additional note :  It’s important to note that, among all the lists of relics from Constantinople that were written during the late 11th century, as well as during all the 12th century, there are many of them that refers to cloths in the plural…  So, this fact reinforce the possibility that the main Shroud could have been taken away by the crusaders in 1204, while the other complementary cloths related to Jesus’ burial (which could well have been just some strips of linen) could have been preserved, because there is a good probability that the main Shroud was kept in different place during the sack (Blachernes Church instead of his usual place in the Pharos Chapel).  So, it is truly possible that all that Saint Louis could have bought from Baudouin II in 1247 was the remaining strips of linen (or some other small linen cloths associated with the Passion of Christ), while the main Shroud was long gone from Constantinople (maybe quietly kept at that moment in Othon de la Roche’s Castle of Ray-sur-Saône in France).\n\n","date":"July 15, 2013 at 9:52 pm","url":"https://shroudstory.com/2013/07/11/paper-chase-the-shroud-of-turins-missing-years/","cat":"history","id":"comment-39049","author":"Yannick Clément","site":"shroudstory"}]
