[{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"Bar Daisan, “Bardesanes” in Latin, was a Syrian gnostic from the region of Edessa. And he was also a docetist….\n\n","date":"October 24, 2013 at 8:57 am","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48606","author":"Louis","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"I first came across the ‘Hymn of the Pearl’ when studying for a Stage III ‘Ancient Religions’ paper at Massey U during the 1980s. Professor Brian Colless had translated several ancient works from the original texts. He has written extensively on the ‘Hymn of the Pearl’ and he acknowledges that his interpretation of it is considered somewhat unconventional. I renewed contact with him during the last year, he has now retired in Palmerston North, still maintaining visits to the university library, still doing translations and writing up papers, and maintains a steady interest in choral work with a local choir in his spare time. \nHis web-site includes a number of links to his work on the Hymn of the Pearl, and several other ancient texts as well.\nhttps://sites.google.com/site/collesseum/\n\n","date":"October 24, 2013 at 3:31 pm","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48625","author":"daveb of wellingon nz","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"This is a fascinating observation. It raises some interesting questions for which I may have no answer and may even lack the expertise to ask:\n1.  Is it correct to imply from these materials that the Shroud may have been in Gnostic hands at very early stages of Christianity?\nThe theosophists (Madame ‎Helena Blavatsky  et al) who I believe trace their roots through the Gnostics are great believers in secret wisdom.\n2. What would have been the transition from Gnostic control to orthodox control? \n3. Would  Gnostic control be some  explanation for the Shroud’s missing years?\nI don’t want to get too deep into this because I think the physical evidence of the Shroud’s attributes establishes it’s reality and it’s emergence from the mists of ancient time is a function of modern science. There will never be a “proven” pedigree. However, sometimes with the Gnostic sources we may be not clearing the mists totally but parting them enough to glimpse truths that may have been hidden and/or disguised by complex metaphor or allegory.\n\n","date":"October 25, 2013 at 12:15 pm","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48674","author":"John Klotz","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"John: I think the Gnostic link is only indicated if the particular verse in “Hymn of the Pearl” referring to the mirror image is taken to refer to the Shroud. That is by no means established and some historians have occasionally argued against it, but only perhaps because of their own particular perspective. \nThe Abgar legend purporting to refer to King Abgar V, a contemporary of Jesus, and the establishment of Christianity in Edessa in apostolic times may in fact be a blind. I think it was Eusebius who denounced the Abgar legend as a forgery. Jack Markwardt argues that the Abgar referred to in the legend is in fact Abgar VIII (the Great) but for political reasons, it was written as a legend referring to the earlier Abgar to avoid the attention of the Roman emperor and the prospect of persecution.  It seems likely that Christianity was established in Edessa no later than 200AD, but not much earlier. \nMarkwardt has several very early references which may refer to the Shroud. He argues that the TS was kept and hidden in Antioch, not Edessa, and the story of its discovery in the walls of Edessa is in fact an adaptation of its actual discovery in Antioch, when it was then taken to Edessa because of the impending destruction of Antioch. \nReferences by Jack Markwardt: “Antioch and the Shroud” (1998) http://www.shroud.com/pdfs/markward.pdf  \n“ANCIENT EDESSA AND THE SHROUD: HISTORY CONCEALED BY THE DISCIPLINE OF THE SECRET” (Ohio, 2008)\nhttp://ohioshroudconference.com/papers/p02.pdf  \nIt would be a major detective task working through the tangle and attempting to resolve the various elements in all three papers by Dreisbach and Markwardt.  Further commentary on the “Hymn of the Pearl” may be found on the Brian Colless web-site I’ve mentioned above. A further aspect is the limited diversity of names in early times, and I suspect that that there are so many persons with the same name, that it is difficult and confusing to attempt separating them as distinct persons.\n\n","date":"October 25, 2013 at 3:40 pm","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48691","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"\ndaveb of wellington nz :\nThe Abgar legend purporting to refer to King Abgar V, a contemporary of Jesus, and the establishment of Christianity in Edessa in apostolic times may in fact be a blind. I think it was Eusebius who denounced the Abgar legend as a forgery.\n\nNo Dave, Eusebius is actually the first one who mentions the story of Abgar. See his  The Church History, Book 1, Chapters 12-13:\nhttp://www.newadvent.org/fathers/250101.htm\n\ndaveb of wellington nz :\nJack Markwardt argues that the Abgar referred to in the legend is in fact Abgar VIII (the Great) but for political reasons, it was written as a legend referring to the earlier Abgar to avoid the attention of the Roman emperor and the prospect of persecution.  It seems likely that Christianity was established in Edessa no later than 200AD, but not much earlier.\n\nThere is nothing that makes a story of christianization of Edessa about 30 AD impossible. Remember, the temr Christians was first created in Antioch around 40 AD, see Acts 11:26. The Council of Jerusalem took place around 50 AD. So even if Abgar V had converted into what would have been later called Christianity (and what was nothing but a branch of Judaism at this time), there probably would be no evidence of this. The matter is very complicated, but claims that the story of Abgar couldn’t happen are based actually on nothing else, but prejudices of most scholars. The dubious authenticity of purproted letters is however another thing, even if some were exchanged, their content was later probably at least interpolated.\n\n","date":"October 25, 2013 at 4:39 pm","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48694","author":"O.K.","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"Eusebius: Yes, Eusebius is the first one to mention the Abgar legend; My Encyc Brit says it was regarded as spurious from the fifth century, but I don’t know the source. Segal also claims it as spurious. \nIf you’re not already familiar with it, I suggest you check out Markwardt’s 2008 paper ref above. Markwardt makes the point that if Edessa was christianised in apostolic times, it would never have become subservient to the the Antioch church, which seems a valid point. His explanation of why the legend was made to refer to Abgar V, rather than to Abgar VIII, was a ruse to record an important religious event in Eessa’s history, while diverting political attention away from Abgar VIII becoming Christian. “Only the names were changed to protect the guilty.” It is also unlikely that a Christian missionary would seek to evangelize a king unless invited to do so. It seems that sons of Abgar V were pagan in any case, and any latent christianity in Edessa would soon be suppressed. I don’t think the charge of scholarly prejudice holds in this case. I find Markwardt’s case persuasive, exceedingly well-referenced, and I suggest you check it out.\n\n","date":"October 25, 2013 at 5:25 pm","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48696","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"BTW: Dave, have you ever heard about conversion of rulers of Adiabene (a country in Assyria next to Osroene ruled by Abgars) to judaism circa 40 AD? Because it seems the accounts of this conversion (in Josephus’ Jewish Antiquites) and conversion of Abgar V to Christianity have some common elements, which most scholars missed, or misinterpreted….\n\n","date":"October 25, 2013 at 6:21 pm","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48699","author":"O.K.","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"daveb of wellington nz :\nEusebius: Yes, Eusebius is the first one to mention the Abgar legend; My Encyc Brit says it was regarded as spurious from the fifth century, but I don’t know the source. Segal also claims it as spurious. \nThey were Jerome (Comm. in Ezech. ad 44, 29-30) and Augustine (Contra Faustum manich. 28,4; De consensu Evang. 1, 7, 11) who considered it spurious, on the basis that had there existed some writings of the Lord it would have been kept in the highest esteem by the Early Church. But it is flawed assertion, as not everything that Jesus or Apostles may have written must be considered biblical canon, for example tax returns and other every-day documents. Later Decretum Gelasianum condemmed alleged correspondence between Abgar and Jesus as an apocrypha.\ndaveb of wellington nz :\nIf you’re not already familiar with it, I suggest you check out Markwardt’s 2008 paper ref above. Markwardt makes the point that if Edessa was christianised in apostolic times, it would never have become subservient to the the Antioch church, which seems a valid point. His explanation of why the legend was made to refer to Abgar V, rather than to Abgar VIII, was a ruse to record an important religious event in Eessa’s history, while diverting political attention away from Abgar VIII becoming Christian. “Only the names were changed to protect the guilty.”\nYes I am familiar, however I consider Markwardt’s theory based on nothing but pure speculations. But I am inclined to the theory that the Shroud arrived at Edessa later, possibly around 200 AD during the reing of Abgar VIII. As to Abgars V & VIII I have several volumes of biblical apocrypha, and I know how the legend evolved. It was always claimed that the first Christian ruler of edessa was Abgar V. So there was probably some historical core of the story. But the first Mandylion was more likely to be today’s Manoppello Image (later known as Image of Camuliana, described in Dan’s next post, and later as Veronica Veil), the Shroud become a Mandylion on a later stage. I think the Mandylion never existed as a single object -it is more general term atributed to various images, painted and miraculous. So the theories that the Shroud was Mandylion, the Manopello was Mandylion, as well as Image of Genua, or that the Mandylion was sold to Louis IX, do not contradict each other actually.\ndaveb of wellington nz :\n It is also unlikely that a Christian missionary would seek to evangelize a king unless invited to do so. \nBut according to the legend, he was invited to do so! It was nothing impossible that a pagan king heard from Jewish merchants about a miraculous healer, in the distant land of Palestine, and wanted to invite him to his kingdom. Moreover, it was very likely, especially in desperate Abgar’s situation. The critics are always narrow-minded and can’t imagine such simple situation.\ndaveb of wellington nz :\nIt seems that sons of Abgar V were pagan in any case, and any latent christianity in Edessa would soon be suppressed. I don’t think the charge of scholarly prejudice holds in this case. I find Markwardt’s case persuasive, exceedingly well-referenced, and I suggest you check it out.\nAs I said Markward’s paper is interesting, but has very weak fundamentals. Nevertheless, it is very likely that the ancient history of the Shroud was much more complex than any scholar has imagined. As to pagan reaction, remember suppresion of monotheism introduced during the reign of Pharaoh Echnaton, after his death. The conversion of Abgar V to Christainity could be attempted to be erased from chronicles in similar way.\n\n","date":"October 25, 2013 at 6:14 pm","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48697","author":"O.K.","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"Are you sure you are referencing Markwardt’s 2008 paper which is much more elaborate than his 1998 paper? If Edessa was evangelised in apostolic times, why would it accept subjugation to the Antioch church? The evangelisation of Edessa in apostolic times can only be speculative, more so than the Edessa image was the Shroud! There is no evidence that Edessa was evangelised much before 200AD, only the Abgar tale, which postdates 200AD! Eusebius was instructed by Pamphilus who was martyred in 310AD, that’s way after 200AD! The first indication of a church in Edessa, was a reference to a flood in 201AD, in a Syriac chronicle, earliest extent edition of the 6th century.\n\n","date":"October 25, 2013 at 7:24 pm","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48703","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"After the granting of toleration to Christians by Constantine in the fourth century ( remember Eusebius was writing then),many cities created a Christian past that took them back to the first century, often, in the west, by claiming that they had a bishop who had been inaugurated by Peter. Most of these stories are, of course, apocryphal but still very powerful e.g one that the evangelist Mark slept on an island in the lagoon at Venice. St. Oronzo of Lecce was supposed to have met the messenger bearing Paul’s letter to the Romans, who landed on the coast near Lecce, been so convinced by it that he sought out Paul and was converted by him and so became the first bishop of Lecce where he is still honoured by a statue in the main square. The Abgar legend would seem to be one of these.\nTreat these legends with care- after the fourth century there was intense competition among Christian communities to prove that they were there first! In most cases, outside the obvious places like Rome, Antioch and Alexandria, we have virtually no supportable historical evidence before c.200.\n\n","date":"October 26, 2013 at 4:34 am","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48743","author":"Charles Freeman","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"\nCharles Freeman :\n In most cases, outside the obvious places like Rome, Antioch and Alexandria, we have virtually no supportable historical evidence before c.200.\n\nAnd that’s nothing surprising in ancient history. The main source of Rome’s early history is Livy who wrote circa 19 BC. The conquests of Alexander the Great were testimonied about 200 years after the events.And so on. If there is little doubt on (general) reliability of those accounts, so why should I doubt accounts about evangelization of Edessa in the first century? Besides, Edessa was outside Greco-Roman world up to 200 AD, and due to that fact, it had little interest in early Church Fathers writings.\n\n","date":"October 26, 2013 at 5:38 am","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48750","author":"O.K.","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"There is lots of doubts about the reliability of these accounts- it’s a major feature in recent scholarship – see for instance Bosworth’s work on Alexander. The difference is that for the Christian accounts ,we can normally trace them back to one source while the writing of Roman history and the history of Alexander uses a lot of different sources that correlate with each other to provide an outline within which interpretations can be made, e.g. extensive archaeological evidence for Rome’s early history as well as other written and epigraphic sources.\n\n","date":"October 26, 2013 at 8:31 am","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48766","author":"Charles Freeman","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"The difference is that for the Christian accounts ,we can normally trace them back to one source while the writing of Roman history and the history of Alexander uses a lot of different sources that correlate with each other to provide an outline within which interpretations can be made, e.g. extensive archaeological evidence for Rome’s early history as well as other written and epigraphic sources\nThere is no difference, the same is true about Christian history. The reliability of accounts of some events depend on reliability of written sources. There is no archeological evidence that the Battle of Cannae ever took place. On the contrary there is archeological evidence that  the Church of the Holy Sepulchre was built in the place of ancinet Jewish cementary outside the walls of Jerusalem.\nThe problem is that double standards are used for secular ancient history, and for ancient Church history. Only in this way the sceptics can make their allegations. Had one standard been used the events from traditional Church history would be considered as one of the best established in antiquity.\n\n","date":"October 26, 2013 at 9:00 am","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48770","author":"O.K.","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"\ndaveb of wellington nz :\nAre you sure you are referencing Markwardt’s 2008 paper which is much more elaborate than his 1998 paper?\n\nRight, I meant 1998 paper. I looked briefly on 2008 paper once, but had no time to study it in depth, I will do it so.\n\ndaveb of wellington nz :\nIf Edessa was evangelised in apostolic times, why would it accept subjugation to the Antioch church? \nPerhaps because Antioch was much greater ciy than Edessa. And don’t forget about time of the first evangelization -30 AD, and subsequent pagan reaction. About 30-33 AD, Christianity was in embryonic form. About 57 AD the pagan rection in Edessa came. The Church structure much developed between 30-33 and 57 AD. The definite split with judaism came only after 70 AD, and destruction of the Temple. Before about 100 AD, the terms bishop and presbyter meant essencially he same. So it is nothing strange that Edessa was evangelised twice, first in the times of Abgar V, who just invited Jesus to his kingdom, and probably was not even aware that the new worlwide religion had already begun there, and for the second time during reign of Abgar VIII, when Church structure was much more developed, and Abgar VIII, influenced by his predecessor decided to adopt Christianity.\n\ndaveb of wellington nzThe evangelisation of Edessa in apostolic times can only be speculative, more so than the Edessa image was the Shroud! There is no evidence that Edessa was evangelised much before 200AD, only the Abgar tale, which postdates 200AD! Eusebius was instructed by Pamphilus who was martyred in 310AD, that’s way after 200AD! The first indication of a church in Edessa, was a reference to a flood in 201AD, in a Syriac chronicle, earliest extent edition of the 6th century.\n\nThere is no evidnece, but on the other hand there are no serious reasons to doubt the event took place. Remember, the first real comprehenisve  history of the Church is that of Eusebius written in the early 4th century. The Acts of the Apostles written by Luke, although very reliable source of information, are actually not history of the Church (and Luke never mentioned that he intended to write such one!), but history of the Paul! The accounts about Peter and early church of Jerusalem are most probably based on the accounts of Peter told Paul, see Galatians, Chapters 1 and 2. \nAnd Eusebius does not mention the second evangelization of Edessa around 200 AD. Outside telling the Abgar Story in Book 1, he does not mention Edessa at all!\nAbout lack of indications of evangelisation of Edessa during Abgar V in Syriac chronicle (you mean this http://www.tertullian.org/fathers/chronicle_of_edessa.htm ), remember this chronicle is very brief, and probably largely incomplete. Remeber that is very likely that Abgar’s V successors tried to destroy testimonies of his conversion.  \nAncient history is very different from modern history remeber. Many events are testimonied not in contemporary sources but those hundreds years after the fact! And in comparison to secular acient history, the ancient church history is quite well established.\n\n","date":"October 26, 2013 at 6:18 am","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48754","author":"O.K.","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"Charles, I would agree that prudence is required in some ancient bishoprics’ claims to apostolic authority. The point had already been made personally to me a number of times by a close friend, a priest, a conservative, who teaches theology in a NZ seminary, and whose opinion I happen to respect despite some friendly disagreements at times.  Perhaps there may have been elements of this in the Abgar legend. However the focus in the legend is very much on the cloth with the image, and it seems to me that the story is of a type that seeks to explain the origin of the cloth, which was apparently deemed sufficiently important to require such an explanation. You will know of many such stories I’m sure, there are several such in the older parts of the OT, particularly Genesis and Exodus, and also in much folklore, primal and ancient religions etc. Something unusual, even if only a landscape feature, needs an explanation, often supernatural or legendary! \nWhile not necessarily agreeing with all the elements of Markwardt’s paper, I think he makes an excellent case of why Abgar VIII chose to place the story in the time of Abgar V, that it was for political reasons, to protect himself against Roman authority, as it suddenly became just a little too dangerous for him to admit to his conversion. However the discovery of the cloth seemed just too important an event not to make a record of it, even though couched in arcane language.  \nIf the story is to be regarded as seeking a claim to being an apostolic see, I doubt that Edessa would have allowed itself to be subject to the church at Antioch. It soon became sufficiently important in its own right as a primary centre of Christian scholarship and learning.\n\n","date":"October 26, 2013 at 6:21 am","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48756","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"O.K.: I think you may be clutching at straws. Markwardt’s 2008 paper makes it quite clear why Abgar VIII would not want to admit to his conversion to imperial authorities. Antioch itself had its own set of problems from the Parthians and later the Persians, and was eventually destroyed. The only evidence for an apostolic conversion of Edessa is the Abgar tale, which by the 5th century was deemed a fiction. Presumably these commentators failed to understand the code in which it was written, very likely by a scribe at the behest of Abgar VIII. It is remarkable that Eusebius does not give an account of the conversion of Abgar VIII. Perhaps he accepted at face value the Abgar tale, which very likely was the only record of the event, even though it was disguised.\n\n","date":"October 26, 2013 at 6:41 am","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48758","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"No Dave. Neither Markwardt nor any other scholar has any proof that the story of Abgar V and his conversion was fabricated during the reign of Abgar VIII. Such allegations are based on nothing but on prejudices, and belief that early Christainity was nothing more than a local Jewish sect. The sources always atribute the first evangelization to Abgar V, although details of the event are often mixed with legendary material, or as in a case of Doctrine ofd Addai confused with conversion of Abgar VIII. The Doctrine of Addai in fact is quite strange mix of sermons and old legends, including Abgar legend as well as finding of the True Cross 300 later. Separating facts from fiction is difficult, but there are some grains of the truth in the story, like in any other legend.\nDave, don’t slavishly adhere to what scholars say. They don’t know the facts, so do I, they only voice their opinions. But my interpretation that conversion of Abgar V really took place is just as justified, as their opinion that it is later invention -or even more, because all the sources atribute that the first ruler of Edessa to adopt Christianity, was Abgar V. Give up old paradigms and you see completely different picture.\nBTW: The Abgar tale was never deemed a fiction in antiquity. Only the authenticity of alleged letters between Jesus and Abgar V was considered spurious, not the essence of the story.\nBTW2:Dave, have you ever heard about conversion of rulers of Adiabene (a country in Assyria next to Osroene ruled by Abgars) to judaism circa 40 AD? Because it seems the accounts of this conversion (in Josephus’ Jewish Antiquites) and conversion of Abgar V to Christianity have some common elements, which most scholars missed, or misinterpreted….\n\n","date":"October 26, 2013 at 7:43 am","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48763","author":"O.K.","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"O.K. There is yet another theory, which I will make available over the Internet shortly, but it is speculation about where the TS may have been till the Fourth Crusade.\n\n","date":"October 26, 2013 at 4:16 pm","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48824","author":"Louis","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"The focus in the Abgar tale is very much on the cloth and its image. Either the cloth was the Shroud or it was some other cloth with an image. We would then have a plethora of cloths with images of Jesus, despite the Jewish aversion to images. The tale is set during Jesus’ own mortal life-time, so it could not be the Shroud and Abgar V was a contemporary of Jesus. You will therefore have to believe in some multiplicity of cloths with images of Jesus. I should be reluctant to do so. \nI take it that you have now read Markwardt’s 2008 paper. In that case we will have to agree to differ on the merits of Markwardt’s 2008 paper. I note that there is no record in the gospels of Jesus multiplying images of himself for general wholesale distribution. It is also unlikely that the Shroud would have been sent to Edessa, a then pagan city, so soon after the crucifixion, as there are several references to it being kept elsewhere, including being kept by Peter, or being given to Pilate’s wife, and also being kept in Syria. \nI therefore find it more credible that the Shroud was hidden in Antioch, and with the impending destruction of the city by earthquake and by Chosros, that it may then have been taken to Edessa in the time of Abgar VIII, leading to creation of the legend. Alternatively, it may have arrived in Constantinople by some other different route entirely.\nFinally if Edessa was evangelised in apostolic times it would have claimed for itself a status of being one of the primary patriarchates, which it did not, nor never did, despite it subsequently being a major centre of Christian scholarship.\n\n","date":"October 26, 2013 at 3:33 pm","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48822","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"\ndaveb of wellington nz :\nThe focus in the Abgar tale is very much on the cloth and its image. Either the cloth was the Shroud or it was some other cloth with an image. We would then have a plethora of cloths with images of Jesus, despite the Jewish aversion to images. The tale is set during Jesus’ own mortal life-time, so it could not be the Shroud and Abgar V was a contemporary of Jesus. You will therefore have to believe in some multiplicity of cloths with images of Jesus. I should be reluctant to do so.\n\nDave, have you forgotten Manoppello Image? An image of the face, that looks like a painting… but is not a painting. Compare with the account in Doctrine of Addai\nI said  that the Mandylion never existed as only one, single object. It was an idea.\n\ndaveb of wellington nz :\nI take it that you have now read Markwardt’s 2008 paper. In that case we will have to agree to differ on the merits of Markwardt’s 2008 paper. I note that there is no record in the gospels of Jesus multiplying images of himself for general wholesale distribution. It is also unlikely that the Shroud would have been sent to Edessa, a then pagan city, so soon after the crucifixion, as there are several references to it being kept elsewhere, including being kept by Peter, or being given to Pilate’s wife, and also being kept in Syria. \nI read it, although briefly. An as I said, I consider that it was more likely, that Manoppello was the original Mandylion. The Shroud of Turin arrived in Edessa later, perhaps from Antioch or elsewhere. Markwardt may be right at this point. We talk about two different things here -the conversion of Abgar V to early Christianity, and arrival of the Shroud to Edessa.\nBesides there were more than one linen. According to the latin verison of Life of Adam and Eve, Adam was buried with three shrouds, so it is entirely possible that more linens were used:\nSee http://www.pseudepigrapha.com/pseudepigrapha/adamnev.htm\nXLVI 4: And the Lord said again to the angels Michael and Uriel: ‘Bring me three linen clothes of byssus and spread them out over Adam and other linen clothes over Abel his son and bury Adam and Abel his son.’\nSee also: Remi Van Haelst, THE SINDON MUNDA OF KORNELIMUNSTER, COMPIEGNE AND CAHORS http://resurrectionnowinc.blogspot.com/2011/01/shroud-images-throughout-world.html\n\ndaveb of wellington nz :\nI therefore find it more credible that the Shroud was hidden in Antioch, and with the impending destruction of the city by earthquake and by Chosros, that it may then have been taken to Edessa in the time of Abgar VIII, leading to creation of the legend. Alternatively, it may have arrived in Constantinople by some other different route entirely.\nAs I said, it is possible. But remember, there were more cloths. The Abgar story may be entirely true, but not necessarily the Shroud must be the original Mandylion.\n\ndaveb of wellington nz :\nFinally if Edessa was evangelised in apostolic times it would have claimed for itself a status of being one of the primary patriarchates, which it did not, nor never did, despite it subsequently being a major centre of Christian scholarship.\n\nWhy? When it was evanglized first there were no patriarchates. And when they began to function, no erlier than 60s AD, Edessa was pagan again. It was only re-evangelised around 200 AD during the reign of Abgar VIII.\n\n","date":"October 26, 2013 at 4:17 pm","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48825","author":"O.K.","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"\ndaveb of wellington nz :\nI take it that you have now read Markwardt’s 2008 paper. In that case we will have to agree to differ on the merits of Markwardt’s 2008 paper.\n\nSo I have read it in depth, and I would like to say, that although interesting, Markwardt’s theory makes less sense than admitting that evangelization of Edessa in the 1st century really took place. He alleges that the whole story of Abgar V was fabricated, but he has not a slighest evidence for this, and the alleged motives of Abgar VIII to do so, are nothing more than pure fantasies. Some guys simply still cannot believe that the early evangelization of Edessa was entirely possible, contrary to biased statements of today’s “experts”.\n\n I note that there is no record in the gospels of Jesus multiplying images of himself for general wholesale distribution.\n\nI want to remind you that in the Gospels, there are no records of any images whatsoever!\n\ndaveb of wellington nz :\nFinally if Edessa was evangelised in apostolic times it would have claimed for itself a status of being one of the primary patriarchates, which it did not, nor never did, despite it subsequently being a major centre of Christian scholarship.\n\nAnd that’s actually argument for the story of Abgar V being real! Despite alleged provenance of Edessa’s Christianity back to Jesus himself (no other city asserted so!), they never claimed a higher authority! \nAnd still you are not aware of one thing. Have you ever considered a guy whose name was Ananias? Have you ever heard about conversion of rulers of Adiabene (a country in Assyria next to Osroene ruled by Abgars) to judaism circa 40 AD? Because it seems the accounts of this conversion (in Josephus’ Jewish Antiquites) and conversion of Abgar V to Christianity have some common elements, which most scholars missed, or misinterpreted…\nI write it for the third time, and still no notice.\n\n","date":"October 26, 2013 at 5:23 pm","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48827","author":"O.K.","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"I have checked out the story of Ananias on at least three different web-sites. I fail to see close parallels with the Abgar story, the only common element being the conversion to (different) Jewish religions of notable personages. It seems that certain pseudo-scholars have an overly-active imagination in embroidering known bare facts, into tales to suit their own predilections. It’s called ‘writing a novel’.\n\n","date":"October 26, 2013 at 8:24 pm","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48836","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"Yes, writing a novel. Just like Markwardt does. But if you look closer at this novel…\nWhat I would like to show you it’s only a theory. Not proven facts! But IMHO such theory is quite likely, even if I can’t prove it.\nSee Josephus’ Jewish Antiquites , Book XX, Chapters 3-4:\nNow, during the time Izates abode at Charax-Spasini, a certain Jewish merchant, whose name was Ananias, got among the women that belonged to the king, and taught them to worship God according to the Jewish religion. He, moreover, by their means, became known to Izates, and persuaded him, in like manner, to embrace that religion; he also, at the earnest entreaty of Izates, accompanied him when he was sent for by his father to come to Adiabene; it also happened that Helena, about the same time, was instructed by a certain other Jew and went over to them. But when Izates had taken the kingdom, and was come to Adiabene, and there saw his brethren and other kinsmen in bonds, he was displeased at it; and as he thought it an instance of impiety either to slay or imprison them, but still thought it a hazardous thing for to let them have their liberty, with the remembrance of the injuries that had been offered them, he sent some of them and their children for hostages to Rome, to Claudius Caesar, and sent the others to Artabanus, the king of Parthia, with the like intentions.\n4. And when he perceived that his mother was highly pleased with the Jewish customs, he made haste to change, and to embrace them entirely; and as he supposed that he could not he thoroughly a Jew unless he were circumcised, he was ready to have it done. But when his mother understood what he was about, she endeavored to hinder him from doing it, and said to him that this thing would bring him into danger; and that, as he was a king, he would thereby bring himself into great odium among his subjects, when they should understand that he was so fond of rites that were to them strange and foreign; and that they would never bear to be ruled over by a Jew. This it was that she said to him, and for the present persuaded him to forbear. And when he had related what she had said to Ananias, he confirmed what his mother had said; and when he had also threatened to leave him, unless he complied with him, he went away from him, and said that he was afraid lest such an action being once become public to all, he should himself be in danger of punishment for having been the occasion of it, and having been the king’s instructor in actions that were of ill reputation; and he said that he might worship God without being circumcised, even though he did resolve to follow the Jewish law entirely, which worship of God was of a superior nature to circumcision. He added, that God would forgive him, though he did not perform the operation, while it was omitted out of necessity, and for fear of his subjects. So the king at that time complied with these persuasions of Ananias. But afterwards, as he had not quite left off his desire of doing this thing, a certain other Jew that came out of Galilee, whose name was Eleazar, and who was esteemed very skillful in the learning of his country, persuaded him to do the thing; for as he entered into his palace to salute him, and found him reading the law of Moses, he said to him, “Thou dost not consider, O king! that thou unjustly breakest the principal of those laws, and art injurious to God himself, [by omitting to be circumcised]; for thou oughtest not only to read them, but chiefly to practice what they enjoin thee. How long wilt thou continue uncircumcised? But if thou hast not yet read the law about circumcision, and dost not know how great impiety thou art guilty of by neglecting it, read it now.” When the king had heard what he said, he delayed the thing no longer, but retired to another room, and sent for a surgeon, and did what he was commanded to do. He then sent for his mother, and Ananias his tutor, and informed them that he had done the thing; upon which they were presently struck with astonishment and fear, and that to a great degree, lest the thing should be openly discovered and censured, and the king should hazard the loss of his kingdom, while his subjects would not bear to be governed by a man who was so zealous in another religion; and lest they should themselves run some hazard, because they would be supposed the occasion of his so doing. But it was God himself who hindered what they feared from taking effect; for he preserved both Izates himself and his sons when they fell into many dangers, and procured their deliverance when it seemed to be impossible, and demonstrated thereby that the fruit of piety does not perish as to those that have regard to him, and fix their faith upon him only.\nSee Acts of the Apostles 9:10-19:\nIn Damascus there was a disciple named Ananias. The Lord called to him in a vision, “Ananias!”\n“Yes, Lord,” he answered.\n11 The Lord told him, “Go to the house of Judas on Straight Street and ask for a man from Tarsus named Saul, for he is praying. 12 In a vision he has seen a man named Ananias come and place his hands on him to restore his sight.”\n13 “Lord,” Ananias answered, “I have heard many reports about this man and all the harm he has done to your holy people in Jerusalem. 14 And he has come here with authority from the chief priests to arrest all who call on your name.”\n15 But the Lord said to Ananias, “Go! This man is my chosen instrument to proclaim my name to the Gentiles and their kings and to the people of Israel. 16 I will show him how much he must suffer for my name.”\n17 Then Ananias went to the house and entered it. Placing his hands on Saul, he said, “Brother Saul, the Lord—Jesus, who appeared to you on the road as you were coming here—has sent me so that you may see again and be filled with the Holy Spirit.” 18 Immediately, something like scales fell from Saul’s eyes, and he could see again. He got up and was baptized, 19 and after taking some food, he regained his strength.\nSee Eusebius: \n1. The divinity of our Lord and Saviour Jesus Christ being noised abroad among all men on account of his wonder-working power, he attracted countless numbers from foreign countries lying far away from Judea, who had the hope of being cured of their diseases and of all kinds of sufferings.\n2. For instance the King Abgarus, who ruled with great glory the nations beyond the Euphrates, being afflicted with a terrible disease which it was beyond the power of human skill to cure, when he heard of the name of Jesus, and of his miracles, which were attested by all with one accord sent a message to him by a courier and begged him to heal his disease.\n3. But he did not at that time comply with his request; yet he deemed him worthy of a personal letter in which he said that he would send one of his disciples to cure his disease, and at the same time promised salvation to himself and all his house.\n4. Not long afterward his promise was fulfilled. For after his resurrection from the dead and his ascent into heaven, Thomas, one of the twelve apostles, under divine impulse sent Thaddeus, who was also numbered among the seventy disciples of Christ, to Edessa, as a preacher and evangelist of the teaching of Christ.\n5. And all that our Saviour had promised received through him its fulfillment. You have written evidence of these things taken from the archives of Edessa, which was at that time a royal city. For in the public registers there, which contain accounts of ancient times and the acts of Abgarus, these things have been found preserved down to the present time. But there is no better way than to hear the epistles themselves which we have taken from the archives and have literally translated from the Syriac language219 in the following manner.\nCopy of an epistle written by Abgarus the ruler to Jesus, and sent to him at Jerusalem by Ananias\n6. “Abgarus, ruler of Edessa, to Jesus the excellent Saviour who has appeared in the country of Jerusalem, greeting. I have heard the reports of thee and of thy cures as performed by thee without medicines or herbs. For it is said that thou makest the blind to see and the lame to walk, that thou cleansest lepers and castest out impure spirits and demons, and that thou healest those afflicted with lingering disease, and raisest the dead.\n7. And having heard all these things concerning thee, I have concluded that one of two things must be true: either thou art God, and having come down from heaven thou doest these things, or else thou, who doest these things, art the Son of God.\n8. I have therefore written to thee to ask thee that thou wouldest take the trouble to come to me and heal the disease which I have. For I have heard that the Jews are murmuring against thee and are plotting to injure thee. But I have a very small yet noble city which is great enough for us both.”\n101The answer of Jesus to the ruler Abgarus by the courier Ananias.\n9. “Blessed art thou who hast believed in me without having seen me. For it is written concerning me, that they who have seen me will not believe in me, and that they who have not seen me will believe and be saved. But in regard to what thou hast written me, that I should come to thee, it is necessary for me to fulfill all things here for which I have been sent, and after I have fulfilled them thus to be taken up again to him that sent me. But after I have been taken up I will send to thee one of my disciples, that he may heal thy disease and give life to thee and thine.”\n10. To these epistles there was added the following account in the Syriac language. “After the ascension of Jesus, Judas, who was also called Thomas, sent to him Thaddeus, an apostle,one of the Seventy. When he was come he lodged with Tobias, the son of Tobias. When the report of him got abroad, it was told Abgarus that an apostle of Jesus was come, as he had written him.\n11. Thaddeus began then in the power of God to heal every disease and infirmity, insomuch that all wondered. And when Abgarus heard of the great and wonderful things which he did and of the cures which he performed, he began to suspect that he was the one of whom Jesus had written him, saying, ‘After I have been taken up I will send to thee one of my disciples who will heal thee.’\n12. Therefore, summoning Tobias, with whom Thaddeus lodged, he said, I have heard that a certain man of power has come and is lodging in thy house. Bring him to me. And Tobias coming to Thaddeus said to him, The ruler Abgarus summoned me and told me to bring thee to him that thou mightest heal him. And Thaddeus said, I will go, for I have been sent to him with power.\n13. Tobias therefore arose early on the following day, and taking Thaddeus came to Abgarus. And when he came, the nobles were present and stood about Abgarus. And immediately upon his entrance a great vision appeared to Abgarus in the countenance of the apostle Thaddeus. When Abgarus saw it he prostrated himself before Thaddeus, while all those who stood about were astonished; for they did not see the vision, which appeared to Abgarus alone.\n14. He then asked Thaddeus if he were in truth a disciple of Jesus the Son of God, who had said to him, ‘I will send thee one of my disciples, who shall heal thee and give thee life.’ And Thaddeus said, Because thou hast mightily believed in him that sent me, therefore have I been sent unto thee. And still further, if thou believest in him, the petitions of thy heart shall be granted thee as thou believest.\n15. And Abgarus said to him, So much have I believed in him that I wished to take an army and destroy those Jews who crucified him, had I not been deterred from it by reason of the dominion of the Romans. And Thaddeus said, Our Lord has fulfilled the will of his Father, and having fulfilled it has been taken up to his Father. And Abgarus said to him, I too have believed in him and in his Father.\n16. And Thaddeus said to him, Therefore I place my hand upon thee in his name. And when he had done it, immediately Abgarus was cured of the disease and of the suffering which he had.\n17. And Abgarus marvelled, that as he had heard concerning Jesus, so he had received in very deed through his disciple Thaddeus, who healed him without medicines and herbs, and not only him, but also Abdus227 the son of Abdus, who was afflicted with the gout; for he too came to him and fell at his feet, and having received a benediction by the imposition of his hands, he was healed. The same Thaddeus cured also many other inhabitants of the city, and did wonders and marvelous works, and preached 102the word of God.\n18. And afterward Abgarus said, Thou, O Thaddeus, doest these things with the power of God, and we marvel. But, in addition to these things, I pray thee to inform me in regard to the coming of Jesus, how he was born; and in regard to his power, by what power he performed those deeds of which I have heard.\n19. And Thaddeus said, Now indeed will I keep silence, since I have been sent to proclaim the word publicly. But tomorrow assemble for me all thy citizens, and I will preach in their presence and sow among them the word of God, concerning the coming of Jesus, how he was born; and concerning his mission, for what purpose he was sent by the Father; and concerning the power of his works, and the mysteries which he proclaimed in the world, and by what power he did these things; and concerning his new preaching, and his abasement and humiliation, and how he humbled himself, and died and debased his divinity and was crucified, and descended into Hades, and burst the bars which from eternity had not been broken, and raised the dead; for he descended alone, but rose with many, and thus ascended to his Father.\n20. Abgarus therefore commanded the citizens to assemble early in the morning to hear the preaching of Thaddeus, and afterward he ordered gold and silver to be given him. But he refused to take it, saying, If we have forsaken that which was our own, how shall we take that which is another’s? These things were done in the three hundred and fortieth year.”\nI have inserted them here in their proper place, translated from the Syriac232 literally, and I hope to good purpose. \n\n","date":"October 27, 2013 at 5:42 am","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48874","author":"O.K.","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"If you still don’t understand, I’ll try to explain. Adiabene and Osroene (the capital of latter was Osroene) were two neighbouring kingdoms in Assyria on the Silk Road. In the 1st century trade with the East flourished, and was largely maintained by Jews, who also sometimes served as diplomatic couriers. One of them was Ananias (known also as Hannan in different version of Abgar legend). Ananias was messenger between King Abgar and Jesus. He became one of the first christians in Edessa, however at that time there was no such term as “christian”. Christianity was only a branch of Judaism. But Abgar was a gentile, and nevertheless Jesus sent a missionary to his kingdom! This was breakthrough, suggesting that uncircumcised gentiles can also worship God. This was absolute heresy for the Jews!\nLater, as reported in Acts, one Jewish merchant, known as Ananias baptised a fanatical pharisee Saul, student of Gamaliel, who couldn’t even imagine such violation of Jewish law. Saul became Paul, and became most vocal opponent of necessity of circumsition of the gentiles, we all know this from his letters. This eventually led to the Council of Jerusalem in 50 AD, which declared that the gentiles didn’t have to be circumcised. \nWho taught Paul this view? Who was his first master of Christianity? A certain disciple known as Ananias\nAnd a few years later, a certain Jewish merchant known as Ananias came to the kingdom of Adiabene, right next to Osroene, and converted its king to the “Jewish faith” (remember Christianity was considered a jewish sect at that time). And he said that he might worship God without being circumcised, even though he did resolve to follow the Jewish law entirely, which worship of God was of a superior nature to circumcision, as related by Josephus. Unfortunately, another Jew from Galilee, whose name was Eleazar, came, and convinced Izates that circumsition was absolutely necessary for a Jew (compare with Paul’s complaints in Galatians). Thus Izates became a Jew, instead of Christian.\nDon’t you see that everything fits here perfectly?\n\n","date":"October 27, 2013 at 6:00 am","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48878","author":"O.K.","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"Here’s something for O.K.: Incidentally my comment about pseudo-scholars above was directed at about three of them while I was checking out your Ananias. All three I checked out had rather preposterous ideas, including an anti-christian one which placed Jesus in the 6th century, and was otherwise something of a garbled mess, so please don’t take it personally – it’s just the luck of googling. \nI was scanning my Encyc Brit on Edessa, dropped onto a reference about St Simon the Zealot, one of the Apostles. Little seems to be known about him. His being called the Zealot may merely have been to distinguish him from Simon Peter. He is supposed to have preached the gospel in Egypt and then joined the apostle St Jude (Thaddeus = Addai) in Persia. According to the apocryphal Acts of Judas & Simon, he is supposed to have been martyred there by being cut in half by a saw, one of his iconographic symbols. But according to St Basil the Great, 4th c. Cappadocian Father, St Simon DIED PEACEFULLY IN EDESSA! [That would have to be late 1st century and no later than early 2nd century!) The connection of Simon with Thaddeus (= Addai) and also Edessa, is at least suggestive, particularly if Simon was able to die peacefully there. Of course Basil could be making some unwarranted inferences if he was making some assumptions about Abgar V and the doctrine of Addai – he may well have known about both stories in the 4th c.\n\n","date":"October 27, 2013 at 5:57 am","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48877","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"O.K.: Our two latest postings overlapped, both coming up at the same time. I have read both previously, the story about Izates, earlier today, and which certain others have unduly embroidered as I mentioned above. Ian Wilson makes the point that Edessa is not that far from Antioch, compared to other missionary journeys undertaken, and that it would be remarkable if some attempt had not been made to evangelise the city. However, in all cities that Paul ever visited, he always preached to the Jews in their local synagogues first. It seems that there had to be a Jewish presence in the city beforehand. Was there one such in Edessa? I’m not sure whether that is known or not, the local gods were Bel & Nebo. \nActs states that it was Ananias who baptized Paul, but under protest. Was it the same Ananias who instructed Izotes? We don’t know, but there was a very limited number of names in those days, and it may have been a different Ananias. There is no reference to baptism in the Izotes story; Izotes is to be accepted into the Jewish faith, and there is no mention of Jesus, even obliquely. Now suppose that the Abgar legend was set down in the time of Abgar VIII. There are two 1st century local stories circulating about a messenger named Ananias, one about baptizing Paul, the other about converting a nearby king into the Jewish faith. Therefore in writing up a story about the conversion of Abgar V, the messenger will also be called Ananias, because that’s the sort of thing Ananias did and he’s a prime 1st century candidate for the role! So really I think we end up no wiser about the true situation at all. \nI think the point of all our discussion on this, concerns the timing of the arrival of a cloth with an image of Jesus on it, which became known as the Image of Edessa. We don’t know if that was the Shroud as Ian Wilson claims, or whether it was something else. It is possible that Abgar V may have been baptised; if he was, Christianity in Edessa was nonetheless short-lived. The story about Addai arriving in Abgar V’s court with such an image, does seem to be a subsequent attempt to explain the arrival of the image, with the purpose of enhancing the status of Edessa. Pope Gelasius in the 5th century considered it spurious, and a fiction. I think it more likely that such icons would have been secretly and carefully guarded by trusted members of the early Church, and that any taken to Edessa, would only be because their safety was now threatened and Edessa had in that time become the safest place to keep them.\n\n","date":"October 27, 2013 at 7:06 am","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48884","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"\ndaveb of wellington nz :\nHowever, in all cities that Paul ever visited, he always preached to the Jews in their local synagogues first. It seems that there had to be a Jewish presence in the city beforehand. Was there one such in Edessa? I’m not sure whether that is known or not, the local gods were Bel & Nebo.\n\nYes, according to the Doctrine of Addai there was sizeable Jewish community in Edessa, which is nothing unusal. Here you have the text:\nhttp://www.apostle1.com/doctrine-addai-syriac-orthodox1.htm\nBut remeber, the mission in Edessa was a very special case. It was performed on personal invitation from King Abgar to Jesus himself! And is quite likely that Jesus requested disciples to send King Abgar the cloth that later would have been known as the Image of Edessa, whether it was the Shroud, or perhaps rather Manopello.\n\ndaveb of wellington nz\nActs states that it was Ananias who baptized Paul, but under protest. Was it the same Ananias who instructed Izotes? We don’t know, but there was a very limited number of names in those days, and it may have been a different Ananias.\n\nAs I said, I cannot prove that three Ananias were actually one and the same person. But their characteristics are very similar, so it is quite likely, and cannot be dismissed so easily, as the so-called “scholars” say, because it runs contrary to their usual paradigms.\n\ndaveb of wellington nz\nThere is no reference to baptism in the Izotes story; Izotes is to be accepted into the Jewish faith, and there is no mention of Jesus, even obliquely.\n\nYes, but remember that Izates ultimately became a Jew, not Christian (or at least not Pauline Christian), and the account of Josephus comes from the second hand, and I bet it is selective. The only Jewish sect we know that abandoned circumsition was Christianity. That was so shocking for a Jew, more even than belief in Jesus, so that the story concntrated on this topic. This was the most crispy detail in that story.\n\ndaveb of wellington nz Now suppose that the Abgar legend was set down in the time of Abgar VIII. There are two 1st century local stories circulating about a messenger named Ananias, one about baptizing Paul, the other about converting a nearby king into the Jewish faith. Therefore in writing up a story about the conversion of Abgar V, the messenger will also be called Ananias, because that’s the sort of thing Ananias did and he’s a prime 1st century candidate for the role! So really I think we end up no wiser about the true situation at all. \nThat’s what most scholars believe, but this version is not a bit better than mine. Actually, it runs contrary to the sources which all claim that it was Abgar V, not VIII who first introduced Christianity to Edessa. Assuming otherwise, would be assuming that the whole story of Abgar, Ananias, Thadeus-Addai, Thomas Apostle, and so on was fabricated on purpose, but we have no evidence for such conspiracy. But of course most critical scholars of early Christianity have quite paranoid vision of it, so early Christans are considered fakers, fraudsters, who did nothing, but invented some pious fairy tales, fabricated evidence, forged their relics, faked their writings and so on. Christian = Liar in their minds. \n\ndaveb of wellington nz\nI think the point of all our discussion on this, concerns the timing of the arrival of a cloth with an image of Jesus on it, which became known as the Image of Edessa. We don’t know if that was the Shroud as Ian Wilson claims, or whether it was something else.\nSee account about Edessa Image in Doctrine of Addai:\nWhen Hannan, the keeper of the archives, saw that Jesus spake thus to him, by virtue of being the king’s painter, he took and painted a likeness of Jesus with choice paints, and brought with him to Abgar the king, his master. And when Abgar the king saw the likeness, he received it with great joy, and placed it with great honour in one of his palatial houses.\nThis description matches the Manoppello much better than the Shroud! \n\ndaveb of wellington nz\n It is possible that Abgar V may have been baptised; if he was, Christianity in Edessa was nonetheless short-lived. The story about Addai arriving in Abgar V’s court with such an image, does seem to be a subsequent attempt to explain the arrival of the image, with the purpose of enhancing the status of Edessa. Pope Gelasius in the 5th century considered it spurious, and a fiction. I think it more likely that such icons would have been secretly and carefully guarded by trusted members of the early Church, and that any taken to Edessa, would only be because their safety was now threatened and Edessa had in that time become the safest place to keep them.\n\nAs I said, if Jesus had personally requested such transfer of the one of miraculous images of Himself (Manoppello or the Shroud), that explains everything. It is often raised that in the first versions of Abgar’s tale there are no mentions about the image. One however must remember that the image was lost at that time, and theological objections against the veneration of images. But see account of Eusebius, who was against images:\nTobias therefore arose early on the following day, and taking Thaddeus came to Abgarus. And when he came, the nobles were present and stood about Abgarus. And immediately upon his entrance a great vision appeared to Abgarus in the countenance of the apostle Thaddeus. When Abgarus saw it he prostrated himself before Thaddeus, while all those who stood about were astonished; for they did not see the vision, which appeared to Abgarus alone.\n“A great vision” is most likely an allusion to the Image of Edessa, slightly censored by iconoclast Eusebius.\n\n","date":"October 27, 2013 at 1:31 pm","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48906","author":"O.K.","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"O.K.: Thank you for the comments and for the web ref on the Doctrine of Addai which I’ve now saved to my folder. There are clearly several elements in the story which can only postdate the crucifixion and resurrection. The section describing Hanan painting Jesus, may be Eusebius’ explanation of the image (shades of Bishop D’Arcis) but I believe the Image of Edessa was something more than this. I get the impression you are much more ready to accept the story at face value than I’m able to. There may be a few elements in the story reflecting memories of actual occurences. As I said previously, it would be remarkable if there had not been some apostolic attempt to evangelize Edessa, because of its relative proximity to Antioch. I could accept for example that Abgar V may have been converted to Christianity, but it’s by no means certain.\nI feel inevitably drawn to the conclusion, that any such special images of Jesus, whether Shroud or Manopello, or anything such, would have been secretly kept by trusted members of the early Christian community, and not distributed elsewhere, regardless of whether the prospective recipient was a king or not. I see the story as written to explain the eventual arrival of the image in Edessa, taken there because its safety had come under threat, and Edessa had now become the safest place to relocate it. Its arrival there had to be explained, but the explanation given I think cannot be accepted as factual. Markwardt’s attempt to rationalise the origin of the story may be closer to the mark than it would seem you’re prepared to accept. One merely has to change the names of the participants, because it had become dangerous to identify who they actually were.  \nConcerning the frequency of names in apostolic times: Of 917 Jewish ossuaries, most of them probably 1st century to 70 AD, there were 286 names on 231 inscribed ossuaries. The name Ananias (Hananiah) occured 10 times, about 3.5% of all the names. It cannot therefore be concluded that the Hanan… in all three stories (Paul, Izotes, Abgar) is necessarily the same person.\n\n","date":"October 27, 2013 at 3:54 pm","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48917","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"\ndaveb of wellington nz :\nI feel inevitably drawn to the conclusion, that any such special images of Jesus, whether Shroud or Manopello, or anything such, would have been secretly kept by trusted members of the early Christian community, and not distributed elsewhere, regardless of whether the prospective recipient was a king or not.\n\nActually most of the relics of the Christ (True Cross, Nails, Crown of Thorns, garments, Sudarium of Oviedo, Holy Spear and many more) were kept in Jerusalem or vicinity (we can trace their provenance back to there), and only in later centuries distributed elsewhere. But the Image of Edessa, whether it was Shroud or Turin, or Manoppello -it could be sent to Abgar, if Jesus Himself instructed the Disciples to do so. God knows why, for what purpose, he keeps a safe hand over it. So I have no problem with accepting the core of the story at face value, despite many different variants of it. Besides Edessa had very close ties with Thomas Apostle, his relics were brought back there around 200 AD from India, until redistributed later. We don’t know many facts about early Christianity, and its vigour and potential still may surprise us.\n\ndaveb of wellington nz : I see the story as written to explain the eventual arrival of the image in Edessa, taken there because its safety had come under threat, and Edessa had now become the safest place to relocate it. Its arrival there had to be explained, but the explanation given I think cannot be accepted as factual.\n\nActually, the early versions of Abgar legend concentrated more on alleged correspondence between Abgar and Jesus, (or on doctrinal and moral issues) and less on the Image. The two sentences I quoted from the Doctrine of Addaia , are the only mentions about the image, in the text that is some 30 pages long!\nBTW, here you have the Pilgrimage of Egeria, and her versio of the story:\nhttp://digital.library.upenn.edu/women/egeria/pilgrimage/pilgrimage.html\n\n","date":"October 27, 2013 at 6:16 pm","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48929","author":"O.K.","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"Oh, and some other links:\nhttp://www.newadvent.org/fathers/0859.htm\nhttp://books.google.pl/books/about/Edessa.html?id=54ge-4Z67t8C&redir_esc=y\n\n","date":"October 27, 2013 at 6:43 pm","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-48931","author":"O.K.","site":"shroudstory"},{"title":"Paper Chase: Thomas & The Hymn of the Pearl","post":"Reblogged this on Best of Shroud Story.\n\n","date":"August 15, 2014 at 2:14 pm","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","id":"comment-144062","author":"Dan","site":"shroudstory"}]
