[{"title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson","post":"I don’t really understand Freeman’s criticism of Wilson’s work.  The stock he puts in the bishop’s statements that it was a forgery have proven unreliable and false.\n\n","date":"September 3, 2012 at 12:52 pm","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","id":"comment-15787","author":"Andy Weiss","site":"shroudstory"},{"title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson","post":"It just seems that this is his starting point to his other criticisms, but considering this starting point is faulty, I just wonder what other of his criticisms rest on faulty premises.\n\n","date":"September 3, 2012 at 1:01 pm","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","id":"comment-15788","author":"Andy Weiss","site":"shroudstory"},{"title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson","post":"I sense Mr. jones frustration, and honestly, I don’t blame him! There are so many issues with Freeman’s paper that it ‘almost’ can be construed as a deliberate attempt to mislead his readers. The out-of-focus image above is possibly just another one of those attempts…Anyone think I’m being too harsh? To bad…Did anyone read the part in Freeman’s paper about the ‘folded hanky’ (tetradiplon), where it ends up as a square? LOL. Seriously Freeman’s paper is a joke and the fact he endorses Yannick’s many points, is an even bigger joke. As many of YC’s points have been ‘properly’ refutted by several people here, and not just me, and many many times over. Yet YC simply ignores these arguments, as I would suggest Freeman has also, and YC keeps writing…It makes me nauseated! …Seems to me, Freeman may have chosen to read only YC’s comments on this blog and turned a blind eye to all others.\nIf Freeman’s paper is an example of ‘Historians/scholars writings, outside the Shroud-world’ in attempt to discredit Wilson’s hypothesis, then this is a sad world we live in.\nR\n\n","date":"September 3, 2012 at 6:31 pm","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","id":"comment-15814","author":"Ron","site":"shroudstory"},{"title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson","post":"So long as Ron’s comments make people actually read my articles ‘Charles Freeman Shroud of Turin and the Image of Edessa- A Misguided Journey ‘ and ‘Tetradiplon Revisited’, I have no problems.\nIncidentally the fuzzy photo is only because that was the best my Iphone could do when i came, completely unexpectedly, on a representation of the Mandylion- no attempt here to deceive anyone!\nWhat is Andy on about ‘the bishop’ ? I actually say in my article that such comments about fakes need to be taken with caution because rival shrines often tried to discredit each other-after all there were several shrines claiming to have the burial shroud of Jesus and , although this was not the case here, you tried to slam your rivals by saying yours was the genuine relic and theirs was the fake- and they would do the same back to you! However, if Andy had read my articles he would know that the ‘fake report’ hardly plays any part in my critique of Wilson.\n\n","date":"September 4, 2012 at 3:25 am","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","id":"comment-15824","author":"Charles Freeman","site":"shroudstory"},{"title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson","post":"Mr Freeman, with all due respect, I’m sorry but I cannot accept your explanation for the ‘fuzzy’ photo. For one you could have easily searched for a better depiction! Second; You simply failed to explain that the image was of a ‘wall panel’ which would explain completely, it’s shape not adhering to most all renditions of the Image of Edessa, that being; as a face on a rectangle (landscaped) shaped linen.\nR\n\n","date":"September 4, 2012 at 12:49 pm","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","id":"comment-15843","author":"Ron","site":"shroudstory"},{"title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson","post":"You may not, Ron, it just happens to be the truth. It is not often that one comes across a Mandylion face to face as it were in a totally unexpected place and I was determined to record it.   I was not techy enough to know how to get my Iphone to take an unfuzzy picture.\nOnly the most fevered imaginations could think that I had set out to deceive anyone but I applaud your and Stephen Jones’ imagination. It all adds to the fun.\n\n","date":"September 4, 2012 at 1:37 pm","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","id":"comment-15845","author":"Charles Freeman","site":"shroudstory"},{"title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson","post":"Mr. Freeman, I don’t believe “imagination” comes into play here wahtsoever. ‘A picture speaks a thousand words’… I found a prestine representation just as quickly as Mr Jones did, with a simple Google search! Moreover, you haven’t addressed the second point whatsoever! Which by far is the most importance of the two.\nFurthermore, I would like to add to Mr Jones critic of your work and precisely to your comment as to the linen’s low probability of surviving “in damp” over hundreds of years; In addition to Mr. Jones referal to Wilson’s explanation of the Shroud being actually ‘sealed’ in the wall, (which you also did not make evident in your article), you obviously show a lack of knowledge in the fact that Edessa or Antioch are situated in a “semi-arid” climate of “very low humidity or rainfall”. You also have not studied very well the attributes or qualities of Linen itself. Linen (flax), is probably the most enduring of fabrics created, it has a far greater endurance and strength to others, as in cotton or wool and one of the few that are stronger wet then dry. Many samples much older then the Shroud have been found intact and some in prestine condition. Case in point- A linen cloth found in an ‘open-air’ Qumran cave dating most probably to the 1st century AD, still in prestine condition and of a single one to one weave, not of the ‘stronger’ 3 to 1 weave we find on the Shroud…There can be no argument that the Shroud could have survived quite well for hundreds of years, let alone even thousands of years, if ‘SEALED’ in a stone wall or stone gate.\nR\n\n","date":"September 4, 2012 at 2:51 pm","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","id":"comment-15847","author":"Ron","site":"shroudstory"},{"title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson","post":"Please excuse some typing errors above, thanks.\n\n","date":"September 4, 2012 at 3:09 pm","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","id":"comment-15850","author":"Ron","site":"shroudstory"},{"title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson","post":"What evidence does Wilson provide that not only was the Shroud of Turin concealed in a wall for several hundred years but actually SEALED IN IN MORTAR? Please refer to the original Greek text- I am sure Davor will help you out if you get stuck (in a wall or elsewhere).\nIf you read Wilson thoroughly he refers to the floods that swept Edessa – actually that coastline is quite damp in winter, summer is different but we have to keep our cloth dry all through the year.\n\n","date":"September 4, 2012 at 5:41 pm","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","id":"comment-15853","author":"Charles Freeman","site":"shroudstory"},{"title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson","post":"According to Ron :”You obviously show a lack of knowledge in the fact that Edessa or Antioch are situated in a “semi-arid” climate of “very low humidity or rainfall”. ”\nPrecipitation for Urfa, formerly Edessa.\nMean Monthly ValueInches3.532.92.11.20.10.10.10.11.31.73.61.6\nThis is not a semi-arid climate of very low rainfall – the winters, as I have said above, are quite damp. Please don’t  accuse someone of ignorance until you have established the facts for yourself.\nBut what is the point of arguing – I feel I am just banging my head against an Edessa brick wall, which may or may not have a cloth concealed behind it sealed in in mortar.\n\n","date":"September 4, 2012 at 5:53 pm","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","id":"comment-15854","author":"Charles Freeman","site":"shroudstory"},{"title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson","post":"The legend that the Image of Edessa was walled up in Edessa is very likely a local adaptation of its actually being walled up in the wall of the Cherubim in Antioch, but removed to Edessa prior to Persian destruction of Antioch in the ~6th century.  Monthly rainfall in Antioch does not exceed 0.5 inches November to April, and rapidly declines to a few mm during the summer months. \nI note that the “fuzzy” representation of the Mandylion in Mr Freeman’s paper, showing a distinctive border, dates only from around 1350, a poor choice to make his point.  Earlier depictions of the Mandylion clearly show it in landscape aspect with a trellised overlay.\n\n","date":"September 4, 2012 at 7:58 pm","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","id":"comment-15858","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson","post":"Better check your facts Charles, Urfa IS situated in an semi-arid climate zone. But you missed the point of my comment! Which was geared toward the possibility of a linen cloth, IF concealed in a sealed niche in a main gate (these gates could be quite high apparently) surviving centuries. As for mortar, Why not? Mortar (or a facsimile of) was commonly used in ancient times in the contruction of walls, gates what have you. Why is it so hard to accept it’s use in the sealing of an object of veneration high in a gate? If the ‘Shroud’ was concealed or sealed in the entrance gate, of either city, and I am not saying I stand by that assertion, it would definately survive many centuries.\nR\n\n","date":"September 5, 2012 at 7:42 am","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","id":"comment-15879","author":"Ron","site":"shroudstory"},{"title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson","post":"I should have also stated; As mortar was commonly used, it could be easily asserted it WOULD be used in the process of concealing something in a wall or gate.\nR\n\n","date":"September 5, 2012 at 7:46 am","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","id":"comment-15880","author":"Ron","site":"shroudstory"},{"title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson","post":"Dave B:There is actually no evidence that the Shroud was ever in Antioch, let alone Edessa, but as this point has been made over and over again by professional historians, I am not going to repeat it again.\n There is an immense gulf between professional historians and amateurs such as Wilson.  Among my professional jobs as a historian was to act for many years as an Examiner in History and Theory of Knowledge ( Critical Thinking) for the International Baccalaureate so it was part of my job to sort out the good aspiring historians from the duds and good arguments from bad.I note that Dave B you have no background in history so perhaps you can just take my word for it that Wilson hasn’t a clue how to use evidence. If he sees the word ‘icon’ or ‘image’ he assumes that it is the Shroud as if there were no other images and icons around. He would have failed any academic exam on these grounds alone because learning how to use evidence accurately is a  starter skill, assumed to have been mastered by 18 year -old budding historians.\nWilson must know that his ideas have no academic support but he just goes on repeating them- I leave it to others to discuss his motives for doing this. Perhaps he really does go to bed each night thinking that the Image of Edessa and the Shroud of Turin are one and the same. It is a pity that he shows no sign over all these years of having mastered Greek or read in the wider field of relic cults-he has had since 1978! So far as I can see he simply repeats the same arguments over and over again as if there was no other professional work going on in Byzantine studies or relic cults that completely undermines his arguments.\n   I can only repeat the consensus of professional historians that there is no documentary evidence for the existence of the Shroud before the fourteenth century- not a single mention of a cloth with a double image anywhere.\nQuite happy to admit that my choice of the Mandylion was a poor one- there are lots of alternatives showing a head that is clearly separated from any body and not a hint anywhere that this was a shroud- rather a mass of evidence that it was a cloth dating from the sixth century AD which had a legendary past added to it to give it credibility.\n\n","date":"September 5, 2012 at 4:17 am","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","id":"comment-15865","author":"Charles Freeman","site":"shroudstory"},{"title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson","post":"I would be interested in reading some articles by these ‘Professional Historians’ we keep hearing about, but more precisely, any papers which have refuted Wilson’s hypothesis. If you could link us to some articles, it would be much appreciated, as in my Google searches, I haven’t been able to find anything on the matter and not one of these Historians have bothered to place any of their papers on shroud.com, which is odd.\nThanks,\nR\n\n","date":"September 5, 2012 at 8:10 am","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","id":"comment-15883","author":"Ron","site":"shroudstory"},{"title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson","post":"Our friend Andrea Nicolotti is the place to start, and he will surely suggest many other works, but I would suggest that you read Hans Belting on the Mandylion in his Likeness and Presence, as he provides the evidence for it being made in the sixth century alongside others of the same kind (most of which disappeared in the iconoclastic controversy).You have to dig about a bit to find what you want in L and P but I don’t think you can find anyone more ‘professional’ than Belting.If the Image of Edessa is sixth century, as the evidence overwhelmingly suggests, then Wilson’s thesis collapses anyway\n  Averil Cameron showed up the linguistic problems of Wilson’s analysis , as have many others, in her 1980 lecture although it is difficult to find a copy now. Wilson’s counter-attack, made many years later in  which admits he did not have much Greek (!) – hardly impressive for Cameron, one of the world’s foremost Byzantine scholars- failed to address the problems she raised. She was right not to bother to reply although she has outed the inadequacies of Mark Guscin’s  book on the Image of Edessa.\n As Wilson provides no acceptable evidence for a pre-sixth century existence, it is not surprising that no historian has bothered much with this aspect of his thesis – what would there be to refute? You can read the end of my article on the subject but i could not find any evidence worth dealing with and I am sure it is the same for others.\nDavor, Andrea and others will provide a fuller check- list, I think .\n\n","date":"September 5, 2012 at 9:01 am","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","id":"comment-15887","author":"Charles Freeman","site":"shroudstory"},{"title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson","post":"Es muy difícil mantener la NEUTRALIDAD, la objetividad, en un tema como el de la Sábana Santa. Y me refiero tanto a defensores como a los no defensores de la autenticidad.\n“I can only repeat the consensus of professional historians that there is no documentary evidence for the existence of the Shroud before the fourteenth century- not a single mention of a cloth with a double image anywhere.”\n¿Hay evidencia documental de la existencia de alguna Sábana con simple imagen del cuerpo entero (no doble) anterior al siglo XIV?\nCarlos Otal\n\n","date":"September 5, 2012 at 5:02 am","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","id":"comment-15866","author":"Carlos Otal","site":"shroudstory"},{"title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson","post":"Mi pregunta va dirigida a Charles Freeman.\n¿Hay evidencia documental de la existencia de alguna Sábana con simple imagen del cuerpo entero (no doble) anterior al siglo XIV?\nCarlos Otal\n\n","date":"September 5, 2012 at 5:09 am","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","id":"comment-15867","author":"Carlos Otal","site":"shroudstory"},{"title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson","post":"Carlos. Excuse my not answering in Spanish- my daughter is the Spanish speaker in the family not me!\nMost relics purporting to come from the first century, from the life and Passion of Christ, the Virgin Mary, the apostles and Mary Magdalene are represented by multiple, competing copies, e.g. many pieces of the True Cross, lots of girdles worn by the Virgin Mary, several heads of John the Baptist,two bodies of Mary Magdalene,  many phials of Christ’s blood, a number of burial shrouds, a number of images of the living Christ ( e.g. the Image of Edessa). In many cases the descriptions are not precise enough to know what they consisted of and hundreds of thousands of relics were destroyed in the Reformation by Protestant Christians. We are lucky to have copies of the Image of Edessa ( almost certainly created in the sixth century- see Hans Belting on this) that show clearly that it was an isolated head of a living Christ to which a legendary account of its origins in the first century was added.\nAll one can say in the case of the Turin Shroud is that there is no mention of a shroud that seems to be it before the fourteenth century. There are many references to other burial shrouds of Christ, of course,although none, except the one at Cahouin , which had a large following, seems to have gripped the imagination in the way that,say, the Veil of Veronica or the body of James at Compostela did. It was just one of the many thousands of specific relics that did not attract a following, except marginally in the sixteenth century, and certainly, in the hierarchy of relics, the Turin Shroud could not compete with the Cross, Crown of Thorns or blood taken from Jesus on the Cross.\nWilson makes the very fundamental mistake of assuming that any image or icon mentioned is the Turin Shroud. He writes as if no other images or icons existed and that burial shrouds were given a high status within the hierarchy of relics there is no evidence that they were.This distorts his narrative but, as others have pointed out, he even distorts the material he does use in order to make his very weak case.\nBut how often does one have to go on repeating this – we have Yannick Clement, who believes in the authenticity of the Shroud, myself ,a more general historian who has written the only full length history of medieval relics on the market, and Byzantine specialists such as Davor all saying the same thing – the same thing that has been put forward by professional historians for many years now without anyone from the academic community coming up in Wilson’s support.\nScientific work on the Shroud suffered from earlier examinations by STURP in 1978 being undertaken  without any preliminary assessment of the Shroud by textile experts before it was examined by a group of self-appointed  scientists none of whom had any experience with ancient textiles, outside a conservation laboratory and with samples removed at will and then scattered around the place, ( I am told that the guardians of the samples only give them out to those who already support the authenticity of the Shroud, but i don’t know if this is true or not- others may be able to help here.) No wonder there are endless inconclusive discussions about how the image was formed, everyone is arguing from a botched job.\n\n","date":"September 5, 2012 at 6:26 am","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","id":"comment-15871","author":"Charles Freeman","site":"shroudstory"},{"title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson","post":"Sorry, Cadouin Shroud, CF\n\n","date":"September 5, 2012 at 6:29 am","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","id":"comment-15872","author":"Charles Freeman","site":"shroudstory"},{"title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson","post":"Charles Freeman:\nLe agradezco la respuesta a mi pregunta :¿Hay evidencia documental de la existencia de alguna Sábana con simple imagen (no doble) anterior al siglo XIV?\nSu repuesta es un claro NO.\n(Todos conocemos que la Sábana de Cadouin no tiene imagen).\nNicolotti me respondió en su comentario  (September 3, 2012 at 10:25 am | #49) referente a lo que Robert de Clari podría haber visto, aunque él, Nicolotti no cree que el testimonio sea cierto:\nPodría ser cualquier tela con la imagen de Cristo muerto, como muchas estaban en ese momento”\nNicolotti, siendo un gran erudito, SE EQUIVOCA. No existían MUCHAS en ese momento. \nNo conocemos NINGUNA sabana que pretendiera ser mortuoria con la imagen de Jesús, salvo para los que quieran admitir como válido el testimonio de Robert de Clari (yo lo acepto como muy probablemente válido)\nNo existe evidencia documental de ninguna Sábana con Imagen de Jesús anterior a la Sabana de Lirey (Sábana Santa).\nCarlos Otal\nPd. No he leido a Ian Wilson ni quiero leerlo. No me interesa.\n\n","date":"September 5, 2012 at 8:53 am","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","id":"comment-15884","author":"Carlos Otal","site":"shroudstory"}]
