[{"title":"Promoted Comment on Correcting Joe Nickell","post":"El asunto de la supuesta carta de Pierre D´Arcis ( no lleva firma, no lleva fecha y no lleva sello) que el canónigo Chevalier quiso datar en 1389, se soluciona con una simple RESTA o SUBSTRACCIÓN.\nEscribe D´Arcis ( Paris, Bibliothèque Nationale. Collection de Champagne, v 154, fol 137) una carta en LATIN con el siguiente encabezamiento que NO se figura en la traducción inglesa de Herbert Thurston, razón por la que utilizo la traducción francesa:\n“Verité sur le linge de Lirey qui, après avoir été longtemps exposé à une époque antérieure, vient de l´être derechef, au sujet duquel j´entends écrire á notre seigneur Pape dans les termes qui suivent et aussi brièvement que possible”.\nY después:\n“ ….loin de se limiter au royaume de France, cela fut répandu pour ainsi dire dans le monde entier, tellement que, de tous les points de l’univers, les peuples affluaient en masse. Pour séduire ces multitudes et leur extorquer leur or par astuce, on forgeait là des miracles en faisant mentir certains individus payés à cet effet: ils feignaient d’avoir été guéris lors d’une ostension dudit suaire, que la croyance universelle attribuait au Seigneur.”\nY después:\n“Ceux-là, quand ils virent leur ruse percée à jour, firent disparaître et recelèrent ledit linge pour qu’il échappât aux investigations de l’ordinaire; depuis, ils ne l’ont plus sorti de sa cachette pendant trente-quatre ans, ou à peu près, jusqu’à cette année.”\n-La iglesia de Lirey se fundó en 1353.\n-El culto en Lirey fue aprobado por el obispo Henri de Poitiers el 28 de mayo de 1356.\n– Si hacemos la resta 1389 – 34 = 1355\n¡Cómo podía en el año 1355 haber sido expuesta la Sábana durante mucho tiempo, no limitar su fama al reino de Francia sino al mundo entero (Europa estaba con muchas guerras) y además con afluencia de multitudes……\nLas fechas NO COINCIDEN con lo que la carta pretende.\nPuede verse el documento en Latín a buena resolución y sus traducciones al francés y al  inglés en mi blog:\nhttp://lasabanaylosescepticos.blogspot.com/2006/02/traduccin-latn-francs-del-memorandum.html\nhttp://lasabanaylosescepticos.blogspot.com/2006/02/traduccin-latin-ingls-del-memorandum.html\n\n","date":"January 26, 2012 at 4:42 pm","url":"https://shroudstory.com/2012/01/26/promoted-comment-on-correcting-joe-nickell/","cat":"history","id":"comment-7571","author":"co","site":"shroudstory"}]
