[{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"Personally, I don’t even need Vignon’s markings to understand that the Pantocrator images that have surfaced from the beginning of the 6th century onwards are linked with the Shroud image…  I just need my eyes and my brain!  As I said before, that’s not the same for most of the first depictions of a bearded Christ with long hair that have surfaced at the end of the 3rd century in the catacombs of Rome. Concerning these depictions (at the exception maybe of the one found in the St Marcellinus and Peter catacombs, which shows some very interesting similarities with the Shroud image), I agree that they were most probably not influenced by the Shroud image but mainly by the Pagan depictions of Zeus, Jupiter and other gods and probably also by the classical depiction of the ancient philosopher…  But when I look at any depiction made in the style of the Christ Pantocrator, I don’t need a Ph. D. to understand that these particular images of Christ are related with the image on the Shroud in some way (probably indirectly via a model that could have been made directly from the Shroud).  Sorry but what my eyes and my brain tells me is that the resemblance is just too striking to be simply due to chance.  Imagine for one second if these Pantocrator Christ would not be related at all with the Shroud…  What would have been the chances for this kind of almost perfect level of similarity to happened then ?  In my mind, this just goes beyond the imagination.  If we use Occam’s razor correctly, we have to conclude that the most rational explanation is the one that indicates that these Pantocrator images must have been influenced in some ways with the Shroud image.  Remember folks that the image on the Shroud IS NOT AN ARTWORK !  This fact is crucial concerning this present analysis…  That means, among other things, that the Shroud image could NOT have been created by an artist influenced by the Pantocrator-styled images after the 6th century.\n\n","date":"October 16, 2012 at 11:04 am","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17703","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"I deplore too, many Shroud scholars non qualified in the 5 relevant fields of expertise (namely Roman, Byzantine and Medieval Art History, archaeological image analysis and cryptanalysis) tackled the pre-13th c. CE Roman, Byzantine and Medieval Christological iconography issue and imposed their biased views (see e.g. on the Pray codex miniatures). \nSadly (my personal experience), I have seen a religious scholar (not a Mishnaic exegete),and a  laser engineer (with a laser physicist as general coordinator) whose specific field of expertise was not ‘quite really’ Second Temple Mishnaic exegesis, Jewish numismatics and/or archaeological late-antique image analysis and/or cryptanalysis, allegedly/wishfully “PEER” review (!!!!!!!) my research paper on the coin-on-eye issue that was at the very cross-road of the four specific fields of expertise…  \nAlthough I hadn’t practiced both oral and written English Language for nearly a quarter of a century (1994-2010) at the time (2010), I wrote up my paper in snatches, in my spares times and in less than 10 hours. the reviewers proved far from being specialists… \nHere is a sample of the reviewers’ wishful thinking even in terms of plain English language (email I sent to Paolo di Lazzaro): \n“THE RIGHT TO REPLY\nor Eppure ha senso…\n by French Galileo of Shroud Science, Max Patrick Hamon ;-)\n  DEAR PAOLO, so that you could knowingly judge for yourself, just allow me to give you here a few samples of the two referees’ purple patches of most specious allegations and criticisms on my paper form and content.\n– Part I –\n1ST SAMPLE of Referee # 1’s wishful thinking (ON MY PAPER FORM)\n• Referee # 1 writes:\n” PAGE ONE:\nline – Keywords – Proponency – Cannot find this in any English dictionary. I believe he means to make a new name based on propound/proponent. Advocacy is the correct word.\nline – 1. SCEPTICAL PROPONENCY – Change to ADVOCACY. ”\n• Plain Facts:  “Proponency” (see e.g. Wiktionary) is a most well known word in British English not only to educated people but also on internet (35,700 results!). It is also known to poets who are familiar with English rhyming dictionaries.\n (DEAR PAOLO, DON’T YOU THINK THESE FACTS ARE IN RATHER CURIOUS CONTRAST WITH REFEREE’S # 1’S OPINION?).\n• My comments: Actually both “Advocacy” and “Proponency” are correct. Proponency IS a genuine English word which most unfortunately is totally unknown to referee # 1. To be an American English native speaker is a necessary condition, although not sufficient, to guarantee lack of ignorance of the English language.\n• My first question to Referee # 1: Did she/he really mean “[I meant] to make a new name (sic)” that has existed in the English language for centuries and is still very much used nowadays?\n• My subsequent question to Referee # 1: Did she/he really think American English vocabulary should prevail on any other lexical variety of the English language?\n• My take: Since there is neither rhyme nor reason to it, Referee # 1 is neither an English language specialist nor a… poetess/poet!\n• My give: …AND ONE EGG TO PUT IN REFEREE # 1’S FACE!\n                                                                                                          To be continued\n(next page: 1ST SAMPLE of Referee # 1’s wishful thinking\nON MY PAPER CONTENT)\n  Since Paolo di Lazzaro never replied to my contention it was a false negative, I finally drop the whole matter and consequently my comments on my so-called ‘peer-reviewed’ paper…  (the fact is I just needed more time to write up my paper all the more so as the Italian HD Shroud material I had asked in Feb. 2010 had never been put at my disposal to really help demonstrate there really were partial tiny coin obverse blood decals on the TS eye areas \n  Shroud science and archaeology could be quite better off than apparent or real wishful thinking were the needed photographic material put by the Italian Centro at professionals’ disposal  so that  they could carry out and complete their studies all the more so as an image is worth a thousand (English) words (it might really have been helpful to me!).\n  However the fact is I finally succeeded to eidomatically and numismatically reconstruct two very accurate Pilate coin obverses from the tiny blood markings on the said eye areas in 2011 (even without the Italian HD Shroud material). STILL, it would not have taken me that much time, had the HD photos been put at my disposal.\n\n","date":"October 16, 2012 at 2:56 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17706","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"Mistyping: (1984-2010)\n\n","date":"October 16, 2012 at 3:00 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17707","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"– What really undermine credibility for the Shroud’s authenticity is non-specialists in a particular field or fields (transversal approach) of expertise reviewing a research paper implying to be REALLY knowleable in su a field or fields.\n– the need to double and/or triple check one’s results/findings with HD authentic Shroud photographic material.\n\n","date":"October 16, 2012 at 3:21 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17709","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"as opposed to the lack of such a material.\n\n","date":"October 16, 2012 at 3:22 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17710","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"Mistyping: knowledgeable in such field or fields\n\n","date":"October 16, 2012 at 3:29 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17712","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"I would certainly concede that one topless box does not prove anything.  I would go so far as saying that the Vignon markings alone CANNOT be accepted as CONCLUSIVE proof of authenticity, but I find that 15 points of congruence are rather too many to be considered anything less that PURSUASIVE or SUPPORTIVE evidence. \nMy understanding of Vignon’s assertion of these 15 points of congruence was in respect of an attempt to derive some indication of provenance in a quantitative way, and this is the big vacuum in our knowledge of the Shroud.  Where was it?  Wilson’s and others’ various attempts at reconstructing a history are not accepted by Byzantine Art history scholars.  But if the Shroud is indeed authentic, and this seems to be Professsor Fulbright’s position, we are then left with no-one being able to say authoritatively where this notable relic has been before the 14th century.  Wilson rightly recognised that this lack of provenance was a cloud that hangs over any claims to its authenticity, and so long as this cloud remains, scholars would remain reluctant to take it seriously. \nFor once, I find myself in agreement with Yannick Clement:  “But when I look at any depiction made in the style of the Christ Pantocrator, I don’t need a Ph. D. to understand that these particular images of Christ are related with the image on the Shroud in some way (probably indirectly via a model that could have been made directly from the Shroud). ”  However with a shadow now being cast over the reputation of the Vignon markings (one authenticist’s posting has derided them as a joke!) there must be some other way of quantifying this likeness between the Shroud and the various post 6th century iconography.\n\n","date":"October 16, 2012 at 3:27 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17711","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"It’s not because some pro-Shroud persons doesn’t accept the conclusion of Vignon that it necessarily means that it is false !!!  Come on Dave !  Think by yourself my friend…  What your eyes are telling you when you compare the facial image on the Shroud and any classic pantocrator images ???  That’s what matters…  Look, even a children would easily note the high level of congruence between the two images !!!  And this is not a joke…\n\n","date":"October 16, 2012 at 4:56 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17717","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"I don’t need telling to think by myself, as that’s what I’ve done all my life!  Yes, I’m persuaded of the likeness myself, but that’s not enough to persuade anyone else.  The likenesses have to be specifically described, and I agree with Max below, that Vignon’s efforts are a good start but need further refinement and extension.\n\n","date":"October 16, 2012 at 5:19 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17720","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"A more original illustrative solution than Vignon’s or even Balossino’s must be found to convince Byzantine Art historian (remember the RIGHT picture is worth a TEN thousand words)…\n\n","date":"October 16, 2012 at 5:24 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17722","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"Vignon’s pioneering work has to be refined and  look/be more convincing in the eyes of conventional Byzantine Art historians although he was probably right.. .\n\n","date":"October 16, 2012 at 3:38 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17713","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"Righht on!  Concur completely!\n\n","date":"October 16, 2012 at 5:22 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17721","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"In the end, no matter if there are very good chances that the Shroud’s ancient history will remain forever in the dark.  What matter would be a new series of C14 dating with many samples taken from many different places from the main body of the Shroud, along with maybe other new high-tech methods that could really help us to find the true age of this cloth…  And when this will be done correctly and when the conclusion will be scientifically confirmed by independent experts, then I think the unknown history of the Shroud would not matter that much.  If science can prove one day that this cloth was really woven during the first century A.D., who will care if the first 1000 years of its history is still unknown ???  That could simply means that this cloth was mostly kept hidden during these long years and to me, I really think this hypothesis is as good as any others that have been proposed and certainly more rational than the Mandylion hypothesis of Wilson in regard of the very poor number of written reference concerning a Shroud of Christ during that whole era.\n\n","date":"October 16, 2012 at 5:04 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17718","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"Forget C14!  It will never have legs.  Too much contamination.  There also seem to be other problems in C14 dating of linen.  Gabriel has mentioned a number of other tests.  We know so little. Strontium has yet to be looked at, and yet could be so revealing.  It’s persuasive to me for example that the cloth’s dimensions are exactly 8 x 2 Syrian royal cubits.  Those weren’t the units used in medieval times.  The cotton contamination is also Middle East provenance.  It had to be somewhere!\n\n","date":"October 16, 2012 at 5:33 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17723","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"No matter which test could be done to know the true age of the cloth, it SHOULD be done because we know now for a fact that the C14 dating of 1988 was not representative of the main body of the Shroud.  Personally, I’m not ready yet to condemn another C14 test as long as it would be done properly…\n\n","date":"October 17, 2012 at 8:28 am","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17741","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"What evidence do you have that there is too much contamination on the Shroud for a modern laboratory to cope with? Have any of the testers of the Shroud raised it as a major issue? Has any other radio-carbon expert?  I think you must give some expert opinion on this from someone working in the field who can assess the history of the cloth if you want to sustain your argument\n. Remember that the amount of contamination of cloth between 650 and 2000 years old is likely to be minimal compared to that affecting a material object  of 50,000 years old , towards the limit of effective radio-carbon-14 dating.\n\n","date":"October 17, 2012 at 1:30 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17752","author":"Charles Freeman","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"Archaeocryptology is the key to have the lock turn and move inwards and finally unlock the door of cryptohistory onto the TS missing 1300-year perspective.\n\n","date":"October 16, 2012 at 5:45 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17725","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"Daveb, I agree. We have extensively commented on this before but in 2012 the scientific literature clearly indicates that C14 is not appliable for an object like the Shroud. In 1988 much less was known and C14 seemed to be final technique for virtually any object from the past. Now we know that it is not. That’s all.\nInteresting point also the syrian units. I didn’t know this . Could you provide some reference?\n\n","date":"October 16, 2012 at 5:57 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17727","author":"Gabriel","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"Assyrian royal cubit:  It’s takes some chasing, and I first picked it up from a comment by Max PH.  The ordinary familiar Egyptian cubit is 18 inches = 457mm.  .  The Royal Egyptian cubit was about 4 digits longer at  524 mm = 20.62 inches, and a granite stick was used as a standard.  There were several other cubits around, the general idea being that it was the length from elbow to finger tip.  \nThe Shroud dimensions are 4340mm x 1090mm, so it’s a direct aspect ratio of 4:1, within 20mm.   So the cubit used for the cloth was about 4340 / 8 = 542mm.  That’s about 18mm longer than the Royal Egyptian, but there were even much longer cubits [e.g. Royal Persian “cubit(?)” is quoted as 640mm].  I found several sites that tended to concentrate around the 524mm, occasionally found bigger ones, but eventually dropped on to a site (which looks like it has a fundamentalist agenda, but is probably authoritative when it comes to cubits):\nhttp://www.worldwideflood.com/ark/noahs_cubit/cubit_references.htm\nIt quoted the Assyrian cubit at 700 BC as 549mm = 21.6 inches.  Its source reference is given as http://www.footrule.com which seems an authoritative source, but the site takes some navigating. Eventually it gives you the figure of 21.6 inches for the Assyrian cubit.  The 542mm which seems to be the unit on the Shroud cloth is actually closer to the Arabic cubit, but it was the Syrians who had the reputation as weavers.  Multiplying the Assyrian cubit by 8 gives a length of 4392mm, about 5cm (2 inches) longer than the Shroud.\nMake of these notes what you will!  Someone else (Max?) might have a better rationale or reference source.\n\n","date":"October 16, 2012 at 11:31 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17731","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"this is a good posting. I’ve said it before and will say it again – the Vignon marking argument is a joke.\nThat doesn’t mean the Shroud is inauthentic. Although I am agnostic on its authenticity, I think the arguments FOR tend to outweigh the arguments AGAINST\n\n","date":"October 17, 2012 at 5:54 am","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17738","author":"Matt","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"Vignon could have made some mistakes on some of his markings (like maybe the box shape between the eyes) but his main conclusion (i.e. that the Shroud was the source, indirect or direct) for the 6th century depictions of a bearded Christ with long hair (Pantocrator, Mandylion, etc.) is far from being a joke !  That’s the most important thing to note.\n\n","date":"October 17, 2012 at 8:30 am","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17742","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"For Royal or sacred Assyrian cubit see Guralnick’s article, “Sargonid Sculpture and the Late Assyrian Cubit,” Iraq, Vol. 58, 1996, pp.89-103. The  3 Assyrian cubits were: the common or short cubit (51.5 cm), the King’s (55 cm) and the Royal, sacred or long (55.6 cm).\n\n","date":"October 17, 2012 at 8:01 am","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17740","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"Mistyping: read 56,6cm instead of 55,6cm\n\n","date":"October 17, 2012 at 12:18 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17750","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"The rare King’s cubit and the Royal might well be one and the same cubit unless the former was used in conjunction with a dead king and the latter with a living one. This is just my hypthesis.\n\n","date":"October 17, 2012 at 6:04 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17766","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"A preview (single title page) of the Guralnick paper mentioned by Max, can be found at:\nhttp://www.jstor.org/discover/10.2307/4200421?uid=3738776&uid=2129&uid=2&uid=70&uid=4&sid=21101163363373\nIt’s based on measurements of slabs and other monoliths during the time of Sargon II, reigned 721-705 BC.  Guralnick in 1996 postulates the three cubits as Max mentions: Standard Late Assyrian cubit 51.5cm; Royal cubit (religio-mythological royal emblemata) 56.6cm; Slab featuring King Sargon 55cm; all as stated by Max.  As I read the abstract, I surmise that the King’s 55cm cubit was comparatively rare, and that the more usual Royal cubit was 55.6cm.  It would seem that the “footrule” site I’ve mentioned above in quoting 549mm (Assyrian 700 BC) is based on Guralnick’s rare King’s cubit of 55cm.\nThe width of the Shroud cloth at 1090mm is suggestive of a cubit of ~545mm, which is ~3cm longer than the standard cubit, and about 1cm shorter than the usual Royal cubit.\nThe cloth is almost certainly of Syrian weave (cotton contamination and 3:1 twill) and it seems a puzzle to me why a larger than standard cubit was used just for a cloth.  There has been some suggestion (van der Hoeven in 2011) that the cloth was originally intended as a temple garment, and if there was a known religious purpose for the cloth, this might explain why its measurements approximate to Royal cubit measure.  The 3:1 twill is exceptional, and suggests a special purpose may have been originally intended.\n\n","date":"October 18, 2012 at 5:36 am","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17775","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"Archeaologically speaking, It cannot be totally ruled out that originally the TS might well have been 452.8cm long and 113.2cm wide OR/AND THEN AT A LATER DATE (e.g. on the TSM’s very burial) nearly 440cm long and 110cm wide.\n\n","date":"October 18, 2012 at 6:32 am","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17777","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"The fact is there are a couple of more possibilities here (see e.g. Mechthild Flury-Lemberg’s & César Barta’s primeval fold theory)\n\n","date":"October 18, 2012 at 6:45 am","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17778","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"Symbolically and pratically speasking, the long Royal cubit (56.6cm) might well have been used for garments worn by living outstanding figures and the shorter King cubit (55cm) used for their own garments used as their burial cloth. This is just an hypothesis..\n\n","date":"October 18, 2012 at 6:59 am","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17779","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"No doubt, as a NON-Roman, NON-Byzantine & NON-Medieval Art historian and a NON-archaeological analyst and NON-archeaological cryptanalyst, Mrs Fulbright, as a ‘peer’ reviewer, would have shut the door to Vignon and trash his pioneering paper!.\n\n","date":"October 17, 2012 at 10:48 am","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17747","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"Mistyping: “and trashed”\n\n","date":"October 17, 2012 at 12:57 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17751","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"\nCharles Freeman :What evidence do you have that there is too much contamination on the Shroud for a modern laboratory to cope with? Have any of the testers of the Shroud raised it as a major issue? Has any other radio-carbon expert? I think you must give some expert opinion on this from someone working in the field who can assess the history of the cloth if you want to sustain your argument. Remember that the amount of contamination of cloth between 650 and 2000 years old is likely to be minimal compared to that affecting a material object of 50,000 years old , towards the limit of effective radio-carbon-14 dating.\nAgain nonsense from one whom obviously has not studied or understands the issues with C14 dating of artifacts! A ‘material’ buried (sealed) in a tomb or in the ground for thousands of years would be much easier to test and far less contaminated compared to the Shroud. They would be much less prone to accumulate contaminates, C14 isotopes etc; verse the Shroud. A Shroud, which has been handled, moved around, and kept in numerous ‘unknown’ containers and enviromental conditions for hundreds if not thousands of years. A Shroud which has also been “undoubtably contaminated” by centuries of incense and candle smoke, and plain old pollution. Moreover, and must be mentioned; being exposed to ‘extreme’ heat in possibly ‘several’ fires? and/or atleast one well known fire, which would have immersed the cloth in 900+ degree temperatures? There is no comparison whatsoever with the Shroud and most all other C14 items ever tested.\nIt is also well understood in the C14 world that porous materials, such as linen, are extremely prone to contamination and all experts agree; is by far the most difficult to clean and test accurately…Take for instance in the cases of mummy wrappings (sealed for millenia no less); the wrappings have dated much younger then the bodies themselfs, and in a couple of cases with dates in disagreement exceeding 1000+ years! …Let’s get real here, radiocarbon dating is not infallible, far from it, it cannot be relied upon to give reliably accurate dates, ON IT’S OWN, and is very subceptible to errors due to unknown contaminations…This is not only a reality but a FACT, even with today’s technical advancements. No serious expert in the field would claim otherwise. Although it may be the best method (arguably) we have today, it is not perfect and far from being precise enough to claim provenance of any object studied.\nR\n\n","date":"October 17, 2012 at 4:10 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17758","author":"Ron","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"Please Ron give me the title of a handbook on radio-carbon-14 dating that you have read that has been published in the last ten years and tell me the page numbers that sustain your claims.\nThe Egyptian radiocarbon-14 datings have been subject to enormous amounts of new work recently (see Bahn and Renfrew, Archaeology, p.155). Even if there was a 1000 year discrepancy on a mummy of 2000 BC this would be twenty five per cent , so even if the same discrepancy was applied to the 1350 dating of the shroud it would skew the results 135 years either way at the most.\nI challenge you to provide a single example of a radio-carbon-14 dating from the past ten years where an object has been dated at a third of its real age. Just one will do, but from your comments you seem to assume that it would be a common event so you must be able to provide some evidence in support of your claim.\nI agree with you that other forms of dating are important – that is just exactly how the accuracy of radio-carbon dating is established. You take objects whose dates are known , give them a radio-carbon-14 dating and then if the dates correlate with each other , you know that r-c is working as it should. This is how many of the discrepancies and problems of -r-c dating have been spotted and ironed out. There are thousands upon thousands of r-c datings available whose accuracy have been confirmed. You seem to suggest that an accurate r-c dating is a one-off event! (Again i just wonder which handbook on -r-c dating you have been using as your source.)\nShroud studies are a spin-off of my work on medieval relics but at the moment very much on the back-burner. Two outstanding issues are there to be solved if I have time from my ‘real’ work..\n1) If the Shroud blood is AB when is the earliest example of AB from another source that we have.\n2) With the evidence of large cloths being imported into Europe from Islamic sources by Crusaders in the late eleventh century, can we match the weave of the Shroud  to what we know these workshops were producing. I have now tracked down an expert on Islamic textiles and he he has agreed to give me lunch when i am back in England.\n\n","date":"October 18, 2012 at 4:15 am","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17773","author":"Charles Freeman","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"I don’t get my ideas from reading a single handbook. I have attained my knowledge from reading numerous papers and talking to professionals in the field. Now if you want to go on believing C14 is the holy grail of  time stamps and has no issues, go ahead I cannot change the way you percieve information.\nR\n\n","date":"October 18, 2012 at 7:04 am","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17781","author":"Ron","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"I should add; it would be a mistake to assume further C14 dating, with our present technology would be of any use, nor do I believe the Vatican feels any different.\nR\n\n","date":"October 17, 2012 at 4:20 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17760","author":"Ron","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"\ndaveb of wellington nz :Forget C14! It will never have legs. Too much contamination. There also seem to be other problems in C14 dating of linen. Gabriel has mentioned a number of other tests. We know so little. Strontium has yet to be looked at, and yet could be so revealing. It’s persuasive to me for example that the cloth’s dimensions are exactly 8 x 2 Syrian royal cubits. Those weren’t the units used in medieval times. The cotton contamination is also Middle East provenance. It had to be somewhere!\nIt’s funny how people will overlook such evidence. The Shroud conforming to the CUBIT measurement, the CLOTH fragments found intertwined with the linen fibrels that conform to known 1st century Egyptian provenance, only. The STITCHING of the seam, conforming to known 1st century stitching found at Masada 73 AD. The loom manufacture, conforming to 1st century Syrain design etc; …It’s laughable really, to me anyways, that people still question the origin of this Shroud.\nR\n\n","date":"October 17, 2012 at 4:35 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17761","author":"Ron","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"Quote from Ron : “the CLOTH fragments found intertwined with the linen fibrels that conform to known 1st century Egyptian provenance, only”\nRon, I have no idea what you’re talking about.  Can you explain this piece of evidence to me please ?  Maybe I have miss something big…  Thanks !\n\n","date":"October 17, 2012 at 4:42 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17763","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"You don’t know about this Yammick? and I thought you were an expert! Try reading on the 1988 C14, findings and you’ll find the answer.\nR\n\n","date":"October 18, 2012 at 7:00 am","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17780","author":"Ron","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"What a cheap answer !  I though we were both on this blog to learn the truth about the Shroud…  If you want to play this game Ron it’s up to you but it’s very cheap.\nPersonally, I never read anything saying that there was some kind of proof that the Shroud has been woven in Egypt.  I have read some hypotheses that talked about Syria, but I don’t recall having read one that talk about Egypt.  Was there an important Jewish community in Egypt at the beginning of the first century A.D. ?  Don’t forget that there are some pretty solid pieces of evidence that seems to show that the Shroud has been woven by a Jewish artisan…  Was there some Jewish artisan during that era in Egypt ?  I don’t know personally.  And concerning the cloth fragments supposedly found during the 1988 C14 dating, the only think I can see is the cotton fibers that were found and remove by the Oxford lab before the dating of their Shroud’s sample, along with the trim of a part of the global sample made by Riggi in the region where the seam is present because he found some suspect fibers…  Beside that, I don’t what you can mean.\n\n","date":"October 18, 2012 at 10:41 am","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17804","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"YC: “Was there an important Jewish community in Egypt at the beginning of the first century A.D. ?” \nFrom the time Alexandria was founded, I think by Ptolemy Soter, one of Alexander’s generals. the city became an important cosmopolitan centre: with separate Egyptian, Greek and Jewish enclaves.  This was abetted by the founding of the Great Library, which survived to about 500 AD, Many of the Jewish exiles had been excluded from returning to Jerusalem because of their intermarriage with Babylonians.  You’ll recall the Septuagint was published there.  The Shroud is almost certainly of Syrian provenance; the 3:1 twill was known to Syrian weavers, but usually reserved for silk, and the Syrian cubit is suggestive as is the species of cotton contamination.\n\n","date":"October 18, 2012 at 4:08 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17828","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"Thank you Dave for the information about the Egyptian Jewish community. But I still don’t know what Ron was really referring to yesterday when he told us that there was “a CLOTH fragments found intertwined with the linen fibrels that conform to known 1st century Egyptian provenance, only”.  If anyone know what Ron’s was saying, please tell me because right now, I have no idea.\n\n","date":"October 18, 2012 at 4:46 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17830","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"Does Ron  mean wool? I am equally mystified but why can’t Ron tell us if we are all humble enough to admit our ignorance?\n\n","date":"October 18, 2012 at 5:43 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17833","author":"Charles Freeman","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"Nice and true comment M. Freeman !  I think Ron’s ego is getting too big ! ;-)\nBy the way, did you read one of my recent post that was directly intended for you ?  Here’s the link : https://shroudstory.com/2012/10/10/bsts-meeting-reminder/#comment-17792\nI really hope you’ll think about my proposal for you to make a proper critical analysis of the most recent presentation done by Wilson in Valencia this summer !  PEOPLE DESERVED TO KNOW THE TRUTH ABOUT THAT, i.e. that all the hypothesis presented by Wilson in this paper are mainly based on wild guesses and speculations and have no credibility whatsoever from a real historical point of view…\nI would like to get your thoughts concerning my proposal.  Thanks !\n\n","date":"October 19, 2012 at 9:59 am","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17868","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"Yannick, I think the first detection of cotton dates back to year 1976. Seemingly, Raes found traces of cotton (Gossypium herbaceum) fibers included in the linen threads. This observation suggested that the linen may have been spun with the same equipment used previously for cotton.DeNiro et al. in their 1988 largely unnoticed but peer-reviewed paper suggest that the cotton inclusions support a Midde Eastern manufacture\nRaes, Gilbert: 1976. “Appendix B – Analysis Report: Pl. II-III—Subject: Examination\nof the ‘Sindone’”. In Doyle, E., M.Green, Fr., & V. Ossola (Trans.) Report of Turin\nCommission on the Holy Shroud (pp. 108-123). Unpublished. Translation of La S.\nSindone: Ricerche e studi della Commissione di Esperti nominata dall’Arcivescovo di\nTorino, Card. Michele Pellegrino, nel.\n\n","date":"October 19, 2012 at 1:41 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17879","author":"Gabriel","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"As an afterthought, Diana Fulbright has also published a comprehensive paper in 2010, with very many examples of cloths found in the Judean desert, including those with a twill weave.  This was in repudiation of claims made in respect of the single shroud finding at Akeldama.  One finding for example relates to Murabba’at (can’t copy, it’s secured): The Crowfoots (mother & daughter) discovered seven twill-like fabrics, including herring-bone weave, with Z-type weft threads and both Z and S warp threads, including fine linen.  She gives very many more examples, at various Judean locations.  Google search: “Akeldama Shroud Diana Fulbright”, possibly sindon@globalweb.net\n\n","date":"October 18, 2012 at 7:08 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17836","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"\nCharles Freeman :Does Ron mean wool? I am equally mystified but why can’t Ron tell us if we are all humble enough to admit our ignorance?\nThere ain’t no wool, Jewish Law forbade mixing of kinds – Mishna requirement.  You can mix linen and cotton (both vegetable); but you can’t mix wool (animal) with either linen or cotton.  Further corroborative evidence supporting possible authenticity! .\n\n","date":"October 19, 2012 at 3:41 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17882","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"Cotton is not grown in Europe.  A European forger would need to anticipate possibility of cotton contamination and know to acquire Middle Eastern linen rather than European linen.  Furthermore, processing methods of medieval linen differed from ancient methods and this is evident from the coating left on the fibres from the ancient methods due to their processing treatment.  Your forger would need to know to acqure ancent Middle Easterm linen.  And then he would have to be capable of a method of leaving an image on the cloth, that has eluded all our modern technology, an image that is a virtual photographic negative (before the invention of photography) and that also encodes 3-D information.  He would also have to contaminate this linen with traces of Dead Sea pollens and very likely Jerusalem aragonite liimestone particles!\n\n","date":"October 19, 2012 at 4:10 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17885","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"There was no cotton found by STURP in any part of the main body of the Shroud.  It was only found in the C14 corner as fibers not belonging to the original weaving of the cloth.  It’s important to emphasize this fact.\n\n","date":"October 19, 2012 at 5:04 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17888","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"Yannick, I don’t think this comment is quite correct.  Raes found cotton contamination way back in 1976, which antedates the C14, see Gabriel’s posting above. Oct 19, 1:41pm. (Your friend Ian Wilson mentioned it way back in 1978)  This was distinct from the apparent mending in the C14 sample, and conclusion was that same loom had been used at some time for weaving cotton cloth.  Agreed that cotton was not intentionally part of the linen weaving.\n\n","date":"October 19, 2012 at 5:41 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17892","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"I may have to stand corrected.  I’ve just checked out Theibault Heimburger’s comprehensive 3 part paper paper “COTTON IN RAES/RADIOCARBON THREADS: THE EXAMPLE OF RAES #7” of 2009.  See http://www.shroud.com/pdfs/thibaultr7part1.pdf You can link to parts 2 & 3. I read that no cotton was found in Raes #1.\n\n","date":"October 19, 2012 at 6:10 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17895","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"From Ray Rogers point of view, the only cotton that has ever been found in the threads of the Shroud was located in the C14 corner area (including the Raes sample and the sample used for carbon dating in 1988).  Elsewhere on the cloth, there is absolutely no evidence for the presence of cotton, except for some contamination of surface…  This is an important FACT that contribute to raise even more the probability that there really was a medieval repair in the C14 corner and that the C14 result of 88 is incorrect because the labs have dated a non representative portion of the cloth.  I just wanted to set the record straight versus the finding of cotton that was made by Raes in 1973…\n\n","date":"October 21, 2012 at 6:27 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-17994","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"I am looking for vern miller is he still alive… ? He was generous to me…\n\n","date":"June 4, 2013 at 3:55 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-36101","author":"Robin ricards","site":"shroudstory"},{"title":"Quote for Today: Diana Fulbright on Wishful Thinking.","post":"Vern died on April 10, 2009…  Sorry.\n\n","date":"June 4, 2013 at 4:44 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","id":"comment-36105","author":"Yannick Clément","site":"shroudstory"}]
