[{"title":"Remembering an Earlier Posting About The Seamless Robe","post":"If there was ever any doubt that the survival of the Shroud of Turin was a singular event and an act of providence (Divine or otherwise) it’s the fate of the seamless robe(s) should remove it..\nWhile the Savoy family did in fact make gifts of pieces of the Shroud, they were quite small,  taken from the edges and apparently they avoided the image area and the blood.\nNot a big fan of royalty but it’s had not to see the hand of providence in the survival of the Shroud until a time when science could unlock its secrets.\nWhat happened to the seamless robes(s) is what I call the Central Park Effect. It has been said that if everything ever proposed for Central Park had been approved, the Park would have been cemented over 50 times or so. \nIncidentally there has been some uninformed critique of the Quad Mosaics that they were originally black and white and them colorized.\nMicrospectral digital imaging begins with black and white images also BUT the three images are taken with RGB filters and then combined for single color image. IT’S THE FILTERS THAT COUNT. So please no self proclaimed scientists objecting that the original photos were just black and white.\nAm I wrong? I would appreciate an informed correction about the process. Don’t believe me? Check out the Lumiere site. http://www.lumiere-technology.com/\nLuminere’s  work on the Mona Lisa at the ouvre was epic. (I cover it in some depth in Chapter 14 of Quantum Christ.)\n\n","date":"August 1, 2015 at 7:02 am","url":"https://shroudstory.com/2015/08/01/remembering-an-earlier-posting-about-the-seamless-robe/","cat":"history","id":"comment-207142","author":"John Klotz","site":"shroudstory"},{"title":"Remembering an Earlier Posting About The Seamless Robe","post":"Incidentally, on the Lumiere web site is a video explaining the process as developed by them. It is copyrighted so you will have to see for yourself. They apply their work to paintings but I believe the multi-spectra digital imaging is certainly applicable to the Shroud. Watch the video and reach your own conclusion if you are interested. Lumiere is not the only company that does it.\nhttp://www.lumiere-technology.com/\n\n","date":"August 1, 2015 at 7:28 am","url":"https://shroudstory.com/2015/08/01/remembering-an-earlier-posting-about-the-seamless-robe/","cat":"history","id":"comment-207143","author":"John Klotz","site":"shroudstory"},{"title":"Remembering an Earlier Posting About The Seamless Robe","post":"I went on your website and see that the Shroud of Turin is not the only thing that catches our mutual interest. There’s also JFK’S assassination. Before reading your post I thought that you would praise the Warren commission but I soon realized that I was wrong . It seems that we can’t agree about anything  unfortunately and I disagree with you once again.\n\n","date":"August 1, 2015 at 7:53 am","url":"https://shroudstory.com/2015/08/01/remembering-an-earlier-posting-about-the-seamless-robe/","cat":"history","id":"comment-207144","author":"PHPL","site":"shroudstory"},{"title":"Remembering an Earlier Posting About The Seamless Robe","post":"Disagreements are what makes for horse races someone once said. I find t not at all unusual that someone who accepts the conclusions of the Warren Commission would accept the carbon dating.\n\n","date":"August 1, 2015 at 9:38 am","url":"https://shroudstory.com/2015/08/01/remembering-an-earlier-posting-about-the-seamless-robe/","cat":"history","id":"comment-207153","author":"John Klotz","site":"shroudstory"},{"title":"Remembering an Earlier Posting About The Seamless Robe","post":"“Incidentally there has been some uninformed critique of the Quad Mosaics that they were originally black and white and then colorized.” It seems that Barrie Schwortz is the origin of this uniformed critique. In “https://www.shroud.com/pdfs/quad.pdf” he makes it perfectly clear that the Quad Mosaics were indeed originally black and white and then colorised. They were indeed taken through different filters, so that each black and white original contained information relating to colour, but the colour later assigned to each photo, or combination of photos, after scanning, required extensive manipulation, as he describes. To call them multi-spectral digital images is a little more generous than they really deserve, in my opinion.\n\n","date":"August 1, 2015 at 2:28 pm","url":"https://shroudstory.com/2015/08/01/remembering-an-earlier-posting-about-the-seamless-robe/","cat":"history","id":"comment-207165","author":"Hugh Farey","site":"shroudstory"},{"title":"Remembering an Earlier Posting About The Seamless Robe","post":"Hugh,\nI didn’t intend to equate the 1978 Quad Mosaics quality and detail to the results of Lumiere’s process which is much more complex and involves 13 spectral photographs instead of 3. The Lumiere study of the Mona Lisa was more than 25 years later. The science of multispectral digital imaging had advanced. The Lumiere system measured composition across the complete light spectra from invisible infrared to invisible ultraviolet.  A comparison of the Luimiere process to the Quad Mosaics is like comparing a 2015 Rolls Royce to a 1917 Model T Ford. An explanation of the process of the Quad Mosaics’ creation can be found at http://www.shroud.com/pdfs/quad.pdf. \nWhile I referred to the three spectra as R/G/B, the article by Barrie Schwortz reverses the three spectra as B/G/R.\nThat being noted, you had another complaint about the Quad Mosaics has evidence of repair because other corners of the Shroud also showed a marked bluish color. We now know why thanks to the publication of a history of the Savoy family’s guardianship of the Shroud that the Savoy’s gifted favored individuals with a fiber of the Shroud sometimes contained in small elaborate reliquaries which were themselves works of art. A copy of the Shroud with fibers from the Shroud embedded at its corners apparently was given to the Portuguese Royal Family on the occasion of a Savoy princess’s marriage to the Portuguese king. See http://www.shroud.com/pdfs/fatima2011.pdf\nFor documentation of the fact that the Oxford sample was from an apparently anomalous portion of the Shroud see: http://www.shroudofturinexhibition.com/Shroud_of_Turin_exhibition/Thomas_Ferguson_files/Updated_report_on_the_Consideration_to_the_Uniformity_and_Effects_of_the_Fabric_in_the_Shroud_of_Turin-5-1.pdf\nhttp://www.shroudofturinexhibition.com/Shroud_of_Turin_exhibition/Three_threads_files/BL%20Sebastian%20for%20website%201.pdf\nIn sum, the 1978 Quad Mosaics were in fact the result of an examination of the spectra of the Shroud using three filters B/G/R. There is evidence that samples of the Shroud cut primarily from the frayed corners were gifted by the Savoy’s to those royal houses and individuals it favored. \nI would think that you would agree that a carefully conducted, non-intrusive multi-spectral digital image examination of the Shroud conducted to standards such as those used by Lumiere would be of enormous value, not just to scientists, but to history.\n\n","date":"August 2, 2015 at 8:22 am","url":"https://shroudstory.com/2015/08/01/remembering-an-earlier-posting-about-the-seamless-robe/","cat":"history","id":"comment-207263","author":"John Klotz","site":"shroudstory"},{"title":"Remembering an Earlier Posting About The Seamless Robe","post":"Referring to the original Nov 2, 2011 posting:  I find the Hymn of the Pearl persuasive, particularly Markwardt’s explanation for its composition; Egeria letters, Mozarabic rite, John of Damascus, at least suggestive;  Capture by Curcuas very likely irrelevant (refers to Mandylion); Constantine VII, Gregory Referendus refers to Mandylion; Pray manuscript persuasive;  Not mentioned – Robert de Clari, convincing;  Other Byzantine references to “Image of God Incarnate” etc, very much more persuasive.\n\n","date":"August 1, 2015 at 4:44 pm","url":"https://shroudstory.com/2015/08/01/remembering-an-earlier-posting-about-the-seamless-robe/","cat":"history","id":"comment-207173","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Remembering an Earlier Posting About The Seamless Robe","post":"Hi Dan\nWhat is presumably a Catholic relic was found in a Anglican colony at your end:\n http://www.catholicherald.co.uk/commentandblogs/2015/07/30/could-a-relic-of-the-blessed-virgin-be-buried-in-americas-first-settlement/\n\n","date":"August 1, 2015 at 5:48 pm","url":"https://shroudstory.com/2015/08/01/remembering-an-earlier-posting-about-the-seamless-robe/","cat":"history","id":"comment-207186","author":"Louis","site":"shroudstory"}]
