[{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"https://search.yahoo.com/yhs/search;_ylt=ApQciSwmQTx23j9qNi7KFKh.lVM6?p=Roman+torture+scourging+%3F&fr=ush-mailn_02&hspart=att&hsimp=yhs-att_001&type=yahoo_pc_mail\n\n","date":"August 9, 2014 at 2:36 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143065","author":"ekmcmahon","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"The first in-depth study of the scourging wounds as manifested on the Shroud cloth was probably by Dr Pierre Barbet, and included in his comprehensive forensic study on the evidence of the full passion, “A Doctor at Calvary”.  It was originally published in French and translated into English by the ‘Earl of Wicklow’ in 1953.  My copy is by Image Books published in 1963.  I am unable to comment on its present availability.  It is considered the classic study of the wounds on the Shroud.  Not only was Barbet an experienced forensic pathologist, researching the crucifixion wounds by experiments on cadavers and amputated limbs, he was also a competent classics scholar having access to several ancient Greek and Roman resources, to support his analysis.  The section on scourging is at Chapter 4, ‘The Preliminary Sufferings’ which also includes the mocking and buffeting in the praetorium and the crowning with thorns.  \nDr Fred Zugibe more latterly, disagreed with some of Barbet’s analysis, alleging errors in his work.  Learned opinion seems to be divided between the merits of the two.  It is well worth attempting any effort to secure the book if you can, even searching second-hand book stores if necessary.  Possibly it may be found in some University Library.  It is the classic work and if you wish to pursue the topic in depth, you need to be at least informed about it. \nIt is also likely that Paul Vignon and Professor Yves Delage may also have covered the topic based on the Secondo Pia photographs of 1898, but would not have had access to the better 1931 photographs of Guiseppe Enrie in 1931.  Vignon’s work presented by Delage to the Paris Academy in 1902 was titled “The Shroud of Christ”.  His classic work in 1938 for which he was awarded the Academy’s Prize is titled “Holy Shroud of Turin: Science, Archaeology, History, Iconography, Logic”, and also includes work on his studies in comparative iconography.\n\n","date":"August 9, 2014 at 5:04 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143076","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"My general understanding is that only 40 lashes could be administered to a Roman citizen.  Jewish executioners could only impose 40 lashes (on sentenced Jews), but in practice imposed only 39, as a kind of margin to avoid exceeding the 40.  St Paul as a Roman citizen (inherited from his Tarsus forbears) suffered only 40 lashes.  However there appears to have been only practical limits for Roman soldiery inflicting the punishment on non-citizens.  These only needed to survive with sufficient strength to be able carry the cross-bar (patibulum) to the place of execution.  The gospel accounts report that Jesus needed assistance from Simon of Cyrene to do this, hence the scourging punishment was likely extreme.  \nThe advantage of tying the victim’s hands above his head to a post would seem to be that if he fainted, the punishment could still continue without undue interruption, although you’ve mentioned revival with salt water.  I am unclear as to whether the victim was normally suspended by his arms alone, or whether it was more usual for him to have feet on the ground support as well.  Most of the scourging wounds are on the dorsal parts of the body and legs, suggesting there was no scope for the body to rotate if suspended.  \nThe paper by Faccini and others, suggest that lictor type fasces were also used to encourage progress of the journey to the place of execution.\n\n","date":"August 9, 2014 at 5:33 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143079","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"There’s scarcely any encroachment of one scourge mark on another, according to Fanti and Faccini’s mapping of 372 of them in total (see their pdf, or a link to a screen grab image in my own critique of it some two years ago).\n\n It must have taken real skill on the part of the scourgers to successfully target new unflayed skin in so precise and geometrical a fashion. One could be forgiven for thinking that the scourge marks, blood for the most part (as distinct from  body image) had been applied manually to linen by an excessively-neat technician using a customized hand tool\nThere are other peculiarities, like a subset of scourge marks described as “fine cuts” when viewed under uv light to obtain a fluorescent background. Again, it’s almost as if the fabric itself had been scourged. Surely not?\n\n","date":"August 9, 2014 at 5:55 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143080","author":"Colin Berry","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Hi Colin,\n                     I must say  that I am most impressed by your patience and ability to remain calm in this environment.\n\n","date":"August 9, 2014 at 8:53 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143090","author":"PHPL","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Remain calm? Patient? Are we reading the same posts?\n\n","date":"August 9, 2014 at 9:32 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143092","author":"David Goulet","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"It’s not easy to remain calm and patient on this site, David.\nLook at Dan Porter’s tactics back in Feb 2012, when he circulated my ideas among the Shroud Science Group SSG. Dan was able to provoke Paolo Di Lazzaro (PDL) into doing a one-off scorch experiment just for my benefit:\nhttps://shroudstory.com/2012/02/21/colin-berrys-idea-is-untenable-and-heat-cannot-produce-a-superficial-coloration/\nI responded, making no secret of the fact that I deeply unimpressed by his self-serving research design  .PDL remained silent, and Daniel Porter has in any case closed off comments.\nI have since referred intermittently to PDL’s perverse coin experiment, set up to show scorching in a worse possible light, but  have been unable to elicit from him any acknowledgement of my presence as a serious researcher, at least as well qualified scientifically as he is (arguably better since his background appears to be more technological than scientific).\nThe only reason I hark back to the past is that today I finally assembled a full riposte to PDL and his flawed attempts to refute the scorch hypothesis with what I consider bad radiation physics, totally ignoring the thermochemistry of pyrolysis (“scorching”) processes notably their endothermic nature under real operating conditions that helps protect against excessive scorching.\nhttp://colinb-sciencebuzz.blogspot.fr/2014/08/might-turin-shroud-simply-be-contact.html\n(see tail end with my responses in blue font).\nI shan’t now be drawn into engaging with PDL directly, given that his understanding of basic fundamentals of physics v chemistry is in my opinion so totally off-the-mark..Instead  I invite Dan Porter, of other members of the SSG to submit PDL’s ideas and mine to a learned scientific society for an impartial opinion. That is how confident I am that it’s my version, not PDL’s, that is the more correct of the two.\nIn the meantime I shall try to remain calm and patient, despite continuing attempts  here to write this blogger off as a oddball. At no stage in my scientific career have I ever been an oddball. Everything I say and do is based firmly on the evidence. The double/negative image of the TS is THE imperative that should have guided research directions, but which has in my opinion been largely ignored (notably by the ill-focused technology-obsessed STURP, obsessed as it was with dismissing  a ‘painted’ image).\n A negative double image with 3D-enhancibility was a product of CONTACT IMPRINTING off a 3D or semi-3D template, for heaven’s sake, not artistic painting.\n\n","date":"August 9, 2014 at 11:36 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143110","author":"Colin Berry","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"I have to tread warily, PHPL, having missed all the live CCTV footage on the crucifixion and its aftermath. So I have to take it on trust that there were two scourgers, not just one, and the flagrum ends flicked round the sides of the body.\nLooking at the video stills (Shroud Scope, F&F’s handy map) I’m still puzzled as to how 372 scourge marks could  have been so evenly distributed, with scarcely any overlapping.\nOh, and how someone could even lift a heavy cross-piece never mind carry it any distance, having had 372 skin-breaking wounds inflicted with the attendant clinical shock, loss of blood and plasma fluid etc doth pass all understanding.\n\n","date":"August 9, 2014 at 10:01 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143096","author":"Colin Berry","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Hi Colin, There are clearly overlapping strokes if you look at the images on Faccini’s paper below,\nhttp://www.ohioshroudconference.com/papers/p19.pdf\nThe image you selected was probably aimed at counting the marks thus the graphics added didn’t even identify the type of scourge used. If you look at the paper in its totality you can’t miss the overlapping of the strokes.\n\n","date":"August 9, 2014 at 10:16 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143098","author":"Mike M","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"I guess you also missed the biblical account that Jesus couldn’t carry the cross all the way. The Romans had to force someone to carry it for him. You can read more about that here\nhttp://en.m.wikipedia.org/wiki/Simon_of_Cyrene\n\n","date":"August 9, 2014 at 10:19 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143099","author":"Mike M","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Don’t you just love it on this site when folk impute to one things one did not say? (I knew the biblical account at the age of 8, and need no reminding about Simon of Cyrene).\n\n","date":"August 9, 2014 at 10:31 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143102","author":"Colin Berry","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Barbet makes the point that no artist ever came near to painting the exactitude of the scourge marks “Painters have been content with, at the most, vague, formless excoriations …”  There were two executioners, the one on the right a little taller than the one on the left, and with a sadistic tendency to whip the legs as well.  The whips were so aimed that they also flicked around to the front of the chest, as shown on the separate ventral image, a highly skilled artifice indeed if it was merely the cloth that had been scourged.  Barbet also makes the point that only the lashes that broke the skin left a mark.  Those that merely caused bruising, left no mark.  They were professionals indeed!  The Roman army was highly trained and specialised, and each understood their tasks well.  There was no room for amateurs.  For many it was a life and death situation.  At their best they were invincible.\n\n","date":"August 9, 2014 at 7:08 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143084","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"In Acts 22:25 the Romans were “stretching” Paul out with things to scourge him.  Paul then asked if it was legal to scourge a Roman citizen.  (It wasn’t.)  Scourging was for non-Roman citizens.  This was true of crucifixion as well.  The exception of this was for Roman soldier deserters.\nThe Jewish lashing was very regulated.  They were bound by law to not go over 40 stripes.  So they limited it to 39 in case of a miscount.  Then 13 was administered to each shoulder and 13 on the buttocks.  A rod was used.\nThis is not the scourging of the Romans.\nIt was generally administered by a trained executioner; a lictor.  However, Easton states that Pilate did not have lictors in his compliment, so soldiers were used instead.  As many as four may be used.\nIt also appears two different type of whips were used.  A flagrum with three straps, with each strap having two lead balls at the end.  The others whips used by Romans were the ferula and scutica.  It appears a scutica was also used for the Man on shroud.  This whip is demonstrated in the above paper I cited.  It consisted of several rods, around four, attached to one handle.\nThe reason I asked the question is it appears you can eliminate the low post method due to Acts 22:25.  Paul was in the same place as Christ about to be scourged by the Romans and they were stretching him out.  I am assuming the same procedure was used on Jesus.\nSo how is the Man struck in the chest if He is tied upright to a column or post?  Could the marks be from the reed that was used to also beat Christ by the mob?  The Bible though, states He was only beaten in the head with the reed, but that does not exclude other places.\nThanks for your thoughts.\n\n","date":"August 9, 2014 at 10:35 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143103","author":"Kenny Vernor","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"I believe the scourging from the back would also leave marks on the front (especially on the sides of the chest) because the thongs would wrap around the body.\n\n","date":"August 9, 2014 at 11:01 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143105","author":"Mike M","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"That is one of the reasons I am more inclined to a low post were the victim bends over.\n\n","date":"August 9, 2014 at 11:02 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143106","author":"Mike M","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"There are no scourge marks on the arms, so Barbet opts for arms above the head.  The tali are not at the extreme end of the lash, but some distance from it, and hence the lash can flick around to the front.\n\n","date":"August 9, 2014 at 3:58 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143141","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Kenny, there is also evidence that the Romans had some freedom in tormenting the Jews. Josephus (War4,chapter11) “(Romans) nailed those they caught, one after one way, and another after another, to the crosses, by way of jest, when their multitude was so great, that room was wanting for the crosses, and crosses wanting for the bodies” whatever happened to Paul could’ve been very different from what happened to Jesus. The crown of thorns is also another example of a punishment that was created for Jesus.\n\n","date":"August 9, 2014 at 7:26 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143154","author":"Mike M","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Mike, Paul’s stretching out came about 20 tears after the scourging of Christ.  It was also in Jerusalem.  I would think there are similarities.  But information is so scant about scourging methods in the Bible.\nThe event Josephus refers to happened in 71 AD and they crucified hundreds of Jews.  \nBut I do agree there are little rules when it came to what the Roman did.  Except cause as much pain as possible.\n\n","date":"August 10, 2014 at 9:43 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143242","author":"kvernor","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"If it is a low post method, how do you sync that with Paul’s “stretching”?  \nIf He is tied to a column or post how can the scourge leave marks in the middle of the chest where marks are on the shroud?\n\n","date":"August 9, 2014 at 5:35 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143146","author":"kvernor","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"I tried to answer the “Paul” Question in the previous post. Regarding the wounds at the middle of the chest it depends on how long the thongs were? I don’t think we have a clear idea from archaeology about the flagrum length. There is also a possibility that Jesus was flipped to the other side (like in the Passion movie) to inflict the wounds on the frontal side since Pilate’s intention was to display Jesus in front of the angry crowd to appease them.\n\n","date":"August 10, 2014 at 8:41 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143236","author":"Mike M","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"I have just re-read the Faccini-Fanti paper presented at the Frascati conference in May 2010.  I see some unresolved problems that need further clarification. \n1) Barbet seems to have envisaged a flagrum fitted with two pellets, as the shape of the scourge wounds are in the form of a dumbell.  He asserts that the arms were held above the head for the simple reason that there are no scourge marks on the forearms.  He assumes that the victim was somehow made to face a post, as the great majority of the scourge marks are on the back.  He seems to explain the much fewer wounds on the chest by the thongs whipping around the body.  This could only occur if the pellets were at some distance from the ends of the thongs.  \n2) If the victim was made to face a post with his arms bound to it above his head, this would not preclude the thongs wrapping around to strike the non-central front of the chest.  Alternatively the arms may have been bound to an overhead beam, when free access to the chest would be possible. \n3) There are many comments that could be made about the Faccini-Fanti paper.  First, there has been considerable Photoshop remassaging of the images used for the analysis, using the tools for ‘noise-reduction’, ‘cloning’, ‘correction brush’, ‘filter-diffusion’, and a few others.  This might be thought to raise questions concerning the integrity of the imagery they obtained.  The authors claimed to distinguish three kinds of marks.  They carried out some scourging experiments using a 60 cm drum, cloths, white paper and carbon paper.  They illustrate a weapon with three pellets on each of four thongs, but used a three thong flagrum, each thong having two pellets at its ends for the experiments. \n4) They do not accept the proposition that the thong marks are caused by the scourging thongs as asserted by Barbet, but assert that this was by a different implement, and that these marks do not match the pattern of scourging.  They envisage they were imposed by lictor type virgae rods.  They simulated these using flexible pear rods.  They seem to infer that these were inflicted as some kind of preliminary punishment.  I suspect it more likely that they were imposed during the journey to Golgotha. \n5)  Their Fig 1 shows very many marks on the front of the chest, but their discussion on the wound sites seems quite limited, and not fully explored. \nI can only suggest that readers make of this paper what they will.  My own conclusion was that I needed to know a lot more about their findings than was given in the paper.  I was not entirely happy about the extent of their image massaging.\n\n","date":"August 10, 2014 at 6:18 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143213","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"I’m still away from home at the moment so can’t give chapter and verse. When Kenneth says he has come across his various methods, may I ask in what publications? There has been a great deal of speculation about Roman scourging, but most of it is not based on much.\nMy advice, for what it is worth, is not to look at the Shroud for information about Roman scourging. Start with Roman authors, most of whom write about different contexts than 1st century Judea, but give some ideas about what happened, in different circumstances, and more particularly its cultural significance. Then look at the very few contemporary illustrations, mostly on coins, and the one single piece of archaeological evidence, which was sold on eBay a little while ago. (The metal rod with little chains and bells dangling from it which you can find in Antiquities books, is now, I believe, thought to be a horse ornament, not a model flagrum). Finally look at what happens when modern people flog themselves, which happens every Easter in Mexico, the Philippines, and so on.\nHaving a better working knowledge, as it were, you can then turn to the Shroud to see how it might fit in to the pattern. Fancini’s diagrams are interesting, but seem to suggest whole squads of torturers equipped with an assortment of different instruments taking turns on all sides. Vignon and one or two others actually made scourges to fit the marks, which later commenters, thinking they were based on other archaeological sources, then used to prove that the marks were clear evidence of the use of that type of scourge. There are two kinds, one with the dumb-bells longitudinal with the thongs, and the other with them transverse. They can’t both be correct, if either. It is quite interesting and thought provoking to sketch in lines from the general direction of the marks as if they were radii, and find the approximate centres of the circles on either side, which have suggested to some people the different height of two scourgers. You could also make something appropriate and see how good a scourger you would be (but use a tree rather than a person…). You will find that it is remarkably difficult to flog someone while standing behind them to their right (assuming you are right-handed). Perhaps the Romans employed pairs of both right and left handed experts to administer their punishments, or the right hand man used back hand.\nFinally Colin makes a perfectly valid point about the fact that so many of the marks are clearly distinct that they can be counted with some precision, when lumps on the end of strings tend to clump together into an amorphous contusion. Someone on the internet has made his own ‘replica’ of a flagrum looking a bit like a garden leaf-rake, with the thongs attached to transverse bands to separate them, which, he declares, is the only design which could result in such distinct wounds.\n\n","date":"August 10, 2014 at 6:48 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143217","author":"Hugh Farey","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Please save the trees!!\nNote that bruising only (= contusions) would leave no residual mark on the Shroud cloth.  Only those lashes which cut the skin are revealed.  \n“They can’t both be correct, if either.”  False!  They could both be equally correct, if applied at different times.  Formal scourging as sentenced;  Lictor virgae during journey to Golgotha, or part of soldiers’ praetorium punishment!  Your innate skepticism is getting the better of your good sense!\n\n","date":"August 10, 2014 at 4:30 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143264","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"No. What I mean is that if Flagrum Model A produces a scourge pattern resembling that on the Shroud, then Flagrum Model B doesn’t. I have seen pathologists fitting both versions to the same set of marks, which doesn’t make sense. Both designs cannot produce the same pattern of prints. All the other scratches, cuts and general bashing about as suggested by Fancini could have occurred at any time, but the two model flagra are, I fear, flagrantly contradictory.\n\n","date":"August 11, 2014 at 5:39 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143366","author":"Hugh Farey","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"In my research I have read about two types of flagrums.  One, as most likely was used on the shroud, had lead balls attached to the ends.  There were other “attachments” used called scorpions.  This was what was depicted in Mel Gibsons “The Passion”.  They aren’t as heavy but are intended to hook into the skin and then rip and tear when the executor pulls the flagrum back.  This is what would leave the back in shreds.  While the scorpions would leave more graphic damage, the other is very damaging too.  Zugibe did a great job detailing what the weighted balls would do to man.  It is possible that the balls could cause even more damage.\nAlso, I checked all the references used to cite scourging was always a prelude to crucifixion  (Livy, Josephus,  Quintus Curtius) and I read each.  I would conclude from these sources that scourging sometimes was administered before crucifixion.  These sources do not force the conclusion that is was always done.\nJesus was scourged by Pilate to gain sympathy from the mob.  It did not work.\n\n","date":"August 11, 2014 at 8:03 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143448","author":"kvernor","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Hugh, about the only description I came across is here:\nhttps://archive.org/stream/B20442336#page/36/mode/2up\nIt was referenced by several sources  Here is one example:\nhttp://books.google.com/books?id=3_YRAAAAYAAJ&pg=PA498&lpg=PA498&dq=plautus+scourge+slave&source=bl&ots=n9Cldi1EEr&sig=sPz6kvuVaD6aeYQNqkKvKpAamio&hl=en&sa=X&ei=WtvnU7bqJ6rl8AGw0YGgDQ&ved=0CDAQ6AEwBQ#v=onepage&q=plautus%20scourge%20slave&f=false\nIt is from a play by Plautus and states that the victim would be suspended from his hands with 100 lbs of weight tied to his feet.\nAll the other references are not original sources.  They are encylopedias and such.  \nJosephus and Horace both describe the consequences of scourging but not the methods.\nThere are at least four low posts that some claim are the scourging post of Jesus.  Search scourging pillar if you want to explore them.\nAnother interesting twist is the Game of Kings.  I found a couple of sources for it.  Here is one:\nhttp://thinkhebrew.wordpress.com/2009/06/18/the-game-of-the-king/\nThere is a tile stone in Fortress Antonia (Where traditionally it is thought Christ was scourged) that is engraved with this game.  It is like our “Truth or Dare” game.\nIt began by the soldiers abusing rookie soldiers.  After some soldiers died as a result of this game, the game was outlawed.  The soldiers then played it on prisoners.  When you were the “King” you wore a robe and decided what meanness you could perform on your target.  Then it was done.\nI can see them playing this game with Christ and even using their robe and staff to mock Him.\nI emailed Dan searching for sources that would describe the Roman scourging.  Right now if one considers the only original description of scourging (above), along with Acts 22:25, and the scourge marks on the shroud, I would say the evidence points to Christ being suspended.\n\n","date":"August 10, 2014 at 5:08 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143267","author":"kvernor","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Primary sources are everything, I’m afraid. For what it’s worth, I do not think there is a shred of evidence for any such game as the “Game of Kings,” nor that the pattern on the floor of the lithostratus was in any way connected with such a thing. The whole concept was cobbled together from the bible after the stone was discovered.\nSorry Daveb, but that’s my innate scepticism again!\n\n","date":"August 11, 2014 at 6:09 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143370","author":"Hugh Farey","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Hugh, tell me more about your source on the Game of kings please,\n\n","date":"August 11, 2014 at 7:46 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143445","author":"kvernor","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"There are no sources; that’s my point. The carving which turned up in the lithostrotos is a circle divided into eight, with three other marks close by, which may or may not be related; some concentric squares, an oval with lots of little lines attached, and a circle marked with the letter B. Similar, but not identical patterns turn up here and there around the Roman Empire, and they are usually interpreted as game boards. What games they were used for and how you played them is a matter of total conjecture.\n\n","date":"August 11, 2014 at 9:17 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143451","author":"Hugh Farey","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Here is one source:\nGabbatha (aramiac) the name of the place called in GK lithostotos) the scene of the judgment of Jesus by Pilate (Jn 19:13).  This event took place in the Praetorium.  (Mt 27:27 Mk 15:16).  There are two generally accepted sites which can be identified with the palace which Pilate occupied while he was in Jerusalem; one is the site of the modern citadel near the Jaffa gate, the other is the site of fortress of Antonia adjacent to the NW corner of the temple area.  The meaning of the Aramiac gabbta is uncertain, but it appears to mean “height,” perhaps something like an Eng “knob.”  The GK lithostrotos means a flagstone pavement.  Under the convent of Notre Dame de Sion in Jerusalem there has been discovered an extensive flagstone pavement.  The stones are of limestone, about 3 ft square.  The remains indicate the existence of a flagstone court about 165 ft on its NS side and about 150 ft on its EW side.  These flagstones have been worn smooth by traffic and they are striated for the movement of horses.  These are traces of the W entrance to the court, which was a double arched gate; it is altogether probable that a matching double arched gate lay on the E side of the court.  Near the W entrance there are races of a chamber which is identified as the guardroom.  At the NW corner of the court there was  a stairway which lead to a terrace.  There were also stairways on the E side of the court and in the SE corner.  The remains at the NW corner suggest the foundations of a tower.  Under the court is a vast double vaulted cistern, 170 ft long by 46 ft wide.  On the flagstone pavement near the guardroom was a peculiar complex of markings which can be identified as the board of a game something like parches, in which the players advanced from one position to the next, probably by the throw of the dice.  One line terminated in a crown and another in what appears to be a saber.  The GK letter Beta, which appears a few times in the diagram, suggests that this was the board of the game called basilikos (royal), in which the winning course in the symbol of death.  The game is thought to reflect the practice of the substitute king which goes back to ancient Mesopotamia.  For the week of festival of the New Year in Mesopotamia and of the Sacaea in Persia and the Saturnalia of Rome a slave or a condemned criminal was allowed to live as a king; at the end of the festival he was executed.  No archaeologist questions that the pavement represents the site of the fortress of Antonia built by Herod at the NW corner of the temple area on the site of an earlier Hasmonean fortress.  The fortress stood upon the eminence of Bezetha, which can now scarcely be distinguished.  The stairs the E an SE give direct acces to the temple court, permitting the Roman cohort to move immediately to the court if action was necessary.  Some archaeologists, however, have questioned whether the pavement belongs to the period before the destruction of Jerusalem in AD 70 or to Aelia Capitolina, the city built by Hadrian after the suppression of the rebellion of AD 132-135.  The evidence supports the opinion of most archaeologists that the pavement is the actual pavement of the court of the fortress of Antonia.  It is another question whether Pilate resided at this fortress or at the palace at the site of modern Citadel.  Strict archaeological demonstration is impossible, and the literary sources do not decide the question.  The game board offers an explanation of the crowning with thorns; if the soldiers were playing the game during the hearings of Jesus, the game might have suggested their rude sport.  In fact, they may have made Jesus Himself the pawn of the game.  The fortress of Antonia was destroyed in the fall of Jerusalem in AD 70.  In the excavation of the area there was found a rounded stone weighing 770 lbs which was a ballistic missile of the Roman artillery.\nThe Dictionary of the Bible\nJohn L. McKenzie pages 290-291\n\n","date":"August 13, 2014 at 10:48 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143703","author":"kvernor","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"I was wondering what the biblical scholars here make of the account of the scourging in St.John, differing as it does from the other three gospel accounts inasmuch as the preliminary punishment ordered by Pilate came well before the latter’s final protracted decision to acquiesce to the braying mob. Pilate in fact continues his interrogation after the scourging, and despite some initial and understandable silence on the part of Jesus succeeds finally in extracting a cogent answer.\n“Thou couldest have no power at all against me except it were given thee from above: therefore he that delivered me unto thee hath the greatest sin.”\nDoes that sound like someone who has been scourged to within an inch of his life, with 372 tears in the flesh no less (not counting the copious blood flows from the similarly pre-installed crown of thorns)?\nCome on folks. Get real. Even if the TS body image were authentic, the too-perfectly-spaced plethora of different scourge marks has to be an imaginative add-on.\n\n","date":"August 10, 2014 at 7:15 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143221","author":"Colin Berry","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"I am not a biblical scholar Colin, but what do you think Pilate ment when he said ” Behold the man” and displayed Jesus to the crowd? He must’ve been reduced to a mess otherwise that phrase would be meaningless.\n\n","date":"August 10, 2014 at 8:32 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143234","author":"Mike M","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"How would the mob have known that Jesus had been “reduced to a mess”, if indeed that was the case (which I doubt very much from the aforementioned verbal exchange between accused and inquisitor that came after, not before, scourging). \n Even if Jesus had been a scarlet mess of flayed skin from head to toe, much would have been concealed by the  “kingly” purple robe.  Might “behold the man” simply have been a ironical reference to the spoofing of a king’s apparel?\nBut heck, what do I know?\n\n","date":"August 10, 2014 at 9:07 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143238","author":"Colin Berry","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Like here,\nhttp://timvalentino.com/2012/03/28/the-death-of-jesus-part-5-the-crown-of-thorns-and-mock-robe/\nColin, sometime you amaze me. You go to great length of creativity to prove the shroud is fake, your creativity completely ceases on the other end of the spectrum.\n\n","date":"August 10, 2014 at 9:16 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143240","author":"Mike M","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Sorry, but you’ve lost me there. Creativity is about presenting new angles that no one has previously thought of. \nThere’s nothing in the least bit creative about showing the scourged Christ in a ‘kingly’ robe, conveniently open to reveal the blood. That’s simply one of many imaginative artistic reconstructions of the sparce-on-detail biblical account that you have chosen from image files to support a view that has absolutely no biblical support whatsoever – namely that the intention was to make scourging so severe (as per Shroud) as to make it appear virtually indistinguishable from a slow form of execution in its own right (which of course the  Romans had sadistically perfected, and which may have misled artists to over-exaggerate in the biblical scenario).\nFrom John’s account alone I interpret the preliminary scourging as having been a token gesture  – possibly intended as an attempt to meet the mob’s demands halfway, a ploy that might (optimistically) have placated the rabble-rousers while playing for time, hoping that a lesser but still severe punishment and humiliation might have made them drop their demands for immediate execution.\n\n","date":"August 10, 2014 at 10:04 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143244","author":"Colin Berry","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"“Creativity is about presenting new angles that no one has previously thought of…..That’s simply one of many imaginative artistic”\nYou lost me there…I thought you needed imagination to be creative. In other words, Without imagining something into existence how do you create it/be creative?\n\n","date":"August 10, 2014 at 10:38 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143245","author":"Mike M","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"There’s that handy expression: “necessary but not sufficient”. Imagination is necessary for creativity, but is not sufficient. I find a brisk walk, followed by a pint of decent ale at a local hostelry helps too.\n\n","date":"August 10, 2014 at 10:48 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143246","author":"Colin Berry","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Cheers!\n\n","date":"August 10, 2014 at 11:24 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143249","author":"Mike M","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Well Colin I don’t necessarily think that text should be read literally.\n\n","date":"August 10, 2014 at 4:24 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143263","author":"Thomas","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"So what are you saying, Thomas? That John was a shoddy journalist? That he was making it up as he went along? “Holy scripture”? Holy unbelievable?\n\n","date":"August 10, 2014 at 4:58 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143265","author":"Colin Berry","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"John’s gospel was probably written not much earlier than 80 AD, and even quite likely later.  It would have been based on fairly well-disciplined oral traditions.  It may have been written by the apostle John when an elderly man, or by a Johannine school in Ephesus.  Quite likely the apostle John was present during the trial and sentencing (others except perhaps Peter had fled), so it may have been an eye witness account.  There was probably access to some of the earlier synoptic accounts to assist.  But John’s account is quite different from the synoptics.  The purpose in writing each of the gospels was in proclamation, and though based on historic events, it is not history in say the style of Josephus or as we understand it today.  If you are old enough, try to remember the details of a major event in your life from 50 years previously or one that occurred very early in your life.  Set it down in writing.  How accurately can you remember the details?  Will it differ from that of another’s account?  Most certainly, yes!  Even at a funeral  of a close relative, there will be disagreement about the details among those familiar with the person.  Each one has their own story.  Both my brother and sister often have different accounts of our early family history from my own recollections of family events.\n\n","date":"August 10, 2014 at 4:58 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143266","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"I selected the version from John since it was the one that seemed most at odds with the comprehensive scourging of the Man on the TS. But even with his testimony, a similar discrepancy arises when once considers the largely matching narratives, needless to say, from the synoptic gospels. Why scourge someone to within an inch of their lives if that’s just the start of a prolonged public spectacle of  humiliation and torture? Do you really want the victim passing out from shock, possibly dying on you prematurely?\nSpecifically: Matthew: scourging “by Pilate” before handing over to the soldiers. Nothing to suggest that the scourging was as comprehensive as the TS would suggest, in view of subsequent taunting with the scarlet robe, the mock kneeling before the “king” etc etc, suggestive of someone still capable of standing and indeed required to carry a cross.\nThe reasons for Pilate administering a scourging, or maybe delegated (unclear), having stated his belief that Jesus was innocent of the charges brought against him, are not clear, and maybe someone knows the protocol. If not, I’d suggest it was merely a convention that if a Governor sent someone off for execution, even against his better judgement, then protocol demanded there had to be a ritualistic scourging, maybe for taking up the Governor’s time, possibly/probably  fairly token so as not to seriously sap the victim’s strength for the further ritual still to come.\nMark: essentially the same as Matthew: Pilate scourged Jesus before sending him off for execution. No suggestion that it was incapacitating.\nLuke:: Quotes Pilate as saying, twice, that he would “chastise” Jesus before letting him go, having found him not guilty of the charges levelled against him. It is not clear if that “chastising” took place when Pilate finally felt obliged to acquiesce to the mob’s demands. Either way, there are no grounds for thinking the chastising (a level down from scourging?)  would have been anything like as severe as suggested by the TS.\nOne gets the impression that the image of an over-flayed Man on the TS is used not just to fill in gaps in the biblical account, but to attempt to seriously overwrite the consistent message from all four gospel accounts that the scourging must have been fairly nominal, so as so allow for subsequent humiliation and spectacle of the still fully-conscious victim before actual crucifixion, and indeed to allow a further round of interrogation in John’s account.\n\n","date":"August 10, 2014 at 6:08 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143276","author":"Colin Berry","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Colin Berry says:  “Creativity is about presenting new angles that no one has previously thought of.”\n***Angel says:  I agree, Colin.\nWhat about this new angle, referencing the resurrection of Jesus?\nFirst, think in terms of Einstein’s “Unified Field Theory,” as opposed to his “Theory of Relativity,” where he attempts to conflate the electromagnetic and gravitational fields into one mathematical reference frame.\nNext move to Germany’s  “The Nazi Bell Project,” and then on to Russia’s, (Dr. Podkletnov’s) experiments on antigravity.\nhttp://gizadeathstar.com/2014/06/update-podkletnovs-antigravity-research-high-octane-speculations/\nAnd then fast forward to Lockheed-Martin’s antigravity discoid spaceship with onboard laser technology, X-22A.  The “A” stands for antigravity.  \nYet, there was the denial of Lockheed that they were NOT working on such a spacecraft. \nAnd finally Boeing’s admittance in the research and development of antigravity (notice the use of the word “may in the statement below.”\n“It is also possible, Boeing admits, that “classified activities in gravity modification may exist”. http://www.ufoevidence.org/documents/doc1064.htm\nAnd finally Obama’s “GRASP” briefing (see following statement).  Remember Russia’s Dr. Podkletnov mentioned earlier?\n“The GRASP briefing document reveals that BAE Systems and Lockheed Martin have also contacted Podkletnov “and have some activity in this area”. \nThe Lockheed X-22A space disc uses antigravity technology, avoiding radar, and is able to disappear and then re-appear in the sky.\nWith all this in mind, I believe Jesus used “antigravity” when He resurrected.  And for this reason, (controlling gravity), He was able to appear, (entering through the wall) to visit the disciples after the resurrection and then disappear after His visitation.\nThis is a wild and crazy theory, Colin, but I believe electromagnetism (Einstein’s Unified Field Theory) was utilized by Jesus at the resurrection, allowing Him to control gravity, as He left the tomb without a trace.  For this reason, the Roman guards would not have seen Jesus leave the sepulchre.\nBest,\n\n","date":"August 10, 2014 at 6:35 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143278","author":"Angel","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Nowhere in the New Testament do its authors dwell on the horrors that was the Roman punishment of crucifixion.  They are content merely to sketch the scene and to say that it happened.  Likewise we cannot then expect them to give the gory details of the scourging punishment.  They give the bare factual account only.  Their end point is the triumph of the resurrection.  That is their goal, the proclamation of the resurrected Christ.  \nAs to details we might turn to Barbet.  He focuses on a single blood-flow, that on the forehead from the cap of thorns.  He devotes more than a full page to it, as if in a forensic report.  He concludes by saying:\n“I would defy any modern painter, unless he is a surgeon, with a thorough knowledge of the physiology of coagulation, and meditated for a long time on all the possible avatars of that thin thread slowly coagulating in the midst of the obstacles, to imagine and portray this image of the frontal clot.  Even with such conditions, it is more than likely that some blunder would betray the forger and his work of imagination.”\n“As for the hypothetical painter whom people have dared to claim was capable, having painted or stained these negative images in the Middle Ages, of imagining (whatever his genius might have been) all the minutiae of this clot which is as pregnant with truth as if it were on a living man – it is enough to disgust a physiologist and a surgeon.  Please do not talk of it!  This image, and it alone should be enough to prove that nobody has touched the shroud except the Crucified Himself.  And it is one image among a hundred others.” \nWe might accuse Barbet of excessive hyperbole.  But he knows his pathology and his forensics.  The two paragraphs above speak louder to me than any wild imaginings of doubtful skeptics, no matter what claims to scientific competence they might assert!\n\n","date":"August 11, 2014 at 1:31 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143330","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"“Likewise we cannot then expect them to give the gory details of the scourging punishment.”\nMethinks you have missed the point. It’s pure conjecture that scourging/chastisement, in all cases while under Pilate’s jurisdiction, ever matched either the gory scenes we see in so much art, so much imaginative speculation, or as implied by 372 scourge marks on the TS.\nWhy would Pilate subject Jesus to so horrific a scourging, reducing him to ribbons, when he had been protesting right to the last that the accused had no case to answer?\nI say it was nominal chastisement, done in accordance to some or other convention, in the presence of Pilate, and perhaps his wife too, and the victim then delivered to the soldiery for crucifixion. \nThe scourging, flagellation, chastisement, call it what you wish, was NOT carried out by the sadists who came up with the wheeze of robe, crown of thorns etc. As I say, it was under Pilate’s direct command and control, entirely separate from the gloating tormentors, no matter whose account you read, and for all we know was administered by Pilate himself  (if one takes the Matthew,  Mark and John accounts literally) or was to be administered by Pilate (with a question over whether it was actually performed) in the Luke account. \nI’m frankly amazed that anyone should suppose that Pilate would have personally delivered or even supervised the kind of brutality that is taken for granted by this site’s pro-authenticity tendency. Neither can it be explained away purely by saying the NT spared us the grisly detail. One has to consider the context, i.e. of a governor doing his level best to spare Jesus  right up to the very last minute – not to go creating a gory blood spectacle in his own chambers as we are being asked to believe.The biblical account should guide shroudology, at least for those who wish to persuade sceptics of the TS’s authenticity, NOT vice versa. There are no grounds whatsoever for thinking that Pilate was complicit in having Jesus cut to to ribbons. Nobody else but Pilate ordered or applied the scourging. \nRepeat: the location and time sequence are vital considerations if one is to see the preliminary scourging in its proper context. Nobody bows and scrapes mockingly to a collapsed and quivering  heap of raw meat. Get real folks. The scourge narrative has been hideously over-hyped to fit with those hugely improbable markings in blood (all 372 of them) none of them part of the body image, and in this sceptic’s view, late additions by the narrative-embellishing tendency.\n\n","date":"August 11, 2014 at 2:39 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143336","author":"Colin Berry","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"PS: the clincher, as I said earlier, is the John account in which Pilate calls Jesus back one final time AFTER the scourging. That to me says the scourging was better described in the Luke version as “chastisement”, probably more for show than anything else, administered by Pilate himself (possibly to express his impatience and/or an attempt to elicit more informative answers to his questions).\n\n","date":"August 11, 2014 at 3:23 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143344","author":"Colin Berry","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Nice points Colin. The number of wounds does seem problematic.\nSo are you thinking something along the lines of a medieval person apply the markings vua a bloodied stamp?\n\n","date":"August 11, 2014 at 3:27 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143345","author":"Thomas","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"But then thats an awful lot of stamping! Why go that far?\n\n","date":"August 11, 2014 at 3:41 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143346","author":"Thomas","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Because the body image is exceedingly faint, indeed is said to disappear from view if one gets too close. Adding lots of “scourge marks” in blood compensates for the now-you-see-it-now-you-don’t body image.\n\n","date":"August 11, 2014 at 4:08 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143356","author":"Colin Berry","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"We have no pictorial record that I can think of that depicts the scourge wounds of the shroud.\nThat could imply:\n1. The scourge marks were a very late addition, maybe post 1700s, to try and dupe an increasingly skeptical post enlightenment world.\n2. The scourge marks were viewed as secondary or inconsequential.  This seems hard to support given their prominence.\n\n","date":"August 11, 2014 at 3:48 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143348","author":"Thomas","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Thomas: thank you. As I expect you know, there are scourge marks visible on the Lier copy of the TS (1516) though more sparce than on the TS, shoulders and back especially. There are none that I can see on the Lirey Pilgrims badge, circa 1357 (?). One could claim that’s on account of its small dimensions, but an artisan who was able to show a repeating herring bone weave pattern should surely have been been able to add a few score marks to the naked figure to represent scourging.\nSo yes, I do believe that TS Mk 1 was free or largely free of scourge marks, and was “read”  i.e. interpreted in its first Lirey showings as a relatively clean and uncluttered sweat imprint, analogous to the Veil of Veronica, with nothing to upset the squeamish.\nYes, a blood-coated stamp could have been used to create scourge marks. That might explain why one only sees an imprint of  the “thong” between the 2 or maybe 3 lead pellets, there being no sign of thong imprints where thong meets, ie. immediately abuts onto, the first most proximal of the pellets, relative to the flagrum handle. Maybe someone decided to keep things simple, maybe too simple, too formulaic.\n\n","date":"August 11, 2014 at 4:01 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143354","author":"Colin Berry","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"It is you who is also projecting into the gospel a scourging narrative that suits your theory. Which is fine, what’s good for the goose…but let’s not pretend your version of what may have happened on Good Friday is any more ‘gospel’ than anyone else’s. We’re all dealing with conjecture on this topic.\n\n","date":"August 11, 2014 at 7:42 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143380","author":"David Goulet","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Quick reply:  My narrative? What narrative? I’ve simply resorted to textual analysis, pointing out the ABSENCE of evidence, i.e. biblical evidence  that Jesus had ever been subjected to the degree of scourging we see on the TS.\n Mine is not a narrative, though I’ve speculated as to reasons  for a conjectured non life-threatening, non-incapacitating chastisement. It’s more by way of a critique and a challenge, emphatically NOT an attempt to impose my own narrative. \nI am not anti-Shroud authenticity. Starting in Dec 2011, when I first encountered that appalling excursion by ENEA’s uv excimer laser team into ‘theoscience’ with their elementary misunderstandings of basic fundamental physics and chemistry (see tail end of my latest sciencebuzz posting) my beef has been the shoddy self-serving so-called scholarship that underlies so much of the pro-authenticity case, and at all levels (scientific, medical, historical, and now even biblical). \nDan Porter can call me a dilettante if he wants to – it won’t make a blind bit of difference. One does not need to be either a specialist scholar or Renaissance Man to function as a detective or investigative reporter.\n\n","date":"August 11, 2014 at 8:07 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143383","author":"Colin Berry","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Following Augustus’ deposing of Herod Archelaus in 6 AD, the status of Judea was changed from that of a client kingdom to a Roman province, and a prefect, later called a procurator was sent to govern it, supported by a small Roman army of some 3,000 soldiers, mainly from Sebaste and Caesarea, although the officers were likely from Rome or Italy.  Pilate was procurator 26 – 36 AD.  Pilate was completely in charge.  When one has dogs, there is no need to bark oneself.  A few of the primitive texts (e.g. “Pilate flogged him”) might leave the impression that PIlate himself was the executioner.  Having a garrison at his command this is unthinkable. \nAll of the gospel writers to various degrees seek to impose the blame for Jesus’ death on the Jews of that time, and even their posterity.  It reflects the ongoing tension between the various early churches and the local synagogues.  They wish to make the point that a new age has emerged, the Jews no longer have an exclusive claim to be called the People of God, Jesus’ death and resurrection has changed everything.  The early churches spread throughout the empire and seemed anxious not to offend the Roman overlords.  This is evident in Acts and also the epistles.  It is evident in their accounts of Pilate’s judgement.    \nConcerning this judgement, Christian tradition has seen it differently.  Both the Apostles’ and Nicene Creeds place the blame and responsibility where it should rest.  “… And was crucified under Pontius Pilate …”  The man is named! \nThe Second Vatican Council explicitly exculpated the Jewish people, then and since, from the responsibility for the crucifixion of Jesus.  There is no Jewish vicarious responsibility, only personal responsibility, firstly by his accusers, and in the final decision which was PIlate’s.\n\n","date":"August 11, 2014 at 4:01 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143355","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Colin I didn’t know there were scourge marks visible on the Lier depiction.  I will have a look.\n\n","date":"August 11, 2014 at 4:08 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143357","author":"Thomas","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Dave, when you write “It is evident in their accounts of Pilate’s judgement” , are you talking about the gospels or about the early churches ?\n\n","date":"August 11, 2014 at 6:16 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143373","author":"PHPL","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Sorry, I was referring to the gospel accounts, which is fundamentally a product of the early churches with the background of their negative experience when attempting to preach in the synagogues.  Pilate is presented as an impartial judge, who wants to do the right thing, while the Jews are presented as a howling mob stirred up by their leaders.  Pilate finally gives in, succumbing to the threat that he would otherwise be no friend of Caesar, and that a riot was imminent.  He had been delegated supreme imperial authority, with a small army of 3,000 to support his decisions, and so the responsibility is ultimately his, as set out in the Creeds. \nAnother example would be Paul’s interview with Governor Festus towards the end of Acts.  Festus is presented as ready to release Paul, but Paul surmising that the Jews would only pursue their animosity towards him, holds out for an appeal to Caesar, as he is entitled to as a Roman citizen. \nIt is only when we come to the Book of Revelations, with the recollection of recent persecutions, and the claims of imperial divinity, that we see a Christian challenge to this authority.  But here, the text is in coded form, and only those “in the know” can understand it as that challenge.  The references to Babylon (Rome) , Nero’s coded number of 666 and so on.\n\n","date":"August 11, 2014 at 4:04 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143430","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Colin\nIn terms of the Lier images on the web, I can’t find any that show scourge marks. Can you refer me to an image that allows closer inspection where they might be more readily seen?\nThe depictions themselves could be a whole posting in itself. For example, as far as I can tell, Lier does not show streaks of blood down arms, and definitely does not show pool of blood across lower back. Why not? They are very prominent markings on the Shroud.\nDid the artist, for some reason, think them not significant? Or did they in fact not exist in the early 1500s, being later “add ons”?\nAlso of interest – to me at least – is what looks like a chicken drumstick (!) on the frontal side of the Lier copy near the L shaped holes. Maybe a fish (symbolic)?\nCurious…\n\n","date":"August 11, 2014 at 6:48 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143376","author":"Matthias","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Hello Matthias. Long time no see/hear. Wherevyerbinhidinallthistime?\nThis is by way of a holding reply, since I’m shortly off out. I did on a posting on the Lier copy some two years ago, and have just added a couple of enlarged photos onto the end, showing what I believe to be scourge marks within the yellow boxes.\nhttp://shroudofturinwithoutallthehype.wordpress.com/2012/07/25/faking-it-part-3-why-do-early-copies-of-the-shroud-show-so-little-evidence-of-the-in-your-face-blood-stains-we-see-today-some-wont-like-the-answer/\n\n","date":"August 11, 2014 at 7:25 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143379","author":"Colin Berry","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"There are no scourge marks on the Lier copy. Colin is being creative again and to get his point through is using a black and white grainy image. Look at the coloured image and compare the side wound (even poker holes)  to what is claimed to be scourge wounds.\nhttp://www.imagochristiorganizationinc.com/about-the-shroud.php\n\n","date":"August 11, 2014 at 8:21 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143387","author":"Mike M","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"I find this comment totally baffling. It seems to be implying that I have some kind of axe to grind in asserting that the Lier copy shows scourge marks. Pray what might that be? If we’re agreed there are scourge marks, or representations thereof on the TS, then why not on a copy thereof? Why should the presence or absence of scourge marks on the Lier copy be an issue to divide pro- and anti-authenticity opinion. \nIf folk here want the Lier copy to lack scourge marks, then I’m totally relaxed on that score. However, I’ve taken that colour version of the Lier copy, which seems a bit bright, and low contrast, and made some minor adjustments using MS Office Picture Manager. Make what you wish of the result (which I’ve added to my Lier posting – see link above). I see transverse streaks, especially on arms and legs and maybe shoulders, consistent with an attempt to depict scourge marks. One is free to differ – and  as I say I’m totally indifferent on that score.\nMy message on this posting is that it’s pure conjecture  to suppose that Jesus incurred some 372 scourge marks at the hands of Pontius Pilate or his subordinates (“cut to ribbons” in common parlance). There’s simply no evidence in any of the four gospels to suggest that Jesus was grievously wounded by the preliminary scourging. Quite the contrary in fact: the John version argues strongly that he was not.\n\n","date":"August 11, 2014 at 11:51 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143407","author":"Colin Berry","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"“If folk here want the Lier copy to lack scourge marks, then I’m totally relaxed on that score.”\nColin, it’s not a matter of what I want or not. It’s a question of “are they there or not?” Regardless of the authenticity case, you made an observation and I disagreed (and proved my point). And BTW I never expected you to change your mind. I think any fair observer who check the coloured image will conclude there are none. And that’s good enough for me.\n\n","date":"August 11, 2014 at 7:53 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143446","author":"Mike M","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Methinks you are coming across now as someone who takes dogmatic positions, which in this instance can be for no sound reason, given the Lier copy WOULD show scourge marks were it to be an accurate copy of the TS.\nAs I say, I’m not going to dwell on so trivial an issue for any longer than absolutely necessary, but it does become necessary when one encounters the reference to ‘fair observers’ implying I do not qualify for that description. I devoted an entire posting to the Lier copy some two years ago, and do not recall anyone saying my analysis lacked objectivity or was otherwise  at fault.\nHere’s an independent source that makes a brief reference to scourge marks and the Lier shroud copy. I leave folk here to draw their own conclusions, not wishing to have my own “fairness’ further called into question by those who will brook no opposition. It’s a straight cut-and-paste, with no editing: i.e.  the emphasized words are the author’s, not mine.\nDetails of the Lier copy. \nThe artist painted exactly what he saw, using only ONE paint for the body image: a dark reddish-brown waterpaint, prepared following the Venetian tradition, using the white of an egg as a binder. The differences in colour-intensity, are due to the application of the paint in layers. The nose and upper parts of the face and body are very dark, in time almost turned to black. The double image is undoubtedly a copy of the faint NEGATIVE image on the Shroud. Therefore, all is shown in reverse. The wounds, not correctly situated, are depicted in CRIMSON RED. Was this painted in concordance with the descriptions of the Shroud, from the hand of count de Lalaing and father Zantvliet? The wounds caused by the scourging and the thorns are almost invisible. The nail wounds are placed in BOTH palms.\nFrom: The Red Stains on the Lier and Other Shroud Copies\nBy Remi Van Haelst, Belgium\nhttps://www.shroud.com/vanhels2.htm\n\n","date":"August 12, 2014 at 2:30 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143476","author":"Colin Berry","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"The number of scourge marks previously counted by Barbet, Willis, Bucklin and others, vary between 90 and 120.  With a two thonged whip, that is between 45 and 60 lashes, although some would leave no mark, and there were likely more.  The number of 372 scourge marks would seem to depend on whether or not one accepts the paper by Fanti and Faccini. \nI would make the further comment, that nowhere in the gospels is there any dwelling on the pain and suffering experienced by Jesus as a result of his sufferings.  Their end-point is the triumph of the resurrected Jesus.  They are written almost clinically as an objective report on what happened rather than exploring the existential aspects.  This was left to later mystics and visionaries who interpreted them as such.  There is really no case that the scourging was a mere chastisement.  It was a normal prelude to crucifixion, and from the victim’s point of view probably an advantage assisting a rapid death, which in some cases was known to last several days.\n\n","date":"August 11, 2014 at 4:24 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143435","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"“There is really no case that the scourging was a mere chastisement.”\nStill more dogma, dressed up as sweet reason.\nMy advice: forget about all the bloody images from medieval art. Go back to the 4 gospels, re-read the highly nuanced exchanges between Pilate and the accused, and then ask yourself why flagellation inflicted by Pilate himself or under his personal direction would have been so brutal as portrayed in attention-grabbing art, given Pilate’s repeated insistence to the mob that Jesus had committed no crime. \nThere was no market in medieval times for art that showed a reluctant and half-hearted flagellation: indeed it would probably have been seen as sacrilegious.  We really ought not to allow our interpretation of the written account, bare though it is on detail, to be influenced by those from past centuries who felt an obligation to hype up the biblical record. (MikeM please note. That image you gave was the product of an over-vivid imagination, which as I say was inconsistent with the John version, with interrogation continuing after (a tongue-loosening?) flagellation.\n\n","date":"August 12, 2014 at 3:00 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143480","author":"Colin Berry","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"I have been chief reader of the Passion narrative on more Palm Sundays and Good Fridays than I can remember, possibly as many as 40.  I think I know them well enough already!  But I still manage to bring out different nuances each time.  I’ve already explained that the evangelists always seem to exercise caution when it comes to criticising Roman authority and don’t seem to want to risk it.  The Jews were a different matter for them.\n\n","date":"August 12, 2014 at 5:59 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143506","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Colin’s comments on the scourging of Jesus remind me of a comment a friend made after seeing Mel Gibson’s The Passion. “A person couldn’t survive that kind of punishment.”  My reply, “Well, he didn’t, did he?”\nSurely Jesus did not suffer to the degree we saw in The Passion, for that kind of scourging would have been an execution unto itself. But Jesus, according to all four gospels, dies within hours of being nailed to the cross — thus no need to break his legs.\nThe wounds on the TS point to a scourging that went, at some point, beyond mere punishment. They were severe enough to stress his body to the point that he falls thrice on the way to Golgotha and then lasts but a few hours on the cross.\nWhy was Jesus scourged so severely, when the object of crucifixion is prolonged agony? I don’t know, but why did the Romans crucify anyone on a day when they knew they’d be cutting their victims’ suffering short anyway (i.e. the thieves)? Perhaps Roman/Judean bureaucracy was much like our own, even when it came to executions, the right hand didn’t know what the left was doing.\n\n","date":"August 11, 2014 at 1:21 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143414","author":"David Goulet","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"“The wounds on the TS point to a scourging that went, at some point, beyond mere punishment. They were severe enough to stress his body to the point that he falls thrice on the way to Golgotha and then lasts but a few hours on the cross.”\nWhile I don’t claim any clinical expertise, the constant references to “vinegar offered on sponges” suggest another possibility – i.e. deliberate depriving of water, with death being hastened by dehydration and heart-failure.\n\n","date":"August 11, 2014 at 1:50 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143415","author":"Colin Berry","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"From what cursory reading I’ve done on the matter, there’s two trains of thought here on the offering of the ‘sour wine’. One was that it was an act of mercy by a Roman soldier who offered his own ration of ‘sour wine’ (the drink of lower echelon individuals) intending to dull Jesus’ suffering (this would favour the argument that Jesus was in such grievous pain that even a hardened soldier was moved to pity him).\nThe other take is that it was an act meant to mock him. In any event, he is relcuctant to accept the ‘gift’.\nWhatever the gall and vinegar was, you are correct in that the effect would be a quickening of the dehydration of a crucified victim.\n\n","date":"August 11, 2014 at 2:18 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143420","author":"David Goulet","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Yes, all four of the gospels say that vinegar was offered, presumably as the only fluid, shortly before the end. One could reasonably suppose that it hastened metabolic acidosis and death, but apart from sounding excessively first-year medical, that would suppose it had been accepted. What seems more probable is that the vinegar was an unwelcome substitute for what the victim really craved for, i,e. plain water, so death was hastened by dehydration.\nOne could go further, but risk being deemed “creative”, or attempting to sneak in an agenda-driven narrative.\n\n","date":"August 11, 2014 at 2:39 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143422","author":"Colin Berry","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"The “vinegar” is probably the translation given to the sour wine, the standard drink of the soldiery.  It was probably safer than water in those days before water purification became prevalent.  Beer was the standard drink during the Middle Ages.  Mixing in the gall was supposed to dull the pain.\n\n","date":"August 11, 2014 at 4:31 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143437","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"Reblogged this on Shroud of Turin: Picture of Jesus?.\n\n","date":"August 11, 2014 at 4:11 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143433","author":"Dan","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"“And so Simon Peter also came, following him, and entered the tomb; and he saw the linen wrappings lying there, and the face-cloth which had been on His head, not lying with the linen wrappings, but rolled up in a place by itself.” John 20:6. Off topic, I believe that the Sudarium of Oviedo is the face cloth of Jesus. How is it possible to not show any smearness of blood on the TS if Jesus removed the face cloth and wrapped it before He projected His likeness on the burial shroud? Since there are no image on the face cloth?\n–\n\n","date":"August 12, 2014 at 11:42 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143559","author":"Don","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"I believe the conventional thinking is that the face cloth was removed by the burial group and thus was not on his face at the time of the image formation.\n\n","date":"August 12, 2014 at 12:23 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143567","author":"David Goulet","site":"shroudstory"},{"title":"Request for Help:  Can you point me to some information on Roman scourging?","post":"It was likely a mask to hide the gruesome death rictus from passers-by on the journey from the crucifixion site  to the tomb.  Note that it was “in a separate place”.  As David G says, it would have been removed from the face during the burial rite, so that other matters concerning the face, binding of lower jaw etc, could be attended to.\n\n","date":"August 12, 2014 at 4:09 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","id":"comment-143588","author":"daveb of wellington nz","site":"shroudstory"}]
