[{"title":"Revised: The Day the Shroud Foiled Hitler","post":"A detailed account of the Shroud’s move to Montevergine is given in http://www.bibliotecastataledimontevirgine.beniculturali.it (scroll down to “S” – La Santa Sindone Di Montevergine) but there is no mention of monks praying round the altar when the Germans arrived.\n\n","date":"August 8, 2014 at 6:21 am","url":"https://shroudstory.com/2014/08/08/from-shroud-encounter-the-day-the-shroud-foiled-hitler/","cat":"history","id":"comment-142949","author":"Hugh Farey","site":"shroudstory"},{"title":"Revised: The Day the Shroud Foiled Hitler","post":"There are two extraordinary “facts” or “miracles” about the Shroud (take your pick). 1. It exists at all and 2. It has survived to a time when science cold unlock its secrets.\nBlnd luck or providence?\n\n","date":"August 8, 2014 at 7:03 am","url":"https://shroudstory.com/2014/08/08/from-shroud-encounter-the-day-the-shroud-foiled-hitler/","cat":"history","id":"comment-142954","author":"John Klotz","site":"shroudstory"},{"title":"Revised: The Day the Shroud Foiled Hitler","post":"blnd = blind. Now back to proofing my 400+  page manuscript\n\n","date":"August 8, 2014 at 7:06 am","url":"https://shroudstory.com/2014/08/08/from-shroud-encounter-the-day-the-shroud-foiled-hitler/","cat":"history","id":"comment-142956","author":"John Klotz","site":"shroudstory"},{"title":"Revised: The Day the Shroud Foiled Hitler","post":"cold = could\n\n","date":"August 8, 2014 at 7:06 am","url":"https://shroudstory.com/2014/08/08/from-shroud-encounter-the-day-the-shroud-foiled-hitler/","cat":"history","id":"comment-142957","author":"John Klotz","site":"shroudstory"},{"title":"Revised: The Day the Shroud Foiled Hitler","post":"Under the address:\nhttp://www.dailymail.co.uk/news/article-1264150/Hitler-plot-steal-Turin-Shroud-thwarted-Vatican.html\nYou can read :\n>Adolf Hitler wanted to steal the Turin Shroud during World War II, an Italian monk has claimed. But the Vatican helped hide the cloth relic, on which is scorched the image of Christ’s face, in a rural monastery to keep it out of the clutches of the Fuhrer. … …\nThat wartime revelation emerged in an interview Father Andrea Cardin, librarian of the Montevergine abbey, gave in an issue of Italian magazine “Diva e Donna”…\n— —\nIt seems to me that we are dealing with speculations.\nSee also the stories about the German atomic bomb …\nLinks:\nhttp://en.wikipedia.org/wiki/Hitlers_Bombe\nhttp://en.wikipedia.org/wiki/German_nuclear_energy_project\n— — —\nTrying to get back to today’s reality then here is what I can see :\nIf I am right the AFM technique was discovered in 1988 (see: Binning, Quate,Gerber) …\nPerhaps the radiocarbon test was an attempt to divert attention\nfrom the truly decisive techniques…\nSo …\nWhat do you think about this particular vision of the facts?\n\n","date":"August 8, 2014 at 10:47 am","url":"https://shroudstory.com/2014/08/08/from-shroud-encounter-the-day-the-shroud-foiled-hitler/","cat":"history","id":"comment-142977","author":"piero","site":"shroudstory"},{"title":"Revised: The Day the Shroud Foiled Hitler","post":"Montevergine is a Benedictine Abbey. Benedictine monks knew about Yeshua’s (secret) Shroud as early as the 8th c. CE. It does show in the 8th-mid 13th c CE Christ Benedictine Iconography.\n\n","date":"August 8, 2014 at 11:18 am","url":"https://shroudstory.com/2014/08/08/from-shroud-encounter-the-day-the-shroud-foiled-hitler/","cat":"history","id":"comment-142981","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Revised: The Day the Shroud Foiled Hitler","post":"Here are the facts.  Hitler visited Italy in 1938, two months after he invaded Austria and obtained the “Spear of Destiny”.  One of the cities he visited was Turin.  His henchmen began asking questions about the King’s Sacred Relic.  After just stealing the Spear of Destiny from the Hoffburg Museum in Vienna, no wonder the King was concerned.  Hitler invaded Poland on Sept 1, 1939.  Within two weeks the Shroud was secretly removed from Turin and brought to Rome for 18 days and then moved to Montevergine about 150 miles south of Rome in the hills near Avellino.  Why was the Shroud moved?  Until 2010 it was thought to keep it safe from Allied bombs but Italy did not enter the war until June of 1940 after Hitler invaded France.  So the real reason must have been to keep away from Hitler as new documents indicate.  In April of 1943, the Nazis came looking for the Shroud in Turin only to find out it was moved to a secret location.  At this time a press release was issued by the Vatican and carried by the NY Times that the Shroud had been moved to a safe location.  This announcement no doubt came after the Nazis came looking for it.  Did they find out where it was taken?  In Sept of 1943, the Nazis stormed the monastery under cover of darkness claiming they were looking for Allied spies.  The Abbot ordered all the monks to gather in the choir chapel where the Shroud had been secretly encased inside the Altar.  None of the monks knew it was there.  The Nazis searched room by room and when they came to the Choir Chapel and saw the monks gathered in prayer, one of the officers said, “Don’t bother the monks, let them pray.”  And so the soldiers left not finding any spies nor the Shroud.  Were they specifically looking for the Shroud?  No one really knows.  That is the story.  In my presentation I document Hitler’s obsession with the occult, how he coveted the Spear of Longinus, how he and Himmler were both obsessed with finding the Holy Grail and also the Shroud.  Unlike all the art works stolen as documented in the recent movie, Monuments Men, Hitler’s desire for religious artifacts stemmed from his belief they would give him supernatural power in his bid for world domination.  One last thing, in his twisted mind he had convinced himself that Jesus was of an Arian bloodline and was not a Jew–hence his obsession with finding things related to Christ.\n\n","date":"August 8, 2014 at 12:04 pm","url":"https://shroudstory.com/2014/08/08/from-shroud-encounter-the-day-the-shroud-foiled-hitler/","cat":"history","id":"comment-142986","author":"Russ Breault","site":"shroudstory"},{"title":"Revised: The Day the Shroud Foiled Hitler","post":"“Hitler’s desire for religious artifacts stemmed from his belief they would give him supernatural power in his bid for world domination.” \nThat might well be the case, but it is not without precedent.  Constantine’s quest for holy relics may have been based on creating the impression among his subjects that his imperial authority had divine mandate.  But Constantine was also superstitious converting  crucifixion nails into talismans, one for his horse’s bridle and one for his helmet.  Another example is the long tradition in China where emperors could only survive so long as they had the “mandate of heaven”.   History has many examples of attempts to connect imperial authority with the divine will, and coronation ceremonies continue to occur in a religious environment, and in some cases even the inauguration of presidents. \nBut who can determine the mind of a psychopath?\n\n","date":"August 8, 2014 at 4:41 pm","url":"https://shroudstory.com/2014/08/08/from-shroud-encounter-the-day-the-shroud-foiled-hitler/","cat":"history","id":"comment-143017","author":"daveb of wellington nz","site":"shroudstory"}]
