[{"title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!","post":"Christ is risen from the dead! By death He trampled death! And to those in the tombs, He granted Life!-from the Byzantine Divine Liturgy of Pascha.\n\n","date":"April 20, 2014 at 11:27 am","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","id":"comment-101673","author":"Chesterbelloc","site":"shroudstory"},{"title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!","post":"President Bashar Assad of Syria may know next to nothing about the Turin Shroud, and sent his Easter greetings:\nhttp://www.dailystar.com.lb/News/Middle-East/2014/Apr-20/253928-assad-visits-recaptured-christian-town-state-tv.ashx#axzz2zSqNhUo5\n\n","date":"April 20, 2014 at 5:30 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","id":"comment-101752","author":"Louis","site":"shroudstory"},{"title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!","post":"Louis, how naive you are…\nGuess who is actually sponsoring those islamic terrorists? Who has the greatest interest in it? Who stays behind all this slaughter in Syria & Iraq?\n\n","date":"April 21, 2014 at 3:22 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","id":"comment-102041","author":"O.K.","site":"shroudstory"},{"title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!","post":"Hi O.K. You call me naïve? Is that because you are Catholic in Eastern Europe and aiming at Putin, a Russian Orthodox Christian?\nI am in direct and almost constant contact, sometimes personal, with Syrian (Arabic speaking) Christians, both clergy and laity. I have to because of my research into early Christianity. It began years ago when I was invited for coffee and an opportunity to meet and talk to the Iraqi prelate Mor Severios Jamil Hava, bishop of Baghdad, which was preceded by the usual two-hour mass celebrated in Aramaic.  \nI have come to learn what really is going on in Syria through them in the process, although politics does not interest me that much, but we live in this … world. Would you call Mor Cyril Aphrem Karim, recently elected the supreme head of the Syrian Orthodox Church a liar? Watch the video, then tell me:\n\nHe is Syrian-born and speaks English fairly well, having studied at Saint Patrick’s,Maynooth, Ireland, a Catholic institution.\nI don’t think Putin is a saint, on the contrary he seems to use his cunning KGB mind, but to blame him for what is going on in Syria…\nBest.\n\n","date":"April 21, 2014 at 4:00 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","id":"comment-102048","author":"Louis","site":"shroudstory"},{"title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!","post":"Easter Sunday:Archbishop Justin Welby, Primate of England, sent a message of hope to those suffering for their faith, talking about Resurrection and persecution.\n\n","date":"April 21, 2014 at 1:12 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","id":"comment-102010","author":"Louis","site":"shroudstory"},{"title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!","post":"The link is here:\nhttp://news.yahoo.com/anglican-leader-praises-persecuted-christians-easter-sermon-160310587.html\n\n","date":"April 21, 2014 at 1:12 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","id":"comment-102011","author":"Louis","site":"shroudstory"},{"title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!","post":"I just noticed Klingon is included in that list. :) \nOld Elvish is missing though.\n\n","date":"April 21, 2014 at 4:36 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","id":"comment-102059","author":"David Goulet","site":"shroudstory"},{"title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!","post":"Louis:\nHi O.K. You call me naïve? Is that because you are Catholic in Eastern Europe and aiming at Putin, a Russian Orthodox Christian?\nI am in direct and almost constant contact, sometimes personal, with Syrian (Arabic speaking) Christians, both clergy and laity. I have to because of my research into early Christianity. It began years ago when I was invited for coffee and an opportunity to meet and talk to the Iraqi prelate Mor Severios Jamil Hava, bishop of Baghdad, which was preceded by the usual two-hour mass celebrated in Aramaic.\nI have come to learn what really is going on in Syria through them in the process, although politics does not interest me that much, but we live in this … world. Would you call Mor Cyril Aphrem Karim, recently elected the supreme head of the Syrian Orthodox Church a liar? Watch the video, then tell me:\nNo, Louis. It is not because that I am Catholic and Putin is allegedly Orthodox (but in my opinion the only thing he believes in is his own power).\nThe thing that concerns me here is not Putin, but praising Bashar al Assad -the Corleone of the Middle East. BTW Putin is the same mafioso like Assad -just look what’s going on Ukraine -and the latter is kissing Putin’s &%$, because he knows the Russians saved his own. And the two bandits like each other due to similar character, but anyway.\nIt is absolutely no mystery to me that Assad stays behind the so called “Islamic State of Iraq and the Levant” (consisting mainly from ex-Saddam security officers -ruthless sexual deviants for which killing people gives pleasure -and brain-washed teenagers, cannon-fodder from all the islamic world, dreaming about easy acces to 70 virgins). Just from observing the course of the Iraq War. Just look at this action: http://en.wikipedia.org/wiki/2008_Abu_Kamal_raid\nThe whole terror campaing in Iraq had only one purpose, let the US be absorbed in that country, let they suffer casualties! Let the public opinion in the West turns against the further interventions!The Middle East regimes like Iran & Syria were aware, that after overthrowing Saddam, they are next in the line.\nThat’s why over 100 000 innocent Iraqis died. And when popular unrest against Assad regime started in Syria, what was the obvious move? To call their Iraqi friends and start similar wave of violence in Syria. And, of course, to portray themselves as the victims of Al-Qaeda brutality, instead of being their main sponsors. The classic false flag operation, aimed at preventing the US intervention. It is incredible how Western democracies can be so blind, and so easily deceived! Putin is currently doing the same on the Ukraine.\nBashar al Assad is responsible for 250 000+ innocent deaths in both Syria and Iraq. IMHO his place is together with Hussein, bin Laden and Gaddafi.\nSorry, but praising this mass murderer just makes me absolutely p^&*ed off!\n\n","date":"April 21, 2014 at 4:51 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","id":"comment-102062","author":"O.K.","site":"shroudstory"},{"title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!","post":"No, Elvish is there; it’s called Quenya.\n\n","date":"April 21, 2014 at 5:18 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","id":"comment-102070","author":"Hugh Farey","site":"shroudstory"},{"title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!","post":"O.K. Putin and Ukraine is one thing, Assad and Syria is another, Putin is ex-KGB, Assad is a doctor who studied in England while his wife studied in an Anglican school there. The democracy the West was expecting did not appear in the Middle East, what appeared was fundamentalism. Look what happened in Egypt and the people there were simply lucky to have Mursi overthrown and general Mohammed al Sissi take charge. His policy is to also protect the Copts, a recent sign of this being his visit to Patriarch Tawadros on Easter Sunday. The same sort of thing is happening in Syria. \nYou are badly mistaken, the anti- Assad King Abdullah of Jordan went to the Vatican to try to influence the Pope but had no success, the pontiff knew better. Whatever their defects, which were many, neither S. Hussein or Gaddafi were in favour of A/Q. B/L was of Saudi origin, he came from a country where not even a Christian chapel can be built, although they are the ones who finance the hundreds of mosques being built all over the world in “Christian” countries. \nHave you seen what Prince Charles and Prime Minister David Cameron said about protecting Christians recently? Are they badly informed? Have you seen the plight of Christians in Pakistan? Where was B/L found? The military there didn’t know anything about it? Why is Pakistan getting even more closer to Saudi Arabia?\nYou will see now why Patriarch Karim’s video interview makes sense.\n\n","date":"April 21, 2014 at 5:23 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","id":"comment-102071","author":"Louis","site":"shroudstory"},{"title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!","post":"It always seems to be a choice between two evils. After Saddam was overthrown, the aftermath in Iraq was worse than the disease. Getting rid of him was no solution, but has brought mayhem and destruction to Iraq.  The same situation is likely to occur in Iran.  Get rid of Assad will almost certainly result in radical Islamism taking control of whatever revolution follows, and Christian people and places of worship will certainly be targeted. Assad realises that the western powers will be aware of this, and it serves him as a counter-trump to continue his own atrocities.\n\n","date":"April 21, 2014 at 5:26 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","id":"comment-102072","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!","post":"Islam and democracy do not – and cannot – coexist.\nI imagine some lily-livered liberal will challenge my assertion.\n\n","date":"April 21, 2014 at 9:58 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","id":"comment-102157","author":"Thomas","site":"shroudstory"},{"title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!","post":"Partially correct, Daveb. I want to see someone introducing democracy in that part of the world, it only exists in Israel. So why blame Assad? He tried to get the opposition to talk, but they wouldn’t listen. Why? Because they are backed by al Nusra, A/Q and hundreds of fundamentalist, fanatical Chechen, Saudi Arabian, Iraqi mercenaries, financed by Saudi Arabian petrodollars. Do these people have mercy? They destroyed Maaloula, the ancient Christian city where Aramaic is still spoken, they kidnapped nuns, they kidnapped two bishops, who are not to be seen. Last week they shot an 80-year old Dutch Catholic priest in the head, he had refused to budge, trying to help his flock.\nThe mercenaries are backed by the atheist and playboy Hollande, of France, who is in league with the fundamentalist Erdogan in Turkey, one of those who supplies arms to the bloodthirsty fundamentalists. Western democracies have stopped being blind, their eyes have opened.\n\n","date":"April 21, 2014 at 5:50 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","id":"comment-102079","author":"Louis","site":"shroudstory"},{"title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!","post":"Guys, you don’t get it. \nAssad is a doctor who studied in England while his wife studied in an Anglican school there.\nYeah, yeah. And what does it mean -little in fact, except that Assad is much smarter  than many other dictators. But that’s clearly misleading. The Assad famiglia is classical model of mafia, ruling Syria for over 40 years. And Bashar is the current Godfather in elegant suit, even despite in fact his hands are up to elbows covered with blood. \nIt always seems to be a choice between two evils. After Saddam was overthrown, the aftermath in Iraq was worse than the disease. Getting rid of him was no solution, but has brought mayhem and destruction to Iraq. The same situation is likely to occur in Iran. Get rid of Assad will almost certainly result in radical Islamism taking control of whatever revolution follows, and Christian people and places of worship will certainly be targeted. Assad realises that the western powers will be aware of this, and it serves him as a counter-trump to continue his own atrocities.\nThat’s exactly what regimes like Assad’s or Iranian Ayatollahs want us, Westerners, to think. You need us in power, because the alternative is Al-Qaeda. \nSo why blame Assad? He tried to get the opposition to talk, but they wouldn’t listen.\nOnce again, don’t be naive Louis. The talks between opposition and Assad? The only language they know is crushing rebellion with tanks. They are gangsta, you know.\nWhy? Because they are backed by al Nusra, A/Q and hundreds of fundamentalist, fanatical Chechen, Saudi Arabian, Iraqi mercenaries, financed by Saudi Arabian petrodollars. \nYeah, yeah, by everyone except Assad. And that makes him suspect. looking at the course of the Iraq War from 2003 it was obvious that the greatest stream of men, money and material was going from Syria via the Anbar province. But for political reasons there was silence of this in the most media. It was far easier to blame the Bush administration (they committed several errors I admit, but world-wide anti-Bush hysteria at that time was something quite unprecedented in history).\nHave you seen what Prince Charles and Prime Minister David Cameron said about protecting Christians recently? Are they badly informed? Have you seen the plight of Christians in Pakistan? Where was B/L found? The military there didn’t know anything about it? Why is Pakistan getting even more closer to Saudi Arabia?\nNo, Louis, I haven’t. And that’s the problem, that West has fallen into powerlessness and decadence. This is the same reason why Putin is doing in the Ukraine whatever he wants -he knows that West is degenerated and cowardly. The LGBT privileges are often far more important than fundamentals of the Western civilization.\nThe terrorism in Iraq could have been easily suppressed (by brutal force -it was the only way), had not foolish pressure on “political solution”, “national reconciliation” and similar nonsense babble. Which resulted in mulitple amnesties -once captured the Saddamists terrorists were being released from captivity, as a “good will” gesture (or rather incredible stupidity) -which resulted in more and more innocent victims.\nHere you have example:\n02 Dec 2010\nSource: reuters // Reuters\n* Iraq says 39 al Qaeda suspects arrested\n* Third-highest leader in Iraq among those captured\n* Raids produce identities, photos of top two Qaeda leaders\nBy Muhanad Mohammed\nBAGHDAD, Dec 2 (Reuters) – Iraq said on Thursday its security forces had arrested 39 al Qaeda militants, including the group’s leadership in Anbar province and one of its top officers in Iraq, in raids over the last five weeks.\nThe group carried out car bombings and attacks against police in Anbar, a former al Qaeda stronghold; recruited and equipped suicide bombers from abroad and plotted attacks on government ministries, Interior Minister Jawad al-Bolani told a news conference.\nThe raids also gave security forces the real names, and photographs, of al Qaeda’s two top leaders in Iraq, officials said.\n“The repeated and painful blows to al Qaeda, by the killing and arrests of its leadership, will lead to the demise of al Qaeda in Iraq,” Bolani said at a news conference in Baghdad.\nBolani identified one of the captured men, Hazim al-Zawi, as al Qaeda’s third-highest leader in Iraq and the “security minister” of its local affiliate, the Islamic State of Iraq.\nThirty-eight of the men, wearing orange prison uniforms, were led into the news conference. Zawi was brought into the room wearing a black hood, which was pulled off to allow photographers and TV cameramen to take pictures of his face.\nIraqi and U.S. forces struck a major blow against the Islamist militant group in April when al Qaeda in Iraq leader Abu Ayyub al-Masri, and Abu Omar al-Baghdadi, the head of ISI, were killed in a raid.\nMilitary officials said the deaths were a serious setback to a stubborn insurgency that still unleashes attacks daily, more than seven years after the U.S.-led invasion that ousted Saddam Hussein.\nAmong those arrested, officials said, was Ibrahim al-Zobai, al Qaeda’s “deputy war minister,” who had been in charge of bringing Arab suicide bombers into Iraq since 2004.\nSecurity forces also captured Ahmed al-Essawi, a religious adviser in ISI, Ali al-Fahdawi, an ISI administrator and Abdul Razaq Albu Essa, the group’s head of media, authorities said.\nGeneral Dhiya Hussein, the head of the Interior Ministry’s counter-terrorism department, said the raids enabled security forces to obtain pictures and learn the real names of al Qaeda’s two top leaders, the men who replaced Masri and Baghdadi.\n“The successful arrest operation connected us to the head of the terrorist organization, Ibrahim Awad al-Samarrai, who was known as Abu Baker al-Baghdadi, and his war minister, Nuaman Salman, who was known as Abu Suleiman before,” Hussein said.\nMany of those arrested were held in U.S. custody at one time but were released as a result of political deals and had gone back to the insurgency, Bolani said.\n“We call on the politicians not to repeat the past mistakes. Don’t let the criminals escape from punishment,” he said.\nLast week Iraqi officials announced the arrests of 12 suspected al Qaeda militants in connection with an Oct. 31 attack on a Baghdad Christian church in which 52 hostages and police were killed. (Editing by Jim Loney and Philippa Fletcher) \n(emphasis mine).\n\n","date":"April 21, 2014 at 6:28 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","id":"comment-102093","author":"O.K.","site":"shroudstory"},{"title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!","post":"O.K., there is much to agree with you, after all it is a world of politics, isn’t it? That is why we are also involved in Shroud studies, to judge whether the relic wrapped the dead body of the Man who said, “My kingdom is not of this world.”\nYour end is of course very different from the place where much blood is being shed, and, one day, when there is peace in the region, you may be able to go there, and then you will understand more deeply what I am saying.\nTake it easy, It doesn’t seem that the West is inclined to let Putin have his way. Hitler began that way.\n\n","date":"April 21, 2014 at 6:46 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","id":"comment-102098","author":"Louis","site":"shroudstory"},{"title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!","post":"O.K., there is much to agree with you, after all it is a world of politics, isn’t it? That is why we are also involved in Shroud studies, to judge whether the relic wrapped the dead body of the Man who said, “My kingdom is not of this world.”\nAmen.\n\n","date":"April 21, 2014 at 6:58 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","id":"comment-102102","author":"O.K.","site":"shroudstory"},{"title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!","post":"O.K. You got the point, but since we are still in this somewhat illusory world of material things, we must be aware about the ancient but suffering communities, struggling to survive. One of the following videos shows one of these communities (also in Assad’s Syria) who seem to be singing in Moscow (Putin’s territory)!\nhttp://www.mashpedia.com/Assyrian_Church_of_the_East\n\n","date":"April 21, 2014 at 7:13 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","id":"comment-102106","author":"Louis","site":"shroudstory"},{"title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!","post":"Following the downfall of Hitler at the end of WWII, Roosevelt and other western leaders, saw to it that there was an aggressive peace initiative to train the German people in concepts of democracy and tolerance and wean them away from their ingrained ideas of fascism, nazism and the concept of Fuhrer or one single Nietzschean oberman leader. A similar peace initiative occurred in Japan. Eastern Germany fell under the Soviet sphere of influence and so it took longer there until the Eastern Berliners saw the successful outcome in their western zone and the Wall fell. Today both Germany and Japan are at least virtual if not de facto democracies enjoying high standards of living and relative freedom.  Likewise in South Korea.  No such follow-up was ever taken in Iraq, nor Afghanistan, and the result is that terror, and corruption survive and reign. There is too much reliance on the military machine, and nothing is really done on assaulting the peace front.\n\n","date":"April 21, 2014 at 10:17 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","id":"comment-102159","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!","post":"Amen to our risen Savior and Lord!  Personally, I’m looking forward to the day He puts down all earthly authority and commences a’reignin’!   ;)\n\n","date":"April 22, 2014 at 1:12 am","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","id":"comment-102195","author":"Sheila","site":"shroudstory"},{"title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!","post":"The influence was exercised by the three “greats”: Konrad Adenauer (Germany), Robert Schuman (France) and Alcide de Gasperi (Italy), all of them staunch Catholics, but times were different then.\nHirohito was obliged to sign a document renouncing the bit of “divinity” that was claimed, a royal prerogative.\nWhat we see here are cultural differences and that is why there is no change in Iraq and Afghanistan.\n\n","date":"April 22, 2014 at 1:25 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","id":"comment-102420","author":"Louis","site":"shroudstory"}]
