[{"title":"Shroudie-Alert: Day1.Chief topic: the Lirey Pilgrim’s Badge and that enigmatic chain…","post":"I now have similar inhibitions about leaving any comment on The Other Site, Hugh, being fearful of the ‘epicyclic tendency’ that exists over there, and its intolerance for those who view the TS as a clever and intriguing medieval artefact (until presented with convincing evidence to the contrary).\nIn fact I was on the point of alerting Matthias over there (a kindred spirit where free enquiry is concerned) to my belief that it is not only Ian Wilson’s “blood belt” across the small of the back that started out as an imprint from a chain, but the frontal “spear wound blood stain” too. (See my 17:37 entry above).  I’m confident  Matthias would reflect on that heretical idea before rushing to judgement, but doubt whether the same could be said for most of the others, who will almost certainly reach straight for the Thesaurus and bottle of green ink before calling me all the names under the sun.\n","date":"February 20, 2013 at 7:06 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/19/shroudie-alert-day1/","cat":"medieval_forgery","id":"comment-1855","author":"colinsberry","site":"colinberry"},{"title":"Shroudie-Alert: Day1.Chief topic: the Lirey Pilgrim’s Badge and that enigmatic chain…","post":"Until Jones’s comments on bloodstains appeared on Shroudstory, I was reluctant to comment on them in general as I don’t have access to a lot of blood with which to play on cloth. I have hopes of roadkill as the spring warms up! The fact is I don’t know what the difference would be between the appearance of a bloodstain painted onto an image of a hand, and a bloodstain formed by a wound in that hand. Would the edge of a hole in a body leave a distinctive mark on cloth? I just don’t know.\nI won’t, of course, post any comments on Jones’s own site as we are working from such different premises that the reconciliation of our ideas is impossible. He believes it is axiomatic that the shroud is the burial cloth of his risen Lord, a view I entirely respect, and that therefore any supposed objections are by definition false and must have a different explanation. I am reminded of the Geocentric model of the universe, every objection to which, being by definition false, had to be explained by more and more convoluted epicycles. I cannot say how likely Jones’s model is to suffer a similar fate, but, not accepting his axioms, contra principia negantem non est disputandum, as Aristotle may have said. Except he probably said it in Greek…\n","date":"February 19, 2013 at 8:42 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/19/shroudie-alert-day1/","cat":"medieval_forgery","id":"comment-1853","author":"Hugh Farey","site":"colinberry"},{"title":"Shroudie-Alert: Day1.Chief topic: the Lirey Pilgrim’s Badge and that enigmatic chain…","post":"Hello again Hugh. Thanks, you’ve ended my lengthy Comments famine. I’ve been following your comments Over There with interest, especially today on that so-called “pooled” blood in the small of the back.  Sterling work that man…\nI knew I could rely on you to know the provenance of that image.  It explains puzzling references I’ve seen to there being more blood on the face – the beard etc – than is commonly supposed. If you’re correct, and I see no reason to think otherwise, there’s been too much tinkering with the evidence. \nAre you going to point out Jones’s poor choice of picture – at source? Alas, I cannot, for reasons I shan’t go into.\nI’d be interested to hear your view on Jones’s references to “wounds” and “bloodstains” as if separate entities. Do you know of any wound on the Shroud that has its own distinctive morphology, not merely ‘presumed’ to be out of sight under a bloodstain?\n","date":"February 19, 2013 at 10:50 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/19/shroudie-alert-day1/","cat":"medieval_forgery","id":"comment-1850","author":"colinsberry","site":"colinberry"},{"title":"Shroudie-Alert: Day1.Chief topic: the Lirey Pilgrim’s Badge and that enigmatic chain…","post":"Just checking in, so you know I’m still here. I’ve posted quite extensively on shroudstory.com about some of the things wrong with the Colorado paper, and just recently some of the problems with the bloodstains so glibly accepted by Stephen E Jones et al. His illustrative picture, I think, began life as an ordinary black and white Enrie negative, not a UV photo at all. It has been manipulated into ‘brightness contours,’ and the lightest ones have been coloured red. They could have been green or blue – indeed a wide variety have been published – but Jones chose this one. The bloodstains being the darkest parts of the shroud, they naturally coincide with the brightest contours, but the colour is entirely coincidental.\n","date":"February 19, 2013 at 10:34 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/19/shroudie-alert-day1/","cat":"medieval_forgery","id":"comment-1849","author":"Hugh Farey","site":"colinberry"}]
