[{"title":"An Early Christmas Present from John Klotz","post":"Marvelous.  Thanks John!\n\n","date":"December 4, 2012 at 9:32 pm","url":"https://shroudstory.com/2012/12/04/an-early-christmas-present-from-john-klotz/","cat":"history","id":"comment-19843","author":"Andy Weiss","site":"shroudstory"},{"title":"An Early Christmas Present from John Klotz","post":"I don’t know why but during my reading of this extraordinary paper written by Father Rinaldi, I often had the impression of reading my own comments that I wrote on this blog.  This is a precious historical document that I will keep with great care.\nAfter reading this paper, I can honestly say that I had a allied in M. Rinaldi in my crusade against any form of supernatural madness concerning the Shroud.  There are too many good things to quote in this paper but I just want you to noticed this one : “The Holy Shroud tells the story of the Passion and death of Christ.”  Sounds familiar to some of you ?  This is exactly what I was crying out loud here on this blog for more than a year now !!!!  The Shroud is showing a dead Christ, not a risen one !!!!  This is an archaeological remains of his Passion and death (and by implication of faith, of God’s Incarnation in our material world) much more than anything else but unfortunatelly, since the failure of STURP to determined what exactly has caused the image and even more since the C14 medieval result and soon after, the publication of Jackson’s wild hypothesis, I have a feeling that things went out of control in the Shroud world and the supernatural freaks became more and more present at that point, which had a disastrous effect on the general credibility of Shroud science in the eyes of the general public, the media and also the scientific community.  Now, everytime the Shroud goes on TV or radio, it seems to me that there’s always some bad supernatural links that are made with this piece of cloth, which drives me nuts. \nWhen you read the very intelligent and balanced paper of M. Rinaldi, you don’t have this supernatural crazy feeling that we encountered these days each time the Shroud is mentioned publicly…  I think this is a very good sign of what’s going wrong in the Shroud world these days.\nI also greatly appreciate the quote from doctor Barnes who said that since the image on the Shroud comes from a biological interraction between a tortured and crucified body and the cloth (again, this sounds familiar no?), it is almost impossible to reproduced in a lab all the environmental and biological conditions that prevailed at the time of Jesus burial and so, it will most probably be impossible for anyone now or in the future to fully reproduced the body image on a linen cloth with all the same chemical and physical characteristics than we see on the Shroud of Turin.  I AGREE TOTALLY.  How can someone be lucky enough to reproduced all those conditions while there is no such tortures these days and there’s almost no precise description of the physical conditions that prevailed when Jesus died and was buried ?\n\n","date":"December 5, 2012 at 4:52 pm","url":"https://shroudstory.com/2012/12/04/an-early-christmas-present-from-john-klotz/","cat":"history","id":"comment-19881","author":"Yannick Clément","site":"shroudstory"},{"title":"An Early Christmas Present from John Klotz","post":"An addition to my previous comment :  I said at the end: How can someone be lucky enough to reproduced all those conditions while there is no such tortures these days and there’s almost no precise description of the physical conditions that prevailed when Jesus died and was buried ?\nI want to add this :  And I don’t even talk about the precise nature of the linen cloth itself which has not been fully characterized yet, even though we’re pretty sure that it bears a thin layer of impurities on both sides.  But even if this idea is supported by some solid facts and observations, it still need to get fully confirmed.  As I often said :  the more important thing that Shroud scientists need to fully characterize right now is the image chromophore and this won’t come until the linen cloth itself will be fully characterized, which will need another series of direct researches on the Shroud in the future.\nAnd as I often said too :  once we’ll be sure that the chromophore is a thin layer of impurities and the linen fibers themselves were not affected by the image formation process, then we’ll have a very strong indication that this body image is the product of a natural process that originated most probably from some biological substances released by the corpse.  No doubt that, so far, this is the most probable hypothesis because when we take into account all the facts and observations available, this is the most simple and rational.\n\n","date":"December 5, 2012 at 5:46 pm","url":"https://shroudstory.com/2012/12/04/an-early-christmas-present-from-john-klotz/","cat":"history","id":"comment-19884","author":"Yannick Clément","site":"shroudstory"},{"title":"An Early Christmas Present from John Klotz","post":"I will agree that Rinaldi’s document is certainly valuable, and I have the PDF saved in my TS folder.  Rinaldi evidently had the good sense to avoid the wrong kind of sensationalism by avoiding a direct reference to the miraculous, but in 1933, even his attempts at a scientific or naturalistic explanation had to remain essentilally speculative in the absence of any kind of rigorous experimental evidence.  Some 80 years later we are still at the point of debating pretty well the same issues, with little further concrete evidence and only a small advance in our knowledge.   \nThere is more than one way we can conceive of the image being miraculous, and it does not necessarily imply the suspension of the laws of nature.  In YC’s final paragraph above, he refers: “It is almost impossible to reproduce in a lab all the environmental and biological conditions that prevailed at the time of Jesus burial and so, it will most probably be impossible for anyone now or in the future to fully reproduce the body image on a linen cloth with all the same chemical and physical characteristics than we see on the Shroud of Turin.” \nBut perhaps it is precisely in the specific conditions of the burial and conditions of the tomb, the 30 hours during which the body was wrapped enabling the image to optimise, the various other conditions, the fact that it only ever happened in the case of Jesus the Saviour of the world, and no-one else, wherein the nature of miracle might be found.  Even the Jospice mattress was an imperfect and unsatisfactory image, but in the case of Jesus, the conditions were apparently just right.  Why was it just right, in this unique specific case?  That is surely where the miracle can be found.  The hand of God is surely evident, perhaps not in the interventionist way that we might ordinarily think of an event being being miraculous, but in the specific conditions that prevailed.  But I still wouldn’t rule it out completely!\n\n","date":"December 5, 2012 at 6:23 pm","url":"https://shroudstory.com/2012/12/04/an-early-christmas-present-from-john-klotz/","cat":"history","id":"comment-19885","author":"daveb of wellington nz","site":"shroudstory"},{"title":"An Early Christmas Present from John Klotz","post":"What is important to note is that back in the 1930s, the vast majority of the honest scientists and Clergymen who thought the Shroud was genuine NEVER seriously thought for one second that the image on it could have been caused directly by the Resurrection !  It’s only after the STURP investigation and as I said, after the fiasco of the C14 dating, that all this supernatural crazyness non sense about the Shroud really started !  That’s precisely when Shroud science started to lose any credibility whatsoever in the eyes of the international scientific community and that’s a SHAME.\nNote that the vast majority of the conclusions of the scientists who studied the Shroud before the Second World War where scientifically CONFIRMED later on by STURP and that strongly suggest that their main idea about the image formation (i.e. that it was caused by a natural interraction between the cloth and the crucified corpse) is mosty probably correct, even though it’s almost impossible to described the right process completely since we don’t have crucifixions no more and we don’t know most of the data concerning the environmental and biological conditions that were present in the tomb and in the Shroud.  \nNote that no coloration substances from another dimension has been found by STURP and all their data certainly don’t go against the idea that the image was formed naturally by a real biological and chemical interraction between the cloth and the body.  That’s the most important thing to remember.\n\n","date":"December 6, 2012 at 11:48 am","url":"https://shroudstory.com/2012/12/04/an-early-christmas-present-from-john-klotz/","cat":"history","id":"comment-19923","author":"Yannick Clément","site":"shroudstory"},{"title":"An Early Christmas Present from John Klotz","post":"Yannick, I should like you to read my last paragraph above very carefully.  I think the hand of God is clearly evident, perhaps not in the interventionist way that we might usually think of a miracle, but in the specific conditions that allowed the image to form, in this particular case.  To date we have not been able to simulate those conditions.  But they were evidently present in this case.  Why in this particular case??\n\n","date":"December 6, 2012 at 3:38 pm","url":"https://shroudstory.com/2012/12/04/an-early-christmas-present-from-john-klotz/","cat":"history","id":"comment-19934","author":"daveb of wellington nz","site":"shroudstory"},{"title":"An Early Christmas Present from John Klotz","post":"Dave, I have already stated many times on this blog that it is truly possible that God could have waited until the best possible time after the death of Jesus before making the body disappeared from this world (dematerialization or spiritualization), so that the natural process at work could be stopped at the very best time so it could left the best possible imprint on the Shroud. This idea is totally acceptable from my point of view of believer and it was very pleasing for me to note that M. Rinaldi expressed the same opinion as mine in the very last paragraph of his awesome paper:\n“Does the theory of contact exclude the supernatural factor? When we think of the unusual process that has caused the images on the Shroud and consider all the circumstances that were necessary for their production, we cannot but admire the PROVIDENCE of God Who was pleased to leave to the Church and to the world the material document of the Passion and Death of Christ.”\nAnd both my opinion and the one expressed by Father Rinaldi are very close to the one you just expressed…  So, I think we can agree on that.\nAnd also, please let’s not forget the potential sign of the dematerialization or spiritualization of Jesus body that God left to us in the undisturbed aspect of all the bloodstains on the cloth…  And finally, I think everyone MUST understand that the simple FACT that such a gruesome grave cloth covered with numerous bloodstains (representing all the stigmata of Christ) has been kept and well-preserved as to be seen as the MOST IMPORTANT SIGN (not proof!) of Jesus Resurrection…\nNow Dave, I ask you the question : don’t you think all that is well enough to comfort your own faith as well as mine ?\n\n","date":"December 6, 2012 at 4:40 pm","url":"https://shroudstory.com/2012/12/04/an-early-christmas-present-from-john-klotz/","cat":"history","id":"comment-19939","author":"Yannick Clément","site":"shroudstory"},{"title":"An Early Christmas Present from John Klotz","post":"Thank you for this article.\n\nThe scientist, however, believes himself to have reached a very definite conclusion as to the origin of the Shroud’s images. Whatever providential guiding there may have been, their origin, he holds, was natural.","date":"December 8, 2012 at 7:20 am","url":"https://shroudstory.com/2012/12/04/an-early-christmas-present-from-john-klotz/","cat":"history","id":"comment-20028","author":"anoxie","site":"shroudstory"},{"title":"An Early Christmas Present from John Klotz","post":"Fr Rinaldi’s article is of an exceptionally high standard for a person not trained in science (as far as I’m aware).  He was in a particularly privileged position in being able to discuss forensic issues with those first pioneers and with Guiseppe Enrie.  I am given to understand that the article had a remarkable awakening of interest in the Shroud, particularly in USA.  \nI have searched the article very carefully but have not been able to discover the specific quote given in Anoxie’s comment.  It may be a reasonable inference she has made from her own reading of the article.  Evidently Vignon felt he could come to some conclusions about the image formation process with the experiments he conducted with ammoniacal vapours and aloes.  The article certainly does not say that he was successful in obtaining an image of any specific object comparable to that on the Shroud.  He obtained some colorations.  Rogers was able to make some advances on this subsequently, with the advantages of his more advanced chemistry knowledge.   \nHowever some 105 years after DeLage’s presentation at the Sorbonne, and some 80 years after the 1933 exposition and Rinaldi’s article we still have not reached a definite conclusion on the image process supported by any kind of conclusive experiments at all.  Compare this lack of progress with other advances in science during the same period.  Giovanna de Liso has had rather more success with her seismic experiments in obtaining images, which may have depended on the release of radon gas.  \nAfter all this time with the lack of any kind of definite conclusion on a naturalistic process, except various untested theories, I’m prepared to believe that there was a great deal more Providence involved in the process than even Fr Rinaldi was prepared to concede!  For his time, he quite properly adopted a conservative viewpoint.  But we still do not have a definite conclusion!  Naturalistic?  Only perhaps!\n\n","date":"December 9, 2012 at 6:41 am","url":"https://shroudstory.com/2012/12/04/an-early-christmas-present-from-john-klotz/","cat":"history","id":"comment-20085","author":"daveb of wellington nz","site":"shroudstory"},{"title":"An Early Christmas Present from John Klotz","post":"This is an actual quote from Rev. Rinaldi’s article.\nThe scientist seems to be Yve Delage. Marcelin Berthelot, a great chemist and physicist, didn’t want Pr Delage’s article to be published. Since he was a militant atheist, I don’t know wether he thought Pr Delage was wrong or that such an article should not be published in ‘Les Comptes rendus de l’Academie des Sciences’.\n\n","date":"December 9, 2012 at 10:08 am","url":"https://shroudstory.com/2012/12/04/an-early-christmas-present-from-john-klotz/","cat":"history","id":"comment-20094","author":"anoxie","site":"shroudstory"},{"title":"An Early Christmas Present from John Klotz","post":"In the most likely hypothesis, the Turin Sindon image is Yeshua’s, the Sindon image formation process is both providential AND naturalistic/ritualistic as Yeshua’s buriers  followed a Second Temple period JUDEAN BURIAL RITUAL (see John 19:40 and my reconstruction).\n\n","date":"December 9, 2012 at 9:49 am","url":"https://shroudstory.com/2012/12/04/an-early-christmas-present-from-john-klotz/","cat":"history","id":"comment-20092","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Early Christmas Present from John Klotz","post":"What kind of examination of the shroud was made in 1933, and is there a formal record of it? Rinaldi quotes Dr Arthur S. Barnes: “The threads themselves are stained more or less throughout, so that the same figures, fainter in coloring but otherwise identical, appear on the other side.” How did he know? There is also mention of a “microscopic examination.” This is news to me, and I wonder what other discoveries were made at the same time.\n\n","date":"December 9, 2012 at 10:50 am","url":"https://shroudstory.com/2012/12/04/an-early-christmas-present-from-john-klotz/","cat":"history","id":"comment-20097","author":"Hugh Farey","site":"shroudstory"},{"title":"An Early Christmas Present from John Klotz","post":"Very good question Hugh!  I asked myself the same question.  I will give you 2 quotes from Rinaldi’s paper and try to comment them:\nQuote: “…in the case of the Shroud, every thread is visible, and no trace of solid extraneous matter can be detected, even by microscopic examination.”\nComment: I really don’t know what M. Rinaldi is talking about here! I, like most of us I guess, was truly convinced that the first microscopic examination of the Shroud occurred in 1973 with a scientific team of Italians and again (and much more deeply) in 1978 with STURP and another scientific team of Italians. So, if someone has more information about that, please let me know!  I know that during the 1933 exhibition in Turin, there was a scientific forum held in the city and Shroud experts like Barbet and Vignon where among the participants, but I really don’t think any scientist had the chance back then to examine the Shroud (or even samples from the Shroud) up close and personal with a microscope! And concerning the conclusion of Father Rinaldi that “no trace of solid extraneous matter can be detected”, this is only partially true. In fact, this statement is correct concerning the fact that no extraneous matter composed the body image but it is incorrect concerning the fact that there was numerous tiny extraneous particles of many products that were found by STURP and Riggi di Numana in the samples they collected from the Shroud, like for example, some tiny paint particles, some aragonite dirt, many pollen grains, etc, etc.\nQuote: “The threads themselves are stained more or less throughout, so that the same figures, fainter in coloring but otherwise identical, appear on the other side.”\nComment: This statement is completely false, except maybe for the possible presence of a very faint image (probably very superficial like the main image) of the hair, beard and mustache of the Shroud man on the reverse side of the cloth and even these possible images are still waiting to be confirmed. I really don’t know who gave this information to Father Rinaldi back then but one thing’s for sure: This information was wrong.  And I don’t even know how someone back then could have know if there was or not a body image on the reverse side of the fabric since the Holland cloth was firmly in place and I don’t think no one could have access to even a little portion of the reverse side before Riggi di Numana and the STURP team in 1978.\n\n","date":"December 12, 2012 at 11:54 am","url":"https://shroudstory.com/2012/12/04/an-early-christmas-present-from-john-klotz/","cat":"history","id":"comment-20285","author":"Yannick Clément","site":"shroudstory"}]
