[{"title":"Stephen Jones’ Critique of Charles Freeman Continues and Continues and Continues","post":"Dan\nThanks for the plugs. But you might want to correct the typo  “Jone’s” in this post’s heading.\nAnd thanks also for your wonderful graphics that I often post and link to. I’m glad that you allow such `piracy’. You might quote to Colin Berry that HE is the one potentially breaking the law by demanding that you delete your posting of extracts from his blog, “without [him] determining whether that posting reflected `fair use’ of the copyrighted material”:\n“In August 2008 US District Judge Jeremy Fogel of San Jose, California ruled that copyright holders cannot order a deletion of an online file without determining whether that posting reflected `fair use’ of the copyrighted material. …” (“Fair use: Fair use on the Internet,” Wikipedia, 15 May 2012)\nRegards.\nStephen E. Jones\n\n","date":"September 12, 2012 at 11:16 am","url":"https://shroudstory.com/2012/09/12/stephen-jones-critique-of-charles-freeman-continues-and-continues-and-continues/","cat":"history","id":"comment-16190","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Stephen Jones’ Critique of Charles Freeman Continues and Continues and Continues","post":"“if the Shroud of Turin is doubled FOUR TIMES keeping Jesus’ face image uppermost,”?! \nSorry  Dan, I just cannot see your/Wilson’s FOUR successive foldings, only THREE in the illustration!  This might well be no very good archeaoLOGICAL illustration to back up his point!\n\n","date":"September 12, 2012 at 11:45 am","url":"https://shroudstory.com/2012/09/12/stephen-jones-critique-of-charles-freeman-continues-and-continues-and-continues/","cat":"history","id":"comment-16195","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Critique of Charles Freeman Continues and Continues and Continues","post":"Or is it a pareidolia?\n\n","date":"September 12, 2012 at 11:46 am","url":"https://shroudstory.com/2012/09/12/stephen-jones-critique-of-charles-freeman-continues-and-continues-and-continues/","cat":"history","id":"comment-16196","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Critique of Charles Freeman Continues and Continues and Continues","post":"It IS doubled four times, although not the way Dan shows it in his Tetradiplon graphic. I remembered that there was something wrong with Dan’s Tetradiplon graphic but I forgot what it was. \nI have a cut-out copy of the Shroud in my hands. First doubling is between the two head images into one half. Second doubling of the top visible 1/4 concertina style behind the head image. Third doubling is the visible 1/3 also concertina style behind the head image. Fourth doubling is the visible 1/2 concertina style behind the head image. \nLooked from the side, which may be how the Edessans saw it, there are four folds doubled. Which is no doubt where tetradiplon four-doubled” came from. \nIt is hard to describe this, especially as I need to get ready for work, but do it and you will see it works. I will make my own graphic and post it to my blog in place of Dan’s.\n\n","date":"September 12, 2012 at 6:33 pm","url":"https://shroudstory.com/2012/09/12/stephen-jones-critique-of-charles-freeman-continues-and-continues-and-continues/","cat":"history","id":"comment-16205","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Stephen Jones’ Critique of Charles Freeman Continues and Continues and Continues","post":"Dan posted URL to a video by John Jackson a month or two back, demo by Jackson purporting to show folds under raking light.  There was considerable comment on the posting, some remaining unconvinced by Jackson’s demo.  Yannick Clement of course had quite a lot of sceptical comment about it, as he doesn’t accept Mandylion theory.  From memory there was a clear fold mark across the cloth at one-eighth of length from centre, which I thought significant.  Other folds might have been more in the “I think I see” category.\nUnder raking light, the impression is complicated by wrinkles caused by rolling up with the backing cloth.   Criteria for a valid fold mark are: it must be clearly visible as a fold mark; it needs to be straight and extend the full width of the cloth at right angles to it; it must be periodic; it must occur at a one-eighth point.  If it’s still there, URL is:\nhttp://videola.co.uk/foldmarks/turin-shroud-fold-marks-john-jackson.html\n\n","date":"September 12, 2012 at 10:13 pm","url":"https://shroudstory.com/2012/09/12/stephen-jones-critique-of-charles-freeman-continues-and-continues-and-continues/","cat":"history","id":"comment-16209","author":"daveb of wellington nz","site":"shroudstory"}]
