[{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"Sorry to be a spoilsport, but as usual Stephen E. Jones relies rather too strongly on secondary sources which don’t always match up to primary evidence.\n1) “When examined under a microscope, each scourge mark reveals a slightly depressed center and raised edges.” Not to me it doesn’t. The excellent Shroud Scope is available to everybody, and the Shroud app to those with an iPad, and I simply can’t find any “depressed centres” or “raised edges.” Can anybody else?\n2) “Under ultraviolet light each scourge mark can be seen to have a “halo” of lighter colour surrounding it.” The only UV photos I have are from Miller and Pellicori’s paper, but their photos blow up very well. The whole of the back of the image shows general background fluorescence, and the scourge images do not show any particular extra brightness around them. Does anyone find that there are?\n3) “These halos were chemically tested and found to be blood serum which is left behind after a blood clot forms.” Really? Who by?\n4) “This is further evidence that the Shroud could not have been created by an artist in the Middle Ages because that knowledge about blood clot structure, let alone a microscope and an ultraviolet light source to see them, did not then exist for many centuries into the future.” Dripping blood onto a cloth does not require any knowledge at all. Children with nosebleeds do it all time.\n5) “Each one of the over 100 scourge wounds on the Shroud matches exactly what would have been caused by a type of Roman flagrum buried in the eruption of Mt. Vesuvius in AD 79.” I cannot find any evidence at all that the reconstructions of Roman flagra, of which there are two main modern versions and several interpretations from the 19th century, are based on any archaeological artefacts. Has anyone seen any? Rich’s “Dictionary of Greek and Roman Antiquities” (1874) has an illustration “copied from an original found in Herculaneum” which appears to be made entirely of metal and looks nothing at all like more modern versions. Where is it now? The words “flagrum”  and “plumbatum” bring up nothing in the Archeological Museum of Naples or British Museum websites. In the absence of anything to compare them with, it cannot be said that any of the marks on the shroud “matches exactly” any original flagrum.\n6) “So a fourteenth century or earlier forger would have had to possess a faultless archaeological knowledge of a first century Roman scourging with a flagrum.” As it happens, the flagrum held by one of the scourgers in the 14th century Buoninsegna painting in Jones’s article is an almost exact copy of his reconstruction of a flagrum just above it, only with four thongs instead of three. Faultless archeological knowledge.\n7) “But the scourge-marks on the Shroud are depicted with a realism that is unknown to the art of any period.” For “realistic” scourge wounds, try “Philippines” “flagellation” on Google images. The marks on the shroud bear no comparison.\n\n","date":"July 15, 2013 at 7:30 am","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39013","author":"Hugh Farey","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"Point 7) You’ve mentioned the Philippines scourge comparison before and I’ve taken a look at the images. They are very different than the Shroud, but did you notice that the majority of flagellation practitioners there use some kind of palm frond? A completely different tool will produce a different result, no? Many of them self-flagellate and this will obviously create a different wound than one imposed by someone else. After doing a broader search on Google on flagellation I find a myriad of methods and wound results. Some do look like the Shroud pattern.\nPoint 4) Do you have scientific evidence that the blood on the Shroud was ‘dripped” onto it? As opposed to dabbed or seeped? I’m assuming pathologists are familiar with the difference in blood-made images, has someone spoken to this – one way or another?\nPoint 6) Even if a forger was aware of Roman flagrum designs, was he also creative enough to make the scourge marks asymmetrical so future admirers of the Shroud could deduce that the victim was scourged by two men, one taller than the other? Or do you contest that observation as well (you didn’t mention it but I’ll assume a ‘yes’).\n\n","date":"July 15, 2013 at 8:52 am","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39017","author":"David Goulet","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"scourge marks on the Shroud in no way can even be compared to “dripping nosebleed of children” as the marks where left by a dead body not alive person – that’s for one.\nsecond, I have already told this and will repeat forever – why the heck is anybody comparing WHOLE blood bleeding while ALIVE with marks from clots/blood material of a dead body?\nthis is apples and oranges – you can not equate the two.\nHugh, I thought you are a physician, BTW.\n\n","date":"July 15, 2013 at 4:01 pm","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39032","author":"jesterof","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"Hi Jesterof. No I’m not a physician, but I am a biology graduate, so perhaps gave that impression. The point about my nosebleed remark was not that any of the marks were made by a nosebleed, but that if any of the blood was added by a forger for verisimilitude, he would not need any technical knowledge, just a sponge. Jones’s claim, which attempts to refute the possibility of a Medieval artist on the grounds of lack of microscopical or ultra-violet knowledge, doesn’t make sense.\nRegarding your point about the difference between blood from a dead body and a live one, the picture is extremely complex, and the shroud is not clear enough for an apples/oranges distinction to be made. As I mentioned, it is possible that the body was washed clean shortly before being laid on the shroud, and that the scourge marks on the back are the result of wounds reopening, or simply seeping. These might be characterised by a lack of red blood cells and an excess of plasma (as you might find by removing a dressing from an open wound before it heals). On the other hand, a forger with a bowl of blood (maybe from a patient who had recently undergone bloodletting) would find he too would have to use it quickly before it too became more plasma than red cells. My own experiments indicate that blood is not at all an easy medium to paint with…\n\n","date":"July 15, 2013 at 7:15 pm","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39039","author":"Hugh Farey","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"Thanks, David. I think the point about the Philippines chaps is that it doesn’t take long for the back to be an overall mass of blood, not a delicate collection of blobs, regardless of implement. It is, of course, possible that the body of the shroud was washed, and began to seep again, which might produce patterns like those on the shroud, but to claim that we “know” that the image on the shroud is “realistic” is pushing things, I think.\nAnd, no, I’ve no idea how the blood came to appear on the shroud, but I do claim that you don’t need any technical expertise to put it there.\nAnd finally, I agree that the marks look as if they were made by two people, of different statures. In fact I don’t recall ever seeing a painting where that wasn’t the case, so I don’t think it requires a leap of imagination such that the pattern of the marks on the shroud, in themselves, constitute evidence against forgery. There is an interesting discussion of this at http://naturesdesignsonline.com/Cat-of-nine-tails.htm, where Joel Donahoe, in an otherwise rather over imaginative essay to my mind, says that unless one of the scourgers was left-handed, the man to the right of the victim would have to stand with his body turned away and use his whip back-handed. Maybe that would explain some of the asymmetry.\n\n","date":"July 15, 2013 at 10:38 am","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39021","author":"Hugh Farey","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"I think you raised two important points: that we should not speak in absolutes and we should not underestimate the skills of people who lived in antiquity. This leads to a Von Daniken view that says ancient peoples could not have built pyramids, moved the statues of Rapa Nui, or sailed across the Pacific — without the aid of extraterrestrials.\nJust because we can’t conceive of how a person living centuries ago accomplished something doesn’t mean they weren’t smarter than us and did just that.\nMy caveat to this though is the singularity of the Shroud. There isn’t just one pyramid (or type thereof), there wasn’t one Hokulea-type vessel that sailed Polynesia, and there wasn’t just one statue on Easter island. But we only have one Shroud.\nI would expect to see other Shroud-like works if the ability was there. Or perhaps earlier works honing the method. But what we have is a one-shot of an unknown technology, creating a unique relic (when the technology could have been used to generate shrouds of kings, queens and saints). It comes out of nowhere and returns to nowhere. This isn’t to say that it couldn’t have been created thus, but that singularity is perplexing.\n\n","date":"July 15, 2013 at 12:10 pm","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39025","author":"David Goulet","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"\nHugh Farey :\nHi Jesterof. No I’m not a physician, but I am a biology graduate, so perhaps gave that impression. The point about my nosebleed remark was not that any of the marks were\nmade by a nosebleed, but that if any of the blood was added by a forger for verisimilitude, he would not need any technical knowledge, just a sponge. Jones’s claim, which attempts to refute the possibility of a Medieval artist on the grounds of lack of microscopical or ultra-violet knowledge, doesn’t make sense.\nRegarding your point about the difference between blood from a dead body and a live one, the picture is extremely complex, and the shroud is not clear enough for an apples/oranges distinction to be made. As I mentioned, it is possible that the body was washed clean shortly before being laid on the shroud, and that the scourge marks on the back are the result of wounds reopening, or simply seeping. These might be characterised by a lack of red blood cells and an excess of plasma (as you might find by removing a dressing from an open wound before it heals). On the other hand, a forger with a bowl of blood (maybe from a patient who had recently undergone bloodletting) would find he too would have to use it quickly before it too became more plasma than red cells. My own experiments indicate that blood is not at all an easy medium to paint with…\n\nI agree totally that it looks like the body was washed before laid in the shroud. On the point about whole blood vs all other bloody material – those are apples and oranges. Whole blood can come and stain only from ALIVE person. A dead body would not sip whole blood ( even if that looks like one)of the same structure as in a live person.\nThe reason I am repeatedly pointing this is that people who are not used to blood and it’s functions tend to project their own experience with bleeding( usually the whole blood) onto the character of staining on the Shroud.and this is not only apples and oranges but apples and beef :-)\n\n","date":"July 15, 2013 at 9:06 pm","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39045","author":"jesterof","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"The simple fact that evident traces of dirt were found in the ankle and in the knees régions is enough to understand that the body was NOT washed and this is totally consistent with an hasty burial, just like it is reported by the Gospels for Jesus.  It’s important to note that medical experts such as Barbet and Lavoie agrees that the body of the Shroud man was unwashed.  My own little experience prove that a blood clot that has completely dried for several hours can left a very precise Mirror imprint on a piece of fabric if there is enough humidity present on top of it.  If this was possible for me in 2011, it was surely possible for the body of the Shroud man 2000 years ago IF there was enough water vapor (or enough burial products such as aloes and myrrh) present Inside the cloth with the corpse.\n\n","date":"July 15, 2013 at 10:50 pm","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39052","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"I think the body was probably not washed very thoroughly, and I agree that remoistened blood could make a mark. I have problems with the pattern, however, thinking that the back of the body was probably coated in blood, which, even if it had dried in the meantime, would also come off when remoistened. As for the medical experts, they all disagree with each other to some extent, and surely cannot be treated as Gospel. Fred Zugibe, for example, wrote an entire paper entitled “The man of the shroud was washed.” I don’t want to get into a “My medical expert is better than your medical expert” squabble, but, as I say, they do disagree, sometimes profoundly.\n\n","date":"July 16, 2013 at 4:01 am","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39060","author":"Hugh Farey","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"Lets try putting ourselves at the crucifixion, and also using the biblical narrative descriptions. Jesus’s body would undoubtedly be covered in blood stemming from the many  tortures he received, (this would be undeniable). Jesus hung on the cross for hours and according to scripture a storm brewed up. If we take that into account plus the fact that Jesus’ body would have been left on the ground for a short period of time, he would undoubtedly be covered in dirt. Especially since the dirt would ‘stick’ to the damp, sweaty, bloodied body….Where is all this dirt? It is not evident on the Shroud. Wouldn’t it be mixed in with the blood?…From this single undeniable fact, I think it is pretty certain the body was ‘partially’ washed. Jewish customs of the time did not allow the washing of ‘life-blood’ from the body but did so for other blood. The blood soaked cloths used during the cleansing would be left with the body as all blood must be buried with the body according to custom.\nR\n\n","date":"July 16, 2013 at 9:45 am","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39066","author":"Ron","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"“Jesus hung on the cross for hours and according to scripture a storm brewed up.”\nIs there any indication (on the shroud) that the body might have been ‘washed’ by rain? Just a thought that your comment sparked, Ron.\n\n","date":"July 16, 2013 at 12:48 pm","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39071","author":"David Goulet","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"Your assuming a storm brewing up indicates or supposes rainfall, not necessarily. Ever experience a storm comes in, the skies darken making it seem like night and the winds gust strongly for a short period, yet no rain fall? I have plenty of times in my life…\nI don’t believe the scriptures mention rain and one of our recently not active bloggers here, also suggested it may have been a sand storm, which apparently the area of Jerusalem was once known for getting hit with once in a while.\nR\n\n","date":"July 16, 2013 at 3:57 pm","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39081","author":"Ron","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"It rained pretty hard in Gibson’s movie. :)\n\n","date":"July 16, 2013 at 4:39 pm","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39083","author":"David Goulet","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"\nHugh Farey :\nI think the body was probably not washed very thoroughly, and I agree that remoistened\nblood could make a mark. I have problems with the pattern, however, thinking that the back of the body was probably coated in blood, which, even if it had dried in the meantime, would also come off when remoistened. As for the medical experts, they all disagree with each other to some extent, and surely cannot be treated as Gospel. Fred Zugibe, for example, wrote an entire paper entitled “The man of the shroud was washed.” I don’t want to get into a “My medical expert is better than your medical expert” squabble, but, as I say, they do disagree, sometimes profoundly.\n\nZugibe was right. At least the area of the scourge marks WAS washed, otherwise there won’t be markings as clearly defined as they are.\n\n","date":"July 16, 2013 at 3:02 pm","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39080","author":"jesterof","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"Not so sure jesterof…  And you know why I say this?\nLook at the arms, the head and the forehead!  Have you noticed how little bloodstains there are in these areas? Nevertheless, there too, we must presume that, at the time of death, not an inch of the arms was probably free from bloodstains resulting from the blood flows that were coming out of the nail wounds and not much of the entire head and forehead area was free from bloodstains coming from the puncture wounds of the cap of thorns.  \nBut nevertheless, there only seem to be some clotted blood flows that were able to leave a mark on the cloth in these areas.  In order to explain this (which, at first sight, must be seen as being as strange as the absence of blood flows in the regions where there were scourge hits), I hope no one will pretend that the arms and the head were washed too before the corpse was laid in the Shroud!  Because of the presence of clear blood flows in those area that are consistent with the vertical position of crucifixion, it’s evident that the arms and the whole head area where not washed!\nBecause we must find a proper solution for both the absence of many presumed blood flows on the arms, the head and the forehead and also the absence of presumed blood flows in the regions where there have been some scourge hits, I’m affraid the defenders of Zugibe’s hypothesis will have to look elsewhere with me to find the correct answer…  \nI think many people in the Shroud world (beginning with Zugibe himself) have made the error of focussing only on the question regarding the blood transfer coming from the scourging, while leaving aside the question regarding the absence of many presumed blood flows in the arm, the head and the forehead region.  Sorry but if someone want to find the solution for one “anomaly” on the Shroud, his solution must also account for the other anomalies of the same kind that are also present on the Shroud… \nSo, any guess folks?  Remember that when we take into account all the pertinent data and observations coming from STURP, there is absolutely no good reason to think that the blood transfers that happened in the arm, the head and the forehead regions were any different than the blood transfers in the shape of a dumbbell that happened in the areas where there were some scourge hits. \nNote : Tomorrow, I will give you my own hypothesis that can possibly account for the absence of many presumed blood flows in the arms, the head and the forehead regions as well as the absence of presumed blood flows in the regions where there have been some scourging.\nWould be nice to read some thoughts from other people about this somewhat strange absence of many presumed bloodstains on many parts of the Shroud (and not just in the areas where there were scourge hits)…\n\n","date":"July 16, 2013 at 4:55 pm","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39084","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"Yannick, but that is exactly why I think it was washed – because of the torture endured the whole body would be covered in blood, sweat and dirt.\nAnd there are no signs of that on the Shroud, at least not to expected extent.\nThe head and the arms have different wounds and different blood material will come from\nthem, than from the scourge marks. Even if they were washed.\n\n","date":"July 16, 2013 at 6:11 pm","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39085","author":"jesterof","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"\nYannick Clément :\n  Remember that when we take into account all the pertinent data and observations coming from STURP, there is absolutely no good reason to think that the blood transfers that happened in the arm, the head and the forehead regions were any different than the blood transfers in the shape of a dumbbell that happened in the areas where there were some scourge hits.\n<\n\nYou are totally wrong on this and I am amazed that you are still repeating this nonsense.\nthe blood marks from the scourge wounds are totally different bloody material: than the markings from the wounds at the wrists and head.\nDifferent wounds produce different bloody markings, do you understand?\n\n","date":"July 16, 2013 at 6:16 pm","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39086","author":"jesterof","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"Both bloodstains have surrounded by the same halos of serum, so I don’t think it’s non sense to presume they were formed on the cloth by the same transfer mechanism…\n\n","date":"July 17, 2013 at 8:26 am","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39119","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"\nYannick Clément :\nBoth bloodstains have surrounded by the same halos of serum, so I don’t think it’s non sense to presume they were formed on the cloth by the same transfer mechanism…\n\nAnd? The “halo of serum” does not prove ANYTHIING as serum( or correctly – plasma) is an integral part of whole blood.\nIf anything it most likely proves the idea expressed by Ron that the pattern of image formation depicts more of the reopened wounds, as reopened wounds tend to seep more of the  plasma part, not the whole blood.\n\n","date":"July 17, 2013 at 7:00 pm","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39154","author":"jesterof","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"I’ve developed a hunch recently that the scourge wounds and the trickle along the lower back might be authentic, whilst the blood on the hand, arms, head and side might be medieval “add ons”. There is something about these blood stains that looks a little bit “too good to be true” to me.\nBut it’s only a hunch.\n\n","date":"July 17, 2013 at 4:20 am","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39112","author":"Matthias","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"We can’t say if it was raining or not. The sky was darkened, Luke says the sun was eclipsed; but you can’t have a solar eclipse during Passover when there’s a full moon. It was most likely a dust storm, possibly a high flying dust storm. Max P H has mentioned previously that several can occur in Palestine each year.  At some time recently I had commented that I never recalled an earthquake during rain. In fact there’s what is sometimed called “typical earthquake weather” when the air is very still, usually a fine day, often the birds go silent.  However from a few weekends ago, I have to retract that.  I recall a significant earthquake jolt and shake, and there was a rainstorm at the time. Whether it was raining closer to the epicentre or not, I can’t say. But it was unusual. However rain during a dust storm doesn’t make sense to me, if it was indeed a dust-storm; I should think it would be a fairly muddy kind of rain, worth commenting on, but the scriptures don’t say that. Like I said, we don’t know if it was raiing or not!\n\n","date":"July 17, 2013 at 7:05 am","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39116","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"I have no idea if rain was common in Palestine at the time of year the crucifixion occurred and I agree it is more likely that the ‘storm’ was dust and wind. Perhaps there was no storm at all and it is a literary device. How can we ever know? But could we extrapolate there was a rain storm by the blood stain evidence? If it had rained would this explain why some blood stains are not evident but others (post rain) are? \nI think the bit of evidence that works against a rain theory is the dirt evidence on the feet. If it was raining hard enough to wash blood from the body, would it not have washed the feet as well? Unless the dirt had already caked too heavily to be removed? Or the feet became soiled again when the body was placed again on the ground (in the mud)?\nJust thinking out loud here. From what I’m reading here there is heavy debate on the washing of the body theory – was it washed or not, wholly or in part, the evidence seems to support both sides of the debate. Could the evidence be reconciled if we consider the possibility that the body was indeed washed, while still on the cross by a rain storm, just prior to being taken down from the cross hastily  and transferred to the tomb? Could the shroud linen have been wet when it wrapped the body?\nPerhaps its the romantic in me that simply likes the idea of God sending the rain to wash the body of His Son.\n\n","date":"July 17, 2013 at 10:04 am","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39122","author":"David Goulet","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"Here’s a good question for all of you: What can account for the absence of many presumed blood flows on the arms, the head and the forehead and also the absence of presumed blood flows in the regions where there have been some scourge hits?\nMy hypothesis: The time factor!  Effectively, since there is almost no pre-mortem blood flows on the Shroud, except for some in the arms, the head and forehead regions, we must assume that those blood flows that were able to leave a precise imprint of themselves on the cloth were the last blood flows to happened before death (maybe no more than one or two hours before death or even less; who knows?).  Consequently, we must assume that all the other presumed blood flows in these areas, along with all the presumed blood flows in the regions where there were some scourge hits, were all completely dry for too many hours in order to be able to get humidified again and leave their mark on the cloth.  So, even if, later on, there was an income of humidity on-top of these dried stains, none of them were able to leave a clear mark on the cloth.  They were just too dry!  That could explain why, in these areas of the Shroud, there appear to be much less bloodstains than we might think.  If I’m right about that, we must then assume that only the blood that have dried for less than some time (a time which still need to be determined) have been able to get re-moistened enough on their surface to left a good mirror imprint on the Shroud.\nSome will surely tells me:  and what about all the different bloody wounds that were able to leave their mark on the cloth, especially the scourge wounds in the form of a dumbbell?  Don’t you think those should have been dry for a very long time before the death of the Shroud man (nearly as long, in fact, as the presumed blood flows from the scourging)?\nI would say this:  Not necessarily!  In his book, doctor Pierre Barbet noted that, in the context of a Roman crucifixion, it is truly possible that most of these scourge wounds got infected, which would have the direct effect of keeping them somewhat humid, with a possible oozing of liquid (probably lymph with maybe some other biological substances from the blood like plasma).  So, I really think it’s possible that all the wounds of the Shroud man, including the ancient scourge wounds, could have stayed humid for enough time before they dried; so much that their complete drying possibly happened many hours after the scourging (and not necessarily long before death), which could have allowed all of them to get re-moistened once the body was laid inside the Shroud (or maybe before this enshrouding), with the result that we still see today :  a lot of precise scourge marks in the shape of a dumbbell, surrounded almost every time by a clear halo of serum, which were all formed with exudates of re-humidified blood clots.\nThat’s it for the summary of my hypothesis concerning the bloodstains that we see on the Shroud versus the presumed very bloody appearance of the Shroud man at the moment he died (much more in fact than what we see on the Shroud).\nComplementary note:  I know some of you (including Zugibe who base part of his reflection on this argument) will object this:  But how the body image could have been formed in these areas if they were all covered with dried blood clots?  Is it not a fact that the bloodstains and the serum stains on the Shroud were enough to prevent the formation of a body image?  Is it not a fact that these stains on the cloth acted like a protective shield against the image formation process?\nI would answer:  yes, of course!  But ONLY for sure in the case of a bloodstains present on the cloth!  There is absolutely no proof that this was also true for a dried bloodstain on the skin or on the hair!  Thinking otherwise (like Zugibe did in his paper) is committing a sin of free extrapolation my friends, which have no real solid scientific base…  Why?  Simply because we don’t know the exact image formation mechanism!\nQuestion:  What can make you think that this image formation process could have been blocked by the presence of dried blood clots on the skin or on the hair?  For example, if the natural hypothesis of John De Salvo or the one proposed by Ray Rogers is correct (or just partially correct) and the image formation process is a direct result of an interaction between the surface of the cloth and some post-mortem gases and/or molecular transfer (urea and/or lactic acid for example), then we must assume that this kind of biological release of gas and molecules would not have been restricted to the portion of the skin or the hair free from blood, but would have been also released at the surface of the dried blood clots present on the skin and on the hair… Remember that the surface of these dried blood clots would have been in direct or very close contact with the surface of the cloth, without any “protective shield” between them to prevent the formation of an image on the cloth.  And if we assume that most of the post-mortem gases and or molecular transfer could have come from some biological products (like urea and/or lactic acid) that were first present in the abundant sweat of the crucified man and that would have been left everywhere on the skin and on the hair (AND ALSO ON DRIED BLOOD CLOTS PRESENT ON THE SKIN) after the drying of this high amount of sweat (after death), then it’s pretty easy to understand that the dried blood clots would not have acted like a “protective shield” in the way the bloodstains on the cloth did during the image formation process.  \nIn such a context of a completely natural process of image formation coming mainly from the biological products left on the skin, the hair and the dried blood clots after the drying of the abundant sweat of the crucified man, there would have been no difference whatsoever if these reactive products would have been deposited on the skin or the hair that was free of blood or on the surface of the dried blood clots.  The result would have been exactly the same!  Note that I’m not sure at all that it would have been the same if the image formation would have come from a burst of high energy or from light coming from the dead body!  Effectively, in this case, I’m pretty the dried blood clots present on the skin would have indeed acted like a “protective shield” and prevent the formation of a body image in these areas…  \nBut in the case of the natural process I just described that would have mainly come from the products left on the skin, the hair and the dried blood clots by the drying sweat, we have to assume that these products would have been present between these dried clots and the surface of the Shroud without any “screen” in between, and therefore, there would have been absolutely no “protective shield” between them to prevent the formation of what appear today as the skin or the hair of the Shroud man, but that were probably dried blood clots that were stuck to the skin or the hair instead in many places.  The result of the image formation process would not have been clear enough to enable us to see the difference…  So, whether it was a portion of the skin or the hair that was free from blood or a portion of the skin or the hair that was stuck with dried blood clots, the end result would have been exactly the same, i.e. a dehydration of a tiny layer of impurities on the top surface of the cloth (only in the zones where no bloodstains were able to form on the cloth prior to the beginning of the image formation process).\nThat’s my hypothesis.  In my mind, if this hypothesis of mine is correct concerning the blood transfer that occurred on the Shroud, then it could be seen as another indirect confirmation that the image formation process was most probably natural and would have mainly come from some reactive biological products left on the skin, the hair and the dried blood clots after the drying of the abundant sweat of the crucified man… \nAnd if I had to summarize my hypothesis in a few words, I would say this:  All the pre-mortem blood stains we can see on the Shroud (including the blood flows of the arms, head and forehead regions and also the dumbbell shaped scourge marks) come most probably from the blood that was still not completely dry at the moment of death and also from the blood that had dried not very long before death (with a upper limit of time after drying still undetermined).  All these bloodstains would have been able to get re-moistened (or humidified even more) before or more probably after the corpse had been laid inside the Shroud and this re-moistening would have been probably caused by the release of water vapors from the dead body, along with maybe the presence of some moistening agent present in some burial products and, more probably, the presence of a high amount of natural humidity inside the Shroud and inside the tomb.\nOne thing I hope is that you will be honest enough to recognize that my hypothesis is one of the few that can naturally account for all the pre-mortem bloodstains on the cloth, as well as for the absence of a lot of presumed bloodstains that should have been present on the skin or the hair of the Shroud man at the moment of his death (especially in the regions of the arms, the head, the forehead and the areas where there were scourge hits)…  \nAnd for the post-mortem bloodstains, it is not hard to believe that most of them were still not completely dry when the body was placed inside the Shroud, so that they were all able to leave a good imprint on the cloth.\nOk, that’s it for the moment…  Now, it’s up to you to reflect upon this and tell me what you think!  Thank you!\n\n","date":"July 17, 2013 at 8:26 am","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39120","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"Very solid theory, Yannick. The idea that infected earlier wounds could then leave more ‘recent’ stains goes a long way to explain some of the anomalies.\n\n","date":"July 17, 2013 at 10:16 am","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39123","author":"David Goulet","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"Thank you.  I think this hypothesis of mine would deserved to be fully tested under proper lab conditions and not just for the blood transfer but also for the image formation process, which can well have been caused by the presence of some “reactive” biological product on the skin, the hair and the dried blood clots of the crucified man after his abundant sweat had dried (most probably before his body could be placed inside the Shroud)…\n\n","date":"July 17, 2013 at 10:50 am","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39126","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"Read the scriptures closely, and an ‘infected scourge wounds theory’, although I’m not refuting it completely, is not necessary to explain why there would be so much blood still present from the scourge wounds; The Roman soldiers after they had scourged Jesus had mocked him as being the ‘ King of the Jews’, by placing a crown of thorns on his head and a article of clothing over his body (and his fresh wounds). When they reached the cross some time later, they pulled this cloth off his body. Pulling this cloth off the body would have undoubtedly opened up many of the wounds again. Maybe not all, but many. ” Re-opened” wounds tend to take forever to close up again or to stop oozing, in my experience, and is a simple answer to all the blood or exudate of blood found from the scourge wounds.\nLike David Goulet mentioned above, I like the idea of God sending rain to cleanse the body of Christ, but, it would not explain the absence of dirt on the body by the time they had reached the tomb! If we take the studies on the Sudarium somewhat, and scriptures into account, and maybe a little common sense, Jesus hung on the cross for some time ‘after death’ and before taken down. He was then laid on the ground for a period of time, (possibly in the removal of the nails and/or from the cross). They did not have cobblestone or tiled ground, it was dirty/sandy or possibly muddy  ground! He would have been covered in a excessive amount of dirt with no doubt. Enough dirt to cover most, if not all the body. Hence I still believe a ‘PARTIAL’ washing is evident. Washing does not necessarily mean scrubbing/ wiping, washing would have been a delicate procedure of ‘dabbing’ with a wet sponge or other cloth, which would be essential if trying to avoid lifeblood in the procedure. This could  account somewhat for the dampness which existed within, once the body was enshrouded, especially since time was of the essence and the body would not have had time to dry.\nR\n\n","date":"July 17, 2013 at 2:43 pm","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39139","author":"Ron","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"Interesting but if your idea of “re-opened” wounds concerning the scourge wounds would be correct Ron, then we would expect to also see many  blood flows from these wounds on the Shroud.  The fact is that there are none.  Your idea is unable to explain why there would have been only the scourge wounds that would have left an imprint on the cloth, while the blood flowing out of these “re-opened” wounds would not.\nBecause we can presume that there really were many blood flows from the scourging (I tend to think that these blood flows came much more from the leather tongues of the flagrum than from the metal balls or animal bones, which probably caused more like a contused wound with some superficial bleeding), as well as many scourge marks in the form of a dumbbell, and because in the end, the only things that were able to left their imprints on the cloth were those dumbbel shape wounds, I think my explanation is far more probable than yours.  \nAs I said, in your case, we should expect to see on the Shroud some (probably many) imprints of blood flows coming from the re-opened wounds (the wounds caused by the metal balls or animal bones as well as the wounds caused by the leather tongues) if these wounds would have stayed open a long time after the beginning of the crucifixion (because re-open wounds like this would surely have caused some new and fresh blood flows)…\n\n","date":"July 17, 2013 at 3:16 pm","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39141","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"\nDavid Goulet :\nVery solid theory, Yannick. The idea that infected earlier wounds could then leave more ‘recent’ stains goes a long way to explain some of the anomalies.\n\nexcept that infection does not develop in couple of hours to the extent that it will interfere with the blood clotting pattern and therefore the blood stains formation.\n\n","date":"July 17, 2013 at 6:48 pm","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39152","author":"jesterof","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"Infection with an outcome of lymph CAN have contribute to maintained the scourge wounds (and other wounds like the puncture wounds of the scalp) humid for a long time if we believe Barbet, with the direct consequence to greztly delay the complete drying of these wounds, which could, in the end, have contributed to allow them to become humidified again at the time the body was laid in the cloth and then, to leave a precise Mirror imprint of themselves on the Shroud.\n\n","date":"July 19, 2013 at 8:29 am","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39273","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"\nRon :\nRead the scriptures closely, and an ‘infected scourge wounds theory’, although I’m not refuting it completely, is not necessary to explain why there would be so much blood still\npresent from the scourge wounds; The Roman soldiers after they had scourged Jesus had mocked him as being the ‘ King of the Jews’, by placing a crown of thorns on his head and a article of clothing over his body (and his fresh wounds). When they reached the cross some time later, they pulled this cloth off his body. Pulling this cloth off the body would have undoubtedly opened up many of the wounds again. Maybe not all, but many. ” Re-opened” wounds tend to take forever to close up again or to stop oozing, in my experience, and is a simple answer to all the blood or exudate of blood found from the scourge wounds.\nLike David Goulet mentioned above, I like the idea of God sending rain to cleanse the body of Christ, but, it would not explain the absence of dirt on the body by the time they had reached the tomb! If we take the studies on the Sudarium somewhat, and scriptures into account, and maybe a little common sense, Jesus hung on the cross for some time ‘after death’ and before taken down. He was then laid on the ground for a period of time, (possibly in the removal of the nails and/or from the cross). They did not have cobblestone or tiled ground, it was dirty/sandy or possibly muddy  ground! He would have been covered in a excessive amount of dirt with no doubt. Enough dirt to cover most, if not all the body. Hence I still believe a ‘PARTIAL’ washing is evident. Washing does not necessarily mean scrubbing/ wiping, washing would have been a delicate procedure of ‘dabbing’ with a wet sponge or other cloth, which would be essential if trying to avoid lifeblood in the procedure. This could  account somewhat for the dampness which existed within, once the body was enshrouded, especially since time was of the essence and the body would not have had time to dry.\nR\n\nsounds reasonable\n\n","date":"July 17, 2013 at 6:50 pm","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39153","author":"jesterof","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"Partial washing would also have touch the arms and the head.  Why washing the body and leave the arms and the head stained with blood?  Some will say that it’s because the Jews were not allowed to wash the parts of the body where there was blood that was shed at the time of death, but I really Wonder if this really was the case, especially in the context of someone who died on the cross as a criminal…  In such a context, I have often read elsewhere that there would not be any washing at all that would have been allowed by the Jewish law or tradition…\n\n","date":"July 18, 2013 at 8:29 am","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39195","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"Additional comment :  Much more than the dirt that could have stained some parts of the body (note that the evident traces of dirt found in the knee area contradict the idea of a partial washing of the body in the zones where there have been some scourge hits), I sincerely think that the corpse that was laid in the Shroud after his death by crucifixion was mainly covered with dried blood clots, along with some still humid post-mortem blood clots and I also think that the only dried blood clots that were able to stained the cloth after that were only those that became completely dried not so long before death (that include all the scourge marks we see on the Shroud).  For all the others (including all the dried blood flows coming from the scourging, many ancient dried blood flow coming from the crucifixion holes in the feet and wrists and many ancient dried blood flows coming from the puncture wounds of the cap of thorns),  I assume that they stayed that way (i.e. completely dry) for all the time the body spent in the Shroud and, therefore, were not able to leave a distinct mark on the cloth…  I don’t know why such a scenario would be completely impossible in the context of the Shroud man…\n\n","date":"July 18, 2013 at 8:53 am","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39197","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"Along with the good argument I told you in the last days about the fact that STURP has found evident traces of dirt in the knee area (a region where there are some scourge marks), I have another pretty good argument to show you that goes against the idea that there was a partial washing of the body and that it is this partial washing that would be responsible (if we believe Zugibe’s hypothesis) for the imprint of the scourge marks on the Shroud.  Here it is:  there are some scourge marks very near the post-mortem bloodstains that came from the side wounds, and this is true not only in the chest area but also in the lower portion of the back region where there are some blood flows coming from the same side wound on the chest.\nIf you look at positive photo of Durante on the Shroud Scope (sindonology.org) or if you have the new application that show the Shroud in HD, you just have to look at the region of the post-mortem blood flows in the lower back region (dorsal view) to see that it’s true.  In that region, you will easily noticed some scourge marks that are located very near the border of the post-mortem blood flows.  On the Shroud Scope, when can do measurements and I have found out that one scourge mark in particular is at less than 2 cm of the margin of a post-mortem blood flow!  If this is not immediately adjacent, then I don’t know what it can be called!  Also, in the vicinity of the blood flows that are located under the side wound in the chest region, there are some scourge marks that also seem to be located very near the border of these post-mortem blood flows, even though I have to admit that, because of the water stain present there and also because the scourge marks of the frontal side are generally more superficial (certainly due to the lack of body weight pressure on the cloth there), it is a lot harder to really distinguish them with great certainty.  Nevertheless, to my eyes, it really seem to be some scourge marks present in that region that are not far away from the post-mortem blood flows under the side wound.  For example, one that I can distinguish easily is located at more or less 5 cm from the side wound itself (this scourge wound is located directly over the side wound), which is pretty close and there seem to be some more that are even closer…\nSo, after having seen these few example, I would like to hear the defenders of Zugibe’s hypothesis (like jesterof and Ron) explanation versus the presence of these few scourge marks that are immediately adjacent to a post-mortem blood flow on the cloth…  \nGood question: How in the world can we believe that there was a partial washing there that was so meticulously done that it succeed to clean these clotted scourge wounds that are located very close to a post-mortem bloodstain (remember that it was against the Jewish Law to wash this post-mortem blood)?  In other words, how can a partial washing done in haste could have been so precise that it would have caused the same oozing of blood material from the washed scourge wounds everywhere we see markings like that on the cloth, and especially in these region located that are immediately adjacent to some post-mortem blood flows?\nI just cannot imagine the few people who were there for the hasty burial being as meticulous with a sponge as a surgeon with a scalpel!!!  Imagine the risk of disturbing the post-mortem blood flows if they would have acted like that !  Again, we must remember that it was against Jewish Law to remove any post-mortem bloodstain on the body of a dead man, even more when this man was a crucified man.  Seriously, you really believe that these people could have been so precise in the case of a partial washing done in haste while the Sabbat was approaching fast while, at the same time, taking a high risk of disturbing the post-mortem blood flows that were left on the chest and on the lower back region?  Let me laugh… \nIn all logic, if Zugibe was right about the blood transfer of the scourge wounds and if a partial washing wound have been done while making sure that no post-mortem bloodstains would be touched, we would surely not see any scourge marks in the vicinity of the post-mortem blood flows in the chest area, as well as the lower back region.  There would surely be an evident space of many inches (if not a feet or more) that would be free of any scourge mark, because the washing would never have been done in the regions that were close to a post-mortem blood flow.\nSo, I think that, along with the finding of evident traces of dirt in the knee area, the fact that there are some scourge marks located very close to some post-mortem blood flows on the Shroud is well enough to understand that Zugibe was most probably wrong about the idea of a partial washing that would have caused the formation of all the scourge marks on the Shroud…\nFinal note:  In all logic, it’s impossible to believe that the re-opening of the scourge wounds when they removed the tunic of the Shroud man just prior to his crucifixion has been an essential parameter for the fact that these wounds were able to stained the cloth, for the simple and good reason that it’s evident that the removing of that kind of tunic would not have cause that kind of re-opening everywhere we see some scourge marks, especially in the region of the legs on the frontal and the dorsal part of the body…  Again, it’s pretty evident that most of the scourge wounds in that region would not have stuck hard to that kind of long tunic and, consequently, we must assume that the removing of this cloth would not have been enough to re-open those wounds.  Nevertheless, these particular scourge wounds were able to leave the SAME KIND of good dumbbell shape imprints on the cloth, proving that the re-opening theory is most certainly false, in the sense that it is surely not the principal reason that can explain the presence of all the scourge marks on the Shroud.  Because all the scourge marks on the cloth are showing the same quality of precision, I still believe my hypothesis (which mainly comes from Barbet’s own hypothesis) is the best to explain their presence almost everywhere on the cloth (particularly for those that are located in the region of the legs and those that are located very near a post-mortem blood flow).  I can be wrong on this subject of course, but seriously, I really think my hypothesis concerning all the blood transfers to occured on the Shroud (and especially those that concern the scourge wounds) has some pretty good chances to be correct and I really think it would deserve to be tested under proper lab control by some CSI experts.\n\n","date":"July 19, 2013 at 10:49 am","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39278","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series","post":"get real i believe the scientist findings\n\n","date":"July 21, 2013 at 1:03 pm","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","id":"comment-39416","author":"darla mann","site":"shroudstory"}]
