[{"title":"\nTetradiplon and the Shroud of Turin\n","post":"\n\n'And He knew as knowing the heart, and asked to wash Himself; and a towel [Gk. tetradiplon] was given Him; and when He had washed Himself, He wiped His face with it. And His image having been imprinted upon the linen [Gk. sindon], He gave it to Ananias, saying: Give this, and take back this message, to him that sent you: Peace to you and your city!\"So this is clearly not referring to a should but a cloth with an image of Christ's face on it that Christ asked to be given to the city of Edessa. Can you explain how it could be a shroud?\n\n","author":"Anonymous","date":"September 15, 2012 at 8:05 PM","url":"http://theshroudofturin.blogspot.com/2012/09/tetradiplon-and-shroud-of-turin.html","site":"moore"},{"title":"\nTetradiplon and the Shroud of Turin\n","post":"\n\nAnonymous>'And He knew as knowing the heart, and asked to wash Himself; and a towel [Gk. tetradiplon] was given Him; and when He had washed Himself, He wiped His face with it. And His image having been imprinted upon the linen [Gk. sindon], He gave it to Ananias, saying: Give this, and take back this message, to him that sent you: Peace to you and your city!\">So this is clearly not referring to a should but a cloth with an image of Christ's face on it that Christ asked to be given to the city of Edessa. As I stated in my post above:\"Its first known occurrence is in the sixth century Acts of Thaddeus, an update of an earlier story about Edessa's King Abgar V (c. 4 BC-AD 50) receiving an image of Jesus imprinted on a \"four doubled\" (tetradiplon) linen sheet (sindon):\"It was the earlier Doctrine of Addai which `explained' that the image was imprinted on the cloth when Jesus wiped His face on it.The Acts of Thaddeus updated this with the 6th century discovery that the cloth was a four-doubled (tetradiplon large linen sheet (sindon).I have revised my post above to make this clearer:\"Its [tetradiplon's] first known occurrence is in the Acts of Thaddeus, a sixth century update of an earlier (c. AD 400) story in the Doctrine of Addai, about Edessa's King Abgar V (c. 4 BC-AD 50) receiving an image of Jesus imprinted on a cloth. The sixth century Acts of Thaddeus added new information to that earlier story that the cloth was a sindon (a large linen sheet) which was tetradiplon (\"four doubled\"):\"The Acts of Thaddeus did not challenge the earlier Doctrine of Addai's `explanation' how Jesus' image came to be imprinted on the cloth.Presumably, if the writer of the Acts of Thaddeus knew that it was not only the image of Jesus' face which was on the cloth, but that of His whole body, naked, tortured, bloodstained and dead, he was not at liberty to write that.Those among the Edessan clergy who knew that shocking new information would have a powerful vested interest to withhold it from the Edessan public, to whom it would be profoundly disturbing.Therefore it is not surprising that the Edessan clergy would maintain the traditional story about how the image was imprinted on the cloth, while permitting the writer of the Acts of Thaddeus to update it with the new information about the cloth itself, that it was a sindon (a large linen sheet), and that it was tetradiplon (four-doubled). >Can you explain how it could be a shroud?See above.Stephen E. Jones-----------------------------------Comments are moderated. Those I consider off-topic, offensive or sub-standard will not appear. I reserve the right to respond to any comment as a separate blog post.\n\n","author":"Stephen E Jones","date":"September 15, 2012 at 9:36 PM","url":"http://theshroudofturin.blogspot.com/2012/09/tetradiplon-and-shroud-of-turin.html","site":"moore"},{"title":"\nTetradiplon and the Shroud of Turin\n","post":"\n\nStephen don't forget the sturp physicist John Jackson performed a raking test on the shroud and found the folding creases that match a tetradipion. I can't post the links because for some reason I can't copy and paste on here from my iPod , but this is even more evidence in favor of it.Great article againGod blessBippy123\n\n","author":"Bippy123","date":"September 16, 2012 at 2:37 PM","url":"http://theshroudofturin.blogspot.com/2012/09/tetradiplon-and-shroud-of-turin.html","site":"moore"},{"title":"\nTetradiplon and the Shroud of Turin\n","post":"\n\nSo it really was the Shroud  and the clergy knew this but they put out the story that it was an image of the face of Christ while alive? At what point was the truth revealed? In 944 or later?\n\n","author":"Anonymous","date":"September 16, 2012 at 4:52 PM","url":"http://theshroudofturin.blogspot.com/2012/09/tetradiplon-and-shroud-of-turin.html","site":"moore"},{"title":"\nTetradiplon and the Shroud of Turin\n","post":"\n\nBippy123>Stephen don't forget the sturp physicist John Jackson performed a raking test on the shroud and found the folding creases that match a tetradipion. Thanks for reminding me. I have now inserted into my post above:\"This is consistent with major foldlines at one-eighth intervals, found on the Shroud by Dr John Jackson from raking light photographs of the Shroud taken in 1978 by the Shroud of Turin Research Project (STuRP)\" and I have uploaded a diagram of those foldlines from Ian Wilson, \"The Evidence of the Shroud,\" 1986, p.123.>I can't post the links because for some reason I can't copy and paste on here from my iPod , but this is even more evidence in favor of it.You may be thinking of Dan Porter's, \"What is the significance of the folding patterns on the Shroud?,\" The Definitive Shroud of Turin FAQ, 2009.>Great article againThanks.Stephen E. Jones\n\n","author":"Stephen E Jones","date":"September 16, 2012 at 6:13 PM","url":"http://theshroudofturin.blogspot.com/2012/09/tetradiplon-and-shroud-of-turin.html","site":"moore"},{"title":"\nTetradiplon and the Shroud of Turin\n","post":"\n\nAnonymous>So it really was the Shroud and the clergy knew this but they put out the story that it was an image of the face of Christ while alive?No. As I said, the `explanation' of how Jesus' face became imprinted on the cloth by Him wiping His face with it, was in the third century (c. AD 400)  Doctrine of Addai.That `explanation' pre-dates the Shroud being at Edessa (AD 526), and is more evidence for Markwardt's theory that the Shroud was in Antioch from c. AD 47-526, and hidden above Antioch's Gate of the Cherubim from c. AD 326-526.The sixth century Acts of Thaddeus did not change the earlier story of how the image was imprinted on the cloth, but it did add new information about the cloth itself, that it was a large linen sheet (sindon) which was four-doubled (tetradiplon), i.e. folded in eight.That presumably means that some in the Edessan clergy leadership became aware of the full-length cloth under the top face panel.Although it is possible they could see that the cloth was four-doubled in profile from the edge of the frame, without them actually having unfastened the cloth from its frame, unfolding it and looking at the image of Jesus' naked, bloodstained, crucified and dead body.>At what point was the truth revealed? In 944 or later?There seems to be no unambiguous record of when it was discovered that behind the Image of Edessa's face image was the full-length Shroud. The first definite reference was in 1130:\"All this makes all the more intriguing the evidence that someone, sometime after the Mandylion's arrival in Constantinople, seems to have undone the gold trelliswork covering the cloth, untwined the fringe from the surrounding nails, carefully unfolded the cloth, and, for the first time since the days of the apostles, set eyes on the concealed full-length figure. Frustratingly, this is another of those moments in the Mandylion's history that has gone unrecorded, yet is crucial to it. It is attested as a real happening from an impressive array of circumstantial evidence. The first indications, and the most direct, come from western authors. The earliest, datable to sometime before 1130, is an interpolation in an original eighth-century sermon by Pope Stephen III. [von Dobschutz, E., Christusbilder, Leipzig, 1889, p, 134] Referring to the Mandylion, it tells us: `For the very same mediator between God and man [Christ], that he might in every way satisfy the king [Abgar], stretched his WHOLE BODY ON A CLOTH, white as snow, on which the glorious image of the Lord's face and the LENGTH OF HIS WHOLE BODY was so divinely transformed that it was sufficient for those who could not see the LORD BODILY IN THE FLESH, to see the transfiguration made on the cloth.' [Green, M., \"Enshrouded in Silence,\" Ampleforth Journal, LXXIV, 1969, p.333]\" (Wilson, I., \"The Shroud of Turin: The Burial Cloth of Jesus?,\" 1979, pp.157-158. My emphasis).[continued]\n\n","author":"Stephen E Jones","date":"September 16, 2012 at 9:13 PM","url":"http://theshroudofturin.blogspot.com/2012/09/tetradiplon-and-shroud-of-turin.html","site":"moore"},{"title":"\nTetradiplon and the Shroud of Turin\n","post":"\n\n[continued]On or after 1130 that there are further such references (my emphases):\"Another account, from the prodigious History of the Church written by the English monk Ordericus Vitalis about 1130, seemed to derive from the first. According to this version: `Abgar reigned as toparch of Edessa. To him the Lord Jesus sent ... a most precious cloth with which he wiped the sweat from his face, and on which shone the Savior's features miraculously reproduced. This displayed to those who gazed on it the likeness and proportions of the BODY OF THE LORD.' [Ordericus Vitalis, Historia ecclesiastica, part III, bk. IX, 8]\" (Wilson, 1979, p.158).\"A Vatican Library codex, also datable to the twelfth century, repeated this tradition in its version of Christ's letter to Abgar: `If indeed you desire to look bodily upon my face, I send you a cloth on which know that the image not only of my face, but of my WHOLE BODY had been divinely transformed.' [Vatican Library Codex No. 5696, fol. 35, published in P. Savio, Ricerche storlche sulla Santa Sindone, Turin, 1957, footnote 31. p. 340]\" (Wilson, 1979, p.158).\"By the thirteenth century, Gervase of Tilbury, a great retailer of the gossip of the time, not only repeated these words of Christ to Abgar, but added: `Far it is handed down from archives of ancient authority that the Lord prostrated himself FULL LENGTH on most white linen, and so by divine power the most beautiful likeness not only of the face, but also of the WHOLE BODY OF THE LORD was impressed upon the cloth.' [Gervase of Tilbury, Otia Imperialia, III, from Scriptores rerum brunsvicensium, ed. G. Leibnitz, Hanover, 1707, I, pp. 966-67]\" (Wilson, 1979, p.159).While these may seem late, they are only the earliest surviving records of the discovery in Constantinople after 944 that behind Jesus' face image was His full-length, whole body image. It may have been discovered not long after the Image/Shroud arrived in Constantinople in 944, but it was either not recorded or that recording was lost.Whichever, this lack of any Constantinople document recording the discovery of Jesus' full-length, naked, bloodstained, crucified and dead body under His face image, is further evidence of how shocking this was to the Byzantine mindset. And helps explain that if the Edessan ruling clergy were aware of it from 526, why they kept it a closely guarded secret.And even though these 1130+ references are at least 186 years after the Image/Shroud arrived in Constantinople, they are still at least 130 years before the earliest possible radiocarbon dating of the Shroud, 1260.Stephen E. Jones\n\n","author":"Stephen E Jones","date":"September 17, 2012 at 5:33 AM","url":"http://theshroudofturin.blogspot.com/2012/09/tetradiplon-and-shroud-of-turin.html","site":"moore"},{"title":"\nTetradiplon and the Shroud of Turin\n","post":"\n\nStephen, thank you again for adding John Jacksons raking finds. You've done an incredible job of adding all the bread crumb evidence together.  Have a few friends that have been debating the shroud and I'm going to lead them to your post here. They are really excited about this connection here.God bless\n\n","author":"Bippy123","date":"September 18, 2012 at 4:09 PM","url":"http://theshroudofturin.blogspot.com/2012/09/tetradiplon-and-shroud-of-turin.html","site":"moore"},{"title":"\nTetradiplon and the Shroud of Turin\n","post":"\n\nBippy123>Stephen, thank you again for adding John Jacksons raking finds. Thanks again for reminding me of them.>You've done an incredible job of adding all the bread crumb evidence together. That's all I do, take evidence of the Shroud's authenticity discovered by others, e.g. Ian Wilson, and publish it on the Internet.>Have a few friends that have been debating the shroud and I'm going to lead them to your post here. Great!>They are really excited about this connection here.Thanks for the feedback.>God bless And you.Stephen E. Jones-----------------------------------Comments are moderated. Those I consider off-topic, offensive or sub-standard will not appear. I reserve the right to respond to any comment as a separate blog post.\n\n","author":"Stephen E Jones","date":"September 18, 2012 at 7:15 PM","url":"http://theshroudofturin.blogspot.com/2012/09/tetradiplon-and-shroud-of-turin.html","site":"moore"},{"title":"\nTetradiplon and the Shroud of Turin\n","post":"\n\nThis part of the story is false:Jesus asked for a towel to wash himself and then wiped the cloth on his face. With his image imprinted upon the towel, Jesus gave it to Ananias and t.. Thaddeus to guide the king and the city The Shroud is a 14 foot long burial cloth but it has the image of Jesus on it (very faint actually).  The image imprinted after Jesus died and it is not from washing his face.Legends obscure facts.  The legend of the Veronica cloth (she supposedly wiped his face on the way to crucifixion) is false (there is no Veronica cloth) It was widely told for centuries.  It is based  on the Mandylion (never made by human hands -- therefore not an icon)The Mandylion (the Shroud) was often described as a facial image because it was displayed as folded (not the full length) and that is where the story of a face cloth came.There is a face cloth (the Sudarium) but it too is a death cloth and its stains match the Shroud (Sindon) and so at one point both clothes were together (te grave). They each have type AB blood.Type AB is the rarest (less than 3% have it) and blood typing was discovered in 1907.  So blood tyhpe help to corroborate the relationship of the cloths.\n\n","author":"Anonymous","date":"September 15, 2013 at 12:17 AM","url":"http://theshroudofturin.blogspot.com/2012/09/tetradiplon-and-shroud-of-turin.html","site":"moore"},{"title":"\nTetradiplon and the Shroud of Turin\n","post":"\n\nAnonymous>This part of the story is false:Jesus asked for a towel to wash himself and then wiped the cloth on his face. With his image imprinted upon the towel, Jesus gave it to Ananias and t[o] Thaddeus to guide the king and the cityAgreed that the sixth century Acts of Thaddeus, story of Jesus leaving an image of Himself on a towel by washing His face on it is false. As I wrote above, it was an Edessan explanation of how and why Jesus' image was on the Mandylion (the Shroud of Turin \"doubled in four\" - Gk tetradiplon), to maintain consistency with Edessa's earlier Doctrine of Addai story of Edessa's 1st century King Abgar receiving from Jesus His image on a towel. Which in turn is probably an earlier conflation of Jesus' letter to Abgar I, which is in Eusebius' 4th century Ecclesiastical History, and an earlier (at least 4th century and possibly even 1st century) knowledge of Jesus' image on the Mandylion/Shroud.That in the sixth century the unique in all of known ancient Greek literature word tetradiplon tetra \"four\" + diplon \"doubled\" = \"four-doubled\") was used of a cloth with Jesus' facial image on is proof beyond reasonable doubt that there was known in at least the sixth century to be a cloth with Jesus' image on which was one-eighth of a larger cloth. This can only be what we now call the Shroud of Turin, which when folded in eight shows Jesus face in landscape aspect, exactly as it appears in early copies of the Mandylion.>The Shroud is a 14 foot long burial cloth but it has the image of Jesus on it (very faint actually). The image imprinted after Jesus died and it is not from washing his face.>Legends obscure facts. The legend of the Veronica cloth (she supposedly wiped his face on the way to crucifixion) is false (there is no Veronica cloth) It was widely told for centuries. It is based on the Mandylion (never made by human hands -- therefore not an icon)Agreed. The name \"Veronica\" is a combination of Latin vera \"true\" and ikon \"image\" = \"true image\", and therefore shows that the story of a woman named Veronica receiving Jesus' image on a towel she gave Him to wash his face with was false. But historians take ancient legends seriously as probably being based on facts. In this case that there was known to be an early (pre-4th century) image of Jesus, or at least of His face, on cloth.>The Mandylion (the Shroud) was often described as a facial image because it was displayed as folded (not the full length) and that is where the story of a face cloth came.Agreed. That's what my post above says.>There is a face cloth (the Sudarium) but it too is a death cloth and its stains match the Shroud (Sindon) and so at one point both clothes were together (te grave). They each have type AB blood.Agreed. [continued]\n\n","author":"Stephen E Jones","date":"September 15, 2013 at 8:02 AM","url":"http://theshroudofturin.blogspot.com/2012/09/tetradiplon-and-shroud-of-turin.html","site":"moore"},{"title":"\nTetradiplon and the Shroud of Turin\n","post":"\n\n[continued]>Type AB is the rarest (less than 3% have it) and blood typing was discovered in 1907. So blood tyhpe help to corroborate the relationship of the cloths.Agreed. And Jews have a higher incidence of type AB than Europeans. Also, while it may be argued that old blood tends to degrade to type AB (although even that is not always so-see my post \"My critique of Charles Freeman's `The Turin Shroud and the Image of Edessa: A Misguided Journey,' part 4: `The Shroud of Turin and the Sudarium of Oviedo' (2)\") if the Shroud and Sudarium of Oviedo had different blood types that would be have been a problem.Stephen E. Jones--------------------------------Readers: If you like this my The Shroud of Turin  blog, and you have a website, could you please consider adding  a hyperlink to my blog on it? This would help increase my blog's Google PageRank number and so enable those who are Google searching on \"the Shroud of Turin\" to discover my blog. Thanks. --------------------------------\n\n","author":"Stephen E Jones","date":"September 15, 2013 at 8:04 AM","url":"http://theshroudofturin.blogspot.com/2012/09/tetradiplon-and-shroud-of-turin.html","site":"moore"}]
