[{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"This looks desperate to me. I don’t know why anyone would have folded the shroud in the convoluted and unnatural manner proposed by jones to conform to his four doubling theory.\n\n","date":"September 17, 2012 at 3:38 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16376","author":"matthias","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"We need a carbon retesting rather than spurious and questionable historical quasi theories\n\n","date":"September 17, 2012 at 3:45 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16378","author":"matthias","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Firstly, I see no issue with Mr Jones interpretation of the folding. Desperate? Convoluted? Unnatural? ..Why? …It seems to me it would have been paramount during the folding to keep the face image ‘on top’ in every folding, and Jone’s fold interpretation definately does so, and it also works! It isn’t my interpretation of the folding mind you, but I can’t deny it works.\nSecond; You need to get your head out of the sand when it comes to the radiocarbon dating. A radiocarbon (testing), on it’s own is ‘USELESS’, as all pertinent evidence must be weighted. A multiple of tests need to be performed even before a radiocarbon testing can be done, as should have been done before the 1988 testing, but dropped. One should remember the Shroud has been exposed to so much contamination over the centuries, it may not be possible to achieve an accurate test result!  It’s not like it was sealed in a tomb for 2000 years, and even in that case, still erroneous results appear periodically.\nR\n\n","date":"September 17, 2012 at 4:24 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16380","author":"Ron","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"I don’t really want to waste my time explaining why Mr Jones’ folding example is a joke.\nThe original doubling of the shroud three times as shown in Dan’s images makes total sense, including keeping the face on top, even if it is 3 doublings rather than 4. Jones’ folding example just doesn’t look credible , in  particular the “second doubling” which is not actually a doubling, it’s a kind of fold over back on itself.\nI of course did not imply that the dating would be done without all the necessary qualifications and assumptions\n\n","date":"September 17, 2012 at 6:23 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16387","author":"Matthias","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Bravo !  At least, there’s one person here who understand how ludicrous Wilson’s hypothesis really is !!!  People should never forget this great truth :  With a good imagination you can believe or make believe anything !!!  Wilson knows this very well and that has work fine for him over the years in book selling and also on gaining a notoriety in the Shroud world.  But don’t get me wrong, he’s not alone in that case !\n\n","date":"September 17, 2012 at 8:28 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16389","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"My comment above goes to Matthias earlier comment…\n\n","date":"September 17, 2012 at 8:28 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16390","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"At least it seems very likely the shroud had been folded different ways. Aldo Guerreschi’s thought on this issue seems very perceptive : the holes caused by the Chambery fire of 1532 and the large water stains on the edges and in the central part of the cloth were in no way related, but were consequences of two totally distinct episodes.\n\n","date":"September 17, 2012 at 4:19 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16379","author":"anoxie","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"That the shroud has been folded in different way will never be a clue in favor of Wilson’s ideas.  Of course the Shroud has been folded in different ways over is long history and it’s even possible that he was at one point folded in 8 equal layers.  So what ?   The expression tetradiplon in the Acts of Thaddeus is used at a moment when Jesus is alive and well, before his Passion, and he used this cloth to wash only his face. So the context has nothing to do with a burial cloth of more than 4 meters long.  That’s the reality of the litterary context.\n\n","date":"September 17, 2012 at 8:31 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16391","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"And it is worth remembering that the burial cloths are mentioned in the same text as cloths separate from the one on which Jesus wiped his face. In his The Shroud (2010) Wilson is misleading in suggesting that the description tetradiplon refers to the cloth AFTER Jesus had wiped his face with it, not BEFORE as the text suggests. As Yannick suggests, this  whole debate is meaningless.\n\n","date":"September 17, 2012 at 11:29 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16398","author":"Charles Freeman","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"I agree with you M. Freeman.  In fact, the whole “tetradiplon” thing depend on the interpretation we do of the text. I’m sorry but there is no rational way to see any reference to a burial Shroud in the use of this word in the Acts of Thaddeus.  NO WAY… Unless you really want to see a reference there.\n\n","date":"September 17, 2012 at 1:01 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16402","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"“The expression tetradiplon in the Acts of Thaddeus is used at a moment when Jesus is alive and well, before his Passion, and he used this cloth to wash only his face. So the context has nothing to do with a burial cloth of more than 4 meters long. That’s the reality of the litterary context”\nThat is only one interpretation.\nAnother interpretation could be that the author of the Acts of Thaddeus, having seen the Image of Edessa which was actually the Shroud folded to only display the face of Jesus, wrote this legend to explain the faint image of Jesus’ face one sees on the Shroud (and one saw on the Image of Edessa). Given the faint image of the face, a legendary explanation that it was created by a wet or sweaty face makes a good deal of sense.\n“So the context has nothing to do with a burial cloth of more than 4 meters long.”\nWell it does if the “burial cloth” being the shroud had been hidden away / disguised by it being folded to only reveal the image of Jesus’s face, in order to get around the fact that theologically speaking it would have been offensive at the time to show Jesus’s naked and heavily tortured body. The author may have been privy to see the whole shroud as a tetradiplon, or have heard that this was the case.\n\n","date":"September 17, 2012 at 8:03 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16426","author":"Matt","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Estoy de acuerdo con Stephen, con 4 PLEGADOS se obtiene ese resultado.\nLe sugiero a Stephen una manera MÁS SIMPLE y que haría MÁS SUGERENTE la palabra “tetradiplón.\nImagino la Sábana dividida en 4 cuartos, a los que denomino desde la parte superior a la parte inferior:\n-Primer cuarto (A)………..Imagen DORSAL\n-Segundo cuarto (B)……..Imagen DORSAL\n-Tercer cuarto (C)……. Muestra el ROSTRO de la imagen, el tórax, los brazos etc, etc.Imagen FRONTAL\n-Cuarto cuarto (D)…….. Muestra las piernas, pies, etc . Imagen FRONTAL\nPLIEGO la Sábana por el REVERSO ( NO IMAGEN).\n1.- A sobre B. Primer cuarto sobre (on) el Segundo cuarto.\n2.- D sobre C .Cuarto cuarto sobre (on) el Tercer cuarto.\n3.- D sobre A. Cuarto cuarto sobre (on) el  Primer cuarto.\n-Tengo DELANTE DE LOS OJOS  la imagen FRONTAL de C (Tercer cuarto) con el ROSTRO, tórax, brazos etc de Cristo.\n– Tengo la Sábana en 4 PANELES ( sugiere el TETRA)\n4.-Pliego C por la mitad (DOBLO Y DUPLICO)  y obtengo un panel con el ROSTRO como muestra Stephen.\n8 paneles, 4 plegados, y en el último plegado he DUPLICADO EL TETRA.\n[Lamento la BARRERA del idioma]\nCarlos Otal\n\n","date":"September 17, 2012 at 4:51 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16381","author":"Carlos Otal","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Translation?\n\n","date":"September 17, 2012 at 9:50 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16393","author":"matthias","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Use Google translator…\n\n","date":"September 17, 2012 at 10:36 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16396","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"One last comment about the tetradiplon expression versus the proposition of folding the Shroud of Wilson :  Have you noticed that, in reality, we should call Wilson’s way of folding a “folding 3 times” ???  It doesn’t take 4 foldings to obtain the result proposed by Wilson but 3…  So now, does that mean we should try to find the word “tridiplon” in an ancient manuscript of the Abgar legend in order to confort his hypothesis ??? ;-)\n\n","date":"September 17, 2012 at 10:34 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16395","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Jones proposition of folding that we see is off-track completely and show how much baised he is toward Wilson’s hypothesis (like many “shroudies” out there)… It’s truly pathetic.  To obtain the result proposed by Wilson, I repeat, you just need 3 foldings and not 4.  The second double folding proposed by Jones is completely unnecessary and I’m convinced that he know that very well.  You don’t believe me ?  Go here : http://www.shroudofturin4journalists.com/pictures/FullEnrie.htm  and print this photo of the Shroud.  Then, fold it in two.  Then make another folding in two.  And then, make one last folding in two and you’ll get the same result that what is proposed by Jones !  3 foldings, not 4…\nSo again, would it be better to call this a “tridiplon” or what ?\n\n","date":"September 17, 2012 at 10:44 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16397","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"More than a couple of times, I wrote in this blog: \nReminder: the word tetradiplon can be read as “folded in four [successive foldings]” i.e. four times [onto itself] AND/OR as a qualitative noun ” a 4 x 1″ (in the metric system)/ a 4x2x2 (in the Assyrian royal cubit system) i.e. a piece of fabric/cloth four times longer than wide. “Doubled in four” would be rather misleading (describing the result not the folding process = THREE successive foldings).\nONCE MORE, I am GLAD to see that Yannick Clément made MY IDEA HIS OWN (most curiously he didn’t even noticed this specific  flaw in Dan’s graphics & Wilson’s reconstruction till I first pointed it to Ron in this very blog!)\nMost curiously, what does not fit in Yannick Clément’s or Charles Freeman’s theory is just discarded by these two firecely anti-Wilsonian commenters as if it has no specific relevance to the Image of Edessa. \nBtw the commenter who pointed the flaw in Dan’s graphics & Wilson’s reconstruction IS NOT Yannick Clément….\n\n","date":"September 17, 2012 at 3:34 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16407","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Tetradiplon can mean so many thing Max that you can easily make it fit with your preconceive notion of what it should mean to confort Wilson’s hypothesis !  He he !\nAll I can see is three folding.  If the ancient writer would have wanted to describe 8 layers, don’t you think he would have used the words “8 layers” or an expression precise like this ?  I truly think so.  \nGuscin talk about that in his book The Image of Edessa and proposed many different kinds of possible translations like “folded over in two four times” (producing 16 layers) or your doubled in four or some other possible translations, etc. The proper translation is not at all evident in this text since it’s a very unique word used in this text and nowhere else.  The only thing we can state for sure is that there is an action of folding the cloth that served to wipe Jesus face and that’s all.  The length of the cloth can be anything really from a normal towel to a beach towel to a larger cloth but surely not a burial cloth !!!!  \nAnyway, that’s not important is this : Fans of Wilson seem to forget that a burial cloth would not have his place in a story in which a living Christ wash his face while he is preaching, well before his Passion ! That’s what’s important !  The most important thing to note is the CONTEXT of the manuscript where we found this word tetradiplon and that has nothing (and I mean NOTHING) to do with a burial cloth or the Passion of Christ or his entombment.\n\n","date":"September 17, 2012 at 3:55 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16408","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"By the way…  I propose a little logical reflection to all of you :  IF the Image of Edessa was the Shroud of Turin folded in 8 as Wilson think and IF the word tetradiplon is really a reference used by the writer of the Acts of Thaddeus to show to his readers that the cloth was folded “doubled in four”, then in all logic that mean this writer was well aware of the real nature of the cloth !!!  You follow me ?  \nSo, IF this is correct, then explain to me why he would have invent a very complex word to show that the cloth was folded in 8 layers and why, at the same time, he would not have made any direct reference to a burial Shroud in his story of the miraculous imprint and also why he would not have made any reference to the presence of a complete body image on the cloth (front and back) ?  If he knew the exact nature of the cloth (that’s what Wilson and all his partisans think since they pretend the author knew the exact dimensions of the cloth !), then why making just a very imprecise reference to the dimensions of the cloth while completely avoiding to make any reference to the fact that it was a burial cloth and that there was a complete body imprint on it ?  If this author would really have wanted to physically described the Shroud, his story would have taking place during the Passion of the Christ and Jesus would have wipe all his body with the cloth and the author would have surely specified that the image was complete.\nIt’s not at all what goes on in the Acts of Thaddeus !  The action is located during Jesus ministry while he was alive and well and it is clear that he just washed and wipe his face (and nothing else) with the cloth !\nI think if you got 2 cents of intelligence folks, you’ll agree with me that Wilson’s hypothesis versus this bizarre word of tetradiplon is taken completely out of context and cannot in any way be interpreted as a reference to the Shroud of Turin !  This is just ludicrous versus the context of the manuscript where this word is used.  Again, why making a bizarre reference to the dimensions of the Shroud while completely avoiding the presence of a complete body image and the reality that it is a burial shroud and not just a normal towel ???  Sorry but there’s no way to answer this question rationally !!!  All you can do is making a bunch of wild speculation to, again and again, try to save Wilson’s hypothesis.  I just can’t believe my eyes to see how many people DESPERATELY WANTS this hypothesis to be good while it is obvious that it is not and while the fact that Wilson is most probably wrong doesn’t mean at all that the Shroud is not genuine !!!  I just don’t understand, except for the fact that most people will never be willing to change their mind once it is made up.  It’s sad to see.\n\n","date":"September 17, 2012 at 4:52 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16411","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Mistypiing: Most curiously, what does not fit WITH Yannick Clément’s or Charles Freeman’s theory is just discarded by these two FIERCE ANTI-WILSONSTS as if THE IMAGE OF EDESSA PHILOLOGY, ICONOGRAPHY, LEGENDARY AND NON-LEGENDARY LITERATURE that are in contradiction with their aprioristic view had no specific relevance to the ISSUE.\n\n","date":"September 18, 2012 at 10:30 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16463","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"A mind closed to all but its own preconceptions will never discover anything new.  Endless repetitions and regurgitation merely confirm prejudice and bigotry without further enlightenment.\n\n","date":"September 17, 2012 at 4:43 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16410","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"When you truly and honestly believe from the bottom of your heart that someone is on the wrong track about something, it is a duty to show him that he’s wrong with the help of good and intelligent arguments.  I think that’s what this forum is all about.  Debating and exchanging ideas and trying to elevate (just a bit) our knowledge about the Shroud. That’s how I see this.\n\n","date":"September 17, 2012 at 4:55 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16412","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"I don’t hear any “good and Intelligent” arguments from you, … especially intelligent. As Daveb described in his post, I hear only “endless repetitions and regurgitations..” Seriously do you Yannick or Charles actually ‘listen’ to other people’s counter-points and arguments? It seems to me you both don’t and that it goes in one brain cell and out the other. Everyone of your points have been addressed, but you are too blind in your own prejudace against Wilson to see it.\nPlease reflect on that.\n\n","date":"September 17, 2012 at 5:28 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16413","author":"Ron","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Ronny, all I hear from you is close-minded comments that goes against every credible Byantine scholars.  I don’t have anything more to tell you…  What else can I do ?  You choose to believe blindly in Wilson’s poor and something falacious arguments.  Good for you.\n\n","date":"September 18, 2012 at 8:29 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16456","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Oh, one more thing :  The “prejudice” (like you say) of me and M. Freeman are completely shared by all the real historians experts in Byzantine study that I have consulted.  Reflect on that.\n\n","date":"September 18, 2012 at 8:31 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16457","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Ron et. alia, Anyone looking at tetradiplon has\n1) To explain why the word is only used of the cloth BEFORE Jesus wiped his face with it and not afterwards. One possible reason is to give the cloth status (as in calling it ‘sindon’ or ‘fine linen’) in what is a legendary, not historical, account in any case. See my article Tetradiplon Revisited for examples of this.This is highly speculative but not impossible.\n2) Why Wilson wrote (The Shroud(2010), p.190) ‘Although its [the Acts of Thaddeus] initially off-putting aspect is that it ‘explains’  the creation of the Image as by Jesus washing himself, it intriguingly GOES ON [my emphasis] to describe the cloth on which the Image was imprinted as tetradiplon’, when, in fact, the word tetradiplon was used only BEFORE Jesus wiped his face. Was Wilson being misleading or careless in giving the impression that the cloth was tetradiplon AFTER Jesus had wiped his face on it?\n3) Why this same Acts of Thaddeus goes on to give a separate reference to burial cloths in the tomb, something that Wilson omits to tell us- perhaps he never read that far.\nAnyone who analyses tetradiplon only through Wilson’s account and without reading the original Acts of Thaddeus is likely to be misled, as I was in the first instance. \nRon’s comment to Yannick and myself :’Everyone of your points have been addressed, but you are too blind in your own prejudace against Wilson to see it.’\nI am sorry I have not seen these points being addressed. Please refer me to where they have been, or if not, address them now. Thanks.\n\n","date":"September 18, 2012 at 10:46 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16464","author":"Charles Freeman","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Exactly!  \nAll that was necessary, because it was a sin in Biblical times to look on a naked man (Jewish custom), was to fold the cloth in such a way that only the face appeared within the frame.  \nNow, even today, most people would fold the cloth either horizontally or vertically in sections of 2, 3 or 4, in an attempt to detail the facial image alone.  \nYet, very few people would even contemplate folding the cloth diagonally to achieve the same result.\nWe fail to think outside of the box, because we limit ourselves to viewing only its walls.\n\n","date":"September 22, 2012 at 2:02 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16751","author":"Angel","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"VC wrote: \n“When you truly and honestly believe from the bottom of your heart that someone is on the wrong track about something, it is a duty to show him that he’s wrong with the help of good and intelligent arguments.”\nAre you kidding? \nMost of the time you just keep ignoring other’s good and intelligent argument proving you’re are wron! When it comes to the mage of Edessa, you (and Freeman) really STILL need to do their homework as far as the Image of Edessa iconography, legendary and non legendary literarure is concerned (I just cannot help thinking you’re are just missing a few data)!\n Wilson’s theory may be only 25-33% reliable and 66-75% biased but Freeman’s is no better off!\n\n","date":"September 17, 2012 at 5:30 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16414","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"M.. Freeman’s argument against the Mandylion hypothesis are 99% the same as mine and we both did our research completely independently from each other !  Meditate on that.  Also, our arguments against Wilson are shared by all the Byzantine scholars I’ve consulted…  So, I don’t think we’re so off-track.\n\n","date":"September 18, 2012 at 8:38 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16460","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"From the Acts of Thaddeus. ‘And He knew as knowing the heart, and asked to wash Himself; and a towel [tetradiplon] was given Him; and when He had washed Himself, He wiped His face with it. And ‘His image having been imprinted upon the linen, he gave it to Ananias, saying: Give this, and take back this message, to him that sent thee: Peace to thee and thy city! For because of this I am come, to suffer for the world, and to rise again, and to raise up the forefathers. And after I have been taken up into the heavens I shall send thee my disciple Thaddæus, who shall enlighten thee, and guide thee into all the truth, both thee and thy city.  And having received Ananias, and fallen down and adored the likeness[ sic], Abgarus was cured of his disease before [sic] Thaddæus came.’\nThaddeus does arrive in Edessa, after the Crucifixion and tells the story [in the same text]:\n‘And they took Him, and spit upon Him, with the soldiers, and made a great mock of Him, and crucified Him, and laid Him in the tomb, and secured it well, having also set guards upon Him. And on the third day before dawn He rose, leaving His burial-clothes in the tomb [sic]. And He was seen first by His mother and other women, and by Peter and John first of my fellow disciples, and thereafter to us the twelve, who ate and drank with Him after His resurrection for many days.’\nTwo separate cloths in the same text, one a the burial cloths in the tomb, the other ‘tetradiplon’ but only when it was handed to Jesus for his to wipe his FACE with no record suggesting that it remained folded.\n\n","date":"September 18, 2012 at 10:55 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16466","author":"Charles Freeman","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Mistyping: YC wrote:\n\n","date":"September 17, 2012 at 5:31 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16415","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"+ mistyping: Most of the time you just keep ignoring other’s good and intelligent argument proving you’re are wronG! When it comes to the Image of Edessa, you (and Freeman) really STILL need to do their homework as far as the Image of Edessa PHILOLOGY (‘acheiropoietos’, ‘rakos’, ‘tetradiplon’, ‘hemation’), iconography, legendary and non legendary literarure is concerned (I just cannot help thinking you AND FREEMAN are just missing a few data)!\n\n","date":"September 17, 2012 at 5:37 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16416","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"YC,\nThere are times when I cannot help thinking you really got far less than ‘2 cents of intelligences’.\n\n","date":"September 17, 2012 at 5:41 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16417","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"\nMatthias :I don’t really want to waste my time explaining why Mr Jones’ folding example is a joke.The original doubling of the shroud three times as shown in Dan’s images makes total sense, including keeping the face on top, even if it is 3 doublings rather than 4. Jones’ folding example just doesn’t look credible , in particular the “second doubling” which is not actually a doubling, it’s a kind of fold over back on itself.I of course did not imply that the dating would be done without all the necessary qualifications and assumptions\nWhy waste your time even commenting then? Tetradiplon simply means a cloth folded in four or doubled in four…How this doubling is achieved is not of relevance really aslong as there has been four doublings and not neccessarily the whole cloth must be doubled in each fold…get the point? So it must be folded 4 times to give us ‘doubled in four’. Wilson’s depiction is in error, if one is to stick to the essence and the meaning of Tetradiplon. Furthermore for those who think tetradiplon can mean many things; you are wrong, there is only two possible translations as mentioned above.\nR\n\n","date":"September 17, 2012 at 5:42 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16418","author":"Ron","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Furthermore to Matthias’s last comment and to the RadioCarbon Dating; You seem to misunderstand my point and the FACT that radiocarbon dating, even if all precautions are followed, can still give erroneous results! Especially when the provenence of an article is ‘unknown’, as is the case with the Shroud. RCdating alone cannot and should not EVER be relied upon as a reliable final conclusion.\nThis huge mistake was made back in 1988-89 and people fell for the media hype on the reliance of Radiocarbon dating….Lets not fall for it again.\nI truly believe, the Shroud is far too contaminated to be reliably tested, at our current level of technology. Not all probabilities of contamination can be addressed or even contemplated and although AMS type radiocarbon dating has seen improvements over the years, it is not so with contamination issues.\nR\n\n","date":"September 17, 2012 at 6:01 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16421","author":"Ron","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Ron, I agree with you 100%.\n\n","date":"September 17, 2012 at 6:07 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16422","author":"Gabriel","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Btw, there are a couple of other ways to fold fours times the Turin Sindon so as to have the face imprint on top of the cloth folded in 8 layers…\n\n","date":"September 17, 2012 at 5:47 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16419","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Typing error (getting really late : ( to keep tje face imprint on top of the cloth equally folded in 8 layers…\n\n","date":"September 17, 2012 at 5:53 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16420","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"This is very true Max, and something else must be understood; These four foldings do not necessarily need to be of equal length foldings…I believe we both touched on that Max, in the last discussion on the tetradiplon issue.\nR\n\n","date":"September 17, 2012 at 6:13 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16423","author":"Ron","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Check out the web-page at: http://greatshroudofturinfaq.com/History/Greek-Byzantine/Abgar/tetradiplon.html\nThere are three folds but it works as a power series thus:\nOne fold = Two layers; Two folds  = 2 x 2 = 4 layers; Three folds 2 x 2 x 2 = 8 layers.\nThere will then be seven fold-marks occurring at the one-eighth points as asserted by Jackson. [He was unable to identify all seven, but some fold-marks were identified at the one-eighth points.]\nEight layers = Four doubled = tetradiplon!   Q.E.D.\n\n","date":"September 17, 2012 at 10:12 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16431","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Correction second para above: “There are three foldings, First folding gives two layers, one fold-mark; Second folding gives four layers, three fold-marks; Third folding gives eight layers and seven fold marks.  It works as a power series thus (Etc)\n\n","date":"September 17, 2012 at 10:16 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16432","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Rakos tetradiplon = a piece of rag folded in FOUR = a piece of rag folded in THREE successive foldings and EIGHT layers Q.E.D. ???????????!!!!!!!!!!!!!!!!!!!!!!!!!!!\nWhat makes you so sure the word ‘tetradiplon’ used as a quallificative adjective puts the emphasis on the result (2x2x2 = 8 layers) and not on the folding process (folded in four successive foldings)?\nWhat makes you so sure the Greek word ‘tatradiplon’ used as a qualitative noun cannot ALSO read 4 times 2 (Assyrian royal cubit long) x 2 (Assyrian royal cubit wide) = 444,8cm x 111,2cm = a size TOTALLY consistent with BOTH that of a ‘himation’ worn next to the skin as work wear or evening/night wear (i.e. ‘achiton’) for a 5ft 8″-6ft 2″ tall man and that of the Turin Sindon and the Turin Sindon Man’s height)?\n\n","date":"September 18, 2012 at 6:13 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16445","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Max, that’s a fairly big cubit you’re using there 55.6cm.  The most commonly used cubit derived from ancient Egypt about 3000 BC, and my source (Encyclopedia Britannica) says it pervaded the ancient world and survived into medieval times.  But there were several variations in its exact length.  An ordinary cubit is given as 45.7cm.  The royal cubit was 52.4cm and was standardised by a royal master black granite cubit.  Encyc Brit says in some ancient cultures it was as long as 53.1cm.  I tried checking out the Assyrian cubit but the website I wanted was down at the time.  If it’s 55.6cm as you say, then it seems an anomalously long cubit, granted that there seem to have been signficant Assyrian influences in first century Palestine, (Romans seem to have sometimes delegated governorship of Judea to  Assyria – I know this occurred during the inter-regnum of Herod the Great and Archelaus for example)  \nBut it seems to me that tetradiplon does not convey the meaning of length units.  Very likely the cloth was of Assyrian provenance, and so a whole number of Assyrian cubits might well be expected in its dimensions.  If only the length is being stated, why not use the word octo instead of tetradiplon? \nThe formula I came up with above was in line with other attempts to reproduce the foldings such as those on the web-site I quoted.  My “Q.E.D.” was in respect of apparent confusion of how three foldings could produce eight layers, which I endeavoured to elucidate.  \nI also note that Jackson’s video (doesn’t seem to be on the web any longer) distinctly showed a fold-mark at the one-eighth point from the centre, which I thought seemed very significant, and supported the view that the Shroud was at one time very likely folded into eight layers.\n\n","date":"September 18, 2012 at 8:05 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16453","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Dave, t\nThe Assyrian short (common) cubit is definitely not the Assyrian royal (long) cubit.\nif we fold the Turin Sindon in four, there are ALSO a couple of different ways to keep the facial imprint on top of a cloth equally folded in eight layers. All this is a false problem.\n\n","date":"September 18, 2012 at 8:37 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16459","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Max: “if we fold the Turin Sindon in four, there are ALSO a couple of different ways to keep the facial imprint on top of a cloth equally folded in eight layers. [All this is a false problem.]”\nI think there are at least five different ways of folding the cloth lengthwise into a 2 x 1 cubits package, keeping the facial image on top with seven fold marks in the cloth.\n1) Repeated doublings, 3 foldings;\n2) One doubling fold, followed by accordian / concertina type foldings;\n3) One doubling fold followed by spiral type foldings with the feet images innermost;\n4) & 5): At least two combinations of these, possibly more. \nOf these five possibilities, (1) seems to interpret the word “tetradiplon” best to my way of thinking.\n\n","date":"September 18, 2012 at 6:09 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16487","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Dave,\n What makes you so sure your opinion was shared at least 14-15 centuries ago by the individual who ‘did fold in four’ the long linen cloth? \n  Most curiously the “couple of different ways to keep the facial imprint on top of a cloth equally folded in eight layers” (with fringes/tasselst to be top and bottom/letf side and right side entwined to nails) I was thinking are totally different from the five different ways you have thought of…\n\n","date":"September 18, 2012 at 6:41 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16490","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Yet another possible way of folding the Shroud is:\n6) Two spiral-like foldings commencing at each end, and one final fold at the centre.\nI think that any other possible folding mechanism can only be a combination of 1, 2 , 3 and 6.  I suspect thsi exhausts the possibilities.  But exactly how it was folded can only be conjecture, unless more evidence on the folding mechanism comes to light.\n\n","date":"September 19, 2012 at 5:00 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16499","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"I also note that Jackson’s video (doesn’t seem to be on the web any longer) distinctly showed a fold-mark at the one-eighth point from the centre, which I thought seemed very significant, and supported the view that the Shroud was at one time very likely folded into eight layers.\n*****Did you try the Wayback Machine, as Dan mentioned on another post?  \nhttp://archive.org/web/web.php\nYou may or may not be able to access Jackson’s video at that site.\n\n","date":"September 22, 2012 at 2:23 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16753","author":"Angel","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"If one HONESTLY tries to put together all the philological, iconographical and literary pieces of the Image of Edessa puzzle (without discarding any), in all likelihood, the acheiropoietic image consisted of two material objects: Yeshua’s facial imprint on the relic of the Himation/Sindon (bearing not only Yeshua’s face but also his full-length body imprint on a long rectangular cloth four times longer than wide kept folded in four successive folding mounted on a long-squared frame with a vast central opening) and, PLACED OVER IT, the icon-relic of the Mandylion (bearing Yeshua’s ingeniously painted face on his nearly square burial small face cloth of fine transparent byssus).\nThe two material objects were seperated as two distinct material objects later i.e. after they were translated to Costantinole in 944.\n\n","date":"September 18, 2012 at 8:29 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16455","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Mistyping: In all likelihood, the relic and relic-icon were seperated as two distinct material objects later i.e. after they were translated to Constantinople in 944.\n\n","date":"September 18, 2012 at 8:40 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16461","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Mistyping: the philological, iconographic and literary pieces of the Image of Edessa puzzle\n\n","date":"September 18, 2012 at 12:41 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16467","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"This is a reply to M. Freeman’s comment #26 (https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/#comment-16464)\nThe comment of M. Freeman is very clever !  Effectively, WELL AFTER the story of the tetradiplon and the miraculous imprint of the FACE (not the body, just the face) of Jesus on the cloth, in a complete different part of the manuscript of the Acts of Thaddeus where Thaddeus is teaching King Abgar about the Christian doctrine, here’s what Thaddeus said to the king : “And on the third day before dawn He rose, leaving His burial-clothes in the tomb.”\nI’m sorry but this reference to the burial clothes (in the plural) of Jesus in the tomb have NOTHING TO DO with the tetradiplon cloth bearing the image of only the face of the LIVING Christ !  I’m a bit mad against myself for having completely forgotten to add this great FACT in my paper against Wilson.  Thank you M. Freeman for having bring this up !!!\nOf course, Wilson don’t say a damn word about that part of the text because it’s evident that it would destroy any credibility in his hypothesis versus the tetradiplon cloth !!!  It’s incredible how this person is doing bad history in order to defend at all cost is hypothesis…  THAT’S NOT THE WAY GOOD HISTORICAL RESEARCH IS MADE !\nThis later reference to the burial clothes (in the plural) plus the fact that the story of the tetradiplon cloth is located during Christ ministry when he was alive and well and only wash his face with the cloth is well enough to understand that the author of the text NEVER intend to link this tetradiplon cloth to the Shroud of Christ !  \nTo conclude, may I suggest to Ron, Max and all the others who defend Wilson’s ideas (or part of his ideas) to read again (or read for the first time) the reflection I wrote yesterday and that you find here: https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/#comment-16411.\nI’ll say it again : There’s no rational way to explain why this author would have made an unclear reference to the Shroud by using this term “tetradiplon” while he would have completely avoid to make also a reference to the presence of bloodstaind and of a complete body image (front and back) of Jesus on the cloth and to clearly say that Jesus wiped his face with his burial Shroud !!!\nAnyone honest about this whole issue must read carefully the entire text of the Acts of Thaddeus and if he do this, no doubt that this person will come with the same conclusion than me and M. Freeman (and any credible Byzantine historian) is defending versus Wilson’s hypothesis of the Mandylion !  This idea that the word tetradiplon has something to do with the Shroud of Turin is the best example of a very wild and bad extrapolation and speculation made by Wilson to defend his idea AT ALL COST and you’ll NEVER see me defending such a craziness (even if I believe the Shroud is genuine) !\n\n","date":"September 18, 2012 at 1:01 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16468","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Yannick (and Mr Freeman)\nWith all due respect, I think you are missing something very important here.\nThere is in fact no problem with the fact that the legendary account refers to both the tetradiplon and the burial clothes – let me repeat, no problem.\nLet’s go back to first principles. Please put your prejudices aside, and assume for the moment that the Image of Edessa WAS in fact the Shroud, folded in a manner that only displays the image of the face.\nAssuming that, then it makes perfect sense that the legend would seek to explain the creation of that image in the way that it does.And furthermore, if we continue with the assumption that the Image of Edessa WAS the Shroud folded, we should also note that the balance of the shroud image beyond the face was hidden for a reason/s, which may have included the inappropriateness of showing Jesus’s naked, tortured body.\nThen, if the public / vast majority was not aware of the shroud that lay folded beneath the facial image, then in terms of conventional wisdom the Image of Edessa was not the shroud, and was not the burial clothes of Jesus – therefore we logically conclude that there is no logical tension in the legend from the perspective of a hypothesis suggesting the Image of Edessa WAS the Shroud.\n\n","date":"September 19, 2012 at 4:20 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16497","author":"Matt","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"It’s you Matt who miss something here !  There’s a lot of eye witnesses who made also a clear distinction between the Shroud of Christ (or burial cloths in the plural) and the Mandylion in Constantinople !  That says it all…  Read my comment #65 please (it’s down in this same page).\n\n","date":"September 19, 2012 at 1:05 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16516","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Thanks Yannick. I acknowledge your point of view, and acknowledge it MIGHT be right. But I don’t think you can dismiss my own / others explanations or views on this matter which I think are equally as likely (the fact is I think it would be hard to definitely prove either way on the current evidence) . \nYour piece from July 2012 refers to a record that demonstrates that a Mandylion and burial shroud existed in Constantinople amongst a number of relics in the 11th century. Your piece clearly states that the records show that the mandylion was a painting.\nAlthough there is some ambiguity, the historical records suggest that the Image of Edessa was a faint, ghostly image, hence the legend that explained the formation of the image as\nbeing generated by Jesus pressing his wet face into the cloth.\nI think a solid argument does exist to suggest that the Mandylion may have been a painting of the Image of Edessa, and if this is the case then there is no tension in the legend as I argue above.\n\n","date":"September 20, 2012 at 12:41 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16547","author":"Matt","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"YC, \nHow long will you as a geograph, and Freeman as a so-called conventional historian, take a legend/Abgar legends at face value? Are you kidding? How long will you selfservingly keep discarding several pieces of the Image of Edessa philological, iconographic and literary puzzle just because they don’t fit with your aprioristic view and still think you’re ‘honest about the whole issue’?\n\n","date":"September 18, 2012 at 1:54 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16469","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"It is Wilson and his followers who take legendary stuff at face value, not me.\n\n","date":"September 18, 2012 at 2:44 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16470","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"YC, \nAre you still kidding? You (and Freeman) are taking at face value the legend of a face imprint of the LIVING Christ left on a towel!\n\n","date":"September 18, 2012 at 3:05 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16473","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Said as he puts foot in mouth ;-P\nR\n\n","date":"September 18, 2012 at 6:09 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16486","author":"Ron","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Little reminders of my own archaeo(crypto)logcal findings:\n1/ (1994 & 1998) a vast nimbus-like shaped light discoloration all around the Turin Sindon face can be detected not only on high contrast enhanced orthochromatic, traditional silver & extensive digital Sindon overall photographs but also in situ cathedralis torinensis by standing at a distance between 15 to 30m away from the relic. (confirmed by Israeli botanist, Avinoam Danin)\n2/ (2010) a short portion decal of a text in Nestorian type of Syriac script can be detected on the area just below the beard (from digitally contrast enhanced 1978 Schwortz Turin Sindon face photograph). This faint writing should be futher investigated in the light of Yeshua’s (apocryphal) letter to King Abgar’s.\n3/ (2010) a himation as sindon is more than 4m long x 1m wide for a man 5’8″-6’2″ tall (eactly 4,20m long x 1,40m) and can be worn as an achiton/sindon (evening-night wear or work wear won next to the skin). This is consistent with the size of the Turin Sindon (about 440cm log and about 110cm wide) & Turin Sindon Man’s height (about 6ft tall), three Late Antique versions of the Abgar legend and non legendary accounts of Yeshua’s whole body imprint left/seen on a cloth.\n\n","date":"September 18, 2012 at 3:00 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16471","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Mistyping: and several non legendary accounts\n\n","date":"September 18, 2012 at 3:01 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16472","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"I’m sort of surprised by Matthias description of Stephen Jones folding as strange. If you actually tried it (I did with a large bath towel), its actually very easy. But what I noticed, if it was folded this way, you might have to hold it together by stitches both to the top and bottom of the folded form. However if you folded it as Dan’s original graphic there is no necessity to stitch the bottom as the folds contain each other and hold together at the bottom but not at the top.\nSo you’d expect for Dan’s folding, there be stitching at the top, but isnt strictly necessary for the bottom, whereas for the Jones approach you need to stitch both top and bottom. I noticed that the illustration of Agbar has diagonal tassels at the bottom which might be due to stitching. I cant notice any at top but they would not be visible if you were doing a perspecitve view.  I also noticed that the image of the fresco show some sort of folded image (I’ve put the horrendously long link below), which seems to show very faint diagonal tassels as well at least at the bottom ( I’m not sure what the hell’s going on at the top, but I note that the sides seems to attempt to show some sort of folding…you got to zoom in to see it.)\nI also remember that there was another image of Emperor Romanus being given some sort of cloth with a head image also with tassels (at top this time, not sure at the bottom). So the Jones’s folding has a slight evidential advantage.\nI’m not sure what the Acts of Thaddeus are but I’m sort of perplexed that they being taken either verbatim or as complete nonsense. Now I’m not a historian, I’m a physicist, but I could imagine that the imagination could play a fair part you are  describing how an image might have gotten onto a cloth 400 years previous, but you might be a bit more precise about the foldings if the cloth were there to be viewed.  So I find it strange that Charles seems to say the tetradiplon description is rubbish much like the confused hearsay sequence of how the image  got on there. One is hearsay, the other you might be able to verify. Forgive me Charles if I’ve interpreted you wrong. \nAs a scientist  I’m more biased to believe the C14 dating, but I got to admit there are many puzzling bits of counter evidence that make me put a question mark to my certainty ….The history of science is one of change when the evidence speaks loud enough. There are so many tantalizing bits of “half evidence”, that I cant quite accept completely, no dismiss readily. I’ve got to say, you couldnt quite make up the twists and turns in the unfolding story of the evidence – there’s been no knock down argument either side (unless you include the C14 but even then I’m curious as to the spread of the 3 different dates from the different labs, as you start to wander into  3 sigma territory ). \nhttp://www.google.com/imgres?imgurl=http://img442.imageshack.us/img442/8884/redman.jpg&imgrefurl=http://deumvidere.blogspot.com/2012_06_01_archive.html&h=420&w=646&sz=83&tbnid=y2t_N2M3T2qZAM:&tbnh=77&tbnw=118&prev=/search%3Fq%3DThe%2BImage%2Bof%2BEdessa%2B(11th%2Bcentury),%2BSakli%2Bchurch,%2BGoreme,%2BTurkey%26tbm%3Disch%26tbo%3Du&zoom=1&q=The+Image+of+Edessa+(11th+century),+Sakli+church,+Goreme,+Turkey&usg=__mGVC_0Y1apBGr5g-Od5M56xmdF4=&docid=KkCdUjcAys1L3M&itg=1&sa=X&ei=BsxYUMS5EYnOhAeO4IGwDA&ved=0CCQQ9QEwAQ&dur=432\nhttp://www.google.com/imgres?q=emperor+romanus+shroud&um=1&hl=en&client=safari&sa=N&rls=en&biw=2171&bih=1201&tbm=isch&tbnid=R5z4pDiIRpDAIM:&imgrefurl=http://shroudofturinnews.com/documented-proof-of-shroud-of-turin/&docid=lAkn95HXYr9BlM&imgurl=http://shroudofturinnews.com/wp-content/uploads/2011/08/Shroud-passed-to-Emperor-Romanus.jpg&w=274&h=184&ei=BNVYUOvsDNSyhAfE7oGoCw&zoom=1&iact=hc&vpx=206&vpy=179&dur=599&hovh=137&hovw=191&tx=117&ty=68&sig=108957755986079293482&page=1&tbnh=130&tbnw=174&start=0&ndsp=91&ved=1t:429,r:0,s:0,i:75\n\n","date":"September 18, 2012 at 4:44 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16479","author":"ArtScience","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"edit: “no dismiss readily” should be “nor dismiss readily”.\n(start to understand a little of where Max’s manic editing comes from!)\n\n","date":"September 18, 2012 at 5:01 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16481","author":"ArtScience","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"ArtScience ‘I find it strange that Charles seems to say the tetradiplon description is rubbish much like the confused hearsay sequence of how the image got on there.’\nNo Art Science, i have never said that ‘tetradiplon’ was rubbish. It is a strange word and it needs an explanation as to why the author of the legendary Acts of Thaddeus used it. \nFirst one must clear the decks.1) Tetradiplon is ONLY used of the cloth when it was handed to Jesus.\n2) Wilson is misleading in The Shroud (2010), p. 190, when he suggests that the word tetradiplon is used to describe the cloth AFTER Jesus had wiped his face on it. Whatever the reason or motives for his ‘mistake’, Wilson has confused many people on this. \n3) The Acts of Thaddeus, if read in full, make it quite clear that the author distinguishes between the cloth on which Jesus wiped his face ( the tetradiplon cloth, if you like) and the burial cloths of Jesus that are described separately as being in the tomb AFTER the face cloth had already arrived in Edessa.\nTHIS MAKES ALL THE DEBATES OVER HOW THE TURIN SHROUD MIGHT HAVE BEEN FOLDED REDUNDANT. It had to be folded somehow to preserve it when not on display and it could have been folded in all different kinds of ways over the centuries of its life, probably different ways at different times. What seem to be happening here is people seeing folds that fit in with a tetradiplon folding when the word tetradiplon was never applied to the burial cloths in the tomb\nSo we come back to why the word tetradiplon was used of the cloth when it was handed to Jesus. One guess, that I explore in my Tetradiplon Revisited ( which comes up as about number six if you put in the word ‘tetradiplon’ into Google),  is that the author wanted to give a special status to the cloth that Jesus chose to wipe his face on. We know from festivals such as the Athenian Panathenaia  that a peplos was specially woven, then folded (see the illustration in my article) and then handed over to be placed on the statue of Athena. There is some evidence that in Christian times a similar ritual was carried out for the pallium given to bishops.It was originally handed over as a folded piece of cloth but, eventually instead of a folded rectangle, the bishop was given a simple strip, So it is not impossible that a similar ritual was in the mind of the author of the Acts of Thaddeus. He simply wanted to embellish the legend a bit and he may have been aware of ceremonies in which folded cloths were handed over BEFORE they were used in a ceremony. I leave this suggestion open but it is a line of enquiry that better fits the existing evidence than anything that looks at folded burial cloths.\n\n","date":"September 21, 2012 at 4:19 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16641","author":"Charles Freeman","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"For the sake of completeness, however, it should be noted that if the Greek word ‘tetradiplon’ puts the emphasis on the result (and not the folding process), then it should be translated ‘folded in four (layers)’. In this case, it could have referred to a long linen towel/washcloth folded in 4 layers to either form a square (2 (Assyrian royal) cbt x 2 (Assyrian royal) cbt) or a rectangle (4 Assyrian royal) cbt long x 2 (Assyrian royal) cbt wide) and be used only for one’s face or on one’s entire body.\n\n","date":"September 18, 2012 at 5:39 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16482","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Mistyping:  a rectangle (4 Assyrian royal) cbt long x 1 (Assyrian royal) cbt wide).\n\n","date":"September 18, 2012 at 5:46 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16483","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"\nYannick Clément :Ronny, all I hear from you is close-minded comments that goes against every credible Byantine scholars. I don’t have anything more to tell you… What else can I do ? You choose to believe blindly in Wilson’s poor and something falacious arguments. Good for you.\nI haven’t heard anything in the least ‘credible’ from whomever you may mean by “Credible Byzantine scholars” as yet, just the same regurgetations as you yourself and Freeman have been spewing for what seems like an eternity on here. In these I will add, I find many self-interpretations and speculations as well…\nAs to Mr Freeman; I will not repeat my counter points or addresses, which have easily countered several of your and Yannick’s arguments. I am not in the habit of repeating myself (usually) but have been forced to on this blog, far too often I may add and due to some having very closed minds!You can search back in the posts, if you wish, and you will find my remarks. I will not endlessly repeat the same arguments here constantly, as YC seems to enjoy doing with so much vigor.\nMoreover, I am quite sure I am not alone on this matter, as I’ve noticed several others here have made their own logical and reasonable counter-points to what you and Yannick have been asserting…and have themselfs, noticed their arguments have been IGNORED also! I’m sure they are getting as sick of repeating themselfs as I am, especially noting their attempts are falling on deaf ears.\nR\n\n","date":"September 18, 2012 at 5:59 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16485","author":"Ron","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Neither Yannick Clement nor Charles Freeman have ever succeeded in explaining the appearance of the 15 Vignon markings as found on the Shroud image showing up on the various icons and coinage, notwithstanding Davor Aslanovski’s parody of these on his website.  Yes, the model for these may have been taken from some original template, whether or not the Mandylion was a separate object.  Clearly the Shroud facial image provided the original template, whatever other copies of it may also have been used,  It suited the artisitic conventions and theological emphases of the time to show a living and triumphant Christ without blodd-stains rather than the actual appearance of the very dead TSM.  They will have to explain how the Vignon markings appeared on these copied images.\n\n","date":"September 18, 2012 at 6:26 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16489","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Freeman wrote: \n“As the Image of Edessa was NEVER the Shroud of Turin in the first place, we do not need Ian Wilson’s elaborate explanation (p.190 ff.) of how the Shroud, as we know it today, could be folded into four! (“The Image of Edessa and the Turin Shroud: a misguided journey”)\nThen in this blog he wrote: “we have to live with ‘best fits which are always PROVISIONAL and CAN BE CHANGED as new documentary/archaeological evidence emerges. That’s my world and the world of most practising historians.”\n‘\nUnless of course, ‘NEVER’ means PROVISIONAL’, It does seem Freeman’s unscholarly dogmatic pratice is rather at odds with his ideal self-portrait as a conventional practising historian and History’s true openness to be challenged and re-examined.\n.\n\n","date":"September 18, 2012 at 6:19 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16488","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"In order to emphasize the important argument of M. Freeman and to drive the nail more deeply into the coffin of Wilson’s hypothesis of the Mandylion, I truly suggest to anyone’s interested by the subject to read the facts 9 through 16 that you can find in my paper about this hypothesis (here’s the link to read this paper of mine : https://shroudofturin.files.wordpress.com/2012/06/clc3a9ment_questions-about-the-mandylion-hypothesis-of-wilson_2012-06-28.pdf).\nYou will see that beside the Acts of Thaddeus, there are numerous ancient texts (some of them written by eye witnesses) that contain a reference to both the Mandylion AND the Shroud of Christ (or the burial cloths of Christ), which clearly indicates that these 2 cloths were considered by these authors as being 2 different relics associated with Christ. These references are truly important in this debate and cannot be explained rationally and without using very wild speculations if the Mandylion was in fact the Shroud folded in 8 equal parts showing only the face of Christ.\nBelieve me, if my long research on the subject would have convinced me that Wilson was right, I would have been very pleased to write a paper defending strongly his point of view but that’s ABSOLUTELY NOT THE CASE. My paper contain 22 very problematic facts regarding Wilson’s hypothesis and since that time, I have found 2 more : \n1- The fact that was first mentioned by M. Freeman recently concerning the separate mentions of the Image of Edessa (a.k.a. the Mandylion) and the burial cloths of Christ by the author of the Acts of Thaddeus proving that he never intend to use the term “tetradiplon” to describe a burial cloth used by Jesus to wipe his face.\n2- The fact that after the arrival of the Mandylion in Constantinople (and the so-called “discovery” of his burial nature by Gregory Referendarius and possibly by some members of the emperor’s court), there is ABSOLUTELY NO WRITEN MENTION ANYWHERE stating clearly and specifically that the Mandylion was in fact a shroud (or a burial cloth) of Jesus-Christ directly related with his Passion and death and we can see that all the Byzantine authors of that era were changing the word “sindon” that we find in some earlier accounts of the Abgar legend to other generic terms meaning a simple (or even a cheap) cloth.\nSo, right now, I have 24 facts to put in Wilson’s face that are all very problematic regarding his hypothesis.  Having said that, I just want to leave you with this simple question :  WHAT DO YOU NEED NOW TO UNDERSTAND THAT THIS HYPOTHESIS IS MOST PROBABLY (I WOULD EVEN DARE TO SAY SURELY) INCORRECT ???   \nI’m sorry but we don’t have any other choice than to look elsewhere to find a better and more rational explanation for the obscure history of the Shroud…\n\n","date":"September 19, 2012 at 8:27 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16506","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"One last comment :  I think every person who have bought a book of Wilson and believed in his Mandylion non sense should have the right to return it back to him in order to get a refund…  I’m truly sorry for these person because most of them don’t know much about history and have been filled with crap by Wilson about the Shroud’s obscure years.  And the worst thing about that is the fact that this same crap have been taken over by other pro-Shroud writers over the years.  In my mind, this propaganda over the Mandylion is one of the worst thing that ever happened to sindonology because it has been an important factor that has contributed to destroy his credibility in the mind of a good portion of the scientific community.\nIt would be exactly the same thing if the Catholic Church would hire Dan Brown to do a new version of his Catechism !  For the Church, what credibility would be left at the end of this process versus the true theologians ?  My friend, it’s exactly the same thing that’s going on for years in the Shroud world with Wilson and his crazy ideas…\n\n","date":"September 19, 2012 at 10:39 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16508","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Yo no he leido a Ian Wilson.\nHe emprezado a leer su artículo:\n“Many questions concerning the Mandylion hypothesis proposed by Ian Wilson !!!”\n¡Y he tenido que PARAR la lectura en el Fact #1!\n“Fact #1 : Every known reproduction of the Mandylion ALWAYS represent a living Christ with his eyes wide open and without any signs of injuries, bruises or bloodstains. The most important thing to note is the fact that many of them were done during the time the relic was kept in Constantinople and publicly showed at least once a year, from 944 until 1090 (at least). Many of these copies were probably done by artists who were able to see the relic with their own eyes, or at least, who were able to get precise information about his physical aspect from eyewitnesses who had seen it in Constantinople. But despite that fact, absolutely none of these copies that have survived until this day represent a bloody and beaten Christ, easily associated with his Passion, the way we see it on the Shroud of Turin. If Wilson’s hypothesis is correct, WHY is this so ???”\n¡Qué confusión!\nUsted, Freeeman, etc, etc, CONFUDEN leyendas, interpretaciones, textos, iconografía etc, etc, etc \n1.-¿Recibió la ciudad de Constantinopla el Mandylion en el 944?.\n-SI\n¿Vió Gregorio Referendarius el Mandylion cuando escribió su discurso?\n-SI\n¿Vió Gregorio Referendarius pigmentos o colores pictóricos en el Mandylion?\n-NO\n¿Vió Gregorio Referendarius manchas de SANGRE en el Mandylion?\n-SI\n-¿Vió Gregorio Referendarius manchas de SUDOR en el Mandylion?\n-SI\nERGO el MANDYLION que recibió Constantinopla el 944 y vió Gregorio Referendarius NO ESTÁ REPRESENTADO por la ICONOGRAFÍA DEL MANDYLION.\n2.- En el SUPUESTO de que el ROSTRO del Mandylion hubiera sido el ROSTRO de la Sábana Santa, en el Mandylion-Sábana:\n– NO se puede advertir si los OJOS están abiertos o cerrados ( sólo en el NEGATIVO fotográfico se advierten CERRADOS)\n– NO se puede advertir si el ROSTRO representado está VIVO o MUERTO\n– El icono bizantino es ATEMPORAL y sujeto a leyes estrictas incluso sobre el COLOR, proporción, etc,etc\n– El artista bizantino NO tiene recursos pictóricos para realizar un ICONO  sólo con pigmentos representando SUDOR y pigmentos representando SANGRE. (al igual que sucede HOY con los frustados intentos de REPRODUCCIÓN)\n– El icono bizantino NO PODRÍA REPRESENTAR lo visto por Gregorio Referendarius.\n– ERGO los iconos del Mandylion NO REPRESENTAN LA REALIDAD del  Mandylion, son una INTERPRETACIÓN  de esa realidad, y como toda interpretación, sujeta a ERROR.\n3.- SOLUCIONE esos pequeños problemas, Yannick.\nCarlos Otal\n\n","date":"September 19, 2012 at 12:48 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16511","author":"Carlos Otal","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"If the Mandylion would have been the Shroud folded in 8 Carlos, you would not get all these ancient texts written by different writers (some of them were eye witnesses of the relics in Constantinople) that make a specific difference between the Shroud of Christ (or his burial cloths in the plural) and the Mandylion !!!  Also, meditate on that :  There’s not even one single ancient source that make a specific link between the Mandylion and a burial shroud used for Christ !!!  It’s completely the opposite in fact since many text make a specific mention of the burial cloth(s) of Christ while mentioning also the Mandylion but never in the same list of relics associated with the Passion.  I have nothing else to add.\n\n","date":"September 19, 2012 at 1:02 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16514","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"…Y es evidente que Gregorio Referendarius está hablando del Mandylion como una imagen MONOCROMA, “embellecida” con la sangre del Señor.\nCarlos Otal\n\n","date":"September 19, 2012 at 1:14 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16518","author":"Carlos Otal","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Even Guscin (who is more or less pro-Wilson concerning his Mandylion hypothesis) doesn’t agree at all with this interpretation that was defended by Dubarle, Scavone and other pro-Shroud researchers.  And if Referendarius would really have detected the secret burial aspect of the Mandylion when the relic arrived in Constantinople and he would have made a preach about it, don’t you think seriously that no Byzantine writers would have talk about this great information regarding the Mandylion after that ???  You think that Referendarius would have speak about it once and then, nothing, no word at all in all the subsequent writing that talked about this relic ?  Seriously, this is ludicrous.\n\n","date":"September 19, 2012 at 3:52 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16524","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":".-He referido un SUPUESTO Mandylion- Sábana, no he afirmado su identidad, porque se dan SIMILARES circunstancias de dificultad para advertir en el ROSTRO si los ojos están abiertos o cerrados y si corresponde a un vivo o a un muerto…….\n.- Lo que  DIFICULTARÍA la interpretación de la imagen que pudiera hacer Gregorio Referendario.\n.- Lo que DIFICULTARÍA todavía más la interpretación artística\nUsted ESCAPA o HUYE de lo que yo he ARGUMENTADO.\nEL ARGUMENTO:\n.- El Mandylion que vió Gregorio Referendario NO ESTÁ REPRENTADO por el Mandylion de la iconografía.\n.- El Mandylion que vió Gregorio Referendario, era MONOCROMO embellecido con SANGRE …..y  NO ESTÁ REPRESENTADO por el Mandylion de la icongrafía ( ¿dónde esta la sangre?)\n.- Y esto es lo PRIMERO que necesita una EXPLICACIÓN o una ACEPTACIÓN.\nSi lo que es EVIDENTE no se acepta, todo lo demás que se argumente es un  bla, bla, bla, bla,……. que no conduce a NADA.\nCarlos Otal\n\n","date":"September 19, 2012 at 2:02 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16521","author":"Carlos Otal","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Another thing to bear in mind is that in the story about the Jesus’ face appearing when he wiped it with a towel, is that perhaps it was also an attempt to explain why the eyes appear shut (as you do when you wipe with a towel).\nNowadays most face cloths have a thickness to aid absorption – might an 8 folded cloth stitched together be seen as an attempt at a towel?\n\n","date":"September 19, 2012 at 2:06 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16522","author":"ArtScience","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"good point :)\n\n","date":"September 20, 2012 at 12:43 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16548","author":"Matt","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"ArtScience:\n1.- Estoy de acuerdo y es lo lógico, los ojos se cierran cuando se acerca a la cara una toalla por reflejo……y para limpiar los párpados\n2.- Una toalla puede tener un gran tamaño.\nLa iconografía de Jesús lavando los pies a sus discípulos suele mostrar toallas de gran tamaño.\n– “…..4 He riseth from supper, and laid aside his garments; and took a towel, and girded himself. 5 After that he poureth water into a bason, and began to wash the disciples’ feet, and to wipe them with the towel wherewith he was girded.” John 13:4-5.\n– un fresco de Pompeya muestra una toalla de gran tamaño que podría servir como hymation.\nEn ambos ejemplos podría la toalla doblarse en 8 paneles perfectamente.\nCarlos Otal\n\n","date":"September 19, 2012 at 10:08 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16541","author":"Carlos Otal","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"On the other ‘hand’, if the legendary cloth Yeshua supposedly used to wipe his face was a transparent fine byssus,  it may account for the facial imprint to have been recorded/ingeniously painted with no indication of a neck and with eyes appearing… open.\n\n","date":"September 20, 2012 at 4:45 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16557","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Carlos’ comments on the foot-washing may well be significant.  It is interesting that this account only occurs in the Gospel of John, wherein a subtext often seems to be present.  Albert Dreisbach presented a paper on Lazarus and Jesus at the Dallas conference, and made some fascinating comparisons, interpreting the Lazarus story as an oblique reference to Jesus burial and resurrection, with allusions to the Shroud.  The Lazarus story also occurs only in John. \nYannick Clement and Charles Freeman are still strangely silent on the appearance of the Shroud’s 15 Vignon markings showing up in early Byzantine iconography, regardless of whether or not the Shroud and Mandylion were the same or distinct objects.\n\n","date":"September 20, 2012 at 4:53 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16558","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Daveb\nAlthough on balance I consider the Shroud is most likely the authentic burial Shroud of Jesus  whom I consider Lord, I must say I remain totally unconvinced by the Vignon marking argument.\n\n","date":"September 20, 2012 at 6:04 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16560","author":"Matt","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"actually I’ll go further and call the Vignon markings a joke that actually undermines the reasonable credibility of the pro-authenticity case:\n:\n\n","date":"September 20, 2012 at 6:17 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16564","author":"Matt","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"You may call the Vignon markings whatever you like, but they’re hardly a joke, and I might presume that you merely took at face value Davor Aslanovski’s parody of them, which does them no justice at all.  Such curt dismissal does not make a cogent argument.  I note an earlier posting where you seem prepared to speculate that the Shroud and Image of Edessa were one and the same object, and that the Mandylion may have been a painting of the Edessa.  That might well be the case.  Vignon identified 15 distinct features that appeared regularly on both coinage and icons beginning from the 6th C, some making little artistic sense.  These 15 features all appear on the Shroud.  That has to be significant!  The Shroud facial image was clearly known by at least a select few who very likely used it for their template to create living and triumphant Christs, beginning at the 6th C, regardless of wherever the Shroud was at the time, but they all seem to radiate out from Edessa.\n\n","date":"September 20, 2012 at 7:19 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16568","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Daveb\nI think the Vignon markings deserve parody, and as I say they do the pro-authenticity argument a  disservice.\nI don’t know where to start, but I’ll try.\nFirstly, it needs to be acknowledged that Byzantines of course only viewed the faint facial image on the Shroud, not the negative photographic image.\nI can’t for the life of me see how Byzantine artists might have made out features such as the so-called enlarged left nostril on the Shroud – I can see no such thing, nor for the that matter anything resembling an enlarged left nostril in Byzantine artwork. The so-called flecks of hair on the forehead at the hair parting?  – sure there is a slightly darker marking in this area, but its highly “imaginative” to read these as flecks of hair. Raised eyebrow? Again, just don’t see it. Forked beard and moustache? So what? Such facial hair features were common\nI could go on and on.\nWhilst I am with you on the authenticity of the Shroud, in my opinion the Vignon markings are a joke.\nThis is just my view, for what its worth.\n\n","date":"September 20, 2012 at 8:07 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16571","author":"Matt","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Nevertheless the Vignon markings clearly visible on the Shroud negative also regularly show up on the early iconography.  A few of these, such as the transverse line across the throat, seem to be properties of the cloth only and not just the image of the subject.  Some others originate from the punishment inflicted, so that whatever was the original source for the iconography, it had to be either post-trial or post-crucifixion,  The Shroud facial image seems to be the only explanation for this.  The only other explanation could be a very similar second cloth impression, perhaps something like the Veronica,  This would then assert that there was something more to the legendary accounts of face wiping, Abgar etc, than might otherwise be admitted.\n\n","date":"September 20, 2012 at 4:51 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16613","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"In keeping with the theme: in DAL MANDYLION ALLA VERONICA Relazione di Massimo Centini, we can read:\n“il velo proveniente dal cimitero di Antinoe, in Alto Egitto: si tratta di un velo del 500 d.C., posto sul volto del cadavere di un cristiano. Oggi il reperto è scomparso ed è un vero peccato: il velo era ripiegato in quattro e su ogni lato riportava l’impronta del volto del cadavere; tre lati erano particolarmente visibili, mentre il quarto presentava un’immagine piuttosto frammentaria. Secondo il parere degli archeologi, la formazione dell’immagine sarebbe dovuta all’azione degli aromi usati per la sepoltura”.\nNow “ripiegato in quattro” can be renderd into Greek by “tetradiplon”…\n\n","date":"September 20, 2012 at 9:23 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16578","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"…ring some bell in the French Canadian geograph Yannick Clément and British Greek and Latin historian Charles Freeman?\n\n","date":"September 20, 2012 at 9:27 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16579","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Reminder: on July 3, 2012 at 12:02 pm | #33,  wrote:\n‘Writers (e.g., MARTIALIS Martial) used the Greek word sindon in Latin (sindon, sindonis) as early as the 1st century CE in accounts of very fine linen, silk and sea byssus veil. In 4th century CE Latin (e.g., Vulgata), the same word comes to also refer to the burial of Yeshua of the synoptic gospels (Matthew, Mark and Luke).\nThe  confusion between Mandylion (very fine byssus veil) and Sindon (Yeshua’s burial cloth) would then find here its philological, iconological and archaeological explanation.”\nOriginally and in all likelihood, the Image of Edessa consisted of two material objects: an ingeniously painted sea byssus veil (Yeshua’s burial face cloth bearing his reconstructed round face from faint markings?) covering the bloody fanstam-like facial imprint left on his long inner burial cloth the size and shape of a ‘himation’. The former image was exactly placed over the latter lest some observer could die from fear (in front of the facial image of the dead tortured Yeshua) and/or the acheiropoietic image could not be “presentable” as the emblem of the triumphant resurrected Christ.\n\n","date":"September 20, 2012 at 10:18 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16583","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"I would like to point out 2 more things to help your reflection about the great piece of evidence against Wilson’s hypothesis that was mentioned here by M. Freeman, i.e. that in the Acts of Thaddeus, in one part of the text, the author talk about the story of the miraculous imprint on only the fact of the living Christ and used the expression “sindon tetradiplon” to define the cloth on which the face was imprinted and in another part of the text, after the disciple Thaddeus had brought the miraculous cloth bearing the face of Christ to king Abgar in Edessa, he said to the kind that Jesus left his burial cloths (in the plural) in the tomb after his resurrection.\n1- The simple FACT that Wilson never said a damn word about this last part of the Acts of Thaddeus is a GREAT PROOF of his intellectual dishonesty. Ray Rogers always came back on this great scientific truth : to do a good scientific research (this is true for any kind of research including historical research), you MUST take into account ALL the facts and data that you can find (and not just the data that could be used to comfort your little preconceived idea) in order to follow properly the scientific method. Unfortunately, in the Shroud world, we constantly see researchers breaking this most important rule and in the case of Wilson, the fact that completely avoid to mention the reference to the burial cloths of Christ that can be found in the Acts of Thaddeus is just one great example of how bad he’s making historical research and how intellectual dishonest he really is. Sorry but you simply cannot left on the side important pieces of evidence like the burial cloths in the Acts of Thaddeus when you pretend doing an exhaustive research about the Shroud’s obscure years !  And as I said concerning the intellectual dishonesty, Wilson is not alone in his case !  Just another example of this :  In a recent paper about the Sudarium of Oviedo that she present at the recent Panama conference on the Shroud, Janice Bennett conclude by saying this : “X.”  Did you noticed that she completely avoid to mention one great piece of evidence concerning the cloth, i.e. that it was radiocarbon dated 2 different times (non authorized test) and the average middle date given by these analyses is 708 A.D.  Sorry but if you pretend to wrote a complete paper about the Sudarium (that was the goal of his paper) and you don’t say a damn word about that, it is call intellectually dishonesty or at the very least a total lack of competence. That’s exactly what Shroud science should avoid to gain some credibility in the eyes of the scientific community…\n2- The greek expression used by the author of the Acts of Thaddeus to describe the cloth is “sindon tetradiplon” which can mean a cloth double in four (but others translations are possible – see Guscin’s book The Image of Edessa).  Now, I never saw the greek expression used to describe the burial cloths in the tomb but because it talks about many cloths, you can bet your house that it’s not “sindon”.  I wonder if M. Freeman or someone else could give us the right greek expression that was used.  Anyway, because it is certainly not the same expression, you can see this as a very good literary clue which indicates that the author of this ancient text really wanted to make a clear distinction between the miraculous imprint of the face of the living Christ and these burial cloths.  Also, the fact that there’s absolutely no mention in the text about the presence of a body imprint on these burial cloths, on the contrary to the sindon tetradiplon cloth mentioned earlier in the text is another good clue to understand that these cloths were DIFFFERENT and that there was no relation between them. Also, the context of the text is quite clear about that : The story of the miraculous imprint is located when Jesus is doing his ministry, while the story of the burial cloths left in the tomb is located after the Ascension of Christ in Edessa, while the disciple talks to king Abgar.  All these very good clues found in this text are well enough and clear enough to understand that the Image of Edessa (for this author at least) had NOHING TO DO with any kind of burial cloth !  And again, let me emphasize the fact that the action concerning the miraculous imprint is located during Christ’s lifetime, before his Passion.  How in the world could he has washed his face with a burial cloth in this particular context ???  It would have been judge scandalous and gruesome and the fact that Wilson and others used this term “tetradiplon” to comfort his hypothesis is quite simply ludicrous because it is completely taken OUT OF CONTEXT !  I’ll say it again: WHEN WILL YOU REALIZED THAT THIS IS NOT THE WAY WE DO GOOD HISTORICAL (OR ANY OTHER) RESEARCH ???\nNow, I’ll let you assimilate all this and meditate over it.  But I have to say that it’s sad to see people on this blog being so close at the idea that Wilson’s hypothesis is most probably WRONG !  Don’t you have read my paper about that ?  What do you do of all the problematic facts (24 so far) that goes directly against Wilson’s hypothesis ?  Even if you think you could find a solution for one, you’ll still stuck with 23 other problematic facts to explain !  Sorry but this is quite simply impossible to do properly without falling into very wild speculations that are not worthy of a good historical research…\n\n","date":"September 20, 2012 at 1:02 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16590","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"I realize I completely forgotten to wrote the conclusion of Janice Bennett’s recent paper about the Sudarium.  Here it is: “Although investigation on the Sudarium of Oviedo are ongoing, Scientists of the Spanish Center for Sindonology have concluded that everything studied to the present date indicates that there is nothing contrary to the hypothesis that the sudarium of Oviedo was the sudarium mentioned by John the Evangelist.”\nNothing contrary to the hypothesis that the Sudarium is genuine really ?  How about the 2 series of radiocarbon dating that have given dates between the 6th and the 9th century for this cloth with an average middle date of 708 ???  If that’s not a problematic fact, I don’t know what it is !  And despite this, Miss Bennett never said a word about that in his paper !\n\n","date":"September 20, 2012 at 2:53 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16597","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Yannick, regarding your point 1. Please refer my comment #53 which you haven’t addressed. Although I also question Wilson’s credibility at times, I think you re being unfair with respect to this issue, as per my comment.\n\n","date":"September 20, 2012 at 6:59 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16627","author":"Matt","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"still no comment Yannick? If not why? I’m getting tired of the dogmatic lack of flexibility and open mindedness on both sides of the debate\n\n","date":"September 21, 2012 at 5:57 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16649","author":"Matt","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Reminder for a close-minded geograph: A legendary fact (e.g. facial imprint of a living Yeshua left on a towel/kerchief) is definitely  NOT a historical fact.\n\n","date":"September 20, 2012 at 1:18 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16591","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"The word appears only twice in the whole Greek literature:\n1/ as a qualificative adjective (“rakos tetradiplon”)\n2/ as a qualificative noun (“tetradiplon” = “sindon”).\nStill waiting for YC and Freeman to JUSTIFY the use of “RAKOS” (= rag/piece of rag) in conjunction with the ACHEIROPOETIC Image of Edessa (a PAINTED facial image of Yeshua’s used as a city palladium).\n\n","date":"September 20, 2012 at 1:30 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16593","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Mistyping: Yeshua\n\n","date":"September 20, 2012 at 1:31 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16594","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Still waiting for YC and Freeman to JUSTIFY the use of “HIMATION” (= a long rectangular cloth) in conjunction with the ACHEIROPOETIC Image of Edessa (a PAINTED facial image of Yeshua’s used as a city palladium).\n\n","date":"September 20, 2012 at 1:33 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16595","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"When you check out the entire ancient litterary corpus concerning the Abgar legend and the Mandylion, the word “himation” was just used on some rare occasions Max !  And also, you should understand that an himation has never been understand as being a burial shroud by any authors no matter if it is a modern or ancient authors !  An himation was a cloth used to dress a LIVING person Max !  How in the world do you see some kind of reference there to a burial Shroud ????  It’s ridiculous, really.\n\n","date":"September 20, 2012 at 2:56 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16598","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"YC. Are you ALSO ignorant of Yeshua’s Entombment/Resurrection Bizantine and Medieval iconography? Most obviously you CANNOT even recognize a himation when you see one!\n(See e.g. the Master of Verdun’s entombment of Yeshua. The latter is dressed with a himation as burial cloth!)\nDo your homework. You are just so ignorant of himation.\n\n","date":"September 21, 2012 at 5:04 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16644","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"In the light of ALL the philological, iconographic, literary and archaeological pieces of evidence:\nCan really the Image of Edessa be ONLY a small face cloth?\nCan really the Image of Edessa be ONLY a long rectangular full-body cloth?\n\n","date":"September 20, 2012 at 1:40 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16596","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"99% of the data concerning the Image of Edessa IF WE DON’T APPLY CRAZY AND WILD SPECULATIONS TO THEM point in one clear direction:  This was ONLY a small face cloth showing Christ alive without any bloodstains or injuries.  This is the reality.\n\n","date":"September 20, 2012 at 2:57 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16599","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"99% really? Are you kidding?\nFor instance, iconographclly speaking nearly 90% of Yeshua’s Entombment and Resurrection Byzantine and Medieval iconography feature Yeshua dressed in a HIMATION (a long rectangular cloth) NOT with a small face cloth placed over his face!\n\n","date":"September 21, 2012 at 5:16 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16645","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Most obviously you’d better stick to geography as a geograph… \nHow can you be so unscholarly so dogmatic in a fied (iconography, archaeology of Greek Byzantine and Greek clothing)?\nYour fiercely anti-Wilsonist approach of the whole issue DOES  TURN YOU CRAZY and WILD and MAD.\n\n","date":"September 21, 2012 at 5:21 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16646","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"How can you be so unscholarly dogmatic in fields (iconography, archaeology of Greek Byzantine and Greek clothing etc) of which you’re are TOTALLY ignorant?\n\n","date":"September 21, 2012 at 5:25 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16647","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Nicolotti NIEGA la verdad del tesstimonio de Robert de Clari.\nYannick NIEGA la verdad del testimonio de Gregorio Referendario……..\nYannick insiste en CONFUNDIR el Mandylion ( lo que describió Gregorio Referendario impreso con SUDOR Y SANGRE POR EL DEDO DE DIOS) con los ICONOS del Mandylion ( SIN SUDOR Y SIN SANGRE realizados por el artista).\n¡ABERRANTE!\nCarlos Otal\n\n","date":"September 20, 2012 at 4:54 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16614","author":"Carlos Otal","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Carlos, do me a favor and read this: http://www.shroud.com/pdfs/guscin3a.pdf\nDon’t forget while reading this paper that Mark Guscin is a real linguist that knows Greek very well…\n\n","date":"September 20, 2012 at 5:01 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16617","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Conozco perfectamente el artículo de Mark Guscin.\nUstedes CONFUNDEN lo que Gregorio Referendario DICE VER y lo que Gregorio Referendario INTERPRETA sobre aquello que ve.\nSon cosas muy distintas y necesitan del ANÁLISIS.\n-¿Qué ve? \n1.-Manchas MONOCROMAS\n2.- Manchas de SANGRE \n-¿Qué interpreta?\n1.- Las manchas MONOCROMAS deben ser de SUDOR\n2.- Las manchas de SANGRE deben ser del  SUDOR DE SANGRE y de la SANGRE del costado.\n-¿Por qué interpreta así?\n1.- Porque existen unas LEYENDAS ANTERIORES que relacionan el lienzo con Getsemaní etc,etc, etc y necesita ASUMIR sus contenidos.\n2.- Porque Gregorio Referendario NO PUEDE DISTINGUIR si los ojos están ABIERTOS O CERRADOS.\n[al igual que sucede, y es un ejemplo, en la Sábana Santa, LE RECUERDO que VIGNON basó su signo 14, OJOS GRANDES MUY ACENTUADOS, precisamente en eso, LOS OJOS EN LA SABANA PUEDEN PARECER ABIERTOS ( el negativo fotográfico resuelve la duda y están CERRADOS]\n-¿Qué puede ser cierto (OBJETIVO) de su testimonio?\n1.- Manchas MONOCROMAS que sugieren un ROSTRO y manchas de SANGRE.\n2.- NO existencia de colores pictóricos.\nA.-No pueden ANTEPONER  la leyenda a LA OBSERVACIÓN DIRECTA DEL LIENZO que realizó Gregorio Referendario.\nB.- Tienen que JUSTIFICAR por qué los ICONOS del Mandylion no muestran manchas de SUDOR y manchas de SANGRE.\nC.- Tienen que ENTENDER que sobre una imagen realizada con MANCHAS DE SUDOR y SANGRE ( y Mark Guscin NO NIEGA la presencia de esas manchas), no se puede DISTINGUIR entre VIVO o MUERTO, entre ojos ABIERTOS y ojos CERRADOS.\nD.- Tienen que CONSIDERAR que probablemente Gregorio Referendario INTERPRETÓ como una imagen de Jesús VIVO ( para ser fiel a la leyenda) lo que era una imagen de Jesús MUERTO ( la sangre del costado le desconcierta).\nE.- Y todo esto, en principio, es INDEPENDIENTE de que se crea o no se crea en la identidad del Mandylion con la Sábana de Turín.\nCarlos Otal\n\n","date":"September 20, 2012 at 6:40 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16625","author":"Carlos Otal","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"¡Muy bien dicho, Carlito!\n\n","date":"September 21, 2012 at 9:21 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16674","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Carlos, I have difficulty to follow your thoughts because of the translation that is not very good.  Anyway, what I can note is the fact that your interpretation of Gregory’s sermon is truly speculative and it’s certainly not the same interpretation of the majority of the expert, starting with M. Guscin.\n\n","date":"September 21, 2012 at 10:53 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16681","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"YC keeps NOW relying on experts to back his point when he currently kept discarding experts on other issues!\n\n","date":"September 21, 2012 at 11:57 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16686","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Supporting Max’s contention that Shroud was a himation is a comprehensive paper: “The Turin Shroud as John Mark’s temple garment”, by A. A.M. van der Hoeven, http://www.JesusKing.info, October 14, 2011.   \nThe paper is detailed and provides citations.  So YC’s comment “And also, you should understand that an himation has never been understand as being a burial shroud by any authors no matter if it is a modern or ancient authors ! ” is clearly incorrect.  Whether v d Hoeven is correct or not that the cloth belonged to John Mark, and there are a few things in her paper I would question, she at least provides enough information to suggest that it may well have been a himation.\n\n","date":"September 20, 2012 at 5:07 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16618","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Dave, you can believe what you want and believe anything supporting Wilson’s ideas, but let me ask you one thing :  Please show me one single ancient source who clearly said that the Image of Edessa (or the Mandylion) was in fact a burial shroud of Christ ?  In his recent presentation in Valencia, even Wilson recognize that problem !  AND WHAT A PROBLEM MY FRIEND !!!  When you put it side by side with the other very huge problematic fact that there is not a single copy of the Mandylion that exist showing a suffering and/or a dead Christ, I think this is well enough to understand that this relic was what tradition always reports, i.e. an image of only the face of the living Christ resting on a small linen cloth.\nLast request for you and all the other fans of Wilson :  Please show me one single ancient text where an author choose to used this word “himation” in order to clearly speak about the relics associated with the burial of Christ that were kept in Constantinople before (and for some) after the sack of the city in 1204 or in any other ancient text where an author wanted to describe a burial cloth of someone…  I’ll wait for you about that !  I’m afraid that all you’ll find is words like “sindon”, “lintheum”, “sudarium”, etc… \nDon’t forget one important thing :  John Damascus used this term to describe the Image of Edessa in one manuscript in which he report the same traditional story of the miraculous imprint of ONLY the face of the LIVING Christ !  No way for anyone to see a reference to a burial cloth here !!!!\n\n","date":"September 21, 2012 at 3:54 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16697","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"YC,\nEver heard of circumstancial evidence in forensics?\nThe TRUE fact is there IS a connection between the philological, iconographic, literary (legendary and non legendary data) and archaeological circumstances (= circumstantial evidence) and the fact in issue (the Image of Edessa = an ingeniously painted face known as the Mandylion, a nearly square small face cloth, placed over the facial imprint on a long rectangular cloth folded in four an mounted on a trellised frame). The two images were later seperated.\n\n","date":"September 21, 2012 at 5:26 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16704","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"N. B. As I posted this as no 62 out of 100 comments as a direct reply to ArtSciences earlier comment and it risks getting lost, I am reproducing it at the end as well. I would add that anyone who insists that tetradiplon applies to a burial cloth after an image was placed on it must provide documentary evidence that contradicts the plain words of the Acts of Thaddeus.\nArtScience ‘I find it strange that Charles seems to say the tetradiplon description is rubbish much like the confused hearsay sequence of how the image got on there.’\nNo Art Science, i have never said that ‘tetradiplon’ was rubbish. It is a strange word and it needs an explanation as to why the author of the legendary Acts of Thaddeus used it.\nFirst one must clear the decks.1) Tetradiplon is ONLY used of the cloth when it was handed to Jesus.\n2) Wilson is misleading in The Shroud (2010), p. 190, when he suggests that the word tetradiplon is used to describe the cloth AFTER Jesus had wiped his face on it. Whatever the reason or motives for his ‘mistake’, Wilson has confused many people on this.\n3) The Acts of Thaddeus, if read in full, make it quite clear that the author distinguishes between the cloth on which Jesus wiped his face ( the tetradiplon cloth, if you like) and the burial cloths of Jesus that are described separately as being in the tomb AFTER the face cloth had already arrived in Edessa.\nTHIS MAKES ALL THE DEBATES OVER HOW THE TURIN SHROUD MIGHT HAVE BEEN FOLDED REDUNDANT. It had to be folded somehow to preserve it when not on display and it could have been folded in all different kinds of ways over the centuries of its life, probably different ways at different times. What seem to be happening here is people seeing folds that fit in with a tetradiplon folding when the word tetradiplon was never applied to the burial cloths in the tomb\nSo we come back to why the word tetradiplon was used of the cloth when it was handed to Jesus. One guess, that I explore in my Tetradiplon Revisited ( which comes up as about number six if you put in the word ‘tetradiplon’ into Google), is that the author wanted to give a special status to the cloth that Jesus chose to wipe his face on. We know from festivals such as the Athenian Panathenaia that a peplos was specially woven, then folded (see the illustration in my article) and then handed over to be placed on the statue of Athena. There is some evidence that in Christian times a similar ritual was carried out for the pallium given to bishops.It was originally handed over as a folded piece of cloth but, eventually instead of a folded rectangle, the bishop was given a simple strip, So it is not impossible that a similar ritual was in the mind of the author of the Acts of Thaddeus. He simply wanted to embellish the legend a bit and he may have been aware of ceremonies in which folded cloths were handed over BEFORE they were used in a ceremony. I leave this suggestion open but it is a line of enquiry that better fits the existing evidence than anything that looks at folded burial cloths\n\n","date":"September 21, 2012 at 4:31 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16642","author":"Charles Freeman","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Shall I endlessly repeat here, IF we put ALL the philological, iconographical, literary (legendary and non legendary literature) and archaeological pieces of evidence to reconstruct the Image of Edessa puzzle and be TOTALLY CONSISTENT, the image consisted of TWO facial images (one ingeniously painted on a nearly square small face cloth placed over another recorded on a himation or long rectangular sindon).\n\n","date":"September 21, 2012 at 5:41 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16648","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Mistyping: “IF we put ALL the philological, iconographic, literary (legendary and non legendary literature) and archaeological pieces of evidence TOGETHER to reconstruct the Image of Edessa puzzle\n\n","date":"September 21, 2012 at 6:14 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16651","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Charles, \nOnce again , can the conventional practising historian  answer that very simple question: is the living Yeshua’s wiping his face on a tetradiplon a historical fact or just a legendary version of the Abgar LEGEND? \nSince there may be a kernel of truth as distorted realty within a legendary account, what makes you 100% think it just cannot be a cryptic reference  to Yeshua’s burial face veil (as a burial veil folded in four) or his long rectanguar full-body burial cloth (a himation used here as a long washcloth and presented folded in four as a towel to wipe his face?)\n\n","date":"September 21, 2012 at 6:39 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16654","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"mistyping: (as a veil folded in four and used as a kerchief to wipe his face)\n\n","date":"September 21, 2012 at 6:56 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16656","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Very clever comment M. Freeman !  Particularly concerning the fact that there was other supposedly miraculous imprint of the face of Christ near the end of the 6th century in the Byzantine world and that it was common to include these cloths in existing legends (like in the case of the Abgar legend versus the Image of Edessa) or to created new legends in order to make believe that these cloths were true relics.  It’s funny to note how Wilson accept freely and without too much critical sense the idea that what is said in the Abgar legend about the coming of the Shroud to Edessa RIGHT AFTER the Ascension of Christ is HISTORIC !  What a joke !  Every Byzantine scholar knows that Christianity didn’t came to Edessa until the second century A.D. !!!  On that simple base, we can conclude easily that all this story of the disciple named Thaddeus coming to Edessa to heal Abgar V and to give him the miraculous imprint of the face of Christ is most certainly untrue and possess no historical base whatsoever.  And you see our friend Wilson taking this for granted and place this legendary stuff as one of the base for his hypothesis !  And the worst thing is that some people believe Wilson’s fantasy !  Incredible…  \nI also appreciate your hypothesis to explain RATIONALLY the inclusion of the term “tetradiplon” in the legend of Abgar.  This is a very rational way to explain and you bring historical facts to back it up which is always a good thing.  But, of course, no one can really be certain of the correct answer in this particular case since this term is very particular to the Acts of Thaddeus.  If we could find this term in another ancient manuscript, maybe the context in which it is used would give us a better clue.  Nevertheless, I should say that your hypothesis is by far, the most logical I ever saw concerning this term.  I take a very good note of it !  Thank you.\n\n","date":"September 21, 2012 at 10:46 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16679","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Thanks, Yannick. If we can get rid of the stranglehold Wilson has on many aspects of Shroud history, then we can explore other avenues.\n I am not saying my hypothesis about tetradiplon is right but it does  make some sense and is an avenue along which we need to do further research. In particular, I would like to track down the sources that talk of a pallium being folded before being handed to a bishop on his consecration.On the Parthenon relief ( see my article) it is hard to see how many folds there are but wouldn’t it be interesting if one could show there were four! ( i assume that the Panathenaic festival continued into Roman times.)\n\n","date":"September 21, 2012 at 12:47 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16688","author":"Charles Freeman","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Can Freeman and YC leave the Wilson issue out of the Image of Edessa debate for once and COHERENTLY address the Image of Edessa as a philological, iconographic, literary and archaeological issue or can’t they?\n\n","date":"September 21, 2012 at 6:01 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16650","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Max. I agree with Beltung that the Image of Edessa was one of many similar images appearing in the late sixth century that then had legendary accounts attached to them to give them credibility as relics. In this the Edessa legend would be similar to hundreds of similar legends in the later Middle Ages that became attached to relics that could not possibly be what the legends said they were.\nThe only reason for bringing Wilson into the debate as he seems to have given the impression to many people that the Acts of Thaddeus uses the words tetradiplon to describe the cloth after the image was on it and he omits the reference to the burial cloths as cloths which are different from the cloth that was folded tetradiplon before it was handed to Jesus. So any account of the folding that ignores this is bound to be challenged. Do you accept that Wilson has been misleading , deliberately or not, on this issue? If you do then I am happy to stop mentioning him by name. If people go on discussing tetradiplon as if Wilson is right then it is a different matter although I have said all I need to say here.\nIf you have evidence that a burial shroud was described as tetradiplon I am sure we would be happy to hear it and why not as much philological, iconographic, literary and archaeological evidence as you will on the Image of Edessa but your conclusions do seem much more convoluted than they need be .\n\n","date":"September 21, 2012 at 7:21 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16658","author":"Charles Freeman","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Charles, \nIf my conclusions may seem much more convoluted than they need be, it is just because I am not writing up any research paper but just (mostly in haste)  passing comments (in a foreign language I used not to practice for ages). \nAs to your own conclusions about what is really the Image of Edessa, they do seem both simplistic and most unclear: is it a nearly square or rectangular small face cloth? Is the face in landscape or portrait mode? Is the cloth bearing a painted or an acheiropoeitic face image? Is it on linen, silk or sea byssus? etc.\n\n","date":"September 21, 2012 at 7:55 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16663","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"I could bring you many other things that Wilson have included in his hypothesis that are truly dishonest because only partial.  In other cases than this example from the Acts of Thaddeus, he has bring forward one element of a particular text to comfort his hypothesis while at the same time, he has completely forgotten to tell his readers about other problematic things for his hypothesis that we can find in the SAME manuscript !  That’s not the proper way to do good historical research…\n\n","date":"September 21, 2012 at 10:50 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16680","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Hi Charles, thanks for the nice clear reply. As I mentioned I most probably am leaning towards the C14  date being correct, but got curious whether anything can be made of the evidence going against this. I’ve never read Ian Wilson or the Acts of Thaddeus so most probably am missing the point, but from my (perhaps confused) understanding of this, I built up a picture of a possible sequence of events: that the Shroud (with image on it, and neatly folded and stitched) was interpreted as a towel and the burial clothes were some other cloths (perhaps the strips of linen, whether real or fake, the gospels mention). \nSo the burial cloths looked the part (ie what they expected to see) so were mentioned as such and the folded Shroud looked like a towel and so mentioned as such. An easy enough mistake for the writer of the Acts, if he didnt have recourse to unpick the stitching and determine that he had got it wrong. If I remember correctly one gospel mentions strips of linen and another mentions Joseph of Arimathea buying a large expensive cloth. Might these be distinct – why  buy an large expense cloth only to cut it up into strips. Perhaps the strip are to bind the shroud together onto the body. So I dont really see a cut and dry reason to dispense with this evidence completely, but neither am I totally persuaded by it. I put it in the “hmm, that’s curious” category.\nI might wonder how come no one around the time of Thaddeus thought to unpick the stitching and have a little peek, but then again it seems that it also took a couple centuries for them to unpick the backing layer of the present TS recently for cleaning and find the faint image (Fanti’s claim at less) on the back hidden side.\n\n","date":"September 21, 2012 at 1:47 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16693","author":"ArtScience","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"exactly, similar to my hypothesis outlined above and not even addressed by Yannick or Charles. My one difference is that I hypothesized that the author of Thaddeus knew the “towel” described in the legend was the shroud folded into eight sections, hence the use of the somewhat “mysterious” and “cryptic” word “tetradiplon”. His method allowed his to conceal the shroud’s existence but cryptically also pointed to its existence\nA perfectly credible hypothesis, in my view\n\n","date":"September 21, 2012 at 8:05 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16706","author":"Matt","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Matt and others, if the author of the Acts would have known that the cloth was a burial Shroud of Christ bearing his complete body image, he would have simply stated that this cloth was a burial Shroud of Christ bearing his complete body image !!!\nYou don’t seem to take good note (as any real scholar do) of the FACT that there is absolutely NO ancient manuscript that clearly state that the Mandylion had a burial nature.  Also, you don’t seem to take good note (as any real scholar do) of the FACT that there is absolutely NO depictions of the Mandylion that show bloodstains or injuries.  Also, you don’t seem to take good note (as any real scholar do) of the FACT that there are many list of relics from Constantinople written by eye witnesses of the relics which clearly states that the Mandylion and the Shroud of Christ were 2 different relics and that the Mandylion was NEVER considered by these authors as being related to the Passion of the Christ. \nNote that these are just 3 of the most problematic facts regarding the bad hypothesis of Wilson…\nAll you trials to defend blindly and at all cost Wilson’s ideas versus the Mandylion is purely speculative and can’t pretend to have any historical credibility.\nBut in the end, if believing in Wilson’s ideas (who truly is the Dan Brown of Sindonology) really help you sleeping better at night, then good for you !\n\n","date":"September 22, 2012 at 6:22 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16766","author":"Yannick Clément","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Charles you wrote: \n“The image of Edessa was one of MANY SIMILAR IMAGES appearing in the late sixth century”. \nHow many pre-7th c. CE acheiropoietic images of Yeshua on cloth can you EXACTLY name? How can you discriminate between the original template and its copies?\n\n","date":"September 21, 2012 at 5:14 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16703","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Charles,\nEver heard of the Veil of Antinoe (it was examined by a French – not a British – archaeologist)? If so you have your answer about evidence that a burial ‘sindon’/shroud described as folded in four ‘tetradiplon’.\n\n","date":"September 21, 2012 at 7:31 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16661","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Miss Typing (again): “you have your answer about evidence that a burial ‘sindon’/shroud WAS described as folded in four ‘tetradiplon’.\n\n","date":"September 21, 2012 at 7:37 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16662","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Charles,\nWhat does Belting really know about the Turin Sindon? \nWhat is really his descriptive knowledge of the relic? \nDid he ever notice the Turin Sindon can be worn next to the skin as a himation/achiton when he studied Yeshua’s Entombment and Resurrection Byzantine and Medieval icconography?\nDid he notice a vast nimbus-like shaped light discoloration all around the Turin Sindon face can be detected not only on high contrast enhanced orthochromatic, traditional silver &\nextensive digital Sindon overall photographs but also in situ cathedralis torinensis by standing at a distance between 15 to 30m away from the relic?\nDid he notice a short portion decal of a text in Nestorian type of Syriac script can be detected on the area just below the beard (from digitally contrast enhanced 1978 Schwortz Turin\nSindon face photograph)?\nEtc.\n\n","date":"September 21, 2012 at 8:09 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16664","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Addendum: \nWhat does Belting really know about the Veil of Manopello? Did he ever examinded it in natural transmitted light and macrography and ever compare it to the Mandylion and Veronica pre-15th c. CE iconography?\n\n","date":"September 21, 2012 at 8:16 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16666","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Miss Typing (again): examine it\n\n","date":"September 21, 2012 at 8:18 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16667","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"What do the Aslanovskis, Nicolettis etc really know about the Turin Sindon and The veil of Manoppello in conjunction with The Holy Veronica, The Mandylion and the Image of Edessa?\n\n","date":"September 21, 2012 at 8:24 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16668","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"As far as the Image of Edessa-Turin Sindon-Veil of Manoppello connection is concerned, I cannot help thinking they are more ignorant that really knowledgeable.\n\n","date":"September 21, 2012 at 9:07 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16673","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Max. This posting is specifically about ‘tetradiplon’ . You have a tendency to go off into other areas and it is often unclear from the fragments you give us what you really believe. it is certainly complicated and hard to grasp.  Why don’t you write a short history of the Turin Shroud as you see it showing how you believe it relates to other medieval images and see if you can publish as a one-off on this or another shroud site. Then you can refer to it when you want.\nI assume you have a copy of Belting’s Likeness and Presence. Why not start with Chapter Four: “Heavenly Images and Earthly Portraits: St Luke’s Picture and ‘Unpainted ‘ Originals in Rome and the Eastern Empire.” The chapter kicks off with a a section on ‘Unpainted Images of Christ and Relics of Touch’. Most images from the sixth and seventh centuries were ,of course, destroyed in the Iconoclastic period.\n\n","date":"September 22, 2012 at 4:49 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16719","author":"Charles Freeman","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Tetradiplon on the peplos on the Parthenon Frieze? \nOn this coming Monday I have to be in the British Museum and I shall try and find time to see the Parthenon Frieze on display there. I shall be looking at the relief that I reproduce in my article ‘Tetradiplon Revisited’ of the newly woven peplos that was brought to the Acropolis , ceremoniously folded. and then placed around the statue of Athena at the culmination of the ceremonies of the Panathenaia. \nNow find the relief and look carefully at the cloth. There is a final double folding being put in place in place, so is this the fourth folding of a cloth that has already been folded three times? Hard to say but I think I can pick out five different layers in one of the halves being folded. The fact that the sculptor has depicted more than four on a cloth that has been folded doubled each time  suggests that this MIGHT be a depiction of a tetradiplon cloth. If so the folding BEFORE it is placed on the statue of Athena, fits well with the use of a tetradiplon cloth being presented to Jesus BEFORE he wiped his face with it in the Acts of Thaddeus.\nAs those who have read the article will know, I suggest that the presentation of a pallium might have followed a similar ritual in the Christian era.\nInterestingly one, late , description of the Image of Edessa also describes it as a peplos.\nNeed we look further?\n\n","date":"September 22, 2012 at 6:04 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16720","author":"Charles Freeman","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"P.S. The Panathenaia was still being celebrated in the third century AD so the idea of the four folding of the peplos, if such it was, was presumably still current and, like many pagan rituals, may have been adopted within Christianity in a different context. e.g the pallium.\n\n","date":"September 22, 2012 at 6:24 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16724","author":"Charles Freeman","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Charles,\nHave you a tendency not to answer my questions? I asked you  “How many pre-7th c. CE acheiropoietic Iimages of Yeshua ON CLOTH  can you EXACTLY name? How can you (or Belting) discriminate between the ACHEROPOIETIC original template and its copies painted or carved on wood?\n\n","date":"September 22, 2012 at 6:10 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16721","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"mistyping: painted on or carved in wood.\n\n","date":"September 22, 2012 at 6:20 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16722","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Max. This is an impossible question to answer ( and also completely irrelevant to this posting which is why I have not bothered to reply) because most were destroyed in the iconoclastic period- you need to look at the references I have provided for you.\nWe know of the image of Christ on linen discovered at Kamuliana in Asia Minor  and we know that there was a duplicate of this because it passed on its image to the dress of the woman who found it. (Belting ,p.53) Both were displayed in processions in 560 and then transferred to Constantinople in 574. So there are two for you and I suspect that there many more because cloth decays so easily that most such cloths would have vanished even if they had not been deliberately destroyed by the iconoclasts.\n We simply do not know how many of the recorded images were specifically on cloth.We know that one reason that the Image of Edessa was especially venerated in 944 was because it was one of the few survivals of earlier images.\n\n","date":"September 22, 2012 at 6:21 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16723","author":"Charles Freeman","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"You wrote: “This is an impossible question to answer”. Thank you.\n\n","date":"September 22, 2012 at 6:51 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16727","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"…which means you don’t know.\n\n","date":"September 22, 2012 at 6:51 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16728","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"So you can name only one (may be two) pre-7th c. CE image of Yeshua on a cloth in all…\n\n","date":"September 22, 2012 at 7:15 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16729","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Where are the “many similar images appearing in the late sixth century that then had legendary accounts attached to them to give them credibility as (acheiropoietic) relics (of facial/body image ON CLOTH of Yeshua)? Are also their specific DESIGNATIONS gone with the wind?\n\n","date":"September 22, 2012 at 7:28 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16731","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Mistyping: HAVE also their specific DESIGNATIONS gone with the wind?\n\n","date":"September 22, 2012 at 7:29 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16732","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"You wrote: “This is an impossible question to answer”. Thank you.\nLike most questions about the past!!!\n\n","date":"September 22, 2012 at 7:44 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16733","author":"Charles Freeman","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"History/Art History just cannot answer ALL the questions about the past. Thank you Mr. Freeman. Too bad you can do without archaeocryptology. I had a few eXoteric answers…\n\n","date":"September 22, 2012 at 10:33 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16739","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Charles,\nThe Greek words/phrase ‘tetradiplon’, ‘rakos tetradiplon’, ‘himation’, ‘acheiropoietos’ are just the tip of the iceberg. They shall be understood in the light of a more comprehensive context.\nBtw (in order to stick to the tetradiplon theme)  can you explain the use of the phrase ‘RAKOS tetradiplon’ to describe the acheiropoietic/painted Image of Edessa or can’t you?\n\n","date":"September 22, 2012 at 6:48 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16726","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"No, I can’t in this instance -can you?- it is impossible in most cases to know why an author chose one word rather than another. However, i do think my use of the relief from the Parthenon frieze does mark a step forward- whoever sculpted it was working within twenty yards of where the ceremony took place every year (and every four years on a grander scale) so it is bound to be an accurate representation even though it might be difficult to show the right number of folds  on a shallow relief. Anything more than four in one of the halves being shown folded suggests that the fold being shown was the fourth one and so the peplos might well be described as tetradiplon.\n‘Too bad you can do without archaeocryptology. I had a few eXoteric answers…’ This is the problem with you ,Max. We would like to know what eXoteric answers archaeocryptology has given you about the Shroud. If you want to be taken at all seriously, you must stop making all these cryptic statements and write a proper article explaining how you would describe the history of the Shroud from AD 30. Otherwise you will just be treated as some kind of irrelevance. You clearly have skills than no one else possesses but unless you use them you will get nowhere. Go for it!\n\n","date":"September 22, 2012 at 1:13 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16748","author":"Charles Freeman","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"¡Así que los eruditos historiadores bizantinos conocen “cientos” y la Iglesia Orrtodoxa SÓLO conoce 4 ! .\nParecen muy POCO serios los eruditos bizantinos cuando los temas “rozan” a la Sábana Santa, ¡por si acaso…..!\n \n“According to the Prologue there are known 4 Not-Made-by-Hand Images of the Saviour:  \n1) at Edessa, of king Abgar – 16 August. \n2) the Kamulian, – Sainted Gregory of Nyssa (Comm. 10 January) wrote about its discovery, while according to the Monk Nikodemos of the Holy Mount (+ 1809, Comm. 1 July), the Kamulian image appeared in the year 392, but it had in appearance an image of the Mother of God – 9 August.  \n3) in the time of emperor Tiberius (578-582), Saint Mary Syncletika (Comm. 11 August) received healing from this.\n4) on ceramic tiles – 16 August.”\nCarlos Otal\n\n","date":"September 22, 2012 at 9:00 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-16737","author":"Carlos Otal","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Freemman wrote: \n“I agree with Beltung that the Image of Edessa was one of many similar images appearing in the late sixth century that then had legendary accounts attached to them to give them credibility as relics.”\nThis is totally misleading. The TRUE fact is the only known legends and specific designations in conjunction with pre-7th c. CE ‘acheiropoieta’ (Greek word for images ‘not made by [human] hand’) refer to only TWO images ON CLOTH:\n– The Image of Edessa (not to be confused with its painted copies)\n– The image of Kamulia((not to be confused with its painted copies).\n\n","date":"October 1, 2012 at 10:01 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-17114","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Reminder: I mean pre-7th c. CE acheiropoietic images of Yeshua on cloth\n\n","date":"October 1, 2012 at 10:13 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-17117","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Note: in all likelihood, the Uronica in Rome is the original template or/and a painted copy of the image of Kamulia.\n\n","date":"October 1, 2012 at 10:05 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-17115","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Reminder two: the Uronica in Rome actually refers to TWO images… the original and (now) invisible template and its facial copy on silk placed over it.\n\n","date":"October 1, 2012 at 10:24 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-17118","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Reminder 3: \n  The Greek word ‘tetradiplon’  read in conjunction with Yeshua’s’ facial imprint uppermost on a ‘sindon’ can be translated\n  1/ either ‘folded in four {layers]’. In this case, it could have referred to a long linen cloth folded in 4 layers to form a square (2 (Assyrian royal) cbt x 2 (Assyrian royal) cbt).\n  2/ or ‘folded in four [successive folding]’. In this case, it could have referred to a long linen cloth folded in 8 layers to form a ‘long square’ (2 (Assyrian royal) cbt x 1 (Assyrian royal) cbt).\n  Both as a relic or ‘acheiropoetic image’ and stained/soiled ‘himation’ 4 times 2 cbt long and 2 cbt wide (about 440cm x 110cm), the Turin Sindon,  with its 4 sets of small holes, is the ideal candidate to be identified with ,the Abgar legend  ‘rakos tetradiplon’/tetradiplon.\n\n","date":"October 1, 2012 at 11:19 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-17122","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"See my  other findings I previously mentioned (in 1994 & 1998, detection of a vast nimbus-like shaped light discoloration all around the Turin Sindon face and upper chest;; in 2010, detection of a short portion decal of a text in Nestorian type of Syriac script  on the area just below the beard; 2010, Yeshua’s entombment and resurrection himation Byzantine and medieval iconography).\n\n","date":"October 1, 2012 at 12:07 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-17126","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Additional finding: in 2010, I became aware  the Turin Sindon size was totally consistent with a calf-length himation,worn next to the skin as wok wear for a man 5ft 8″-6ft2 ” tall.\n\n","date":"October 1, 2012 at 3:38 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-17130","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Mistyping: workwear\n\n","date":"October 1, 2012 at 3:42 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-17131","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Reminder: in John’s gospel, Maryam of Magdala mistook Yeshua for the gardener, thus implying he was dressed in his long rectangular burial sheet.\n\n","date":"October 1, 2012 at 3:53 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-17132","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"In reply to my question “can you explain the use of the phrase ‘RAKOS tetradiplon’ to describe the acheiropoietic/painted Image of Edessa or can’t you?”, Charles Freeman (September 22, 2012 at 1:13 pm | #150) replied: ‘No, I can’t in this instance -can you?-‘\nYes I can. Too bad Mr Feeeman hasn’t enough archeaological reconstructive imagination/vista to  figure out the half-acheiropoietic image known as the Mandylion/Veil of Manoppello placed over the Turin Sindon acheiropoetic facial image…\n\n","date":"October 1, 2012 at 11:54 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-17125","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"We would love to know more about your theory . Why don’t you assume that we are all ignoramuses who need the history of the Shroud to be spelt out for us ?  I still haven’t a clue what you are talking about. So go for it, Max!\n\n","date":"October 1, 2012 at 4:27 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-17134","author":"Charles Freeman","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Charles,\nAs far as the image of Edessa is concerned, I don’t assume you’re ignorant:. \nThe fact is e.g. ypu  can neither explain the use of the phrase ‘RAKOS tetradiplon’ to describe the acheiropoietic/painted Image of Edessai nor account for the use of the word ‘himation’ in conjunction with the said image.  \nYou just selfservingly discard the philologica/archaeological/iconographic/literary pieces of evidence  demonstrating that, contrary to your aprioristic view, the  image of Edessa IS NOT/CANNOT BE SOLELY a small face cloth…\n\n","date":"October 1, 2012 at 6:48 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-17140","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"Yannick and others who were interested in my views on Tetradiplon:  my article Tetradiplon – the Mystery Solved? Is now up on the Sceptical Shroud website. I hope that it is found interesting.\n\n","date":"October 9, 2012 at 1:05 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-17352","author":"Charles Freeman","site":"shroudstory"},{"title":"Tetradiplon: So how is the Shroud of Turin folded?","post":"I have sent Dan a  “two page flash illustrated paper” on Turin Sindon archaeoperception entitled: DORMANT ARCHAEOPAREIDOLIAS OF A MOST SECRET EDESSEAN LITURGICAL RITUAL?.For the sake of both debate balance and fairness,  I do hope Dan will publish it here…\n\n","date":"October 9, 2012 at 7:43 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","id":"comment-17364","author":"Max Patrick Hamon","site":"shroudstory"}]
