[{"title":"The Central Dilemma of the Shroud?","post":"John Walsh quote is completely false…  Remember the paper I recently wrote about tha Shroud’s authenticity ???  Here’s the link again for those of you who have already forget it or didn’t had the chance to read it yet : http://shroudnm.com/docs/2012-07-26-Yannick-Clément-The-evidence-of-the-bloodstains.pdf\nIn this paper, I truly and honestly think I succeed to clearly show that the Shroud is NOT and CANNOT BE “the most ingenious, most unbelievably clever, products of the human mind and hand on record” as Walsh onced said !!!!  In this paper, I describe 4 possible scenarios that can still pretend to explain the Shroud.  Here’s a brief summary for each one:\n1- It is a real burial shroud of someone other than Jesus of Nazareth who suffered the same tortures as he with a forged image done by someone without using any art technique. In this case, a forger “naturally” produced the image while using a real tortured and crucified body.  And whether or not the forger knew that he would obtain a body image on the cloth, along with the bloodstains, is not completely clear. In fact, the formation of an image like that could have well been just an accident.\n2- It is real burial shroud of someone other than Jesus of Nazareth who suffered the same tortures as he with a naturally occurring image. In this case, the body image on the cloth was produced accidentally by some undetermined natural phenomenon(s). In other words, this is not a forgery but instead, an accidental resemblance with the Jesus of the Gospels, including that this anonymous victim was also crowned with thorns (a very unusual procedure) and didn’t have his legs broken (a standard Roman practice called crurifragium that was done to hasten death). In sum, this scenario can be described like a real burial shroud of an anonymous crucified man, which has bloodstains and a body image on it that shows a great accidental resemblance with the Jesus of the Gospels.\n3 – It is the authentic burial shroud of Jesus of Nazareth with a naturally occurring image. In this case, the body image on the cloth was produced by some undetermined natural phenomenon.  The fact that the body left the Shroud before it started to corrupt can be related with his resurrection, but that’s not certain. In other words, a scenario like that doesn’t absolutely need to call for the resurrection in order to explain the bloodstains and the body image we see on the cloth. In sum, this scenario can be described like the authentic burial shroud of Jesus of Nazareth, which has bloodstains and a body image on it that was produced by some unknown natural phenomena which were probably of chemical nature.\n4- It is the authentic burial shroud of Jesus Christ with a supernaturally occurring image. In this case, the body image on the cloth was produced by some undetermined supernatural phenomenon directly linked to his resurrection. In sum, this scenario can be described as the authentic burial shroud of Jesus of Nazareth, which has bloodstains and a body image on it that was caused, directly (a miraculous image made by God) or indirectly (a by-product), by his resurrection.\nIf we want to stay honest about the Shroud, we MUST consider these 4 scenarios as plausible options that can possibly explain this relic.  Sadly, the second scenario of that short list (i.e. the Shroud would be an anonymous victim of a legal Roman crucifixion and the image would have been formed naturally) have not been considered by either Stevenson and Habermas or Walsh, even though at first sight, such a scenario can seems to be truly plausible !!!  About that, here’s a quote from Meacham’s 1983 paper concerning the Shroud’s authenticity: ““…a number of commentators, including the STURP team, have suggested that the Shroud could be the gravecloth of a person who suffered injuries in the same manner as Christ. We shall examine here the possibility of such an occurrence without obvious intent to imitate the experience of Christ. This hypothesis thus hinges on the degree to which features now interpreted as “clearly representing Jesus Christ” should be considered unique.”  \nAgain, I repeat it : It’s very sad that Stevenson, Habermas or Walsh didn’t included this natural scenario as a possible explanation for the Shroud, because as we can see, this particular hypothesis has been proposed by many scientists interested in the Shroud over the years and at first sight, it’s an interesting option to analyze. \nAnd it’s fun we are talking about this topic because right now, I am writing an upcoming paper that will analyze in deep this particular scenario involving an anonymous victim of a legal Roman crucifixion in order to estimate the level of probability of such a natural scenario…  The title of this paper is “Concerning the question of the identity of the man of the Shroud: Could this man be an anonymous victim of a Roman crucifixion?” and it should be ready to read before the end of the year if everything goes well.  I really think it all the persons interested in the Shroud will like this kind of probabilistic analysis that focus on one single hypothesis that can potentially explain the Shroud.  After this article will be completed, I will also make the same kind of probabilistic analysis for the first scenario you can find in my first paper (i.e. the Shroud is the product of a “natural” forgery involving the use of a real crucified body which was showing the same stigmata than Jesus of Nazareth, as reported in the Gospels).  I hope to write this during the winter.  And when this second probabilistic analysis will be done, I think we will have a better view of the situation concerning the level of probability that the Shroud can really be the one of Jesus of Nazareth.\nSo, stay tune folks !  Much more to come…\n\n","date":"October 19, 2012 at 4:59 pm","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17887","author":"Yannick Clément","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"When considering alternative explanations for the image which not include the historical Jesus and taking into account the only constraint that a crucified body (with the same bloodmarks as Jesus) at some time must have been placed in the shroud, I can think of other possibilities that would fit somewhere between your first two points:\nIn the year 715 when Suleiman had risen to the caliphate he started to prepare a massive attack on the city of Constantinople. The Muslim chronicler al-Tabari tells us about the confrontations that took place while the Muslims tried to make their way through the land between the Byzantine and Umayyad empires:\n“The inhabitants of the city were filled with terror the likes of which they had never experienced before. All they saw were Muslims in their midst screaming ‘Allahu Akbar!’ Allah planted terror in their hearts…. The men were crucified over the course of 24 km.”\nI don’t think this scenario really fits your second point which addresses “an accidental resemblance with the Jesus of the Gospels”. The resemblance would be a main goal in the case of martyrs on the other hand. But your second point could of course easily be extended to include this situation as well (or your first point depending on how you stress the word “forger”).\nNevertheless, I think the scenario is interesting. It explains how crucifixions at certain times and areas despite the influence of Christian culture and law and scenarios like this could give us a lot of corpses with exactly the same blood patterns we find in the case of Jesus which of course raises the possibility of surviving burial shrouds. And if you prefer some place over another; pick your choice: Jerusalem, Spain, Turkey. Christians have been persecuted in many places for being Christians.\n\n","date":"October 19, 2012 at 9:34 pm","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17901","author":"Mr.Moose","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"Interesting!  I believe God is giving us dots to connect.  What are the next dots? Any new tests that can be done as God gives us more technology?  God’s such a tease and He’s laughing right now.\n\n","date":"October 19, 2012 at 7:49 pm","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17898","author":"Stan Wenninger","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"He is laughing at our errogance. Anyone ever notice, when scientists, ‘the brains of our world’, discover one new thing on the Shroud, it just raises more questions and it always opens doors to several other possibilities? I believe this Shroud is so far ahead of our understanding, that we will all be gone and it’s mysteries will still persist, …even to future generations.\nR\n\n","date":"October 20, 2012 at 11:17 am","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17934","author":"Ron","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"No other crucifixion victim was ever crowned with a cap of thorns.  To think otherwise, is to be too speculative altogether.  Yannick should get out his famous Occam’s razor and excise the idea once and for all.  There’s only one person it can be!  Nor were the Moslem invaders of Constantinople accustomed to dispatching their crucifixion victims with a Roman lancea wound to the midriff!\n\n","date":"October 19, 2012 at 11:12 pm","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17905","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"Nor did the Moslem invaders scourge their victims with the Roman flagrum!\n\n","date":"October 19, 2012 at 11:56 pm","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17907","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"Or even know what one was! According to archaeologists,the flagrum and it’s use disappeared with the Roman empire in the early centuries, possibly up to the mid 4th century.\nR\n\n","date":"October 20, 2012 at 11:04 am","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17932","author":"Ron","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"With that comment you are definitely ruling out the vast majority of Christian martyrs as far as I can see.\nBut then pick another time and place.\nHow about the persecution of Christians in the roman era?\n\n","date":"October 20, 2012 at 7:14 pm","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17951","author":"MrMoose","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"I could add: the most troublesome points of congruence between the SOT and the NT writings I can think of, when it comes to replicating the NT scenario, would be the time period spent in the shroud following death. There doesn’t seem to be any good reasons for keeping the victim’s corpse in an expensive shroud over such a short time that happens to coincide with scripture.\n\n","date":"October 20, 2012 at 7:28 pm","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17952","author":"MrMoose","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"I agree. And I agree with the quote that it really is the burial cloth of Jesus, or an ingenious invention. Yannick’s 1 and 2 are theoretically possible but in my view highly unlikely.\n\n","date":"October 20, 2012 at 3:58 am","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17915","author":"Matt","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"If the main point was to let these Christians die the same kind of death as Jesus, crucifixion, I don´t think it can be ruled out that they in at least some cases where striving after an even higher level of congruence?\n\n","date":"October 20, 2012 at 7:10 pm","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17950","author":"MrMoose","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"Problem with early Christian martyrs striving for higher congruence has several problems, for one; Would they have known exactly how or where wounds were applied?, …this information is not exactly clear in scriptures. This hypothesis assumes ‘staging’,  what persecutor would bother to go along with the scenario? i.e; excessive scourging, lance to the side, no breaking of the legs etc; One would need to assume someone would then purchase an expensive burial Shroud to wrap the victim in, …for what reason? Then assume they would have to have the knowledge of exactly how long to keep the body enshrouded to achieve an image, if that was the goal. To think that was not the goal, then why would the body be removed from the burial cloths at all? Now if one can believe firstly that a martyr would be given any special treatment by the Romans or Jews or whomever in this extreme manner is simply rediculous.\nR\n\n","date":"October 21, 2012 at 4:12 am","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17963","author":"Ron","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"I’m not so sure about that Dave!  The only thing we can get from historical sources is this : there is no other documented case of a Roman crucifixion where the victim would have been forced to wear a crown of thorns…  This is a much more accurate statement and alone, it doesn’t prove at all that another person (maybe the leader of a subversive group or a self-proclaimed Messiah) could not have been crowned with thorns exactly in the same way than Jesus !!!!  But just wait for my upcoming paper and we’ll discuss it more in deep, ok ?  \nAnd I can already reassure you :  My estimation concerning the level of probability for such an hypothesis involving someone else than Jesus that would have been legaly crucified by the Romans is EXTREMELY LOW (near 0%).  But to be honest and unbiased, I had to make a full analysis of that particular scenario because at first sight, it really seems to be plausible and even today, there are still many people who believe that this is precisely the right explanation for the Shroud of Turin.\n\n","date":"October 21, 2012 at 5:40 pm","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17985","author":"Yannick Clément","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"What makes you think that Byzantine crucifixion victims wore beards, moustaches, and long hair  plaited into a pigtail?  Immediately after the Moslem invasion, on the accession of Leo III to the Byzantine throne, there followed 150 years of iconoclasm.  Clearly the Byzantines weren’t in the mood for images of crucifixion victims, whether miraculous, naturalistic, or the result of forgery!\n\n","date":"October 20, 2012 at 12:29 am","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17908","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"It´s surely troublesome that this particular martyr went against the common practice in his culture when it comes to hairstyle for example whether we place him in a Byzantine or an earlier roman context.  \nBut doesn’t the historical Jesus need the same kind of explanation?\n\n","date":"October 20, 2012 at 7:32 pm","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17954","author":"MrMoose","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"Not really, Jesus was a Nazarene, hense known for their long braided hair styles. Beards were also the norm for Jewish men.\nR\n\n","date":"October 21, 2012 at 3:52 am","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17962","author":"Ron","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"Ron,\nHow are you using the debated term “Nazarene” (from the Gospel of Matthew) here? Like “from the city of Nazareth”, or are you alluding to “nasir” from the book of Numbers?\n\n","date":"October 21, 2012 at 7:40 pm","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-18003","author":"MrMoose","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"Jesus was most probably not a Nazarite Ron because he drank wine while it was stricktly prohibited for someone under a Nazarite vow.  Now, it is well possible to think that Jesus had long hair in the style of a Nazarite but without being officially under such vow.  John the Baptist was under a lifetime Nazarite vow and we know that Jesus spent some time in John’s group before beginning his ministry.  It is possible that he borrowed the long hair look of John when he decided to quit his group in order to start his own ministry and it is also possible to think that Jesus had long hair as a throwback to some great Old Testament figures like Moses, Samuel or Elijah…  To wear long hair and a long beard could well have been kind of a public statement to say to the people : here comes a prophet folks !  I wouldn’t be surprise is this was the main purpose of Jesus by having long hair and a long beard.\n\n","date":"October 21, 2012 at 9:37 pm","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-18006","author":"Yannick Clément","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"The simple high level of probability that the Pantocrator styled images are related in some way with the Shroud and his image is well enough for me to discard any hypothesis (whether it be a “natural” forgery or not) involving someone that would have been crucified after the beginning of the 6th century…  And also, we must understand that after the abolition of Roman crucifixion by Constantine, even if there could have been some sporadic crucifixion done here and there, it is highly improbable that those who did it followed the known standard Roman procedure for crucifixion like we can see many signs on the Shroud!  This is another very important argument against any hypothesis that could involve a crucifixion done after the banishment of crucifixion by the Romans somewhere between 315 and 337 A.D.\n\n","date":"October 21, 2012 at 5:44 pm","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17986","author":"Yannick Clément","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"Reflections on the Shroud-  All of the information of this most forensically studied media points to one conclusion. All of the stacked layers of findings continue to be synergistically examined.  This whole trial brings us to conclude beyond a reasonable doubt that Jesus Christ is, indeed, God.  Reason being, only God could signature such a media that does not contradict in any way the Bible, yet it challenges and exceeds our latest forensic findings with our latest technological tools.  Each new finding reinforces God’s Signature.\n\n","date":"October 20, 2012 at 1:45 am","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17913","author":"Stan Wenninger","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"Important note about your comment Stan : Even if you have surely the right to believe this, it is a statement of FAITH that cannot be and will never be backed-up by science.  I just thought this nuance was important to make.\n\n","date":"October 21, 2012 at 5:46 pm","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17987","author":"Yannick Clément","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"I think the quote by John Walsh says it all. Moreover, we now know most definately, this Shroud image was not the work of a forger or the work of an artist, since all scientific evidence goes against it being so, especially the chemical, blood and 3D encoding evidence of the image. So what are we seriously left with? …The possiblity that someone else was crucified and tortured in the ‘exact’ same manner as Jesus of Nazareth and somehow this victim’s image was impressed on the cloth, and then someone decided this obscure victims burial cloth must be saved for posterity? This notion is so preposterous, it makes me laugh. The chance of this Shroud image being of ‘anyone’ other then the historical Jesus has been calculated, several times no less, to be in excess of 83 million to one! Now if you consider over the span of centuries where crucifixion was actually performed, the numbers would be maybe in the few million victims?…and that is being generous, the odds go much higher. Seriously, anyone who can postulate this ‘someone else’ theory, should have their head examined.\nR\n\n","date":"October 20, 2012 at 5:49 am","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17920","author":"Ron","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"Ron, please remember that along the centuries, at least in Spain and since 15th Century in the Philippines due to the Spanish influence, in Eastern very realistic representations of the Passion have been taken place. In Spain and Philippines nowadays in hundreds of locations men volunteer to represent the whole Passion, including the crucifixion. We are talking of thousands and thousands of men who throughout History have suffered very similar tortures as those described in the gospels. Moreover, the ceremonies were intended to reproduce as exactly as possible what the gospels explain.\nCurrently, volunteers don not die, but in their more realistic versions, as we see in Philippines they need weeks to recover.\nI guess that the more we go to past centuries, the more realistic these celebrations must have been and we cannot -I agree with Yannick at this point- completely rule out the hypothesis that in the frame of these medieval celebrations, for any reason, someone really died and then the next step of his burial -as described by gospels- was also carried out.\n\n","date":"October 20, 2012 at 6:24 am","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17923","author":"Gabriel","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"Gab, you are forgetting that this Shroud and it’s Image dates well before the 15th century, which would eliminate any real or mocked crucifixions you mention. I don’t know about the realism of the Phillipine mock crucifixions either. I’ve viewed several videos on the practice and the scourging is very minimal, they don’t use vicious weapons as the flagrum and they nail thru the most soft areas of the flesh of the palms to cause very little damage, Hense not much coincidence too what we see on the Shroud.\n\n","date":"October 20, 2012 at 10:29 am","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17928","author":"Ron","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"The quote of Walsh is completely off-track…  There is absolutely NO possibility that the Shroud could be the work of an artist Ron!!!!  Haven’t you read the four possible scenarios I have described in my paper about the bloodstains evidence ?  The first two scenarios are, scientifically speaking, the only ones that could have any chance to explain the Shroud with another crucified man than Jesus of Nazareth.  THIS IS NOT AT ALL WHAT WALSH WAS SAYING !\n\n","date":"October 21, 2012 at 5:49 pm","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17988","author":"Yannick Clément","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"According to an email I received from a friend, a gentleman named Francis DeStefano recently spoke to John Walsh and learned that Walsh “now considers the Shroud of Turin to be a medieval forgery”. Does anyone know if this is true?\n\n","date":"October 20, 2012 at 12:07 pm","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17936","author":"Jesse","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"Why don’t you try contacting Mr. Walsh and asking him directly? This is simply hearsay, but even if he does believe as so now, it does not change the logic of his statement quoted above, now does it?\nR\n\n","date":"October 21, 2012 at 3:45 am","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17960","author":"Ron","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"If Walsh thinks that way, that just prove he has a very wrong judgement about the whole issue and this off-track judgement can easily been seen in the particular quote from him that was given to us by Dan on top of this page.  Just from this quote, it’s evident that this guy didn’t understand the topic very well…  And sadly, he’s far from being alone in his case !\n\n","date":"October 21, 2012 at 5:52 pm","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17989","author":"Yannick Clément","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"One major point everyone with their possible ‘someone else’ scenarios seem to be forgetting; This point has been scientifically observed by the way, and not assumed; The blood markings on the Shroud SHOW NO SIGN OF DISTURBANCE! Simply meaning there is no evidence of the Shroud being removed from whatever surface caused the blood stains! No signs it was ‘lifted’, ‘pulled’ or simply that it had ‘fallen’ away, no sign whatsoever! How does one explain this scientific observance, if any of the ‘someone else’ scenarios are proposed?\nR\n\n","date":"October 21, 2012 at 4:47 am","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17964","author":"Ron","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"And Ron, I just wants to remember you that there’s another great sign that the Shroud is most probably the one of Jesus and this sign simply comes from the fact that this blood stained burial cloth that has contained for a short period of time the crucified body of a real man that shows all the stigmata of Christ HAS BEEN KEPT AND WELL-PRESERVED !!!!  It’s ONLY in the light of the Resurrection event that we can understand why someone would have wanted to keep and preserved such a gruesome gravecloth !!!!  That doesn’t mean this is a proof of the Resurrection of Christ but this can be seen as a great sign of it because it imply that the person who decided to keep and preserved such a cloth MUST have been convinced that Jesus had resurrected and wasn’t dead no more…  MEDITATE ON THIS FOLKS !!!!\n\n","date":"October 21, 2012 at 5:57 pm","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17990","author":"Yannick Clément","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"The TS (as in-soaked long inner burial linen cloth) just got sort of gradually taut again and unstuck front and back from the body skin through lengthwise pressure increase via gradual evaporation and shrinkage.\n  The absence (back and front) of almost any air gap between the width wise compressed burial sheet tautly wrapped lengthwise around the stiff rigid corpse in blood (still in hyperthermia at 41-42°C?), in extra height on two stones  and soaked in warm alkaline solution (ashes and/or limestone mixed with water) and the body skin acted as a body shaped collimator when the widtwise and lengthwise tightly wrapped up corpse was subjected to an aloetic/myrrhic-aloetic fumigation and the watery solution started to evaporate. \n  The linen cloth back and front were coincident with the central axis of the watery solution molecular beam and almost no air gap front and back was left during the image formation process…\n\n","date":"October 21, 2012 at 10:59 am","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17974","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"mistyping: got sort of gradually taut again and unstuck front and back from the body skin through lengthwise pressure RELEASE via gradual evaporation and shrinkage\n\n","date":"October 21, 2012 at 3:27 pm","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17978","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"Max, I have a good question for you in the light of your personal natural hypothesis for image formation :  What is your thoughts about the probable released of water vapor by the corpse inside the Shroud and his probable implication in the image formation ?  \nIn the STURP paper written by Rogers and Schwalbe, they reports one very interesting image formation process proposed by one member of STURP (John D. German, who took his idea from another hypothesis proposed by Sam Pellicori, also from STURP) that imply that the cloth was very stiff at the beginning but after sometime, it started to slowly collapse on the body because of the water vapor released by the corpse and maybe also because of the damp environment of the stone tomb.  And each time there would have been a direct contact with the body and the cloth, this would have start a chemical process (a bit like the Volckringer process if you will that could have been initiated by the sweat or other substances on the skin) that would have lead eventually to the formation of a coloration.  And the more the contact was long (like in the nose or the hand regions), the more fibers would have been colored…  In my mind, this is very Interesting and should be examined more in deep by a biochemist !!!\n\n","date":"October 21, 2012 at 6:06 pm","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-17992","author":"Yannick Clément","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"As I previously wrote in this blog: \nThe fact is the possible presence of remoistened dried-off urea residue all over the body skin of the TS man could have caused the release of collimated ammoniac gases under this ONE very specific circumstance: the ritual fumigation of the TS man’s  tightly wrapped up stiff rigid corpse within an in-soaked long inner burial sheet (the TS man’s being first tighltly wrapped up is a must here (no or next to no air-gap body-to-cloth front and back ) . \nThis would account for the body image “fast aging” as opposed to Sam Pellicori’s hypothesis implying a “very slow aging” body image).\n\n","date":"October 22, 2012 at 6:46 am","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-18024","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"Some biochemist should test your hypothesis, along with many others natural hypotheses that have been proposed over the years…  People seems to only stick to Rogers hypothesis when it comes to think of a natural scenario but that’s a misconception.  Other natural avenues (like the many possible hypotheses involving some sort of Volckringer pattern) are still possible to explore and should be tested by competent biochemists.  Here, I don’t mean Rogers hypothesis is surely false but other possible natural hypotheses should also be considered as potential candidates to explain the image and should be tested properly (which is something that has NEVER been done so far).\n\n","date":"October 22, 2012 at 8:30 am","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-18029","author":"Yannick Clément","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"Yannick, 100% agreed.\n\n","date":"October 22, 2012 at 11:19 am","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-18039","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Central Dilemma of the Shroud?","post":"Hi Fellows,\nLet’s not forget that the forger gathered pollen from a good many of the plants blooming in Spring in and around Jerusalem.  He then sprinkled the pollen on the cloth at various points making certain to put a little extra where the crown of thorns was on the head.  Not only that, but he dabbed a smattering of limestone near the crucified man’s feet that is only present in Jerusalem.  \nI’VE GOT IT, I’VE GOT IT, I’VE GOT IT!!  The forger was a time-traveler who came from our future and went back to our past just to mess with us!!  I say that because of the pollen.  How did he know?\n\n","date":"November 9, 2012 at 10:29 pm","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","id":"comment-18936","author":"Sheila","site":"shroudstory"}]
