[{"title":"The Cluny Medal with shields of Geoffrey de Charny and Jeanne de Vergy","post":"Actually, “the alleged crown of thorns” is only a circlet of rushes without any trace of thorns and still kept at the Paris Sainte-Chapelle (the circlet just held Yeshua’s head cap of thorns together around his head)\n\n","date":"April 23, 2012 at 1:12 pm","url":"https://shroudstory.com/2012/04/23/the-cluny-medal-with-shields-of-geoffrey-de-charny-and-jeanne-de-vergy/","cat":"history","id":"comment-10748","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Cluny Medal with shields of Geoffrey de Charny and Jeanne de Vergy","post":"Medieval French secret fraternities such as “les chevaliers de l’étoile” (XIVth century CE) and “les chevaliers du broullard” (XVth century CE)  took up the Shroud secret thread. However public Lirey pilgrimages did cover the second half of the XIVth century CE) with a two decades’ interruption.\n\n","date":"April 23, 2012 at 2:54 pm","url":"https://shroudstory.com/2012/04/23/the-cluny-medal-with-shields-of-geoffrey-de-charny-and-jeanne-de-vergy/","cat":"history","id":"comment-10756","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Cluny Medal with shields of Geoffrey de Charny and Jeanne de Vergy","post":"Colin’s mis-interpretation of many of the symbols seen on this metal just goes to show my several previous comments that maybe a new pair of glasses are warranted is correct  ;-)\nBlood stains turn to chains, firm body features turn to armour, etc; etc; yet clues such as herringbone weave, the naked body, the flagrum, the nails, the tomb seem to disappear in his analysis.\nIt has been stated that the medalion was most evidentally created whilst de Charny was still alive and as the Lirey expositions were ongoing, this conclusion comes from the depiction of the coat of arms and their ‘specific’ positioning. This was covered in detail in Wilson’s latest book The Turin Shroud and backed by others. So the medallion would be pre-1356. Medallions were common place among pilgrims in the middle ages and apparently it was good luck to toss them into waters, hense the finding of this medalion in the siene river.\nRon\n\n","date":"April 23, 2012 at 3:11 pm","url":"https://shroudstory.com/2012/04/23/the-cluny-medal-with-shields-of-geoffrey-de-charny-and-jeanne-de-vergy/","cat":"history","id":"comment-10758","author":"Ron","site":"shroudstory"},{"title":"The Cluny Medal with shields of Geoffrey de Charny and Jeanne de Vergy","post":"Dan, Thanks for this posting.  I had been aware of this badge as Ian Wilson refers to it in both his 1978 & 2010 books.  I had been misled by the comments in the previous posting suggesting that the images were intended to be representative of the Templars Molay & Charnay.  I had incorrectly presumed that the medal referred to there was a separate and different object.\n\n","date":"April 23, 2012 at 4:41 pm","url":"https://shroudstory.com/2012/04/23/the-cluny-medal-with-shields-of-geoffrey-de-charny-and-jeanne-de-vergy/","cat":"history","id":"comment-10774","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Cluny Medal with shields of Geoffrey de Charny and Jeanne de Vergy","post":"I am s-o-o-o- disappointed. I thought Colin had really made an intelligible post. Of well, as Scarlett O’Hara said: Tomorrow is another day.\n\n","date":"April 23, 2012 at 7:33 pm","url":"https://shroudstory.com/2012/04/23/the-cluny-medal-with-shields-of-geoffrey-de-charny-and-jeanne-de-vergy/","cat":"history","id":"comment-10790","author":"John Klotz","site":"shroudstory"}]
