[{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"The “Pray Codex … is an old handwritten Hungarian text dating to 1192-1195” (“Pray Codex,” Wikipedia). Therefore what looks like an “a” in “The Visit to the Sepulchre” (Berkovits, I., “Illuminated Manuscripts in Hungary, XI-XVI Centuries,” 1969, plate III lower), is presumably in Old Hungarian (although it could be Greek or Latin). \nAccording to Wikipedia’s “Old Hungarian alphabet” page, the nearest letter to it appears to be “M.”\nI haven’t read anywhere what the letter represents. I doubt it is the artist’s initial because he hasn’t signed it in his other two drawings, and if he did sign his initial one would expect it down in a corner. So presumably it has something to do with Christ’s resurrection.\nThe drawing depicts the scene in Mark 16:1-7, in the emply tomb, where Mary Magdalene, Mary the mother of James, and Salome (the Apostle John’s mother and Mary the mother of Jesus’ sister) are told by an angel, “Do not be alarmed. You seek Jesus of Nazareth, who was crucified. He has risen; he is not here. See the place where they laid him.” So it may symbolise the angel’s words.\n\n","date":"March 18, 2013 at 4:42 am","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27602","author":"Stephen E. Jones","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"The only things I can think of:\n-is it a stylised ‘a’ for ‘alpha’?\n– is it some kind of symbol connecting what might be the face cloth with the head of Jesus?\nSomething I’ve asked before – does anyone know what the WORDs in the pray codex say? they are in Hungarian I presume. Usually you would expect pictures to complement words. Perhaps the words elaborate on the meaning of the pictures.\n\n","date":"March 18, 2013 at 4:48 am","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27604","author":"Matthias","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"\nMatthias :\n-is it a stylised ‘a’ for ‘alpha’?\n\nI would say so.\n\n","date":"March 18, 2013 at 4:51 am","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27605","author":"anoxie","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"The old Hungarian Runic script mentioned by Stephen, appears to have fallen into disuse with the founding of the kingdom around 1000 AD, when it was replaced by a Latin script, with Latin as the official written language. Apparently few examples of the old script survive although an interest in its revival as a type of ethnic expression has surfaced in the last 100 years or so, e.g. in “Welcome” signs. I personally do not make the connection that Stephen mentions as an “M”. \nThe “Funeral Sermon and Prayer” in the ‘Pray’ manuscript is the oldest known surviving contiguous Hungarian text, written by one scribal hand in the Latin script and dating to 1192-1195. It is found on f.154a of the Codex Pray.\nI would surmise that by 1192, the old runic script might well have been considered to have pagan connotations, as occurred with the Baltic runes, and there could have even been some revulsion at the idea of including them in a Christian worship hand-book. It is possible that the symbol mentioned may be a stylised ‘a’ for “Alpha”, or it may denote something else entirely.  It does not have the appearance of a lower-case Greek alpha.  However if it is intended to be an “Alpha”, I might surmise that it could indicate a new beginning, being associated with the Resurrection scene. It may of course signify something entirely different.\n\n","date":"March 18, 2013 at 6:00 am","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27618","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"The whole Codex seems to consist of a variety of unrelated papers which came together some time between the first one being written/drawn and Gyorgy Pray finding them in 1770. All the writing I have seen seems to be in fairly conventional Latin style (even if the language is sometimes Hungarian) rather than the runic referred to above. The famous Funeral Prayer, however, is written in a much neater and clearer hand than the writing on the pictures, which is almost indecipherable. And although the Funeral Prayer is in Hungarian, I think the writing on the pictures is in Latin. Although the whole codex is clearly an important collection, I cannot find any books or online articles which treat it as a whole, which I find extraordinary. Wikipedia tells me it also contains a missal, a mystery play, songs, laws and a list of kings. Any or all of these might have some relevance to the interpretation of the pictures. (Could, for example, the pictures be illustrations of the mystery play?) I doubt if the lowercase ‘a’ is a reference to Alpha (as a symbol of godhead or resurrection), which is invariably capitalised.\n\n","date":"March 18, 2013 at 6:44 am","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27621","author":"Hugh Farey","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"I said it once (on this vey blog, about mid-june 2012) I say it twice:\n  One must keep in mind that medieval Benedictine monk artists and/or scholars were well versed in the art of hiding (secret/sacred) informations (e.g. in innocuous miniatures like we have here). This cryptographic art is known as steganography and dates back as early as the 5th century BCE.\n  The Pray codex Hungarian Benedictine monk artist’s steganographic signature at least appears twice within two of his 5 pen & ink miniatures:\n– First in cursive uppercase letters (medieval script) embedded into the burial sheet lower folded line (upper section, anointing scene miniature) and reads ‘ALMOS’.\n– Then in cursive lower case letters (medieval script) as ‘a-lmos’ embedded into the profiled face hidden into the first mary ‘s sleeve and read in conjunction with the “a”.\n– Beside, at first sight, the face  hidden into the first Mary ‘s sleeve is to identify the latter as ‘Mary of Joseph’. Now in Hebrew Yossef can mean “(HE) ADDS UP”, which is totally consistent here BOTH with ‘a face being ‘added up’ to the sleeve and the Benedictine monk’s signature ‘almos’ being ‘added up’ to the scene in conjunction with the name ‘Jozsef’.\n – Finally, if we take a very close look, the face in the sleeve is seen with the eyes shut. This is the clinch to confirm our deciphering as his first name/surname/family name,  ÁLMOS/almos, is the very Hungarian name of the legendary founder of Hungary, meaning “dreamy; sleepy” or, according to folk etymology, “the Dreamt One/Child.”\n  Hence, if my deciphering is correct the miniaturist name would be no other than JÓZSEF ÁLMOS.\n\n","date":"March 18, 2013 at 8:04 am","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27629","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Typo: lower semi folded line in the miniature upper section\n\n","date":"March 18, 2013 at 11:41 am","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27651","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"PS the ‘Joseph’ hidden into the first Mary’s sleeve would be the Benedictine monk artist’s steganographic self portait.\n\n","date":"March 18, 2013 at 8:19 am","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27631","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Some here might be interested to be made aware the existence a little known branch of scholarship, devoted entirely to the shooting down of steganography (see above).  It is called, er,  stengunography. \nHere’s an example of the genre from another site, not a million miles from this one, that was posted about an hour ago:\n“Merged into the dress of the Holy Mother(?) with the flask of oil, there’s that head of an elderly man. I seem to recall that has been interpreted by some as indicating the presence of God the Father. In view of the direction that head is pointing, ie. toward the (just?) vacated shroud, I wonder if he’s not there to represent a miraculous life-restoring breath from On High, and that “a” is some kind of letter that alerts the viewer to that idea of Paternal Assistance (PA for short). Just a thought.\nPS. Note the way the angel’s finger points straight at that “a”.\nAnd I have just found this, merely by inputting “latin word for life”, so was intrigued to see the bolded phrase:\nanima : “life” , “breath of life” , “the vital principle”\nMight that be “a” for anima?\n\n","date":"March 18, 2013 at 8:32 am","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27632","author":"colinsberry","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"The very first Benedictine miniature to feature Christ/Yeshu’a in conjunction with a herringbone patterned cloth and the Book of ReVE(I)Lation is the 8th century CE Tirer-Echternach missal miniature. Most obviously this is too far beyond CB’s rampant arrognorant scope and his pseudoknowledge of Benedictine steganography.\n\n","date":"March 18, 2013 at 12:11 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27655","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"…cursive lowercase “a” for apocalypsis/revelation?\n\n","date":"March 18, 2013 at 12:13 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27657","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"This Benedictine art work implies gradual decoding of the discreet for the benedictine monks and nuns to finally reach and meditate the revelation/apocalysis of Yeshua/Christ/God.\n\n","date":"March 18, 2013 at 12:48 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27660","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Typo: apocalypsis\n\n","date":"March 18, 2013 at 12:49 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27661","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Reminder for CB: Benedictine monks and nuns’s main goal was/is the quest of God/Christ. As early as the age of twelve, Benedict of Nursia (Umbria, central Italy) who founded the Benedictine Order (in the 6th century) was familiar with Syrian monks leading an eremitic life in the valleys of Umbria.\n\n","date":"March 18, 2013 at 12:26 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27658","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"More typo: quest FOR G.od\n\n","date":"March 18, 2013 at 1:20 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27665","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Typo: monks’ and nuns’\n\n","date":"March 18, 2013 at 12:27 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27659","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Interesting speculation, Max. Are you alone in your interpretation or are there other steganographers of similar mind? I confess I myself cannot see anything corresponding to Joseph Almos except that A.\n\n","date":"March 18, 2013 at 12:57 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27662","author":"Hugh Farey","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"To read a ‘medieval crytoscript’ you do need pratice/training. A-L-MoS does read like a semi-flourished medieval signature embedded  into the lower semi folded line in the miniature upper section. I know it is not that obvious to read. This is medieval half-hidden, half-revealed information.\nThe given name Joseph is to be deduced in conjunction with the identification of Mary of Joseph by the hidden face into her sleeve. For a comparative analysis see Joseph’s face in the Assumption of the Virgin, Chiesa di Santa Maria dell’Ammiraglio. Palermo (Sicily) (Italy). 12th century.\n\n","date":"March 18, 2013 at 1:35 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27668","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"In the 12th c. CE mosaic, Joseph’s face appears as if in the very cloth of the Holy Virgin.\n\n","date":"March 18, 2013 at 1:51 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27670","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Joseph’s face is here referring to Latin apocrypha ‘The Passing of the Blessed Virgin Mary’ (seventh century), attributed to Joseph of Arimathea\n\n","date":"March 18, 2013 at 2:45 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27677","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Typo: ‘medieval cryptoscript’\n\n","date":"March 18, 2013 at 1:39 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27669","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"First time I viewed the Pray codex and the scene discussed here, I just had a instinctive feeling the ‘a’ simply symbolised ‘alpha’ and noticing the angel pointing directly to the alpha meaning, he has told the visiting ladies that the Lord is not here, that he has risen i.e a new beginning. Ofcourse this is just my interpretation with no scholarly works to back it up, but as I said it simply struck me as it’s pretty clear meaning….nothing hidden or secret. I believe in many cases people try to read too much into things. Remember Jesus’s words; “only thru the eyes of a child”.\nR\n\n","date":"March 18, 2013 at 2:55 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27678","author":"Ron","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Quote : “I believe in many cases people try to read too much into things.”\nRon, you’re perfectly right about that!  BUT… don’t you realize that Ian Wilson (among many others) has made his bread and butter by doing exactly what you just describe, especially when it comes to the Shroud’s unknown history?\n\n","date":"March 19, 2013 at 10:40 am","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27792","author":"Yannick Clément","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Ron, I would reply through Mark 4:22: “For there is nothing covered that shall not be revealed, and nothing secret that will not be discovered”, a sentence which implied/implies THERE ARE/WERE things covered and secret indeed. As a cryptologist, I would just advise you to not to rely too much on ‘your layman’s instinct’ when it comes to analyse/interpret a 12th c. CE Benedictine miniature.\n\n","date":"March 18, 2013 at 3:56 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27684","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"So Max are you implying the pray codex was written in Mark’s time? LOL, think about it Max, why would a mong place a lowercase ‘a’ right in the focus of a picture if it was to be a secret code. You mnay be a cryptologist, but I think you ‘may’ be putting just alittle too much into it.\nR\n\n","date":"March 18, 2013 at 5:40 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27697","author":"Ron","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Sorry typing error; sb; why would a monk place a lowercase ‘a’ right in the focus…\n\n","date":"March 18, 2013 at 5:42 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27698","author":"Ron","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Typo: advise you not to\n\n","date":"March 18, 2013 at 3:57 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27685","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Ron, BTW, can you account for the miniaturist’s need\n– firstly to write the alpha in cursive lowercase letter and not uppercase letter\n– secondly omit the omega?\n\n","date":"March 18, 2013 at 4:06 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27687","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Sure! It doesn’t matter if it’s lowercase or uppercase the message is still understood, as evidenced by several here interpreting it as such, and many others, no doubt. Secondly the alpha being alone without the omega implies the ‘beginning’ of a new era. So why would one need to add the omega? Seems reasonable to me, without putting too much into it…Ofcourse that is simply a humble laymen’s perspective.\nR\n\n","date":"March 18, 2013 at 5:49 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27701","author":"Ron","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"To paraphrase you,I would say: I believe in SOME SPECIFIC cases people try to read too LITTLE into things. Remember Jesus’s words; “For there is nothing covered that shall not be revealed, and nothing secret that will not be discovered”.\n\n","date":"March 18, 2013 at 4:09 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27688","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Thanks, Max. I see this was quite well covered before I joined in this blog, in a post called “A Pointless Discussion of the Hungarian Pray Manuscript.” There, you quote  M. van Cauwenberghe, in his identification of the music at the bottom of the Christ Enthroned scene with the Easter ‘Exultet’ which even I can see now, and it is clearly in Latin. The writing above is more difficult to decipher, but I think I can make out “et dixit Lazaro veni foras” which is close to the Vulgate version of Jesus’s calling of Lazarus out of his tomb. Above it are “salvatorem mundu” (Should be mundi) and above that a definite “baptista.” Clearly not a single quotation fro the bible, but definitely Latin. There appear to be several more “salvator”s and “veni foras”s elsewhere in the text. Can anybody get any closer?\nAbove the anointing scene it is even more difficult to make out the words. Do they begin: “In principio creavit deus caelum et terram”?\n\n","date":"March 18, 2013 at 5:45 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27699","author":"Hugh Farey","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Reminder: The Pray codex was prepared at the Boldva Benedictine Monastery (Hungary). One of the medieval Benedictine monks’ and nuns’ steganographic techniques consisted in scattering/fragmenting a secret/sacred informative image into spy clues to be reinserted in a series of 3 to 5 illustrations within the same manuscript.\n\n","date":"March 18, 2013 at 7:14 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27710","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Ron you wrote: ‘why would a monK place a lowercase ‘a’ right in the focus of a picture if it was to be a secret code’.\nIn all likelihood referring to the name ALAMOS embedded in , the angel (= messenger)’s finger points straight at that “a” in conjunction with Joseph’s profile hidden into the sleeve to read a medieval script styled ‘L’ in the shape of his forehead + eyebrow line, a  ‘m’ (in the shape of  mouth + nose-tip line), an ‘o’ in the shape of lowered eye-lid line and an ‘s’ in the shape of nose + chin line.\n\n","date":"March 18, 2013 at 7:43 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27715","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Typo: ALMOS\n\n","date":"March 18, 2013 at 7:52 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27719","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Typo: In all likelihood referring to the name ALAMOS embedded in the burial sheet lower semi-folded line in the miniature upper section\n\n","date":"March 18, 2013 at 7:46 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27716","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"This yields JÓZSEF ÁLMOS. Cryptoliterally speaking (the Bendictine monk steganographer) ADDS UP (a) DREAMER/SLEEPY (elder man) into the scene namely (Heb;) Yossef (Mag.) Almos.\n\n","date":"March 18, 2013 at 7:51 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27718","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":">Typo: ALMOS\n>Typo: In all likelihood \nMax, how about checking your comments first, before cluttering up our inboxes with your “typos”.\nOr if a typo does slip through, credit us all with the IQ to realise it is a typo and don’t bother writing another comment just to tell us what we already know,\n\n","date":"March 18, 2013 at 8:04 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27721","author":"Stephen E. Jones","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Sorry Stephen for my hasty commenting in snatches while working on one of my own professional files.\n\n","date":"March 18, 2013 at 8:32 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27724","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"…”a” for Latin addendum, “addition” (in conjunction with the Hebrew yossef, “(he) adds up”.\n\n","date":"March 18, 2013 at 8:04 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27722","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"It does not look an ‘a’ at all. What I see are 3 separate marks, ‘c’ with what looks like a crescent moon above it and a curved letter ‘l’ as in ell in lower case. The marks are not connected at all. From the distance, it looks like an ‘a’, but up close, its actually 3 separate marks. The ‘cresent moon’ mark shows end points tapered. Same with the curved ‘l’. The ‘c’ is slightly squared at the ends.\n\n","date":"March 18, 2013 at 8:50 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27726","author":"Donn Reile","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"I agree with Donn.  Zoom it up to 400%, and you can also see some of the lettering in the text as well. Occurrence of ‘a’ in the text has the shape of a Bahamas type font without the top curl rather than an Arial type font (text ‘a’ is like a child’s printed ‘a’ –  a circle with a vertical stalk).  Donn’s “crescent” has the shape of a tilted ‘L’, or a rotated circumflex – a diacritic mark perhaps? If it’s an artist’s signature mark, then it might be say “c(= ch?) l”.  If the mark is meant to be an ‘a’ then it’s not the same as the text.  (Assumes text and drawings are by the same pen.)\n\n","date":"March 18, 2013 at 10:05 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27731","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"I agree it’s nothing like the ‘a’ in the body of the text – but to me it’s still an ‘a’ of sorts, probably made with three strokes of the pen which didn’t coincide. I wonder if it’s a later annotation? Back on Picture 4, Christ Enthroned, the text is full of long abbreviations. Could they be numbers, or better still dates?\n\n","date":"March 19, 2013 at 5:54 am","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27769","author":"Hugh Farey","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Hugh, Zoom it up to say 400%, it’s clearly three distinct character marks.  Maybe it only looks like an ‘a’ because of our modern fonts.  We’re talking no later than 1195 if it’s concurrent with the drawing.  We need to check out some historical scriptography.  How soon did the letter ‘a’ acquire its modern top curl-over? It doesn’t look like a lower-case alpha.\n\n","date":"March 19, 2013 at 6:12 am","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27770","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Further to my response to Hugh above: I went searching and came up with a PDF of Latin Paleography by Juan J Marcos a Spanish Professor of Classics, 78 pages 3.2 MB which can be downloaded.  Several examples of medieval fonts with some background history.  As far as I can tell from initial quick scan, the modern Times Roman ‘a’ seems to have originated with the Gothic script forms around 1200 AD. The Carolingian Minuscule dominated from 800 to 1200 and extended from Spain to Scandinavia, England to Italy. Text of the Pray MS seems to be close to Carolingian. Up to about 1200, forms of the ‘a’ seem to be a connected oi or an oc. It’s a fascinating document. It can be found at:\nhttp://guindo.pntic.mec.es/~jmag0042/LATIN_PALEOGRAPHY.pdf \nIf our subject mark is in fact an ‘a’, then it would seem likely it was added by a later hand influenced by Gothic forms. Otherwise I’d stick with Donn Reile’s identifying it as three separate character marks.\n\n","date":"March 19, 2013 at 7:00 am","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27772","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Dave et al,\nMethinks you’re making too much fuss out of too little. The Pray codex lower case letter “a” standing alone, drawn in 3 strokes that don’t run together with non-flattened top is NOT of really unusual appearance. As East Frankish 10th-13th c.CE “post-Carolina” hand, its form is fairly familiar to anybody used to read medieval manuscripts.\nThe true oddity is the ‘lettera discontinua’ “a” reads in triangular conjunction with the angel/messenger’s right index fingertip and Joseph hidden face’s lowered left eyelid in the shape of the letter “o” to catch the sagacious reader’s attention on a “hidden revelation”/(crypto) apocalypsis (“a”). Reminder: “I am the Alpha and Omega”) is first found in Chapter 1 verse 8, and is found in every manuscript of Revelation that has 1v8.\n\n","date":"March 19, 2013 at 12:48 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27804","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"I could find no examples of the “a” in any pre-Gothic scripts in Marcos’ work cited above. I might be persuaded if I can be pointed to examples occurring before 1200.  I think it significant that the text is in a Caroline-type script and the subject symbol if an “a” is clearly not.\n\n","date":"March 19, 2013 at 3:36 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27823","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"The letter “a” that STANDS ALONE is in East Frankish “POST-Carolina” Latin script (10th-13th c. CE). The scribe did not connect the 3 strokes for the OPEN letter “a” to echo with the lowered eyelid in the shape of a lower case OPEN letter “o”.\n\n","date":"March 19, 2013 at 4:00 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27827","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"El angel tiene 6 dedos ( 5 dedos se ven + 1 dedo pulgar que está oculto).\nCarlos Otal\n\n","date":"March 19, 2013 at 1:29 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27809","author":"corneliotel","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"The angel/messenger points with the right hand, the first and fifth fingers raised, the thumb holding down the others against the palm, to represent horns. The hand gesture with six fingers evokes the passion of the Christ who suffered the sixth day (see Origen).\n\n","date":"March 19, 2013 at 3:24 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27819","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Whence (in all likelihood) the viewer can deduce the “hidden revelation” is not so much about Christ/Yeshu’a resurrection than about his passion and death.\n\n","date":"March 19, 2013 at 3:32 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27822","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Typo: not so much about Yeshua’s resurrection as about his passion and death\n\n","date":"March 20, 2013 at 5:37 am","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27879","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"In he miniature field, the added-up lower case open letter “a” (reading disconnected as “c i” with non- flattened top) stands for  “apocalipsis ihesu christi” (a + ci/ic), “revelation of jesus christ”;\n\n","date":"March 20, 2013 at 6:48 am","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27886","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"1192-1195  c. CE Benedictine miniatures by Joseph Almos (the Elder?).\n\n","date":"March 20, 2013 at 10:49 am","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27907","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Great find, Max. I have been looking at medieval manuscript symbols. How were you able to locate the symbols?\n\n","date":"March 20, 2013 at 10:52 am","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27908","author":"Donn Reile","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Donn, the hand gesture (with six fingers) is referring to Yeshua who in the sixth day, and at the sixth hour, was nailed to the Cross (see Eastern monk’s prayer of the sixth hour + Origen + Hand gesture medieval symbolism).\n\n","date":"March 20, 2013 at 2:15 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-27925","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Addenda:\n– Yeshua was arrested at the 6th hour of the night and nailed at the cross at the 6th hour of the  day on the 6th day of the Judean week.\n– The Victory sign hand over Shatan as Ba’al-Zebul, Heb. for Lord-of-the-Flies i.e. Death (see also the ram worshiped also as Baʿal-Qarnaim (“Lord-of-Two-Horns”)\n– In the Monastery Shemokmedi, Caucasus, western Georgian province of Guria, you can find a 12th c. CE wall painting of a sixfingered angel\n\n","date":"March 22, 2013 at 5:39 am","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-28033","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Addenda +:\n  The medieval Latin-script ‘open’ lowercase letter “a” (or littera discontinua) drawn in three strokes is to be read in triangular conjunction with the Hungarian Benedictine monk artist’s disembodied left profiled face lowered eyelid in the shape of an open lowercase “o” hidden into the first Mary’s sleeve and the angel’s six-fingered (thumb unseen) right hand index fingertip pointing at the empty tomb an apotropaic hand of Victoria/Victory.\n  The downward-pointing subtle triangular interrelation here forms the terrestrial Shield of the Holy Trinity (see the upward-pointing triangle of the celestial Shield of the Holy Trinity drawn in conjunction with the late 11th century CE fresco of the Mandylion in Sakli church, Gôreme, Cappadocia).\n  The ‘open’ letter “a” can read both anatasia ihesu christi, “resurrection of jesus christi’ and apocalipsi iehsu Christi, “revelation of Jesus Christ’ (to joseph almos the elder).\n\n","date":"March 23, 2013 at 9:01 am","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-28160","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Curious ‘a’ in the Hungarian Pray Manuscript","post":"Typo: anastasia\n\n","date":"March 23, 2013 at 12:17 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","id":"comment-28171","author":"Max Patrick Hamon","site":"shroudstory"}]
