[{"title":"The Gibson Study Really Says Nothing About the Shroud of Turin","post":"Another reason why Gibson’s argument is fallacious is that it assumes that the linen of the Shroud of Turin was intended to be a burial shroud.\nBut the Bible only says that “Joseph [of Arimathea] bought some linen cloth …” (Mk 15:46) which he then used as a burial shroud for Jesus’ body. And that Joseph had to buy the linen cloth in a hurry, because “the Sabbath was about to begin” (Lk 23:54).\nTherefore it is entirely possible and consistent with the Biblical evidence that the linen of the Shroud of Turin was intended, not for a burial shroud, but for clothing, as Hoare pointed out:\n“While the exact time and place of manufacture are uncertain, there can be no doubt that the Shroud is a beautifully made length of cloth, and probably cost a very great deal. This has prompted the suggestion that it was intended as apparel rather than a shroud. There is a lot of sense to this. A shroud would probably have been made from the simplest weave, which is why the funeral cloths that have been preserved from early times are nearly all plain weave. Garments do not survive so frequently.” (Hoare, R., 1995, “The Turin Shroud Is Genuine: The Irrefutable Evidence,” p.18).\nStephen\n\n","date":"February 3, 2010 at 6:36 am","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","id":"comment-995","author":"Stephen E. Jones","site":"shroudstory"},{"title":"The Gibson Study Really Says Nothing About the Shroud of Turin","post":"Stephen, good morning:\nIt is all speculation. Hoare’s suggestion that the cloth was intended for clothing is, of course, a possibility. And then we have John and Rebecca Jackson suggesting that it was a tablecloth, and not just any tablecloth, mind you, but the tablecloth used at the last supper. And then, too, we have John Lupia suggesting it was a Jewish tallit. One thing that challenges but doesn’t disprove these speculations is the side strip. It seems apparent that the cloth’s loom width was reduced by cutting it near one edge and reattaching the selvedge. \nLinen was used for many purposes. We have references to linen curtains in the temple and it quite plausible that drapery was used in homes, particularly the homes of those who could afford such luxury. And we can certainly suspect that linen may have been also used as bed cloths. \nStephen, your point about having to obtain the cloth in a hurry is well taken. It could have been a piece of linen from the marketplace intended for any purpose. Indeed, as clothing, it may have been a himation, which is what John of Damascus called it several centuries later. But it could also have been, as I speculated, an upscale burial shroud given that there were other upscale qualities to some of the tombs and ossuaries.\n\n","date":"February 3, 2010 at 8:59 am","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","id":"comment-997","author":"Episcopalian","site":"shroudstory"},{"title":"The Gibson Study Really Says Nothing About the Shroud of Turin","post":"Dear Episcopalian\nBy the way, Hoare was not the first to suggest the Shroud of Turin was a garment. Timossi made this suggestion in 1941 that it appeared to be intended as a bed sheet. John Tyrer suggested it has the necessary consistency for the practical considerations as a garment in 1981.\nYou can read my book on the subject of the Shroud of Turin being a Jewish tallit: The Ancient Jewish Shroud At Turin (Regina Caeli Press, 2010) ISBN : 978-0-9826739-0-4\n$27.99 + $4.50 shipping & handling\nhttp://www.reginacaelipress.com\n\n","date":"March 1, 2010 at 4:08 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","id":"comment-1070","author":"John N. Lupia","site":"shroudstory"},{"title":"The Gibson Study Really Says Nothing About the Shroud of Turin","post":"Dan\n>One thing that challenges but doesn’t disprove these speculations is the side strip. It seems apparent that the cloth’s loom width was reduced by cutting it near one edge and reattaching the selvedge. \nI missed this before. The evidence now is that there is no side strip. That is because xrays taken by STURP in 1978 show that the weave is continuous throughout both the Shroud and the `side strip’. The `seam’ is now thought to be a folded and sewn “cord” to pass a  thin rope or wire through or to otherwise help support the holding of the Shroud during displays. \nHere are quotes to that effect. \n“The radiograph … suggests that the side strip either is, or at least was, at one time an integral portion of the full cloth. In this particular area, there are alternating high- and low-material-density `bands’ that evidently correspond to weft lots of different weight used in the weaving. (The visible-light transmission photographs of Schwortz also clearly show these structures.) … The distinct weft structure is continuous across the seam joining the two panels and strongly suggests that the side strip and the main section were of a single manufacture.” (Schwalbe, L.A. & Rogers, R.N., 1982, “Physics and Chemistry of the Shroud of Turin: Summary of the 1978 Investigation,” Analytica Chimica Acta, Vol. 135, No. 1, pp.3-49, pp.41-42).\n“This side strip is made from the same twilled cloth of the Shroud, of which it originally formed part; in fact, the irregularities of the weave, clearly visible in the principal section, extend exactly to the side strip, as can be seen from the radiographies carried out in 1978 and published by Schwalbe and Rogers. [Analytica Chimica Acta, 135, 1982, p.42]” (Petrosillo, O. & Marinelli, E., 1996, “The Enigma of the Shroud,” p.162).\n“Schwalbe and Rogers [Schwalbe, L. & Rogers, R., “Physics and Chemistry of the Shroud of Turin; A Summary of the 1978 Investigation”, Anal. Chim Acta, 135, 1982, pp. 3-49], mainly on the continuity of various macroscopically observable patterns seen in the weave in the radiograph images [Mottern, R., London, R. & Morris, R., “Radiographic Examination of the Shroud of Turin; A Preliminary Report”, Materials Eval., 38, 1979, pp. 39-44] taken during the STURP investigations, rejected the possibility of an adventitious piece of cloth for the side strip and concluded that the two pieces of cloth were actually continuous through the seam. .” (Adler, A.D., 1998, “Concerning the Side Strip on the Shroud of Turin,” in Adler, A.D. & Crispino, D., ed., “The Orphaned Manuscript,” 2002, pp.87-91, p.87).\n“There are three possibilities as to the nature of the side strip: 1) it is a completely different piece of linen cloth which has been joined to one edge of the Shroud for some unknown purpose; 2) it is a piece of the original cloth of the Shroud which for some unknown reason became detached from the original and was then reattached by the seam; 3) it is cloth that is continuous with the rest of the Shroud and the seam is really a tuck or a tube that has been sewn into the cloth for some unknown purpose. … Of our three original possibilities, situation 1 is clearly rejected and situation 2 also seems highly unlikely in view of the detailed thread matching that would be required and the absence of any evidence of any frayed thread ends along either side of the seam image. Therefore we conclude that the side strip is actually continuous with the rest of the Shroud.” (Adler, 1998, pp.87-88).\n“Several authors have suggested that the purpose of a corded side seam might be to facilitate hanging the cloth for exhibition. Certainly many paintings of such medieval exhibitions show the Shroud being displayed in such a manner with the cloth shown along its length and held or suspended along what would appear to be the side seam. It should be noted that this mode of display places maximum stress at the end points of suspension and tearing of the fabric would be expected to proceed from the ends inward along the seam. Some historical accounts record that certain noteworthies were given pieces of the Shroud. It would be logical to assume that such samples would be taken from such torn end panels, thus providing a simple explanation for the missing panel portions of the side strip. Perhaps the Charny family decided to repair such damages at the time of their display of the Shroud. Maybe the radiocarbon sample is simply rewoven material from the time of this repair. Had the recommended protocol for taking this sample been followed [Adler, A., 1996, “Updating Recent Studies on the Shroud of Turin,” Orna, M.V., ed., ACS Symp. Series, 625, pp. 223-228], we would have an answer for these questions.” (Adler, 1998, pp.87-91)\n“One final mystery element of the fabric is what appears to be a seam line three and a half inches from the Shroud’s edge (as seen to the left of the frontal image when viewed face on), that runs the cloth’s full length. It is from inside this seam line that the Shroud’s two missing portions have been removed at its two ends, but what is as yet still far from clear is the exact function of the seam itself, if that is indeed what it is. Before the STURP examination of 1978 I had hypothesised that the three-and-a-half-inch-wide strip of cloth which the seam appears to join to the main body of the Shroud was a ‘side-strip’ added close to the time of its original manufacture, perhaps in order to balance the appearance of the image on the cloth, since only by its addition does the body image appear central. But then in 1978 X-radiographs made by the STURP team showed that the same weft-run could be traced through from the original Shroud into the side-strip, suggesting that the cloth had been made as a single piece, with the seam being just that, a seam. However, if that was the case, why on earth had anyone gone to all the trouble of very carefully cutting off a three-and-a-half-inch strip, only then equally carefully to sew it back on again?” (Wilson, I., 1998, “The Blood and the Shroud,” 1998, p.72).\nStephen\n\n","date":"March 11, 2010 at 9:38 am","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","id":"comment-1140","author":"Stephen E. Jones","site":"shroudstory"},{"title":"The Gibson Study Really Says Nothing About the Shroud of Turin","post":"If the shroud was intended for clothing, there is a great probability it was a “sadîn shel buz” ( cf. Maria Luisa Rigato’s thesis http://books.google.fr/books?id=Zn-kyk2YHYoC&pg=PP1&dq=maria+luisa+rigato&cd=6#v=snippet&q=il%20telo%20sindonico%20di%20torino&f=false)\n\n","date":"February 3, 2010 at 8:11 am","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","id":"comment-996","author":"cazab","site":"shroudstory"},{"title":"The Gibson Study Really Says Nothing About the Shroud of Turin","post":"CAZAB\nThat is correct. The “sadîn shel buz” is a tallit.\nJohn\n\n","date":"March 10, 2010 at 1:38 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","id":"comment-1137","author":"John Lupia","site":"shroudstory"},{"title":"The Gibson Study Really Says Nothing About the Shroud of Turin","post":"Stephen\nEverything you posted is old outdated information no longer true or valid. All of these speculative theories were proven false. Flury-Lemberg confirmed the cloth was cut and sewn together. \nBelow is a quote from footnote 17, on page 38 of my new book The Ancient Jewish Shroud at Turin (Regina Caeli Press, 2010)\nFlury-Lemberg made this report at the Symposium at Turin, March 2-5, 2000. It was reported a bit confused where one might think there are two seams in the British Society For the Turin Shroud, 51, June (2000). However, in private correspondence with Dr. Flury-Lemberg she did not appear to confirm the misinterpretation of Wilson’s report regarding her paper. Instead she referred to her article, “The Linen Cloth of the Turin Shroud : Some Observations On Its Technical Aspects,” in Sindon, 16, decembre (2001), 55-62, which reports only one, not two.”\nJohn\n\n","date":"March 11, 2010 at 11:57 am","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","id":"comment-1141","author":"John Lupia","site":"shroudstory"},{"title":"The Gibson Study Really Says Nothing About the Shroud of Turin","post":"John\n>Flury-Lemberg confirmed the cloth was cut and sewn together. … Flury-Lemberg made this report at the Symposium at Turin, March 2-5, 2000. \nThanks for this information. I don’t yet have the book of this symposium: Fanti, G., ed., “The Turin Shroud: Past, Present and Future,” International Scientific Symposium, Torino 2-5 March 2000″ (if anyone can let me know where can buy a copy, I would be most grateful). \nBut Googling on “Turn Shroud: Past, Present and Future” and “seam” I found a report (which I already had on my computer but had forgotten) on this in the BSTS Newsletter of June 2000: \n“By far the most important information to come from Dr. Flury-Lemberg, however, concerns how the Shroud had been woven and finished. As she pointed out, looms in antiquity, particularly those in Egypt, could be up to 3.5 metres wide, enabling them to turn out continuous lengths of cloth far longer and wider than the Shroud. The high quality of the Shroud’s weaving strongly suggests it to have been made on a ‘professional’ loom of this kind. The explanation of its side-strip would therefore seem to be that at the time of its manufacture it formed part of considerably wider cloth which was then cut lengthwise into at least three pieces, two wide, and one narrow, this latter being the side-strip, which retains selvedge along its length, just as does its opposite number. With the central section removed (and now lost without trace), the wide and narrow pieces were very expertly joined up to form the Shroud as we know it today, this thereby clearly having been made to conform to specific dimensions.” (Wilson, I., “`The Turin Shroud – past, present and future’, Turin, 2-5 March, 2000 – probably the best-ever Shroud Symposium,” British Society for the Turin Shroud Newsletter, No. 51, June 2000)\n.\nThat Google search also found another article:\n“First, we examined the so-called side strip and its seam, about which there have been questions and disagreement. In 1982 after studying the radiographs taken in 1978, Schwalbe and Rogers reported that there is continuity of the threads from the Shroud into the side strip and concluded that the Shroud and the side strip are of one piece. (Ref.: Schwalbe & Rogers, 1982) We studied the same area also, trying to discern whether the side strip is 1) a completely different piece of linen which had been joined to the edge of the Shroud, 2) a piece of the original Shroud which had been detached but was then carefully reattached by the seam, or 3) an integral, continuous part of the Shroud fabric with the seam being really a tuck in the cloth for some reason. A joint paper, `Concerning the Side Strip on the Shroud of Turin,’ (Ref.: Adler et al, 1997) was presented at the May 1997 Nice Symposium in which we reported our findings from tracing several thousand of some 15,000 weft threads from the body of the Shroud through the seam and into the side strip that there is near-perfect alignment of nearly each thread in position, thickness, and intensity. Also, we found no evidence of frayed thread ends either in the seam or along either side of it. Our conclusion then was that the side strip is continuous with the rest of the Shroud.” (Whanger, A.D. & Whanger, M., 2005, “Excerpt from Radiological Aspects of the Shroud of Turin,” Council for Study of the Shroud of Turin, Durham NC, pp.1-15, p.1)\nSo I stand corrected there is a side strip, it being part of the same cloth and expertly cut and rejoined by a seam at the time of original manufacture, such that each thread is almost perfectly aligned across the two sections.\nThanks again for bringing this to my attention.\nHowever this raises more problems for your theory that the Shroud is Jesus’ tallit. See my comment to be made under “New Shroud of Turin book by John N. Lupia.”\nStephen\n\n","date":"March 11, 2010 at 11:25 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","id":"comment-1142","author":"Stephen E. Jones","site":"shroudstory"},{"title":"The Gibson Study Really Says Nothing About the Shroud of Turin","post":"Sorry, I posted the wrong Whangers quote above. It should have been the following:\n“In March 2000, Flury-Lemberg presented a paper, `The Linen of the Turin Shroud,’ (Ref.: Flury-Lemberg, 2000) dealing with technical and archaeological characteristics of the fabric. She had worked directly with the Shroud as a fabric specialist. She felt that originally the fabric had been cut into three lengthwise strips, two wide and one narrow, and that later the narrow strip (now the side strip) was expertly reattached to one of the wide strips by the seam to produce what we now know as the Shroud. Later, we reexamined the radiographs as well as photographic enlargements of portions of them to get a better understanding of the side strip and the two missing corners (MC) at the frontal and dorsal ends on the anatomic left side of the Shroud. … Following the seam its full length on the Shroud, it is remarkably uniform for almost the entire length except for the two ends near the MC. The weft threads can be traced from the Shroud through the seam continuing into the side strip in near perfect alignment. The seam appears to be a simple tuck (a portion of the cloth folded over on itself) in the Shroud fabric, which is meticulously hand-sewed in place on both sides of the tuck.” (Whanger, A.D. & Whanger, M., 2005, “Excerpt from Radiological Aspects of the Shroud of Turin,” Council for Study of the Shroud of Turin, Durham NC, pp.1-15, p.2).\nMy apologies.\nStephen\n\n","date":"March 12, 2010 at 1:18 am","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","id":"comment-1143","author":"Stephen E. Jones","site":"shroudstory"},{"title":"The Gibson Study Really Says Nothing About the Shroud of Turin","post":"Stephen\nIf you never read my book I can see how you can think the side strip raises problems for my theory. Once again, you amusingly point out problems to sources I give you, which I have read and studied years before you, implying either I never read them or else never understood them. This is a bit insulting. Once again, you make unwarranted caustic comments about a book you never read. This book is destined to be the most important book ever written in the history of Shroud literature. This claim is obviated by the fact the thesis it contains authenticates the Shroud as a first century Jewish tallit and obstacle of greater magnitude to the 1988 C-14 dating 1260-1390 than it posed to authententication. Both cannot be correct. My thesis is self evident to all readers. Scrutiny by experts worldwide is expected just as both praise and caustic scathing reviews. But in the end the thesis will prevail. Try reading the book before you condemn it. Otherwise any criticism about a book you never read is dishonest. This reminds me of the child at dinner table who refuses to eat his spinach saying he hates it, though he never ate it before.\nJohn\n\n","date":"March 12, 2010 at 10:24 am","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","id":"comment-1145","author":"John Lupia","site":"shroudstory"},{"title":"The Gibson Study Really Says Nothing About the Shroud of Turin","post":">Once again, you make unwarranted caustic comments about a book you never read. \nAll I commented about your theory under this “The Gibson Study …” post was:\n“However this raises more problems for your theory that the Shroud is Jesus’ tallit. See my comment to be made under `New Shroud of Turin book by John N. Lupia.'”\nI don’t want to open up a `second front’ discussing your theory under this “The Gibson Study …” post, so I will confine my comments under the “New Shroud of Turin book by John N. Lupia” post.\nStephen\n\n","date":"March 12, 2010 at 7:58 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","id":"comment-1158","author":"Stephen E. Jones","site":"shroudstory"},{"title":"The Gibson Study Really Says Nothing About the Shroud of Turin","post":"Hi Stephen. I have always thought that there is an inverse relationship between arrogant proclamations and the significance of what is being proclaimed. If this is so, then John Lupia’s thesis is pure baloney. When I read in his own words that his “book is destined to be the most important book ever written in the history of Shroud literature,” I couldn’t stop laughing. \n“Scrutiny by experts worldwide is expected just as both praise and caustic scathing reviews,” he writes. “But in the end the thesis will prevail.” So say similar words all those who know where the Ark of the Covenant is hidden and those who have been visited by the crews of UFOs. \n“Try reading the book before you condemn it,” he says. I have tried to read the book. I checked Amazon, Alibris, Books in Print and elsewhere. Alas, the book is unknown. I finally found the publisher. It is a two page web site that has exactly one book, his book, for sale on two-up 8.5×11 paper (think Staples) via Pay Pal. Who is this publisher? Why is it a secret? The web site is registered anonymously through GoDaddy. It is a publisher doing business under the laws of what state? No street address! No phone number! Anonymous web site registration! I’m going to plop down my credit card and pay $32.49 to buy this most important book ever published? Yeah, right!\nMr. Lupia writes, “This reminds me of the child at dinner table who refuses to eat his spinach saying he hates it, though he never ate it before.”\nStephen, we are not talking about spinach. You and I know that.\n\n","date":"March 12, 2010 at 12:33 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","id":"comment-1147","author":"Ellen J.","site":"shroudstory"},{"title":"The Gibson Study Really Says Nothing About the Shroud of Turin","post":"I will interject a comment here, folks, I have just purchased this book, and am eagerly anticipating its arrival.  It may be wise to reserve your caustic remarks until you have ACTUALLY read the book.  N’est pas?\n\n","date":"March 12, 2010 at 5:57 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","id":"comment-1155","author":"NDR","site":"shroudstory"},{"title":"The Gibson Study Really Says Nothing About the Shroud of Turin","post":"And I would welcome a review of the book on this site if you would be willing to act as a guest author for that purpose.\n\n","date":"March 12, 2010 at 6:11 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","id":"comment-1156","author":"Episcopalian","site":"shroudstory"},{"title":"The Gibson Study Really Says Nothing About the Shroud of Turin","post":"I too bought a copy of the book and can’t wait to read it. I agree that the caustic remarks being hurled here are really childish and uncalled for. Most of the negative comments posted here do sound like someone has a vendetta against John Lupia. Anyway I do really look forward to reading this book and might post after I read it. \nGail\n\n","date":"March 12, 2010 at 9:32 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","id":"comment-1160","author":"Gail","site":"shroudstory"},{"title":"The Gibson Study Really Says Nothing About the Shroud of Turin","post":"Thank you for your kind offer, Episcopalian.  As apparent moderator of this forum, you are accorded the privilege of offering the first review.\nI look forward to your assessment.\n\n","date":"March 13, 2010 at 1:50 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","id":"comment-1163","author":"NDR","site":"shroudstory"},{"title":"The Gibson Study Really Says Nothing About the Shroud of Turin","post":"Ellen J.\nYou are describing a book very different than mine.  \nFor the correct information about the book please go the URL below.\nhttp://www.reginacaelipress.com \nJohn\n\n","date":"March 12, 2010 at 1:20 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","id":"comment-1149","author":"John Lupia","site":"shroudstory"},{"title":"The Gibson Study Really Says Nothing About the Shroud of Turin","post":"I too will welcome reviews from those that read the book. I can’t wait to read Dan’s review as he promised.\n\n","date":"March 12, 2010 at 6:36 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","id":"comment-1157","author":"John Lupia","site":"shroudstory"},{"title":"The Gibson Study Really Says Nothing About the Shroud of Turin","post":"John Lupia, that is actually where I went, to the link you provided. How do I know who I am dealing with and that this isn’t an Internet scam?\nFirst let us look at the truth about this publisher web site. It is a membership (toy) site hosted by Google. Twenty people have ever visited the site. The site consists of two pages: 1) Regina Caeli Press Home page and 2) Book Titles Available. Book titles available consists of one book, yours, plus the promise of a future book by you. You can also, from the bottom of the page, click into Google to log in, read their terms and conditions, read their privacy policy or create your own toy web site.  \nThe domain “reginacaelipress.com” was registered by Domains by Proxy, Inc. of Scottsdale, Arizona (GoDaddy by another name) on February 20 of this year on behalf of some unnamed person. Is it you? The domain was registered for only one year and was created with private registration (anonymous). That is highly unusual for a publisher or any business. If you doubt any of this go to the ICANN WHOIS database.\nSo, John, who is behind Regina Caeli Press? Do they really exist? Do they have a street address? Do they have a phone number? Did they ever exist before February 20th? \nCan you think of one good reason to enter a credit card number on an anonymous web site to buy your book? I mean even if this is the greatest book ever written, why would anyone in their right mind do so? I will read you book. Please let me know where I can mail a purchase order with a certified check.\nWhy 4 to 6 weeks for delivery?\n\n","date":"March 12, 2010 at 3:19 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","id":"comment-1150","author":"Ellen J.","site":"shroudstory"},{"title":"The Gibson Study Really Says Nothing About the Shroud of Turin","post":"Ellen J.\nYour concerns are not warranted and ill informed. PayPal does not process credit cards in scams. You have now accused Paypal of doing just that by your comments, which is libel. \nYour initial post claims the book is 8.5 x 11 printed at Staples, which is libelous, since it is absolutely false. As for your other complaints and vituperative caustic comments one seriously doubts your sincerity in reading the book, but rather, to cast doubts to others and dissuade them from buying the book. You seem to have no qualms about posting libel and caustic comments against PayPal, me, the book, and the publisher on an anonymous blog with the identity of Episcopalian and yourself merely as screen names.\nWhy are you concealing your identity? Who is Ellen J.\n\n","date":"March 12, 2010 at 4:15 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","id":"comment-1151","author":"John Lupia","site":"shroudstory"},{"title":"The Gibson Study Really Says Nothing About the Shroud of Turin","post":"John, I only reacted when you started hurling insults about. You ask who is Ellen J. I ask you who is John Lupia. In fact, who is Regina Caeli Press? No really? I don’t know. How do I know you are really linking to PayPal? It is easy to spoof. Read about it in the Red Tape Chronicles over at MSNBC. Given that there is no street address or even a city for Regina Caeli Press, no phone number, no owner of record and nothing but a mini-web-site anonymously registered, what am I to think? I haven’t accused PayPal of anything. I haven’t accused anyone of anything. Think about it. Who are you? Who is your publisher? Secret web site registration, no address, no phone number. Why, should I trust you? That is a question, not an accusation. What if I pay for the book and I don’t get it in the mail, who do I contact? Think about that.\nOh, your site says “Product Dimensions: 5-1/2 x 8-1/2 x 5/8 inches (5.5″ x 8.5″ x 0.616″)” Isn’t that just exactly the size I gave. That is what two-up on 8.5 by 11 means. Do the arithmetic. Few printers print that size except those who print using low volume xerography. Think Staples, Office Max, Kinko, etc. That isn’t an insult. Why this size?\nI’ll read your book but I will not buy it on your web site until you provide answers. Can I get your book at the library? Find me a library who will order by PayPal from a mystery publisher.\nThe point is that when you get yourself into a bind with those who doubt your thesis, you start throwing insults about and claiming that your book will be the greatest and most important book ever written about the shroud. Yet you make it virtually impossible to be taken seriously. \nI guess I am supposed to know who you are but I don’t. I have never heard of you. Lighten up and answer some questions.\n\n","date":"March 12, 2010 at 5:02 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","id":"comment-1152","author":"Ellen J.","site":"shroudstory"},{"title":"The Gibson Study Really Says Nothing About the Shroud of Turin","post":"Ellen\n>I ask you who is John Lupia.\nJohn is a bona fide expert. Here is what the Journal of Biblical Studies says about him: \nJohn N. Lupia was trained in biblical studies and archaeology at Seton Hall University’s Divinity School, (B. A. 1976). His graduate studies in biblical scholarship were at the Immaculate Conception Seminary. He studied under Msgr. James Turro, one of the contributors to the Jerome Biblical Commentary. He went on to graduate studies in art history and archaeology at City College of the City University of New York, (M. A. 1982). He served as an extern in the Metropolitan Museum of Art, the Frick Museum, and the Jewish Museum. He went on for his Ph. D. in art history at Rutgers University, studying under James H. Stubblebine. He served as his graduate research assistant for several articles and his book Assisi and the Rise of the Vernacular. Later, he was made a graduate fellow of Rutgers School of Information and Library Studies (MLS 1993). He served as an intern at Princeton University’s Special Collections in the Marquand Art Library. He taught art history and archaeology for over fifteen years at various universities. He served as a leading contributor for Macmillan Publishers Dictionary of Art; 35 volumes, 1995. Mr. Lupia is listed in Catholic Biblical Associations Member Directory; Gale Publishers, The Directory of American Scholars; 5 volumes, 1998 edition; ABI’s International Directory of Distinguished Leadership, 10th ed; and IBC’s Directory. He has been a member of the Society of Biblical Literature; College Arts Association of America; the Catholic Biblical Association of America; the American Society of Papyrologists.\nBut of course being qualified and experienced does not of itself make the expert necessarily right on any particular topic (even within the expert’s own field of expertise), and us mere amateurs necessarily wrong on that topic. Science (for example) is littered with discarded theories proposed by highly qualified and experienced experts in their own fields of expertise, but which turned out, under testing, to be wrong.  \nShroud of Turin studies (Sindonology) encompasses a wide range of disciplines, including history, archaeology, art, science (physical and biological), theology, etc, and the well-read amateur can himself become an expert across that multi-disciplinary field, albeit not with any formal qualification in Sindonology, since there isn’t one.\nAnd a great thing about the Internet is that a mere amateur can directly question an expert about his theory and make up his own mind whether the expert has satisfactorily answered those questions.\nStephen\n\n","date":"March 12, 2010 at 11:01 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","id":"comment-1161","author":"Stephen E. Jones","site":"shroudstory"},{"title":"The Gibson Study Really Says Nothing About the Shroud of Turin","post":"So who is Ellen J? besides a completely masked concealed and anonymous persona.  Let the farce continue since I no longer wish to post on the “Mystery Persona Blog” run by an anonymous blogger, whom Stephen Jones addresses as Dan. I can make a very good educated guess who Dan the Episcopalian is, besides the fact that in a private Yahoo Group he mentioned his blog at word press. But I cannot even begin to guess who Ellen J. is. Who are you? Lighten up and answer some questions.\nUnmysteriously,\nJohn Lupia\n\n","date":"March 12, 2010 at 5:16 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","id":"comment-1153","author":"John Lupia","site":"shroudstory"},{"title":"The Gibson Study Really Says Nothing About the Shroud of Turin","post":"John and Ellen:\nJohn, Ellen did not accuse you of anything. Do not accuse her of libel or “vituperative caustic comments.” You can continue to opine here but only at my pleasure.\nEllen. John is for real. If you order from him you will get the book. You, too, can continue to opine here but only at my pleasure.\nCloaked identities are common in blogs. I have no problem with it. \nEpiscopalian (Dan Porter, no need to guess, John)\n\n","date":"March 12, 2010 at 5:25 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","id":"comment-1154","author":"Episcopalian","site":"shroudstory"},{"title":"The Gibson Study Really Says Nothing About the Shroud of Turin","post":"QUICK NOTE RE \n“They wrapped the individual’s head in linen cloth,  and his body in wool cloth–a practice that Gibson says was part of traditional Jewish burial practices at the time.”\nDoes not Jewish religeous law prohibit mixing linnen with wool? If so, how could this have been a typical burial….\n\n","date":"May 2, 2010 at 12:46 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","id":"comment-1277","author":"David Rapalyea","site":"shroudstory"}]
