[{"title":"An Old Christian Papyrus","post":"These articles (biblical blankets) are generated over and over again in a vacuum.\n\n","date":"September 7, 2014 at 6:36 am","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","id":"comment-149221","author":"anoxie","site":"shroudstory"},{"title":"An Old Christian Papyrus","post":"Dan, you may have not noticed that I posted a link to the papyrus on the blog around a week ago. Anyway, we can deduce two things from the discovery: The Egyptian Christians were influenced by ancient Egypt and therefore adopted the concept of “charms”. We also have examples in the Old Testament, where ideas from surrounding cultures, particularly Mesopotamian, crept into some texts.\nThe text shows strong influence of Old Testament ( strictly Jewish) imagery.\n\n","date":"September 7, 2014 at 12:03 pm","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","id":"comment-149273","author":"Louis","site":"shroudstory"},{"title":"An Old Christian Papyrus","post":"I noticed, then forgot. Sorry. Another senior moment, I’m afraid.\n\n","date":"September 7, 2014 at 3:07 pm","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","id":"comment-149296","author":"Dan","site":"shroudstory"},{"title":"An Old Christian Papyrus","post":"No problem, you are bound to forget something or the other in the searching you have to do to keep the blog going.\n\n","date":"September 7, 2014 at 3:48 pm","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","id":"comment-149302","author":"Louis","site":"shroudstory"},{"title":"An Old Christian Papyrus","post":"I saw no evidence on the site that supported the idea of a magical use, or of it being in an amulet, only speculation that it may have been.  Granted the rectangular arrangement of thin worn areas may suggest it had been kept folded.  Are we to assert that modern wall hangings of scriptural texts are to be interpreted as magical invocations?  Anoxie’s comments that such articles are generated over and over again in a vacuum are pertinent.\n\n","date":"September 7, 2014 at 11:39 pm","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","id":"comment-149355","author":"daveb of wellington nz","site":"shroudstory"},{"title":"An Old Christian Papyrus","post":"Hi daveb,\nI was talking of the article about the Shroud mentionned at the end of the post:\n“Proof of Jesus Christ? 7 Pieces of Evidence Debated. The first one is Biblical Blankets. Guess what?”\nhttp://www.livescience.com/38014-physical-evidence-jesus-debated.html\n7- Biblical blankets\n\n","date":"September 9, 2014 at 2:55 am","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","id":"comment-149579","author":"anoxie","site":"shroudstory"},{"title":"An Old Christian Papyrus","post":"Thanks anoxie, picked it up and followed through.  Clearly the site has its own particular bias.  It maybe OK on news about dinosaurs, but I suspect overall it’s fairly superficial.\n\n","date":"September 9, 2014 at 5:23 am","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","id":"comment-149605","author":"daveb of wellington nz","site":"shroudstory"},{"title":"An Old Christian Papyrus","post":"It is OK on established facts about dinosaurs, not on controversies about the Shroud, but this is “truthiness”:\n“The less effort it takes to process a factual claim, the more accurate it seems. When we fluidly and frictionlessly absorb a piece of information, one that perhaps snaps neatly onto our existing belief structures, we are filled with a sense of comfort, familiarity, and trust.”\n\n","date":"September 9, 2014 at 5:55 am","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","id":"comment-149611","author":"anoxie","site":"shroudstory"},{"title":"An Old Christian Papyrus","post":"Read the Old Testament in comparison with the literature of the surrounding cultures and the early history of Egyptian Christians in comparison with the milieu to find the evidence.\n\n","date":"September 8, 2014 at 8:12 am","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","id":"comment-149429","author":"Louis","site":"shroudstory"},{"title":"An Old Christian Papyrus","post":"Jewish religious practice requires males over 13 years of age to wear phylacteries (Tefillin, Deut. 6:8 etc) containing texts of the Torah in a certain prescribed manner.  They serve as reminders.  No-one would suggest they represent magic incantations or charms.  Jeanna Bryner made such an assertion concerning the ‘Last Supper papyrus’ but did not support the allegation with any evidence in her LiveScience article. Ergo – Speculation!\n\n","date":"September 8, 2014 at 3:37 pm","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","id":"comment-149484","author":"daveb of wellington nz","site":"shroudstory"},{"title":"An Old Christian Papyrus","post":"There are hundreds of findings when it comes to Jewish magical incantations, ostraca and magical bowls. It was common practice to have these objects, although they were prohibited in the Old Testament. Dozens of magical documents were found in the Cairo Genizah and have even been published, James Davila wrote about the excavation in Nippur: ” nearly every house excavated in Nippur had one or more incantation bowls buried in it.”\nMany, but not all, of them were protections against Lilith, some were curses and so on.\nShlomo Moussaieff has the biggest collection of such objects.\nLast, but not the least, the priests at the Temple were known to practice witchcraft, the competition to reach the office of High Priest was strong.\nMonotheism, as we know it today, was defied by the Council of Nicaea in AD 325.\n\n","date":"September 8, 2014 at 4:45 pm","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","id":"comment-149499","author":"Louis","site":"shroudstory"},{"title":"An Old Christian Papyrus","post":"Sorry, in the last line “defied” should read “defined”.\n\n","date":"September 8, 2014 at 8:09 pm","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","id":"comment-149526","author":"Louis","site":"shroudstory"},{"title":"An Old Christian Papyrus","post":"It cannot be denied that magic was practised within ancient Judaism.  The Kabbala first appeared in the 12th century, but in fact had ancient roots.  I think it was Samuel who consulted a witch or soothsayer. \nA sample Encyc Brit extract:\n“The earliest roots of Kabbala are traced to Merkava mysticism. It began to flourish in Palestine in the 1st century AD and had as its main concern ecstatic and mystical contemplation of the divine throne, or “chariot” (merkava), seen in a vision by Ezekiel, the prophet (Ezekiel 1). The earliest known Jewish text on magic and cosmology, Sefer Yetzira (“Book of Creation”), appeared sometime between the 3rd and the 6th century. It explained creation as a process involving the 10 divine numbers (sefirot; see sefira) of God the Creator and the 22 letters of the Hebrew alphabet. Taken together, they were said to constitute the “32 paths of secret wisdom.”\nHowever the actual text of the “Last Supper Papyrus” as quoted above, seems to provide no evidence for its use as any kind of magic talisman, but is NT orthodox.  It might just as well be imitative of the orthodox Jewish practice of wearing phylacteries containing texts from the Torah.\n\n","date":"September 8, 2014 at 9:58 pm","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","id":"comment-149536","author":"daveb of wellington nz","site":"shroudstory"},{"title":"An Old Christian Papyrus","post":"Kabbala has its roots in gnosticism, it is speculation, nothing to do with the OT. It certainly began as a reaction to attacks on the deity, as described in the OT, and curiously the defence absorbed elements coming from the opposite camp.The “Last Supper Papyrus” is indeed NT orthodox, using Jewish imagery, and the folds may really indicate that it could have been kept in a frame, as a prayer, to stimulate faith, and not used as a “charm”.  Jeanna Bryner has demonstrated bias.\n\n","date":"September 8, 2014 at 10:36 pm","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","id":"comment-149544","author":"Louis","site":"shroudstory"},{"title":"An Old Christian Papyrus","post":"This is off-topic, but a great research find.\nLeave it to the Germans!\nGerman Scientists Prove There is Life After Death\nhttp://worldnewsdailyreport.com/german-scientists-prove-there-is-life-after-death/\nBest,\n\n","date":"September 11, 2014 at 1:28 am","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","id":"comment-150090","author":"Angel","site":"shroudstory"},{"title":"An Old Christian Papyrus","post":"Don’t believe a thing you read in the World News Daily Report. It bills itself as a satirical site, as I discovered through chasing up its other story on the ‘discovery’ of an aboriginal city in the centre of Australia.\nhttp://www.hoax-slayer.com/fake-news-ancient-city-found-australian-desert.shtml\nIn any case, it stands to reason that there is life after near-death.\n\n","date":"September 11, 2014 at 1:52 am","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","id":"comment-150095","author":"Colin Berry","site":"shroudstory"},{"title":"An Old Christian Papyrus","post":"Thanks, Colin.\nSo “World News Daily” is similar to “The Onion”?  \nI’m surprised, since the article was also carried on the “JewsNews.” site.  Unfortunately, it’s difficult to be able to differentiate between articles that contain truth and those that contain satire. \nBest,\n\n","date":"September 11, 2014 at 5:50 pm","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","id":"comment-150287","author":"Angel","site":"shroudstory"}]
