[{"title":"The Latest News on the Gospel of Jesus’ Wife","post":"Hi Dan, didn’t I predict on this blog that this would happen? I would tell Harvard to look before leaping and I think Karen King adopted a strategy, one that slowly distanced itself from authentication, a face-saving approach. The fact that the owner’s identity was not revealed was a tell-tale sign right from the beginning, however Harvard has released a documentary…..\n\n","date":"May 7, 2014 at 8:57 am","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","id":"comment-113717","author":"Louis","site":"shroudstory"},{"title":"The Latest News on the Gospel of Jesus’ Wife","post":"Any extraneous exegeses related to Mary Magdalene has always been speculative, even the Church with Gregory the Great first declaring her a prostitute (c.591).  This parcel of supposed 3rd-4th century papyrus is a Dan Brown prop par excellence.  Just looking at the bold letters of and Jesus said:  “MY WIFE” precludes the pale of honest scrutiny rendering an immediate and obvious forgery.  Oh, what an embarrassment for Karen King and Harvard Divinity School… a King of Cons!\n\n","date":"May 7, 2014 at 9:05 am","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","id":"comment-113720","author":"Annette Cloutier","site":"shroudstory"},{"title":"The Latest News on the Gospel of Jesus’ Wife","post":"There is also the money line to follow, it is also there in the field of biblical archaeology.\nJesus said, “Where is your treasure there is your heart also”…………\n\n","date":"May 7, 2014 at 9:53 am","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","id":"comment-113744","author":"Louis","site":"shroudstory"},{"title":"The Latest News on the Gospel of Jesus’ Wife","post":"Even if it had been authentic, it would’ve been largely irrelevant to historical Jesus studies due to its late date. Scholars would want evidence dating to the 1st century, or at the very latest, early 2nd century. The earlier the data, the more likely it is to be historically reliable.\n\n","date":"May 7, 2014 at 3:50 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","id":"comment-113977","author":"Ryan","site":"shroudstory"},{"title":"The Latest News on the Gospel of Jesus’ Wife","post":"If it was as easy as that it would be fine for the status quo in the believing world, but it isn’t. Even scripture is being questioned, starting with the first-century NT and going back to the OT till around 1500 BC or even further back. The scene is no longer the same as it was fifty years ago.\n   https://www.academia.edu/6932873/Jesus_was_not_buried_in_Talpiot_Parts_I_II_and_III\nThe NT began to be questioned by Strauss, Baur, Reimarus, the OT by Spinoza, more lately by Assmann, Finkelstein, Pinker and so on.\n\n","date":"May 7, 2014 at 6:20 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","id":"comment-114081","author":"Louis","site":"shroudstory"},{"title":"The Latest News on the Gospel of Jesus’ Wife","post":"The ‘Jesus wife’ fragment is not yet a closed case, although many would prefer it to be so.  The latest claim as a forgery comes from Dr Christian Askeland, an assistant research professor at Protestant University Wuppertal, Germany. Dr. Askeland is an evangelical Christian who is also affiliated with Indiana Wesleyan University, an evangelical college in Marion, Indiana. He claims to have identified reasons why the fragment is a fake, including a comparison with a Coptic version of the Gospel of John. Dr Askeland would seem to have his own personal evangelical agenda in asserting the fragment a fake.  Among the more objective reports on Dr Askeland’s assertions is a NY Times report at:\nhttp://www.nytimes.com/2014/05/05/us/fresh-doubts-raised-about-papyrus-scrap-known-as-gospel-of-jesuss-wife.html?_r=0 \nAn extract:\n“Malcolm Choat, a Coptic expert at Macquarie University in Australia who cautiously contradicted the doubters in his paper last month for the Harvard journal, said in an interview that the new evidence was “persuasive,” but “we’re not completely there yet” — until the John and Jesus wife papyruses can be studied in person or using high-resolution images to understand their relationship. Roger Bagnall, a renowned papyrologist who directs the Institute for the Study of the Ancient World at New York University, and who early on deemed the Jesus’ Wife papyrus likely to be genuine, said in an interview about the skeptics, “Most of the people taking this view wanted it to be a fake, and they haven’t asked critical questions about their own hypothesis.” ” \nDr Karen King has never asserted that the fragment is any kind of evidence that Jesus was married, but this is a line that much sensationalist reporting has attempted to represent.  If the fragment was ever to turn out to be authentic, it would only indicate that its source group was probably caught up in a debate as to the merits of celibacy vs marriage, and someone favouring marriage had attempted to resolve it by falsely asserting that Jesus was married. \nDr Askeland’s assertions come within weeks after Harvard had obtained the results of scientific testing which indicated that the fragment might well be genuine, dating to the 6th to 9th centuries.  The jury is still considering its verdict!\n\n","date":"May 7, 2014 at 5:22 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","id":"comment-114041","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Latest News on the Gospel of Jesus’ Wife","post":"Sorry, daveb, first go through Karen King’s agenda to see what exactly is going on first.\n\n","date":"May 7, 2014 at 5:25 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","id":"comment-114042","author":"Louis","site":"shroudstory"},{"title":"The Latest News on the Gospel of Jesus’ Wife","post":"King Conned!\n\n","date":"May 7, 2014 at 10:31 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","id":"comment-114226","author":"clublu22014","site":"shroudstory"},{"title":"The Latest News on the Gospel of Jesus’ Wife","post":"Hi clublu2201, I was waiting for further contact. What would your professor, Father George MacRae say about the controversy? After all, it would be part of his field.\n\n","date":"May 8, 2014 at 9:02 am","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","id":"comment-114574","author":"Louis","site":"shroudstory"},{"title":"The Latest News on the Gospel of Jesus’ Wife","post":"Professor George Windsor MacRae, S.J., would have left it up to Prof. Frank Cross…  George MacRae would have been disappointed in Karen King, and have advised her not to have not accepted the faux papyrus.  George’s field was Early Christian Gnosticism, and this piece didn’t fit the field.  Thanks for asking Louis.  I think King-Conned should have listened even a little to the voice who previously held her Divinity chair.\n\n","date":"May 8, 2014 at 9:37 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","id":"comment-115033","author":"clublu22014","site":"shroudstory"},{"title":"The Latest News on the Gospel of Jesus’ Wife","post":"Louis, I can assure you that I am not so naive as you might presume.  There are agendas and counter-agendas.  Neither of them are seldom the way to objective truth.  I neglected to mention that there are also some most unsatisfactory questions concerning the question of provenance, which much raise serious doubts as to authenticity.  But whether this is just another smokescreen by the forgery camp is hard to determine.\n\n","date":"May 7, 2014 at 6:04 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","id":"comment-114073","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Latest News on the Gospel of Jesus’ Wife","post":"Daveb, no, I didn’t mean you were naive. What I meant is that Karen King’s agenda is not different from those of other scholars who share her views when it comes to  a complete picture of Jesus. To get an idea about what is going on Internet research is not enough, there is a lot of material to read and analyse. The hidden agendas are either anti-Christian or those of fanatical feminists, sometimes there is no hesitation to distort what we can assume to be facts by making far-fetched claims and try to pass it off as truth.\nBluntly speaking, scholars can not connect the dots sometimes, so they keep quiet and discuss it among themselves. If the agendas are the same it is done behind the scenes, but this is enough for the greedy and the unscrupulous to justify the production of documentaries and books by sensationalist authors.\nSome years ago the Baigent/Leigh duo attacked the Vatican by saying that they were responsible for hiding some parts of the Dead Sea Scrolls. This was dismissed by a well-known Jewish scholar and refuted by the also well-known Protestant scholars Betz and Riesner. Something along these lines will have to be done now.\n\n","date":"May 7, 2014 at 6:43 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","id":"comment-114098","author":"Louis","site":"shroudstory"},{"title":"The Latest News on the Gospel of Jesus’ Wife","post":"Jacobovici traces the fragment to the Valentinans with his wishful thinking. He says their writings could be based on history and that is why Paul kept silent about Jesus’ celibacy.\nApparently he expects that it will be passed off as a scholarly viewpoint.\n\n","date":"May 8, 2014 at 9:02 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","id":"comment-115014","author":"Louis","site":"shroudstory"},{"title":"The Latest News on the Gospel of Jesus’ Wife","post":"Simcha Jacobovici is in the same camp as Dan Brown… and should take a course in Early Christian Gnosticism first before spouting off on its attributes.  Nowhere did a Valentinian codex such as the Apocryphon of John ever mention Jesus’ wife or beloved and surely none made direct reference to Mary Magdalene. The Gospel of Philip was not Valentinian.\nLouis, Paul, as I’m sure you know, wasn’t concerned about the earthly life of Jesus.  Paul was only concerned about Jesus’ mystical life–his Paschal Mystery:  Passion, Death, Resurrection.  So you and I agree that Jacobovici and all of the Dan Brown camp are far a field from the Truth and Core of the NT.\n\n","date":"May 8, 2014 at 9:53 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","id":"comment-115045","author":"clublu22014","site":"shroudstory"},{"title":"The Latest News on the Gospel of Jesus’ Wife","post":"That’s right, clublu2201. With an agenda like the one he has,he finds it difficult to give up and prefers to clutch at straws. There is a lot of money behind it. You are right about Paul too, the blinding flash on the road to Damascus shaped the rest of his life and mission.\n\n","date":"May 8, 2014 at 10:22 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","id":"comment-115060","author":"Louis","site":"shroudstory"},{"title":"The Latest News on the Gospel of Jesus’ Wife","post":"Clublu2210 says:\nMay 8, 2014 at 9:37 pm\n“Professor George Windsor MacRae, S.J., would have left it up to Prof. Frank Cross… George MacRae would have been disappointed in Karen King, and have advised her not to have not accepted the faux papyrus. George’s field was Early Christian Gnosticism, and this piece didn’t fit the field. Thanks for asking Louis. I think King-Conned should have listened even a little to the voice who previously held her Divinity chair.”\nYou are absolutely correct, it seems the standards have fallen.\n\n","date":"May 8, 2014 at 10:15 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","id":"comment-115054","author":"Louis","site":"shroudstory"},{"title":"The Latest News on the Gospel of Jesus’ Wife","post":"Wished you lived in the States Louis,  We’d find a way of storming the hallowed halls of Harvard Divinity!\n\n","date":"May 8, 2014 at 10:52 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","id":"comment-115074","author":"clublu22014","site":"shroudstory"},{"title":"The Latest News on the Gospel of Jesus’ Wife","post":"Hi clublu2201, Harvard has been liberal for a long time and Iowa and North Carolina are worse. It seems to be a growing tendency and the professors who are Christian believers are accused of imposing their faith on biblical studies. The people at SBL are also accused of the same thing. We are supposed to believe that biblical studies has come to an end.\n\n","date":"May 9, 2014 at 8:10 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","id":"comment-115719","author":"Louis","site":"shroudstory"},{"title":"The Latest News on the Gospel of Jesus’ Wife","post":"Louis, why would you write:  “We are supposed to believe that biblical studies have come to an end.”?\nWhereas these liberal “scholars” have confused the core of the NT, don’t you suppose that there is room for more growth?\n\n","date":"May 9, 2014 at 9:02 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","id":"comment-115749","author":"Annette Cloutier","site":"shroudstory"},{"title":"The Latest News on the Gospel of Jesus’ Wife","post":"Hi Annette, it is sometimes taken for granted that religious belief is outdated and that we have an alternative which says ‘forget about God’, which was the message RD gave when he went around London in that bus. It was exactly in this city that more than a decade ago I could sense what was to come.\nI went to a bookshop belonging to a big chain bookstore to ask if they had a book about Jesus in history. The young man at the counter looked at me and asked, “Jesus? How do you spell that?”. Knowing the mentality prevailing at that end I said quietly, “J-e-s-u-s”. He had to do his job, so he looked at the computer and said that the book I was looking for was not available. Around the same time I once saw a boy wearing a white t-shirt walking on the road. The words “Jesus died for his sins, not mine.” was printed on it.\nWell, we are talking about people in general, but this attitude reached the higher, more educated strata in the Western world a long time ago and can now also be felt in the academy and that is what I meant. It is there only in some universities, it seems, but my guess is that it will spread. The younger generation is not that interested in religion.\nJudaism and Christianity are evolving, times have changed, they have to adapt to developments in science, although science cannot explain everything. See the interview:\n       https://www.academia.edu/4700001/What_do_we_know_about_the_Bible_An_interview_with_Joseph_A._Fitzmyer_SJ\nI agree with you that there is room for more growth, but making new translations of the Bible will not help. Science-theology dialogue is crucial and so is good systematic theology as well as new ideas in Christology. .\n\n","date":"May 9, 2014 at 9:48 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","id":"comment-115776","author":"Louis","site":"shroudstory"},{"title":"The Latest News on the Gospel of Jesus’ Wife","post":"As I pointed out last year, Karen King is trying to get people to swallow a forgery, obtained from an “anonymous figure”. After all, that is very interesting for her because of the line she is towing. More bad news for her:\nhttp://edition.cnn.com/2015/02/20/living/jesus-series-gospel-wife/index.html\nOne has to be careful with anonymous figures or collectors in this area just as with unprovenanced artefacts relating to biblical archaeology in Israel.\n\n","date":"February 21, 2015 at 4:56 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","id":"comment-191512","author":"Louis","site":"shroudstory"},{"title":"The Latest News on the Gospel of Jesus’ Wife","post":"Louis, you’ll find a very recent most interesting article on the “Coptic fragment” on a CNN website dated 21 Feb by Dale (Yale) & Moss (Notre Dame).  \nFragment’s papyrus carbon-dated OK, and ink components looked ancient.  So if it was a forgery it was a good one. \nHowever Baden & Moss discovered textual links with a known forgery that had been alleged to be a Gospel of John in a rare Coptic dialect.  Dating of John papyrus was 9th century, yet the dialect died out before 6th century, hence John was a forgery.  Some of the text of John was copied into the Coptic fragment.  Article includes disclaimer, stating that the views expressed are those of Baden & Moss.  Article includes claim: “What the entire episode does, rather, is remind us — scholars included — that science might not always have all the answers. / This forgery was detected not through lab analysis but through good old-fashioned humanities-based detective work. This was Sherlock Holmes, not “CSI.” / There remains no substitute for deep, thorough, scholarly expertise in ancient languages and texts.”  However, clearly carbon-dating was used to discover the John forgery. \nhttp://edition.cnn.com/2015/02/20/living/jesus-series-gospel-wife/  \nPostscript:  I endeavour to maintain an open mind on all such claims, and take little notice of agenda-driven comments from whatever side they come.  In the Coptic fragment case, this article seems to be the clincher.  The purpose of an open mind being to be able to close it when the facts actually become finally known, no matter which way they fall!\n\n","date":"February 22, 2015 at 5:07 am","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","id":"comment-191541","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Latest News on the Gospel of Jesus’ Wife","post":"Senior moment typo in first para above;  Authors are Joel S. Baden (Yale) and Candida R. Moss (Notre Dame)  [Not Dale (Yale)]\n\n","date":"February 22, 2015 at 5:10 am","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","id":"comment-191542","author":"daveb of wellington nz","site":"shroudstory"}]
