[{"title":"The lesser known aspect, that of the intrinsic characteristics of the Cloth","post":"The translated article was not the easiest to read but it was not really that difficult.  I am of thought that it describes what happened to the body of Jesus right before and after he was placed into the rock tomb.  The article gives good reason for the Shroud to appear as it does even to this date.  To me, the article is telling us that the Shroud matches what a shroud should look like if it was used as a burial cloth in the days of Jesus.  Meaning that there is knowledge there that would not have been known to be used to make a fake by some artist in the middle ages.\n\n","date":"February 27, 2015 at 8:43 am","url":"https://shroudstory.com/2015/02/27/the-lesser-known-aspect-that-of-the-intrinsic-characteristics-of-the-cloth/","cat":"history","id":"comment-191959","author":"Emmett McMahon","site":"shroudstory"},{"title":"The lesser known aspect, that of the intrinsic characteristics of the Cloth","post":"The comment sent at 8:43 was connected to the wrong article   Sorry\n\n","date":"February 27, 2015 at 9:02 am","url":"https://shroudstory.com/2015/02/27/the-lesser-known-aspect-that-of-the-intrinsic-characteristics-of-the-cloth/","cat":"history","id":"comment-191961","author":"Emmett McMahon","site":"shroudstory"},{"title":"The lesser known aspect, that of the intrinsic characteristics of the Cloth","post":"Ada Grossi says: \n>The deceased had to be wrapped in a shroud (‘takrik’ or ‘takrikim’)\ngenerally made of white linen … …\n>…the linen of the Shroud is interesting for two main reasons: the total absence of wool fibers and the considerable value of the cloth, which has a textile structure\n“highly sought” (= herringbone), …\n>… The Shroud of Turin is compatible with Jewish burial customs,\nbut because it is traditionally considered that one that wrapped Christ in the tomb… …\nLink:\nhttp://www.lindro.it/0-cultura/2015-02-27/168507-la-sindone-e-gli-usi-funerari-giudaici\nYes.\nAncient weaving could be highly sophisticated…\nBut, IMO, “herringbone” is more difficult but not “very very sought”.\nAm I wrong?\nPerhaps it would be interesting to investigate also the mechanical load\nborne by different types of fabrics during weaving …\nand see also: the subsequent ageing during the centuries.\nWhy not?\n— — *** — —\nNow I have found a database…:\n“Database of ATR-IR spectra of materials related to paints and coatings”\nHere the description:\n>In this page a selection of ATR-FT-IR spectra of various conservation- and painting-related materials (pigments, binders, fillers, etc) is presented.\n>These infrared spectra have been recorded at University of Tartu (Estonia), Institute of Chemistry, Chair of Analytical Chemistry. The spectra have been acquired over the last couple of years in the course of various projects on historic, industrial and construction paints, coatings and pigments.\n>In the course of the research of inorganic pigments and the usefulness of ATR-FT-IR for identification of inorganic pigments using the low wavenumber region (550–230 cm–1) two papers have been published (Spectrochimica Acta Part A, 2009, 73, 764–771 and Spectrochimica Acta Part A, 2010, 75, 1061–1072) and a doctoral thesis has been defended. IR spectra of these inorganic pigments are presented in section “Inorganic pigments” in the subsection “Pigment + linseed oil”.\nLink:\nhttp://tera.chem.ut.ee/IR_spectra/\nI think this database can be useful to discuss\nthe strange case of the claims by Charles Freeman.\nIt’s easy to make some experiment and ATR-FTIR control…\nI never saw ATR-FTIR spectra of various conservation\n– and painting- related materials (pigments, binders, fillers, etc)\npresented for the purpose of  studies on Holy Shroud.\nAm I wrong?\nIn the past (= January 24, 2014 at 10:57 am\nBut the argument was the following =\n“Comment Promoted: Are the Quad Mosaics Meaningless?”)\nI wrote:\n>… But, before to continue (… for example, see also : the comparisons\nfor the SPM controls with respect the ATR-FTIR controls) …\n>I want to ask :\nWhat is your remark about this point (= the lack of Raman analyses\non radiocarbon area and neighbourhood … )  \nSo,\nI have neglected to pursue the matter “ATR-FTIR” (however\nalso Prof. Giulio Fanti did not go beyond a certain type of study …\nie.:  what it was absolutely necessary for the purpose of dating,\n in one of the three methods of “Dating”).\nThen the question to answer can be the following:\n“How to organize a true ATR-FTIR and\nAFM workshop around the Shroud of Turin?”\nThen remember the\n“Interview with Bruno Barberis,\nPresident of the International Center of Sindonology Turin”\n(February 20, 2015)\nLink:\nhttp://www.lindro.it/0-cultura/2015-02-20/168309-organizzare-un-laboratorio-intorno-alla-sindone\nProf. Barberis = a thirty-year career as Professor of Mathematical Physics\nat the University of Turin… \nJewish funeral or painting?\nThe claims of Charles Freeman seem very weak.\n\n","date":"February 27, 2015 at 10:48 am","url":"https://shroudstory.com/2015/02/27/the-lesser-known-aspect-that-of-the-intrinsic-characteristics-of-the-cloth/","cat":"history","id":"comment-191969","author":"piero","site":"shroudstory"},{"title":"The lesser known aspect, that of the intrinsic characteristics of the Cloth","post":"My previous message is not well centered.\nPerhaps, as I vaguely wrote about the hidden textile secrets of that Linen,\nwe have (also) to do other interesting works…\n\n","date":"February 27, 2015 at 11:18 am","url":"https://shroudstory.com/2015/02/27/the-lesser-known-aspect-that-of-the-intrinsic-characteristics-of-the-cloth/","cat":"history","id":"comment-191970","author":"piero","site":"shroudstory"}]
