[{"title":"The Ridiculous Picknett and Prince Photograph Theory","post":"After reading this article I can´t help making some comments about Picknett and Prince´s ridiulous theory about the Shroud image.\n1- Everybody knows that the first Shroud display in western Europe was in 1356 in a Lirey church in France ; Leonardo da Vinci was born in 1452 .\nHow could he make such an artifact before even beiing born?\nThe theory that Duke Louis of Savoy later ordered him to make a more perfect Shroud is preposterous.\n2- Their theory deals with a lot of inaccuracies , just to mention:\n          If the photographic emulsion had egg Shroud image fibers shoud test positive for proteins- that doesn´t happen and  the late chemist Raymond Rogers submited image fibers to Pyrolysis Mass Spectrometry which discarded nitrogenous residues.\n          There were no refrigerators at that time so the tortured and flogged bodies Leonardo «got» would have rotten before such images formed on the cloth.\n            The face of the Man of the Shroud  has the features of a\n semitic man- that´s the opinion of anthropologic experts ; Leonardo was an italian.\n2- The image of the Shroud is not a photograph\nPhotographs reult from reflected light  and from analysis of highlights and shadows an image expert can infer light direction.\nIn the Shroud image there is no light directionality it just seems that the light or whatever made the image comes from the body itself !\nA face in a photograph has sharp contours ; the face of the Man of the Shroud has no distinct  boundaries fading into colorless areas.\nPhotographic image of a body is always an «albedo » image it don´t  has 3D encoded data unveiled by a VP-8 scan  .\nHow can these authors explain that it was possible to produce an hologram from such a photograph?\nIt´s not possible to obtain Holograms from 2D images as Dr  Petrus Soons states and  the  hologram of the Man of the Shroud had missing data that  produced hole-like defects explained by the israeli botanist expert Professor Avinoam Danim as places where flowers were laid over the body !\nThey don´t deal either with the fact that underneath blood stains there is no image. EXPLAIN ALL THIS STUFF Ms Picknett and Mr. Prince !!!\nIf you want to read a detailed explanation just go to Barrie Schwortz´s wonderful website ( http://www.shroud.com ) and search scientific papers  his article « Is the Shroud of Turin a Medieval Photograph? »\nSome years ago, before getting interested in Shroud studies I bought their book Templar Revelation but soon I realized that their claims were absolutely ludicrous and  I didn´t finish it and it is still in my bookshelf.\nIt´s just time waste to read such books.\n                                            greetings\n                      Maria da Glória\n\n","date":"October 23, 2008 at 10:00 pm","url":"https://shroudstory.com/2008/10/21/the-ridiculous-picknett-and-prince-photograph-theory/","cat":"history","id":"comment-185","author":"Maria da Glória Gonçalves Barroso","site":"shroudstory"},{"title":"The Ridiculous Picknett and Prince Photograph Theory","post":"Thank you so much for this article! I’ve just been watching a ‘documentary’ that promotes this idea,and by the end wanted to hurl things at the screen.They kept saying Leonardo’s face was a ‘perfect match’ for the face on the shroud which to my eyes was absolute bullshit.Add to the fact that  there exists a letter by a priest during the  medieval period that the shroud was fake and that he had located the artist leads me to cry,”Uncle!”.They like the theory because it’s sexy and novel and gets people who have no interest in the often tedious and confusing  archeological sciences interested in what they have to say.I knew I couldn’t be the only one who knew the whole theory was dodgy.Thank you!\n\n","date":"September 23, 2010 at 8:38 am","url":"https://shroudstory.com/2008/10/21/the-ridiculous-picknett-and-prince-photograph-theory/","cat":"history","id":"comment-1443","author":"anna67","site":"shroudstory"},{"title":"The Ridiculous Picknett and Prince Photograph Theory","post":"Read the book, people. They offer theories and they are better than almost every psuedo-scientific explanation for why it is not a hoax.\nAnna67, for example, the letter by the priest is part of Vatican record on the Shroud. Everyone knows that.\nMaria, all of those theories you describe have not held up to scientific scrutiny and none were done in the same scientific methodology as the original examination.\n\n","date":"April 17, 2014 at 5:34 am","url":"https://shroudstory.com/2008/10/21/the-ridiculous-picknett-and-prince-photograph-theory/","cat":"history","id":"comment-100243","author":"Robert Burns","site":"shroudstory"},{"title":"The Ridiculous Picknett and Prince Photograph Theory","post":"Ridiculous…she just told you Leonardo was born almost 100 years after the shroud was first exhibited…which theories exactly didn’t held up to scientific scrutiny?\n\n","date":"April 17, 2014 at 7:09 am","url":"https://shroudstory.com/2008/10/21/the-ridiculous-picknett-and-prince-photograph-theory/","cat":"history","id":"comment-100262","author":"Mike M","site":"shroudstory"},{"title":"The Ridiculous Picknett and Prince Photograph Theory","post":"Robert Burns: “Anna67, for example, the letter by the priest is part of Vatican record on the Shroud. Everyone knows that.”\nThat is incorrect and is a popular error promoted by skeptics and anti-authenticists. It was first popularised by two Catholic scholars about 1905 as an attempt to discredit Secondo Pia’s photographs of 1898. Herbert Thurston was a Jesuit scholar, and was assisted in his research by Canon Ulysse Chevalier.  These two gentlemen seemed to have had an agenda of mythologising traditional beliefs, following a Germanic trend, whereas the photographs were strong evidence that the gospel records were reasonably factual.  They produced a paper creating the impression that the draft of Bishop Pierre D’Arcis he originally intended to send to anti-Pope Clement VII at Avignon had in fact been dispatched.  D’Arcis had his own financial problems to repair his cathedral and was put out that pilgrims were diverted by the Shroud exhibitions at Lirey. Also he may well have been confused by reports that the Shroud had in fact been copied, notably to replace its being taken from Bensancon. Clement VII ordered D’Arcis to perpetual silence on the matter under threat of excommunication. \nThe dishonesty of the two clerics in their massaging the evidence in this affair, Thurston and Chevalier, is set out in a paper: “THE CONSPIRACY AGAINST THE SHROUD”; By Jack Markwardt; 2001.\nhttp://www.shroud.com/pdfs/n55part3.pdf\nIt is a fascinating read.\n\n","date":"April 17, 2014 at 7:14 am","url":"https://shroudstory.com/2008/10/21/the-ridiculous-picknett-and-prince-photograph-theory/","cat":"history","id":"comment-100266","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Ridiculous Picknett and Prince Photograph Theory","post":"Daveb: “The dishonesty of the two clerics in their massaging the evidence in this affair, Thurston and Chevalier, is set out in a paper: “THE CONSPIRACY AGAINST THE SHROUD”; By Jack Markwardt; 2001.”\nThey were not dishonest, Canon Chevalier was considered to be the most cultured man in Europe, Father Thurston was a well-known scholar in England.\nJust many people with these qualifications are interested in the Shroud today?\n\n","date":"April 17, 2014 at 9:51 am","url":"https://shroudstory.com/2008/10/21/the-ridiculous-picknett-and-prince-photograph-theory/","cat":"history","id":"comment-100316","author":"Louis","site":"shroudstory"}]
