[{"title":"The Sciatica Effect","post":"“Do we often enough look for alternate explanations?” Well, some us do! Mostly to be called far-fetched, without merit, or fools.\nFor instance… The Vignon ‘double crease.’ Well it doesn’t exist, does it? It appeared as an artifact of Giuseppe Enrie’s photographs (heavily manipulated in your photo above), but was not present on Secundo Pia’s, and is, of course, not present now, when the Shroud has been pulled flat. It is not very pronounced even on Enrie’s photo. Even if it ever did exist, why should it have been present a thousand years ago. There are creases, indeed, but they are more likely to have been produced by the rolling of the Shroud around a pole rather than when it was folded up.\n\n","date":"December 28, 2013 at 10:06 am","url":"https://shroudstory.com/2013/12/28/the-sciatica-effect/","cat":"history","id":"comment-69507","author":"Hugh Farey","site":"shroudstory"},{"title":"The Sciatica Effect","post":"I’ve just checked Shroudscope.  I find that a remnant of the “double-crease” is still visible on both the Enrie 1931 negative, and also on the 2002 Durante positive at even slight magnification. \nThe rolling of the Shroud around a pole is I suspect a 20th century innovation, although I might be corrected, it may have been earlier. Both the “poker-hole” and the 1532 burn-hole patterns show that it was folded when these were incurred.  Further, the prior water-stain patterns show that it was folded at some ancient time concertina fashion, into 52 segments (cm 32 x 34).  Refer “FURTHER STUDIES ON THE SCORCHES AND THE WATERMARKS”, by Aldo Guerreschi & Michele Salcito, Dallas Conference 2005. Guerreschi discusses all these foldings in some detail. He was successful in replicating the water-mark pattern by placing a replica cloth into an earthenware jar similar to those used for storage of the Dead Sea scrolls, suggesting that this was the method of storage in ancient times. How the Shroud may have been stored in Byzantium, we can only speculate. Various reliquaries have been claimed for storage under the Savoys. They seldom involved pole-rolling! \nIf we are not to be accused of “far-fetchedness” it is important I think to get just a few facts correct. \nI wonder if a neurologist might be more successful in relieving Dan’s sciatica problem.\n\n","date":"December 28, 2013 at 3:01 pm","url":"https://shroudstory.com/2013/12/28/the-sciatica-effect/","cat":"history","id":"comment-69602","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Sciatica Effect","post":"I agree that rolling the shroud round a pole is a recent way of keeping it. I also think that the majority of the visible creases on the shroud were created by this method of storage, possibly quite recently. That’s why the “double crease” was not present on Secundo Pia’s photos (having arrived between 1898 and 1931), and nor, in my opinion, at the time of all the Byzantine paintings purporting to be copies of it. I’m familiar with all the folding patterns implied by the various scorches and watermarks, and even John Jackson’s somewhat contrived display pattern, but do not think that the “hard creases” we see in the Enrie photo can be made by folding the shroud in that fashion.\n\n","date":"December 28, 2013 at 3:59 pm","url":"https://shroudstory.com/2013/12/28/the-sciatica-effect/","cat":"history","id":"comment-69625","author":"Hugh Farey","site":"shroudstory"},{"title":"The Sciatica Effect","post":"I also don’t deny that the crease did actually appear, for a while. Perhaps I should have written, “an artifact ON Enrie’s photos” rather than “an artifact OF Enrie’s photos.” My apologies.\n\n","date":"December 28, 2013 at 4:03 pm","url":"https://shroudstory.com/2013/12/28/the-sciatica-effect/","cat":"history","id":"comment-69626","author":"Hugh Farey","site":"shroudstory"},{"title":"The Sciatica Effect","post":"I come to a different conclusion. Google on “Secondo Pia Images”; Several TS negatives, variously described, attributed to Pia (not Enrie) most of which show the crease mark at the throat. Vignon’s work in the 1930s on Shroud likenesses in Art history (Vignon markings) may have been based on Enrie’s photos, but his work with Delage was based on Pia’s work. Regardless, the Pia images would seem to show the throat crease. Can you refer me to Pia images which do not show the throat crease?\n\n","date":"December 28, 2013 at 4:52 pm","url":"https://shroudstory.com/2013/12/28/the-sciatica-effect/","cat":"history","id":"comment-69638","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Sciatica Effect","post":"The biggest Pia photo I can find is at http://parislike.com/ckfinder/userfiles/images/ParisLike___Holyhood___Suaire_Secondo_Pia.jpg. Pia’s photos can be distinguished from others by a distinctive blob close to one end of the “chin crease” which is not present in Enrie’s photos (at, say http://www.artfinding.com/images/svv/2/325/cav_g._enrie_turin__il_santo_volto_le_saintsuaire-109-1.jpg). By the time we get to Vernon Miller’s photos (http://media.washtimes.com/media/image/2009/10/05/ITALY_SHROUD_OF_TURIN_Lea.jpg) we seem to have lost the “top of head” crease as well as the “neck crease.”\nIt is clear that creases come and go, and their visibility probably depends as much on the light source as anythinhg else. As you can probably guess, I’m not overly convinced of any of the Vignon markings, but this crease was the one mentioned by Dan, above.\n\n","date":"December 28, 2013 at 5:47 pm","url":"https://shroudstory.com/2013/12/28/the-sciatica-effect/","cat":"history","id":"comment-69654","author":"Hugh Farey","site":"shroudstory"},{"title":"The Sciatica Effect","post":"You asserted at #1 that the Vignon “double-crease” doesn’t exist. Apart from a minor question of semantics, it seems we have demonstrated that a crease does in fact exist. \nYou say you are not convinced by any of the Vignon markings, a position also taken by several Byzantine Art historians. Nevertheless, many others, including myself, see a credible likeness between the face on the Shroud (positive) and various early iconography. If not Vignon, how might this be established otherwise? Might I suggest that a worthwhile project you could consider pursuing as BSTS editor, is to promote some kind of competition whereby a more enduring system of comparison than Vignon’s, could be floated for those interested in asserting that the TS served as some kind of template for early iconography.\n\n","date":"December 28, 2013 at 9:02 pm","url":"https://shroudstory.com/2013/12/28/the-sciatica-effect/","cat":"history","id":"comment-69696","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Sciatica Effect","post":"Dan – my sympathies with your sciatica- I had a bout last year and then when it was gone I did a bad lift and had another bad bout. I post this openly, out of topic, in case it is of use to anyone else.\nI got excellent advice and help, partly because my father-in-law is a doctor who had  v.bad back problems himself.\n1) Get a professional to check out that it is not something needing more serious attention (unlikely).\n2) Keep with a good chiropractor/ therapist.\n3) They will do no doubt tell you the right exercises for your particular glitch- keep walking as much as you can.\n4) Amazing how the pain goes when you get on a bike as it fixes your back in position and keeps you healthy if you are unable to move otherwise. Also get a good back rest.\n5) Psychology- apparently a big difference between those who give in and those who keep going despite the discomfort- the latter are the ones who get through.\nI was told I had one of the worst problems my chiropractor had seen but now I only get a small twinge when i am sitting too long in the same place – but I do do a good walk every day with arms swinging! Good luck!\n\n","date":"December 29, 2013 at 6:15 am","url":"https://shroudstory.com/2013/12/28/the-sciatica-effect/","cat":"history","id":"comment-69802","author":"Charles Freeman","site":"shroudstory"},{"title":"The Sciatica Effect","post":"Thanks. My dog is my best therapist. He insists we go for walks. And I’m getting in a lot of reading. There are perks, as well. The doctor told me to explain to my wife that I cannot do dishes, sweep the front walk or take out the trash. Your advice is much appreciated.\n\n","date":"December 29, 2013 at 7:04 am","url":"https://shroudstory.com/2013/12/28/the-sciatica-effect/","cat":"history","id":"comment-69809","author":"Dan","site":"shroudstory"},{"title":"The Sciatica Effect","post":"Here’s the Shroud on an iron effect…\n\n","date":"December 29, 2013 at 11:37 am","url":"https://shroudstory.com/2013/12/28/the-sciatica-effect/","cat":"history","id":"comment-69839","author":"Andy Weiss","site":"shroudstory"},{"title":"The Sciatica Effect","post":"I guess we cannot post pictures in comments.  http://www.azcentral.com/prog/image.php?i=637137.jpg\n\n","date":"December 29, 2013 at 11:37 am","url":"https://shroudstory.com/2013/12/28/the-sciatica-effect/","cat":"history","id":"comment-69840","author":"Andy Weiss","site":"shroudstory"},{"title":"The Sciatica Effect","post":"\n\n","date":"December 29, 2013 at 11:42 am","url":"https://shroudstory.com/2013/12/28/the-sciatica-effect/","cat":"history","id":"comment-69841","author":"Dan","site":"shroudstory"},{"title":"The Sciatica Effect","post":"How does it work? I tried, but without success.\n\n","date":"December 29, 2013 at 12:46 pm","url":"https://shroudstory.com/2013/12/28/the-sciatica-effect/","cat":"history","id":"comment-69851","author":"O.K.","site":"shroudstory"},{"title":"The Sciatica Effect","post":"Pareidolia or what ?\nIs that a false signal to the brain ?\nPareidolia is a psychological phenomenon involving a vague\nand random stimulus (often an image or sound) being perceived\nas significant …\n— —\nAnother [interesting] point of view :\nhere my question …\nHave you an interesting idea how to measure the exact\n(= at molecular level, etc.) quantity of water during the possible\nironing experiments ?\nComparisons with measurements (before, during [… if possible] and after !)\nplasma or laser treatments are interesting optionals …\nWhat are your comments ?\n\n","date":"December 30, 2013 at 1:51 pm","url":"https://shroudstory.com/2013/12/28/the-sciatica-effect/","cat":"history","id":"comment-70195","author":"Arcimboldo","site":"shroudstory"}]
