[{"title":"Another Overwhelming Evidence Argument?","post":"The graphic above, and much of Stephen’s argument concerning the selvedge, looms of 11′-6″ width during the Roman period, etc are almost a direct uptake from Ian Wilson’s 2010 book.  Wilson cites as his authority a Flury-Lemberg article which she published in ‘Sindone’, new series no.16, December 2001, p.58.  It is claimed that Egyptian looms of this width were known, and were required for the then much-prized fashionable seamless tunic.  Complex weaves from this period are certainly known, but more often in fabrics other than linen.  A counter-argument might be that the three-pedal loom required for the most efficient production of the herring-bone twill seems to have been a later invention.  My own view is that in view of the extensive trade within the empire and beyond, together with far-flung military garrisons, it is not necessary to presume a Middle Eastern provenance for a product such as the Shroud cloth emerging in 1st century Jerusalem.\n\n","date":"September 21, 2015 at 5:43 am","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","id":"comment-210853","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Another Overwhelming Evidence Argument?","post":"I have no knowledge of cloth/fabric etc. except that I wear them, cotton tee shirt etc.  (I guess I like the abbrev. etc.)  All in all what grabbed my attention are the wrist wounds and then when I was looking at the eyes in the photos trying to see the coins that folks are talking about and all I could see was the possibility of one of the eyes open so that one pupil was visible  and then something seemed to grab me in the inside of my head and I heard the voice of my Guardian Angel tell me that I was seeing the image of the living Jesus Christ.\nI had heard my Guardian Angel before in my life, 1st time was When as a kid and drowning in a lake and I knew I was in trouble looking up in the water and seeing the surface above me but not able to do anything to pull myself up there.  He told me to say my prayers because I was going to die.  I was confused as I understood the words, didn’t know where they came from but I knew I was in serious trouble and I knew a couple of prayers but not sure which one to say and he started saying the ‘Lord’s Prayer’ or as some call it the ‘Our Father’ so I continued to say it in my mind then I saw something that looked like pinkish or reddish or ?? colored clouds and had what is now called an NDE. The I remember being told that this is all I will remember and I see what looked like a movie of me being mad at a friend and hitting him, then I saw the field next to our home that was in a different state but we were on vacation in Indiana.  Next thing I know is I’m laying on a beach towel on my stomach, my head on my arm and the towel under my head and on my hand is wet with water and snot (mucus), I was alive.  My older brother had swam out and pulled me out of the lake and did CPR on me .  The next time was when I was nearing my tour in the Marines and I was considering re-enlisting as I had been told a couple of times by Sergeants that I would be promoted to Sergeant when I  shipped over (re-enlisted), my Guardian Angel told me on 2 occasions a few days apart not to re-enlist but I just kind of ignored him.  Then one day when my enlistment was due to end, I was reminded by one of the senior Sergeants that I had better get upstairs to the personnel office and tell them I was ready to re-enlist.  The Sergeant walked away and I started to walk to the door out of the office I was in to go upstairs and in a loud voice inside my head I heard “DO NOT RE-ENLIST” I did not re-enlist, I got the message.  This was in mid February 1964. Does Viet-Nam ring a bell.  I learned to pay attention to that seldom heard voice.\n\n","date":"September 21, 2015 at 6:53 am","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","id":"comment-210857","author":"ekmcmahon","site":"shroudstory"},{"title":"Another Overwhelming Evidence Argument?","post":"Stephen’s argument goes like this:\n1) The side strip appears to have originally been part of the Shroud, cut off and resewn.\n2) This could have been because a strip from within the sheet was taken out, and the edges resewn together, in order for the finished cloth to have a selvedge on each side.\n3) The cloth could have been woven on a 3m loom, and a strip about 2m wide removed.\n4) The ancient Egyptians had looms 3m wide, and medieval weavers didn’t.\n5) This proves that the Shroud is authentic.\nApart from No.1, none of these statements bears any scrutiny, and the conclusion is tenuous in the extreme. As usual, Stephen relies almost exclusively on secondary sources, so it is difficult to track down the truth of any of his references, but here we go.\nPoint 2. With the greatest respect to Mme Flury-Lemberg, I do not go along with the selvedge argument at all. The ancient Egyptians, 1st century Palestinians, and medieval weavers were quite capable of producing cloths of various widths, with selvedges both sides. If you wanted a 110cm width of cloth, you made a 110cm width of cloth, you didn’t get a 3m width of cloth and cut a strip off it or out of it. The only reason for such an action would be if you wanted a 110cm strip of cloth, and the only one available was a 3m wide one. However, if this was the case, you’d be in a hurry, and surely not bothered about matching the selvedges, especially if it meant putting in an ugly seam all the way down the cloth. You would cut the cloth to the required width and hem the edge, so there was no ugly seam down the length of the cloth. This would be more attractive to look at and easier to do, than cutting out a strip and resewing the edges, giving you the seam down the middle. Furthermore, all you would need to do to the remaining cloth would be to hem the single cut edge, rather than having to hem both cut edges as in Flury-Lemberg’s scenario. I’m afraid I think her idea very far-fetched, and would need evidence that it was a common practice, or even a rare one, before I gave it credence.\nPoints 3 and 4. Even if the strip removal thing were granted, the cloth from which it was removed was not necessarily originally 3m wide with 1.9m removed. It could have been 2m wide and a 90cm strip removed. Although I do not know about how wide medieval looms could be, they certainly had them at least 2m wide. Viking looms are described as “typically” 2m wide.\nPoint 5. The fact that the Shroud could possibly have been woven originally 3m wide, had a 10cm strip, followed by a 190cm strip cut off, and then the 10cm strip sewn back on, does not mean that this scenario is at all likely, let alone proof of anything.\nWhile we’re at it, few of the rest of Stephen’s facts bear much scrutiny either.\nThe dimensions of the Shroud equate to “8 x 2 Assyrian cubits, the standard unit of measurement in Jesus’ time, even among the Jews.” There is no evidence for this at all, and some to the contrary.\n“The reason for such wide looms was to produce the tunica inconsutilis, or seamless tunic, which was particularly fashionable in the Roman period.” I do not know about Roman fashions, but unless a tunic is woven as a tube, or consists of nothing more than a long thin sheet with a hole in it, it has to have at least one seam to hold the sides, or one side, together. If, as I suspect, the word seamless means that it was woven from just one piece of cloth (which may have had seams at the sides), then a strip about 14 ft long and 3 ft wide would be about right, but this would not be a 3 ft length cut from a piece of material 17 ft wide, it would be a 14 ft length cut from a piece of cloth 3 ft wide. I do not think the wide Egyptian loom had anything to do with the Roman  tunica inconsutilis. Is there any evidence for this?\n“The unusual stitching, binding and finishing of the selvedges is, like the stitching of the seam joining the sidestrip to the main body of the Shroud, known only from the first century Jewish fortress of Masada.” This statement is a familiar misinterpretation of Flury-Lemberg’s opinion that the stitching at Masada means that the Shroud could have been contemporaneous, not that the stitching is not known anywhere else, or that it must have been.\nCuriously, although Stephen professes not to read this blog, I’ll bet a pound to a penny that a diatribe against me in response to this comment will appear on his blog within the next 24 hours… (4.41pm UK time)\n\n","date":"September 21, 2015 at 10:42 am","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","id":"comment-210870","author":"Hugh Farey","site":"shroudstory"},{"title":"Another Overwhelming Evidence Argument?","post":"An “almost invisible stitching” seem to be\nan interesting clue, but it’s not a proof…\nIn my opinion (…basing only on that argument)\nyou cannot win your own cause in a sort\nof “procedural debate of court”.\nInstead basing on this alleged proof and\nthen showing proper (advanced) microscopical\nanalyses you can hope to win.\nBut if you (and I point my finger on this hypothetical\ncase only as a possible example of “analytical\ninexperience”, a fact that can happen…) will want\nto intend as “advanced microscopy” mainly the\ncontrols with ATR-FTIR  and therefore you’ll use only these\nATR-FTIR checks, then I think I’ll stay with all my doubts …\n…because (for example): you haven’t yet\nanswered to me about the problem of “ATR-FTIR\npenetration depth” linked to simple observations\n(of mine) around the fact of different dimensions\nfor diameters of linen fibrils (= material to control)\nand different lenghts of light penetration into the\nlinen samples (in other words: this was a discourse\non the method used for the calibration accuracy\n[…but, unfortunately, these important details did\nnot appear in the popular book by Professor Fanti]).\n\n","date":"September 21, 2015 at 11:11 am","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","id":"comment-210874","author":"piero","site":"shroudstory"},{"title":"Another Overwhelming Evidence Argument?","post":"I try to change our perspective.\nPerhaps the key can also reside in how was cutted the strip…\nWhat is your idea on that argument?\nIs it possible to know more on that question?\nWe can start from the observation on a modern cutting.\nIn 1988 Giovanni Riggi, had in fact cut a strip…\n\n","date":"September 21, 2015 at 11:35 am","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","id":"comment-210876","author":"piero","site":"shroudstory"},{"title":"Another Overwhelming Evidence Argument?","post":"Here what I have found now: the “wimpel”. \n>A wimpel (Yiddish: ווימפל‎, from German,\n“cloth,” derived from Old German, bewimfen,\nmeaning “to cover up” or “conceal”) is a long,\nlinen sash used as a binding for the Sefer Torah\nby Jews of Germanic (Yekke) origin.\n>It is made from the cloth used to swaddle\na baby boy at his bris milah, uniting the\ncommunal world of the synagogue with\nthe individual’s own life cycle …\n>…The wimpel is an offshoot of a common\nJewish practice.\n>In the times of the Tannaim, all Torah scrolls\nwere wrapped only with a cloth, known in\nHebrew as a “mappah,” or in German, a “wimpel.”…\nLink:\nhttps://en.wikipedia.org/wiki/Wimpel\nIs that cloth an adequate analogy for the strip?\nI don’t know.\n>The wimpel, after being placed on the Torah,\nwould remain there until the next reading when it would be removed and remain in the synagogue’s collection. Some synagogues still maintain a wimpel collection. \nLinks:\nhttp://www.chabad.org/library/article_cdo/aid/683154/jewish/Bringing-Back-the-Wimpel.htm\nhttps://en.wikipedia.org/wiki/Tannaim\n-*-*-*-*-*-*-\nBarrie,\nhave you an answer?\n\n","date":"September 21, 2015 at 11:52 am","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","id":"comment-210877","author":"piero","site":"shroudstory"},{"title":"Another Overwhelming Evidence Argument?","post":"Re cutting from wider bolt of cloth:  An argument mentioned by Wilson, possibly from Flury-Lemberg, is that it did not require a great deal more labour to weave a cloth 3.0 m wide than one of only 1.0 m wide, only more yarn.  If a loom of say 3 m wide were available in the factory workshop, it would make sense to exploit its complete width for cloth production, and then cut the full bolt of cloth to obtain the individual standard commercial products, instead of having perhaps three separate set-ups.  There must be a reason why the edge piece was sewn on, and the provision of a finished selvedge makes reasonable sense.  Of course, Wilson also has another explanation, that it was a deliberate intention to centralise the facial image to conceal the cloth’s true identity as a burial cloth so as to produce a Mandylion type of presentation.  Of the two explanations, provision of a selvedge seems to me the more likely and credible reason.\n\n","date":"September 21, 2015 at 3:37 pm","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","id":"comment-210886","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Another Overwhelming Evidence Argument?","post":"I agree that the strip is a real mystery, but still think cutting the cloth in two and hemming the cut edges is so much more sensible, and elegant, than having a seam down the cloth, that I don’t think that would have happened. Perhaps, just as the weave is apparently unique, the seam is unique as well.\n\n","date":"September 21, 2015 at 5:10 pm","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","id":"comment-210892","author":"Hugh Farey","site":"shroudstory"},{"title":"Another Overwhelming Evidence Argument?","post":"I could agree that a hem would seem to be quite a reasonable and acceptable solution if the cloth had been cut from a wider bolt,  Raes found some differences between the two pieces, but this might only because the selvedge was taken distant from the main cloth.  So why wasn’t it hemmed?  Does this take us back to Wilson’s idea of centralising the facial image, and concealing its identity as a burial cloth by folding?  Shades of tetradiplon!  But I still consider it unlikely to have been the Mandylion.  But it might have been the template for it.\n\n","date":"September 22, 2015 at 2:25 am","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","id":"comment-210916","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Another Overwhelming Evidence Argument?","post":"Hello Joe Marino, I have a question for you that does pertain to this subject. The Guild has a massive historical archives from a gentleman named Donnelly who has sited an enormous amount of books that I have yet tally, and he is convinced that the weave is of the 13th century based on his research.  I have noticed you have been a recipient of some of his letters. Can you tell us briefly his hypothesis in this matter?  I hate to read thousands of pages pf his archives that contains no pictures–\nespecially the back inside cover spread that folds in thirds. You remember, Mad Magazine! LOL\n\n","date":"September 21, 2015 at 6:05 pm","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","id":"comment-210894","author":"Giorgio HSG","site":"shroudstory"},{"title":"Another Overwhelming Evidence Argument?","post":"Hi Giogio,\nLooking at the correspondence, he seemed to think it was 14th century.  Some excerpts:\n“There is a more serious probability to a 14th C. cloth, but were ‘timeless,’ being applicable also to a cloth of a defintie age between the 1st to 14C.  There is a more serious probability to a 14th C. date, because the proof for antiquity is negative-lacking in many possible materials, while assorted proofs of ‘authenticity’ are either now invalidated or still unresolved and inconclusive, like the Frei Pollen, and the textile facts are not ancient but medieval.”\n“…I believe my position, from the artist or craft subject, along with the STURP tests, is a much better scenario for a 14th C. Turin Shroud as a medieval textile.”\n“…there is no evidence of any looms to weave 3/1twills in linen of th 1st C. – or examples of regular or herringbone twills 3/1 in any linens before the 7th C. AD.  And we dont’ have to cite any further timeframe for such herringbone twills in linen, until the 14th-mid-18th C. in European countries.  Those are products of the treadle loom of four shafts with pedals, which is an advance loom of the Early to Late Renaissance–only in European linens, 15 of them.\nAccording to Pr. Gabrial Vial’s textile analysis of 1988 on the Turin Shroud, during the C-14 cuttings, that imaged cloth was woven on a treadle loom of pedals & four shafts-which confines that linen to a post-14th C. timeframe. (P.13, Spectrum #38/39, 1991.)  Thus, it is impossible to date the Turin Shroud to a period before the 14th C. – and certainly not before 1201 AD, to a spiceladen Gospel Shroud at Constantinople, (P. 167-8, Wilson, Shroud, 1979, NY).”\n(Donnelly died April 3, 1988 per a letter from his wife.)\n\n","date":"September 21, 2015 at 8:47 pm","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","id":"comment-210899","author":"Joe Marino","site":"shroudstory"},{"title":"Another Overwhelming Evidence Argument?","post":"Correction on date of death:  the date in the main text of Mrs. Donnelly’s letter says 1988, but the date at the top of the letter is from 1998, so the latter is the correct death year.\n\n","date":"September 21, 2015 at 8:49 pm","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","id":"comment-210900","author":"jmarino240","site":"shroudstory"},{"title":"Another Overwhelming Evidence Argument?","post":"In the interview “Professor Giulio Fanti discusses the controversies in the realm of Shroud studies” on http://academia. edu it is stated that work is being done on what is possibly a 13th-century patch going beyond the site from where the 1988 sample was cut.\n\n","date":"September 21, 2015 at 9:00 pm","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","id":"comment-210901","author":"Louis","site":"shroudstory"},{"title":"Another Overwhelming Evidence Argument?","post":"Thank you Joe, Yes I found his newspaper clipping that he passed away in 1998. His work is so extensive and one day I’ll archive them for the web site.\nThanks Joe.\n\n","date":"September 21, 2015 at 9:11 pm","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","id":"comment-210902","author":"Giorgio HSG","site":"shroudstory"},{"title":"Another Overwhelming Evidence Argument?","post":"One more excerpt from Donnelly that brings out an important point about the Shroud’s origin:\n“…the Turin Shroud should be interpreted a 14th C. miracle-duplication of the actual True Sindon, 33AD.  This conclusion was based on various sources quoted, STURP science, and the 1988 readiocarbon tests.  It was also a belief by acceptance, of course, of the C-14 tests as accurate, and the evidence for the Shroud as a 1st C. textile being inaccurate, as given by sindonologists.”\n\n","date":"September 21, 2015 at 9:30 pm","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","id":"comment-210904","author":"jmarino240","site":"shroudstory"},{"title":"Another Overwhelming Evidence Argument?","post":"Donnelly’s assessment is very much in line with what recent ancient textile experts tell me- the Shroud is the typical work of a medieval treadle loom. The 113cm is a pretty standard width, compare the six linen strips of the Zittau Veil, another treadle loom product, which average just this,6. 80 m in total.\n\n","date":"September 22, 2015 at 1:33 am","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","id":"comment-210915","author":"Charles Freeman","site":"shroudstory"},{"title":"Another Overwhelming Evidence Argument?","post":"When time permits I’ll publish Donnelly’s work on the HSG site. No doubt, he has done a great deal of research and has sited well over 100 books to formulate his hypothesis.\n\n","date":"September 22, 2015 at 6:34 am","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","id":"comment-210926","author":"Giorgio HSG","site":"shroudstory"},{"title":"Another Overwhelming Evidence Argument?","post":"So a medieval artisan goes to great lengths to create this relic using a medium that, to date, has not been replicated — yet uses a very common, locally sourced linen? Kind of like making a counterfeit painting of the Mona Lisa but using modern canvas. Very odd.\n\n","date":"September 22, 2015 at 9:00 am","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","id":"comment-210935","author":"David Goulet","site":"shroudstory"},{"title":"Another Overwhelming Evidence Argument?","post":"Thank you Joe, I think I’ll start archiving his work for later publications\n\n","date":"September 22, 2015 at 6:43 am","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","id":"comment-210927","author":"Giorgio HSG","site":"shroudstory"},{"title":"Another Overwhelming Evidence Argument?","post":"Mr. Donnelly wrote about a “miracle duplication of the actual True Sindon, 33 AD”. I heard this suggestion from my professor of parapsychology years ago but found it unlikely.\nA lot more research on ancient textiles will be needed.\nWhat if Joseph of Arimathea, knowing that Jesus would be put to death, had sufficient time to make arrangements to buy two shrouds, instead of one? It is a possibility. The custom of using just one burial shroud began with Rabban Gamaliel II\n\n","date":"September 22, 2015 at 3:07 pm","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","id":"comment-210952","author":"Louis","site":"shroudstory"},{"title":"Another Overwhelming Evidence Argument?","post":"Perhaps there was something of similar in the thinking of\nan italian architect: Leonardo Magno (epoch = 1990-1991)…\nReference (a publication in Italian language):\nIl lenzuolo di Giuseppe d’Arimatea e la Sindone di Torino / Leonardo Magno. – [S.l. : s.n.!, 1991. – 95 p. : ill. ; 31 cm.]\nIt was an interesting series of articles published in the journal\n “ll segno del soprannaturale” (= “The sign of the supernatural”, a magazine printed in Udine).\n\n","date":"September 23, 2015 at 9:26 am","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","id":"comment-210988","author":"piero","site":"shroudstory"}]
