[{"title":"Paper Chase:  Two New History Papers by Pam Moon","post":"Well done Pam…this is brilliant and informative work!\n\n","date":"June 5, 2013 at 2:40 pm","url":"https://shroudstory.com/2013/06/05/paper-chase-two-new-history-papers-by-pam-moon/","cat":"history","id":"comment-36210","author":"Juliet Faith","site":"shroudstory"},{"title":"Paper Chase:  Two New History Papers by Pam Moon","post":"I think these may be the first papers I have read by Pam Moon, and they are delightful. I checked back on the CDO paper posted last February. After reading through this paper, the difficulties in C-14 dating of any textile become most apparent, and it would seem quite unreliable unless the textile has been permanently stored in a hermetically sealed container. I have yet to have examples of accurately C14-dated textiles brought to my attention, and which have been corroborated by means independent of C-14. \nThe present two ‘TS in Constantinople?’ papers, present some rarely available illustrations from a unique source, the ‘Madrid Skylitzes’, which Pam asserts is the only available surviving manuscript of 10th century Byzantine history.  The illustrations are beautiful. Unfortunately there seems to be a document reading problem with Part II and not all of it could be downloaded. I hope this problem can resolved, as the papers will obviously reward close study.\n\n","date":"June 5, 2013 at 5:04 pm","url":"https://shroudstory.com/2013/06/05/paper-chase-two-new-history-papers-by-pam-moon/","cat":"history","id":"comment-36234","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase:  Two New History Papers by Pam Moon","post":"I had no problem with part II downloading completely. Maybe try it again Dave. I too find the illustrations beautiful but moreso the sculptured ivory, just wonderful. Your mentioning of the C14 and it’s issues with testing fabrics/textiles is what I have been trying to get across here for months. I have done some extensive reading on the issue and from what I have understood, testing of the Shroud material would be a nightmare to C14 technicians, due to it’s ‘extreme’ contamination. Unless and until science can find a way to get around all that contamination, another testing would be fruitless IMHO, and a fairly good reason (on its’ own), not to accept the 1988 results.\nR\n\n","date":"June 6, 2013 at 2:52 pm","url":"https://shroudstory.com/2013/06/05/paper-chase-two-new-history-papers-by-pam-moon/","cat":"history","id":"comment-36313","author":"Ron","site":"shroudstory"}]
