[{"title":"The Shroud of Turin is not the Image of Edessa?","post":"I haven’t read Jack Markwardt’s paper yet, but I would like to ask a provocative questions:\nWas the Image of Edessa the ONLY one material object?\nOr perhaps the role of The Image of Edessa was played by MORE THAN one object through history.\nI leave it aside for now. I will explain later. But there is one thing Shroud scholarship largely overlooked…\n\n","date":"December 3, 2014 at 7:30 am","url":"https://shroudstory.com/2014/12/03/the-shroud-of-turin-is-not-the-image-of-edessa/","cat":"history","id":"comment-174453","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin is not the Image of Edessa?","post":"All right, I have read Markwardt’s paper.\nI would rate it as both excellent -and foolish. He while going in bad direction he goes in a good direction at the same time, and having a key element at hand, he overlooks it.\nThe Shroud was Mandylion! The question is: whether only the Shroud?\nAnd as to the idiots from Academia – Irecommend reading this thread:\nhttps://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/\n\n","date":"December 3, 2014 at 8:55 am","url":"https://shroudstory.com/2014/12/03/the-shroud-of-turin-is-not-the-image-of-edessa/","cat":"history","id":"comment-174462","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin is not the Image of Edessa?","post":"If you want to watch and listen to Jack Markwardt, go to:  http://www.shrouduniversity.com/stlouis14.php  All the audio problems have been resolved.  Jack has gave two papers.\n\n","date":"December 3, 2014 at 10:58 am","url":"https://shroudstory.com/2014/12/03/the-shroud-of-turin-is-not-the-image-of-edessa/","cat":"history","id":"comment-174476","author":"Russ Breault","site":"shroudstory"},{"title":"The Shroud of Turin is not the Image of Edessa?","post":"Seeing this reminded me of the abrasion we see on Christ’s right cheek on the shroud. What chance of this on a bas relief?\nIt’s a level of detail one would really not expect to see in a 14th century “fake”\n\n","date":"December 4, 2014 at 3:12 am","url":"https://shroudstory.com/2014/12/03/the-shroud-of-turin-is-not-the-image-of-edessa/","cat":"history","id":"comment-174579","author":"Thomas","site":"shroudstory"},{"title":"The Shroud of Turin is not the Image of Edessa?","post":"How can you describe what you see (yellow pointer?) as an “abrasion” Thomas, when it’s indistinguishable in character from surrounding body image?\n\nAll one can say surely is that it’s an asymmetry in the facial features, one that cannot be readily explained without knowing the precise mechanism of image imprinting (which was definitely not photography).\n\n","date":"December 4, 2014 at 3:40 am","url":"https://shroudstory.com/2014/12/03/the-shroud-of-turin-is-not-the-image-of-edessa/","cat":"history","id":"comment-174580","author":"Colin Berry","site":"shroudstory"},{"title":"The Shroud of Turin is not the Image of Edessa?","post":"But this is THE problem, Colin.\nWe agree that there is an asymmetry in the facial features.\nBut is is not any kind of asymmetry.\nThis is an asymmetry which is perfectly consistent with an imprint (whatever the mechanism) of a man who had severe injuries.\nAnd those injuries are truly realistic from a forensic point of view.\nIf the TS image is the result of an imprint from a medieval template, I can see only 2 possibilities:\n1) There was no asymmetry in the template but the final image asymmetry is the accidental result of the imprinting mechanism. And this asymmetry perfectly matches the imprint of an injured face….\n2) The medieval “face” model/template “contained” this injury-like asymmetry. Does it exist a single example of medieval bas-relief or statue with this kind of feature?\n\n","date":"December 4, 2014 at 4:34 pm","url":"https://shroudstory.com/2014/12/03/the-shroud-of-turin-is-not-the-image-of-edessa/","cat":"history","id":"comment-174655","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"The Shroud of Turin is not the Image of Edessa?","post":"Thibault: first, one cannot attribute an asymmetry in facial features to injury unless one is absolutely certain the face is that of a real man.\nTemplates never produce irregularities? They can, if one uses treated linen to make it more sensitive to scorching. I have been experimenting with different additives. One is white flour – but it has to be spread very evenly. Surplus flour tends to cake and produce image distortion, giving the appearance of a bad template.\nCompared with a photograph, the TS imprint contains little in the way of real information, due to paucity of detail, low image resolution, general fuzziness, lack of colour differences, absence of texture, lack of light directionality that precludes the kind of hints one gets from 2D images as to 3D relief. One can’t even differentiate between hair and skin of the TS, except by location, such is the uniformity of image characteristics. If you can see bruises, why can’t you see details like nipples, navel, fingernails, wounds (as distinct from their blood flows)?\n\n","date":"December 4, 2014 at 5:01 pm","url":"https://shroudstory.com/2014/12/03/the-shroud-of-turin-is-not-the-image-of-edessa/","cat":"history","id":"comment-174657","author":"Colin Berry","site":"shroudstory"},{"title":"The Shroud of Turin is not the Image of Edessa?","post":"Doubtless it is indistinguishable to the inexpert eye.  Thomas is correct!  \nSummarising Barbet:  Right-side deformed below eye-socket; nose deformed by fracture of cartilage; suggested cause – stick wielded by assailant; Abrasions on left-side, tip of nose, lower lip. \nIn more detail:  Excoriations found almost everywhere on face, especially right side, which is also deformed, as if haemotomes beneath bleeding surface;  two superciliary arches show contused wounds being caused by a blow with a fist or a stick, the bony arch cleaving the skin on its deep surface below the brow. \nMost noticeable lesion – broad triangular excoriation below right eye socket.  base 3/4 inch long, point directed upwards and inwards, joining another excoriated area on nose, about two-thirds of the way up.  Here, nose is deformed by fracture of the cartilage, near join with nasal bone, which is intact.  All these lesions seem to have been caused by a stick dia of 1 3/4 inches, vigorously handled by assailant on the right.  Also excoriations on left cheek and lower lip. \nGiven this level of detail by an experienced forensic pathologist whose everyday work involved examination and reports on such injuries, and would not be easily fooled by any false artifice, the non-authenticist narrative can hold little interest for those informed and seems nothing more than a bizarre distraction from the truth.\n\n","date":"December 4, 2014 at 5:13 am","url":"https://shroudstory.com/2014/12/03/the-shroud-of-turin-is-not-the-image-of-edessa/","cat":"history","id":"comment-174587","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Shroud of Turin is not the Image of Edessa?","post":"“Given this level of detail by an experienced forensic pathologist whose everyday work involved examination and reports on such injuries, and would not be easily fooled by any false artifice, the non-authenticist narrative can hold little interest for those informed and seems nothing more than a bizarre distraction from the truth.”\nYou have overlooked one tiny detail, daveb. Dr.Barbet was not examining a real corpse. He was looking at the same faint 2D negative image as you, me and Thomas, none of us (least of all Barbet) having any certain knowledge as to how it was formed., except for one thing. It is not a photograph, so cannot be interpreted as if a photograph.\nOh, and one other thing daveb. Kindly spare me your hoity toity signings off. They do you no credit whatsoever.\n\n","date":"December 4, 2014 at 7:54 am","url":"https://shroudstory.com/2014/12/03/the-shroud-of-turin-is-not-the-image-of-edessa/","cat":"history","id":"comment-174605","author":"Colin Berry","site":"shroudstory"},{"title":"The Shroud of Turin is not the Image of Edessa?","post":"Just goes to show:  one person’s hoity-toity is another’s blazing truth….\n\n","date":"December 4, 2014 at 8:55 am","url":"https://shroudstory.com/2014/12/03/the-shroud-of-turin-is-not-the-image-of-edessa/","cat":"history","id":"comment-174612","author":"Nabber","site":"shroudstory"},{"title":"The Shroud of Turin is not the Image of Edessa?","post":"Comment in my last paragraph above was not intended to be directed at any one particular individual at all.  After reading Barbet and a succession of various other forensic pathologists, who are in substantial agreement, that is my own personal perspective on ANY non-authenticist narrative.  Whatever value they might have in coming to any understanding of the image formation process, I consider them for the most part to be trite and superficial by comparison.  Barbet not only had the opportunity to inspect the cloth itself during the 1931 exposition, but the additional advantage of also seeing it in daylight conditions, and also the 1931 Enrie negatives.  Delage, Vignon, Willis, Bucklin, Zugibe, Adler and various other such experts in forensics, while sometimes disputing incidental details, all had no doubt that they were viewing the image of a real crucified person, and no artifice.\n\n","date":"December 4, 2014 at 1:31 pm","url":"https://shroudstory.com/2014/12/03/the-shroud-of-turin-is-not-the-image-of-edessa/","cat":"history","id":"comment-174642","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Shroud of Turin is not the Image of Edessa?","post":"“…that is my own personal perspective on ANY non-authenticist narrative. Whatever value they might have in coming to any understanding of the image formation process, I consider them for the most part to be trite and superficial by comparison.”\nSomeone is missing the point here. There is no ‘non-authenticist narrative’ where the TS is concerned, for the simple reason that non-authenticists do not regard the TS image as a photograph. Their interest is in knowing what it might be if not a photograph. Until they know what it is, then no detailed interpretation is possible of this or that detail, least of all a medical one,  given that none of  knows whether it was a real person or an effigy thereof that was imprinted.\nThe Bucklin/Barbet autopsy reports on a faint 2D image of unknown origin are frankly an expression, indeed assertion of religious faith, wrapped up in the language of pathology and science. The full title of Barbet’s 1953 book, the one daveb chides me for not having  read, was hardly calculated to appeal to the scientifically-inclined reader. There was no call for Barbet to advertise his religious affiliation in the title of his book.\n\n","date":"December 4, 2014 at 2:24 pm","url":"https://shroudstory.com/2014/12/03/the-shroud-of-turin-is-not-the-image-of-edessa/","cat":"history","id":"comment-174647","author":"Colin Berry","site":"shroudstory"},{"title":"The Shroud of Turin is not the Image of Edessa?","post":"Barbet, as have others like him, brought his specialist knowledge to bear onto the particular topic of this web-site.  How it may have affected his faith thereby is reflected in the title of his work.  The substance is in its content.\n\n","date":"December 4, 2014 at 7:05 pm","url":"https://shroudstory.com/2014/12/03/the-shroud-of-turin-is-not-the-image-of-edessa/","cat":"history","id":"comment-174672","author":"daveb of wellington nz","site":"shroudstory"}]
