[{"title":"The Shroud of Turin: A Modern Relic Cult?","post":"Freeman’s selective sources. In his introduction Freeman states that “I decided to leave out the Shroud of Turin. Relic cults come and go and the Turin Shroud is very much a cult of the past fifty years, not a medieval one.”\nThat is an incredible statement. Let’s assume that we are all wrong, let’s assume that the Shroud is a hoax (It isn’t, but lets’s assume that, as they say,  arguendo.) How then to explain the badge at the Clony Museum in Paris or the paintings of the Shroud and its exposition to thousands prior to the Pia photograph of 1898. (More than 50 years ago assuming my math is accurate.) Medieval artist did indeed copy it and certain artistic conventions that appear on the Justinian coins, for example indicate they came from the Shroud image. (Check the “V” forelock)\nThe contention that Freeman ignored the Shroud because it wasn’t a medieval cult is pure baloney. He ignored because he can’t deal with it as a object of scientific inquiry.\nThe Shroud is a real object existing in this time and this place. It has been subjected to  more than a quarter million hours of scientific investigation. Art historians like Freeman are on the wrong track because whatever the Shroud is, it is not a painting and it is not art. The answers lie in science. But it is a challenge as the errant carbon dating shows. Even science can lie. But the discussion must be of science.\nI have enormous respect for Ian Wilson and the contributions he has made. His theory Edessa theory is intriguing. However, the issue is not where the Shroud was in antiquity, the issue is what the Shroud “is” now.\n\n","date":"July 7, 2012 at 7:05 am","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","id":"comment-13574","author":"John Klotz","site":"shroudstory"},{"title":"The Shroud of Turin: A Modern Relic Cult?","post":"The Shroud presents many difficulties for those who do not want to deal with the requirement for a person to make a choice.  If the Shroud is the burial cloth of Christ, this would require change in the beholder.  I suspect it is this part of this mysterious object that causes most people to do the Shroud dance Mr. Freeman has endeavored to do here.\nOne thing I wonder is: why are there many these days who speak unkindly of Ian Wilson’s work?\n\n","date":"July 7, 2012 at 9:11 am","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","id":"comment-13578","author":"Andy Weiss","site":"shroudstory"},{"title":"The Shroud of Turin: A Modern Relic Cult?","post":"In the eye of the Edessan religious elite, Yeshua’s body & blood imaged Sindon was the Pearl of pearls. In Byzantium,  it was symbolic of the divine mysteries of his Incarnation, Resurrection and even Transfiguration. It was the Relic of Relics, the Holy of Holies and was kept in a scrinium as if in THE Ark of the New Convenant…. \nHow on earth can Freeman (a Christian relic Historian) states that “(he) decided to leave out the Shroud of Turin (as) Relic cults come and go and the Turin Shroud is very much a cult of the past fifty years, not a medieval one.”? This is just beyond me!\n\n","date":"July 7, 2012 at 10:07 am","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","id":"comment-13583","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: A Modern Relic Cult?","post":"I agree fully with Andy Weiss.  With very few exceptions (Barrie Schworz would be one, Secundo Pia another), Ian Wilson has done more than any other person to bring the mystery of the Shroud to public attention.  He was a pioneer in the subject, and I deplore attempts on this site and elsewhere to dengrate his wonderful efforts, whether or not his conclusions are fully accurate or not.\n\n","date":"July 7, 2012 at 5:26 pm","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","id":"comment-13592","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Shroud of Turin: A Modern Relic Cult?","post":"Thanks daveb of wellington nz.  I am not a historian and so cannot argue with those who claim specialization and dispute Ian Wilson’s work.  Obviously not every historian of every stripe will agree on everything.  What is striking is the complete disregard for his work in its totality.  I find it difficult to believe that a reputable historian could be so completely wrong as some have boldly claimed.  I have read a couple of his books and corresponded with him through e-mail a couple times and it just seems completely out of character from what I know of the man and historian.\n\n","date":"July 7, 2012 at 5:48 pm","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","id":"comment-13593","author":"Andy Weiss","site":"shroudstory"},{"title":"The Shroud of Turin: A Modern Relic Cult?","post":"Well as been stated before on here; Wilson is not actually an historian, but a very good investigator/researcher, writer and learned pupil of historical procedures. Plus he gets alot of help from actual historians/scholars etc;. One needs to keep in mind his hypothesis is just that, an hypothesis, not a list of facts. People have the right to dissagree with him but when people try to totally disregard his complete work; as in making statements like; “His whole hypothesis is like a deck of cards…” , I tend to stop listening to thier argument at that point.\nI also agree Wilson has done an incredible job in bringing the Shroud mystery out to the masses and should be respected for that and his work.\nR\n\n","date":"July 7, 2012 at 10:24 pm","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","id":"comment-13600","author":"Ron","site":"shroudstory"},{"title":"The Shroud of Turin: A Modern Relic Cult?","post":"I recant part of my statement above as apparently, as I decided to read Wilson’s bio, he did manage a degree in History. Not sure if that actually classifies him as an historian though.\nR\n\n","date":"July 7, 2012 at 10:51 pm","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","id":"comment-13602","author":"Ron","site":"shroudstory"},{"title":"The Shroud of Turin: A Modern Relic Cult?","post":"Ian Wilson is definitely not 100 % right as Historian as far as the Turin Sindon is concerned. However he DID a true pioneering work  as TS scholar and had a couple of brilliant insights.\nNonetheless Yannick was also both right and wrong to a certain extend… The Holy Face of the Holy Mandylion and the Holy Face of the Holy Sindon  are two distinct material objetcs yet essentially identical as ingenuous false-true copy and its prototype.\n\n","date":"July 7, 2012 at 6:56 pm","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","id":"comment-13595","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: A Modern Relic Cult?","post":"Wilson just overlooked that simple fact: both Yeshua’s burial cloth (L.A. Latin sindon) and Yeshua’s burial Byssus face-veil (L.A. Latin sindon) can be follded in four/four times on themselves… He also overlooked the possible interchangebility of (L.A. /Byzantine) Greek words such as himation/sindon  & mandylion/sindon (the latter via L.A. Latin sindon).\n\n","date":"July 7, 2012 at 7:15 pm","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","id":"comment-13596","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: A Modern Relic Cult?","post":"Max, when you say Byssus face-veil what exactly are you talking about? Can you post a link to this veil?\nThanks,\nRon\n\n","date":"July 7, 2012 at 10:28 pm","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","id":"comment-13601","author":"Ron","site":"shroudstory"},{"title":"The Shroud of Turin: A Modern Relic Cult?","post":"Correction: (the latter via L.A. Latin sindon, Syriac mindiil, Arabic mandiil)\n\n","date":"July 7, 2012 at 7:18 pm","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","id":"comment-13598","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: A Modern Relic Cult?","post":"Ron, here are a few references about the Marine Byssus (sea silk) Veil of Manoppello, aka the Veronica: \n– Professsor J.S. Jaworski Faculty of Chemistry, University of Warsaw,\nProperties of byssal threads, the chemical nature of their colors and the Veil of Manoppello, Proceedings of the International Workshop on the Scientific approach to the Acheiropoietos Images, ENEA Frascati, Italy, 4‐6 May 2010\n– Professor Heinrich Pfeiffer, Professor of. Early Christian Art at the Pontifical Gregorian University, “Is the Veil of Veronica found in Rome or in Manoppello?\n\n","date":"July 8, 2012 at 5:34 am","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","id":"comment-13605","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: A Modern Relic Cult?","post":"Thanks for the info. I have read Prof Pfeiffer’s paper and others but not Prof Jaworski’s. So what you are talking about here is what is also known as the ‘Veil of Manoppello’, …correct? Your statement that Wilson overlooked that both Yeshua’s burial cloth (the Shroud?) and the Byssus face-veil (Vof M?) can be folded four/four times (doubled in four?) onto themselves, needs clarifying also. Are you talking about Wilson’s Tetradiplon (doubled in four) hypothesis? Because if you are, I would say there is no problem! As Wilson’s hypothesis states and has been shown (technically), and most probable, that the Shroud can be folded in this way and show the complete face image, impossible to do so with the VoM or anyother veil being held anywhere.\nAs for the VoM I for one do not believe it is authentic and most likely a medieval work of art. Mind you an incredibly ingenious one! Reasons being that pigment, or what appears as pigment has been found on the image areas, and yes I am aware of some touch-ups that have been found, but these are a different issue. Secondly, and this is strictly my laymen’s opinion; Looking at the VoM image just seems to me to be not a natural image, but an artist’s rendition. This seems quite obvious to me and I’ve contemplated the image thoroughly, viewing may photos of it, but I have never had the pleasure to see it first hand. \nR\n\n","date":"July 8, 2012 at 3:23 pm","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","id":"comment-13610","author":"Ron","site":"shroudstory"},{"title":"The Shroud of Turin: A Modern Relic Cult?","post":"I have just one question for you (especially the fanatics of Wilson and his ideas): When you understand that I wasn’t aware of this guy Freeman and his work while doing my personal researchers about the Mandylion and Wilson’s hypothesis, don’t you find it bizarre that almost all the conclusions of Freeman concerning the Mandylion and Ian Wilson that we can read in this very good paper are EXACTLY THE SAME THAN MINE, i.e. that it is an hypothesis we can put in the same bag than Dan Brown’s hypotheses regarding Christianity ???  To me, that finding speak very loud !!!\nHonestly, I still have a hard time to understand why a guy like Wilson, who obviously suffer of the Dan Brown syndrome well before Dan Brown, have gain so much (doubtful) credibility in the Shroud World.  As I once said on this blog, I think it’s because history is the really not the cup of tea for the majority of the people involved in the Shroud world.  And I also think that Wilson was wise enough to get some pushing from other Shroudies, especially from some pro-Shroud historians (who have obviously a great bias toward the Shroud authenticity).  I don’t see other reason to explain this mess (i.e. the high level of credibility of Wilson in the Shroud world).  I have no problem saying that this is a total mess because when you step outside the Shroud world, all the credible experts in Byzantine history look at his ideas and have a big laugh…  And this is truly painful for a guy like me who take all that concern the Shroud very seriously and honestly (while only seeking the truth and nothing else).\nLook, I believe the Shroud is authentic, but at the same time, I’m not ready to buy blindly any proposed theory concerning it (whether it be a theory concerning the obscure history of the cloth or the image formation process) that is, like the one of Wilson, so obviously full of pro-Shroud bias…  That’s precisely why all the credible historians out there look at Wilson and have a big smile from ear to ear.  The end of Freeman’s paper says it all : “I am writing this in the hope that those who read Ian Wilson’s immensely enjoyable essentially fictional account of the history of the Turin Shroud accept it as such, fiction not history.  My friends, I couldn’t have said better !!! \nAnd I should also say tha this is exactly the same thing that prevail for every hypothesis found in the books written by Dan Brown.  I don’t see any difference at all between these 2 characters because both are there obviously to make a buck over Jesus name and gain some “popularity” over it… And both have succeed greatly while doing so !  Like Hitler said : “The bigger the lie the more people will believe it.”  For Dan Brown and Ian WIlson, this reality of human nature contributed much to fatten their wallets…  It’s sad but it’s so true.\n\n","date":"July 8, 2012 at 5:00 pm","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","id":"comment-13613","author":"Yannick Clément","site":"shroudstory"},{"title":"The Shroud of Turin: A Modern Relic Cult?","post":"A May 2010 article on Ian Wilson with bio and personal interview in the Australian Catholic Weekly can be rapidly found from Google.  For me, this interview speaks more profundly on the honest motives of Ian, much more so than Yannick’s  paranoiac obsessiveness.  His assertions denigrating Ian Wilson’s motives come close to being libellous, and do him no credit.  Wilson has constructed hypotheses on the Shroud’s whereabouts during the unknown years, and any other known subsequent reconstructions are generally mere modifications of these.  Critics who claim that Wilson doesn’t know what he’s talking about are all silent on offering any alternative hypothesis, including Yannick Clement!  He has offered no alternative.  It’s such an easy and facile matter to criticise, and he is obviously not up to the task of being constructive in offering an alternative.  He should either be silent, or tell us where it was during this time.  He cannot!  \nOthers I am sure will be interested to read the ACW article on Ian Wilson.  It provides a moving insight into the motives of the man.\n\n","date":"July 8, 2012 at 10:15 pm","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","id":"comment-13625","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Shroud of Turin: A Modern Relic Cult?","post":"It’s not because THERE IS NO HYPOTHESIS THAT WORK FOR THE SHROUD’S OBSCURE YEARS THAT :\n1- Ian Wilson’s hypothesis can be automatically called “interesting” or can be considered like an authentic accepted “theory” as it is (sadly) almost the case in the Pro-Shroud world.\nAnd 2- the Shroud is not authentic !!!  That can simply mean that this relic was hidden for a very long time, maybe until the time it came to Constantinople…\n\n","date":"July 9, 2012 at 9:03 pm","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","id":"comment-13666","author":"Yannick Clément","site":"shroudstory"},{"title":"The Shroud of Turin: A Modern Relic Cult?","post":"\ndaveb of wellington nz :\nA May 2010 article on Ian Wilson with bio and personal interview in the Australian Catholic Weekly can be rapidly found from Google.  For me, this interview speaks more profundly on the honest motives of Ian (…) It provides a moving insight into the motives of the man.\nIndeed! \nIt says some things very clearly: \n‘He studied Modern History at Magdalen College, Oxford, a degree he hoped would lead to a career in journalism, but it was not to be.’\n(…)\n‘I had absolutely no inclination to become an academic: a history degree was simply a passport to a better job.\n(…)\n‘However, because the job of a junior reporter was poorly paid I opted first to go into advertising, then in 1969 joined the Bristol Evening Post newspaper group as head of its publicity and promotions department. So although for a decade I worked closely with journalists, I never became one.’ \nSo, by his own admission, he studied history with no real interest in it – he just hoped he could get a job in journalism. And when that didn’t come through, he had to find something else. \nThat’s when he met Maurus Green (who needs no introduction here), David Willis (‘a family doctor who had converted to Catholicism largely as a result of his medical studies of the Shroud’ (???!!!)), and Vera Barclay (a popular Scout Mistress). \nAnd he embarked on ‘a three-month historical research project in the old Reading Room of the British Museum’. (Other people spend years and years grappling with Byzantine sources, which are notoriously difficult to use, as they are largely couched in a theologically or hagiographically inflected language of apology and polemic that is not only very distant from modern habits of mind but also nearly impossible to pin down in factual terms. But this young man, to whom a history degree was only a passport to a better job, did all the research in 3 months.) \nAnd ‘…this led in 1978 to the publication of the book which launched me as a full-time author.’\nAnd ‘The Turin Shroud was an international bestseller.’\nAnd that was it. The journalism career that he was hoping for never came through, but his family GP and a Scout Mistress helped him find his way.\n\n","date":"July 9, 2012 at 5:47 am","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","id":"comment-13639","author":"Davor Aslanovski","site":"shroudstory"},{"title":"The Shroud of Turin: A Modern Relic Cult?","post":"\ndaveb of wellington nz :\n His assertions denigrating Ian Wilson’s motives come close to being libellous, and do him no credit.\n\nThe same can be said about the personal insults hurled here at every scientist who doesn’t agree with even a part of Wilson’s theories.\n\n","date":"July 9, 2012 at 5:52 am","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","id":"comment-13640","author":"Davor Aslanovski","site":"shroudstory"},{"title":"The Shroud of Turin: A Modern Relic Cult?","post":"If I’m so angry toward Wilson, it is simply because I have do my homeworks about his Mandylion hypothesis and came out 100% convinced that this guy suffer of the same syndrom than Dan Brown.  These 2 guys are the kings of the semi-truth and they are also very good at re-arranging the historical facts in their favor without any care for the real quest for truth.  That’s what I think after studying Wilson hypothesis in dept.  Sorry for his fans !\n\n","date":"July 9, 2012 at 9:08 pm","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","id":"comment-13667","author":"Yannick Clément","site":"shroudstory"},{"title":"The Shroud of Turin: A Modern Relic Cult?","post":"I personnaly don’t agree with 50-75% of Wilson’s claims. However  fact remains: in terms of “Shroud investgation”, he proved more intuitive than Davor Aslanovki who think himself a High Priest of Art History when the later JUST MISSED several iconological, textual, archeological and even iconographic pieces f evidence IN FAVOR of a direct link between the imaged cloth of Edessa and The imaged Turin Sindon.\n\n","date":"July 9, 2012 at 9:50 am","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","id":"comment-13647","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: A Modern Relic Cult?","post":"Correction: I personnaly don’t agree with 50-75% of Wilson’s claims. However a fact remains: in terms of “Shroud investigation”, he proved more intuitive than Davor Aslanovki who thinks himself a High Priest of Art History when the latter JUST MISSED several iphilological, textual, archeological and even iconographic pieces of evidence IN FAVOR of a direct link between the imaged cloth of Edessa and the imaged Turin Sindon.\n\n","date":"July 9, 2012 at 9:53 am","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","id":"comment-13648","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: A Modern Relic Cult?","post":"Max, I’m glad that, at least (and contrary to most Pro-Shroud fanatics out there), you don’t buy blindly everything that come out of Wilson’s head !!!  You got to remember that this guy have a very good imagination and is also very good at taking a legendary manuscript and making it say things that it don’t really say !!!\n\n","date":"July 9, 2012 at 9:10 pm","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","id":"comment-13668","author":"Yannick Clément","site":"shroudstory"},{"title":"The Shroud of Turin: A Modern Relic Cult?","post":"One last comment about my comparison between Wilson and Dan Brown.  I’m sure if we would make a survey in the Pro-Shroud world, almost 99% of the people would say that Brown is a money-maker who got a very good imagination and his very good to take an historical fact and extrapolate on it in order to go where he want to go.  But I just don’t understand why it’s not that way with Wilson !  Would it be simply due to the fact that most people don’t really seek the truth but instead, they only seek THEIR truth (which is something completely different) ?  Good question, don’t you think ?  And before you ask me, yes, I personally try the best I can to seek only the truth and go where the FACTS lead me.  Look, the proof of that is the fact that I believe the Shroud is genuine and, nevertheless, I don’t trust one bit of Wilson’s hypothesis…\n\n","date":"July 9, 2012 at 9:26 pm","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","id":"comment-13670","author":"Yannick Clément","site":"shroudstory"},{"title":"The Shroud of Turin: A Modern Relic Cult?","post":"Oh…  I forgot to ask you one last question (a very short one, but a very interesting one):\nWhat would be the big deal if we can proof (I think I came close of doing that with my recent paper) that Wilson’s hypothesis is no good ???  \nI ask this because I want to emphasize the fact that if his hypothesis is incorrect, that doesn’t mean for one second that the Shroud is not authentic…  So, again, I ask you :  If Wilson’s idea is false about the Mandylion, what’s the big deal with that ???\n\n","date":"July 9, 2012 at 9:29 pm","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","id":"comment-13671","author":"Yannick Clément","site":"shroudstory"}]
