[{"title":"The Three Byzantine Burial Cloths of Jesus","post":"O.K. You did some good work. As we know, both Mesarites and de Clari refer to the cloth as a burial cloth, the problem arises when the former refers to a “cheap cloth”. What was cheap in his view? Perhaps what he meant to say was that the linen was like sackcloth when compared to the luxurious fabrics used by the rich Byzantines, taking silk brocade as an example.\n\n","date":"May 11, 2014 at 6:08 pm","url":"https://shroudstory.com/2014/05/11/the-three-byzantine-burial-cloths-of-jesus/","cat":"history","id":"comment-117196","author":"Louis","site":"shroudstory"},{"title":"The Three Byzantine Burial Cloths of Jesus","post":"The Latin phrase Mesarites used is linum usitatissimum, which don’t mean “cheap cloth” but “common flax”.\n\n","date":"May 12, 2014 at 7:34 am","url":"https://shroudstory.com/2014/05/11/the-three-byzantine-burial-cloths-of-jesus/","cat":"history","id":"comment-117694","author":"Max patrick Hamon","site":"shroudstory"},{"title":"The Three Byzantine Burial Cloths of Jesus","post":"…on un US English “rough linen fabric”.\n\n","date":"May 12, 2014 at 7:44 am","url":"https://shroudstory.com/2014/05/11/the-three-byzantine-burial-cloths-of-jesus/","cat":"history","id":"comment-117702","author":"Max patrick Hamon","site":"shroudstory"},{"title":"The Three Byzantine Burial Cloths of Jesus","post":"Typo: The Greek phrase Mesarites used reads like a loan translation from Latin linum usitatissimum.\n\n","date":"May 12, 2014 at 7:55 am","url":"https://shroudstory.com/2014/05/11/the-three-byzantine-burial-cloths-of-jesus/","cat":"history","id":"comment-117711","author":"Max patrick Hamon","site":"shroudstory"},{"title":"The Three Byzantine Burial Cloths of Jesus","post":"At the end of Mesarites quote “In this place He rises again and the sudarium and the burial\nsindons can prove it”. It sounds quite possibly as though he is alluding to an image/blood, otherwise how could the cloths prove it? The problem then is that the cloths are described as having a common weave, which would appear to exclude the TS.\n\n","date":"May 12, 2014 at 8:35 am","url":"https://shroudstory.com/2014/05/11/the-three-byzantine-burial-cloths-of-jesus/","cat":"history","id":"comment-117741","author":"ChrisB","site":"shroudstory"},{"title":"The Three Byzantine Burial Cloths of Jesus","post":"ChrisB, don’t you mistake linum usitatissimum, “common flax/rough linen”, for “common weave”.\n\n","date":"May 12, 2014 at 9:32 am","url":"https://shroudstory.com/2014/05/11/the-three-byzantine-burial-cloths-of-jesus/","cat":"history","id":"comment-117779","author":"Max patrick Hamon","site":"shroudstory"},{"title":"The Three Byzantine Burial Cloths of Jesus","post":"There could have been another piece of the same cloth that had been cut into about three smaller pieces to make the bands and these were lost during the looting.\n\n","date":"May 12, 2014 at 9:22 am","url":"https://shroudstory.com/2014/05/11/the-three-byzantine-burial-cloths-of-jesus/","cat":"history","id":"comment-117774","author":"Louis","site":"shroudstory"},{"title":"The Three Byzantine Burial Cloths of Jesus","post":"There is an ancient community of Christians in the south of India. They are known as the “Nasranis”, which is a variation of “Nazarenes”, and are mostly Jewish in origin. The Portuguese called them “Judaizers” in the 16th century and tried to suppress their Jewish customs, which are still maintained today although they are Christians.\nTheir site http://www.nasrani.net\nhas something about a letter sent by the apostle Thomas from India to Edessa, with reference to Adai. When Thomas went to Syria on the way to India(?) he mentioned no image in Edessa, which means that he may travelled before our Image of Edessa/TS arrived in Edessa.\nhttp://www.nasrani.net/2008/09/20/letter-of-st-thomas-the-apostle-to-edessa-from-india/\n\n","date":"May 15, 2014 at 11:20 am","url":"https://shroudstory.com/2014/05/11/the-three-byzantine-burial-cloths-of-jesus/","cat":"history","id":"comment-119984","author":"Louis","site":"shroudstory"},{"title":"The Three Byzantine Burial Cloths of Jesus","post":" Their site http://www.nasrani.net\nhas something about a letter sent by the apostle Thomas from India to Edessa, with reference to Adai. When Thomas went to Syria on the way to India(?) he mentioned no image in Edessa, which means that he may travelled before our Image of Edessa/TS arrived in Edessa.\nhttp://www.nasrani.net/2008/09/20/letter-of-st-thomas-the-apostle-to-edessa-from-india/ \nSlow down, Louis. The Syriac Doctrine of Apostles was probably written in the 4th-5th century, and like all apocrypha, should be taken with care. It provides just some basic information about Apostles, known either from the New Testament, or other well known sources on Christian tradition. There is, in fact, nothing new in it.The major corpus of the work is the list of canons, each starting with the phrase “Next Apostles established that…” which in fact, reflects more the situation in contemporary Syriac Chruch, than Apostolic Age. \nThe phrase that interest us most, cited in the article is: \nThey [successors of the Apostles], again, at their deaths also committed and delivered to their disciples after them every thing which they had received from the apostles; also what James had written from Jerusalem, and Simon from the city of Rome, and John from Ephesus, and Mark from the great Alexandria, and Andrew from Phrygia, and Luke from Macedonia, and Judas Thomas from India:\nLook that it is general list, not proving by any means that there were some actual letter of Thomas (as well as Andrew, for example, the rest of the mentoned characters wrote books that are in the NT). It may as well refer to the semi-gnostic Acts of Thomas.\nBesides, in the whole text of the Syriac Doctrine of Apostles, there is no direct link between him and Edessa. While listing parts of the world where Apostles preached the Gospel, Thomas is linked with India and surrounding countries, instead the apostle of Edessa is Addai.\nThe article is in my opinion, just a very wild speculation. I don’t deny that Thomas might have sent some letter, but there is no evidence of this.\n\n","date":"May 15, 2014 at 5:11 pm","url":"https://shroudstory.com/2014/05/11/the-three-byzantine-burial-cloths-of-jesus/","cat":"history","id":"comment-120104","author":"O.K.","site":"shroudstory"},{"title":"The Three Byzantine Burial Cloths of Jesus","post":"Hi O.K. I was slow when writing. Did you see the question mark in my comment above? I see no hard evidence, only pointed out that there are traditions that are ancient. Thomas was said to have been beheaded in India, but his remains are said to be in Syria.\n\n","date":"May 15, 2014 at 5:50 pm","url":"https://shroudstory.com/2014/05/11/the-three-byzantine-burial-cloths-of-jesus/","cat":"history","id":"comment-120123","author":"Louis","site":"shroudstory"},{"title":"The Three Byzantine Burial Cloths of Jesus","post":"I didn’t dispute Thomas travel to India, which almost certainly took place (although little detail of it is available). I just pointed that claims that he wrote some letter, furthermore to the particular Christian community in Edess, are just speculations well beyond the scope of the sources available to us -not to say about its alleged relation (or lack of it) to the Image of Edessa.\nActs of Thomas are here: http://www.gnosis.org/library/actthom.htm But there is very little about Thomas history, majority of it are some fables and sermons.\n\n","date":"May 15, 2014 at 6:05 pm","url":"https://shroudstory.com/2014/05/11/the-three-byzantine-burial-cloths-of-jesus/","cat":"history","id":"comment-120129","author":"O.K.","site":"shroudstory"},{"title":"The Three Byzantine Burial Cloths of Jesus","post":"Every second Christian in the region is named “Thomas”. The gnostics place a lot of value on spurious writings linked to Thomas because of the “Gospel of Thomas”. However American scholar Luke Timothy Johnson, who is a heavyweight, has argued convincingly why it is based on the canonical gospels.\nOne group has argued that Thomas could not have preached Jesus in India because the gospels were written after his arrival there. This is pure ignorance and I have argued more than once that the written gospels were preceded by an oral tradition prevailing among the Jesus movement communities. “Q”, “Quelle” or “source” in German is just a hypothesis, the communities did not all rely on one source, they themselves were several sources, therefore the differences in the narratives we read in the gospels, which nonetheless provide a message that is on the whole uniform and coherent.\nJesus did not go to India, as the group has claimed:\nhttp://holyshroudguild.org/uploads/2/7/1/7/2717873/the_quest_for_jesus_in_shroud_research.pdf.pdf\n\n","date":"May 15, 2014 at 6:26 pm","url":"https://shroudstory.com/2014/05/11/the-three-byzantine-burial-cloths-of-jesus/","cat":"history","id":"comment-120143","author":"Louis","site":"shroudstory"}]
