[{"title":"The Two Lirey Badges: Unmistakable Differences","post":"I should be interested to know what is to be made of the inscription at the foot of the Machy badge, thre is none on the Paris badge.  Ian W doesn’t refer to it specifically in his latest paper.  Has anyone decrypted it previously? What is its meaning?\n\n","date":"February 4, 2014 at 5:47 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76402","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"From the left, before the tip of the shield, an E (possibly missing an L for LE). In the middle, SVAIRE: (or SUAIRE, in Roman Letters), and then maybe IhV and C after the tip of the second shield, which Alain Hourseau (at http://www.sindonology.org/papers/clunySouvenir.shtml) suggests may be the Greek letters IEVS, and perhaps a cryptogram for JESUS. I’m not convinced of that, but can’t think of a better alternative off hand.\n\n","date":"February 4, 2014 at 6:49 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76420","author":"Hugh Farey","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Hugh,\nDon’t keep the blog in suspense. The sindology site and Google translate by the way,  translate the inscription as “The Shroud of Jesus.” I will be writing about Occam’s Razor this week and its egregious misuse by Walter McCrone but I do think that applying it, “The Shroud of Jesus” is the simplest solution and the most appropriate.\nOf course, I am a little disappointed. Based upon the posts of one of the expert bloggers here,  I would have thought it would have been: “The Shroud of Saint Jacques de Molaqy.”\nOh, oh, I’m bleeding. My tongue just pieced my cheek. I really have to tone it down.\n\n","date":"February 4, 2014 at 7:28 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76429","author":"John Klotz","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"typo alert “Molaqy” = “Molay” St. Jacques forgive me.\n\n","date":"February 4, 2014 at 7:30 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76431","author":"John Klotz","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"The sindonogy site does indeed render the inscription as the Shroud of Jesus. More specifically, it was Alain Hourseau who made the identification. However, his words regarding the part of the inscription after SUAIRE are “It is followed by the three greek letters iota, eta, and sigma which would be the abbreviation for “the Shroud of Christ.” This seems to me a little odd. For a start he does not seem to notice the prominent “V” which forms part of the second inscription; for a second it seems unnecessary to include an abbreviation for ‘shroud’ when it already appears in full just beforehand, for a third it seems odd to switch from French to Greek for the abbreviation, and for a fourth I cannot see how IEUS (or IEUC) can be a abbreviation for “the Shroud of Christ” in any language. Explanations for these four anomalies may be more obvious to you than to me, or does Occam’s Razor allow you to pretend they don’t exist?\n\n","date":"February 4, 2014 at 8:49 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76454","author":"Hugh Farey","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Yes, I’m more and more inclined to the view that is was fabricated initially as the (symbolic) shroud of a slow-roasted Templar, maybe Jacques de Molay or Geoffroi de Charney. Thus the one-off resort to pyrography, aka scorching, an imaginative ploy on the part of a medieval graphics artist.\nIn fact, I attempted almost a year ago to fit the differences between the Lirey pilgrim’s badge and the (earlier? later?) badge produced from the Machy mould.\nhttp://shroudofturinwithoutallthehype.wordpress.com/2013/02/28/shroudie-alert-day-11-emeritus-pope-benedict-xvi-what-is-one-to-make-of-his-devotion-to-the-shroud-despite-that-radiocarbon-dating/\nHere’s a key passage:\n09:40:  I’ve spent the last half hour looking closely at the mould for a Lirey badge – the one now (fortunately) in the possession of  scholar Alain Hourseau. If I’m not mistaken there’s a strong clue as to how the non-Christ-like image of the Man on the Lirey badge was gradually melded with that of the Man on the Shroud to identify BOTH in the minds of pilgrims as that of the crucified Christ. How was that achieved? It was very very clever. It was done by adding a third image to the Lirey badge (Mark 2, Mark 3?) of a facecloth, but not the Oviedo-type one, with blood only, but a recognizable  Christ-like face (not dissimilar to the Secondo Pia reversed image!!!!).  This gets more interesting by the minute. Back later.\nThe above was based on the view that “suaire” in French is not strictly speaking a shroud, but a face cloth – thus the allusion above (no more) to the Oviedo facecloth, but what I had in mind was an attempt by the proto-Madison Ave Lirey team to unite in people’s minds the separate biblical references to both shroud and facecloth via badge-to-badge image morphing, thereby pulling off one of the most spectacular marketing coups in history.\n(Oh, as an afterthought, if Joe Marino is reading this, I shall be researching my files on Ray Rogers’ wilderness years post 1988 up to 2000 to see if I can substantiate that possibly mistaken claim for him to have been piqued re the radiocarbon dating. I need to pin down precisely when the 78 sticky tape “image ghosts” morphed (that word again) into  “starch impurity coatings”, inspired by references to Pliny, that marking his descent I consider into non-covert authenticism).\n\n","date":"February 4, 2014 at 8:09 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76437","author":"colinsberry","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"So Colin, you do make things up before doing research. I knew it.\n\n","date":"February 4, 2014 at 8:17 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76438","author":"Paulette","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"You must surely be aware, Paulette, that every  scientist “makes things up” before doing research, real research that is. It’s called hypothesizing. One then goes into a different mode (objective tester of a hypothesis, imagining that it had come from someone else, and then attempting to shoot it down). \nOr are you suggesting that research is best left to automatons? The latter are not noted for generating original ideas.\nThose who can do…  ;-)\n\n","date":"February 4, 2014 at 8:26 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76445","author":"colinsberry","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Paulette. Surely, it’s not so much ‘making things up’ before doing research. it is rather approaching an issue with an open mind and then looking at all the possible areas to research. I have a lot of doubts about the authenticity of the Shroud but one needs to brainstorm ALL the possible ways in which it might have ended up in Lirey. \n    I am still advocating research on the early relic trade routes from Jerusalem to northern France that we know existed and led to collections of relics close to Lirey  supposedly from ‘the Lord’s Tomb’, as, applying Occam’s Razor, this is the simplest solution to how the Shroud got to Lirey (possibly, as I have argued, transferred to Geoffrey de Charny as ‘a spoil of war’ while he was fighting the English in northern France).\n\n","date":"February 6, 2014 at 5:09 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76952","author":"Charles Freeman","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Rogers was piqued! You stated that as a fact. You can’t hide from that blunder, Colin. You were sloppy.\n\n","date":"February 4, 2014 at 8:30 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76446","author":"Paulette","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"OK, I was sloppy. Maybe I’m having an off-day. Some of us have off-years, don’t we Paulette?\n\n","date":"February 4, 2014 at 8:37 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76449","author":"colinsberry","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Colin,\nI have avoided asking a question of you because it might lead into an irrelevant morass. But your fixation on de Molay and your disdain for Rogers (his pique) leads me to ask it:\nWere you ever a member of the Order of de Molay? or any other organization dedicated to his memory.\nThere are skeptics of the Shroud who unfairly, and inaccurately , depicted STURP as a band of fanatic Christian soldiers. There were many Christians on the STURP team. There were also Jews, agnostics and perhaps some atheists. Thus that attribution was wrong. However, were the member of STURP all been Christian fanatics, or Opus Deii  members, that would be a legitimate question of whether their Christian fanaticism colored their science.\nI will confess, I am a Roman Catholic although I’m not so sure of the Roman part sometimes. I guess I am like Pope Francis: A Vatican Council Catholic, The Pope has described himself  a Vatican Council priest. It is a fair question when challenging me that I am Catholic. It also a fair question to ask a skeptic challenging the Shroud whether he is an atheist. Neither atheism nor Catholicism should disqualify any one from studying and discussing the Shroud and its science. But when someone comes off-the-wall, such as describing the Lirey badge as a hidden tribute to Jacques de Molay, it is a fair question to ask if he was a member of the Order of de Molay and perhaps had access to information not generally shared with the public.\nI await your answer and expect vituperation. But if the vituperation surrounds a answer, I’m a big boy. I can take it.\n\n","date":"February 4, 2014 at 8:52 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76456","author":"John Klotz","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"A rough analogy for my question. If you were a Yale graduate, and a member of Skull & Bones, their rules would require not an answer, but that you leave the “room.” That you leave the room is not my intention at all.\n\n","date":"February 4, 2014 at 8:56 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76457","author":"John Klotz","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"The Order of de Molay is part of some groups in freemasonry, De Molay was the Grandmaster of the Knights Templar. Philippe le Bel’s treasury was empty so he pounced on the opportunity to arrest the GM and his knights after he left Cyprus and reached France to discuss plans for a new crusade with the Pope.\n\n","date":"February 4, 2014 at 9:03 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76458","author":"Louis","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Louis,\nOf course your right but I wanted Colin to answer without getting into a discussion of the FM word (Free Masons) I do think, given Colin’s cult-like devotion to an idealized Jacques Molay it’s a legitimate suggestion. \nWhat happened to de Molay was despicable but the reason were rather pedestrian. There’s an old saying “on the street.” You loan me $10  you own me. You loan me $100,000, I own you.\nde Molay was too generous with the King of France and he didn’t realize who owned who.\nI think everyone who was ever burned at the stake, be that saint, heretic or sinner were grievously wronged. There is one theory that it wasn’t as horrible as we believe because the fire drew in all the oxygen and the victims were asphyxiated before their flesh was burned. I don’t really know and I am not anxious to find out.\n\n","date":"February 4, 2014 at 9:58 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76477","author":"John Klotz","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Hi John,\nI’m sure you know that the De Molay society is for youngsters, so to bring the discussion back to 14th-century France, the Chinon Parchment dispelled all the doubts, the Templars were no heretics, and even Malcolm Barber welcomed the discovery of the document. Pope Clement V was forced to suppress the Order and since the document he made did not leave the door open for any revival, Pope John XXII established the Order of Christ in Portugal, which counted Vasco da Gama, Ferdinand Magellan, Pedro Álvares Cabral and other important names in history among the ranks. \nIt looks like stars were important to Geoffrey de Charny, who was keen on establishing another Order of Chivalry, the Order of the Star, where members would be devoted to the Christian faith, in keeping with what the Templars thought.\n\n","date":"February 4, 2014 at 2:04 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76535","author":"Louis","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"“Colin’s cult-like devotion to an idealized Jacques Molay it’s a legitimate suggestion. ”\nHilarious. But you don’t seriously expect me to rise to your bait, do you Mr. Klotz?\n\n","date":"February 4, 2014 at 10:13 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76481","author":"colinsberry","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"You don’t surprise me with your response but you disappoint. Didn’t you once ask Davidb if he was trained by the Jesuits, or some such? He responded with a detailed answer. \nIf someone were to suggest that my belief in the authenticity of the Shroud sprung from my membership in the Knights of Malta and/or the Knights of Columbus, I would simple deny both of such memberships. Were I be asked if I were a member of Opus Dei, I would also deny it. Not because membership in any of the three organizations is a disqualification but membership in any one of the three might define my sense of the Catholic Church. I am not been a member of any of the three, by the way.\nHonestly, Colin, there is only one other person who I ever had a discussion with on de Molay that I can recall. It was in college and I spotted a pin on one of colleagues lapel. I asked him what it was for and he said the Order of de Molay. I asked who he was and he explained it was a Masonic youth order and de Molay was a martyr to free speech.  I put that into my mental file and forget folder along with the Rosicrucians who advertised in the back pages of magazines such as Popular Science. \nThe alleged assassin of Robert Kennedy was identified as having dabbled with a Rosicrucian society and that led me on a trail that wound-up with Holy Blood, Holy Grail (HBHG). It was an interesting read but as I do with most conspiracy books I ignored the principle premise of the book (an obscure Frenchman was a blood descendant of Jesus Christ and was seeking to institute a new really European Empire) and concentrate on the verifiable facts reported. It was an interesting read on the history and I was fascinated by the fact that Madame Calve, the prima diva her time was supposed to be a member of the Pre de Sion, the uber-conspiracy that ruled the world. Madame Calve in the nibneteen twenties had invited my Aunt Pauline, a very great soprano to come to Paris and be her protégé. She didn’t and her story can be found at http://www.johnklotz.com/billy.htm along with some  other family history.\nThe grain of salt I took about the Priory of Sion  was big enough to choke a horse. Dan Brown used the allegations of HBHG  as the inspiration of his “The daVinci Code”  and believe it or not, one of the writers of HBHG was also one of the writers of “The Silent Witness.” That doesn’t make HBHG true or Silent Witness false. Each work must stand on its own.\nBottom line, I am a little more knowledgeable about Jacques de Molay than I was 55 years ago. I guess CB, you are afraid to give an honest answer to the question. \nIf you weren’t so defensive, maybe we could get a new insight. \n“There might be giants” and there might be conspiracies. Of the two, conspiracies might be more probable. Then again, some might think that existence is a conspiracy, or at least a hologram. Cf Lawrence Krauss in the” Real Face of Jesus” video.\n\n","date":"February 4, 2014 at 10:59 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76495","author":"John Klotz","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"I hate to get in between you two heavyweights here, but I don’t really care if Colin is a Mason, a Templar or a Mouseketeer. The Molay theory exists because it is one of the only non-authentic explanations (thus far) that has a snowball’s chance in hell of being true. It doesn’t surprise me that Colin is following this angle because he has already chucked out all other possibilities based on the evidence he accepts as valid.\nI also base my belief in the Molay theory on the evidence it’s proponent’s provide. If they happen to greet each other with a secret handshake it doesn’t affect my discernment in the least.\n\n","date":"February 4, 2014 at 11:09 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76498","author":"David Goulet","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"David,\nIf you believe that you meant something opposite to what your metaphor implies. To say that something has a snowball’s chance in hell means that it is impossible. If you are saying that there is even the slightest chance that the de Molay theory is plausible then you have my sympathy but as we say in New York, I have a bridge you might be interested in buying. Don’t worry, it’s between Manhattan and Brooklyn and Chris Christie can’t get his hands on it.\nCB’s  theory is devoid of reality. It has a snowball’s chance in hell which means it has no chance. To debate it is a distraction from really important debates. In my scheme of things, the CB’s de Molay theory is not worthy of a minute of debate. Carbon dating must be dealt with and I guess I am writing a hundred pages or so on it. It’ll take more than the ramblings of an individual who refuses to answer a reasonable question about where he’s coming from before I turn my attention to that claim. It is beneath rebuttal.\n\n","date":"February 4, 2014 at 12:06 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76519","author":"John Klotz","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"“I guess CB, you are afraid to give an honest answer to the question.”\nI’ve spent the last two years giving honest accounts of my thinking re the Shroud, close on 200 postings, and here you are today casting doubt on my honesty.\nI was posting on the details of the Lirey badge and Machy mould long before they received any attention on this site, and it was those that steered me in the direction of the Templar connection. It’s the way research works – one observes closely, taking nothing on trust, then one follows one’s nose and one’s instincts. People like you who try discern hidden motives or question one’s integrity are fortunately few and far between. My policy is to ignore.\nI said goodbye to you once before, following a particularly squalid attempt on your part to pretend you had something on me. I shall say it again, Mr.Klotz. Goodbye – and good riddance. I shall ignore anything that you put to me directly.\n\n","date":"February 4, 2014 at 11:17 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76501","author":"colinsberry","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"PS. Here’s a link to my first posting on the Lirey badge (April 2012). \nhttp://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/\n It was focused mainly on Geoffroi de Charney, proposed uncle of Geoffroi de Charny, the latter being first known owner of the Shroud while at Lirey, with only passing reference to Jacques de Molay. My original suggestion was that it was a depiction of Geoffroi de Charney on the shroud (albeit as a thermal imprint off a metallic template) he having died at the stake the same day in 1314 on that Seine island as Jacques de Molay. Later came the idea that, if only for convenience,  the template may have been a life-size crucifix of Jesus, thus creating the ambiguity right from the word go, with or without a deliberate attempt to deceive the gullible (at least initially). But then things got out of control, once word spread that the Lirey knight and his wife were  in possession of the ‘genuine’ Shroud, “brought back from the Crusades, you know”.\n\n","date":"February 4, 2014 at 11:52 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76517","author":"colinsberry","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"\nJohn Klotz :David,\nIf you believe that you meant something opposite to what your metaphor implies. .\nHell may be a very cold, cold place indeed. Here’s hoping none of us find out what Lucifer calls ‘room temperature’.\nAs for your bridge, I already bought it years ago on an online auction. So it’s not yours to sell. ;)\n\n","date":"February 4, 2014 at 12:26 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76522","author":"David Goulet","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"One also has to question the business savvy of someone writing a book, presumably to sell, who claims there’s no mileage in a Templar/Jacques de Molay explanation. \nMaybe he has never heard of Knight and Lomas, who sold their book (“The Second Messiah”) on the back of precisely that hypothesis. Indeed, I had no sooner unveiled my variant,  April 2012, based on an imprinting off an heated effigy as distinct from the still living de Molay – which I happen to consider the more viable of the two options, the latter involving some quite exotic chemistry –  than the site’s host here made an immediate link with the Knight/Lomas book, even to the extent of displaying the dust cover as decorative accessory.\nhttps://shroudstory.com/2012/04/23/colin-berry-historybod-a-tale-of-two-meanings/\nDan knew about the book. I’m sure a lot more here did as well, so the Templar link had currency long before I stumbled on it in my round-the-houses fashion.\nI don’t know what led those authors to make the initial connection but mine, as I said earlier, was arrived at by a close scrutiny of the Lirey Pilgrim’s badge. finding nothing on the (non-Christ-like) figure depicted there to suggest crucifixion but rather more to suggest burning at the stake. I ALWAYS prefer to work from a secure, or relatively secure basis in fact and detail, than parachute onto a (seemingly) new area from clear blue sky. That’s why uninformed, especially back-biting criticism, is simply water off a duck’s back. .\n\n","date":"February 4, 2014 at 3:42 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76545","author":"colinsberry","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Colin\nI agree with David that your ideas are worthy of consideration.\nHowever I have to disagree with your view that the figure on the badge is non-Christ like. We have to consider the very small scale of the badge, the difficulty in realising features such as the “bearded Christ”, the “side wound  etc. at such a small scale.\nWhat on the badge makes you think of suggestion of burning at the stake? If I recall you might have suggested the squiqgles on the badge near the feet might be flames? I wonder might they represent the blood flows on the feet, being difficult / impossible to convey actually ON the feet on the badge given the smallness of scale?\n\n","date":"February 5, 2014 at 1:18 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76649","author":"Matthias","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"David Goulet,\nWhen I was in grammar school at St. John the Baptist in Syracuse, one bitter winter day the good Sister was upset because one or more members of the school safety patrol (they worked at corners outside and had white “Sam Brown”  belts)  complained that it was too cold to work. She said: “What are they going to do in the freezing cold of Hell, that’s right the freezing cold of Hell.” That was 1949.\nI have to  appreciate the nuns who gave their lives to the Church and wound-up teaching ingrates like me, But when I was active in community organization and politics in the Bronx some years later many of the nuns were already right-on activists. I got one of them in trouble with the Chancery, I was handling New York issues for the Fred Harris in 1975-1976 Presidential Campaign and I asked Sister Pat if she wanted to be a candidate for delegate to the Democratic National Convention. When Mickey Carrol of the NY Times was doing a series of articles on delegate selection, he called her because it thought it would be a good story tracking a select few candidates for delegate and he (a good Irishman) thought sister Pat would be a good story. \nHe asked her how she got to be a delegate and she replied (and he printed in the Times) John klotz called me and asked I wanted to be a candidate.” That was in the morning edition of the Times and by the afternoon the Chancery had ordered her out of the race. (I think the story is in the New York Times circa 1975-1976)\nOh well, we didn’t elect any Harris delegates anyway. And you’re right, Hell can be freezing cold, except maybe we don’t really know what Hell is. I have a direction in which I am heading which is actually not far from some  theologians: The worst pain of hell is knowing that we have eternally separated ourselves from the love which was the primordial cause of our existence. That and/or oblivion. Falling through darkness into a black pit for eternity.\nThat God is love is not exactly an original idea of mine. There was another fellow named John who wrote the same thing about 2000 years ago..\nAnd to bring it home,  the greatest material evidence of God’s love is the Shroud of Turin. The most subversive thing anyone can preach is love. It is preaching it that sealed Christ’s doom. \nNote that I said “material” evidence. There are two meanings to the word (at least) and I mean them both.\n\n","date":"February 6, 2014 at 12:28 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76898","author":"John Klotz","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Dr Ig. CoS.Berry wrote: “finding nothing on the (non-Christ-like) figure depicted there to suggest crucifixion but rather more to suggest burning at the stake”.\nHow can he tell the Lirey Badge man look like either de Molay or de Charny? Does he really know what de Molay or de Charny looks like? The true fact is  Dr Ig. CoS. Berry hasn’t the foggiest notion of what he is talking about! Actually he couldn’t even discriminate between de Molay, de Charny, de Goneville, de Payraud, de  Craon de Verceil, de Safet if ever you would ask him!\nDoes Dr Ig. CoS.Berry has any forensic experience to correctly discriminate between the image left on a cloth by a crucifixion victim and that left by a burning stake victim? None that we all know of as he just a foodie.\nOn the Machy Mould, the Lirey Man is identified with Christ/Jesus. Dr Ig. CoS.Berry\n just care a damn aboiut it and stick to his allegedly “scientific” idea/hypothesis.\nHas Dr Ig. CoS.Berry ever published studies in Templar archaeology and/or iconography Actually, he is almost totally or totally unfamiliar with the subject matter. \nThat’s speak volumes on how reliable his alleged “identification” of de Molay (or de Charny as his NEW alternative) on the Lirey badge is…\n\n","date":"February 4, 2014 at 6:29 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76572","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"The only mileage in a Jacques de Molay theory is the distance from where I  am to the nearest mental hospital.\n\n","date":"February 4, 2014 at 6:42 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76576","author":"John Klotz","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"On the Machy mould the letters IHS is the monogram of Ihesus = “Jesus’.\n\n","date":"February 4, 2014 at 6:44 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76577","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"If it is IHS then it is Jesus, which is no surprise, and it certainly could not refer to Jacques de Molay\n\n","date":"February 4, 2014 at 7:01 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76582","author":"Louis","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Typo (typing too fast): On the Machy mould the three letters IHV (in conjunction with the word SVAIRE) stands for the monogram of IHESV = “Jesus’.\n\n","date":"February 4, 2014 at 7:04 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76583","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Sounds convincing and within the context\n\n","date":"February 4, 2014 at 7:33 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76587","author":"Louis","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Occam again, but I’m still not happy. The Greek Letters IhV.C are not a monogram for Jesus. They transliterate to IEUS, which just isn’t right. IhS or IHS would be normal, but the extra U is odd. Even IESU would do, but not IEUS. Ian Wilson commented that this was poor quality. Perhaps it was so poor it was never used – wrong spelling, coats of arms the wrong way round, a Friday afternoon job by a clumsy apprentice. That makes sense.\n\n","date":"February 4, 2014 at 8:00 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76592","author":"Hugh Farey","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Further comment required, Max, if you are still awake…\n\n","date":"February 4, 2014 at 8:06 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76594","author":"Louis","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"To Louis & Hugh et al, \nThe Gothic trigram IhV does stand for IhESV (when read in conjunction with the word SVAIRE in Gothic script).\nSVAIRE IHV = SVAIRE IhESV, Old French phrase for “Shroud of Jesus”.\nIn conjunction with the coat of arms of Geoffroy de Charny (“de gueules à trois écussons d’argent”),  we can read a  “C” letter in Gothic script. It is the initial letter for C[harny].\nIn conjunction with the broken border-lined (“bordure brisée”) coat of arms of Jeanne de Vergy(-Mirebeau) (“de gueules à trois quintefeuilles d’or”), we can read a “U” letter in Gothic script. It is the initial letter for U[ergy]/Vergy.\nBTW Wison wrote: “ON THE PARIS BADGE we see Geoffroi de Charny’s coat of arms on the left and Jeanne de Vergy’s on the right, while on the Machy badge these positions are reversed.”\nActually Geoffroi de Charny’s  coat of arms is at “dextre” as seen featured ON THE RELIQUARY KEEP featured on the Paris badge. This makes a lot of a difference. It means the RELIQUARY KEEP (that is not to be mistaken either with the empty tomb seen in a roundel of glory topped with a cross of Triumph and the “crown of thorns”/circlet of rushes) was made when Geoffroy of Charny was still alive while the badge in se, most likely dates back to late 14th- early 15th c. CE.\nMax Patrick Hamon, former University Professor of French Language and Civilization (this as a ;-) to Dr IGN. Co.SBerry)\n\n","date":"February 5, 2014 at 7:17 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76710","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"PS: Cryptographically speaking ie in conjunction with the “Shroud of Jesus”, the “V” letter in the trigram IhV (for IhESV) can also be read as a cryptic allusion to the Five Holy Wounds or Five Sacred Wounds. (One more ;-) to Hugh, you know “the guy who can turn into a cryptologist in 15 minutes” while he is totally unable to correctly read U   SVAIRE:IhV   C in Gothic script).\n\n","date":"February 5, 2014 at 7:50 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76713","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Reminder for Dr IGN. Co.SBerry: the Paris badge is 6cm x 4.5cm (max. length & height) and remained nearly half a millenium in the River Seine.\n\n","date":"February 5, 2014 at 8:18 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76719","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"On March 1, 2013 at 9:03 am | #17, I wrote as two additional comments: \n “At the end of their pilgrimage (i.e. once returned home), pilgrims used to throw their pilgrimage badges into a well or a river (from a bridge) and make a wish. Most if not all towns and villages then had such time-honoured tradition spots.\nIn 95% cases, the best way to discriminate between medieval token/mark and pilgrimage badge is the presence or the absence of one or more holes to hang it.”\n\n","date":"February 5, 2014 at 8:45 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76726","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Many thanks, Max. Full speed ahead with your research!\n\n","date":"February 5, 2014 at 8:55 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76728","author":"Louis","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"ditto\n\n","date":"February 5, 2014 at 8:57 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76729","author":"Louis","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Fascinating. As I said before. And I wonder if any of it is true. As I also said before.\nWhat we really need is some kind of evidence, don’t we…\n\n","date":"February 5, 2014 at 10:12 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76737","author":"Hugh Farey","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Hugh you write: \n“Perhaps [the Machy mould] was so poor it was never used – wrong spelling, coats of arms the wrong way round, a Friday afternoon job by a clumsy apprentice. That makes sense.”\nBTW Hugh, can you discriminate between cheap amateurish mental reconstruction, truth, reality, and the real thing? \nWhat is really poor here is your cheap guesswork (what I would called your intellectual laziness for lack of relevant knowledge)..\n\n","date":"February 5, 2014 at 3:06 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76796","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"You may be right, of course.\nOr wrong.\nA little evidence would help.\n\n","date":"February 5, 2014 at 5:33 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76826","author":"Hugh Farey","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Max, as I told you more than once, put your research in a small pdf paper with illustrations and I’m sure Dan will upload it for all to read. I know this takes time but it makes it easier and much more quicker for us to follow your rationale, which can bring a logical sequence, eliminating the need to drive your point in bits and pieces.\n\n","date":"February 5, 2014 at 10:45 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76742","author":"Louis","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Sorry Louis, but I am working on a 80-100 hour weekly basis. I’ve no real time for even writing up a flash illustrative reply…  I am snowed and bogged down with work. I can only allow me a few comments in snatches.\nRe Gothic script and spellings: \nHugh, since you like “googling”, just start a search with the words “Ihesus”/ISH and “Ihesu” + do your homework as far as Gothic epigraphy and palaeography and the shortening of old French words are concerned: the Gothic script Ihesvs can be shortened to IHS and its genetive form Ihesv to IHV.\nRe additional evidence as far as the reliquary keep bearing the de Charny and de Vergy (Mirebeau branch) coats of arms is concerned:  \nIan Wison  totally missed a very subtle detail in the Paris badge:  the two coats of arms are NOT featured on the badge but ON the reliquary keep carved front side featured in the lower half.\nSee 1418  Collégiale relic receipt in Archives départementales de l’Aube, ref. 9G 4)\n“[…] ung drap, ou quel est la figure ou representation du Suaire Nostre Seigneur Jesucrist, lequel est en ung coffre armoyé des armes de Charny\nIn the Paris badge, the reliquary keep carved front side (seen in lower part of the badge) is accurately dated by means of the two coats of arms as the husband’s was placed at the heraldic “dextre” as “place of honour” (ie on the left handside of the modern onlooker) ONLY when both husband & wife were alive. When one of them was dead, the husband’s coat of arm was placed at heraldic “senestre” (this according to a use & custom that prevailed till the 19th c CE in France).\nHugh, here again, you have some heraldic homework to do…\n\n","date":"February 5, 2014 at 6:00 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76832","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Something comprehensible at last, albeit still odd. IHS for the nominative and IHU for the genitive does make sense, and I’ve even found a reference for it – early editions of Chaucer’s “Prioress’s Tale.” LE SUAIRE IESU” then. The Shroud of Jesus. With a spare C at the end.\n\n","date":"February 5, 2014 at 7:17 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76844","author":"Hugh Farey","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Nice Hugh you did some homework at last before passing comments…\n\n","date":"February 6, 2014 at 7:02 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76979","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Re “the spare C”:\nadditional solution: It may be the initial letter too of the craftsman or designer’s Machy mould. In other words “C [me fecit]”/”made by C”.\n\n","date":"February 6, 2014 at 7:34 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76985","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"MPH: “In the Paris badge, the reliquary keep carved front side (seen in lower part of the badge) is accurately dated by means of the two coats of arms as the husband’s was placed at the heraldic “dextre” as “place of honour” (ie on the left handside of the modern onlooker) ONLY when both husband & wife were alive. When one of them was dead, the husband’s coat of arm was placed at heraldic “senestre” (this according to a use & custom that prevailed till the 19th c CE in France).” \nThanks Max, I’ve wondered a lot about that recently, and your note confirms my thoughts that the dextre & senestre placing of the two sets of arms had to be significant. It indicates that the Paris medal would have been issued prior to Sept 1356, which matches up with the D’Arcis allegation of the showing under Bishop Henri. Whereas the Machy medal has to be subsequent to Geoffroi’s death, assuming the craftsman or designer knew their heraldry. My sister, an active artist, spent some years designing coats of arms for various civic corporates, and I managed to pick up just a little of it from her occasional casual remarks.\n\n","date":"February 6, 2014 at 4:14 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76934","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"DWNZ: “the dextre & senestre placing of the two sets of arms had to be significant. It indicates that the Paris medal would have been issued prior to Sept 1356”\nDave, you must be extra careful here when it comes to dating the Paris badge. I just wrote  the set of coat of arms was NOT FEATURED ON THE BADGE IN SE but on the reliquary keep crafted front side that most likely is featured on the Paris badge. It makes a world of a difference in terms of datation. The reliquary keep was made when Geoffroy of Charny was still alive (and thus can be dated around 1350 c. CE) while the badge in se, most likely dates back to late 14th-early 15th c. CE. This is the subtelty Ian Wilson totally missed.\n\n","date":"February 6, 2014 at 7:16 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76980","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Typo: “the reliquary keep CARVED front side”\n\n","date":"February 6, 2014 at 8:53 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76993","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Thanks, Max, I understand and wish you success in your research.\n\n","date":"February 5, 2014 at 6:03 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76833","author":"Louis","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"See, Max, your research is making headway.\n\n","date":"February 5, 2014 at 7:20 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76845","author":"Louis","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Colin’s scorch theory is the most ridiculous absurd thing I have ever heard. And he’s a scientist??  A theory best fit for front cover of World Weekly News!\n\n","date":"February 5, 2014 at 6:11 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76837","author":"don","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"To Hugh, re “his” “spare C”:\nThe true fact is I can see a U letter in Gothic script at the tip of the shield (De U/Vergy-Mirebeau’s) placed at heraldic senestre and  a C letter in Gothic at the tip of the shield (de Charny’s) placed at heraldic dextre…\n\n","date":"February 6, 2014 at 9:00 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76996","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Challenge for CB: \nThe Lirey Shroud man’s head is about 2mm wide and 5mm long. I challenge CB to introduce us to a craftman or designer who, using the same medieval tools and technique, can accurately carved the Turin Shroud man’s/de Molay’s/de Chany face at that smallness of scale not to mention the fact the face features were slightly worn out as the badge spent nearly half a millenium in the river Seine.\n\n","date":"February 6, 2014 at 9:12 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-76999","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"To Hugh, Actually, with my own naked eye and from the illustration above, I can see  GC in Gothic script at the tip of Geoffroi de Charni’s shield…Are they rapeidolia or are they really there? A HD photograph is most needed here.\n\n","date":"February 6, 2014 at 9:20 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-77002","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Hi Max, perhaps this photo would help:","date":"February 6, 2014 at 1:10 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-77046","author":"Mario Latendresse","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Hi Mario, many thanks for the link. It was much helpful.\n\n","date":"February 6, 2014 at 5:01 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-77081","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Couldn’t we read IU too in Gothic script at the tip of Jeanne de Uergy/Vergy(-Mirabeau) shield?\n\n","date":"February 6, 2014 at 9:25 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-77004","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"At third sight, my very first reading is most likely correct: \n“In conjunction with the coat of arms of Geoffroy de Charny (“de gueules à trois écussons d’argent”), we can read a “C” letter in Gothic script. It is the initial letter for C[harny].\nIn conjunction with the broken border-lined (“bordure brisée”) coat of arms of Jeanne de Vergy(-Mirebeau) (“de gueules à trois quintefeuilles d’or”), we can read a “U” letter in Gothic script. It is the initial letter for U[ergy]/Vergy.”\n\n","date":"February 6, 2014 at 9:55 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-77012","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Hugh, you wrote: “still odd”.\nWhat’s odd?\n\n","date":"February 6, 2014 at 10:18 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-77018","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Thanks to Mario link for a HD photo, I finally could read the inscription at the foot of the Machy badge. It is based on a double entendre.Here is the missing piece to the paleaographic puzzle:\nAn  E letter in Gothic script as well can be detected embedded within the U letter. Then It triggers off not only the family name UE[RGY] but the following whole sentence: \nE[ECCE] SVAIRE Ih[ES]V C[RISTI], “here is the Shroud of Jesus Christ”.\n\n","date":"February 6, 2014 at 4:45 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-77078","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"I see nine characters on that HD photo at the bottom. How many do you see and can you identify them for me? And which one has the ‘E’ inside?\n\n","date":"February 6, 2014 at 5:21 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-77085","author":"David Goulet","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"The “dual letter” (an E within a U) at the tip of the de Vergy shield  (on the left) + S+V+A+I+R+E  +I+h+V   + C at the tip of the de Charny shield (on the right). That makes them 10 + a dual letter.\n\n","date":"February 6, 2014 at 5:48 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-77099","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"You have to vertically flipped the photo to read them all.\n\n","date":"February 6, 2014 at 6:10 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-77103","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Typo: E[CCE] SVAIRE Ih[ES]V C[RISTI], “here is the Shroud of Jesus Christ”.\n\n","date":"February 6, 2014 at 5:04 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-77082","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"On Mario’s  site I just read: \n“The inscriptions found on the mold were analyzed by Mark Guscin and Dr. Sarah Blick. The three Greek letters iota (ι), eta (η), and terminal sigma (V) would abreviate the sentence “the Shroud of Christ”. Two more letters, partially erased on the mold, appear below the right and left columns near the coats of arms. Sarah Blick proposes that near the coats of arms of Jeanne de Vergy, it is an E and near the coats of arms of Geoffroy de Charny, it is a C, which could mean “Ecce Crucio” (here is the Crucified).”\nThe reader of this blog will judge for themselves…\n\n","date":"February 6, 2014 at 5:40 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-77095","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"That’s why I encouraged you earlier, Max.\n\n","date":"February 6, 2014 at 5:42 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-77097","author":"Louis","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Louis, thank you again.\n\n","date":"February 6, 2014 at 5:50 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-77100","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"You’re welcome, Max, I knew you were on the right track. You know something? I know you are very hard pressed for time, but do put your studies in pdf when you can and post them on a Shroud website.\n\n","date":"February 6, 2014 at 5:57 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-77101","author":"Louis","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Last but not least correction re the correct reading of the Machy mould inscription:\nOwing to the very presence of the UE dual letter in Gothic script, a triple entendre just cannot be totally ruled out here. The whole inscription then should be read:\nAt 1st reading level (in old French): \n[armes de] UE[RGY-MIREMEAV]   SVAIRE (NS) IH[ES]V  [armes de] C[HARNY] \nAt 2nd reading level (in Latin and in conjunn with the French word SVAIRE):\nE[CCE] SVAIRE (ND) IH[ES]V C[RISTI]\nAt 3rd reading level (in Latin as a cryptic polemical inscription?):\nUE[RGENSIS] SVAIRE (ND) IH[ES]V C[RISTI],\n“The de Vergy Family’s Shroud of our Lord Jesus Christ”.\n\n","date":"February 7, 2014 at 6:29 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-77211","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Typo: UE[RGENSI] SVAIRE (ND) IH[ES]V C[RISTI]\n\n","date":"February 7, 2014 at 6:37 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-77214","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Additional typo (sorry): [armes de] UE[RGY-MIREBEAV] SVAIRE (NS) IH[ES]V [armes de] C[HARNY]\n\n","date":"February 7, 2014 at 7:16 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-77225","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"End note: in the last reading, UE[RGENSI] wordplays in Latin with URGENS…\n\n","date":"February 7, 2014 at 6:44 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-77216","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"I just read the link “alain hourseau Holy Shroud livret internet  English”. Here is the passage about the “unmistakable” difference [with my own comments inserted] \n“There are some important differences.\nFirst of all, in the middle, the face of the stylised Christ-figure is shown with his eyes\nopen. The mould bears the inscription under the face: «SUAIRE:IHV» to designate the\nshroud.\nFor Ian Wilson [Wilson or Guscin?] the three letters are clearly [sic!] Greek: I (iota) H(eta) and S (sigma) [false they are Latin and/or French!] an abbreviation for the phrase ‘the shroud of Christ’, [false, it shall read SUAIRE JHESU, Shroud of Jesus!] genitive case.\nTwo other letters, half-visible, appear on either side of the coats of arms, under the pillars.\nSarah Blick has suggested that they could well be an E [false it is a U in Gothic script with E embedded within] and a C which could mean ‘Ecce Crucio’, ie ‘Behold, the crucified’ [false when read in conjunction with the sets of coats of arms!]\n.\nAn Italian specialist, Andrea Nicolotti, has proposed that the locution “ Ecce suaire Jesu\nChristi” ou “Here is the shroud of our Lord Jesus Christ” [Nicoletti totally missed the U in Gothic script with E embedded within and the “h” in Gothic script in JHV!]\nThe coats of arms are inversed. It is quite possible that the arms on the right belong to the most important person. On the Lirey mould, Geoffroy de Charny’s is on the right and\nhe would still have been alive. On the Cluny badge he is presumably dead because the coat of arms of Jeanne de Vergy is on the right….But this theory does not necessarily apply” [Actually this is the reverse as Hourseau totally missed the heraldic dextre and senestre!].\n\n","date":"February 11, 2014 at 2:22 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-78370","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"\nMax Patrick Hamon :\nAn Italian specialist, Andrea Nicolotti, has proposed that the locution “ Ecce suaire Jesu\nChristi” ou “Here is the shroud of our Lord Jesus Christ” [Nicoletti totally missed the U in Gothic script with E embedded within and the “h” in Gothic script in JHV!]\n\nAs I said in another thread, I do not see any U.\nSo, I remain with the “ecce suaire Iesu Christi” that I proposed in january 2013. But it is a suggestion. Your suggestion “vergy” and “Charny” could be interesting, if the V or U could be seen.\n\n","date":"February 12, 2014 at 8:59 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-78839","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Nice to hear it!\n\n","date":"February 12, 2014 at 9:29 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-78848","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"I repost here what I posted on another threa in reply to Nicolotti:\nMr Nicoletti, do notice the Old French wordplay ‘MIREBEAV SVAIRE (NS) JhESV CRIST. (if you can read Old French).\n1/Mr Nicoletti you wrote: “Iesu is not a translation, is a transcription. “Iesu” is not Italian. You are a bit confused.”\nMethinks the whole irony of my phrase “translation… in Italian” was completly lost on you as you take it first degree! It was a short comment “tongue in cheek”!\nBesides methinks YOU are totally confused as you seem to totally ignore the word “Iesu” is Old Italian for “Gesù”! (Just ask Michela de Iesu!)\n2/You wrote: “[You are] familiar with [CARVED Gothic script] and [you] do not see the U.” If you just cannot see, you just cannot be familiar with it! Re French Gothic inscriptions carved out in stones, could you refer me to any paleographic studies/research papers of yours, please?\n3/ Re my full transciption :\nE[CCE] SVAIRE (ND) IH[ES]V C[RISTI], you also wrote:\n“ND? Why? Is not necessary. And here you missed the H in Christi ”\n(ND) (between brackets) is here to render the sign “:” in SVAIRE:IhV. You totally missed it!\nAs for me I did not miss any “H” in CRISTI. Do you really know medieval Latin spelling! I very much doubt it as you are totally confused here! In medieval Latin IhESU CRISTI is current!\n4/ And finally you totally missed the possible innuendo implied here in UE[RGENSI] SVAIRE (ND) IH[ES]V C[RISTI],\n“The de Vergy Family’s Shroud of our Lord Jesus Christ”!\nWhat “an Italian specialist” we have here!\nMr Nicoletti have you ever heard of the colon (:) used in contractions in Gothic script? Here it occurs in SVAIRE:IhV and shall be read as the contraction for NOSTER DOMINVS (in Latin) and NOSTRE SEIGNEUR (in Old French). Could you do your homework before passing comments?\nBTW Mr Nicolotti,\nRe the Lirey-Machy mould inscription:\n1/Had you known Old French, you should have started with Old French NOT Latin. The word SVAIRE here is in Old French not in Latin!\nHence you totally missed the most obvious here, namely an inscription in Old French to read in conjunction with a set of coats of arms.\n[armes de] UE[RGY-MIREBEAV] SVAIRE (NS) IH[ES]V [armes de] C[HARNY]\n2/Had you known French heraldics, you could have noticed the Old French wordplay in conjunction with the word SVAIRE:\nMIREBEAV (Mirebeau) > MIRE BEAV (Mire beau) > Mire beau Suaire Jesu)\n3/ Had you known Latin letter medieval symbolology, you could have known the Latin letter V for U can read as a cryptic reference here to:\na) Jesus as (semper) VICTOR or Sol Invictus\nb) His five (V) Sacred Wounds.\n\n","date":"February 13, 2014 at 10:07 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-79007","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Excellent Mr. Max Patrick Haman, I’ll asap answer to your posts. No, I have not published any article about “carved Gothic script”, but I will read all articles you wrote about it. I wait for the references.\nAnd also I wait for examples where the colon “:”  is a contraction for NOSTER DOMINVS.\nAll these references, Mr. Hemon, could be useful for my “homework”, as you call it\nThank you.\nYour Italian “not-specialist”.\n\n","date":"February 16, 2014 at 9:17 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-79901","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Mr Nicolletto-Nicollotti, so you finally admit you are not familiar at all with Gothic script carved out in stone after asserting twice you were!\nHere is the reference for a published paper of mine about deciphering gothic script carved out in stone: Actes du 4ème coloque sur les grraffiti anciens, ed. ASPAG et Conseil Régional d’Indre, 2010.\n\n","date":"March 15, 2014 at 7:53 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-89174","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Typo (writing in haste): Colloque\n\n","date":"March 15, 2014 at 7:54 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-89175","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Typo: Nicullotti\n\n","date":"March 15, 2014 at 8:03 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-89178","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Mr. Nicullotti, BTW, the colon “:” as contraction mark is  well known of GENUINE medieval epigraphists.\n\n","date":"March 15, 2014 at 8:16 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-89181","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"In SVAIRE:IhESV, the colon, as contrtaction mark, implicitly refers to NOSTRE SEIGNEUR here since the inscription in Olf French. So simple and obvious you just missed it!\n\n","date":"March 15, 2014 at 8:20 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-89182","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Typo: since the inscription is in Old French\n\n","date":"March 15, 2014 at 8:21 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-89185","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Mr Niculooti the Italian specialist, at first reading level, how you could have missed the inscription was in Old French not in Latin is just beyond me!\n\n","date":"March 15, 2014 at 8:44 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-89192","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Methinks, I am typing too fast and make typos and you are thinking “too fast” and make gross misreading.\n\n","date":"March 15, 2014 at 8:51 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-89194","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"BTW my paper is in French, see Loches, Graffiti anciens, “QUATRIEME RENCONTRE” 2006 (Proceedings of the 4th National Symposium of Glyptography, 2006 Loches). It was published in December 2010.\nYou can order the book to the Musée Serge Ramond “La mémoire des murs”, Place de Piegaro, 60550 Verneuil-en-Halatte France – Telephone :(00 33) 03 44 24 54 81.\nNote: in 2012 I rewrote, revised and completed my paper to insert it in a collection of my 2004-2007 studies of the Coudray Tower enigmatic graffiti (Templar Glyptography). Hopefully the collection is to be published in December 2014…\n\n","date":"March 15, 2014 at 9:39 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-89205","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Two Lirey Badges: Unmistakable Differences","post":"Mr, Hamon,\nI cannot find your article because the publication “Loches, Graffiti anciens, “QUATRIEME RENCONTRE 2006” is practically impossible to find. And it is not exactly the kind of publication I had imagined.\nNo problem. It is not important. I still wait for:\n1) an example of the “dual letter” (an E within a U) .\n2) the colon “:” as a contraction for NOSTER DOMINVS.\nThanks\n\n","date":"March 29, 2014 at 8:43 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","id":"comment-94739","author":"Andrea Nicolotti","site":"shroudstory"}]
