[{"title":"Three New Shroud of Turin Websites to Watch","post":"I made it!!!! I made it!!! I made Colin Berry’s “stuff” list. I am sooooo honored.\n\n","date":"March 22, 2013 at 9:55 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28055","author":"John Klotz","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"I was surprised I was thought of so highly (or lowly, depending on perspective).\n\n","date":"March 23, 2013 at 10:45 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28164","author":"Andy Weiss","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"What, no allusions to intimate anatomy today Mr Klotz? Has the site’s host asked you to tone down your line in personal insults? (Nope, didn’t think so).\nAs for embracing laser beams, monkey to the ENSA organ grinder, you may well regret the decision to hitch yourself to a falling star. Reminder: laser beams were entirely a man-made creation, taking no cues from the natural world. It requires very special hardware, with precise geometry to generate energetic coherent light, capable of scorching linen (impinting a life-size image of a man adds another order of magnitude of difficulty, never mind input energy). Odd don’t you think that agenda-driven pseudoscientists such as Paolo Di Lazzaro have to fall back on a 20th century box of tricks to make their fantasies appear half-credible, or in your case the kind of fraction that is best converted to a decimal, with lots of noughts after the decimal point.\n\n","date":"March 22, 2013 at 11:55 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28063","author":"colinsberry","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Colin, I think this new website of yours represents the final element that the RS was needing to make its mind up and adopt a decision regarding your request.\n\n","date":"March 22, 2013 at 1:52 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28069","author":"Gabriel","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Gabriel,\nI read your post with as a deeply ironic comment.\n\n","date":"March 22, 2013 at 2:14 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28075","author":"JOHN kLOTZ","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Science v pseudoscience is not a simplistic  ‘us-versus-them’ thing. It is about previously respectable scientists moving over to the dark side. It’s about the nature of creativity, of hypotheses properly tested or immediately peddled as gospel truth. \nWhite chalk on a black background seems appropriate for conveying the idea of a light versus dark side.\n\n","date":"March 24, 2013 at 3:02 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28281","author":"colinsberry","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"CB\nObviously, you don’t know what “stuff” is a euphemism for.\nMore to the point, I am asking questions and making what I believe to be informed speculations. The book of knowledge is not closed. You are one of those skeptics who refuse to recognize that some things are beyond the present grasp of the scientific process  as narrowly defined by  skeptics. That’s  changing. When you learn to respect those who disagree with you then you may find that you will in turn garner respect.\nWhat puts you beyond the pall in my view is your demeaning the credentials of scientists like John Heller and Al Adler. These men were giants in their field. Heller wrote books – only one about the Shroud and that was in a nature of a memoir as well as a description of the 1978 STURP investigation.   I ask again: have you read it?\nIn my humble opinion, when you attack the professional standing of the STURP team, you are a mouse snarling at lions.\n\n","date":"March 22, 2013 at 2:12 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28074","author":"JOHN kLOTZ","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Many scientists, competent or highly professional in their own fields, have gone off at a tangent and  damaged their reputation by claiming to be instant experts in new areas outside their expertise. An example was Nobel Laureate Linus Pauling when he claimed that vitamin C deficiency was a major cause of human diisease.\nI debate the specifics of the scientific nitty gritty – and I know that Adler certainly – an organiic chemist who specialized in porphyrin synthesis – was not the “blood expert” that some claimed him to be. Six years before he published his ridiculous hunches re bilirubin as though fact,  I was publishing my results of the photoconversions of bilirubin under visible white light – at one of your ivy league universities. Nope, I don’t claim to be a giant of a scientist – but I was the first to propose photoisomerism as the crucial step – and if Adler had approached me re his bilirubin hypothesis, I’d have told him to read a few papers on the chemistry of that substance, and why it is highly improbable it would form an binary adduct with methaemoglobin, due to intramolecular hydrogen bonding, and why bilrubin could never confer everlasting stability to a second substance (the permanent red colour of Shroud blood) due to its instability to light and oxygen. \nAs I  say, I’m only here for the science. I host a site (sciencebuzz) that has addressed a wide range of topics that have captured  public interest or imagination, but often where mis- or disinformation is rife. It is the latter in ‘Shroudology’ that’s convinced me that close scrutiny by the planet’s most highly regarded scientists, starting with my own country’s elite scientific society,  is long overdue, especially due to the people I have singled out, and because of the scurrilous attacks on the integrity of the radiocarbon labs. (“Night of the Shroud” etc).  The pseudoscience, to which Adler and Heller contributed mightily, with untested hypotheses posturing as fact, with pseudoscience dressed up with all the trappings of science, has gone on for far too long… This site stands as a monument to 30 years of misinformation – and worse,\n\n","date":"March 22, 2013 at 4:06 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28085","author":"colinsberry","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"The true fact is pseudoscience, pseudoarchaeology and pseudoexegesis work both sides: both on the arch-miraculists’ and arch-fraudilists’ whence the research dead-end..\n\n","date":"March 22, 2013 at 2:01 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28071","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Typo: archfraudulists’\n\n","date":"March 22, 2013 at 2:03 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28072","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Can you get colored chalk for drawing on the sidewalk, you know, for in front of the Royal Society headquarters, something to get their attention?\n\n","date":"March 22, 2013 at 2:32 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28076","author":"Paulette","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Colin,\nYou wrote: ” Nope, I don’t claim to be a giant of a scientist – but I was the first to propose photoisomerism as the crucial step – and if Adler had approached me re his bilirubin hypothesis, I’d have told him to read a few papers on the chemistry of that substance, and why it is highly improbable it would form an binary adduct with methaemoglobin, due to intramolecular hydrogen bonding, and why bilrubin could never confer everlasting stability to a second substance (the permanent red colour of Shroud blood) due to its instability to light and oxygen.”\nWould you please be kind enough to give me/us the references of the “few papers on the chemistry” of bilirubin ?\n\n","date":"March 22, 2013 at 4:25 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28087","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Thibault! Good to hear from you again. I appealed to you here a while ago, as I have my own problem with bilirubin. Nothing to do with its stability, but how does it make carmine? I’ve been mixing brown and orange paint (methemoglobin and bilirubin), but they just don’t make red. Can you help?\n\n","date":"March 22, 2013 at 4:59 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28089","author":"Hugh Farey","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Dear Hugh,\nThere are 2 different problems:\n1) Are Heller’s and Adlers’ tests reliable regarding Bilirubin. I am waiting for CB’s answer to my previous post.\n(I just received CB’s answer. More later)\n2) The red carmine color of the blood on the TS.\nFor the moment these 2 questions have to be studied separately.\nRemember that there are other possibilities regarding the red color of the blood.\nThibault.\n\n","date":"March 22, 2013 at 5:24 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28104","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"If TH cares to enter bilirubin into his favourite search engine, along with any of the following surnames, he will quickly see that there was a thriiving interest and literature on that bile pigment in the 70s-  long before Adler and Heller began floating their uninformed  ‘off-the-wall’ ideas, now quoted on this site as if brought down from the mountain on tablets of stone.\nTry these for starters: .McDonagh, Lightner,  Bonnet, Schmidt, Billing, Cole, Lathe, Stoll, Heirwegh, Blankaert, Ostrow, Odell. and quite a few others, most of whom I either met, collaborated or worked with.\n Will that do, sir?\n\n","date":"March 22, 2013 at 5:12 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28094","author":"colinsberry","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Yes Sir,\nI’ll try to find the papers on Google Scholars.\nComments later.\nMeanwhile, would you please SUMMARIZE here why, in your opinion, Adler’s findings re the presence of Bilirubin in the blood are not reliable (I am not speaking about the red color of the blood) ?\n\n","date":"March 22, 2013 at 5:39 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28105","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Postscript: here’s a link to a paper I co-authored on bilirubin and novel derivatives thereof in 1972\nhttp://www.sciencedirect.com/science/article/pii/0006291X72906171\nNote the use of chromatography and mass spectroscopy to (cautiously) assign tentative chemical structures.\nNow here’s a challenge for TH. Show me a single reference to Adler or Heller ever having used any kind of chromatographic technique to separate claimed “bilirubin” from Shroud blood, or mass spectroscopy to confirm its identity?\nHere’s another question: what firm conclusions could either of them have drawn simply from doing colour-change spot tests with Ehrich’s or other diazo reagents, or from fluorescence under uv light? Remember that centuries-old blood does/did not behave like modern blood, requiring an aggressive reagent (hydrazine) simply to get it into solution.\nAdler, a porphyrin specialist, did not even investigate the atypical porphyrin spectrum of Shroud blood using structure-identifying techniques then available, notably mass spectrometry. He straight away dreamed up a complex with bilirubin, claiming “extraordinary” levels of the latter, despite its instability to light and oxygen (exploited in the phototherapy of neonatal jaundice, my first postgraduate, research project), Has TH ever seen a figure for that billrubin?  It’s certainly not in his ‘Orphaned Manuscript’ account hat concluded with his remark that he had stumbled across something that had been wholly unpredictable when he set out to investigate Shroud blood. Shame he didn’t use the tools of the trade, so to speak, which I and others in a related tetrapyrrole field regarded as essential.\nHard data is a scarce commodity in Shroud science – the lack of which has permitted far too many agenda-driven individuals to build their houses of cards that end with science morphing into theology. Science is science. Try merging it with anything else, forcing it to conform with the latter, and it ceases to be science. It becomes pseudoscience. \nMy remit as a blogger is simple- I am against pseudoscience in any shape of form – wherever it shows its face in the media. Sir Paul Nurse, the President of my country’s  Royal Society urged scientists not so long ago to speak out against pseudoscience. I didn’t need to be told. I have been doing that for several years – on matters as far apart as fad diets and climate change. The Shroud is just one of many instances – but disturbing in the way that pseudoscience is increasingly being used to debunk and defame real science and to demonise those who are considered off-message. One has only to see the scatological comments appearing right now  – ones that the site host allows  – while in the same breath  claiming he wants his site to be seen as sceptic-friendly.\n Cue schoolmasterly lecture, claiming that the serious charge of disseminating pseudoscience is ‘ad hom’. It isn’t, and in any case, it is unreasonable to expect a sceptic to be scrupuloulsly polite to anyone perceived as systematically peddling pseudoscience, especially those who make no secret of having a theological agenda. I repeat: science is science. There is no such thing as theoscience.\n\n","date":"March 23, 2013 at 4:34 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28150","author":"colinsberry","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"The purpose of a site such as this should surely be to SUMMARISE what others are saying elsewhere.  Since when has there been an obligation for bloggers to be required to provide short summaries on request or demand, having to compress what they may have argued closely and at length, just so the Thibaults of this world can post their knocking PDF’s here (top right) with no facility for leaving a comment?  On yer bike (or Mobylette)…\n\n","date":"March 22, 2013 at 6:32 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28108","author":"colinsberry","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"BILIRUBIN\nYes, if you want to discuss about Bilirubin, you have to summarize your thoughts.\nI think that Adlers’s tests are reliable.\nYou think that they are not. Why ?\nThe problem is the method.\nThere is no way to have a fruitful discussion without a short summarize of your critics of Adler’s (peer reviewed) papers.\nThibault.\n\n","date":"March 23, 2013 at 5:12 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28203","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"I am not just a “critic”, TH. I am a retired scientist/science blogger with well over 150 postings on the TS alone in the last 14 months, quite a number of which have been devoted to the details of Adler’s work.  Have you read them?  If not, then why not?  In any case, while I hesitate to say it, I do not regard this forum as a fit place to discuss the finer technical details, given the hostility that exists here towards sceptics, and the kind of language and backbiting that is permitted here. \n I also consider that your attack on the scorch hypothesis (viz.your pdf) was not just badly conceived, in view of the unsuitability of the template, but the lofty manner of its presentation too, with your total ignoring of my work with bas-relief templates, the 3D imaging, the evidence for superficiality etc .Why say to the site’s host that you want me especially to look at your work, when you cannot even bring yourself to acknowledge my existence within those many pages, far less my original researches? Why do you imagine that simple light microscopy allows you to reject scorching when comparing a newly acquired scorch from your crude template with one that is centuries old and been subject to much handling and several insults? The final, totally uncompromising conclusion of yours betrays a degree of pomposity the like of which I have rarely seen in any research  monograph\n   Until you are willing to get down off that high horse of yours, and cease making your insistent demands for this or for that, then you are right – there can and will be no ‘fruitful discussion’. There is blogging etiquette and there is scientific etiquette, and I have to say you have failed to impress so far on either of those counts.\nThat is my final word to you on this site. You know where I can be found if it’s real science you wish to discuss, divorced from irrelevant side issues.\n\n","date":"March 23, 2013 at 5:54 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28207","author":"colinsberry","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Quote from Thibault : “You think that they are not. Why ?”\nWhy do you think my friend Thibault ???  Simply because Colin DON’T WANT THE BLOOD ON THE SHROUD TO BE GENUINE BLOOD FROM A TORTURED PERSON because he knows that if that’s the case, then his own little hypothesis for image formation would have to be thrown to the garbage!!!  \nWhat else can that be ?  Remember my paper about the evidence of the bloodstains ?  Remember the heart of my paper ?  The SCIENTIFICALLY PROVEN FACT that the blood on the Shroud is real blood from a real tortured corpse is a huge problem for any skeptic who wants to make believe the Shroud’s body image was hand made by some forger, especially when you think that these bloodstains could not have been artificially droped on the cloth but have to come from real direct contacts between humid blood clots and the cloth.\nIn my mind, the fact that the blood on the Shroud and also the image come from a close interraction between a dead and tortured corpse and the surface of the cloth strongly indicate that one forgery scenario can still be consider as a possibility to explain the Shroud, which is to think that a forger would have used a real scourge and crucified corpse in order to produce a false relic of Jesus’ Passion.  THERE IS NO OTHER PLAUSIBLE FORGERY SCENARIO THAN THIS ONE.\nColin knows it and that’s why he will do anything he can to deny the FACT that there is real blood on the Shroud and that this blood show the characteristics of exudates of humid blood clots that were formed on the skin of someone who endured a long period of torture.  People should note that on the question of the blood on the Shroud, McCrone reacted exactly like Colin by denying completely the SCIENTIFIC EVIDENCE !\nWhy do you think ? Exactly for the same reason that Colin !  Because he knew that such an evidence was highly problematic for his forgery hypothesis and was a strong indicator that the Shroud is a genuine burial shroud of a real crucified man who endured the very same tortures than Jesus of Nazareth…  Thibault, you don’t have to search elsewhere to understand why Colin always deny the blood evidence concerning the Shroud.\n\n","date":"March 23, 2013 at 8:40 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28229","author":"Yannick Clément","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"CB: “I am not just a “critic”, TH. I am a retired scientist/science blogger with well over 150 postings on the TS alone in the last 14 months, quite a number of which have been devoted to the details of Adler’s work. Have you read them?\nTH: Yes I did.\nCB: ” I also consider that your attack on the scorch hypothesis (viz.your pdf) was not just badly conceived, in view of the unsuitability of the template, but the lofty manner of its presentation too, with your total ignoring of my work with bas-relief templates, the 3D imaging, the evidence for superficiality etc .Why say to the site’s host that you want me especially to look at your work, when you cannot even bring yourself to acknowledge my existence within those many pages, far less my original researches? ”\nTH: Wonderful ! I/we now understand the true reason of your behavior: I did not even quote you in my “paper” !\nMea Culpa, mea maxima culpa !!!\nYou obviously did not understand the aim of my paper. \nCB: ”  Until you are willing to get down off that high horse of yours, and cease making your insistent demands for this or for that, then you are right – there can and will be no ‘fruitful discussion’. There is blogging etiquette and there is scientific etiquette, and I have to say you have failed to impress so far on either of those counts.”\nTH: “blogging etiquette” and “high horse”: Are you are describing your own behavior.?\n“Scientific etiquette”: any true scientist should be able to summarize his thoughts so that others can discuss them.\nBut don’t worry: I am preparing a new paper regarding your own experiments and statements, i.e scorch, 3D, blood, bilirubin, Adler’s work etc.\nThibault.\n\n","date":"March 24, 2013 at 3:42 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28284","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"The problem with some scientists is they think they are so above others and use their puny little minds to malign others.  It’s these people for whom I have no appreciation.  That’s in direct contrast to the STURP team where there were more than 30 scientists all working together as a team, laying aside their egos for a time.  If scientists bear with those who do not have the specialized knowledge they have can really add to everyone’s appreciation for the areas of their own specialties.  It’s then they are appreciated.  Guess that’s not for everyone.\n\n","date":"March 23, 2013 at 10:56 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28165","author":"Andy Weiss","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"\nAndy Weiss :\nThe problem with some scientists is they think they are so above others and use their puny little minds to malign others.\n\nSo-called scientists.\n\n","date":"March 23, 2013 at 1:41 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28182","author":"anoxie","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"CB writes:  “It is the latter in ‘Shroudology’ that’s convinced me that close scrutiny by the planet’s most highly regarded scientists, starting with my own country’s elite scientific society, is long overdue, especially due to the people I have singled out, and because of the scurrilous attacks on the integrity of the radiocarbon labs. (“Night of the Shroud” etc).”\nTo characterize “Night of the Shroud” as attacking only the credibility of the radiocarbon labs” is a mischaracterization.  The strange behaviors of Church officials are also criticized.\nI defy anyone to read Emanuela Marinelli’s paper (http://tinyurl.com/cammkgx)delivered at the Valencia Congress in 2012 and to say that the 1988 C-14 testing was unimpeachable.\n\n","date":"March 23, 2013 at 7:33 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28220","author":"Joe Marino","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Planet Earth calling Yannick Clément:\nLook at the epsilon and other stains. Look at their colour and intensity relative to body image. Look in close-up at the way the densest pigment is congregated along the ribs of the weave. \nDo they look like Adler’s wishy-washy “serum exudates” to you (even if that conjectural serum had acquired some haem from leaking erythrocytes in Adler’s “retracted blood clots”? Or do they look like something much closer to whole blood? \nI know what I think, using the evidence of my own eyes. \nAdvice to Yannick: you too should start using your own eyes – and cease endlessly  parroting those fallible individuals whom you unwisely hero worship from morning till night.\n\n","date":"March 24, 2013 at 2:41 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28245","author":"colinsberry","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Being not a medical or a blood expert, I prefer by far to rely on the expertise of Pierre Barbet, who, in the 30s, already claimed that the bloodstains on the Shroud were caused by exudates of humid blood clots and that they were probably surrounded by halos of clear serum (which is a strong indicator of that particular type of blood transfer by the way) and also to rely on the FACT that such an hypothesis was later SCIENTIFICALLY CONFIRMED by 2 INDEPENDENT experts, namely Al Adler and Pier-Luigi Baima-Bollone, who worked with DIFFERENT samples !  I don’t have nothing else to say for my defense my friend !  If you don’t want to trust the judgement of these experts, what can I do about it???  \nBut if one day you end up believing in such a strong conclusion, I’m sure you won’t have any other choice than put your scorching hypothesis in the garbage, because that would mean the Shroud cannot be anything else than a real burial cloth of a real crucified man and instead of being one kind or another of an artistic forgery.  I wish you will finally “see the light of scientific truth” one day instead of keep on denying the scientifically confirmed evidences, which makes you look in the end like a mad man who see conspiracies everywhere.  \nAnd if it makes you feel better, let me remind you that the FACT that the Shroud is a real burial shroud of a real crucified man doesn’t necessarily lead to the conclusion that this is truly the authentic burial cloth of Jesus or that it can prove his Resurrection or something like that…\n\n","date":"March 24, 2013 at 6:01 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28287","author":"Yannick Clément","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"“If you don’t want to trust the judgement of these experts, what can I do about it??? ”\nSorry, but with those few words you show that you simply don’t have the first clue about science,  Yannick.\nFleischmann and Pons were both considered experts before publishing their (non-reproducible) papers on cold fusion. \nOne can be an expert in interpreting existing knowledge, but be totally hopeless at contributing new science.  Scholarship and original science are NOT necessarily one and the same thing.\nMy advice to you is to stick to what you are good at – library and internet research.  \nScientific research requires unique and specialist skills that are not easily acquired  – not without long training in the school of hard knocks. – like seeing whether one’s hypotheses ultimately prove fruitful – or , as likely as not, go onto that great heap of beautiful ideas that were destroyed by one ugly fact. \nPseudoscience can be about publishing before having properly tested – either because the idea looks too beautiful to be wrong, or one is pursuing an agenda, whether aware of it or not.\n\n","date":"March 24, 2013 at 6:42 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28291","author":"colinsberry","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"What speak very loud to me Colin is the fact that Barbet, well before the STURP direct investigation of 78, was already claiming that the bloodstains on the Shroud were caused by exudates of blood clots (i.e. not composed of complete blood) and was also already claiming that there was probably halos of clear serum around each stains, which were both independtly confirmed after the investigation of 78.  In sum, the STURP investigation “only” confirmed the ideas described by Barbet during the 1930s.  Note that, for Barbet, who saw the Shroud outside the Basilica of St John the Baptist (in sunlight) during the 1933 exhibition, these stains could not have been caused by anything else…  After this public showing of the Shroud, that was an evidence for him and, guess what, his profesionnal impression was later confirmed by 2 independent experts in the US and in Italy.  Why putting such a strong result into question Colin?\n\n","date":"March 24, 2013 at 7:03 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28293","author":"Yannick Clément","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"TH: I am not a poster of pdf monographs. I am a blogger who reports his thoughts and researches as they come. My blog describes a journey – one in which I  have attempted to make sense, day by day, week by week, of what has been described as the most studied artefact in history. Blog postings invite comments. Pdf monographs do not…\nSo will you, haughty Dr. Monographer, kindly desist from pursuing me from pillar to post,?  (Or should that be post to pillory?)  If you have objections to specific points, then state them here – as comments – or on my own site if highly technical.\nI re-read that monograph of yours today.  You need to distinguish between scientific principle and technical detail. You need to consider heat convection as well as conduction (it being one of the three mechanisms of heat transfer). You then need to consider how technical detail might produce a variety of different outcomes, with no breach of scientific principle. Factors like cloth on top v cloth underneath template, presence or absence of underlay, dry or damp, contact time and pressure  might alter the nature and subtlety of the image.\nAt least we are agreed one one thing – the slightest air gap results in no image – at least with brief contact. So why are you making the contact/conduction model your primary target? It’s the  radiation models with those  agenda-driven ‘miraculous flashes of light’ that should be addressed in the first instance,. That’s  assuming you wish to be taken seriously as an objective scientist. Or maybe you too have a soft spot for the agenda driving all  those radiation models? If so, then dream on – but kindly don’t waste your time and mine with those pretentious self-serving monographs that invite no comments or criticism…\n\n","date":"March 24, 2013 at 6:01 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28288","author":"colinsberry","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Here’s what Colin and Thibault should address in priority concerning the scorch hypothesis :  “If the image was a scorch or any part of the Shroud had been heated enough to make significant changes in the rates of decomposition of any of its components, we would see changes in the structure of the flax fibers and blood. The blood still evolves hydroxyproline on mild heating, and the cellulose crystals are largely undistorted. The image is not a scorch. The cloth was not heated, not even boiled in oil.”  This is a quote found in the paper “Shroud of Turin FAQ” written by Ray Rogers in 2004 and which I have put in my recent paper entitled “Raymond N. Rogers’ observations and conclusions\nconcerning the body image that is visible on the Shroud of Turin”.\nI think that observation reported by Rogers says it all about the FACT that the Shroud’s image is not a scorch, especially regarding the FACT that the blood on the cloth never was affected or transformed by an intense heating, even though the blood was present on the cloth before the image (note that this is another important FACT which clearly indicate that the Shroud is a genuine burial cloth of a real crucified man).\n\n","date":"March 24, 2013 at 6:47 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28292","author":"Yannick Clément","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Again, you are quoting the findings of your favourite Shroud expert – but I doubt if you had heard of that chemical kineticist working on explosives before his being recruited to STURP.\nYes, he was a gifted chemist, and using his pyrolysis mass spectrometry was able to detect  that hydroxyproline you mention in blood. But as I have said previously, he straightaway assumed it was a marker for human blood, and that it could be used to differentiate between heated and unheated blood (let’s not go into detail on that). Shame then that he did not consult with biochemists and haematologists. Had he done so, he would have learned that one expects only the tiniest trace of hydroxyproline in blood, it being a marker for connective tissue, notably collagen.The presence of connective tissue is evidence that Shroud “blood” is not simply blood. I would not expect you to know that, but by the same token you should not expect this retired biochemist to be rendered speechless by your reciting the claims of an explosives chemist who frankly was way out of his depth – to say nothing of field of expertise – when dealing with centuries old stains that may or may not be authentic blood. Even a virtuoso physical/organic chemist can only do so much when confronted with aged degraded biological material…\nBlood first? Maybe, maybe not, but the jury should still be out on that one, given the paucity of rock solid evidence….\nPersonally I think the “blood” came from a leech (the latter providing connective tissue and hydroxyproline) and that the image preceded blood. Both those ideas as testable in principle – so are scientific- even if new methodology needs to be developed. Cue hollow laughter when one read not so long ago a claim from the Vatican that Shroud authenticity was not falsifiable. Oh yes it is – like showing that the blood came after the image, and/or is loaded with leech connective tissue and specific immune markers.\n\n","date":"March 24, 2013 at 7:23 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28294","author":"colinsberry","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Colin, I understand your point of view (“a journey”). But the fact is that is is very difficult for me (and probably for others) to have a general view of the scorch hypothesis (for example) on your blog where your successive ideas are scattered in so many posts.\nSome thoughts in haste: \n– heat transfer: I agree that heat transfer through radiation can be ruled out. The only kind of  heat transfer in scorch experiments, I (and you if I understand well) found is conduction. This explains all my observations. The very low diffusion of heat in linen is the key parameter and it does not depend on the other parameters. Now you have a problem and you have to introduce convection. Did you see in your own experiments any kind of indication of convection? In my opinion, convection is a perfect example of theoretical ad-hoc hypothesis without any experimental basis.\n– Blood/ blood exudates:   please, remember that the optical characteristics of hemoglobin are so that even a very low quantity of hemoglobin gives a red color. In other words, the fact that the blood stains  look like whole blood do not exclude the possibility that they are in fact blood exudates. \nThibault.\n\n","date":"March 25, 2013 at 4:45 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28360","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Linen has some 8% of moisture  that would need to be vaporised before scorching could occur. That moisture will be turned to steam by the hot template – superheated steam. There will be additional steam and other gases/vapours from the pyrolysis of carbohydrates. Two points: firstly the transfer of heat by gases (or liquids) as distinct from immobile solids is convection, so there will always be a convection component when pressing hot metal into linen, in addition to conduction. Second – the conductive properties of cellulose become somewhat academic given the passage of superheated steam at high speed through the weave to the reverse side of the cloth. One has only to use a damp underlay to see how much heat is rapidly transmitted to that underlay, which can be seen and felt in the form of rising steam and the underlay becoming painfullyhot to the touch. \nHow strange that I had Paolo Di Lazzaro claiming (wrongly) that it was impossible to scorch the topside without scorching the reverse side too, now to be told  that the conductive properties are so poor that any scorching can only be confined to the immediate environs of the template. I believe that the combination of conduction and convection can account for the scorching being primarily on the parts of the weave in direct contact with the hot metal, but with some encroachment of the scorch into the oblique threads diving into the weave – probably due to the effect of hot gases. Further evidence comes from placing linen into a fan oven at temperatures that are too low to get a rapid contact scorch – the linen gradually browns in a situation where the mode of heat transfer is almost entirely by convection.\nSo as far as convection is concerned, it is most definitely not a dreamed-up component – it is something that cannot be avoided, since the steam and other hot gases has to go somewhere, and with a solid metal as template, the main exit route will be through the weave into the underlay. That’s in my set up, pressing the template downwards into underlay. In your geometry, with cloth stretched over template, there is still a convection component, since the gases can then rise naturally by expansion and buoyancy. As I say, there’s no avoiding convection, even in a model in which the prime mechanism of imprinting is conduction – with convection providing some of the subtlety of the image, softening edges, and even generating that faint reverse-side image in some instances.\nAs already indicated, there is a sludge like appearance of the blood on that herringbone weave – hardly what one would expect from soluble haemoglobin that has leaked from retracted blood clots.  Anyone wanting to claim that the colour was due purely to pigmented serum (highly improbable in my view) should at least have some evidence that it is serum, e.g. by showing that albumins are present, but NOT fibrinogen.\nI was pleased to see the robustness of your comment regarding radiation. So why was that not mentioned in your pdf?  Barring Maillard reactions, for which there is simply no evidence (failure to detect reducing sugar and/or extra nitrogen)  the conventional wisdom is that some kind of radiation produced the image – a model that is strongly promoted by Jackson’s Shroud Center .  Few dispute that the image has the appearance and spectral properties of a heat scorch, due to chemical dehydration of linen carbohydrates,  So how come it is my conduction/convection model that gets all the critical attention, as if I were proposing some wildly improbable kind of physics or chemistry, when it is in fact common knowledge that  hot metal leaves an imprint of its own shape on linen,? Why were the major plus points not mentioned, namely the fact that contact imprinting explains the negative character, the non-directionality, the ability to get 3D enhancement, the ability to get a scorch that is as strong or faint as one wishes, simply by altering temperature, contact pressure etc? \nAnyway, I have written and posted my letter to the Royal Society, and regardless of its policy line if any on the Shroud, still to be established,  I shall follow up if necessary by asking iif any of its Fellows knows of, or could devise a test for contact scorches – physical, chemical or both. It’s incredible that there is scarcely any information worth speaking of on the Shroud image, beyond some reflectance spectra, spot tests etc. Yet mention a conduction scorch and scorn is heaped upon one, the worst of which has come from Paolo Di Lazzaro and John Jackson, but with you not far behind TH.\n\n","date":"March 25, 2013 at 6:22 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28366","author":"colinsberry","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"\ncolinsberry :\nI believe that the combination of conduction and convection can account for the scorching being primarily on the parts of the weave in direct contact with the hot metal, but with some encroachment of the scorch into the oblique threads diving into the weave – probably due to the effect of hot gases.\n\nYou believe.\nThe very low conduction of heat in linen is still responsible for heat transfer at first order, whereas convection is second order, just try to quantify heat transfer.\nWhat are you using Colin, a fan ?\nNan mais allo quoi ! un ventilateur ?\n\n","date":"March 26, 2013 at 12:38 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28414","author":"anoxie","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"\nYannick Clément :\nWhat speak very loud to me Colin is the fact that Barbet, well before the STURP direct investigation of 78, was already claiming that the bloodstains on the Shroud were caused by exudates of blood clots (i.e. not composed of complete blood) and was also already claiming that there was probably halos of clear serum around each stains, which were both independtly confirmed after the investigation of 78.  In sum, the STURP investigation “only” confirmed the ideas described by Barbet during the 1930s.  Note that, for Barbet, who saw the Shroud outside the Basilica of St John the Baptist (in sunlight) during the 1933 exhibition, these stains could not have been caused by anything else…  After this public showing of the Shroud, that was an evidence for him and, guess what, his profesionnal impression was later confirmed by 2 independent experts in the US and in Italy.  Why putting such a strong result into question Colin?\n\nAgain, I urge you to use the evidence of your own eyes (and that of Durante’s HD images in 2002, available on Shroud Scope).\nThe bloodstains on the Shroud do not look like a serum exudate. They look like whole blood. In fact they look better than whole blood. They have a sludge-like look, almost as if applied like paint with a roller, so that there is a striation – an alternation of light and dark, corresponding with the ribs and furrows of the herringbone weave.\nLook closer at most of the bloodstains and you can see evidence of blood having flaked off in the past – with areas where it is still in place, and other usually larger areas where there is only a faint patch to show where it was originally. The clincher is the presence in the otherwise denuded areas of  tiny bits of dense pigment in pits and crevices where it has hung on, resisting detachment. If there is substantial amounts of serum (which I doubt, given the paucity of potassium) then it is under the bloodstains, and still in the denuded areas that are now a very faint pink.\nThe notion that the major .’bloodstains’ represent a serum exudate (i.e. a high ratio of fibrinogen-depleted plasma proteins relative to haemoglobin) is a complete figment of those people’s imagination. There is far too much “sludgy” red pigment (‘haem’) for that to be the case.\nThe “serum exudate” idea conveniently fits a certain narrative that tries to account for why dried blood clots might transfer to linen with extraordinary precision, homogeneity and efficiency, looking for all the world  as if had been whole blood that had trickled down the linen itself – instead of skin or hair many hours before. That idea is TOTALLY at odds with the evidence of one’s own eyes. \nSo how could Barbet, and then Adler and Heller have got it so wrong? I cannot speak for the first, but I can for Adler/Heller. Despite being called members of STURP, neither went to Turin in 1978, neither saw the Shroud with his own eyes.  Both were content to work with scrapings or individual fibres that had been detached with sticky tape and handed over thousands of miles away.  I’ll say no more about the ‘science’ except to remind folk that each and every scientist has a (potential) dark side where creativity substitutes for hard evidence in the final write-up.. Yes, that’s a euphemism…\nAs for Adler and Heller being called  members of STURP – that’s bizarre – and a major management failure!They were no more members of STURP than the radiocarbon dating laboratories.  In fact the latter have a better claim to being described as STURP, or STURP Mk 2, or Honorary STURP. At least they went to Turin to see the Shroud with their own eyes. I bet they would not have described the in situ appearance of those bloodstains as a ‘serum exudate’. \nIt’s time that term ‘serum exudate’ was banished from the Shroud literature…\n\n","date":"March 25, 2013 at 5:35 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28317","author":"colinsberry","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Adler saw the Shroud with his own eyes after the STURP investigation (in 1998 as I recall) and he said it was evident for him that these stains were formed by exudates of blood clots (and not serum exudates as you said).  And you seem to forgot completely Baima Bollone in your analysis!  He was present on site in Turin with the STURP team and came to the very same conclusion than Heller and Adler (which is in fact a scientific confirmation of an hypothesis described by Barbet in the 1930s, who, by the way, also saw the Shroud with his own eyes in Turin before claiming the blood on the Shroud was caused by exudates of blood clots)!  \nHere’s a very good suggestion for you : I think you should read the books published by Barbet and Baima Bollone about the Shroud before making any claim regarding the blood evidence!\nIn fact, most bloodstains on the Shroud are due to a transfer of exudates of humid blood clots to the fabric by direct contacts and all the halos of serum found around most of these bloodstains (and confirmed by the study of the UV fluorescence photos done by Miller and Pellicori) were formed on the fabric during that very same transfer and were caused by a well-known medical phenomenon called « clot retraction ».  This happen between 20 to 50 minutes after the clotting of the blood began and the serum separate much more clearly from the blood clot when this phenomenon happen in a vertical position (as demonstate by lab experiments done by Doctor Gilbert Lavoie in the 1980s).\nAll these conclusions made by true experts in the field of blood transfer clearly indicates that the bloodstains on the Shroud were caused by a direct contact between the cloth and a corpse who died in a vertical position (we know the body was dead because some bloodstains clearly came from a post-mortem bleeding).  I’m sorry for you but all this fits perfectly with the body image of a scourged and crucified man we see on the Shroud and there is no good reason to doubt such a strong conclusion, except if you DON’T want to see the truth.  The truth is this :  the bloodstain evidence concerning the Shroud is probably the most reliable piece of evidence that clearly indicates that this cloth is an authentic burial cloth of a real crucified man.  Now, as I said earlier, such a conclusion doesn’t mean this cloth is the genuine burial shroud of Jesus or that he really resurrect from the dead, but at least, it indicates that the Shroud is a genuine burial cloth.  And because of this, the only plausible scenario that can involve a forgery is the one in which an unknown forger would have taken a real scourged and crucified corpse and place it inside a real burial shroud for less than 72 hours in order to create a false relic of Jesus’ Passion.  There is no other rational scenario than this one if you still want the Shroud to be the product of a forgery.\n\n","date":"March 25, 2013 at 10:38 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28332","author":"Yannick Clément","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"It’s customary in science to provide experimental demonstration of any straightforward hypothesis. In this instance we seek evidence that a dried-on blood clot can transfer so much haemoglobin to linen via “clot retraction and serum extrusion” as to form a stain that looks for all intents and purposes as if it were whole blood. \nI’m sure that with your extensive knowledge of the literature, Yannick, you’ll be able to provide a link to the experimental confirmation that one seeks.\nIf you can’t, then I’ll be forced to repeat my original request/demand – namely that we should get this narrative-embellishing, intelligence-insulting, pseudoscientific twaddle out of the literature…\n\n","date":"March 25, 2013 at 11:04 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28333","author":"colinsberry","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Let me see if I understand. Chemist Colin Berry is critical of Al Adler and John Heller because they only did chemical analysis on shroud samples and did not go to Turin and examine the shroud directly. Actually Adler did look at the shroud in Turin. Yet Colin Berry who has never been to to see the shroud or done any chemical analysis whatsoever on any material taken from the shroud is able to argue that the blood from leeches was applied on top of the images. And he knows this from looking at low definition pictures on the internet. Talk about pseudoscientific twaddle.\n\n","date":"March 25, 2013 at 11:21 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28335","author":"Paulette","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Are you familiar with the expression: “make a cogent argument”, Paulette? \nAdler did NOT accompany the STURP team to Turin (and should have done!) but may have done so much later.  Would you care for a link or two? \nYes, I have hypothesized that it was leech digesta that was used, probably in the 12th/13th century,  to paint the Shroud, based on bloodstains looking too concentrated and  sludge-like to be ordinary runny blood, explaining why the stains are deficient in potassium ions (because leeches dispose of plasma and its electrolytes), the atypical porphyrin spectrum (long residence in the leech gut with bacteria etc causing chemical modification) and the practical advantages of using blood that will not clot (leeches secrete an anticoagulant called hirudin).  Yes, it’s just a hypothesis, Paulette, but one with a difference: it is easily testable, which makes it a scientific hypothesis. What’s more, I am more than willing  for that hypothesis to be tested tomorrow, Vatican/Turin custodians permitting, even if the result proves  negative and I end up with egg on my face.That’s the difference between me and STURP’s prima donnas – I’m not on an ego trip, merely interested in seeking answers to the Shroud “enigma”.  \nI learned yesterday that my first research employer in Philadelphia sadly passed away in Seattle in January. He was described in his obituary as a “yellow giant” – probably googleable- a reference to his immense bilirubin expertise. For some 12 months  in 1971/72 I had tried to persuade him that his explanation for why phototherapy for neonatal jaundice works so efficiently, and by a peculiar effect that he himself had discovered (excretion of “unchanged” bilirubin) was not the right one, and that bilirubin had probably isomerised under light to a more polar, more easily excretable form. But he was too wedded to his hypothesis, and it was me who turned out to be correct, thanks to the work of another group based in California.  Scientific genius? Nope. I just worked systematically through the evidence, doing some simple experiments, eliminating this and that, until I was left with photoisomerism as the only likely answer.  Fortunately I managed to work that idea into a different paper on which I was chief author (published BBRC in 1972).  Just as well, since he failed to mention mine in the big write-up. That’s also how I operated with later research projects (resistant starch etc) and with the Shroud –  by a remorseless process of elimination. I would hope that you as a science teacher would recognize the patient, non-glory-seeking systematic approach when you see it.  Have a nice balance of the day…\n\n","date":"March 25, 2013 at 11:56 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28336","author":"colinsberry","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Colin say : “Adler did NOT accompany the STURP team to Turin (and should have done!) but may have done so much later. Would you care for a link or two?”\nBut what about Baima Bollone Colin?  He was a true expert in forensic science and HE WAS THERE IN TURIN IN 1978 WITH THE STURP TEAM AND SAW THE SHROUD UP CLOSE AND PERSONAL!\nI would like you to address that fact…\n\n","date":"March 25, 2013 at 1:00 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28343","author":"Yannick Clément","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Paulette, the narcissist is always right and everyone else is the problem. It’s always a conspiracy theory and everyone else is blind to it. They never want to show their cards when called on to do so but constantly want to see what hand everyone else is playing. It’s all a ploy for attention. It is folly to engage them on a continual basis for it feeds them. To do so is to be like a hamster on a wheel that thinks he’s getting somewhere when in reality he’s going nowhere. And the narcissist is so pleased to keep you on that wheel, spinning away.\n\n","date":"March 25, 2013 at 12:35 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28340","author":"Chris","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"There must be easier ways of doing this narcissism thing (180+ postings to date  – only a relatively small number of which, not surprisingly, have been showcased on this site). \nEver heard the origins of the word “blog”? Like, you know,  weblog – a running account in real time of some interest one has picked up, and wishes to communicate to kindred spirits?\nOh, and I do have other interests you know (current affairs, the EU, UKIP, Stonehenge, climate change, nutrition, astronomy etc etc).\nThere’s no obligation to read, you know, if the ideas expressed are not to your liking… There are millions of other blogs out there you could visit.  Or there again, maybe my iconoclasm has sown a seed of doubt, and you just can’t tear yourself away…\n\n","date":"March 25, 2013 at 12:55 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28341","author":"colinsberry","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"\ncolinsberry :There must be easier ways of doing this narcissism thing (180+ postings to date – only a relatively small number of which, not surprisingly, have been showcased on this site).\nEver heard the origins of the word “blog”? Like, you know, weblog – a running account in real time of some interest one has picked up, and wishes to communicate to kindred spirits?Oh, and I do have other interests you know (current affairs, the EU, UKIP, Stonehenge, climate change, nutrition, astronomy etc etc).\nThere’s no obligation to read, you know, if the ideas expressed are not to your liking… There are millions of other blogs out there you could visit. Or there again, maybe my iconoclasm has sown a seed of doubt, and you just can’t tear yourself away…\nPlease know that I always remember you in my prayers.\n\n","date":"March 25, 2013 at 1:05 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28344","author":"Chris","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"“Colin say : “Adler did NOT accompany the STURP team to Turin (and should have done!) but may have done so much later. Would you care for a link or two?”\nBut what about Baima Bollone Colin? He was a true expert in forensic science and HE WAS THERE IN TURIN IN 1978 WITH THE STURP TEAM AND SAW THE SHROUD UP CLOSE AND PERSONAL!\nI would like you to address that fact…”\nSorry, I just can’t cope with the killer arguments appearing on this site right now (first Yannick, then Paulette, then Chris, then Yannick (again, and again, and AGAIN and AGAIN …)\nShould anyone care to discuss the science, they know where to find me (click on username). \nAs the Telegraph’s Tom Chivers said a year ago, following that ludicrous ENSA   Pope-pleasing stuff with uv laser beams, scorching at best a few fibres on a handkerchief: “The Shroud is fake. Get over it.”  (Shroud Mk1 was probably not a fake, more likely a grim post-1314 political statement, then subsequently re-cycled and Christianized, all for the benefit of fee-paying pilgrims – but why bother with the details of sinister French medieval history here?)\n\n","date":"March 25, 2013 at 1:27 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28346","author":"colinsberry","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Wow Colin!  That’s what I call « to slip away from the heart of the debate ».  Does that mean you don’t know how to answer me??? ;-)  I really think Baima Bollone’s direct inquiry concerning the blood on the Shroud is your Achilles’ heel on this debate!\n\n","date":"March 25, 2013 at 2:21 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28349","author":"Yannick Clément","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Yawn…\n\n","date":"March 25, 2013 at 2:32 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28350","author":"colinsberry","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"1-0 for Yannick!  He he! ;-)\n\n","date":"March 25, 2013 at 3:12 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28353","author":"Yannick Clément","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"I must add this to Colin :  I understand your frustration concerning the Shroud because I feel exactly the same.  It is totally true that this relic was used and is still being used for the wrong motives (money, power, trying to physically proving the Resurrection of Christ, etc.) and that’s very sad to see, but all this crap doesn’t mean that the Shroud of Turin cannot be the authentic Shroud of the historical Jesus of Nazareth…  I think it’s very important to make this kind of distinction.\n\n","date":"March 25, 2013 at 3:37 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28357","author":"Yannick Clément","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Time for me to weigh in. Like a couple of other researchers, Baimas Bollone postulated, but did not test, that the red colour of the blood might be due to bilirubin. Bilirubin, as we know, is orange, not red. The Goldonis took his idea a stage further by adding bilirubin to blood to observe the effect. Even at “5 times greater than the normal physiological concentration” no colour change was observed until a set of samples was irradiated for 6 hours with UV light, when all concentrations went “bright red.” They postulate that UV rays degrade the bilirubin into lumirubin and isolumirubin. Lumirubin is normally yellow. The rest of the Goldonis’ paper is not completely clear to me. They seem to suggest the shroud blood only looks red in sunlight (not in artificial light), as a response to solar UV, which would normally be insufficient to have an effect. However, if blood is irradiated with neutrons, it appears to become more sensitive to UV, the red colour of their samples becoming obvious after only 30 minutes instead of 6 hours. They attribute the nuclear irradiation of the shroud to the resurrection.\nThe Goldonis’ claim, that the shroud blood is especially red by UV radiation from the sun, is in direct contradiction to Pellicori and Miller’s findings that the blood did not fluoresce under UV light at all.\nProponents of the forgery theory usually quote the unnatural colour of the bloodstains as an argument in their favour, and so far, those in favour of authenticity have yet to refute their argument.\n\n","date":"March 25, 2013 at 5:41 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28364","author":"Hugh Farey","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Thibault has just popped in a comment while I was writing the above, in which he says that a very small amount of hemoglobin has a very red colour. That may be so, but I had understood that the possibility of hemoglobin remaining intact was zero, hence the alternative explanations. Has anybody identified actual hemoglobin on the shroud, as opposed to its breakdown products?\n\n","date":"March 25, 2013 at 5:50 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28365","author":"Hugh Farey","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Dear Hugh,\nSorry, I was not clear enough in my previous post.\nI was referring to the “fact” that CB, looking at the blood stains on the TS consider that they look more like whole blood rather than blood exudates.\nI wonder why he thinks so.\nBut if CB’s assertions are based on the fact that the blood on the TS seems to be to much colored for blood exudates, I disagree.\nThe red color of this hemoglobin is another question.\nYou wrote: ”  Has anybody identified actual hemoglobin on the shroud, as opposed to its breakdown products?”\nWhat do you mean exactly ?\nThibault.\n\n","date":"March 26, 2013 at 4:57 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28442","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Further to what I was saying Daveb earlier, I would maintain that much of the so-called mystique of the Shroud is manufactured, or ‘all-in-the-mind’, conveniently supporting a narrative. That is true of the body image being claimed to be far too superficial to have been formed by any known physics (so self-evident that nobody bothered to check). \nNow we see the mystique manufacture continuing with blood that is not really blood, but merely a serum exudate from a retracted blood clot (that again just happens to support a particular narrative etc etc).  Has anyone ever dared to see whether experimental serum exudate transfers applications to  linen match up with those striking HD photographs of Shroud bloodstains? You know, the ones that show highly superficial blood – preferring one part of the herring bone weave to another,  thus emphasizing the weave pattern, almost as if something with a paint-like consistency had been applied with a roller or swab and stayed mainly on the surface, as distinct from soaking into the weave. \nSo there’s an alternative narrative – one that says that far from being highly-diluted haemoglobin, it was just the opposite – highly concentrated, tending to stick to the first bit of linen with which it came into contact, instead of migrating into the weave., sludge-like instead of a mobile runny liquid.\nWhat can one man do, confronted with so many instances of what without any shadow of doubt is agenda-driven manufactured mystique?  \nMethinks that letter I sent the Royal Society yesterday was far to restrained. I should have told it the way it is… Shroudology is based on nothing more than decades of carefully manufactured mystique. Thanks DaveB, thank TH, for crystallizing my thoughts, and making me think of a nice alliterative tag that sums up the name of this particular strain of pseudoscience – manufactured mystique…\n\n","date":"March 26, 2013 at 5:48 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28446","author":"colinsberry","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Hi Thibault,\nI know nothing about the components of recent or ancient blood, so have to rely on the observations of others for information, upon which I can build my own conclusions – or lack of them.\nI simply ask, what is the red colour we observe on the shroud?\nSome say it is bilirubin, which is orange, and even after mixing orange and brown (to mimic methemoglobin) I cannot make red.\nSome say bilirubin fluoresces red under solar UV after treatment with nuclear radiation, and the shroud was so treated. Others deny that the shroud blood fluoresces at all.\nSome say that hemoglobin is red. Others say that there is no hemoglobin on the shroud.\nDoes anyone have a coherent explanation for the red colour that is not denied by someone else?\nThat is my question, and the point of my post.\n\n","date":"March 26, 2013 at 7:19 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28448","author":"Hugh Farey","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Maybe the issue is really “actual hemoglobin” versus “intact hemoglobin”.  The presence of hemoglobin was identified by Adler & colleagues based on the spectra of the characteristic Soret band, indicative of the heme group, which, in turn, is indicative of hemoglobin.  Adler was a porphyrin expert-it is natural that spectroscopy would be the primary technique used in characterizing that the stains contained blood products.  I am not certain, but I do not believe that actual “intact” hemoglobin versus certain hemoglobin fragments containing the heme group could be effectively distinguished by this technique.    \nNot a knock in any way towards Hugh at all, but in terms of a general comment, I think it’s relevant to consider that the scientists studying the Shroud samples during this period were working with relatively limited amounts of material-the primary issue was to establish if the stains were, in fact, actual blood and if so, from what species.\n\n","date":"March 25, 2013 at 9:21 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28369","author":"Kelly Kearse","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"I have followed the shroud research for the last 20 years. I have not yet seen one shred of evidence that would have led me to believe the shroud is a fake. I’m no scientist but after reading just about every comments Colin Berry have posted on this blog, I think there is only one way for me to see if Colin Berry’s so called scorch-charcoal painting theory would hold up. Colin, would you kindly please present your findings or result of your experiment (must be photographic negative image) so that I can make a comparison between yours and the photographic negative image of the shroud? Right now I don’t care about the blood. I just want to see the image.Thanks\n\n","date":"March 25, 2013 at 9:29 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28370","author":"Donn Reile","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Forget about the charcoal, Donn. That was used in my first experiments to demonstrate that heat/light radiation might just  in principle  (thermostencilling) but only if an opaque pigment such as charcoal were present – and much else besides (converging lens etc)\nRather then give a lot of links, why don’t you simply put (shroud medieval scorch) into your search engine, and locate the site that has ‘withoutallthehype’ in its URL. Then look at the banner. The first picture on the left is the 3D-enhanced Shroud negative. The next three show how that can be modelled by scorching an image directly from a 3D-bas template (a trinket I brought back from W.Africa) but if you put ‘horse brass’ into your search you’ll get a lot more end-results using thermal imprinting, aka scorching by contact. All scorch images from 3D bas reliefs should respond to 3D enhancement, since the image intensity is like an analogue recording of 3D relief that can be scaled on the vertical height (z) axis.\nAlternatively, try it yourself. Find something metal that has some relief – a coin will do for starters. Heat on a hob, test with cotton or linen to check its hot enough to produce a scorch, then remove, press into the cloth (have a damp underlay, e.g. dishcloth underneath), then if possible lift, move to a new spot, press, lift etc. (here it helps to have a template that has something that can be gripped, e.g. with pliars). You should get a row of images of progressively lower intensity, usually a few, three or four generally, until the template has lost so much heat it can no longer scorch. But here’s the interesting thing. If you photograph the images, and then enter them into ImageJ software, you can use the latter firstly to view the inverted image, i.e. light/dark reversed, and then use the 3D-enhancement to get some pleasing and in some cases spectacular results (though for the latter you really need a template that has more relief than a coin). \nAll scorch images, right down to the faintest that are only just visible respond to ImageJ 3D enhancement in my experience. What’s more, one can do a charcoal sketch of the Shroud ‘as-is’ image, enter it into ImageJ, then process as if it were a scorch. That way you can see the two stages of enhancement. Inversion alone can give an amazing transformation, and then 3D enhancement will have you asking “Wow, did I really do that?” You’ll experience a little of what Secondo Pia must have felt in 1898. Just replace the ‘wow’ with Mamma Mia…\n\n","date":"March 26, 2013 at 3:09 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28384","author":"colinsberry","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"What I find fascinating about the shroud, Don, is that while every piece of ‘evidence’ that the shroud is a fake turns out to be readily disputable, so does every piece of ‘evidence’ that it is genuine. So far, I have not learnt enough about it to be convinced either way (or rather, I used to swing excitedly from one side to the other and have now ended up as undecided as when I first discovered the shroud in my teens).\nIt may be that a more metaphysical approach is needed; and that the very fact that every fact is, in fact, disputable is itself evidence of the veracity, if not the provenance, of the shroud. Currently, on this level, the shroud is in a kind of quantum super-position, which may, at the discovery of some new evidence, collapse into ‘burial cloth’ or ‘painting’ (or some variation), but part of me hopes that it remains forever unknown.\n\n","date":"March 26, 2013 at 5:12 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28393","author":"Hugh Farey","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Quote from Hugh :  “So far, I have not learnt enough about it to be convinced either way…”\nMy advice to you :  Just meditate on the unusually high number of scourge marks and their unusual location (on the front as well as on the back), along with the unusual total nakedness of the body, the puncture wounds that covered all the scalp and the confirmed fact that most of the bloodstains do not come from whole blood but from exudates of humid blood clots and you will possibly end up just like me thinking that no forger from any period of history, basing his work on the Gospels, would have created such an image.  All the data and observations attached to the Shroud strongly indicate a real burial shroud of someone who suffered the same tortures than Jesus and, using Occam’s razor, the simpliest and most rational answer to explain this is to conclude that the Shroud is the real thing (but even then, that doesn’t mean that this cloth can prove the Resurrection of Christ or something like that).\n\n","date":"March 26, 2013 at 1:14 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28416","author":"Yannick Clément","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Oh I do meditate on all these things, and the more I meditate on them, the more uncertain I become. The scourge marks, for example – we have become so used to the “dumb-bell” image that it comes as quite a shock to enlarge the Durante photo and observe that they look exactly like brush strokes. The humid blood clot exudate – does this mean the blood was dry and then made wet again, or did it never dry? If the first, then how did it get wet again, and if the second, how did it stay wet for so long? The nakedness – while it is true that only Michaelangelo shows genitalia, a large number of paintings show a naked Christ whose modesty is protected by something, maybe a wisp of very unrealistic cloth, or a raised leg. Remarkably, it is the icons made before 1300 that nearly always show a properly loin-clothed Christ, while the paintings after 1300 more often show a naked body. If the relative proportion of naked to clothed images alone were a true reflection of the provenance of the shroud, one would have to say that it was more likely to have appeared in mediaeval times than in antiquity.\nNone of these, I agree, constitutes proof of inauthenticity; but all of them cast doubt, as least to my mind, about genuineness. I must remain, for the time being, undecided.\n\n","date":"March 26, 2013 at 7:59 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28451","author":"Hugh Farey","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"The dumbell shape scourge marks are really made of blood and not paint.   This is a proven and confirmed fact.  They are almost all surrounded by halos of clear serum my friend (as seen by Miller and Pellicori of STURP in their study of the UV fluorescence photos).  Question for you :  How and why do an artistic forger would paint clear serum halos around almost all of these scourge marks ?\nFor Barbet, the clots made with life’s blood were all dried at the time of the enshrouding of the body and became wet on their surface after some time inside the Shroud, while the others that were made of post-mortem blood coming from the side wound and the feet wounds were most probably not completely dry when the body was placed inside the Shroud.  For the first kind of clots (which includes all the scourge wounds), Barbet thought that the wet environment inside the Shroud (remember that a dead body can emit water vapor and also other post-mortem gases like ammonia) was enough to cause a re-humidifaction at the surface of these dried clots and allow them to form a mirror image on the cloth.\nAnd for the nakedness of the Shroud man, I dare you to find me one single artwork of any period of time before the first apparition of the Shroud in Lirey, France that show the naked buttocks of Jesus like we see on the Shroud!  I really don’t think such an artwork exist.  And if one exist, you can bet that this was not common at all during those days and surely not popular among the faithful crowds (who would have been the first “target” of the forger).\n\n","date":"March 27, 2013 at 10:50 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28488","author":"Yannick Clément","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"A forger might create invisible serum halos if he painted the blood-marks with blood, I suppose.\nCan dead bodies emit enough moisture to dampen dried blood, I wonder? I don’t think ammonia vapour by itself would do the trick, and am doubtful if dead bodies emit ammonia anyway. All in all, not wholly conclusive, if I may say so.\nAnd, exactly, my point, I cannot find naked images of Christ before the shroud was exposed, but I can find plenty after it. Naturally I attribute this to earlier artists not being aware that Christ himself had left a naked image of himself, while, as soon as the relic was ‘revealed for the first time’ in the 13th century, they immediately felt justified in imitating him.\n\n","date":"March 27, 2013 at 12:26 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28498","author":"Hugh Farey","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"I think there is no science for Christ.  Its virtually impossible to reproduce the exact image of the shroud in addition with all of the other problems associated with it. Like you said, it will remains forever unknown. I was an atheist once. The TS has completely changed my life. It has giving me hope and happiness. The reason I still follow the Shroud is hopefully someday the truth will come out that it is authentic, probably not in my lifetime.\n\n","date":"March 26, 2013 at 10:35 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28459","author":"Donn Reile","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Your original question was  “Colin, would you kindly please present your findings or result of your experiment (must be photographic negative image) so that I can make a comparison between yours and the photographic negative image of the shroud? Right now I don’t care about the blood. I just want to see the image.Thanks”.\nI responded to that in some detail, and what do I get for my trouble? Something you should have said at the outset, namely that for you the Shroud is a spiritual comfort, one  that defies and transcends image analysis or any other scientific investigation, making the latter irrelevant in your worldview,\nSo why make out initially that the detail was important to you? Has it occurred to you that you are doing a fairly good imitation of the dreaded internet time-waster – and one moreover with what looks suspiciously like an anti-atheist hang-up. (You’re not related to David Rolfe by any chance, are you?)\nTheology is of no relevance whatsoever to whether or not the Shroud is what some of the regulars on this site claim it to be, citing (or as often as not, parroting)  so-called  scientific evidence  i.e. that it is the actual burial cloth of Jesus of Nazareth. If two people agree to fight a duel with sabres called science, one doesn’t expect one of the combatants under pressure to suddenly pull a gun called theology.\n\n","date":"March 27, 2013 at 4:43 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28474","author":"colinsberry","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"I have seen your banner before. What i was hoping for was an exact replica of shroud using bas-relief as the model for your experiment. I find that its impossible to create a bas-relief statue because the image on the shroud is so anatomically perfect. No sculpturist can do this. If one did, it would be in a museum as the greatest artwork ever in the history of mankind.  As for my theological views, they are mine and I am welcome to them, as they had no relevance to the question I proposed. I am still interested in the scientific findings, seeing as I have no access to the shroud myself, and even if I did, I lack the scientific intellect and background to bring fourth results. As for your comment as a “dreaded internet time-waster”, this is an open to the public blog (if you will) and I challenge you to change my mind, and see me as a devils advocate rather than an individual wasting your time; especially considering my depth of interest on the topic.\n\n","date":"March 27, 2013 at 12:31 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28499","author":"Donn Reile","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"To anoxie (no reply tab on her most recent comment)\nNo fan or ventilator is required to produce a powerful convection current. The conversion of liquid water (or fibre-bound moisture, which amounts to the same thing) results in evaporation, with a HUGE increase in volume as liquid water – > water vapour, aided by the Charles’s Law volume increase over and above 100 degrees C when there is actual physical contact between hot template at 200-250 degrees Celsius and the moisture-containing linen (and let’s not forget the extra steam and gas that comes from the pyrolytic dehydration and subsequent scorching of linen carbohydrates). \nThat superheated steam then rushes through the interstices of the weave to the other side. In other words, we ARE dealing with convection, even if it’s secondary to what is primarily a contact/conduction model.  It wasn’t till I switched to a hands-on approach that the convection aspect became apparent – through seeing the expulsion of steam, and discovering the hard way j with those hands and their nerve-endings just how hot the damp undercloth had become. In fact, it was the observation that heat was being transmitted to the underlay far more speedily and efficiently than one might have expected from conduction alone, and was making the template stick to the underlay through heat-fusion, with excessive reverse side discoloration too, that I realized the need to dampen the underlay.  That then creates a heat sink for the surplus heat, mainly convected as distinct from conducted and helps prevent reverse-side scorching. (Are you reading this, Paolo?)\nThere’s a moral there somewhere –  always do the experiment – it can expose gaps in one’s theory. In this case the gap was in describing the model as contact/conduction. It is not: it is contact/conduction/convection. Or as you might prefer anoxie: contact/primary conduction/secondary convection.\n\n","date":"March 26, 2013 at 1:20 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28417","author":"colinsberry","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"Hugh\nLike you (it seems) I am agnostic on the question of the authenticity of the shroud, although tending more towards authenticity. \nYou say: \n“The nakedness – while it is true that only Michaelangelo shows genitalia, a large number of paintings show a naked Christ whose modesty is protected by something, maybe a wisp of very unrealistic cloth, or a raised leg. Remarkably, it is the icons made before 1300 that nearly always show a properly loin-clothed Christ, while the paintings after 1300 more often show a naked body. If the relative proportion of naked to clothed images alone were a true reflection of the provenance of the shroud, one would have to say that it was more likely to have appeared in mediaeval times than in antiquity.”\nTrue, whilst many (I would disagree with you that ‘most’ do) paintings after 1300 do show Jesus naked with not necessary a full thick loin cloth like earlier depictions, but more like a wisp of much less substantial cloth, they still protect Christ’s modesty with very few exceptions. But to be frank, I don’t think this has any bearing whatsoever on the authenticity argument. The emergence of “Skimpier’ loin cloths may just reflect the fact that artistic depictions became more realistic, and also started to show Christ in more realistic agony and suffering. Less loin cloth protection could be considered part of this movement. Or maybe reflects the fact that the Shroud figure has no protection, which influenced the artistic evolution closer towards ‘nothing’.\nThe undeniable fact remains that for the most part artists still sought to protect Christ’s modesty. Even several of the artistic copies of the Shroud from the 1500s – 1600s depict the shroud figure with a full loin cloth! \nAgain, I don’t think the fact that most depictions of Christ before 1300 show him with a full loin cloth argues against authenticity either. The fact that several copies of the shroud from the 1500s and 1600s shows the shroud figure with a loin cloth indicates a long tradition of wanting to preserve Christ’s modesty with a loin cloth, regardless of the fact that the figure on the shroud IS NOT protected by a loin cloth.\n\n","date":"March 27, 2013 at 8:15 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28480","author":"Matthias","site":"shroudstory"},{"title":"Three New Shroud of Turin Websites to Watch","post":"I agree with every word, Matthias. However, the nakedness or otherwise of Jesus’s body is often claimed as an argument one way or the other (see Yannick, above), so I wanted to point out that if that were the sole criterion on which to base an opinion, one would have to go for the mediaeval rather than the ancient. Yannick nails his colours very firmly to his mast, which is quite refreshing, but it does encourage impudent attempts to shoot them down…\n\n","date":"March 27, 2013 at 10:02 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","id":"comment-28482","author":"Hugh Farey","site":"shroudstory"}]
