[{"title":"A Gift to the Shroud of Turin Blogosphere from Stephen Jones","post":"Only now has Ian Wilson’s article in the “Catholic Herald” been noticed? Father Francis O’Leary approached him precisely because he read such an article by him in the weekly.\n\n","date":"April 12, 2014 at 10:24 am","url":"https://shroudstory.com/2014/04/12/a-gift-to-the-shroud-of-turin-blogosphere-from-stephen-jones/","cat":"history","id":"comment-98691","author":"Louis","site":"shroudstory"},{"title":"A Gift to the Shroud of Turin Blogosphere from Stephen Jones","post":"So, was this Ian’s first public writing about the Shroud? A very good little article.\n\n","date":"April 12, 2014 at 12:48 pm","url":"https://shroudstory.com/2014/04/12/a-gift-to-the-shroud-of-turin-blogosphere-from-stephen-jones/","cat":"history","id":"comment-98727","author":"Larry","site":"shroudstory"},{"title":"A Gift to the Shroud of Turin Blogosphere from Stephen Jones","post":"I am not sure if this was IW’s first public writing about the Shroud and I appreciated what he was writing because I myself was writing for a weekly once in a while, but on other topics such as theology, Church history and so forth.\nHis article caught the attention of Father Francis O’Leary because of the mattress imprint phenomenon, which was mentioned in at least one of his Shroud books. The good priest was giving it a spiritual connotation, making a connection with the TS, which was not convincing, however how could one bother someone who was involved in a much more important task, that is, trying to raise funds for his Hospice, where poor terminal patients could die with dignity?\nIW and I agreed that the image-formation process in the Imprint and the TS was not the same:\n http://holyshroudguild.org/uploads/2/7/1/7/2717873/can_the_jospice_mattress_imprint.mht_2.pdf\nPart II will be written and posted shortly.\nSuccess in your research!\n\n","date":"April 12, 2014 at 2:03 pm","url":"https://shroudstory.com/2014/04/12/a-gift-to-the-shroud-of-turin-blogosphere-from-stephen-jones/","cat":"history","id":"comment-98751","author":"Louis","site":"shroudstory"}]
