[{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"It’s crucial to understand that Jackson’s hypothesis concerning the fold marks (because it is just that : nothing less than an hypothesis that never received any credible and independent confirmation) is pretty much like everything that touch the Mandylion hypothesis of Ian Wilson, i.e. a proposition that is totally suggestive and speculative.  I want to emphasize the “suggestive” aspect of Jackson’s hypothesis since it was noted by Wilson himself in an article he wrote for the Hong Kong conference on the Shroud in 1986 that ONLY ONE fold SUGGESTED by Jackson are truly easy to distinguish while it’s not the case for the other 7 SUGGESTED foldmarks.  Not great to back-up the Mandylion hypothesis of Wilson since, in all logic, every one of these 8 SUGGESTED foldmarks should be visible with the same degree of intensity (because the Shroud would have been folded that way for many CENTURIES).  And as I said previously, there is foldmarks scattered everywhere on this cloth and science has not the possibility to date anyone of them.  \nFinally the bottom line is this :  Because such an hypothesis rest mainly on a suggestive and speculative argumentation (the proposal of Jackson to explain his incapacity to identify some supposed foldmarks in the frontal image is PURELY SPECULATIVE and don’t even rest on a real historical fact).  In this context, I think anyone with one once of judgement would conclude that such an hypothesis WOULD NOT STAND FOR 2 SECONDS IN A COURT ROOM !!!  No doubt at all that Jackson’s case would be crush down easily by any good advocate !!!  \nI’m sorry but when an hypothesis is mainly based on speculative and suggestive arguments, it’s simply impossible to consider it as being truly scientific, because science (whether it is hard science like physics and chemistry or other fields like history) hate speculations !!!  True science rest only on facts and, when it’s at his best, it rests on facts that were independently confirmed by other experts in the same field.  And for this hypothesis proposed by Jackson a long time ago, it’s not the case at all !!!  The reality is this :  it is just one person’s opinion based principally on speculations and, not the lest, on the incredible power of suggestion !!!  And we know very well how such a powerful tool have been able throughout history to distract people from the real solid facts !!!  Personally, I will never follow such a path.\nConcerning the Mandylion hypothesis of Wilson, I prefer by far to trust the FACT that there was no physical and chemical differences (even at the microscopic level) that were found between the region of the face and the rest of the cloth.  On this subject, I truly recommend you to read the fact #22 that you can find in my recent paper regarding Wilson’s hypothesis.  Here’s the link for this paper :  https://shroudofturin.wordpress.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/\n\n","date":"August 1, 2012 at 12:59 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14388","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Little mistake.  Sorry.  Not far from the end of my comment, you should read “not the least” instead of “not the lest”.  I’m sure it will be more understandable that way.\n\n","date":"August 1, 2012 at 4:49 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14390","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Yannick will never move from his position, which is well-known, no matter what arguments are brought forward against it.  Others can access any of the four videos from the link provided and draw their own conclusions.  All new knowledge commences with a “speculation”, so there is nothing wrong with “speculations” as such.  The question has to be whether such “speculations” are followed up by some evidential support, and proponents of the Mandylion hypothesis have endeavoured to do this.  So therefore these are not merely idle speculations withour supporting arguments, and it is these arguments that need to be addressed. \nYannick claims that Wilson was only able to agree to only one of the folds identified by Jackson.  In this he has misquoted Wilson, probably from a misreading of W’s comment.  W’s actual comments on J’s fold-marks can be found in his paper “…. A Reply to Professor Averill Cameron” identified in an earlier posting on this site.  What Wilson actually said was this:- \n“… Jackson … has claimed the pinpointing of at least four of the hypothesised ‘doubled-in-four’ foldmarks, with another two reasonably certain, and the two remaining there by implication.  Particularly notable is one foldmark studied by Jackson, at postion C according to his notation, which can be traced clearly in all photos, including Xray and ultra-violet, and even the comparitively primitive ones taken in 1898.  Since this crease-line occurs precisely one eighth length from the Shroud’s natural half-way fold line, in itself it strongly suggests that the Shroud was once folded in the very way I have hypothesised for it to have been the Image of Edessa.” \nIn other words, Wilson’s comments on one particular fold are making an emphatic point, that this particular fold can be traced clearly in all photos, and that it occurs one eighth of the length from the natural half-way foldline; NOT as Yannick asserts that it is the only fold that is clearly distinguishable!  Note that Wilson is talking about his “hypothesis” i.e. he seems more prepared to be open-minded about the issue than is Yannick Clement. \nReaders are urged to view the videos themselves and draw their own conclusions.\n\n","date":"August 1, 2012 at 5:37 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14392","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Wilson statement include the following : “PARTICULARLY NOTABLE IS ONE FOLDMARKS studied by Jackson, at position C according to his notation, which can be traced clearly in all photos, including Xray and ultra-violet, and even the comparatively primitive ones taken in 1898.”\nNow, from my perspective, I see this as a clear indication that this is the only foldmark (on the 8 suggested) that is truly visible on the Shroud WITHOUT ANY SERIOUS DOUBT.  And because of that, I made the clever argument that if it is so, then it’s very bad for Wilson’s hypothesis since the other 7 foldmarks SHOULD BE visible as clearly as the one point out by Wilson because the Shroud would have been folded in 8 equal parts during MANY CENTURIES…  When we take this simple FACT into account and avoid to do any bad speculations like Jackson did with his proposal of a strange technique of folding and unfolding the cloth during Byzantine ceremonies (a proposal which doesn’t rest on any historical evidence at all, but solely on the imagination of Jackson), the only rational conclusion is that there is NOT 8 foldmarks located at equal distance on the Shroud !!!  The other foldmarks, if we believe Wilson analyse, are not as clear as the single one he pointed out and, as Jackson states himself, there’s even a lack of foldmarks in the frontal part of the Shroud.  I repeat, all these difference in the intensity of the suggested foldmarks are not coherent with the hypothesis of Wilson.  If there was 8 foldmarks of equal intensity that we could easily distinguish on the cloth every 1/8 of the total length of the cloth, that would be a complete different story, BUT IT IS NOT THE CASE.  Look at the picture Dan post along with this topic.  It come from a BBC documentary made by Rolfe and it is a PERFECT EXAMPLE OF A SUGGESTIVE KIND OF DEMONSTRATION !!!  All the cords being place where the foldmarks are supposed to be are just there to make us believe that these foldmarks are really present on the cloth !!!  I dare anyone here to state with his hand on the bible that he is able to really distinguish these supposed foldmarks that Jackson have imagined !!!  With the naked eye, nobody can…  And if we have to use the technical photos made by STURP (including Xray and ultra-violet) in order to “possibly” distinguish some of them, I’m sorry but this is very thin and suggestive.  In fact, if we believe Wilson statement, there is only one of the 8 suggested foldmarks that are clearly seen on all these technical photos WITHOUT ANY SERIOUS DOUBT.  In all logic, all the rest should be considered as suspect…  And if any of the other 7 foldmarks would have been visible as clearly, you can bet your house that Wilson would have said it clearly and loudly.\n\n","date":"August 2, 2012 at 1:00 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14419","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"One last thing I want to say about this hypothesis of Jackson :  This kind of proposal is highly subject to fall into the “I think I see” syndrome !!!  And as Ray Rogers said, everytime an hypothesis is subject to this kind of thing, it is not great science…   And it surely cannot be considered a clear and solid fact.\n\n","date":"August 2, 2012 at 1:09 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14420","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"I just forgot to add that Jackson’s hypothesis remind me a great deal of the other hypotheses that states there really are flower and plant images, writings, coins over the eyes, etc., etc.  All these hypotheses are subject to fall into the “I think I see” syndrome and, because of that, they are all suspect in my mind. \nAlso, it should be note that the one who proposed this foldmarks hypothesis (Jackson) is the same who proposed that the Shroud was the tablecloth of the last supper, that there really are some images of blood on the cloth (he’s not talking about bloodstains but about images of blood clots!!!) and that the corpse became like some kind of a “body of UV light” at the moment of the resurrection…\nAll these ideas are enough to prove that he got a marvelous imagination !  So, from my perspective, every hypothesis coming from someone like that should be considered suspicious right from the start.  On this topic, here’s an example to make you understand why we should at least be cautious when this person emit a new hypothesis :  If someone told you today that he just saw a UFO in the sky, maybe you could say to yourself : Who knows ? Maybe that’s really what he saw.  But if this same person come to you the very next day and tell you that he just saw a flying angel in the sky, wouldn’t you be a bit suspicious about all the thing he said to you yesterday and today ???  I think so !!!  I also think that once someone is bitten by the “I think I see” syndrome, it’s very hard after that for this person to be cured of it…\nDon’t get me wrong.  I respect infinitely the work he accomplished during the time he was just one member of a huge scientific team (STURP).  But since that time, it seem to me that he went on alone (with his wife) and that’s precisely when he start to proposed a bunch of highly suggestive and speculative hypothesis regarding different aspects of the Shroud that are mainly (not completely, but in good portions) based on his personal imagination.  Not great science in my opinion and for one, I will never put my trust into ideas like that.  \nOf course, this is just my personal point of view. I prefer by far to put my trust into solid FACTS like the fact #22 that you can read in my recent paper concerning Wilson’s hypothesis.  This is surely not a conclusion based on the “I think I see” syndrome !!!  This is science that we can trust…  \nOh by the way, I recommend you to take some time to read a 23rd fact I just dig out recently while reading William Meacham’s book about the Shroud !  You can read this 23rd “problematic” fact in regard of Wilson’s hypothesis here : https://shroudofturin.wordpress.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/#comment-14382\n\n","date":"August 2, 2012 at 3:47 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14426","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Sad to say, I tried going back to the link provided for the Jackson videos on the fold-marks, but for some reason was unsuccessful – it kept going back to a Shroud Enigma site.  I tried searching for the videos on Google, but was also unsuccessful. Pity!\n\n","date":"August 2, 2012 at 5:30 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14408","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Dave try youtube. I guarantee you’ll be more successful ;-)\nI actually just purchased the DVD after viewing the inferior quality on above mentioned, the quality of the DVD is awesome, and the video covers alot of ground. Well worth the mula spent.\nR\n\n","date":"August 2, 2012 at 7:39 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14411","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Try on youtube :\nBBC DOC – Shroud of Turin – New Evidence \n29’50” on video.\n\n","date":"August 2, 2012 at 1:55 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14421","author":"anoxie","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Thats what I meant. Thnaks anoxie\n\n","date":"August 6, 2012 at 4:00 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14546","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"The link works for me. Maybe it was down for a short time.\n\n","date":"August 2, 2012 at 8:00 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14412","author":"Paulette","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Nope, takes me too Shroud Enigma also, which doesn’t have the segment from the full video in question.\n\n","date":"August 2, 2012 at 9:05 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14416","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Yannick’s so-called Fact(?) 23, essentially “Why no mention of the discovery that the Mandylion was the Shroud?” after its arrival in Constantinople has been debated ad nauseam in numerous other postings.  Briefly the answer is that the Byzantines were not about to give up their precious Abgar legends which had even found their way into the Orthodox liturgy.  But I have no interest in debating the matter at length, backwards and forwards,  with anyone with such a closed mind on the matter.  His recent sustained debate(?) with Max Patrick Hamon on a related matter is an object lesson in how fruitless such an exercise can be.   I’m more interested in debating possibilities, as I have no axe to grind in this matter, whereas Yannick obviously has. \nIt is intriguing I think, on his own admission, that after nearly 1000 years of the Shroud being stored in other fashions, with frequent windings and unwindings, there still remains AT LEAST ONE such remnant fold and that this happens to be located at exactly one eighth of the cloth length from its centre.  Robert de Clari had described how the cloth had appeared to rise every Friday, and the Jackson demonstration of this was an attempt to search for an explanation of the otherwise mystifying four closely spaced folds that he had also discovered, and why some of the frontal folds seemed to be no longer visible.   \nLet viewers judge for themselves as to whether the other folds are present or not, They don’t need to be told what they can see.  They can come to their own conclusions on the matter.\n\n","date":"August 2, 2012 at 5:04 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14428","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Daveb, …Exactly! One must also make reference to (obviously) more then just(one)fold mark and specifically to the 4 distinct folds found below the navel area. Jackson’s hypothesis makes good sense of the “Man of Sorrows” or more precisely to the Byzantine “King of Glory” icons, which appeared around the 1200s, and to the lack of folds expected of the Image of Edessa configuration. Jackson et al’s hypothesis of such is more then just “conjecture” or “assumptions”, it derives from extended and INDEPTH study of the Shroud over decades. This extensive research is not simply “I think I see” science as claimed by Yannick…which I must say is a very weak argument from someone whom has had no more insight into the Shroud then anyone of us and far, far less then Mr Jackson.\nR\n\n","date":"August 2, 2012 at 6:30 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14429","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"I have a good question for Ron and others who defend this hypothesis of Jackson :  A foldmark that is only visible on specialized photographs (like X-Ray photos for example), can it really be considered a foldmark without any doubt ?\n\n","date":"August 3, 2012 at 10:41 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14446","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"In order to be very clear, I’ll ask my question differently :  A foldmark that is not visible to the naked eye, can it really be considered a foldmark ?\n\n","date":"August 3, 2012 at 12:58 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14451","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Dave, I think you have neglect one important part of my argumentation concerning the fact #23.  Here it is again :  “It seems completely ludicrous to think that a very important finding like that (a finding by the way that would have been already announced and described publicly if we interpret the sermon of Gregory Referendarius like Wilson, Dubarle and Scavone have done over the years) would have stayed in the dark afterward and never mentioned again (in detail and much more clearly) in other Byzantine texts written after that sermon ( pronounced publicly the very next day after the arrival of the Mandylion in Constantinople).”\nIn that context, if Wilson’s hypothesis is correct, how in the world this important description of the Mandylion made by Gregory (i.e. that the Mandylion was in fact a much longer cloth showing the stigmata of the Passion), would not have been reported in other subsequent manuscript that talk about the Mandylion and/or the Abgar legend ???  IT JUST DOESN’T MAKE ANY SENSE AT ALL, I’M SORRY.\nTo be convinced of the weakness of Wilson’s purely speculative argument that the Byzantine wanted to preserved the Abgar legend and that’s why the real sepulchral nature of the cloth was hidden to the public, you just have to consider the FACT that the sermon of Gregory Referendarius was pronounced in public (probably in front of all the people living in Constantinople) the very next day of the arrival of the relic (a day of great feast without any doubt).\nTaking that FACT into account, I ask the question :  IS THIS REALLY THE SIGN OF SOMEONE WHO WANTS TO HIDE A PRECIOUS INFORMATION AND HIDE IT TO THE PUBLIC ???\nOn the particular subject of the sermon of Gregory, I think Wilson, Dubarle, Scavone et al. should take good note of the opinion of Mark Guscin.  For him (who know, as a linguist, ancient Greek very well), Gregory didn’t make at all a precise and direct physical description of the Mandylion in his sermon, but instead, it was more like a symbolic speech around the image of Christ present on the Mandylion.  One thing that have been neglect I think concerning the right interpretation to give to that speech is the fact that it was a RELIGIOUS SERMON !!!  No doubt that Guscin’s interpretation is very solid when we place it in the right CONTEXT…\nAnd concerning this idea that the knowledge of the real nature of the Mandylion would have been kept hidden (by some officials of the city) for all the time the relic was present in Constantinople in order to “save” the Abgar legend for the pilgrims, it’s very important to understand that it is, again, pure speculation on the part of Wilson and it doesn’t relied on any known ancient text or artistic work…  There’s absolutely no clue at all that can be find to backed-up this idea of Wilson.  Because of that, we can easily understand that this idea came out directly of his imagination (because he needed desperately to find a way to explain why the exact nature of the Mandylion would not have been publicly known for all that time).  And with a good imagination, anyone can find a way to escape what really comes up in the Byzantine manuscripts concerning the Mandylion and the Shroud, i.e. that these were 2 distinct relic of Jesus (the first being a relic of the living Christ showing only the face and the other being a sepulchral relic of the Passion and death of Christ).  Without using any speculation at all (an impossible task for those who wants to defend Wilson’s hypothesis), that’s exactly what comes up when you read the ancient Byzantine sources on the subject.\nJust one more FACT to consider :  In his account concerning the Mandylion and the Keramion (present in the Pharos Chapel while the Shroud was at the Church of Blachernes), Robert de Clari talk about a completely different version of the Abgar legend than the two versions that were written in the Narratio de Imagine Edessena (the apparition of the miraculous image was now located in Constantinople instead of Edessa !!!).  It’s highly probable that this version of the legend was what Robert de Clari was told from the local people of Constantinople (at the time, this was probably the popular form of the story of Abgar and the Mandylion).  This simple FACT show that the original Abgar legend has not been preserved very well by the leaders of Constantinople during the time the relic was kept in the city and because of that, this fact doesn’t fit well with Wilson’s speculative idea that the leaders of the city would have desperately wanted to preserved the legend in his original form for the pilgrims…  This is just a little clue from an ancient text that seem problematic versus Wilson’s idea of a hidden secret to keep the Abgar legend intact.\n\n","date":"August 3, 2012 at 11:56 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14447","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Last reply of mine to Ron and Daveb :  \nIn the end, concerning this hypothesis of Jackson, the bottom line is this (I said it yesterday, but really wants to emphasize this FACT) :  In a court room, Jackson case would surely be a loser before the begining of the trial !!!  I don’t see any advocate good enough to defend a case like that so well that it could convinced an impartial jury (not composed of Ron and Dave for sure !!!  It’s a joke of course)…\nThe fact that a case like that would be a loser for sure in a court room simply tells me to stay away and never put my trust in it.  I think the “court room simulation test” is a pretty good test to do (along with the use of the Occam rasor principle) in order to evaluate correctly (without too much preconceptions) the credibility of any hypothesis proposed concerning the Shroud…  People should use it more often.\n\n","date":"August 3, 2012 at 8:26 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14463","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"\nYannick Clément :In order to be very clear, I’ll ask my question differently : A foldmark that is not visible to the naked eye, can it really be considered a foldmark ?\nYannick you are simply mis-informed, the foldmarks are completely viewable using simple ‘raking light’ as testified by many of the STURP members even way back in 1978, no x-ray or anyother special light is required to view the many fold marks found on the Shroud. You may also want to read Wilson’s books to really understand where Wilson stands on Jackson’s fold hypothesis. This is not simply a “I think I see’ situation. Jackson et al have spent considerable time and researched this far better then most. For you to just come along and refute it as “I think I see” is simply being ignorant on your part. Can you produce any evidence that this hypothesis is nonsense, other then what you might think? As for your ‘courtroom’ scenario, I strongly suggest you are wrong. Jackson et al’s demonstration in the video is very strong ‘tangible’ evidence to his hypothesis and would not deminish in a courtroom.\nR\n\n","date":"August 6, 2012 at 4:35 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14547","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"If these foldmarks were so evident to see with the naked-eyes, why Wilson, in his 1986 paper, wrote this : “PARTICULARLY NOTABLE IS ONE FOLDMARK studied by Jackson, at position C according to his notation, which can be traced clearly in all photos, including Xray and ultra-violet, and even the comparatively primitive ones taken in 1898.”\nWhy taking time to mention that there was only one “particularly notable foldmark” easy to distinguish in all STURP photos ?  Doesn’t make sense to specify that if all foldmarks where easy to see !!!\nAnd in the end, the most important thing to note versus Jackson’s foldmarks is the FACT that the configuration of these foldmarks doesn’t indicate that the Shroud was folded in 8 equal parts (Wilson’s hypothesis concerning the Mandylion) !  Jackson’s hypothesis is not related directly to the Mandylion hypothesis but on his own little hypothesis concerning the public showing of the Shroud done in 1203-1204 (maybe the first ever public showing of the relic that showed the internal part of the cloth with the body image).  And his personal hypothesis indicate a different configuration than what Wilson have imagined for his Mandylion hypothesis.  In any way, Jackson’s foldmarks (if they really are all there on the cloth) can be taken as a confirmation of Wilson’s hypothesis concerning the Mandylion.\nAnd last but not least, I’ll say it again :  It’s evident that Jackson’s case would not stand for 2 seconds in a court room !  Way too much speculative and not enough based on solid FACTS.  As I also said before :  I don’t think a “foldmark” that take a very sensitive kind of photograph to be visible can really be called an authentic “foldmark” !!!  This idea seem very speculative in my mind.  If we cannot see a foldmark with our own eyes at one particular spot on a cloth, to me, that can only mean one thing : there is NO foldmark there !  You follow me ???\nAnyway, believe what you want, as I said : I prefer to rely on the FACT that there is absolutely no evidence of any kind of physical and/or chemical difference between the region of the face on the Shroud and the rest of the cloth.  To me, that is what I call “a scientific fact” and not just a speculative proposal.\n\n","date":"August 12, 2012 at 10:07 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14859","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"I’ll just change the end of one phrase that you can find in my comment above.  Here it is : “Why taking time to mention that there was only one “particularly notable foldmark” easy to distinguish in all STURP photos ? Doesn’t make sense to specify that if all foldmarks where really visible !!!”  I think it’s more correct that way…\n\n","date":"August 12, 2012 at 10:10 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14860","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Again Yannick you show blinders too only what you want to see or ‘read’. Wilson mentions one fold that can be seen in ALL photos, he does not mention the fact or is he speaking of the multiple folds seen under ‘RAKING LIGHT”. WHy is it I have to repeat myself here? Raking light photos! Also except for one fold not found at the chest level of the frontal image all folds can be determined, again you are misinformed. Furthermore Jacksons et al’s studies shown on the video about the ‘contraption’ possibly used in Constantinople gives a fairly good reason as to why that fold may have been rendered impossible to see at present, plus the burn marks and patches may have obscurred most of this folds markings.  AND I”LL SAY your interpretation of court room evidence is NIL, as Jackson’s evidence is viewable, approachable and repeatable. I think a jury would side with his hypothesis. Yes Yannick I’ll continue to believe in tangible evidence and not your ‘thoughts’. I see no evidence, testible or otherwise for your Milliard reaction lol.\nR\n\n","date":"August 13, 2012 at 5:59 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14871","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Your ‘insistence’ that there is no physical or chemical difference between the face region and the rest of the cloth shows your simple lack of reason. Has anyone or was anyone looking for this difference, EVER whilst studying the relic first hand? Is there not several reasons one can “think of” that could deminish any difference, assuming ofcourse they was a difference. It would seem to me that you are making a huge ASSUMPTION that they should be a difference actually. Your argument on this point I find rediculous.\nR\n\n","date":"August 13, 2012 at 6:23 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14874","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Reminder: In Greek literature, the rare Greek word tetradilon is only applied to Yeshua’s sindon/rakos (= old stained/soiled fabric) and can refer to a sindon/rakos:\n– either “doubled in four” \n– or “folded four times [onto itself]”\n– and/or “4 x1” = “four times longer than wide”\nThe first translation (“doubled in four”) is definitely not the most “natural translation” as it implies not four but only three successive foldings. As such, it would be rather misleading.\nIn all likelihood, the word tetradiplon refers to a sindon/rakos four times longer than wide folded four times onto itself (not three!).\nHence both Wilson’s  and Jackson’s reconstruction should be revisited to fit with the more accurate translation.\n\n","date":"August 8, 2012 at 6:47 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14612","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"To make the contact passion relic more handable and symbolically eloquent (Yeshua as Cosmocrator), it was framed so that his face imprint displayed in Imago Clipteata fashion only appeared in “double squared” landscape mode.\n\n","date":"August 8, 2012 at 9:08 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14616","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Mystypin: Passion contact relic\n\n","date":"August 8, 2012 at 9:14 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14617","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Max, seriously, and you claim others are posting mis-information? Where do you get even the vague notion that the word tetradiplon can in any way mean “four times longer then wide”?? The word Tetra/diplon, simply means four/folded, or when translated into english ‘folded in four’, nothing else, not even ‘doubled in four’, as so often stated. Just simply ‘folded in four’. You can argue with me all you want on this, but my daughter, whom happens to live in Greece and since childhood, as studied Ancient and Koine Greek for years. One look at the word and she stated simply what it meant, with no hesitation. I tend to favour her neutral opinion on the translation.\nR\n\n","date":"August 15, 2012 at 6:27 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14976","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Correction, tetradiplon could be interpeted as ‘doubled in four’ but it is more probable, in this context, as being used in the base form of ‘folded in four’.\n\n","date":"August 15, 2012 at 10:12 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14986","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"If you want to talk about the context Ron (which is the base of any good historical research and interpretation), you should start to consider the fact that this expression is used in the context where Jesus is alive and well, during his ministry, well before his Passion and his death, and where he’s been given a cloth to wash HIS FACE.  Seriously, how in the world a context like that can be interpreted as some kind of a reference to a burial shroud of more than 4 meters long ?  It’s ludicrous.  There’s no other word to describe this biased interpretation made by Wilson and others “shroudies”…\n\n","date":"August 15, 2012 at 10:34 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14987","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Philologically speaking or stricto sensu if you prefer, the Greek word tetradiplon, refer to a sindon/rakos:\n– either “doubled in four”\n– or “folded four times [onto itself]” = folded in four [onto itself]\n– and/or “4 x1″ = “four times longer than wide”\nI wrote “doubled in four” was not a natural translation and was even misleading (cannot you read my English?). \nThe most likely/natural translations are  “folded four times [onto itself]” or “folded in four [onto itself]”, I do agree. Too bad you (or you daughter) didn’t even notice the two phrases strictly does have  the same meaning! \nHowever when referring to a cloth “four times longer than wide” as the Turin Shroud, the meaning “4 x 1” JUST CANNOT be totally ruled out (not even by your daughter!) as it might well have been the way a weaver could then have referred  to the long linen cloth.\n\n","date":"August 15, 2012 at 10:44 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14989","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Ron, I cannot help thinking you just miss my real point: \nThe non natural and misleading translation “doubled in four” implies THREE successive foldings whereas the more natural one “folded four times [onto itself/]folded in four [onto itself] implies FOUR successive foldings. That’s a big difference when it comes to reconstruct the way the relic was kept within its casket and displayed.\n\n","date":"August 15, 2012 at 10:56 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14992","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Correction: The non natural and misleading translation “doubled in four” implies THREE successive foldings whereas the more natural one “folded four times [onto itself” implies FOUR successive foldings. That’s a big difference when it comes to reconstruct the way the relic was kept within its casket and displayed.\n\n","date":"August 15, 2012 at 11:33 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14996","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"mistyping: TETRADIPLON\n\n","date":"August 8, 2012 at 6:48 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14613","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Here’s my reply to Ron’s comments #22 and #23 :\nConcerning the FACT that Jackson’s case wouldn’t stand for 2 seconds in a court room, it’s very simply to understand and accept !!!  Here’s WHY :\n1- Jackson’s supposed foldmarks CANNOT BE DATED AT ALL !!!  And in fact, it’s quite easy to question the supposition that all the foldmarks claimed by Jackson can be dated of the same era, simply because they DON’T SHOW THE VERY SAME INTENSITY !!!  THESE DISCREPANCIES IN THE INTENSITY OF THE FOLDMARKS IS A FACT even recognized by Wilson in his 1986 paper !!!  In all logic, if these foldmarks were done at the same time, we should expect them to be more or less of the same intensity, but IT’S NOT THE CASE.  This FACT seem to indicate that some of them were done at different times in history.\n2- Jackson’s hypothesis to explain these particular foldmarks is strickly based on speculations !!!  His idea that this occurred during the public showing of the Shroud in 1203-1204 is UNIQUELY BASED ON A PERSONAL AND VERY SPECULATIVE IDEA.  The fact is this :  There’s absolutely NOTHING in ancient written (or even ancient artworks) to even suggest that the public showing of the Shroud was done the way described by Jackson in his hypothesis.  In fact, this is mainly a very questionable interpretation (that we can call “extrapolation”) of the way Robert de Clari described the Shroud he saw in the Blachernes church.  Effectively, de Clari simply states that, in this particular church, he was able to see (personal translation from French) : “The Sindon in which our Lord was enveloped and that, every Friday, would get straight up, so that we could easily see the image of Our Lord.”  This term “get straight up” can mean many things much more simple than the complex way imagined by Jackson to show the relic to the faithful !!!  In fact, it could only mean that the totality of just one part of the Sindon was held straight up in the air by some clergymen in order for the faithful to be able to see the complete image of Jesus (or maybe just the frontal image of the body) easily and distinctly.  This proposition of mine is surely the most prudent and rational way to understand the laconic description of Robert de Clari, and I’m 100% sure that the vast majority of the medieval and Byzantine scholars would agree with me on this point.  With this personal interpretation made by Jackson of an ancient text, we have, again, a perfect example of bad extrapolation, speculation and special assumption that POLLUTE the historical research concerning the Shroud.  From this example alone, it’s easy to see that Wilson is not the only one to have a great imagination “à la Dan Brown” when it’s time to try to back-up a personal idea versus the Shroud’s obscure years !!!\nThese are 2 crucial aspects of Jackson’s case and, because his case rest mainly on these 2 speculative proposal, it is OBVIOUS that it would be a loser in a court room !!!  If you cannot see this, you must be blind my friend.  You should know that the justice system hates speculations and extrapolations and prefer by far to rely on confirmed FACTS !!!  Because of that, in the case of Jackson’s hypothesis, the judge would have no other choice than to say :  NEXT CASE !!! ;-)\nAnd concerning your insistance to not see the reality versus the lack of physical and chemical differences between the region of the face on the Shroud and the rest of the cloth, I just want you to read (for the first time probably) the fact #22 that I have described in my recent paper published on the blog concerning all the problematic facts I’ve found versus the Mandylion hypothesis of Wilson.  Here’s the link to my paper : https://shroudofturin.files.wordpress.com/2012/06/clc3a9ment_questions-about-the-mandylion-hypothesis-of-wilson_2012-06-28.pdf.\nThis fact #22 as nothing to do with speculation and it is based on hard scientific analyses done in particular by Alan Adler near the end of his life.  I suggest you also to listen (for free) this presentation of Adler in which he talked briefly about the spectroscopic analysis he did that show that there was no noticeable difference of chemical content on the surface of the Shroud between the region of the face and the rest of the cloth.  If you read my fact #22, you’ll note that this spectroscopic finding made by Adler was confirm by CHEMICAL TESTS.  Also, I didn’t mention this with my fact #22 but I’m sure about the fact that there’s also no noticeable differences in STURP technical photographs (UV photos, Quad mosaic, etc.).  In fact, I’m pretty sure that the only noticeable difference in chemical make-up was found near the corners of the cloth, where the clergymen were often holding the relic during public showings !!!  And you can bet your house that if there has been any noticeable difference of physical or chemical content (whether it would be the oxidation of the linen, a more important amount of dirt and/or dust, etc.) in the region of the face, this would have been easily found by the 1973, 1978 and 2002 direct investigations made on the cloth, because this region was probably the one that was the most examined during those 3 sessions.  But unfortunatelly for Wilson (and for you), nothing came out of these investigations concerning this aspect of the question.  And seriously, do you think for one second that Jackson, who wanted so badly to back-up his hypothesis concerning the foldmarks, didn’t look carefully to find such discrepancies between the region of the face (and maybe the region of the torso) and the rest of the cloth ???  It’s evident that he looked at this aspect of the question carefully, but came up empty…  If that wouldn’t have been the case, do you seriously think that he wouldn’t have said a thing about such an important discovery ???  That’s the best PROOF that there’s no difference at all between the face and the rest of the  cloth, except probably for the regions of the corners (not just the C14 corner)…  All this is not great for Wilson’s hypothesis. \nFinally, concerning the Maillard reaction proposed by Rogers, your comment is completely off-track Ron.  Sorry to say that but it’s true.  Read the recent paper published here on the blog by Thibault Heimburger and you’ll see that : 1- There’s NOTHING in the data from STURP that can discard this hypothesis of Rogers.  And 2- On the contrary, there’s many FACTS AND OBSERVATIONS present in the STURP papers that can really seem to back-up Rogers idea that a Maillard reaction really occurred on the surface of the cloth !  Of course, that doesn’t mean that body image was formed uniquely by this chemical process, but the data from STURP really seem to indicate that a Maillard reaction can account for at least part of the image. \nTo conclude, here’s just one important FACT about the image on the Shroud that really seem to offer a perfect “match” with the Maillard reaction proposed by Rogers :  Al Adler reported that the surface of the image fibers appeared to be “CORRODED”.  And guess what ?  THIS IS EXACTLY WHAT CAN BE EXPECT OF A THIN LAYER OF CARBOHYDRATES IMPURITIES AFTER IT WOULD HAVE BEEN SUBJECTED TO A MAILLARD REACTION !!!  This is just ONE example among many.  Meditate on that for a while please…\n\n","date":"August 14, 2012 at 11:34 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14950","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Yannick wrote: “Al Adler reported that the surface of the image fibers appeared to be “CORRODED”. And guess what ? THIS IS EXACTLY WHAT CAN BE EXPECT OF A THIN LAYER OF CARBOHYDRATES IMPURITIES AFTER IT WOULD HAVE BEEN SUBJECTED TO A MAILLARD REACTION !!!”. \nA thin carbohydrate layer of impurities having been subjected to a mordanting process can also show that same type of corrosion…\n\n","date":"August 14, 2012 at 12:13 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14953","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Maybe.  I don’t know, I’m not an expert in chemistry.  The important thing to note is that the corroded aspect of an image fiber is coherent (if we can trust Rogers) with a dehydration of a thin layer of carbohydrates impurities on-top of the linen fiber, instead of an oxidation of the primary cell wall of the linen fiber.\n\n","date":"August 14, 2012 at 3:45 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14956","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Here’s one more good question for Ron : If Jackson’s foldmarks were so easy to be seen, why he never show any photograph showing them in the BBC documentary made by M. Rolfe and why, instead, he just put some cords in front the places where these foldmarks are supposedly present ???  If this is not a “suggestive kind of trick”, I don’t know what it is !!!  Honestly, when you were looking at this presentation of the foldmarks made by Jackson in that documentary, did you were able to really see these foldmarks on the replica of the Shroud that Jackson possess in his basement ????  Personally, I didn’t saw any of the foldmarks he claimed to be there (and that were “symbolized” by the cords).  When you have to used “symbolic” things like that, right off the bat, it’s shady.  And note that Whanger (for the supposed images of plants and flowers on the Shroud) and other researchers (for the supposed images of writings on the Shroud) have used the same kind of “suggestive trick” by applying drawing lines or things of that natures (Jackson used cords instead) over a picture of the Shroud in order to create a suggestion effect in the head of many viewer.  THIS IS NOT SCIENCE, SORRY !!!\n\n","date":"August 14, 2012 at 4:49 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14958","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Obviously you are not aware that the video on Youtube is not the full video. Parts have been editted! Furthermore, if you were so knowledgeable on the Shroud, as you say and believe, wouldn’t you be aware that there were raking light photos taken in 1978, which show many folds and creases?…Still don’t believe me? ask our friend Barrie Schwortz. Dr. Jackson et al. would have these photos plus many more in his possession, including the life size high definition replica you see in the video…Do you have anything like this to base your conclusions from?…I don’t think so… Your comment that you can’t see the fold marks on the replica in the video is just unbelievably childish, seriously! Think! How possibly would you expect to see them in that situation? Why do you not understand they can only be seen ‘properly’ in ‘raking light’ photos,;(For the third time), and not direct light as on the video basement scene? I think this falls into the “I can’t see it, so it must be false” category. Also, Why would Jackson make such a claim of the visible fold marks, if his claim was not true, when it could easily be checked by other Shroud scientists with access to the same photos? …Please use some sense.\nR\n\n","date":"August 15, 2012 at 6:11 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14975","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"The guy (Jackson) is doing a presentation in a documentary to back-up his weak hypothesis based on speculation.  Don’t you find it very strange that he NEVER showed these raking light photos in the documentary (or any other kind of specialized photos) that could have showed clearly the foldmarks he claimed ?  Instead, all we see is some cords put in front of the replica of the Shroud in a pure SUGGESTIVE WAY !!!  That’s not what I call a great scientific demonstration !  In my book, this is more like a tricky play in order to fool the viewer…  And if I’m right, that would certainly not be the only tricky play (used with some images of the Shroud) that would have been used to fool us !!!\nBy the way, all you said in your comment (including these raking light photos that you mentioned) doesn’t change a thing versus the 2 points I’ve made in comment #31 that show clearly why Jackson’s case would not stand for 2 seconds in a court room !  These photos (or any other specialized photos taken by STURP) are not able to tell us the age of these supposed foldmarks and also, they cannot backed-up Jackson’s imaginative hypothesis concerning the showing of the Shroud in Constantinople in 1203-1204…  These 2 crucial points in Jackson’s case (these are the cornerstone of his case actually) are resting only on pure speculation on his part and you will never change anything about that fact Ron !\n\n","date":"August 15, 2012 at 10:44 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14988","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"\nYannick Clément :If you want to talk about the context Ron (which is the base of any good historical research and interpretation), you should start to consider the fact that this expression is used in the context where Jesus is alive and well, during his ministry, well before his Passion and his death, and where he’s been given a cloth to wash HIS FACE. Seriously, how in the world a context like that can be interpreted as some kind of a reference to a burial shroud of more than 4 meters long ? It’s ludicrous. There’s no other word to describe this biased interpretation made by Wilson and others “shroudies”…\nYannick I have a feeling you have no clue to the context of the original mention of the tetradiplon or the meaning of the phrase in which it is stated. I really think you should re-read that phrase and understand that the author truly meant to say.\nR\n\n","date":"August 15, 2012 at 11:15 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14993","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Sorry typo error, last sentence should read as; I really think you should re-read that phrase and understand WHAT the author truly meant to say.\nR\n\n","date":"August 15, 2012 at 11:30 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14995","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Look at the context of the text of the Acts of Thaddeus and you’ll see that there’s no way to connect this part of the text with a burial shroud (especially when you know the horror of Jews to touch such a cloth, especially when there’s no need for this).  The action is located BEFORE the Passion !!!  What do you need to understand that the author of the text never intend to make any reference to a burial cloth !!!  It’s so evident, except for those who just want to see what they want to see I guess.\n\n","date":"August 15, 2012 at 1:01 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15005","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Yannick,\nThe word tetradiplon is only used in conjunction with the Greek words sindon AND rakos. The latter refers to an old stained or soiled piece of cloth. Etymologically speaking, the English word “rag” is derived from the Greek rakos.\nThe word rakos is consitent with e.g. both the Oviedo Sudarium and… the Turin Sindon. \nNow if the word rakos doesn’t refer to the Turin Sindon reduced to the size of a towel, how could you explain the Image of Edessa could be referred both as a mere “rakos” and an “himation”, a large  rectangular piece of cloth?\n\n","date":"August 15, 2012 at 2:10 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15007","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"The context is a legendary one NOT a real one and therefore shall not be taken at face value all the more so as their are many a variant to the legend of Abgar.\n\n","date":"August 15, 2012 at 2:18 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15008","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Mistyping: a himation\n\n","date":"August 15, 2012 at 2:32 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15009","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Shall I repeat a himation is four times longer than wide JUST LIKE the Turin Shroud (see e;g. ANCIENT GREEK & ROMAN COSTUME: it is “A long rectangular piece of material approximately 4-5 meters long and 1.2 meter wide)…\n\n","date":"August 15, 2012 at 2:40 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15010","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Max, you should know that the context of an ancien text is more important than the linguistic root of a word.  We both know that, in ancient Greek, one word could have different meaning depending on the CONTEXT !!!  Meditate on that for a while please…\n\n","date":"August 15, 2012 at 2:47 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15011","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"In the light of the word himation,the word tetradiplon applied to the words rakos and sindon referred to the Turin Sindon either folded four times on itself or as a four times longer than wide piece of cloth approximately 4-5 meter long and 1.2 meter wide or both. Period.\n\n","date":"August 15, 2012 at 2:51 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15012","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Meditate on that will you?\n\n","date":"August 15, 2012 at 2:54 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15013","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"The Image of Edessa is in turn described as a rakos tetradipon, a sindon tetradiplon and a himation. The three designations in those versions of the Angar legend  are totally consistent with the Turin Sindon and not with a small face cloth as you want us to believe. BTW can you account for a nearly squared small cloth to be qualified as tetradiplon?\n\n","date":"August 15, 2012 at 3:05 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15014","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Shall I repeat a legendary context is not as much reliable  as in a historical one.\n\n","date":"August 15, 2012 at 3:18 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15017","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Correction: Shall I repeat: a legendary context is far from being as reliable as a historical one.\n\n","date":"August 15, 2012 at 3:21 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15018","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Max say : “In the light of the word himation,the word tetradiplon applied to the words rakos and sindon referred to the Turin Sindon either folded four times on itself or as a four times longer than wide piece of cloth approximately 4-5 meter long and 1.2 meter wide or both. Period.”\nMy answer :  NO.  NOT IN THE CONTEXT OF THE ACTS OF THADDEUS WHERE THIS EXPRESSION FIRST APPEARED !  The truth is this :  the context of the story doesn’t apply at all with any idea of burial or of burial cloth or even of a very long cloth.  The only things that is said is that someone bring a cloth to Jesus (during the time of his ministry while he’s alive and well) in order to wash his face.  I repeat the key words or expressions :  “cloth”, “Jesus alive before his Passion”, “wash his face”.  Now, it’s up to you to believe that this particular textual context have something to do with a burial shroud of more than 4 meters long !!!  Max, I’m sorry but this kind of interpretation is a perfect example of a very bad extrapolation done to comfort a preconceived idea and should not have his place in any authentic historical research…  \nLast comment :  You and Ron can extrapolate all you want, you will never be able to change the textual context of the Acts of Thaddeus that I just described because this context is the REALITY (and not just some extrapolations or speculations).\n\n","date":"August 15, 2012 at 3:43 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15019","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"You should read “the context of the story doesn’t “FIT” (instead of “apply”) at all with any idea of burial or of burial cloth or even of a very long cloth”  Sorry…\n\n","date":"August 15, 2012 at 3:46 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15020","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Yannick,\nI very much doubt you ever studied Ancient Greek and are knowlegeable about Greek clothing and the way people in ancient time make use of their himation.  In ancient time people CURRENTLY used to wipe their face with part of their himation. Such is the true archeaological context in terms of Greek clothing: an archaeological context you just keep ignoring and falsify to promote  your wrong opinion as if it were a compelling fact. Are you kidding?\n\n","date":"August 15, 2012 at 4:10 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15023","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Yannick ever think with the Acts of Thaddeus, the author was just reflecting his idea of how the image he saw could possibly get on the Shroud? Or trying to describe the image? It is not the only time the image has been described as possibly  bodily fluid or (secreation) placed on the cloth.\n\n","date":"August 15, 2012 at 4:51 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15025","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"\nMax Patrick Hamon :Philologically speaking or stricto sensu if you prefer, the Greek word tetradiplon, refer to a sindon/rakos:\n– either “doubled in four”\n– or “folded four times [onto itself]” = folded in four [onto itself]\n– and/or “4 x1″ = “four times longer than wide”\nI wrote “doubled in four” was not a natural translation and was even misleading (cannot you read my English?).\nThe most likely/natural translations are “folded four times [onto itself]” or “folded in four [onto itself]“, I do agree. Too bad you (or you daughter) didn’t even notice the two phrases strictly does have the same meaning!\nHowever when referring to a cloth “four times longer than wide” as the Turin Shroud, the meaning “4 x 1″ JUST CANNOT be totally ruled out (not even by your daughter!) as it might well have been the way a weaver could then have referred to the long linen cloth.\nMax the main point was your “four times longer then wide” makes absolutely no sense or does it relate in any way to the word tetradiplon, so I don’t see how you think it cannot be ruled out! Oh and ‘doubled in four’ and ‘folded four times’ does not have the same meaning, it’s actually two distinct ways of folding. I wish I could illustrate it to you and convince you of it.\nR\n\n","date":"August 15, 2012 at 11:27 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14994","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Ron, You are both right and wrong. I wont go into the details. You can practice successive foldings by yourself with a linen cloth the size of the Turin Sindon.\nActually your daughter’s translation is totally inconsistent  with a caskect/reliquary twice larger than high with a central opening for the head to show while my translation ‘folded four times [onto itself]” is totally consistent.\nDo you agree with Jackson’s, Wilson’s reconstruction or none of them two? If so, what is your exact reconstruction?\n\n","date":"August 15, 2012 at 11:41 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14997","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Your daughter’s translation “folded in four” is OK but it implies ONLTY TWO successive foldings not FOUR….\n\n","date":"August 15, 2012 at 11:57 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15001","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Correction: Your daughter’s translation “folded in four” is OK but it implies ONLTY TWO or THREE successive foldings not FOUR….\n\n","date":"August 15, 2012 at 11:59 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15002","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Ron you wrote: “Max the main point was your “four times longer then wide” makes absolutely no sense or does it relate in any way to the word tetradiplon, so I don’t see how you think it cannot be ruled out! “.\nSorry Ron to contradict you once more but in the light of the Turin/Lirey/Constantinople sindon (that is 4 times longer than wide), the very Greek word  tetradiplon DOES MAKE SENSE in se. I also did study Ancient Greek.\n\n","date":"August 15, 2012 at 11:49 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-14999","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Tetradiplon can IN SE be used as a qualitative noun referring to a specific type of fabric.\n\n","date":"August 15, 2012 at 12:44 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15004","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"E.g. that of a himation….\n\n","date":"August 15, 2012 at 3:13 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15016","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"In The Acts of Thaddeus we can read \n        And Ananias, having gone and given the letter, was carefully looking at Christ, but was unable to fix Him in his mind. And He knew as knowing the heart, and asked to wash Himself; and a TETRADIPLON was given Him; and when He had washed Himself, He wiped His face with it. And His image having been imprinted upon the linen [sindon], ”\nThe word “tetradiplon” is used here as a qualitative noun. It can be replaced by hemation, the same word we can be read in John the Damascene’s version of the same Abgar legend.\n\n","date":"August 15, 2012 at 3:51 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15021","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Mistyping: the same word that can be read in John Damascene’s version of the same Abgar legend.\n\n","date":"August 15, 2012 at 3:54 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15022","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"You give the good reference Max.  Read that again and show me where there’s one bit of a clue that the author is talking about a burial shroud there or even a long cloth (Jesus wash only his face !)…  I think you’ll search for a very long time.  The word Tetradiplon is obviously a litterary creation of the author that refers with not much precision to the way the cloth was folded, not his length !  Starting from this text alone, there’s no way you can say what was the measurement of the cloth (sindon) that was given to Jesus.  And for the reference of Damascene, that’s right that he used a word that mean a long cloth to talk about the Image of Edessa, but again, he never give the exact length of this thing and, most importantly, the word he used cannot, in any case, be understand as any kind of a (direct or indirect) reference to a burial cloth !!!  Concerning Damascene, I really think  you should read again the fact #9 of the article I wrote to questioned Wilson’s hypothesis of the Mandylion.  The link for the article is : https://shroudofturin.files.wordpress.com/2012/06/clc3a9ment_questions-about-the-mandylion-hypothesis-of-wilson_2012-06-28.pdf\nFrom what he wrote in his manuscript De Imaginibus, it is obvious that, in Damascene’s mind, the Image of Edessa had NOTHING TO DO with the shroud of Christ or with any other burial cloths (probably smaller cloths and/or linen strips) that might have been associated with his Passion and considered also as an authentic relic.  \nI would like you to give me one rational explanation for this in the context where Wilson’s hypothesis would be correct…  I’m waiting for your explanation anxiously my friend !!!\n\n","date":"August 15, 2012 at 4:46 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15024","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"I never said any of the three authors was EXPLICITLY talking about a BURIAL cloth (cannot you read me?). \nI just said the Greek designations “rakos tetradiplon”, “tetradiplon” used in conjonction with the word “sindon” and the word “himation” used by John Damascene (a word archaeologically IMPLYING a 4-5 meter long and 1.2 meter wide) are TOTALLY consistent with a reference to the Sindon now kept in Turin and inconsistent with a nearly square small cloth as you stubbornly want us to believe against sheer common sense. \nShall I repeat, any Archaeologist or Historian worth his salt JUST CANNOT LITERALLY BELIEVE from those three versions Yeshua before his passion/when he was still alive, left a miraculous “non man made”(?!) imprint of his face by wiping the latter with a cloth !!! This is a LEGEND (with many a variant) not a historical fact!!! Get it?\nHave you ever tried to record your whole face on a nearly square small face cloth (about 55cm high and 40cm wide) folded in four/four times folded [onto itself]? Just try and see for yourself!\nBeside I already wrote more than once that BOTH You AND Wilson were wrong, cannot you read me? In all likelihood, the Edessa Image and the legend attached to it, refer not to just one but TWO face images (respectively now kept in Manoppello and Turin). \nI am STILL waiting for you to account for the fact “your” nearly square small face cloth is said to be tetradiplon?\n\n","date":"August 16, 2012 at 6:24 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15049","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Lo he contado ya hace unos días en el blog de Dan, ahora lo cuento en el mío\nhttp://lasabanaylosescepticos.blogspot.com.es/\nCualquiera que haya sido el mecanismo de formación de la imagen, natural o sobrenatural, de naturaleza física o de naturaleza química, la imagen es posible (y muy probable) que haya tenido un periodo de latencia de meses, años e incluso siglos.\nTanto los experimentos del ENEA con radiación UV (hipótesis física), como la “para mi improbable” reacción de Maillard propuesta por Rogers (hipótesis química) contemplan periodos de latencia en la aparición del COLOR.\n¿Siglos?\nIncluso la propuesta excéptica lo contempla; para el profesor de química Luigi Garlaschelli, para quien la imagen fue en principio una PINTURA, las impurezas ácidas acompañantes del pigmento ocre rojo con el que se pintó la imagen serían las responsables de la oxidación-deshidratación de las fibrillas del lino que proporcionan el color amarillo de las fibras que configuran la imagen ACTUAL, que sería muy distinta de la pictórica original.\n¿Qué cabría esperar de una imagen que hubiera tenido un periodo de latencia de siglos?\n– Una Sábana que no mostraría imagen en principio, sino sólo las manchas de sangre. \n– La cabeza y el rostro sería lo primero en ser reconocible al cabo de unos siglos en tanto el resto de la figura no sería todavía interpretable como tal figura corporal, (sólo una imagen del rostro producto del sudor y de la sangre de un Jesús vivo) aunque se iría abriendo la idea de que la gran mancha de sangre sería consecuencia de la lanzada en el costado y se relacionaría con las otras manchas de sangre de la Sábana.\n(no hay elementos de juicio para sospechar que los ojos están cerrados)\n-Las primeras interpretaciones no habrían pues relacionado la sábana con una mortaja funeraria al no ser reconocible la figura corporal, ya que sólo después del año mil, y ya en Constantinopla toda la imagen TERMINARÍA siendo visible y siendo reconocible como mortaja funeraria, la Sábana de Constantinopla.\nBajo esta óptica, una imagen latente que tardó varios siglos en empezar a ser visible y varios siglos en completarse, las contradicciones entre las diversas narraciones parecen ya no ser tales y se entendería perfectamente la evolución de la iconografía al respecto con anterioridad al 1350.\nCarlos Otal\n\n","date":"August 15, 2012 at 6:34 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15030","author":"corneliotel","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"\nMax Patrick Hamon :Correction: Your daughter’s translation “folded in four” is OK but it implies ONLTY TWO or THREE successive foldings not FOUR….\nSorry Max, but you are in error. It would definately imply four folds, and in the Acts of Thaddeus we can refer “tetradiplon” to the “sindon” as stated within the context of the phrase. Also either method of folding would show “a central opening for the head”…, I have practiced both methods and I am completely confident in my statement, thank-you…My daughter is most definately not in error here.\nR\n\n","date":"August 16, 2012 at 2:51 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15037","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Any cloths of any length can be folded in four !!!  This is completely ludicrous to think that in the particular context of the Act of Theddeus, the author intention was to make a reference to a burial Shroud of more than 4 meters long !  In the context of the text, it is much more easy to assume that the cloth in question was a much smaller linen cloth, maybe of the kind the Jews often wear on their shoulders (I don’t know the name of this cloth but I think it is related to the Jewish prayers).\nAnd the botttom line is this :  To see a reference there to a burial shroud of more than 4 meters long, you need to do a very acrobatic extrapolation that simply don’t have his place in any good historical research.  Nevertheless, Wilson was not affraid to do this and many others in order to defend at all cost his weak hypothesis.\n\n","date":"August 16, 2012 at 10:36 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15064","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"YC char de marde, IF intellectually you cannot go any further than that, you are free but PLEASE don’t you ask me to think like you for G.od sake! You are free to be wrong!\n\n","date":"August 16, 2012 at 2:37 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15078","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Ron, I do think you STILL don’t get what I really mean. Do you really understand what I mean by SUCCESSIVE FOLDINGS? \nIf a long cloth is DOUBLED IN FOUR width wise, it would left SEVEN widthwise foldmarks (not eight).\nIf it is FOLDED IN FOUR lengthwise and then with wise (or the reverse), it would imply TWO successive foldings and result in TWO central foldmarks: ONE lengthwise and ANOTHER wiidth wise and therefore would have nothing do do with both Wilson’s and Jackson’s reconstruction.\nIf it is only FOLDED IN FOUR width wise, it would imply only THREE successive foldings and results in only THREE foldmarks and therefore again has nothing do do with both Wilson’s and Jackson’s reconstruction.\nYour daughter’s translation “FOLDED IN FOUR” is totally inconsistent with the number of width wise foldmarks implied by both Wilson’s and Jackson’s reconstruction. Period.\n\n","date":"August 16, 2012 at 4:51 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15039","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"To have SEVEN regularly spaced width wise foldmarks recorded on the long cloth you need either to doubled it in four widthwise or fold it four times onto itself.\n\n","date":"August 16, 2012 at 4:55 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15040","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Exactly Max. Fold the cloth four times and yes you’ll have seven fold marks only, but you will have 8 layers of folds. My daughters translations may not correspond with Wilson’s or Dr Jackson’s proposals of eight fold marks but it is an “accurate translation” of the word tetradiplon, which in it’s basic form simply means fourfolded or fourdoubled. People can derive whatever they want from these terms, as can be seen. But if done so in this manner i.e; folded four times lengthwise (14+ ft) in the proper manner, it will represent the face of the image in a landscape fashion, as proposed the Image of Edessa or Mandylion showed. Doubled in four does not imply 8 fold marks but eight fold layers also.\n\n","date":"August 17, 2012 at 12:38 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15127","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Pure speculation that don’t find a good match in the context of the Acts of Thaddeus…  Good try.  But it will take more than that kind of speculation to convinced all the Byzantine scholars that have all rejected Wilson’s hypothesis.\n\n","date":"August 17, 2012 at 1:01 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15129","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"To FOLD IN FOUR is definitely NOT to FOLD IN EIGHT layers!\n\n","date":"August 16, 2012 at 4:59 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15041","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"The real issue here is a philological one; whether you mean to fold a cloth in four layers or in eight. It can be understood both way as the meaning involved from one language to another may vary (Ancient Greek today’s English).\n\n","date":"August 16, 2012 at 5:08 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15042","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Correction: Ancient Greek versus today’s English).\n\n","date":"August 16, 2012 at 5:09 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15043","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Do you refer to the folding process or its result?\n\n","date":"August 16, 2012 at 5:24 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15046","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Ron, do you mean FOLDED IN FOUR layers or do you mean FOLDED IN EIGHT layers? That’s the whole point here.\n\n","date":"August 16, 2012 at 5:11 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15044","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Sorry Max, missed this post earlier. I mean folding the Shroud four times to achieve eight layers. Three equal folds, then followed by final fourth fold OF the previous three. Hense giving you a doubled in four with eight layers. Hope that is clear.\nR\n\n","date":"August 17, 2012 at 4:44 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15140","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Ron, so you see tetradiplon means “folded in four” and “doubled in four” to achieve eight layers implying only THREE SUCCESSIVE FOLDINGS. This is a possible translation. \nMy own translation “four times folded [onto itself]” implies FOUR SUCCESSIVE FOLDINGS to also achieve eight layers Hence the word tetradiplon can also mean “folded in four [successive foldings]” = “four times folded [onto itself]”. This is another possible translation that implies a slightly different folding process). \nNeither one just cannot be totally ruled out.\n\n","date":"August 20, 2012 at 10:50 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15261","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Ron you wrote: “I mean folding the Shroud four times to achieve eight layers.”\nIf so you have to translate tetradiplon as “folded in four [SUCCESSIVE FOLDINGS]” = “Folded four times [onto itself] (my translation). However this does imply a slightly different folding than those of  Jackson and Wilson that BOTH only imply.THREE (and not four) SUCCESSIVE FOLDINGS.\n\n","date":"August 20, 2012 at 11:01 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15263","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"To translate tetradiplon by FOUR TIMES FOLDED [onto itself] does allow to lift off any form of ambiguity.\n\n","date":"August 16, 2012 at 5:16 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15045","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Carlito escribiste: \n“Cualquiera que haya sido el mecanismo de formación de la imagen, natural o sobrenatural, de naturaleza física o de naturaleza química, la imagen es posible (y muy probable) que haya tenido un periodo de latencia de meses, años e incluso siglos.”\nThis is no longer true in the hypothesis the tightly wrapped up corpse was subjected to a fumigation (i.e. aging through a specific purying and drying up ritual involving a heating source).\n\n","date":"August 16, 2012 at 6:32 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15051","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"The studies of Jackson et al. from STURP, backed-up by the one of Mario Latendresse, seem to prove you wrong Max about your assumption that the corpse was tightly wrapped.  From these 2 series of scientific study, It seem much more probable that the shroud was left loose over the body at the time of the formation of the image, which, by the way, agree much more with the idea of a partial burial on Friday and a comeback to the tomb on Sunday to finish the job.  It’s truly possible that there was no use of linen strips to attached the Shroud tight with the body on Friday…\n\n","date":"August 16, 2012 at 10:40 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15065","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Where do you get the idea Jackson’s hypothesis points to a loosely wrapped shroud? Have you watched the video? He demonstrates in the video quite clearly how he interprets the wrapping of the body, which includes wrapped and bound. It has already been established that they had plenty of time during the burial to accomplish this and other rituals. (Have you not studied the conclusions from the Sudarium of Oviedo studies?). I agree with Max here on most things except details such as whether the Shroud was bound ‘tightly’ or ‘sufficiently’ to hold the body and we seem to be talking along the same lines about when it comes to the folding.\nR\n\n","date":"August 19, 2012 at 12:10 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15213","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Yannick, \nIn the Second Temple period  (even in time of peace) hasty burials  were not the exception but the RULE and even as such should be completed to honor the dead. Yeshua’s burial was buried according to the custom of the Judeans and their custom is definitely NOT to leave a corpse half buried or half wrapped. PERIOD.\nAccording to my theory, the corpse was tighly wrapped up till the moment the long inner sindon get taut again through shrinking and the  body-cloth pressure loosened back and front during the purifyi,ng and drying-up ritual. \nIs it SO difficult for you to understand? Once more I tell you, you are free to ignore the Gospel Greek terminology, the Hebrew time markers, Archaeoastronmy, the mechanic return force of in-soaked ancient textiles, the Archaeology of Second Temple period funerary custom and rites, Rabbinic literature etc etc etc but this is neither good Science nor goord Archaeology but just a proof of your SELFSERVING & SPECULATIVE IGNORANCE.\n\n","date":"August 16, 2012 at 2:27 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15077","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"There’s a lot of data from STURP (no washing of the body, dirt still present on the body when he was put in the Shroud, corpse probably dry at the time he was put in the Shroud, the lack of important distorsions in the body image, especially lateral distorsions, even if there’s still minor ones in some places), and also from the most admitted Gospel’s interpretation by biblical scholars, that the burial was done in haste because of the Sabbath coming soon and that the shroud was just loosely drapped over the body (with the exception of maybe, just maybe, the feet that could have been tight up with a linen strip).  This loose way of drapping the Shroud over the body is totally logical in the context where the participants knew that they had to come back on Sunday morning to finish the burial job.  Another clue for this conclusion of a partial burial on Friday (that leads to the loose way that the Shroud was drapped over the body) come from the fact that this burial was never planned at all – the night before Jesus arrest, no disciple knew what was coming the next morning, not even Judas.  In this context, it’s evident that no follower of Jesus had already all the things needed for a “standard” burial rite when Jesus died.  And we must also consider the time lost just for Joseph of Arimatea to go to Pilatus and ask the permission to take the body…  Max, it’s funny how you seem to neglect dramatically all these data in order to comfort your own little “theory”…\n\n","date":"August 16, 2012 at 3:56 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15083","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Once again (I am overused to it!) shall I repeat you do seem not to know your stuff. \nThe American medical examiner from STURP, the late Buckling NEVER CLAIMED as a proven fact the Sindon body had not been washed at all while another medical examiner, Zubige DID CONCLUDE the body was washed (one way or another)! \nHave you ever compared the Oviedo Sudarium and Turin Sindon haematic cartography?\nThe former is heavily stained with body fluids when the latter is not so much so. CAN YOU ACCOUNT for that state of things if the corpse what not one way or another washed?\nAre you aware that starch and soap (saponaria officinalis) (detected on the Sindon) once mixed with warm alkaline water (and the corpse being subjected to a heating source such as a fumigation) is a very simple and rapid way if not to “meticulously clean up” at least to purify shed innocent blood and body on a hasty burial?\nHave you ever noticed that most if not all the biblical scholars who have/had an interest in the Turin Sindon are miraculists or arch-miraculists and currently strived their outmost to have the Gospel testimonies fit in with what THEY THINK OR IMAGINE Yeshua’s resurrection was? This is not good exegesis.\nI made an in-depth study of the Gospel Greek terminology (that e.g. of  the burial and empty tomb scenes), Yeshua’s most likely burial time frame and Second Temple period Judean burial customs, pratices and rites. This leads me to conclude there was time enough for 4-5 buriers to perform a complete specific burial (burying of the shed innocent blood of a man unfairly sentenced to death by the Sanhedrin). \nBecause  the women were not allowed to ground spices on Sabbath, SOLE was delayed the anointment ritual of the body with perfumed oil that allowed preventing bad smells on the visits during the first three (or even seven) days that immediately followed the deceased’s death. To that sole exception, ALL the other rituals were performed on the very day of Yeshua’s death. This means the women were not to anoint his naked but his tightly wrapped up body. In the Gospels, the conjugated Greek verbs entulisso, “wrapped, encircle”; eneileo, “compress, tightly wrap up” and deo, “fasten, bind” are used to describe Yeshua’s burial. That’s a literary and philological FACT you just keep ignoring to falsify the event…\nYannick that’s “funny how you seem to most dramatically and dishonestly neglect all these data AND SO MANY OTHERS (I hane not time to expose them all here) in order to just comfort your own little  “theory”…”. Are you agenda driven to falsify the Gospels?\n\n","date":"August 17, 2012 at 11:07 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15120","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Typo errors: In the Gospels, the Greek verbs entulisso, “wrap, encircle”; eneileo, “compress, tightly wrap up” and deo, “fasten, bind” are used to describe Yeshua’s burial.\n\n","date":"August 17, 2012 at 11:25 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15121","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"More typo errors: I have no time enough to expose them all here\n\n","date":"August 17, 2012 at 11:48 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15122","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"The idea of the washing of the body IS contradict by the FACT that the bloodstains came not from complete blood in liquid form but from exudates of blood clots that were humid enough to leave a mirror imprint on the cloth.  DID YOU READ MY PAPER MAX ???  THIS IS A PROVEN FACT FROM ADLER HIMSELF AND IT CONFIRMED THE HYPOTHESIS OF BARBET MADE IN THE 30S !!!  Zugibe was simply off-track on that topic…  He was not God for sure and can have made mistakes about the Shroud.  His hypothesis of a (partial) washing is just one of them.\n\n","date":"August 17, 2012 at 12:59 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15128","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Don’t bother Max, we went thru all this months ago with Yannick, his mind is set. Although I’d like him to point us to which STURP conclusion mentioned the body was dry or it was not washed. The fact the burial may have been done in haste although not that much in haste as it has been concluded they had atleast an hour to prepare the burial. Since Sudarium findings put them in the tomb by 6-6:15pm and sundown was approx 7:15-7:20pm. Furthermore there would be several people not just 2 or 3 helping in the burial. Yannick also ignores the off image blood which shows evidence the Shroud was ‘wrapped’. The only question should be; How tightly was it wrapped?\nR.\n\n","date":"August 17, 2012 at 3:43 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15133","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"I can answer all your questions Ron.  Just give me one day.  I’ll get back to you tomorrow…  And by the way, I don’t ignore the few bloodstains located outside the image, but my interpretation differ from yours…  More on that tomorrow !\n\n","date":"August 17, 2012 at 3:47 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15135","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Message for Ron (and for Max too) : The conclusion that the body was most probably dry at the time it was put inside the Shroud come from the FACT that the STURP team never found any traces of sweat on the fibers and never found any fibers cemented together at the exception of the fibers located in regions with bloodstains.  Here’s what Rogers had to say about that in his book : “No fiber in a pure image area were cemented together by any foreign material, and there were no liquid meniscus marks.  The material that resembled blood stains was quite different.  These facts seemed to eliminate any image-formation hypothesis that was based solely on the flow of a liquid into the cloth.  This also suggests that, if a body was involved in image formation, it was dry at the time the color formed.”  And this idea is totally consistent with the Gospels who report that Joseph of Arimathea had to go to Pilatus in order to ask the permission to take the body.  It’s evident that it took more than 2 minutes to make this kind of demand, which is most probably long enough for the sweat (and most of the blood flows on the skin) to dry completely while the body was still on the cross… \nAnd for the evidence concerning the lack of sweat on the body, it is quite confirmed by the experiment results obtained by Samuel Pellicori of STURP that proved that sweat on the cloth would have caused stains very similar in color to the actual body image.  So, if there would have been sweat on the body, it is obvious that this biological substance would have taken part in the image formation and would have caused a final image that would have been much more distorted laterally.  Effectively, there would have been imprints in each area of the cloth that would have been in direct contact with the body, even if this direct contact would not have last long.  Behind the knees is the best example of that because we know for a fact that there was, for a short time, a direct contact there between the body and the cloth (the few scourge marks are the proof of that) while there is no body image at all in this region.  If there would have been sweat on the body behind the knees, no doubt that the direct contact that happened there would have been enough to produce the formation of an image in that region.  But in reality, it’s not the case on the Shroud…   \nConcerning the FACT that the body wasn’t washed, this come from the conclusion of Adler that confirmed (with chemical and spectroscopic analyses) the hypothesis described by Barbet in the 1930s, i.e. that the vast majority of the bloodstains came from exudated blood clots that were humid enough on their surface to leave a mirror image on the cloth.  The simple fact that most of them are surrounded by a halo of serum visible on the UV photos taken by STURP is enough to understand that these stains didn’t came from complete blood that would have been in a liquid state at the moment of the blood transfer (like it would have been the case in Zugibe’s hypothesis). \nI know that at first sight, this idea of humid blood clots can seem to be in contradiction with the fact that the body was most probably dry at the time he was put in the Shroud, but that’s only in appearance.  Barbet had a pretty rational (and medical) solution for this apparent contradiction.  While it is a proven fact that a fresh corpse can emit water vapors (and possibly some ammoniac too), once the corpse was put in the Shroud, these vapors were probably able to humidify again the surface of the blood clots on the skin.  In the case of most injuries (especially the scourge marks), it is also possible that the blood clots that were present in their vicinity never became completely dried even a long time after death because, as Barbet’s said, it is truly possible that these injuries were infected, producing an oozing of lymph.  All this to say that the very particular kind of bloodstains on the Shroud (proven by Adler to have come from exudated blood clots) is well enough to understand that the body was NEVER WASHED before being put in the Shroud.  Liquid blood coming from a corpse that would stained a linen cloth like the Shroud (this is exactly what would have happened if Zugibe’s hypothesis was correct) would NEVER produced the same kind of bloodstains (with very well-defined borders) that we see, especially for the back part of the body where a big pressure was present !  In this case, there would have been a lot of smudge of blood where the back would have been in direct contact with the cloth.  I still have a very hard time to convince myself that, along Barbet, Bucklin, Adler, Lavoie and others, I can make this deduction very easily (even if I’m no medical expert) while at the same time, it appears that Zugibe cannot !!!  Incredible…  Let’s never forget that proposition of Zugibe for the washing of a corpse covered with dried blood clots always produce a oozing of LIQUID post-mortem blood.  Sorry but the bloodstains on the Shroud are not the result of liquid blood but come from exudated blood clots, which is a totally different kind of blood transfer that give a very different result !  For example, liquid blood staining a linen cloth will NOT produced a halo of serum around the bloodstains like we see on the Shroud but exudated blood clots that would transfer their image on the cloth, YES !!!  It’s too bad Zugibe’s hypothesis received so much press (in America mostly) because even if is idea is truly off-track regarding the reality of the Shroud, many persons still believe this, even today…  I think people in America would greatly gain to read Pierre Barbet’s book A Doctor at Calvary.\nAnd concerning the few bloodstains that we can see off the body image, it’s evident that it proves that there was, at some point, a very close contact between many parts of the body and the Shroud.  This is totally correct.  BUT…  This close contact could well have come when the enshrouded corpse was move away from the central place in the tomb (where the body was first put in the Shroud) and placed in his funeral stone tablet.  If my idea is true, this close contact would have been produce, not by linen strips tight around the body, but instead from manual compression during the short moving of the corpse inside the tomb.  Then, after the body was resting on the stone tablet, the Shroud could well have been replaced more loosely (while removing most of the crease in the cloth) over the corpse and only after that, the body image formation took place.  Note that this final loose configuration would be in total agreement with the study of Jackson, Jumper and Ercoline from STURP and also with Mario Latendresse own study.  Also, this change of configuration from a manually compressed configuration to a new loose configuration of the Shroud would explain very well the fact that there are some bloodstains outside the body image (like we see outside the right elbow and outside the right foot).  It would also explain very well the fact that there are some blood flows in the hair located each side of the face while in reality, these blood flows were located in the temple and the cheeks (see Gilbert Lavoie and Al Adler experimental result with a replica of the Shroud for more details about that).  Finally, it would also explain very well the fact that there are some scourge marks behind the knees, while there is absolutely NO body image in this region.  Final note :  some can think that since there is no sign in the bloodstains of any separation between the body and the cloth, this hypothesis of mine is surely off-track.  I would answer this by saying that this would be true if the change of configuration would have come later while the bloodstains on the Shroud would have had enough time to dry.  But that’s not the case.  In my scenario, the change of configuration (and the separation of some parts of the cloth from the body) would have happened pretty soon after the first deposit of body inside the cloth, leaving not enough time for the bloodstains to dry completely.  In this condition, we can expect that a separation of the cloth from the body would not have left any visible signs of separation and would not have broken any fibrils under the bloodstains…\nOne last thing concerning the fact that the burial was done in haste :  You seem to forget one important thing Ron !  Effectively, it’s not enough for the participant of the burial on Friday to have finish the job for the beginning of the Sabbath at sundown (approx 7:15-7:20pm as you said), they must have finish it for some time before that in order to be able to get back at their home before sundown !  You have to remember that the tomb was located OUTSIDE the city walls !!!  There’s absolutely no doubt that they should have finish their job WELL BEFORE sundown in order to be able to reach their house before that “fatidic” time !!!  In this context, most scholars will tell you that there was not any time to lose and, because of that, the burial COULD NOT HAVE BEEN COMPLETED ON FRIDAY !!!  And remember this crucial fact that I tell the other day :  this burial WAS NOT PREPARED AT ALL !!!  It was something nobody could have expected and during the execution of Jesus, nobody even knew if Pilatus would agree to give back the body to the family, which was a very rare favor for a criminal…\nSo now, I hope you’ll be open-minded enough to consider seriously all that I said here, and that you could leave your preconceived ideas on the side for a minute…  If you do this, you’ll probably conclude that there are some chances that I can be correct about these things.  All these ideas that I’ve exposed here come from a very long reflection of mine.  A very long reflection where I’ve changed my mind on numerous occasions…\n\n","date":"August 18, 2012 at 7:11 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15193","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"More correction: Because the women were not allowed to GRIND spices on Sabbath,\n\n","date":"August 17, 2012 at 5:43 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15149","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Mistyping: Because the women were not allowed to GRIND spices on Sabbath\n\n","date":"August 19, 2012 at 12:32 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15216","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"\nYannick Clément :The idea of the washing of the body IS contradict by the FACT that the bloodstains came not from complete blood in liquid form but from exudates of blood clots that were humid enough to leave a mirror imprint on the cloth. DID YOU READ MY PAPER MAX ??? THIS IS A PROVEN FACT FROM ADLER HIMSELF AND IT CONFIRMED THE HYPOTHESIS OF BARBET MADE IN THE 30S !!! Zugibe was simply off-track on that topic… He was not God for sure and can have made mistakes about the Shroud. His hypothesis of a (partial) washing is just one of them.\nZugibe’s wash hypothesis cannot be simply disregarded as easily as you like Yannick, much more so if you follow Adler’s comments. Zugibe has explained quite well how a light, maybe hasty washing of the body could cause open wounds to bleed again, and would or could cause the  humidity needed for the smaller wounds to exude liquid from the blood….Areas of the body could be missed when washing hastily, this you must realize also…So his hypothesis does not go against any findings by STURP…Also remember anyone can make mistakes, and that includes your Barbet or even Alder.\nR\n\n","date":"August 17, 2012 at 3:58 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15138","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"You don’t understand what I said…  Zugibe’s hypothesis WOULD CAUSE A LIQUID BLEEDING AND THE BLOODSTAINS ON THE CLOTH ARE NOT THE PRODUCT OF LIQUID BLOOD !  It’s like 1 + 1 = 2 !!!  If you don’t want to understand, that’s your problem.\n\n","date":"August 19, 2012 at 6:39 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15223","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Is Yannick Clément a medical examiner? NO at all! \nIs he an archaeological forensic? NO at all! \nIs he an archaeological blood pattern analyst? NOT AT ALL! \nCan he even discriminate between archaeological remoistened and archaeological non -remoistened blood? He just can’t! \nNever mind he is to give us HIS MOST INFALLIBLE analysis of nearly 2000 years’ old non-body archaeological blood patterns….  and falsify the Gospels, Science and Archaeology since all that matters is HIS OPINION (he even has got complacent friends in the Shroud world to promote them (a business executive and a technical photograph); why should he bother about being literailly, philologically, scientifically and archaeologically wrong both in his opinion and facts?\n\n","date":"August 17, 2012 at 6:25 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15152","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"+ mistyping: all that matters is HIS OPINION (he even has got complacent friends in the Shroud world to promote IT\n\n","date":"August 17, 2012 at 7:03 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15157","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Mistyping: photographer\n\n","date":"August 17, 2012 at 6:28 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15153","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"The American medical examiner from STURP, the late Buckling NEVER CLAIMED as a proven fact the Sindon body had not been washed at all. Was Adler a better medical examiner than both Buckling and Zubige? I very much doubt so.\n\n","date":"August 17, 2012 at 6:36 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15154","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"BTW, has really Adler demonstrated beyond the shadow of a doubt the body wasn’t washed  at all one way or another? Could Yannick Clément quote Adler to back this point (NO WASHING AT ALL)?\n\n","date":"August 17, 2012 at 6:45 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15156","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"There are ways and ways to hastily purify and dry-up a corpse!\n\n","date":"August 17, 2012 at 7:06 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15158","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"YC wrote: “exudates of blood clots that were humid enough to leave a mirror imprint on the cloth” [are a] “proven fact” FROM ADLER HIMSELF [that there was NO WASHING ONE WAY OR ANOTHER]”. \nAdler NEVER SAID this indicated beyond the shadow of a doubt the TSM’s body had not been washed one way or another. THIS IS JUST YOUR “YOUR OWN LITTLE INTERPRETATION” of Adler’s observation and of the way you think or imagine a corpse is supposed to be washed under normal circumstances (i.e. mainly through wiping). The fact is YOU ARE FALSIFYING BOTH BUCKLING AND ADLER’S CONCLUSIONS and totally ignoring/misunderstanding what my indirect washing theory REALLY is all about (i.e. relatively exceptional circumstances). \nMy theory excludes any form of wiping: it implies just body-cloth compression and gradual pressure release as the inner cloth got taut again trough drying up. This is totally consistent for exudates of clots being humid enough to leave their neat decals on the inside of the burial inner cloth. \nQuoting Rogers you wrote: “No fibers in a pure image area were cemented together by any foreign material, and there were no liquid meniscus marks. The material that resembled blood stains was quite different. These facts seemed to eliminate any image-formation hypothesis that was based solely on the flow of a liquid into the cloth.”\nIt does seem you CANNOT READ Rogers when he wrote: “No fibers in a pure [BODY] image area were cemented together by any foreign material, and there were no liquid meniscus marks. THE MATERIAL THAT RESEMBLED BLOD STAINS WAS QUITE DIFFERENT. “This is totally consistent with my Sindon Image formation process theory!\nMy theory is definitely NOT “based SOLELY on the flow of a liquid into the cloth” but ALSO on an external heating source and collimated mordanting. CANNOT YOU READ MY ENGLISH either?\nStill quoting Rogers, you wrote : “if a body was involved in image formation, it was dry at the time the color formed.” According to my theory the corpse was SUBECTED TO A DRING-UP RITUAL. My theory is again totally consitent with Rogers’ opinion. \nYou go even as far as contradicting yourself in two successive posts: \nYou first wrote: “exudates of blood clots that were HUMID ENOUGH to leave a mirror imprint on the cloth” and then:  “The conclusion that the body was MOST PROBALY DRY at the time it was put inside the Shroud.” And then to resolve  the WET & DRY contradiction you called Barbet in: “[because] a fresh corpse can emit water vapors (and possibly some ammoniac too), once the corpse was put in the Shroud, these vapors were probably able to humidify again the surface of the blood clots on the skin. ” Does the use of the word “PROBABLY” by Barbet (a surgeon not a true medical examiner) mean his “surgeon’s opinion is a PROVEN/COMPELLING FACT there was no (indirect) washing at all of the body? \n THIS IS NOT SERIOUS!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\nBEFORE PASSING ANY FURTHER COMMENTS ON MY POST, PLEASE MAKE SURE YOU REALLY UNDERSTAND WHAT YOU READ/WHAT I WROTE!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\nPS: Most obviously you haven’t heard either of the phrase “Shabbat walk distance” to write your crap about the burial time frame. In Jerusalem, a Shabbat walk distance is that one may not walk beyond 2,000 amot [ about a kilometer, assuming an amma is 48 centimeters] outside the city.\n\n","date":"August 19, 2012 at 10:29 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15211","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Many good points Max! Although I don’t quite understand or agree with your hypothesis of the wrapping and possible image formation, many things you have said seem to make sense and seem to pass thru Yannicks brain without any thought. He seems to do the same with me, as he ignores simple points I’ve made. His notion that a conclusion; “the body was dry is FACT”, is irresponsible…as this has NOT been confirmed, hense many discussions on the topic. Your right that in both Adler and Barbet were not forensic scientists or medical examiners,…Zugibe was and with decades of experience dealing with corpses, hense his ideas should be respected and listened to and not so easily dismissed by the likes of Yannick, whom has absolutely no experience in the matter. As for other points made in this discussion; I have, through much research also remember reading, I believe from the Talmud, that when washing a victim of violence the areas of ‘life blood’ must not be touched, but with other areas of the body there was no issue. The idea of using, say, a dampened sponge to dab the body to cleanse it is quite reasonable and not against Jewish laws. There is also the issue that apparently in the case of a burial stretching into the Sabbath ‘concessions’ were sometimes made, hense allowing the preparers leave of the law. Meaning, one or two of the people involved in the burial preparations could continue past the Sabbath commencement and could make up for this in various ways. \nMax you are also correct in the fact that Yannick seems to contradict himself many times in his writings, and shows a lack of chronological knowledge dealing with the post passion studies. I also note some of his points seem to negate or go against his insistence for a maillard reaction!\nLets’ remember some points here as to the condition of the body as it reached the tomb, it had been hanging on the cross for atleast 2 hours, it had been placed face first, slightly on the right side in front of the cross for another 45 minutes to an hour…What would the condition of the body be like after this? I would think it would be MOSTLY dry, including any sweat and covered in ground dirt, as the dirt would cling to the still damp blood covering, at the time, most all of the body. This dirt would cover most areas of the body; Where is this dirt on the cloth? They found dirt only on certain areas of the body; the foot, the nose and a single knee cap, where is the inevidibly certain dirt which covered the entire body?…One can then come to the conclusion here that the body must have been cleansed in areas not covered with life-blood. \nCan one picture them dabbing the body clean, careful not to touch any areas of life-blood, then allowing several minutes for this light dabbing to dry, whilst doing other things, before enwrapping the corpse? Therefore, leaving the body relatively clean of any dirt, sweat or blood in most areas, aswell as being only lightly damp before being enshrouded??…thoughts to this question would be appreciated.\nR\n\n","date":"August 19, 2012 at 1:32 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15217","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"CLOSE MINDED MAX !  Adler never said that there was no washing.  But you don’t need to be a goddam genious to understand that the liquid blood that was assumed by Zugibe WOULD NOT CAUSE THE SAME KIND OF PERFECTLY BORDERED STAINS WE SEE ON THE SHROUD, because they are caused by exudates from blood clots instead of complete blood in a liquid state.\nBecause anything I say to you is constantly denied and I lose my time, this is the last time I answer to your comment my dear MAX !  I have other things to do in life than to talk to a brick wall…  The same is true for Ron !\n\n","date":"August 19, 2012 at 6:45 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15225","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"YC char de mardre, You are free to stubbornly stick to your wrong opinion and pseudo proven facts and still think  others have a closed mind!\n\n","date":"August 20, 2012 at 9:04 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15249","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Yannick did you read my post? Did you not understand the NOT washing of wounds from life-blood? Areas such as the hands, side-wound and feet would not be washed. Hense any and all  traces that flowed from those areas either. The flagrum wounds are a different matter and the washing would explain the humidity (water vapour) needed for the wounds to exude!! Why is that so hard to understand? How also if there was no flowing blood do you explain the side wound traces shown to have flowed naturally to the back on the Shroud or flowed down at the feet? These flows could only have happened after the body had been placed SUPINE on the Shroud and as the Shroud was definately not used dual purpose; as in carrying the body to the tomb. Pease answer this question plus explain no dirt found on most of the image…..\nR\n\n","date":"August 20, 2012 at 12:51 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15277","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Serum stains around almost every scourge wounds come from the process called “clot retraction” and it is only possible to get this when the blood has completely dried for at least 20 minutes.  This is not coherent with a washing of the scourge wounds and a deposit of the body in the Shroud right after that.  Sorry, but this is the reality Ron.  The scourge marks on the Shroud come from exudates of blood clots that were in a “clot” form for at least 20 minutes… But if you don’t want to believe this is true, what can I do about it ?\n\n","date":"August 20, 2012 at 1:00 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15279","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Ron, pressing Yannick to reply, you wrote:\n“How also if there was no flowing blood do you explain the side wound traces shown to have flowed naturally to the back on the Shroud or flowed down at the feet? These flows could only have happened after the body had been placed SUPINE on the Shroud and as the Shroud was definately not used dual purpose; as in carrying the body to the tomb.”\nRon, It does seem you got a little mixed up here and still have a problem to correctly discriminate between blood rivulet patterns and blood mirror patterns resulting from post mortem wound on the cross, post mortem body handlings before burial (on the cross,  down the cross, on the way to the garden-tomb and inside the funerary ante-chamber both before and after wrapping up).\n\n","date":"August 20, 2012 at 1:35 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15282","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Yannick Clément currently keep rehashing the die hard received idea Rabbi Yeshua’s burial was made in haste after sunset (that is within about half an hour or so) and his shroud just draped about his body or loosely bound for the women to wash and anoint his body at the first morning hour of the first day of the Hebrew week, that is just after the Shabbat, on the third day of Yeshua’s death. (I went thru all this months ago with him but it does seem I shall repeat it once more here till he really understands). Such a view (or should I better say “preaching”) of his presupposes:\n1/Yossef Ha-Ramathayim (both a member of the Sanhedrin/Judean Supreme Court and a secret disciple of Rabbi Yeshua), waited until shqiya/sunset (18:08/18:38 p.m.) that is a minimum of 3 hours AFTER his master’s violent death on the Golgotha (at 15:04/15:34 p.m.) BEFORE he actually went to Pilate’s and ask him for Yeshua’s body and then bought a linen shroud to bury him. Are you serious? Do you really think Yossef Ha-Ramatayim would have also run the risk not to abide by Deuteronomy 21: 22-23 and wait to the very last minute for taking down himself or having Rabbi Yeshua’s body be taken down from the cross and buried?\nIt does seem YC totally overlook “one little circumstantial fact”: in the Second Temple period, any working activity was to stop at midday “on preparation day” that is on the very eve of the great Shabbat of PessaH/Passover (PessaH 4, V). How then could possibly Joseph of Aramathia have bought a shroud after sunset and before dusk on that specific day when Jerusalem weavers’ workshops, stores and shops had all been closed for more than 6-6½ hours? This is a total exegetical non sense.\nUnless one is ignorant of the ethnic milieu and thinks a Judean of the Second Temple period would have waited until sunset on “preparation day” and go and buy a shroud long after all the weaver’s workshops and linen shops had closed, this reconstruction of the event chronology is most unlikely. In all likelihood, Yossef Ha-Ramathaym had already bought a fine linen shroud for himself in anticipation of his own death and used it to wrap Yeshua’s body “with his shed innocent blood”. As a disciple of Yeshua, didn’t Yossef go as far as using his own recently hewn garden-tomb near-by to bury his master executed as a criminal and thus to both abide by Sanhedrin 6: 46b and spare some precious time to proceed to his burial?\n[Precision: the women bought the spices not just BEFORE but just AFTER the sabbatical rest. Mark (16: 1) raises the ambiguity which could result from the chronologically biased relation/presentation of the same fact in Luke (23: 56).]\n2/ Modern time markers such as ‘evening’, ‘sunset’, ‘twilight dusk’ philologically cover the same realities for a Judean of the Second Temple period. Far from it!\nWith respect to the time frame for Yeshua’s burial, here are the ancient biblical Hebrew words & expressions for the time markers from noon to night used in the Second Temple period yet currently overlooked by Shroud researchers/old students and exegetes:\na/Tsot ha-yom (or “midday”) refers to that time of the day at equal distance between sunset and sunrise.\nb/Tsohorayim (dual form of Tsohar, “dazzling light” or “zenith”) literally means “two dazzling lights” or “two zeniths” and refers to ‘both morning and evening lights’ merging into ‘noon’.\nc/Erev (“evening”) may indifferently refer to the 1st or the 2nd evening. Rabbi Yeshua died exactly between the first and the second evening (at the 9th hour).\nd/Beyn ha-arbayim literally means “between the two evenings,” —- arbayim being the dual form of erev, “evening.” The afternoon was divided into two halves: from noon to mid afternoon and from mid afternoon to sunset or put in other words from early to late evening (See Exodus 29:38-41, “They shall slaughter it [the paschal lamb]… beyn ha-arbayim”). For the covenant people, the entire day revolved around the offering of the two Tamid lambs: that of the morning and that of the evening. “In a paper entitled « En Vue de la Solution Archéologique de l’Énigme » I presented in Turin in 1998, I wrote: « Le deuxième sacrifice quotidien du Temple (Numbers 28: 4-8) dit sacrifice du “soir” (evening sacrifice) se déroulait vers le milieu de l’après-midi (mid afternoon) et pouvait être avancé d’une heure (une veille de Pâque) voire même de deux heures (lorsque cette grande fête tombait un Shabbat) (PessaH 5:1). le premier sacrifice avait lieu le matin. Ainsi “le premier soir” allait-il du milieu du jour (from midday) jusqu’à la deuxième immolation en milieu d’après-midi (until mid afternoon) et, « le deuxième soir », de la deuxième immolation du milieu d’après-midi (from mid afternoon) jusqu’au crépuscule du soir (until twilight/dusk)».”\ne/Shqiya, “sunset”; the sun set at 18:38 p.m. on April 7th 30CE and 18:08 p.m. on April 3rd 33 CE.\nf/Beyn ha-shemashot which literally means “between the suns” is an expression for “dusk” or “twilight” between the setting sun and the rising moon (which reflects the light of the sun).\ng/Layla, “night”; typically layla is taken to be when you can see three stars in the sky in reference to tset ha-kokhavim, the first “three stars coming out” to announce a new day (here the great Shabbat of PessaH). The 3rd star respectively appeared at 19:38 p.m. on April 7th 30CE and19:08 p.m. on April 3rd 33 CE. Owing to a lunar eclipse or the Ruah Qadīm, “east wind” (Khamsin/Sharav); a wind blowing from the desert of Judea, the whole city of Jerusalem was plunged into darkness from tsohorayim (“noon”) to beyn ha-arbayim (“between the two evenings” that is the 9th hour of the day; 15.34 p.m. on April 7 30 CE/ 15.04 p.m. on April 3 33 CE). In other words, for 3h34/3h04, on the very day Rabbi Yeshua died on the cross, it was also night, “layla” on that very day in the eye of a Judean of the Second Temple period.\nHence, the actual maximum time-frame for Rabbi Yeshua’s burial was 4h04. If we now take off 30-45mn to Pilate’s and back + 30-45mn to take down Yeshua’s body from the cross and carry it to the garden tomb near-by, we are left with a minimum time-frame of about 2h30. It totally rules out the pseudo “0h30” left for Yeshua’s burial time-frame burial as the very notions of ‘evening’, ‘sunset’ ‘twilight dusk’ and ‘night’ as time markers, do not philologically cover the same realities for a Judean as they do for a 20th-21st reader relatively or totally unfamiliar with the Judean ethnic milieu of the Second Temple period.\nWithin a minimum of 2h30, Rabbi Yeshua’s 4-5 buriers had enough time to pre-wash his body (i.e. to re-dampen most of his wounds – to the sole exception of those likely to flow so as to keep his blood with his body as much as possible), purify his shed innocent blood via his lengthy inner shroud (Gr. sindôn/Heb. sadin) soaked with alkaline waters and tightly wrap it up, with resh aromatic, medical insect repellent plants and floral heads (Gr. aromaton), in linen clothes and strips (most likely the fresh spices were laterally placed on the shroud and then compressed through wrapping against Rabbi Yeshua’s naked body.)\nIn the Judean ethnic milieu of the time, the tradition was to visit the deceased on the three (or even seven) days immediately following his burial. Anointment was part and parcel of the Judean burial rite as it allowed preventing stench on those subsequent visits. Because this part of the rite was not done, the women had to buy and prepare spicy oils to anoint Rabbi Yeshua after the Sabbath and come back to the tomb very early on the third day. They definitely had not to wash the deceased’s naked body at all but just to anoint his tightly wrapped-up. Hence, to the sole exception of the anointment ritual, Rabbi Yeshua’s “primary” burial rite according to the Judean funerary custom of the Second Temple period might well have been duly completed within a minimum of a\ntwo-hours-and-a-half time-frame.\n\n","date":"August 19, 2012 at 12:16 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15214","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Mistyping: They definitely had not to wash the deceased’s naked body at all but just to anoint  the linen wrappings  he was tightly wrapped-up in.\n\n","date":"August 19, 2012 at 12:25 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15215","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"One last question to all the fanatic of Zugibe partial washing hypothesis :  It is a fact that a washing like Zugibe proposed would caused an oozing of LIQUID BLOOD.  In this context, HOW IN THE WORLD LIQUID BLOOD OOZING OUT OF MANY INJURIES (LIKE THE SCOURGE INJURIES FOR EXAMPLE) WOULD NOT CAUSE BIG SMUDGES ON A LINEN CLOTH ???  You’ll need a miracle to explain this to me in rational terms because IT IS SIMPLY IMPOSSIBLE to avoid smudges in this condition, especially FOR THE SCOURGE MARKS LOCATED IN THE BACK, where a big pressure would have been present due to the weight of the body !  If Zugibe’s was right, there would be smudges all over the back portion of the Shroud and most probably some in the frontal part too…  This is BASIC LOGIC ! \nAdler PROVED (with chemical AND spectroscopic tests) that the blood on the Shroud did not come from liquid blood but from exudated blood clots, which is VERY DIFFERENT and can explain very well why there is no smudge on the Shroud and on the contrary, why every bloodstains is very well defined !  \nIn his not-so-catholic desire to constantly contradict Barbet on everything, Zugibe completely forgot this great BASIC FACT that the bloodstains on the cloth didn’t came from liquid blood !  He also forget one important fact about most bloodstains (a fact I even forget to mention yesterday) :  The presence of halos of serum around the bloodstains !  NO WAY you would see this if Zugibe’s hypothesis was correct !  The post-mortem liquid blood assumed by Zugibe would have stained the Shroud in this form, well before the apparition of the clot retraction process (that happen between 25 and 50 minutes approx. after the oozing of the liquid blood !!!!  No way we can think that they would have washed the body, then wait at least 25 to 30 minutes and only then put the corpse inside the Shroud.  It’s evident that the washing would have been IMMEDIATELY followed by the deposit of the corpse inside the Shroud.  In this context, there would NOT HAVE BEEN ANY SERUM STAINS AROUND THE WOUNDS !!!!  This is probably the most important piece of evidence against Zugibe’s hypothesis and anyone seem to close their eyes on this (or it is simply due to ignorance maybe).\nQuestion :  Have you noticed that Zugibe, in the paper where he describe his hypothesis, NEVER make one mention concerning the presence of serum stains around the wounds and NEVER make any try to explain them ???  And did you noticed also that in this same paper, Zugibe NEVER show the result he would obtain if a great pressure (like the weight of the body) would be put on a cloth pressed on a liquid oozing from a freshly washed wound ???  What would be the result of this ???  It’s EVIDENT that the outcome of this would be a very ugly smudge on the cloth !!!!  Even a children would know the answer !!!  And if Zugibe’s hypothesis of the washing was correct, this is exactly what you would obtain : SMUDGES on the cloth with NO SERUM STAINS around the bloodstains !!!  It’s incredible that Zugibe’s never seem to have thought about that…\n\n","date":"August 19, 2012 at 7:17 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15228","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"YC wrote: “HOW IN THE WORLD LIQUID BLOOD OOZING OUT OF MANY INJURIES (LIKE THE SCOURGE INJURIES FOR EXAMPLE) WOULD NOT CAUSE BIG SMUDGES ON A LINEN CLOTH ??? You’ll need a miracle to explain this to me in rational terms because IT IS SIMPLY IMPOSSIBLE to avoid smudges in this condition, especially FOR THE SCOURGE MARKS LOCATED IN THE BACK, where a big pressure would have been present due to the weight of the body ! ”\nFirstly, there is no need of any miracle, it just needs e.g. the stiff rigid body to have been  laid ON ITS SIDE  (first on the left and then on the right side and the stiff rigid body resting in extra height on two stones/blocks of spices)! Ever thought of that? Cannot you read /haven’t you read my previous posts about my reconstruction of the TSM’s burial?\nSecondly, remoistened blood via in-soaked linen doesn’t mean liquid blood. Cannot you discriminate between remoistened freshly dried-up wounds and liquid blood?\nThirdly, I am still waiting for you to geometrically and gravitationally account for the shooting star-like shaped blood rivulet being recorded off-image on the Sindon (as if coming off from the left elbow).\nFourthly, in all likelihood the tightly wrapped-up body within its in-soaked long inner burial cloth was not washed as a 20th-21st century CE Shroud student think it should have. According to my theory, it might well have been purified via fumigation; in conjunction with warm alkaline waters, the very starch and saponine contained in the ancient linen having acted like washing agents.\nFifthly, your opinion is based on shameless self-serving and speculative ignorance of the Judean ethnic milieu, which in the most likely hypothesis the TSM is Yeshua Ha-Notsry, is totally out-of-context to say the least!\nSixthly, why don’t you write Zubige and tell him he’s totally incompetent as a medical exxaminer as far as the Turin Sindon is concerned? \nSeventhly, shall I understand that the no-wasking-one-way-or-another hypothesis is from NOW on a compelling scientific and archaeological proven fact because you decided it was so?\n\n","date":"August 20, 2012 at 7:41 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15239","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Mistyping: which in the most likely hypothesis the TSM is Yeshua Ha-Notsry’S, is totally out-of-context to say the least!\n\n","date":"August 20, 2012 at 7:51 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15241","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"++ mistyping: shall I understand that the no-wasHing-one-way-or-another hypothesis is from NOW on a compelling scientific and archaeological proven fact\n\n","date":"August 20, 2012 at 8:06 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15244","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"+ mistyping: Zugibe\n\n","date":"August 20, 2012 at 7:56 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15243","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Max, all you need to understand is that post-mortem blood in a liquid state staining a cloth (Zugibe’s hypothesis) don’t produce the well-defined borders of the bloodstains we see on the Shroud.  Barbet was very clear about that (with real experiments done to back-up his claim) that liquid blood have a strong tendency to FOLLOW THE WEAVE OF THE CLOTH.  That’s NOT what we see on the Shroud concerning the bloodstains !  In order to produce bloodstains in the shape we see them on the Shroud, you don’t need liquid blood, you need exudates from blood clots.  It’s as simple as that.  In both cases, the result is VERY different and on the Shroud, the resulting bloodstains are of the form of exudated blood clots.\nAlso, I think Max that you neglect way too much the evidence coming from the halos of serum around the bloodstains.  This result is IMPOSSIBLE if the cloth was stained by post-mortem blood that would have been still in a liquid state (like Zugibe’s hypothesis).  This is a strong indicator that he was wrong…  I don’t say he’s totally incompetent.  I just say that on this particular subject (and also on some others related to the crucifixion), I am convinced that he was wrong.  He’s a human being right ?  In that sense, it’s normal that he could have made some mistakes and bad interpretations !  I just found it strange that he didn’t take account of the presence of halos of serum around almost each bloodstains indicating that these stains were NOT formed by post-mortem blood in a liquid state (like we found in his hypothesis)…\n\n","date":"August 20, 2012 at 8:34 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15247","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"YC, \nCannot you understand the phrase “accurate recording of REMOISTENED freshly DRIED-UP wounds with serum halos by mechanic body-cloth contact-and-gradual-loss-of contact process”?\nCan you understand the word “undisturbed” and the phrase “accurate haematic decals of wounds”? \nI very much doubt so!\n\n","date":"August 20, 2012 at 9:26 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15250","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"YC are you losing it? Has all your complacently promoted comments on this blog gone to your head? Enough is enough with your pseudo facts of yours!\n\n","date":"August 20, 2012 at 7:47 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15240","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Mistyping: HAVE all your complacently promoted comments on this blog gone to your head?\n\n","date":"August 20, 2012 at 7:52 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15242","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"BTW  even if the presence of Saponaria is no longer ascertained (Rogers’ error), alkaline waters (such as the waters of the Red Heifer or malky dust stone mixed with water) used in conjunction with ancient linen starch  would more than make up for such an absence\n\n","date":"August 20, 2012 at 8:32 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15246","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Max, the presence of Saponaria was NEVER certain on the Shroud since nobody has been able yet to find traces of this product on the Shroud !!!  Rogers thought it would be a logical choice of detergent for the final washing of the cloth because he thought Pliny the Elder mentioned it (which appear to be false) and also, because this saponaria would have probably produced a weak florescence pretty much like we see on the non-image areas of the Shroud.  Nevertheless, it’s important to note that it’s not because Pliny never mentioned the use of saponaria for washing ancient cloths that this product was never used at the time !  It’s important to make this difference.  Since the use of Saponaria was confirmed to Rogers by an expert in this field (Anna Maria Donadoni, who was a conservator at the Turin Museum of Egyptology), I don’t think there’s good reason to doubt this idea.  But the question remind open :  Was it really saponaria that was used to wash the Shroud or another detergent ?  Until now, nobody can answer this question for sure.\n\n","date":"August 20, 2012 at 10:43 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15259","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"YC, I wrote “even IF”, cannot you read me again? \nThus If saponaria was used as a detergent to wash the sindon and was still present in the sindon, this would explain the reason why the buriers migh twell have soaked it with warm alkaline waters and used it as inner burial cloth to RITUALLY WASH the deceased (for the latter not to smell too much when the women would return to garden-tomb after the Shabbath and anoint his body). The presence of saponaria would be  totally consistent with a hasty ritual washing of the and burial WHETHER YOU LIKE THE IDEA OR NOT.\n\n","date":"August 20, 2012 at 11:25 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15265","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Mentioning absence, the very fact ammonia from the TSM’s stale sweat is absent on the Sindon might well account for the Sindon Image to be the result of a natural mordanting process via specific washing.\n\n","date":"August 20, 2012 at 9:00 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15248","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"YC char de madRRRRRRe, I am no fanatic of Zugibe at all. Well before the latter even emitted his hypothesis the body might well have been washed, I had started to theorise on this (as early as 1994)!\nCannot you see my theory totally differs from Zugibe’s while agreeing at the same time just on the fact theTSM was washed was one way or another? \nAgain, can you read me?\n\n","date":"August 20, 2012 at 9:45 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15251","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"…Or are you ONLY reading Zugibe to tell me my theory is wrong? Are you kidding?\n\n","date":"August 20, 2012 at 9:48 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15253","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Mistyping: YC char de mardRRRRRRRe\n\n","date":"August 20, 2012 at 9:45 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15252","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"+ mistyping: the TSM was washed  one way or another\n\n","date":"August 20, 2012 at 9:50 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15254","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Zugibe suspected the TSM had been washed one way or another but failed to tell us exactly how since he was neither a forensic archaeologist nor an archaeological blood pattern anlyst. That’s all.\n\n","date":"August 20, 2012 at 10:05 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15255","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"In my eye, Zugibe was right to suspect the TSM had been washed one way or another. Get it?\n\n","date":"August 20, 2012 at 10:12 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15256","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Mistyping: in my eyeS\n\n","date":"August 20, 2012 at 10:29 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15257","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"If you think so, you should make a bleeding transfer test on linen !!!  Cut yourself superficially on the arms (or elsewhere) and put your boby part on linen with a real pressure and see the result !  You’ll let me know if you got well-bordered bloodstains on the cloth WITH SERUM HALOS AROUND IT !!!  I expect more that you’ll get SMUDGE on the cloth without any serum stain at all.  That’s the result we would see on the Shroud if Zugibe’s hypothesis was correct.\n\n","date":"August 20, 2012 at 10:37 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15258","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"YC, MOST OBVIOUSLY you still don’t get the whole idea of the in-soaked long inner burial cloth getting taut again  through body fumigation! Nope!\n\n","date":"August 20, 2012 at 11:32 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15267","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"\nMax Patrick Hamon :Ron you wrote: “I mean folding the Shroud four times to achieve eight layers.”\nIf so you have to translate tetradiplon as “folded in four [SUCCESSIVE FOLDINGS]” = “Folded four times [onto itself] (my translation). However this does imply a slightly different folding than those of Jackson and Wilson that BOTH only imply.THREE (and not four) SUCCESSIVE FOLDINGS.\nCorrect Max. As I said earlier it soes not exactly conform to Wilson or Jackson’s fold hypothesis, as in the number and location of folds. There would be one fold unequal to the other three….Which after some thought, could explain why Jackson cannot find that one fold.\nR\n\n","date":"August 20, 2012 at 11:18 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15264","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"I just wanted to add to my last statement that the going hypothesis by Wilson and Jackson which is only a hypothesis, and no one knows ‘for sure’, exactly how the Shroud may have been folded to achieve the Mandylion or Image of Edessa portrait, but, the main issue is that it would need to be folded ‘four times’ and ‘showing the face in a landscape portrait’ to conform to the ‘tetradiplon’ description and ‘Image of Edessa’ portrayed over the centuries. There are many folds on the Shroud, (if one views the raking light photos), and some of these folds may have been deminished from subsequent folds or stretching. It is not an easy task to find the correct folds but Jackson et al, have tirelessly experimented and tested many methods in pursuing an answer, and should be respected for doing so, and not dismissed so easily by arm-chair scientists.\nR\n\n","date":"August 20, 2012 at 11:34 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15268","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Ron, I am glad we both agree on this point.\n\n","date":"August 20, 2012 at 11:28 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15266","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"With a smile :  The fact that both of you agree on something doesn’t mean that this “something” is correct or true ! ;-)\n\n","date":"August 20, 2012 at 11:51 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15270","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"YC, Don’t you be jealous! The fact you disagree on  everything doesn’t mean either that you are right on everything you disagree…\n\n","date":"August 20, 2012 at 12:12 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15273","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"No Max, but you have to admit that I ALWAYS back-up my claims with facts, observation and/or the point of view of specialists like Barbet, Adler, Rogers, etc.  I don’t throw something in the air like that on my own…\n\n","date":"August 20, 2012 at 1:02 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15280","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Yannick, I only admit that most of the time (not always) you back-up your claims with “so-called”/pseudo facts, die hard received ideas, misinterpretations and mispresentations… \nAnyway and no matter how wrong (and very rarely right) you may be, your “Candid Voice” is most needed on this blog as long as it doesn’t result in too much hypergraphic prose….\n\n","date":"August 20, 2012 at 2:01 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15285","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"I am NO arm-chair scientist (speak for yourself!), I am an archive, field & experimental professional archaeocryptologist.\n\n","date":"August 20, 2012 at 12:08 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15272","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"I didn`t mean you Max!, it was a general statement to those that oppose hypothesis with no prior knowledge or especially experience in a matter…(Yannick).\nAnd Yannick I agree with Max, the complacent acceptance of your papers by others has swelled your head and made you `closed minded and `stubborn`. The fact that Max and I agree, AND also have refutted most of your ÌDEAS` remember, certainly shows in a way that you are incorrect in your reasoning….Deal with it and answer question dealt to you…\nR\n\n","date":"August 20, 2012 at 1:10 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15281","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Ron, first of all, you’re no more expert than me !  So, don’t use this argument please.  There’s no need to be an expert to interpret the facts and observations correctly (or incorrectly).\nSecondly, my paper is good and I know it but I doesn’t changed my way of thinking and the way I can debate those who emit hypothesis which I disagree !  I’m the same Yannick before and after, you can be sure about that.  I still seek only the truth versus the Shroud.\n\n","date":"August 20, 2012 at 2:00 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15284","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"YC you wrote: “I still seek only the truth versus the Shroud.” and “There’s no need to be an expert to interpret the facts and observations correctly (or incorrectly).”\nThis doesn’t exempt you from knowing your stuff for you may be wrong in your opinion but not in your facts!\n\n","date":"August 20, 2012 at 2:26 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15286","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Concerning the Shroud, everything is a matter of making a good separation between “the wheat and the Tares” and after that, it’s a matter of making a long rational reflection on these good facts and doing a good interpretation.  Very often, the most important thing is the interpretation you do of the facts.  And this can be done by people like me who have no scientific background because, as I often say : Good rational thinking is not reserved to scientists!!!  Of course, because I’m human, I can be fooled and make some error in my interpretation.  Of course.  But if I have the feeling that my reflection is correct versus the facts, I will defend my ideas vigorously, you can be sure about that !  And if I do this, it will take new facts that I’m not aware or a very good persuasive reflection in order for me to change my mind.  But that’s not impossible.  In fact, I did it many times since the first day I’ve started to get interested in the Shroud…  So, I’m not so close-minded than you think.  But if I never changed my mind concerning particular subjects like the Mandylion hypothesis of Wilson, the foldmarks of Jackson, the washing of Jesus’ body hypothesis of Zugibe, the primary cell wall as the chromophore hypothesis of Fanti et al., the idea that the Resurrection could have left a physical trace on the Shroud, etc., it’s simply because I never heard or read new facts or a very persuasive reflection that would have been strong enough to change my opinion about these things that I judge erroneous…  Who knows ?  Maybe some new facts or some very persuasive reflection will do the job one day, but right now, I consider that I don’t have one good reason to do so.\n\n","date":"August 20, 2012 at 3:46 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15290","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"However if now we translate tetradiplon as “folded in four [equal foldings]” = “folded four times [onto itself], it still may work…\n\n","date":"August 20, 2012 at 12:04 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15271","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"= Folded in four [equal layers].\n\n","date":"August 20, 2012 at 12:22 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15274","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"…philologically as opposed to archaeologically.speaking.\n\n","date":"August 20, 2012 at 12:24 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15275","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Typo error: ≠ Folded in four [equal layers].\n\n","date":"August 20, 2012 at 12:30 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15276","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"\nYannick Clément :Ron, first of all, you’re no more expert than me ! So, don’t use this argument please. There’s no need to be an expert to interpret the facts and observations correctly (or incorrectly).\nSecondly, my paper is good and I know it but I doesn’t changed my way of thinking and the way I can debate those who emit hypothesis which I disagree ! I’m the same Yannick before and after, you can be sure about that. I still seek only the truth versus the Shroud.\nI never said I was an expert Yannick, or that one had to be to interpret facts. Read my post again (slowly) if you have to. The point was you irresponsibly refute hypothesis on a regular basis and try to get people to join your side. I have myself refutted some hypothesis but I don’t close my mind to alternatives all the same, or do I insist others believe my thoughts are the right thoughts. I just state my position on the matter. Example I may say I don’t believe the Maillard hypothesis and give my reasons for such, but I will not make comments as Thats a “I think I see” hypothesis. \nAgain in  all our discussion here you have not answered ‘properly’ any of my questions…typical.\nTwo, just so you understand; You stated Jackson’s fold hypothesis is just that, an hypothesis with no confirmation….Our is it any different then Roger’s Maillard hypothesis? It is just an hypohthesis and definately has not been confirmed…Again with the blinders.\nR\n\n","date":"August 20, 2012 at 4:02 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15291","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"You’re comical Ron.  You state something.  I react to it.  And then you act like you never said this thing I react to !  INCREDIBLE !  Here’s what you said my friend : “it was a general statement to those that oppose hypothesis with no prior knowledge or especially experience in a matter…(Yannick).”  If this is not a personal attack versus my credibility because I’m no expert, I DON’T KNOW WHAT IT IS !!!  So, my answer to you stating that it was kind of a cheap shot because you’re no more expert than me was FAIR.  Nevertheless, I don’t mind you attack me because it’s fair in a hard debate like we do.  That’s ok, I live with this, no problem.  But don’t be surprise if I reply ! ;-)\nAnd nevermind this aspect of your comment, I would like to say : forget Jackson foldmarks for a moment Ron and bring me one rational explanation for the presence of serum stains around almost each scourge marks if Zugibe’s hypothesis is correct (resulting in a oozing of fresh post-mortem blood in a liquid state after the washing).  Sorry but even if I would like to agree with Zugibe, I can’t because his hypothesis is just INCOHERENT with the presence of serum halos around each scourge marks.  Sorry but that’s the REALITY.  I’m affraid you will have to make a VERY BIG BAD HUGE AWESOME SPECIAL ASSUMPTION in order to explain the presence of these serum halos in the case Zugibe’s hypothesis would be correct…  The presence of these halos of serum just make Zugibe’s hypothesis sound false…  And also, you MUST understand that Zugibe’s hypothesis is also totally inconsisten with Adler’s conclusion that the bloodstains on the Shroud were formed by a transfer coming from exudates of blood CLOTS (not liquid blood but blood CLOTS).  How can a transfer like that coming from blood CLOTS can be coherent in the context where someone would wash a corpse with a result of removing all the blood CLOTS and producing an oozing of post-mortem liquid blood ????  Explain this to me RATIONALLY !  Zugibe’s hypothesis is just inconsistent with Adler conclusion that confirmed Barbet’s hypothesis that he made back in the 1930s !  So, it’s one or the other :  Zugibe is off-track or Adler-Barbet are off-track…  On that particular question, I choose Zugibe to be off-track for a long time now.  I think my arguments are very solid and that would be nice if you could at least take good note of them and reflect upon them for a while before your next reply to me.\n\n","date":"August 20, 2012 at 4:52 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15296","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Sorry typo error above; should read as; How is it any different from Roger’s hypothesis.\nR\n\n","date":"August 20, 2012 at 4:04 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15292","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"\nYannick Clément :Serum stains around almost every scourge wounds come from the process called “clot retraction” and it is only possible to get this when the blood has completely dried for at least 20 minutes. This is not coherent with a washing of the scourge wounds and a deposit of the body in the Shroud right after that. Sorry, but this is the reality Ron. The scourge marks on the Shroud come from exudates of blood clots that were in a “clot” form for at least 20 minutes… But if you don’t want to believe this is true, what can I do about it ?\nSee, that is what I mean about you being with ‘binders on’. The scourge wounds would have been dry for hours! The DABBING of them with a sponge, for one, would NOT make the wounds liquid, but, would add a slightly humid enviroment, which would be needed for the process to occur, as stated by Adler. It would take only minutes for the damping to dry. Furthermore, whom can state precisely that it would take a minimum of 20 minutes for the “clot retraction” to occur, seriously. Especially when one no one has a good idea of the conditions. \nR\n\n","date":"August 20, 2012 at 7:14 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15300","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"I have made research about the clot retraction phenomenon and it takes a minimum of 20 minutes after the coagulation before it start and it can take up to 45 minutes before it start, depending on many factors !  For example, you can read about this particular phenomenon in the book of Baima Bollone (101 questions on the Shroud).  In zugibe’s hypothesis, the washing would have cause an oozing of post-mortem blood in liquid form.  No way to think they would have wait patiently for this blood to clot and then wait patiently for the clot retraction to start BEFORE putting the washed body in the shroud !  No…  In all logic (never forget the context of a burial done in haste), they would have washed rapidly the corpse and right after that, without any waiting, they would have put the corpse in the shroud !  The result of this would have been smudge all over the place because the blood would not have been completely coagulated, especially for the portion of the shroud in direct contact with the back (imagine the pressure on the oozing of liquid blood there !!!) and in this condition, you can forget any halos of serum on the cloth.  Just meditate on that Ron and you’ll understand that I’m right.  If Zugibe was right, there’s absolutely no doubt that resulting bloodstains would have been VERY different than what we see on the shroud.\n\n","date":"August 21, 2012 at 10:59 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15313","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"I don’t know why I bother. But I’ll say it again, the main wounds would NOT have been washed! So no oozing from them, due to washing anyways!! More likely it was a dabbing with a sponge, not a wiping with a wet cloth that was done. Secondly, they had plenty of time, if you understand Jewish law pertaining to burials during the sabbath, which allowed plenty of time for the body to dry, atleast reasonably, but left damp enough to allow a rise in humidity within the shroud once wrapped. It would take only several minutes for the body to be almost completely dry. Finally, I believe, what you think may be “in all logic” is not logic at all…Contemplate that please.\nR\n\n","date":"August 21, 2012 at 10:01 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15336","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Ron, besides saying the same old song that I’m not logical and things like that, why don’t you give me a scientific explanation for the presence of serum stains around the scourge wounds if they were washed like Zugibe claim they were ?!?\n\n","date":"August 22, 2012 at 8:30 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15348","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"With this message, I would like to give you a translation in English of one important quote that we can find in Pierre Barbet’s book and that help to understand even more how Zugibe is off-track with his hypothesis of a partial washing of the body (especially concerning the scourge wounds), which would have produce a removing of the blood clots over the wounds and an oozing of liquid (post-mortem) blood.  In Zugibe’s mind, this is this oozing of liquid blood that would have formed the bloodstains we see on the Shroud for these washed areas.  Here’s this important quote of Barbet :\n“Everyone who got some experience in that matter knows that a bloodstain (liquid) done on a cloth doesn’t stay immutable, even more when the cloth is not sized. On a compress, in a surgery room, we see a drop of blood diffuse rapidly. The stain grows larger while it soaks the cloth, but it happen faster in some directions, following the threads of the cloth.  For example, if the weave is simple, like it normally is, we see developing around a central zone more or less round, four little lengthening following the weft and warp weaving, drawing a little red cross.  This IRREGULAR AND DIRECTED diffusion (note : Barbet has underlined these words) his even more evident when the thread his absorbent. And we already saw that the linen thread of the Shroud, which is coarsely woven, is an excellent absorbing fabric.”\nThis is how an oozing of liquid (post-mortem) blood would react with a linen cloth after a vigorous washing of the wounds (Zugibe’s hypothesis).  This is the reality.  Now it is up to you to still believe that this can “fit” with what we see on the Shroud concerning the blood and serum stains that are well-defined with precise borders !!!\nStill not convinced ?  If you check out the article of Zugibe in which he exposed his hypothesis (http://www.shroud.com/zugibe2.htm), the first photo you’ll see is the result of a blood transfer test he made with a paper towel pressed gently on a oozing of blood coming out of a wound that he just have washed vigorously (with the result of removing the blood clot). It’s pretty easy to see that part of the blood has followed the pattern of the paper towel, producing an irregular and directed kind of bloodstain, just like Barbet said ! Effectively, if you look closely, you’ll noticed that there are some little lengthening that followed the irregular pattern of the paper towel, which have the appearance of little rays of blood that went outside the main bloodstain.  The result of this blood transfer is irregular and directed and do not give a bloodstain with a well-defined border like we can see on the Shroud.  This is perfectly normal because, as Barbet said, when liquid blood touch a cloth, the stain grows larger while it soaks the cloth, but it happen faster in some directions, following the threads of the cloth (or in the present case, the pattern of the paper towel).  Zugibe’s test clearly shows that this kind of blood transfer is NOT the kind of blood transfer that happened on the Shroud.  And don’t forget one important detail in this test made by Zugibe :  He simply pressed the towel very gently on the oozing of blood !  THIS IS NOT AT ALL CONSISTENT WITH THE PRESSURE THAT WOULD HAVE BEEN MADE ON THE SHROUD BY THE BACK PORTION OF THE CORPSE !  No doubt that if Zugibe had applied an important pressure on the towel to simulates the weight of the corpse, the result would have been a very ugly smudge !!!  This is not at all what we see on the back of the man of the Shroud !  \nThe scourge marks have borders as perfect as the scourge marks on the front.  Only a transfer from exudates of blood clots can produce such a result and this kind of very particular blood transfer is only possible with an unwashed body…  Or if we think that they would have washed the body and then avoid to put it in the Shroud right after this operation, wait between 25 to 50 minutes in order for the bloodstain to expulse the serum and only then, put the body inside the Shroud !!!  This special assumption is so illogical that the only rational way to explain the bloodstains on the Shroud is to think of a transfer from exudates of blood clots.  And in this case, all it is needed to obtain a result like we see on the Shroud is just a bit of moisture or humidity inside the Shroud to re-humidify the surface of the clots.  And when we think that a dead body can emit water vapor, it’s not hard to know what could have produced this moisture or humidity inside the cloth !\n\n","date":"August 21, 2012 at 1:03 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15315","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Note :  The first phrase of my last paragraph refers to the scourge marks located in the region of the back.  You should read : “The scourge marks on the back have borders as perfect as the scourge marks on the front.”  That way, it’s more clear.\n\n","date":"August 21, 2012 at 1:10 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15316","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Zugibe wrote: \n“Every forensic pathologist that I consulted with, agreed that the wounds would have caused a large amount of bleeding, and the body had to be washed to account for the preciseness of the wounds. In the December 1980 issue of Medical World News, Dr. Michael Baden, a forensic pathologist and the former Chief Medical Examiner of New York City agreed that if the Shroud is genuine, the body must have been washed. He also added that if the body was washed there might be some oozing from the wounds ( 7 ).”\n7. Rhein, R.W. Jr., The Shroud of Turin: Medical Examiners Disagree, Medical World News, 21:40-50, Dec. 22, 1980\nAlthough Dr. Zugibe, Dr. Rhein and several other forensic pathologists totally do ignore the possibilty  for the corpse to have been tightly wrapped up within a long inner burial soaked with alkaline waters while resting  in extra height on two stones and  be subjected to a purifying & drying-up ritual, (the in-soaked ancient inner burial linen cloth acting as a washing medium through fumigation) THEY ALL “agreed that if the Shroud is genuine, the body must have been washed.”\n\n","date":"August 21, 2012 at 6:10 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15322","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Correction: Dr. Zugibe, Dr. Baden and several other forensic pathologists\n\n","date":"August 21, 2012 at 6:29 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15325","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Zugibe also wrote: “Rabbi Dan Cohn Sherbok of the University of Kent in England related that it was a legal obligation not only to enshroud the body but to wash and anoint it as well even on the sabbath (“Jewish Shroud of Turin”, Expository Times, 1981).”\n\n","date":"August 21, 2012 at 6:57 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15328","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"On Shabbath, it was allowed to anoint a corpse but not to grind spices to prepare perfumed oil to anoint it.\n\n","date":"August 21, 2012 at 7:01 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15329","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"He didn’t consult Pierre Barbet and Robert Bucklin…\nThe fact is this Max :  Adler’s chemical and spectroscopic results are a scientific CONFIRMATION of Barbet’s hypothesis concerning the blood transfer that was caused by exudates of blood clots.  Sorry but this hypothesis is 2000 light years away from the idea of a partial washing of the body as proposed by Zugibe !\nI know that Zugibe (especially in American Shroud circles) is like a sacred cow but he was human nonetheless !  And as a human being he could have make MISTAKES !  His hypothesis of a partial washing of the body has been proven wrong by Adler’s results.  What can I say ?  That just prove Zugibe was human when he came up with his washing hypothesis.  That’s all and we should not do a big storm with this !  Why is it so hard for you and Ron to admit that Jesus body was most probably unwashed when he was put in the Shroud ?  Why is it so hard for you and Ron to disbelieve Adler’s results ?\n\n","date":"August 22, 2012 at 8:36 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15349","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Mistyping: and been subjected to a hasty purifying & drying-up ritual\n\n","date":"August 21, 2012 at 6:16 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15323","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Reminder in the hypothesis the TS is Yeshua’s; in all likelyhood, the latter wore a tunic on his way to the Golgotha and his head was almost wrapped around with a sudarium just after he died on the croos (pre-burial head-dress).\n\n","date":"August 21, 2012 at 6:23 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15324","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"YC, I am STILL waiting for you to geometrically and gravitationally account for the shooting star-like shaped blood rivulet being recorded off-image on the Sindon (as if coming off from the left elbow)!\n\n","date":"August 21, 2012 at 6:40 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15326","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Max and Ron, I have a proposition for both of you and also for anyone interested in this question of a possible partial washing of the body.  Follow this link please and listen carefully to a presentation done by Adler in 1998 (it’s a free MP3 available to listen online) : http://shrouduniversity.com/podcasts/aladler.mp3\nNote what Adler say about his results confirming that the bloodstains on the Shroud came from exudates of blood clots.  If you could at least be convinced that his results are good, that would be a good start !  If you do, can you please ask yourself this simple question (while thinking especially about the numerous blood marks of scourging we see on the back of the man of the Shroud) :  How in the world these bloodstains (surrounded by serum halos) that come from exudates of blood clots can be consistent with Zugibe’s hypothesis of a partial washing of the body that would produce an oozing of LIQUID (post-mortem) blood from the wounds ???\nI think asking the question is already finding the answer !  It’s simply IMPOSSIBLE to keep together Adler’s results and Zugibe’s hypothesis of a partial washing of the body !  One of them MUST be WRONG !  And if we consider all the observations and facts HONESTLY and without any preconceived ideas, we are forced to admit that the one who really seem to be wrong here is Zugibe !  Meditate on that for a while please…  I hope you can finally reach the point where you will say :  Maybe what Yannick said on this topic is not so crazy after all !  Concerning this question, my only goal is to open some eyes by showing that Zugibe’s hypothesis is most probably wrong.  And if it’s true as I believe it is, that don’t mean Zugibe’s contribution to the Shroud world was totally bad !  That just mean he could have made a bad interpretation in his life on one particular topic regarding the Shroud !!!  THAT’S ALL and that’s no big deal in my mind.\n\n","date":"August 22, 2012 at 8:53 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15350","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"YC, \n  I don’t have any problem with Adler asserting “bloodstains on the Shroud came from exudates of blood clots”. This is totally consistent with MY THEORY of bloodstains on the Shroud coming from REMOISTENED freshly dried up blood clots with serum halos. I have problem with YOU. Most obviously you just don’t get MY THEORY to back your pet pseudo theory of yours (the corpse was neither enshrouded, nor washed within a minimum 2.30 hour’s burial time frame)! Are you kidding? Had the Jerusalem shops still been open and had the women had time enough to grind the spices and prepare perfume oil before Shabbath, the TS corpse could even have been anointed after the appearance of the third star if need be (to honour the dead)!\n  Shall I repeat here, Zugibe is neither a forensic archaeologist nor an archaeological blood pattern analyst? However, (even if you just cannot believe it), in case of violent and bloody death, a medical examiner worth is salt has an eye to almost immediately detect whether a corpse has been washed one way or another or totally been left unwashed/unattended. This was the whole issue here.\n\n","date":"August 22, 2012 at 9:41 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15353","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Max, I don’t understand one bit of your own hypothesis and I think the best for me would be to be able to read a paper from you were you would describe it properly in length.  But anyway, that’s not my point here.  \nWhat I want you to understand is that Zugibe’s hypothesis is TOTALLY INCONSISTENT WITH ADLER’S RESULTS.  Zugibe’s hypothesis produce blood in liquid form and that’s completely inconsistent with Adler’s conclusion that the bloodstains came from exudates of blood clots !  Read again Zugibe’s paper and he don’t talk about exudates of blood clots !  You just have to check out his transfer test to understand that his hypothesis refers to LIQUID BLOOD that would have stain the cloth after the partial washing (located mostly in the region of the scourge wounds).  I repeat : THIS IS TOTALLY INCONSISTENT WITH ADLER’S RESULTS.  On the contrary, Adler’s results are COMPLETELY CONSISTENT with Pierre Barbet hypothesis concerning the type of blood transfer (from exudates of blood clots).  Look, even Adler in his own book recognized this FACT !  Maybe you don’t know this but Adler himself wrote in his book that his results were totally consistent with Barbet’s hypothesis. \nSorry but after taking good note of Adler’s results myself and reflect upon this for a long time, I don’t see why Barbet hypothesis would not be correct regarding the blood transfer that occured on the Shroud.\nMaybe your own hypothesis his also consistent with Adler’s results but I think you will have to prove this with some experimental results of yours…\n\n","date":"August 22, 2012 at 10:45 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15360","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Forget it Max…I for one, give up! Yannick has shown that he just doesn’t LISTEN! We have given plenty of reasons for the wash hypothesis being atleast ‘probable’, yet he dismisses or ignores our specific points. He doesn’t understand we have NO issue with Adler’s work and as a matter of fact we have given a logical proposition to the origin of the humidity needed in the process of the wounds/blood stains on the Shroud as mentioned by Adler. He has not answered MANY questions we put forward, (important questions to contemplate that is) such as Where is the dirt on the entire body image?…Logic states it should be covered in dirt, but it is not. We mention dabbing a wet sponge, he talks about vigorous wiping. He makes it seem like Dr. Zugibe could not possibly be right and is human so he can make mistakes, but refers to his demi-god, Barbet, whom couldn’t possibly be wrong in anything he says or ‘thinks he sees on the shroud image’ but Yannick forgets Dr Zugibe has done thousands upon thousands of autopsies, is working with decades more advanced medical knowledge than Barbet, not to mention photoanalysis technology light-years ahead the 1930s technology. But no, according to Yannick Barbet’s hypothesis must must be right!\nR\n\n","date":"August 22, 2012 at 10:47 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15362","author":"Ron","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Ron, you NEVER show me one rational explanation for the presence of halos of serum after a washing of wounds that would produce a transfer of liquid blood on the cloth !!!  The simple fact regarding the presence of serum halos around the scourge wounds is ENOUGH to understand that Zugibe’s hypothesis is most probably incorrect, on the contrary than what you think !\nAnd concerning Barbet as my demi-God, it’s right that I have a great respect for his pioneer work concerning the Shroud and, along with Vignon, Adler and Rogers, I truly estimate that he must be regarded as one of the top 5 Shroud scientist of all-time.  I truly think he’s one person who understood the Shroud much better than most people.  BUT even if I respect him that much, I don’t think he was God, neither I think Rogers was too !  The proof is this :  I disagree with some (not a high amount but anyway!) of the things they wrote !\n\n","date":"August 22, 2012 at 10:54 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15364","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"YC, I am STILL STILL STILL waiting for you to geometrically and gravitationally account for the shooting star-like shaped blood rivulet being recorded off-image on the Sindon (as if coming off from the left elbow)!\n\n","date":"August 22, 2012 at 9:49 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15354","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"In a previous post (August 20, 2012 at 10:37 am | #136) Yannick Clément asked me to ” make a bleeding transfer test on linen !!! Cut yourself superficially on the arms (or elsewhere) and put your boby part on linen with a real pressure and see the result ! You’ll let me know if you got well-bordered bloodstains on the cloth WITH SERUM HALOS AROUND IT !!! I expect more that you’ll get SMUDGE on the cloth without any serum stain at all. That’s the result we would see on the Shroud if Zugibe’s hypothesis was correct.”\nTo which post I reply (August 20, 2012 at 11:32 am | #137)\n“YC, MOST OBVIOUSLY you still don’t get the whole idea of the in-soaked long inner burial cloth getting taut again through shrinking via body fumigation! Nope!”\nYes NOPE!\n\n","date":"August 22, 2012 at 10:00 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15355","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Effectively, I don’t understand one bit of your hypothesis…\n\n","date":"August 22, 2012 at 10:45 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15361","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"But what I know is that Barbet’s hypothesis doesn’t need huge special assumptions and great speculations in order to explain the bloodstains on the Shroud, unlike (as it seem to me) your own hypothesis !\n\n","date":"August 22, 2012 at 10:47 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15363","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"My theory is not an hypothesis.\n\n","date":"August 22, 2012 at 11:41 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15369","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"YChar de marde, IT IS SO DEAF AS THOSE WHO WILL NOT HEAR! \nI cannot help thinking your just focusing on Zugibe’s theory as it  is  one way  for you to do the work of diversion.\nThe main issue is/was: was there time enough for Yeshua’s buriers to enshroud and wash ONE WAY or ANOTHER the TSM’s stiff rigid bloody body?\nAs long as you deliberatedly ignore Hebrew time markers, Second Temple period customs, practices and rites, no wonder you WILL NOT understand!\nBTW I am STILL STILL STILL STILL STILL STILL waiting for you to geometrically and gravitationally account for the shooting star-like shaped blood rivulet being recorded off-body image on the Sindon (at right elbow level on the full length positive/negative Sindon photographs)! If you STILL CANNOT understand my question, please asked some French Canadian really fluent in both French and English (e.g. Mario La Tendresse)!\n\n","date":"August 22, 2012 at 11:35 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15367","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Mistyping: please ask\n\n","date":"August 22, 2012 at 11:37 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15368","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Question of Max : was there time enough for Yeshua’s buriers to enshroud and wash ONE WAY or ANOTHER the TSM’s stiff rigid bloody body?\nAnswer of me :  Maybe.  But that miss the point completely !  If the body would have been partially washed, Zugibe proved to us that there would have been some oozing of LIQUID BLOOD from the wounds that would have been washed.  And sorry but this is totally INCONSISTENT with what we see on the Shroud !  These bloodstains DON’T COME from blood that was in a liquid state but come from exudates of blood clots which is totally different.  THAT’S THE MAIN POINT OF OUR DISCUSSION.  And you accuse me of making diversion ?  It’s ridiculous.\n\n","date":"August 22, 2012 at 11:47 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15370","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"STILL waiting!\n\n","date":"August 22, 2012 at 11:55 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15371","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Please stop doing the work of diversion and answer my question!\n\n","date":"August 22, 2012 at 11:57 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15372","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"I re-repeat: How geometrically and gravitationally speaking do you account for the shooting star-like shaped blood rivulet being recorded off-body image on the Sindon (at right elbow level on the full length positive/negative Sindon photographs)?\n\n","date":"August 22, 2012 at 11:59 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15373","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"YC,\nNow if there was time enough to perform the core procedures (such as enshrouding AND washing; counteracting rigor mortis included), what did the 4-5 buriers do to perform such burial  procedures?\n\n","date":"August 22, 2012 at 12:15 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15374","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Anointing solely could not be performed (no more time left to buy and grind spices to prepare perfumed oil before Shabbath).\n\n","date":"August 22, 2012 at 12:22 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15375","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Yeshua’s had even forseen that his body could not be anointed on his burial see Matthew 26:12:\n“She poured this perfume on me to prepare my body for burial.” (Complete Jewish Bible version)\n\n","date":"August 22, 2012 at 12:44 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15378","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"It is apparent, the sindon and roll of myrrh and aloe were bought well beforehand by Yeshua’s two secret disciples Joseph and Nicodemus as the items might well have be for their respective own pesonal use.\n\n","date":"August 22, 2012 at 12:31 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15376","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Max, you do so many big time speculations that I’m glad I stay in my position versus the idea that the man of the Shroud wasn’t washed at all prior to be put into his shroud !  Using Occam’s rasor with honesty and clairvoyance, it’s evident that the most rational answer concerning that particular question (the answer that rely on the less special assumptions) is the one described by Barbet in the 1930s and scientifically confirmed (or at least, backed-up) by Adler near the end of his life.  For Barbet’s hypothesis to work right, no need to call for some secret disciples or some partial washing of the body or anything that seem to contradict the idea of a burial done in haste without any preparations prior to the execution, as we see it clearly in the Gospel.  I don’t know if you realize that the more you’ll use special assumptions, the more your “theory” will be regarded as highly improbable !!!  Meditate on that.  You should be old enough to know that the most simple answers are very often the right ones !  And this question of the possibility of a partial washing is a very good example of this truth.  The most simple way to see the burial of Jesus is to think that they carried his body to the tomb, then put it in a shroud (along maybe with some bags of aloes and myrrh in solid state), without any washing or annointment and then roll the stone and go home before the beginning of the Sabbath (which was also the beginning of the Passover if we follow St John).  That’s the simpliest way to see the burial of Jesus.\n\n","date":"August 22, 2012 at 1:05 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15379","author":"Yannick Clément","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"YC it does seem you cannot discriminate between SIMPLE and SIMPLISTIC!\n\n","date":"August 22, 2012 at 1:32 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15381","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Your simplistic solution cannot mask your basic ignorance of both the Judean ethnic milieu and archeaological blood pattern analysis. \nNow using Barbet as a guide could you geometrically and gravitationally account for the shooting star-like shaped blood rivulet being recorded off-body image on the Sindon (at right elbow level on the full length positive/negative Sindon photographs). \nBTW This is the FIFTH time I am asking you to answer that question. Most obviously it is hard to do and easy to judge.\n\n","date":"August 22, 2012 at 1:46 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15382","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Mistyping: the items might well have BEEN\n\n","date":"August 22, 2012 at 12:32 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15377","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Answers to Many Questions About the Fold Marks on the Shroud","post":"Max ask : “Now using Barbet as a guide could you geometrically and gravitationally account for the shooting star-like shaped blood rivulet being recorded off-body image on the Sindon (at right elbow level on the full length positive/negative Sindon photographs).”\nOf course I can !  And I already has provide you a simple answer for this particular off-body bloodstains (as long as the others off-body bloodstains on the cloth).\nRead this again Max : https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/#comment-15193\nThe most simple answer that can account for these few off-body bloodstains is a manual (and very careful) change of configuration of the Shroud between the time these bloodstains were formed on the cloth by direct contact (probably shortly after the time the body was put in the Shroud while the cloth was tightly compressed on many parts of the body like in this case, the back of the right elbow. This would have most probably happened in the central piece of the tomb where they had a place to prepared the dead and also during the short moving of the body to the stone tablet) and the time the image formation process really started (probably after the body was put in his final resting place on a stone tablet inside the tomb and the compression of the Shroud on the body was removed and the cloth was replace very loosely over the body).  That change of configuration would account for the few off-body bloodstains and it would also acount for the fact we can see some scourge marks in the back of the knees while there is no body image there.  That’s the most rational answer.  I admit this look pretty much like Gilbert Lavoie hypothesis but with one major difference :  He presume that this change of configuration was done miraculously at the moment of the Resurrection (while the body levitate in the air) while me, I assume that this change of configuration happened really fast during the partial burial and was done manually by the participants in the burial.  Of course, I also assume that all the blood transfer were done from exudates of blood clots and not from liquid blood coming from a washing of the body !\nSo far, that’s the most logical explanation I have found in my head after many hours of reflection !!!  I’m sure you disagree with me but I DON’T CARE ! ;-)\n\n","date":"August 22, 2012 at 3:51 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","id":"comment-15385","author":"Yannick Clément","site":"shroudstory"}]
