[{"title":"Two Thousand Year-Old Ointment Residue Discovered on the Shroud","post":"Like many previous claims done in recent years about the Shroud, I think it would be prudent to wait until there can be some independent confirmation of this conclusion from Boi.  What do you think ?  Am I too much paranoiac or am I just intelligent and prudent ? ;-)\n\n","date":"May 2, 2012 at 8:29 am","url":"https://shroudstory.com/2012/05/02/two-thousand-year-old-ointment-residue-discovered-on-the-shroud/","cat":"history","id":"comment-11062","author":"Yannick Clément","site":"shroudstory"},{"title":"Two Thousand Year-Old Ointment Residue Discovered on the Shroud","post":"Agree 100%.\n\n","date":"May 2, 2012 at 8:43 am","url":"https://shroudstory.com/2012/05/02/two-thousand-year-old-ointment-residue-discovered-on-the-shroud/","cat":"history","id":"comment-11063","author":"Chris","site":"shroudstory"},{"title":"Two Thousand Year-Old Ointment Residue Discovered on the Shroud","post":"There’s 2 important thing to note about this news :\nFirst, the STURP team NEVER found any oil, spices, aloes, myrrh or anything like that, even if they search very hard to see if there was still some traces of those kind of products.  I know that Baima Bollone in Italy pretend he has found traces of aloes and myrrh but I don’t think he ever published his finding anywhere else than his own journal that is published by the Centro in Turin (remember that he’s a member or was a member of the Centro for a long time).  Also, I don’t think Baima Bollone’s supposed findings were exactly the same than what is reported here.  So, we have to be careful with a news like that.  In fact, here we have a good example of contradictory conclusions that can well be explained just like the contradictory conclusions between McCrone and Heller-Adler about the nature of the blood on the Shroud, i.e. it’s maybe simply caused by some errors in the methodology of one or more researcher.  \nSecondly, I’m always sceptical when I see a researcher doing those kind of extrapolations versus a finding she make and what it is supposed to mean (the interpretation).  In this case, if the researcher really found traces of ointments and oils on the Shroud (the “if” is important here), than I’m not sure that really mean automatically that Jesus was really buried with royal honors.  I think making these kind of direct links denotes some kind of bias…  It really gives some bad smell around it.  That’s what I think.  Let’s wait for the paper to have a better view of the situation.\n\n","date":"May 2, 2012 at 10:57 am","url":"https://shroudstory.com/2012/05/02/two-thousand-year-old-ointment-residue-discovered-on-the-shroud/","cat":"history","id":"comment-11064","author":"Yannick Clément","site":"shroudstory"},{"title":"Two Thousand Year-Old Ointment Residue Discovered on the Shroud","post":"I agree with you Yannick. If you have a look at the original news in Spanish http://www.larazon.es/noticia/4025-hallan-restos-de-ung-entos-y-flores-de-hace-2-000-anos-en-la-sabana-santa-de-turin once again I am afraid we have got lost in translation. Marzia Boi has found pollen grains belonging to plants used for burial ointments and not traces of ointments. I think there is a big difference.\nRegarding this news, there is something even more interesting: this news has been made published by the Archbishop`s press service and not by the organizers`.  Also, the presentation by Barbieris on future outlooks for Shroud research has been reported by the same press service.\nFor all of you who can read Spanish I would recommend you to google the Spanish press these days. Most meaningful who what where and how has this been going on. Also very promising.\n\n","date":"May 2, 2012 at 2:19 pm","url":"https://shroudstory.com/2012/05/02/two-thousand-year-old-ointment-residue-discovered-on-the-shroud/","cat":"history","id":"comment-11069","author":"Gabriel","site":"shroudstory"},{"title":"Two Thousand Year-Old Ointment Residue Discovered on the Shroud","post":"I and my husband have been at Valencia Shroud Congress and listened to Dr Marcia Boi´s presentation on the Shroud pollens on April 30, and we guess ETWN News misinterpreted what was conveyed by her lecture.\nWe apologize if we will afford wrong information because the presentation was spoken in spanish and we are portuguese, nevertheless portuguese people usually understand spanish language.\nBasically she claimed:\nGundelia Tournefortii pollens were misidentified, and actually they belong to the species Helychrisum which is an insect borne pollen.\nThe Man of the Shroud (Jesus) was buried as a king so His body was annointed with burial spices accordingly to Jewish burial customs and the body had not been washed.\nPollens were tranfered to the cloth only because they were contained in the burial ointments.\nAt the end the attendance questioned her, and my husband asked Dr. Marcia Boi if she had ever considered the possibility that flowers had been laid on the cloth, so there could be an alternative possibility for the presence of insect borne pollens.\nShe answered that Jewish burial rites precluded flowers being laid beside the corpse.\nWe think this presentation deals with several problems:\n1- Did experienced israeli botanists Professors Avinoam Danim and Uri Baruch misidentified Gundelia Tournefortii pollens on microscopic examination?\n2- What observations back up her claims?\n     It was not clearly stated that she had access to the same pollen samples israeli botanists had   observed which were collected by the late Dr. Max Frei.\n3- We utterly disagree that the Man of the Shroud was buried like a king, actually who buried him did it hastilly and surely without the honors a king should be granted.\n4- Then comes the caveat of body not beeing washed as she asserted.\nIf the body had not been washed is it logical to annoint it thoroughly?\nWould it be logical to make a «mix» of blood and ointments covering all the body surface?\nIf the body had been covered by a layer of burial oils and blood we must consider two problems:\nHow would it be possible image to be produced on the cloth, namely dorsal image, if blood halts whatever produced chemical tranformations on the cloth responsible for the image?\n  How would it be possible to observe those perfect images of  scourging injuries with a roman flagrum with defined outlines and a serum halo?\nFor Dr. Marcia Boi the presence of burial ointments is an an undisputable fact.\nHow can she be so sure if this issue is a debatable question even among sindonologists nevertheless it being a strong possibility.\nAlthough Professor Adler and Dr John Heller’s studies did not conclude for their presence onthe cloth they did not exclude it either, and Professor Pierluigi Baima Bollone detected the presence of Aloes and Myrrh onthe cloth by immunofluorescence( at a Shroud Conference in Turin 2000- we have the book with all the lectures)\n   Thats what I and my husband commented after Dr.Marcia Boi’s presentation, which although it showed images with a good quality, did not convince us on the validity of her claims.\n                                                            warmest regards\n                                                        Maria da Glória and Antero de Frias Moreira\n                                                    Centro Português de Sindonologia\n\n","date":"May 2, 2012 at 2:19 pm","url":"https://shroudstory.com/2012/05/02/two-thousand-year-old-ointment-residue-discovered-on-the-shroud/","cat":"history","id":"comment-11070","author":"Maria da Glória Gonçalves Barroso","site":"shroudstory"},{"title":"Two Thousand Year-Old Ointment Residue Discovered on the Shroud","post":"Since I’m almost sure that the body wasn’t washed, the idea that it would have been anointed anyway seem to be completely illogical.  And anyway, in the context of a partial burial done in haste and also, in the context of the womens getting back to the tomb on sunday morning to do an anointment, the conclusion of Boi seems to be highly unlikely at first sight, in the context of the burial of Jesus.  And I agree with Maria that Jesus was surely not buried like a king !  And also, I have spoken with Thibault Heimburger a lot about the pollen question and he tell me that it’s impossible for botanic experts to be really specific on the species of the pollens that are still stuck in the sticky tapes of Max Frei…  This question of the pollens is very controversial and personally, I choose to not take too seriously any claim in regard of the pollens.  I think it’s more prudent that way.   \nI want to say in conclusion that this news seem to me like some kind of bad Christian propaganda.  As a catholic, I don’t like to see this.  It seem to me that there’s a lot of Catholics in Europe who have some kind of “Christian” agenda…\n\n","date":"May 2, 2012 at 3:43 pm","url":"https://shroudstory.com/2012/05/02/two-thousand-year-old-ointment-residue-discovered-on-the-shroud/","cat":"history","id":"comment-11071","author":"Yannick Clément","site":"shroudstory"},{"title":"Two Thousand Year-Old Ointment Residue Discovered on the Shroud","post":"Each one of the evangelists have an anointing story, three of them occurring a few days before the Passion narrative.  Luke’s story Lk 7:36-59 has its own intent and appears to be a different incident.  However Mt 26:6-13, Mk 14:3-9, Jn 12:1-11 all have the punch line: :”What she has done was for my burial.”  This strongly suggests to me that in fact Jesus’ dead body was not in fact anointed, as otherwise why would the evangelists make a point of telling this story?. \nThe three stories all take place in Bethany.  In Matt and Mark, the story takes place in the house of Simon the Leper, “and a woman comes in with an alabaster jar of ointment”.  However in John’s story,it is in the home of Mary, Martha and Lazarus, and it is Mary who anoints him.  I see a connection here in Albert Dreisbach’s 2005 Atlanta paper where he makes strong comparisons between the resuscitation of Lazarus and the resurrection of Jesus, as if using a code to shed some light on the burial and resurrection and the wrappings of Lazarus and the burial cloths of Jesus.  \nIn any case the three stories I think support the idea that the dead body of Jesus was not annointed, as a woman had anointed him for his burial beforehand. .\n\n","date":"May 2, 2012 at 5:41 pm","url":"https://shroudstory.com/2012/05/02/two-thousand-year-old-ointment-residue-discovered-on-the-shroud/","cat":"history","id":"comment-11073","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Two Thousand Year-Old Ointment Residue Discovered on the Shroud","post":"Nice remark Dave !  All we are SURE is that the body of Jesus was taken down from the cross, then he was taken to the tomb and put into a shroud.  That’s all we can say for sure.  All the other things proposed (the washing of the body, the anointment of the body, the placing of coins over the eyes, the placing of a chinstrap, etc.) are not stated in the Gospels.  And honestly, I don’t think any of those things can be confirmed on the Shroud.  That’s what I think.  I now others think something different but I’ve never seen one real solid and scientific piece of evidence for those things.\n\n","date":"May 3, 2012 at 8:31 am","url":"https://shroudstory.com/2012/05/02/two-thousand-year-old-ointment-residue-discovered-on-the-shroud/","cat":"history","id":"comment-11090","author":"Yannick Clément","site":"shroudstory"},{"title":"Two Thousand Year-Old Ointment Residue Discovered on the Shroud","post":"i chose to believe i am a shroudie and i chose to believe its real and i trust the experts and what they have to say about it\n\n","date":"May 4, 2012 at 6:29 pm","url":"https://shroudstory.com/2012/05/02/two-thousand-year-old-ointment-residue-discovered-on-the-shroud/","cat":"history","id":"comment-11133","author":"darla mann","site":"shroudstory"}]
