[{"title":"Was Jesus Left-Handed as evidenced by the Shroud of Turin?","post":"I read somewhere that Da Vinci painted Jesus & Mary as left handed. If he was the creator of the shroud, then maybe there’s a reason why he so insisted on portraying Jesus as left handed.\nwhat was the big deal with being left handed back in those days anyway?\n\n","date":"November 18, 2008 at 4:38 am","url":"https://shroudstory.com/2008/10/02/was-jesus-left-handed-as-evidenced-by-the-shroud-of-turin/","cat":"history","id":"comment-198","author":"kujo","site":"shroudstory"},{"title":"Was Jesus Left-Handed as evidenced by the Shroud of Turin?","post":"If the image is considered to be produced by bodily contact with the inside of the shroud, then it’s reversed (like a rubber stamp), and the right hand is actually on top.\n\n","date":"February 2, 2009 at 9:28 am","url":"https://shroudstory.com/2008/10/02/was-jesus-left-handed-as-evidenced-by-the-shroud-of-turin/","cat":"history","id":"comment-259","author":"CSL","site":"shroudstory"},{"title":"Was Jesus Left-Handed as evidenced by the Shroud of Turin?","post":"There is no doubt in my mind that Jesus was left-handed.  \nThis is because I have always strongly felt the physical presence of Jesus each time I received Eucharist.  He always wraps his LEFT arm tightly around my shoulder after weekly Communion at Mass.\nI had always felt Jesus’ physical presence within and beside me since I received my First Communion at age 7.   I don’t know of other Catholics who have this experience after receiving Eucharist.\nI’m 64 and a devout Catholic.  \nI feel I’m truly blessed in Jesus revealing one of His very personal traits to me since my childhood.\nSincerely,\nJoanne Nirtaut\n\n","date":"October 25, 2011 at 12:52 am","url":"https://shroudstory.com/2008/10/02/was-jesus-left-handed-as-evidenced-by-the-shroud-of-turin/","cat":"history","id":"comment-4312","author":"Joanne Nirtaut","site":"shroudstory"},{"title":"Was Jesus Left-Handed as evidenced by the Shroud of Turin?","post":"It is safe to say, that there is & never will be an artifact that has caused so much debate ! It is indeed a one of a kind. The schroud of Turin is as far as I am concerned the real thing.\nTo me there is more in favor vs. not in favor as far as being athentic ! If such an artifact can cause such a debate, and stand out so much as far as being such a one of a kind item that it than leans towards being the ovious and that is IT IS REAL !!!! Maybe someday, some how dna could be taken from the schroud and compared with other items that are said to contain some blood of our Lord. Again, YOU have look at it as it is , a one of a kind-nothing else like it !!!! Front, and the back—-of a man—-who was whipped, crowned with a crown of thorns, Nailed to a cross, stabbed into his rib !!! The nail holes—-where they should be , especially as far as the wrist vs. the through the hand debate. The image shows, just how much agnoy was felt and just how much blood letting was experienced  ! There is no other supposed relic that shows so much detail of how our LORD suffered !!! I wonder if when the final days do come if in fact, in a phyisical sense the shroud will react and or be come some how be a phyisical sign that Christ is now about to come !!! A beacon so to speak !\n\n","date":"December 27, 2011 at 10:03 pm","url":"https://shroudstory.com/2008/10/02/was-jesus-left-handed-as-evidenced-by-the-shroud-of-turin/","cat":"history","id":"comment-6205","author":"norm kadets","site":"shroudstory"},{"title":"Was Jesus Left-Handed as evidenced by the Shroud of Turin?","post":"Faith is both simple and complecated. One  must take the side befets common understanding if he/she so wishes just for a settled mind or choose to frustrate over matters whose answers need divine involvement.\n\n","date":"April 10, 2012 at 6:46 am","url":"https://shroudstory.com/2008/10/02/was-jesus-left-handed-as-evidenced-by-the-shroud-of-turin/","cat":"history","id":"comment-10252","author":"Julius Kalisa Rwakarema","site":"shroudstory"}]
