[{"title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?","post":"Thanks for the encouragement, Mark. There have indeed been new developments in the last few days in fact, reported on another site.\nhttp://www.internationalskeptics.com/forums/showpost.php?p=11745357&postcount=191\nThanks to the “Zeke” filter provided on Windows 10, I’ve been able to reduce the three step model (imprinting/oven roasting/water washing to just 2!\nThe beauty of the Zeke filter is that it promotes texture (like adhering solid particles) above background, such that the entire history of the Shroud image is open to inspection.  I say it began as an encrustation that wasn’t washed off as initially suggested, per my site banner, but has  only PARTIALLY flaked away naturally, still leaving bags of evidence , visible (especially) with the Zeke filter (courtesy of Windows 10). \nIn short, it’s now a 2-stage model (imprinting/roasting) not 3!. \nMy ideas are being rubbished on that “skeptics” site, but the resident know-alls there would rubbish the idea that the Sun rose each morning… The important thing right now for this real time internet reporter is  to get visibility on search engines, which show a distinct bias. I have to say,  at least Stateside (e.g google.com) towards pro-authenticity claims!!\n","date":"March 8, 2017 at 5:06 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","id":"comment-8601","author":"Colin Berry","site":"colinberry"},{"title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?","post":"Please keep us informed of any new developments.  From what I’ve read here, am also leaning toward the white flour theory.  It’s really the simplest explanation…….. so far. +\n","date":"March 8, 2017 at 2:38 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","id":"comment-8598","author":"Mark O'Blazney","site":"colinberry"},{"title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?","post":"Thanks for your interest Mark. Beware — you too may find yourself becoming progressively addicted to this intriguing topic. Even as a medieval fabrication, the people who created it displayed sheer genius – all the more impressive for keeping a technology secret that has confounded modern-day scientists. The secret I believe is to fathom out what could have been added as a heat-sensitive imprinting agent (recognizing that linen is incredibly resistant to chemical and thermal change)  the non-image incorporated surplus of which  was then washed out in the final step.\nI believe the secret ingredient was white flour, but that is far too mundane a proposal for some of the people I’m talking to right now on a different site.\nYup, there’s no point adding more to this site. I discovered yesterday that while my current page 3 ranking on google.uk  (enter : shroud of turin) is now ahead of Stephen Jones’s blog, he’s on Page 3 of Stateside google.com and I’m nowhere to be seen, at least on the first 12 pages!  What chance does a private blogger have of getting his ideas across when the ‘system’ is so obviously discriminating , read bent and corrupted, against sceptics like myself, at least Stateside.?\n","date":"March 4, 2017 at 6:42 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","id":"comment-8585","author":"Colin Berry","site":"colinberry"},{"title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?","post":"My first consideration on this controversy.  Most extraordinary.  Almost three years since your last entry, Colin.  Any updates on yourself and this mind-bending topic ?\n","date":"March 4, 2017 at 10:40 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","id":"comment-8579","author":"Mark O'Blazney","site":"colinberry"},{"title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?","post":"never mind.  just found your current workings.  outstanding.  have some reading to do,  thank you very much for this.\n","date":"March 4, 2017 at 10:48 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","id":"comment-8580","author":"Mark O'Blazney","site":"colinberry"},{"title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?","post":"Also…they say at Wikipedia of the likeness on the badge: The Brass Effigy is of the son, French Knight Geoffroi de Charny II. It is presented for historical reference only since there are no known images of the father. It is said to be an authentic likeness to the father as well and the son. The Effigy translation was generously provided by author Ian Wilson. It states as follows: ‘Here lies the noble man Monsieur Geoffroy de Charny at one time seigneur of Thory, in the district of Beauvais, who died the 22nd day of the month of May 1398. Pray God for his soul.’.[8]\nThe Effigy is frequently represented elsewhere as being of the father but the translation clearly shows it is of Geoffroi II, the son.\n","date":"August 12, 2014 at 11:44 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","id":"comment-4441","author":"Saleire","site":"colinberry"},{"title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?","post":"I don’t know about you, but I find it somewhat irritating that a wiki article about Geoffroi de Charny should be accompanied by an illustration of his son, even if labelled as GDC II. The suggestion that the two looked alike (as well they might when encased in knightly armour) is neither here nor there – since it could simply mean they were both clean-shaven and had similar  hair lengths. How much can one tell from brasses and line drawings anyway?  It’s simply a source of possible confusion (of which some might think there’s enough already as regards de Charney v de Charny, which is a sore point with this blogger, having once been airily dismissed for confusing the two despite my having carefully made references to the claims for an uncle v nephew relationship).\n","date":"August 13, 2014 at 6:57 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","id":"comment-4444","author":"Colin Berry","site":"colinberry"},{"title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?","post":"Just a passing thought…I once read that Jacques de Molay was crucified on the back of a door where he was held prisoner, then, left to the point of death before he was taken down and revived….in this time, could they have wrapped him in cloth. They also say that Geoffroi de Charney who was burned at the stake was possibly the uncle of the Charney who was the first recorded owner of the ‘Turin Shroud’ ……\n","date":"August 12, 2014 at 11:37 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","id":"comment-4440","author":"Saleire","site":"colinberry"},{"title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?","post":"Yes, the “nailed on a door” scenario is the one proposed by Knight and Lomas in their ‘Second Messiah’ theory. \nIt’s an interesting idea, indeed ingenious, but I frankly don’t buy into their chemical  image theory (lactic acid, singlet oxygen etc).\nIt was Geoffroi de Charney, preceptor of Normandy, who was burned at the stake in 1314, alongside Jacques de Molay, last Grand Master of the Knights Templar. It was Geoffroi de Charny and his wife who were the first recorded owners of the TS. Note the slight difference in spelling. It was  suggested by a prominent genealogist that de Charney and de Charny were uncle and nephew respectively. The possible Templar connection opens up all kinds of possibilities apart from the one suggested by Knight and Lomas, especially if you add the evidence from Barbara Frale that the Templars were using an image of a bearded man on linen in secret initiation rituals well before the events of 1314. Pity we don’t know whether the image was painted on, or more scorch-like as per TS.\nThanks for looking in. I’ll respond to your second comment later today.\n","date":"August 13, 2014 at 5:59 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","id":"comment-4443","author":"Colin Berry","site":"colinberry"},{"title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?","post":"5th May: I submitted this post to my.telegraph.co.uk a few days back. It appeared briefly, attracted one comment, and then quickly disappeared. Yet it is still listed on Google searches that have the relevant search terms, but when one clicks, there is a message “This blog has been archived or suspended”. Yet am still able to comment on my.telegraph.\nGoogle still keeps snapshots of postings in “Cache” which remain after one’s link has gone dead. Here’s a link to my censored posting:\nhttp://webcache.googleusercontent.com/search?q=cache:AJoCsMoCw8EJ:my.telegraph.co.uk/shroudofturinwithoutallthehype/science_bod/3/a-new-theory-that-gives-a-medieval-origin-to-the-turin-shroud/+&cd=7&hl=en&ct=clnk&gl=uk&client=firefox-a\nNow why would the Telegraph not want its readers to see my theory? Answers on a postcard…\nAlternatively, I am a victim of what some suspect is a cheap and cheerful substitute for “moderation”, one that automatically deletes any posting or comment that receives more than a certain number of “Report this comment” clicks.  Others before me have suggested that this is the way it works on the Telegraph (and no, it’s not Disqus that makes all the decisions, contrary to popular belief). \nA robot system that responds merely to numbers of Report clicks is to my mind not fit for purpose. That should be self-evident, but is especially the case because the Disqus system does contribute through allowing those who report a comment to give no reason ( and preventing those who do wish to give a reason). This makes it easy for organized lobbies and pressure groups to target those who are perceived as “the enemy” and get their postings and comments deleted.  It is what’s called “astroturfing” – pretending to be grassroots opinion.  In other words the DT/Disqus ‘report comment’  system is totally dumb and open to manipulation  – resulting in mindless- yes, literally mindless, deletions, while at the same time leaving a marker on Google that one’s work has been deemed dodgy for some reason or other that is not specified. It really is time that the Telegraph and Disqus got together and worked out a more sensible way of policing my.telegraph and other DT forums. There are other issues too, which I shall not go into now, but would be happy to disquss if invited to do so.\n","date":"May 5, 2012 at 8:31 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","id":"comment-258","author":"colinsberry","site":"colinberry"},{"title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?","post":"There are various opinions and researches of the shroud of Turin. Some people say that it is the genuine and some that it is the fake and the hoax. The fact is that the shroud of Turin doesn’t present Jesus of the Bible. If we can find even one evidence, which disprove the shroud of Turin theory, so the whole story shall be invalidated. We can find a large number of evidence from the Bible, which show that the shroud of Turin cannot be the shroud of the Lord Jesus.\nSource of the text; http://koti.phnet.fi/petripaavola/shroudofturin.html\n","date":"April 29, 2012 at 5:12 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","id":"comment-232","author":"lovetar","site":"colinberry"},{"title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?","post":"Thanks lovetar. Have just had a quick look at that link of yours. It confirms some of my suspicions that the Shroud’s details depart somewhat from the biblical account. I’m  especially intrigued by the suggestion that an expensive linen cloth would only have been used to cover the body en route to the sepulchre, and not left there.\n","date":"April 29, 2012 at 6:17 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","id":"comment-233","author":"colinsberry","site":"colinberry"},{"title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?","post":"Here is a comment from R on Dan Porter’s site from someone who clearly has not read what I wrote, and has simply used Dan Porter’s negative spin-doctor’s summary as a guide to what I said.\n“Colin’s mis-interpretation of many of the symbols seen on this metal just goes to show my several previous comments that maybe a new pair of glasses are warranted is correct 😉\nBlood stains turn to chains, firm body features turn to armour, etc; etc; yet clues such as herringbone weave, the naked body, the flagrum, the nails, the tomb seem to disappear in his analysis.\nIt has been stated that the medalion was most evidentally created whilst de Charny was still alive and as the Lirey expositions were ongoing, this conclusion comes from the depiction of the coat of arms and their ‘specific’ positioning. This was covered in detail in Wilson’s latest book The Turin Shroud and backed by others. So the medallion would be pre-1356. Medallions were common place among pilgrims in the middle ages and apparently it was good luck to toss them into waters, hense the finding of this medalion in the siene river.”\nJust that reference to “blood stains turn to chains” should be sufficient to show that someone has not bothered to do his homework. If anything, it is the other way round – that what was originally portrayed as a chain around the waist has been turned into blood stains.  Why? because the “chain” on the Lirey badge is not just around the waist – it is seen to extend from both sides of the body. Given that it would be difficult if not impossible to bleach or otherwise erase what I believe is a heat scorch, that would suggest to me that the original Shroud image – as depicted on the badge – was later replaced by a new one, in which the “chain” was removed and replaced by blood stains. When was that done?  1532 would be my guess- using “fire damge” as a cover. That’s why the Savoy custodians were grilled by 3 bishops and 10 noblemen no less, suspicious that the 1532 Chambery fire was really an accident, or arson as suspected, and whether the surviving Shroud,  minus a few details like those absurdly bloated (armoured?) shoulders in the original,  was really the same as the one they had recalled from seeing years previously, if at all with their own eyes, and responding to complaints from previous pilgrims  that the 1532  fire had changed the Shroud image as regards some important details, like making it unequivocally the crucified Christ, with no Templar coded imagery…\n","date":"April 23, 2012 at 8:52 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","id":"comment-187","author":"colinsberry","site":"colinberry"},{"title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?","post":"Well, I have had to block several of your comments, MPH, not because I cannot take abuse, but because I don’t want it clutttering up my comments threads, distracting from the train of thought. That’s why I allowed the last two, as a signal that I still look at each comment and give some thought as to whether it is really deserving of the filter or not.\nIn fact, you have just done me a huge favour, whether you realize it or not, by making reference on Dan Porter’s site to the martyrdom of St. Lawrence (St.Laurent in France) whom the Church accused of failing to hand over the Holy Grail/Chalice that he was suspected of hoarding (forgive me if I have got it wrong or over-simplified – this being all new to me, and from cerebral RAM). \nThe parallels with the Templars and their wealth and persecution by Philip IV of France is all to clear. What makes it all so compellling is the punishment meted out to Lawrence – being slowly grilled to death – precisely  the same fate suffered by Jacques de Molay and Geoffroi de Charney. Now we know why that particular form of execution was ordered – there were historical and symbolic precedents.\nTomorrow I will add a new posting in which I compare details of the Lirey badge recovered from the Seine (1855 from memory)  with those from a drawing done some 10 years later. There are some interesting indications that the man on the Lirey badge was indeed being grilled from below, additional to the ones I have already suggested. In other words, he was nott the victim of crucifixion as commonly assumed –  although the artist who produced it was engaged in a mischievous kind of ambiguity – one that was intended to gull both impressionable medieval pilgrims and suspicious and wary Church authorities alike… The Shroud of Turin may bve seen as a spin doctor’s tour de force (as they might say in France)\n","date":"April 23, 2012 at 8:31 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","id":"comment-185","author":"colinsberry","site":"colinberry"},{"title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?","post":"Even to my worst enemy , I can hold out a hand….in case I overmade it….\n","date":"April 23, 2012 at 9:12 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","id":"comment-188","author":"Max Patrick Hamon","site":"colinberry"},{"title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?","post":"The only snag with your “most unhistorical/unarchaeological reconstructive post” is that the first cryptopareidoliac rendering of the Shroud image as “St Lawrence’s fire grate”\ndates back to the Vth century CE not the XIVth…\n","date":"April 23, 2012 at 9:20 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","id":"comment-189","author":"Max Patrick Hamon","site":"colinberry"},{"title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?","post":"Shamre on you!\n","date":"April 23, 2012 at 10:29 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","id":"comment-181","author":"Max Patrick Hamon","site":"colinberry"},{"title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?","post":"Most outstanding C(raps &) B(ullshit)!\nBad news for you, I am a Templar graffiti specialist (see e.g. my -non-revised version- 2006 Loches conference paper on Chinon enigmatic graffitis, ASPAG ed)…\n","date":"April 23, 2012 at 10:26 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","id":"comment-180","author":"Max Patrick Hamon","site":"colinberry"},{"title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?","post":"Dan Porter has just this minute posted on this one (full marks for an almost journalistic response-time, Dan, but shame you continue to vet all my comment before allowing them to appear).\nhttp://shroudofturin.wordpress.com/2012/04/23/colin-berry-historybod-a-tale-of-two-meanings/\nDan writes as follows:\n“Remember ‘The Second Messiah: Templars, the Turin Shroud and the Great Secret of Freemasonry,’ by Christopher Knight and Robert Lomas. Amazon in the U.K. has five copies. In the U.S. where you can buy a Kindle version, Amazon proclaims, “Using the latest scientific techniques , the authors prove that the shroud [Jacques de]Molay was wrapped in is the one now known as the Turin Shroud.\nWell, Colin Berry, has a new twist on this. Yes, it is still a scorch ala Berry and not the chemical approach taken by Knight and Lomas and . . “\nYup, I knew I had come across that link between Molay and the Shroud some weeks ago, and it was consigned to a filing cabinet at the back of my mind,  the one labelled  “yet another conspiracy theory?” but hours of googling these last few days failed to turn up that Knight and Lomas book.  Anyway, it’s good to know that others have spotted a connection too – apologies to those authors for not citing their work, of which I knew nothing until 5 minutes ago.  Thank you Dan. I shall now try to get my hands on a copy of that book.\n","date":"April 23, 2012 at 9:44 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","id":"comment-179","author":"colinsberry","site":"colinberry"},{"title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?","post":"stupid fantasy:))\n","date":"April 23, 2012 at 9:32 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","id":"comment-178","author":"Lisandro Abbiati","site":"colinberry"},{"title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?","post":"In fact, looking again closely at the Man on the Badge (which I invite readers here to do), especially thr face and the feet, does that not strike you more as an image of a man being burned, rather than crucified? Note the way the head is tilted slightly upwards – as if enduring fearsome pain – rather then the downwards tilt one sees so often in crucifixion images of an exhausted man. The feet are also interesting. Yes, they are crossed, as expected if nailed together. But they could also represent feet that are being roasted and are in a spasm of pain. And what is that beneath the feet? A second chain? If so the links are oddly separated. Might it not be a nominal portrayal of burning wood?\n","date":"April 23, 2012 at 5:12 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","id":"comment-176","author":"colinsberry","site":"colinberry"}]
