[{"title":"Weaving Fan a.k.a. Colin Berry?","post":"i have to agree with Stephen Jones here. The British Museum is not that far from V&A.\n\n","date":"November 13, 2014 at 5:16 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171107","author":"Louis","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"Sorry, I meant the “weaving fan” was correct. Now, what was the reason V&A could not cut up a tiny sample? Who is the “weaving fan” and how did he know that? We must know his name. Why is he hiding behind a pseudonym?\n\n","date":"November 13, 2014 at 5:22 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171109","author":"Louis","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"Well, I know nothing about weaving but when did ignorance stop speculation? – as long as it is clearly flagged up as speculation.\n1) “Tablet weaving”, if I’m correct, is both very old (something called the Rameses girdle springs to mind), and wholly unsuitable for making bolts of cloth with. Herringbone weave of various kinds is easy to do with it, but only in thin widths of a few inches.\n2) Having removed that from the equation, I don’t think there are any examples of pre-medieval herringbone twill from Southern Europe or the Middle East, nor of the four-heddle loom necessary to make 3/1 twill. The earliest such twill and looms appear to be in China, and mostly used for silk.\n3) In Europe, elaborate twills seem to be a northern thing, being found in Viking and Celtic excavations. Soem authenticists have suggested that the Shroud might have been an imported cloth from China or northern Europe.\n4) I have not heard that there is no medieval 3/1 linen twill in European museums – only that there is no 3/1 linen twill that museums were happy to lose to act as a control for an unconnected exercise.\n5) Is it being pedantic if I point out that the Shroud is not, in fact, herringbone at all? Technically it is a chevron weave ,which is not the same. Funny that nobody has commented on this before…\n\n","date":"November 13, 2014 at 5:59 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171112","author":"Hugh Farey","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"What is meant by “unconnected exercise”?\n\n","date":"November 13, 2014 at 6:13 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171115","author":"Louis","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"If I’ve got a sample of medieval tablecloth, I might spare a fragment for the dating of comparable cloths from a similar environment, but I might not want to send it off to act as a control for a religious relic.\n\n","date":"November 13, 2014 at 6:31 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171118","author":"Hugh Farey","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"That is not convincing, the Shroud is not just “another” religious relic.\n\n","date":"November 13, 2014 at 6:38 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171119","author":"Louis","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"If you can prove that the Shroud is not herringbone at all and what we see is a chevron weave then Charles would have to forget about going to V&A and that will also mean that M. Mechthild Flury-Lemberg may have been using the wrong glasses for a long time.\n\n","date":"November 13, 2014 at 6:43 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171120","author":"Louis","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"Hugh is right, the shroud does resemble a Chevron (fishbone in french) more than a Herringbone the difference is significant in flooring designs, but in textile both terms are used interchangeably.\nDictionary.com entry for Herringbone\n“Textiles; Also called chevron, chevron weave, herringbone weave. a type of twill weave having this pattern.”\nCompare this\nhttp://www.remodelista.com/posts/chevron-and-herringbone-spot-the-difference\nTo","date":"November 13, 2014 at 8:54 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171130","author":"Mike M","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"I think it is significant they the shroud weave lacks wool fibres. Why would a European forger care about wool? Also weaving irregularities and imperfections apparent because of manual weaving process.\n\n","date":"November 13, 2014 at 10:18 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171141","author":"Mike M","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"They=that… I hate typing on iPhone\n\n","date":"November 13, 2014 at 10:19 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171142","author":"Mike M","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"For the record, I am not and never was “Weaving Fan” as claimed by Stephen Jones. I even put up a posting some 2 years ago to disabuse him of that.\nQuite why Dan has chosen to return to what started as a brief spat between the two of us (it began when I was rudely balled out for posting a second comment having overlooked his site’s draconian house rules) is a total mystery. Surely it’s not an attempt to portray me as a hypocrite when I continue to lodge protests against the tolerance shown here to a handful of site trolls, one in particular, whom Dan compares with “hecklers” at political meetings. How much heckling was permitted from the floor at that St.Louis conference he attended recently?  Or is it considered OK to foul up debate on internet forum via personal and vitriolic attacks on genuine contributors, whether pro- or anti-authenticity, while operating from behind the safety of a pseudonym? \nBut as I say, I was not “Weaving Fan” and am somewhat uncomfortable with the title of this posting. What useful purpose does it serve?\n\n","date":"November 14, 2014 at 1:47 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171159","author":"Colin Berry","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"I have added a question mark in title. Perhaps it was a poor choice for a title. I have also added the following text just below the title: “While reading what follows, please be aware that Colin Berry denies that he is Weaving Fan. I believe him. I trust him. We all should.”\n\n","date":"November 14, 2014 at 3:54 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171172","author":"Dan","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"Thanks Dan.\n\n","date":"November 14, 2014 at 3:56 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171173","author":"Colin Berry","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"Colin, Dan now has his foot near the brake and the blog has improved considerably. But I think any one using pseudonyms to also indulge in personal and vitriolic attacks should be warned and blocked from commenting if things continue the same.\nGood for us is that there is an antidote appearing from time to time here. It is your (Scotch-Irish?) sense of humour.\n\n","date":"November 14, 2014 at 7:17 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171190","author":"Louis","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"Glad you like my, er, Scotch-Irish sense of humour Louis.\nBut there’s a serious side to me too, in the metaphysical department that is. Knowing your serious misgivings ray Re Rogers on account of his alleged logical positivism, be on the lookout for my forthcoming book, to be entitled: “Fuzzy Logical Negativism – the Quantum Solution to Every Question in the Universe – For Those Who Already Know The Answers”. (CB Publications, New York, London and Little Codswallop). \nMaybe Dan can be prevailed upon, or arm-twisted as we say, to post a flavour of what’s in the pipe dream, (sorry, line) from time to time, say once a week, he being my very bestest friend, especially as we both know New Yoik. There will be a range of flavours on offer – sweet, sour, bitter – something for everyone. There will be no excuse for anyone not to buy my book.  In return for advance orders with full pre-payment, I can do you a special deal on my publishing house too.\n\n","date":"November 14, 2014 at 8:53 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171198","author":"Colin Berry","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"Colin, I can understand your position when it comes to metaphysics as science-theology dialogue is one topic I write on. I also review books in this field, although the preference is Biblical archaeology (200BC – AD 200 roughly) and sometimes biblical studies. Right now I have a 1000+ page book on Jesus to read and review, obliging me to keep two books on Freud and one on the history of Jerusalem aside — till next year.\nAlthough I am a Christian (RC) by conviction, I find it necessary to hear both sides of the story because that is also part of the dialogue. When I was in England I saw people, atheists included, anxious to find someone who could listen to them, there was an unconscious quest for transcendence, which is what even the godless Jew Freud wrote about.\nWhen do you expect your book to be launched?\n\n","date":"November 14, 2014 at 10:10 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171208","author":"Louis","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"“When do you expect your book to be launched?”\nWhat,  ike a huge luxury cruise liner, say the Titanic? Or a rocket launch, like, er, well let’s skip that one, shall we?\nNo, nothing quite so challenging (or risky) as a launch. I thought I’d take a leaf from the Ford Edsel book of marketing, and go for a softly, softly approach,  spread over several weeks, nay months, a fender here. a grille there, you know, like a strip tease, reveal one’s hidden charms one tiny fleeting glimpse at a time. Then would finally come the big day when the veil is swept aside and the entire model is revealed in all its glory, and jaws would drop, and folk would exclaim “Yes, that’s IT!” (or was is “Is that it? “, I can never remember).\nIt’s all there on the internet – the Edsel way of insinuating one’s devastatingly original creativity into the public consciousness by degrees.\nhttp://content.time.com/time/specials/2007/article/0,28804,1658545_1657867_1657781,00.html\nFrom your Scotch-Irish humorist.\n(“They all laughed when I said I wanted to be a comedian. Well, they’re not laughing now” – Bob Monkhouse).\n\n","date":"November 14, 2014 at 11:15 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171214","author":"Colin Berry","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"I don’t think it’s Colin but I wonder who?\nRegardless it’s a petty little affair\n\n","date":"November 14, 2014 at 2:26 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171160","author":"Thomas","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"Stephen Jones still thinks it is, Thomas if you check his latest comments. But then who am I to argue, being allegedly blind to the truth  his truth that is? Heads and brick walls do not make easy companions…\n\n","date":"November 14, 2014 at 2:39 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171161","author":"Colin Berry","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"Well he’s at one end of the fundamentalist spectrum and Chuck is at the other\n\n","date":"November 14, 2014 at 2:53 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171164","author":"Thomas","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"“In textile both terms are used interchangeably.” Not by people who make herringbone and/or chevron twills, they’re not. There is a clear distinction, unrelated to the shape of the ends of flooring tiles, defined by the alternate staggers of the weft threads. However, I agree that the distinction is small, and that the word ‘chevron’ is often subsumed into the generic ‘herringbone.’ It’s still curious that nobody has noticed the distinction, don’t you think?\nAnd Louis, I know, and you know, that an accurate dating of the Shroud would be a huge step forward in our understanding of an extremely important religious icon. But it may be that the textile curators of the Louvre and V&A (fr example) don’t necessarily concur with our views.\n\n","date":"November 14, 2014 at 2:58 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171165","author":"Hugh Farey","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"As I say in my article, the presence of an apparent three in one herringbone or chevron dated to the fourteenth century  in the V and A tells us no more than that such weaves existed in the fourteenth century, in this case a vestment. I was interested that ‘weaving fan’ seems to have known of others. It is a pity that we can’t track him or her down to find out more but there is the Collingwood reference (s)he gives.\nIt is interesting that when my weaving contact was commissioned  to weave vestments she was told to do it in three in one herringbone so there must be a tradition that associates vestments with this particular weave to this day ( unless she was meant to be reproducing a medieval vestment).\n\n","date":"November 14, 2014 at 3:52 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171171","author":"Charles Freeman","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"Hugh, I at least do appreciate the point you have raised. If suggestions are allowed and Charles agrees, perhaps two people in the Shroud “crowd”, you and M.Mechthild Flury-Lemberg, one pro- and the other anti-authenticity, could be invited to go together with Charles to V&A.\n\n","date":"November 14, 2014 at 7:25 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171191","author":"Louis","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"Hugh, the difference between herringbone and chevron, in the textile language AMONG HISTORIANS OF TEXTILES is not what you say. Herringbone is used to identify a kind of chevron, a “warp chevron” (as in the shroud). But as “herringbone” is not so well accepted in scientifical language, it is better to say, describing the shroud, “chevron twill” or “warp chevron twill”. What you call herringbone, defined by the alternate staggers of the weft threads, must be called “broken chevron twill” (that could be either a warp chevron or a weft chevron). I know that the matter is complicated, but the language among historians and among experts of MODERN weawing is not the same.\n\n","date":"November 14, 2014 at 5:29 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171181","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"Thanks, Andrea; I agree with that. “Broken chevron” will do just as as well as herringbone. The Shroud, of course, is not “broken chevron.”\n\n","date":"November 14, 2014 at 6:14 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171186","author":"Hugh Farey","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"I remember also that the only serious study about the textile structure of the Shroud DONE BY AN EXPERT OF HISTORY OF TEXTILES is still G. Vial, Le Linceul de Turin. Étude technique, in «Bulletin du Centre International d’Études des Textiles Anciens» 67 (1989), pp. 11-24; Id., À propos du linceul de Turin, in «Bulletin du Centre International d’Études des Textiles Anciens» 69 (1991), pp. 34-35; Id., À propos du Linceul, in «Montre-nous ton visage» 10 (1993), pp. 27-30. The first part was also translated in English in «Shroud Spectrum International» 38-39 (1991), pp. 7-20.\n\n","date":"November 14, 2014 at 6:37 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171188","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"From G.Vial (Shroud Spectrum International 38/39)\n” Of the 2 types of faults seen in Fig.4 [Shroud], the implication is that the archaic method was used to make the cloth of the Shroud .Unfortunately, we do not yet know when the modern method began to be used. Daniel de Jonghe has remarked only that this type of fault disappeared in the chevrons of canvas used for painting of the 18th century”.\nMy comment: This suggests that the “archaic” method disappeared in the 18th century.\nThis also suggests that the so-called archaic method was still used in the Middle-ages as well as in ancient times. The “faults” does not tell us anything about the date of the TS.    \n” As for the herringbone weave; only superficial descriptions have been advanced, irrespective of the technical complexities of the type of loom necessary.There is a fundamental difference between a 2:2 twill and one of 3:1. The herringbone and lozenge weaves are known since the Iron age, if not earlier, but the fragments discovered are generally 2:2 and all are wool. the borders of the Antinoë cushions are 2:2 and are wool.. Damask cloth, for example those of Palmyra, Treves, Conthey, Ribeauville, Cologne, Holborough, are “derivatives” of 3:1 twill (..) but they are in silk.\n(..) The only herringbone in LINEN so far analysed and published is that cited in note 10. It is very late-second half of the 16th century- and much simpler than that of Turin.\n(…) If one takes into account the 3 constitutive elements of a textile-the structure, the primary material, and the reduction of warp and weft- one must acknowledge that the Shroud of Turin is truly “incomparable”. \nIf I understand well, 3:1 “derivative” (what does it mean?) herringbone clothes could be produced in ancient times, but all of those clothes were in silk. \nOn the other side the only known 3:1 herringbone LINEN cloth (apparently similar to the Shroud) comes from a painting of “the last supper” made by Martin de Vos” on a 3:1 linen herringbone twill weave dating from the end of the 16th century. It is noteworthy that Vial did not know of any other similar 3:1 linen cloth from the 14th century in Europe.\n\n","date":"November 14, 2014 at 5:42 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171257","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"“The “faults” does not tell us anything about the date of the TS”\nI am not a textile expert Thibault but John Tyrer is one, and he seem to disagree with your statement:\n“These changes may be faults in the weave because of incorrect drawing-in through the heralds which could suggest a primitive loom. In fact a study of the spinning and weaving defects in the shroud might throw light on the method of production”\n(John Tyrer: chartered Textile expert)\nhttp://www.sindone.info/TYRER1.PDF\nAnd; After studying X-radiographs of the shroud, John Tyrer stated:\n“I am very interested in the comparison that can be made between the altar cloth used to patch the Shroud, the Shroud itself, and the backing cloth… The altar cloth and the backing cloth are plain woven, and are much better products than the shroud. They seem to contain less weaving faults whilst the shroud is a very poor product by comparison. It is full of warp and weft weaving defects, many mistakes in “drawing-in” the impression I am left with is that the cloth is a much cruder and probably earlier fabric than the backing and patches. This I think lifts the shroud out of the Middle Ages more than anything I have seen about the textile”\nFrom the book Resurrection of the shroud:New Scientific, Medical, and Archeological Evidence page 100)\n\n","date":"November 14, 2014 at 6:55 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171267","author":"Mike M","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"Thanks Mike for recalling to us the two very interesting studies of Tyrer.\nIn fact, I think that Vial and Tyrer do not truly disagree.\nHowever, Vial was certainly much more cautious than Tyrer.\nFor example, I do not think that the comparison between the Holland backing cloth (or the patches) and the Shroud can be taken as an evidence.\nThe only sure fact is that the method used to make the Shroud was the “archaic” method but this term is misleading since, from Vial’s sentence, one can infer that this archaic method disappeared only in the 18th century.\nIf I interpret correctly, on the basis of the faults, the 1534 backing cloth has been made using the modern method and the TS the “archaic” one that, however, was still in use in the 18th century.\nClearly, there was a large time overlapping of several centuries in the use of both methods.\nStrictly speaking, the textile studies show that the TS could have been made in the first century from a technical point of view This is also Mrs Flury-Lemberg’s opinion. But no more.\n\n","date":"November 15, 2014 at 1:15 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171428","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"“Strictly speaking, the textile studies show that the TS could have been made in the first century from a technical point of view This is also Mrs Flury-Lemberg’s opinion. But no more.”\nFair enough, I agree to that statement.\n\n","date":"November 15, 2014 at 3:04 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171441","author":"Mike M","site":"shroudstory"},{"title":"Weaving Fan a.k.a. Colin Berry?","post":"The late Daniel Raffard de Brienne, French lawyer, Shroud scholar and President of CIELT, was one of the few authorities invited by Cardinal Severino Poletto to the Round Table held in Turin. He had something to say about the samples:\n https://www.academia.edu/9156258/Shroud_Studies_in_France\n\n","date":"November 14, 2014 at 7:58 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","id":"comment-171279","author":"Louis","site":"shroudstory"}]
