[{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"There is no chemical method that can date the Shroud, either to the 14th or the 1st century. All a chemical method can do is tell you something about its present state. The various claims that these tests can serve as chemical clocks is moonshine, given the thermal insults to which the Shroud has been subject (1532) or to which it may have been subject in order to imprint a mid-14th century simulated body image, e.g. by the oven -roasting technology that I and others have proposed.\nSo let’s be hearing no more about, at least not here, about your AFM or any other claimed alternatives to radiocarbon dating piero. This site exists to promote science, not pseudoscience.\nThose like yourself who distrust the radiocarbon dating are, needless to say,  entitled to their opinion, and to express it once and once only if unsupported by hard data. They are not entitled to constantly undermine confidence in the radiocarbon dating on other people’s websites by constant repetition of their opinion, if there’s  no supporting data. That’s not science. It’s propaganda, no matter how cunningly disguised with the language of science.\n If you’re determined to proselytize your AFM as a viable alternative (which it’s NOT)  then there’s an alternative to constantly filling up the comments on other people’s websites, piero. Go create your own website. It takes only a few hours at most, minutes  even if you’re not trying to win prizes for artistic merit. I can recommend either WordPress or Google’s Blogger, each having its pros and cons. \nYou are of course at liberty to post comments here on other matters, but pseudoscientific AFM etc is no longer accepted.\n","date":"January 5, 2016 at 4:27 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6659","author":"Colin Berry","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"Remember that I do not want to proselytize for anything,\nI just want to point out what seems to me obvious and\nthat you seems strangely escape to you.\nDon’t You see much use for a way non-destructive or\nminimally destructive?\n","date":"January 6, 2016 at 1:31 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6666","author":"piero","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"Readers of this posting might be interested to see its wider context, highlighted in this recent comment from Hugh Farey on the International Skeptics Forum site:\nhttp://www.internationalskeptics.com/forums/showthread.php?t=299015&page=58\nComment #2318\n Those who have very much enjoyed the intellectual cut-and-thrust of shroudstory.com have been upset by its recent closure, although with competent searching it remains an essential repository of primary sources and intelligent opinions. There was a time when I found internationalskeptics worthwhile, and indeed, followed chiefly mathematical arguments from an authenticist to a non-authenticist viewpoint. Since then, I have scrupulously examined every authenticist argument for discrediting the radiocarbon date, and found nearly all of them spurious, although there are still one or two grey areas. Many of the other evidences for a medieval date have also been scrutinised, in detail, with a view to determining their level of support. The d’Arcis memorandum is one of these.\nOver the years the weakness of the authenticist position on this site has resulted in some very slack counter-arguments from non-authenticists, with the result that, although Jabba is frequently blamed for the pointless continuation of this thread, which must surely for heading for the Guinness Book of World Records, it has really been maintained by his opponents. In more or less the same three words (“I’ll be back”), posted every month or so, Jabba has managed to keep a pack of hounds snarling at his heels, without achieving the slightest progress in denting his belief in the Shroud’s authenticity. Mostly, the site has become an increasingly inaccurate re-iteration of supposed non-authenticist arguments, to the edification of nobody.\nThere may be an unrecognised worthwhile reason for the maintenance of this thread, which is to demonstrate the weakness of authenticist arguments, or the strength of non-authenticist ones, to readers who follow it, but never comment. For several years they have been largely disappointed, I fear.\nNeither the Pope, nor Bishop d’Arcis, nor Bishop Henri, nor anybody else, has left any record that they knew the painter responsible for the image of the Shroud. All we have is an unsigned, undated draft of a letter addressed to the Pope from d’Arcis, claiming that the Shroud being exhibited in Lirey in 1389 was not a true relic of Christ, but a deceitful fraud, and that the whole thing had been investigated by Henri of Poitiers, “the truth being attested by the artist who painted it,” after which it had been hidden for 34 years or so, a date so precise that it suggests some knowledge (or assumed knowledge) that the first time the Shroud was exhibited was in 1355 or so. (“Or so” perhaps being crucial, as we shall see. The Latin is “vel circa”)\nThis is important. We do not have Bishop Henri’s report. What we do have is his signed, dated, effusive commendation of Geoffroi de Charny written on 28 May 1356, with no mention of a fraudulent Shroud. It seems unlikely that Bishop Henry would have been so kind if he had just condemned a fraudulent relic.\nGeoffroi de Charny died at the battle of Poitiers on 19 September 1356.\nSuppose, for a moment, that d’Arcis’ information, whether or not he actually sent his letter, was correct. An interpretation of the evidence could be that the Shroud began to be exhibited after de Charny’s death (‘vel circa’ being the operative words here), and Bishop Henri, having commended de Charney only the previous Spring, was shocked to discover that by the Autumn the canons at Lirey had exceeded their remit. This seems possible, and to me the most likely.\nIt is sometimes claimed that since there is no proof that d’Arcis’ letter was sent, that no credence should be given to it. However, even if this particular complaint was not received by the Pope, he nevertheless commanded in 1389 that the Shroud could only be shown as a representation, and without all the ceremonial trappings of sanctity that might attend the display of the real thing, suggesting that at least somebody had complained. It is not obvious whether he personally thought the Shroud was genuine or not, but he certainly acted as if it wasn’t.\nOn the other hand, if we decide that the “vel circa” is not adequate to reconcile the conflicting evidence from 1356, we could claim that Bishop Henri knew all about the Shroud and commended Geoffroi de Charney for building a chapel for its veneration. His commendation specifically states: “after scrupulous examination […] of the said knight’s sentiments of devotion, which he has hitherto manifested for the divine cult, and which he manifests ever more daily. And ourselves wishing to develop as much as possible a cult of this nature, we praise, ratify and approve the said letters in all their parts – a cult which is declared and reported to have been canonically and ritually prescribed, as we have been informed by legitimate documents.” What could this “cult” have been, if not that of the Holy Shroud? Well, the fact that the church is dedicated to St Mary may be related to that. \nIt may be worth considering how we know about the two conflicting documents in this case. The d’Arcis memorandum has been researched twice, by the Catholic Historian Ulysse Chevalier, at the turn of the 19th/20th century, and by Hilda Leynen in the 90s. The document by Bishop Henri was discovered by Bruno Bonnet-Eymard, who is a fairly extreme fundamentalist Catholic and Shroud authenticist, who thinks that the radiocarbon date was falsified by Dr Tite and Cardinal Ballestrero in the sacristy of the Royal Chapel in Turin in 1988. Although his discovery of the Bishop Henri document was presented to the St Louis Shroud Symposium in 1991, it was not referred to at all by Luigi Fossati in his two articles for Shroud Spectrum International in 1992, or in Jack Markwardt’s ‘The Conspiracy Against the Shroud’ in 2001.\nFinally, Luigi Fossati draws our attention to an interesting change of phrase in successive communications from Pope Clement to Troyes, at around that time, beginning with “figura seu representatio” (July 1389) amending it to “pictura seu tabula” (January 1390), but reverting to “figura seu representatio” in May 1390.\nReferences:\nD’Arcis memorandum: https://archive.org/details/tudecritiquesur00chevgoog\nBishop Henri commendation: “The Shroud of Turin: A Case for Authenticity” (google.books)\nMarkwardt Discussion: http://www.shroud.com/pdfs/n55part3.pdf\nFossati Discussions: http://shroud.com/pdfs/ssi41part3.pdf and http://shroud.com/pdfs/ssi42part14.pdf\nBruno Bonnet-Eymard: http://crc-internet.org/our-doctrine…-shroud-turin/\n","date":"January 4, 2016 at 10:59 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6655","author":"Colin Berry","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"Back to piero and his AFM.\nHere’s the entry from wiki, slightly modified, to purchasing something on hire-purchase, or an instalment/installment plan as it’s known in the ex-Colonies and elsewhere.\nHire purchase (colloquially called “buying on the never-never”) is the legal term for a contract, in which a purchaser agrees to pay for goods in parts or a percentage over a number of months or years. In the US and Canada, hire purchase is termed an installment plan although these may differ slightly as, strictly speaking,  in a hire purchase agreement the ownership of the good remains with the seller until the last payment is made…\nThe hire purchase agreement was developed in the UK in the 19th century to allow customers with a cash shortage to make an expensive purchase they otherwise would have to delay or forgo.\nSo, you get the goods upfront, and then pay for them over an extended period.\nNow then: does anyone else here – apart from myself that is – notice the  difference between hire-purchase as originally conceived and piero’s AFM credit scheme?\nWhen do you start paying in the piero scheme? When do you get the goods?\nWhat does “the never-never” refer to in piero’s scheme – when you finally finish paying, or when you finally get the goods, if ever?\n","date":"January 3, 2016 at 11:33 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6647","author":"Colin Berry","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"Point 1:  Cellulose depolymerization? Yet another chemical clock that is impossible to calibrate with certainty, along with lignin breakdown, fibre mechanical fragility etc. Who needs a unreliable chemical clock when there’s radiocarbon dating? If the objection to the latter is the limited sampling, then the answer is simple. Go back and sample a wider range of sites.\nPoint 2 (image characteristics) : I’ll try addressing that later. First I have to figure out precisely what it is you are proposing, and whether it’s really AFM that is crucial and in the frame, or whether it’s really those other techniques (Raman etc) that have now suddenly crept in as reinforcements.\nSorry piero. I’m frankly not impressed so far, and indeed am frankly underwhelmed, but I shall withhold judgement for a short while longer. Maybe there’s something I’m missing but I’ll be darned if I can see it. The expression “much ado about nothing” springs to mind.\n","date":"January 2, 2016 at 5:32 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6640","author":"Colin Berry","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"I  admit : it can be difficult to solve the problem\nof dating the material (…using only one parameter!),\nbut I am not of your opinion about the impossibility\nof using the degree of depolymerization of cellulose\nin order to determine an interesting estimate (through\nthe comparison of “cellulosic Dp” values) about the\nantiquity for that particular ancient textile material…\n— — —\nHere the old Norm (UNI)\n[Obviously this is the old standard and therefore\ndoes not apply to the possible new rule based\non the use of the AFM techniques!]:\n Standard Number:  UNI UNI 8282-1994\nTitle:\nCellulose in dilute solutions. Determination of\nlimiting viscosity number. Method in cupri-ethylene- diamine\n(CED) solution. \nTranslated in Italian laguage:\nCellulosa in soluzioni diluite. Determinazione\ndell’indice della viscosità limite. Metodo che\nusa una soluzione di cuprietilendiammina \nLanguage:  Italian\nPublication Date:  1994/10/31\nPublisher:  Unifica zione Italian no(UNI) \nLink:\nhttp://www.freestd.us/soft4/1756344.htm\nBut, see also under the address:\nhttp://www.queryonline.it/2013/04/16/datazioni-alternative-della-sindone-la-controreplica-di-gian-marco-rinaldi/comment-page-1/\n >… nel 1998 avevo indicato l’uso delle tecniche AFM per poter ottenere il valore del grado della polimerizzazione della cellulosa. Purtroppo (finora) nessuno pare aver seguito quella indicazione. Il grado di polimerizzazione della cellulosa è uno dei parametri già indicati da Diana e Marinelli (però loro parlavano del controllo per via viscosimetrica che avrebbe richiesto una troppo grande quantità di materiale. Vedere anche quanto descriveva la Norma UNI 8282 …). Tale parametro è indubbiamente interessante e bisogna scegliere zone sicure, libere da effetti di deterioramento meccanico (pieghe, vedere anche la questione delle pieghe storiche, già indicata da John Jackson. Dopo il trattamento del 2002 però non sembrerebbe saggio entrare in quelle questioni) o degradazione biologica (da muffe, funghi, ecc.) oppure degradazione termica (incendio di Chambery del 1532).\nSecondo me occorrerebbe anche confrontare i valori del grado di polimerizzazione (della cellulosa) con le analisi ottenute dall’AFM “three-point bending test”.\nEcco un possibile riferimento :\nHere a rough translation:\n>…in 1998 I had indicated the use of AFM techniques in order to obtain the value of the degree of polymerization of the cellulose. Unfortunately (intil now) no one seems to have followed this indication. The degree of polymerization of the cellulose is one of the parameters already set out by Diana and Marinelli (but they spoke about the viscosimetric control  that would require too large amounts of material. See also what described the Norm “UNI 8282″…). This parameter is undoubtedly interesting and you have to choose safe areas, free from the effects of mechanical damage (folds, plies, see also the issue of historical folds, already indicated by Dr. John Jackson. After treatment of 2002, however, it would not seem wise to get into those issues) or biological degradation (mold, fungus, etc.) or thermal degradation (Chambery fire of 1532).\nIn my opinion it should also compare the values ​​of the degree of polymerization (cellulose) obtained by the AFM analyses with the other analyses AFM : “AFM three-point bending test”.\nHere is a possible reference:\nhttp://apl.aip.org/resource/1/applab/v84/i9/p1603_s1?isAuthorized=no\nAppl. Phys. Lett. 84, 1603 (2004); http://dx.doi.org/10.1063/1.1651643 (3 pages)\nPhysical properties of a single polymeric nanofiber    by E. P. S. Tan and C. T. Lim   Division of Bioengineering and Department of Mechanical Engineering, Faculty of Engineering, National University of Singapore\nThe nanostructural and elastic properties of a single polymeric nanofiber extracted from a nanofibrous scaffold are investigated using atomic force microscopy (AFM). AFM imaging of the nanofibers reveals a “shish-kebab” structure. A portion of the nanofiber is suspended over a microscale groove etched on a silicon wafer. A nanoscale three-point bend test is performed to obtain the elastic modulus. This elastic modulus is found to be … etc. … etc. … etc. …                   \nThen there is the elastic modulus [in Italian language = il modulo\nelastico (o modulo di Young)] as another physical clock to use in order to better arrive to the center the objective … the evaluation of the possible range of historical epoch.\nHere is the continuation of the message of two years ago:\n>… Oppure vedere all’indirizzo (translation = Or see under the address):\nhttp://www.google.it/url?sa=t&rct=j&q=&esrc=s&frm=1&source=web&cd=4&ved=0CFsQFjAD&url=http%3A%2F%2Fwww.tappi.org%2Fcontent%2Fevents%2F08nano%2Fpapers%2F08nan22.pdf&ei=rKluUf_DFcqh7AbP5YC4CA&usg=AFQjCNHW9NgnPLrcu-Hf2sMxQsnb2J_hSg&sig2=Ne_KDDlvarbLH7aWoKMywg&bvm=bv.45368065,d.ZWU\n> Nano-Scale Three-Point Bending Test in AFM where F is the maximum force applied, L is the suspended length, δis the deflection of the beam at midspan … etc. … etc. …\nhttp://www.deepdyve.com/lp/elsevier/a-method-for-testing-the-elastic-modulus-of-single-cellulose-fibrils-ipqwhHBJ5y\n>”A method for testing the elastic modulus of single cellulose fibrils via atomic force microscopy”\nby\nCheng, Qingzheng; Wang, Siqun\nFollow Composites Part A: Applied Science and Manufacturing , Volume 39 (12) Elsevier – Dec 1, 2008\n>…Così si avrebbe un quadro più completo di ciò che potrebbe esser la vera datazione del materiale. Inoltre vorrei poter aver più spazio per spiegare cosa intendo per esatta valutazione del materiale il controllo di altri parametri.\n Vedere ad esempio (quanto già da me riferito in questo blog) : il grado di carbossilazione della cellulosa e gli studi del prof. Luigi Campanella.  … ecc. …\nAnother rough translation:\n>…So you would have a more complete picture of what\ncould be the real dating of linen material.\nAlso I wish I could have more room to explain what I mean\nby exact evaluation of the material control other parameters.\nSee for example (as I have already reported in this blog):\nthe degree of carboxylation of cellulose and the studies of\nProfessor. Luigi Campanella. … etc. …\nSo, with the assessment of the degree of carboxylation\n(perhaps using the CFM = Chemical Force Microscopy…\nLink: http://www.parkafm.com/index.php/park-spm-modes/chemical-properties/224-chemical-force-microscopy-cfm-with-functionalized-tip ),\nwe arrive at the number of three parameters and then\nwe can try to better go to focus on the center of target to hit\n(with the “scientific bombardment”)…\nThen: the probability to find the true epoch should increase …\n…or not?\nHere another link:\nhttp://www.physics.uoguelph.ca/psi/papers/AFM/Green_TrendsAnalChem02.pdf\nIn any case, I think you could easily compare\nthe chemical maps with the viscoelastic maps\nof linen fibrils (and then you should use\nthese interesting data to guess something!…).\n— — —\nSorry… I was a bit ‘too long in my message,\nbut this is only a little part of what\nI wanted to say to you!\n","date":"January 4, 2016 at 3:40 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6652","author":"piero","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"The radiocarbon dating is 1260-1390. Admittedly that is the answer for one subdivided corner only. Those who think there’s a substantial sampling error that could make the date seem 1300 years younger should be pressing for  retest, not substituting , or attempting to substitute soft chemistry for hard nuclear physics.\nThe medieval date given by radiocarbon dating, combined with the two-fold image of a crucified man, makes it near certain that the TS is/was an attempt to model the image that might have been left on linen by the crucified Jesus. At least three researchers, myself included, have deployed an oven-heating step to model the body image. So all those chemical clocks that rely on any kind of physical or chemical degradation of linen fibres (lignin degradation, mechanical weakness, cellulose depolymerization etc) are totally unscientific if they not only discard the radiocarbon dating, but acknowledgement too of the thermal technology that might and indeed probably was employed to produce the body image. That’s not counting the possible effects of the 1532 fire as well.\nThis attempt on your part and others (Rogers, Fanti, Di Lazzaro etc) to sideline the radiocarbon dating  – essentially to pretend it’s not there or has somehow been invalidated – and to substitute phoney chemical dating, or attempt to do so,  may be acceptable in sindonology, piero.  But is not acceptable in experimentally-based science, and more to the point is NOT ACCEPTABLE ON THIS SITE (see the blog title).\n I reserve the right to delete further comments from you or anyone else piero  that I consider to be pseudoscience, aka mumbo jumbo.This site does not see itself as a substitute or successor to shroudstory.com (RIP).\n","date":"January 4, 2016 at 4:16 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6653","author":"Colin Berry","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"It was not in my aim to completely discard\nthe radiocarbon dating of the year 1988.\nWhat had been done it was done.\nAmen (and then: see also the lack of\nexact informations about the Raman analyses\nof the year 2002!!!).\n— — —\nI had simply seen there was a strange\ndebate that was not able to solve the problem,\nthen I indicated the AFM techniques as\nuseful tools to try to solve the problem.\nUnfortunately, I see that you can not even follow me\n(or try to debate in a more decent manner, ie: not\nhaving to use the silly cartoons that do not reflect the truth)\nin my old idea of trying to identify a possible era [who\ncan identify the age of the textile material] using\nchemical and physical analyses.\nInstead you invoke the result of a C14-1988 dating\nwhich has been questioned by many … By the way:\nwe have never had the raw data obtained in 1988 !!!\nAfter this fact we have seen that has been developed\nby some “seekers of truth” the interesting conjecture\nabout the likely “gradient of time” (see, for example,\nwhat has been written by researchers fiercely anchored\nin search of a possible satisfactory explanation about that “quiz”, even\nin the absence of special exact data [ie raw data that we lack]\nthese researchers are: Ballabio, Fanti and others …), etc.\nApart the presence of cotton, etc. in my opinion there is\nnot yet a true proof (= an incontrovertible result) about\na “corner of darning” as the solution of “the strange 14C result”.\nWe still have to work (to work hard with nondestructive\nanalyses) a lot in order to show the truth.\nCan “an uranium-contaminated water” [perhaps\nused during “the shutdown of the fire” in 1532]\nchange the perspective ?\nI don’t know…\nThis seems to be a mere new speculation.\nI am skeptic.\nWhat is your opinion?\nHave you tried to investigate this particular hypothesis?\nSo…\nWhat we can investigate about the riserva of the “subdivided corner”?\nThank you for your patience…\nIs this benevolence a sort of patience of an Indian holy man?\nor…\nAre you the new heir of the roasted Knights Templar?\n","date":"January 5, 2016 at 3:44 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6658","author":"piero","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"My AFM determinations wanted to improve\nwhat was indicated by prof. Diana and\nprof. Marinelli (but they indicated the viscosimetry,\nthen see also the Norm UNI 8282 a way\nthat I wanted to improve using the AFM\n[insterad of the viscosimetry]…)\n-*-*-*-\nI forgot to write the following words:\nHappy New Year 2016 !!!\n","date":"January 2, 2016 at 5:02 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6638","author":"piero","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"Message received, piero, but still not understood. What kind of information would you expect to obtain from AFM? Would it allow you to identify the target molecule(s) for image reception, e.g. hemicelluloses, lignins, cellulose, pectins etc? If so, would it allow you to deduce the precise nature of the chemical modification (dehydration, oxidation, conjugated carbonyl  bonding etc? Or as you assuming, perhaps mistakenly, that tables of figures and plotted graphs alone will lead you straight to answers, in the absence of any reference standards against which to make comparisons, e.g. thermal or other imprints from model systems? Or maybe you have chosen those reference standards already, but are keeping your cards close to your chest.  If so, please be more open with us (this being the informal blogosphere)  because endlessly holding up your gee-whizz AFM as the ultimate technology if in fact deployed in what looks suspiciously like a theoretical vacuum (from where I’m standing) is a research strategy that is hardly guaranteed to hold your readers’ attention for more that a few picoseconds at most. Sorry to be so candid, but it’s time to place those cards down on the table.\n","date":"January 2, 2016 at 3:20 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6635","author":"Colin Berry","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"First of all :\nI want to recall that is impossible\nto write on few lines…\nSo…\nDon’t try to make confusions mixing up all\nmolecules/arguments (= hemicelluloses,\nlignins, cellulose, etc.)\n— — —\nI think that talking about the use of AFM techniques\nis no longer to argue about an idea in the field\nof “disruptive innovation” …\nIn fact I, in 1998 (in Turin),\nI had indicated the use of AFM techniques as\nuseful ways to improve our knowledge on the Shroud.\nSo…\nFor sake of clarity we must distinguish two problems:\n 1 – discover the (probable) date of the material\n 2 – discover which was the BIF (= Body Image Formation)\n Here you can read the following vague descriptions:\nTo solve the problem to n. 1 I had indicated the way\nof the control with the use of AFM as possible in order\nto determine the degree of polymerization of the cellulose\n(and then to obtain an estimation of the epoch\n[more or less ancient, depending on the value of the\n“cellulosic DP” found during the controls. But we have\nto take into account the bacterial and fungal attacks!\nAnd this is only one side of the problems to solve…]\nwhich dates back to the material) …\nThe Norm I did consider in 1998 was the UNI 8282\n(viscosimetry, viscosity-average degreeof\npolymerization = DP-v).\nThe degradative scission of cellulosic chains can\nbe regarded as the changes in the number of\nglucosidic bonds…\nCellulosic degradation of linens caused by\nmicro-organisms can be followed by DP\nmeasurements and related to changes in the\nnumber of glucosidic bands broken….\nHere a possible reference:\n=>  The intrinsic viscosity was determinedaccording to UNI 8282 …\n“Effect of thermal accelerated ageing on the properties\nof model canvas paintings”\nA.M. Seves, S. Sora, G. Scicolone, G. Testi,\nA.M. Bonfatti, E. Rossi, A. Seveso\npublished in:\nJournal of Cultural Heritage 1 (2000)\n© 2000 Editions scientiﬁques el médieales Elsevier SAS.\nAll rights reserved\nFor problem n. 2 in addition to the AFM techniques\n(see also the CFM = Chemical Force Microscopy) we\nhave to use the Raman techniques not only to find all\nthe functional groups involved in the BIF, but to do the\ninteresting comparisons with the Lab experiments (and\nthe same is valid for the AFM/CFM controls.\nSee also AFM-Raman controls, etc.)…\nIn any case Raman techniques can be used to solve\nthe problem n.1 (See f.e. what was done by Eng. G. Fanti & C.)\n","date":"January 2, 2016 at 4:57 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6637","author":"piero","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"Obviously I had in mind to do checks with the AFM apparel\n(if possible …using AFM, CFM and AFM-Raman controls,..)\non some linen samples obtained after laboratory works\n(= BIF simulations)! … Included the “Corona Discharge” treated\nlinens and irradiated (with VUV = see f.e.: Paolo Di Lazzaro)\nlinen samples…\nBut we can also work on “more humble” linen samples…\nRemeber that moder linens are different with respect ancient materials…\nNo Optical bleaching,\nNo NaClO, etc….\n","date":"January 2, 2016 at 5:17 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6639","author":"piero","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"Your pro-authenticity bias is now showing piero.\nAny kind of bias in science, if not based firmly on a secure foundation of fact, is not science at all, but pseudo-science.\nBe warned piero. Pseudo-science, no matter how well disguised, is not welcome on this site.\n","date":"January 2, 2016 at 5:45 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6641","author":"Colin Berry","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"PS: I suddenly remembered we’ve been here before, piero, my having posted this (altered) cartoon to Dan Porter’s site in February last year:\n\nMy views on your AFM obsession have hardened since then, now that your pro-authenticity bias, dare one say mission, has become all too apparent. Do you want me to spell them out? I shall if you continue to proselytize AFM (with or without a supporting cast of other) as promising a pot of gold at the end of a rainbow. You know and I know that is not the case.\n","date":"January 2, 2016 at 8:34 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6644","author":"Colin Berry","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"There are only two ground rules where this humble site of mine is concerned. First, I insist on civility (which does not preclude forthright criticism on condition that it addresses the issues, not the perceived character faults of the man). \nSecond, I’m a firm believer in focus. Comments should be relevant to the posting. If one wishes to address an issue that is different from the latest posting, then please take the trouble to find a previous posting that is relevant, and attach one’s comment to that.\nHappy New Year, and happy blogging (respecting just two ground rules).\n","date":"December 30, 2015 at 6:10 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6625","author":"Colin Berry","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"Sorry, piero, but if it’s answers you seek from this simple soul, you will need to keep your questions simple and straightforward. Right now, your questions are making my head spin…\n","date":"December 30, 2015 at 4:04 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6624","author":"Colin Berry","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"I was  out of focus (because You indicated us\nan argument of History: “Geoffroy de Charny’s\nhumble chapel”, etc. ) and then\nI am displeased for that!\nSorry…\n— — — —\nHere are a few words that I had forgotten to write:\nUnfortunately I avoided to remember a famous\n“scottish failure”…\nOtherwise : 136 years after a famous bridge disaster\n(= 28 December 1879) Dan closed the blog…\nThe structural failure is also an interesting key\nto understand what can happen on linen fibrils\n(f.e.: submitted to radiations!)…\nColin, Your words (in the blog by Dan) about the railway\nbridge over the Tay estuary remembered me the\ncatastrophic failure that happened on the night of\n28 December 1879 : “the bridge collapsed after its central\nspans gave way during high winter gales…”\nAll seventy-five passengers were lost!\nBut the engine itself was salvaged from the river and restored…\nLink:\nhttps://en.wikipedia.org/wiki/Tay_Bridge_disaster\n— — —\nSo…\nI think we have to discuss something about\nStructural Mechanics and Materials Science…\nFor example:\n– A gradient theory of crystals plasticity under and after irradiations.\n– The results from some controls on cellulose defects…\n– The birefringence of linen fibrils (linen treated or not)\nunder strains…\n","date":"December 31, 2015 at 3:03 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6627","author":"piero","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"I’m all in favour of non-destructive techniques, piero (assuming  the Vatican allows a second “STURP” which I doubt will happen anytime soon).  If or when  it does, I’ll suggest a new protocol for testing the “blood”, considering the first was seriously mismanaged by Rogers, Heller and Adler, indeed botched. One has only to read Heller’s account in his book to see that is not an unfair accusation.The blood testing was indeed BOTCHED (the subject of my next posting). \nBut new techniques must not only be non-destructive. They have also  to be informative. That means the technique has to have been demonstrated to yield useful and interpretable data in  situations more straightforward than the TS. Pardon my saying, but I doubt that is the case for your AFM technique – unless piloted first with known model systems – notably ‘scorches’ generated by each of the three known methods of thermal energy transfer – conduction, convection and radiation. \nMy money is on conduction and/or convection.  Radiation may appeal to those attempting to link the TS with biblical resurrection, but it has huge theoretical obstacles to overcome if wishing to be taken seriously as a scientific explanation.\n","date":"December 29, 2015 at 7:13 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6614","author":"Colin Berry","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"First of all I beg your pardon because my poor answer\nwas not very respectful of what was possible to read in\nyour previous message.\nIn fact I was in a hurry, as evidenced by the addition of\na second message where I wanted to also mention that\nin the blog of Dan Porter I mentioned both the name of\nDr. Marco Leona (the Metropolitan Museum in New York)\nand the SERS technique (a technique where he appears\nto be an interesting specialist, for several years!)…\nDan Porter closed his blog without giving me a clear\nanswer on that point and then this could be further\ncause for sadness in this end of year …\nAm I wrong?\nEven the year 2015 ended without a real analytic progress.\nI think on this subject your sensitivity of chemical\nanalyst might help to deepen the issue.\nFor what concern the question of scientific model\nI can agree with you. But the continuous search for\na possible useful model should not reach the level\nof stop the analytical research (instrumental =\nAFM, CFM, Raman, SERS, etc.).\nAnother (a pessimist/realist approach) little note:\n … A scientific model may really explain the Resurrection?\nof that idea I doubt enough … (that is, in a nutshell,\nI doubt even what seems to be strongly supported\nby Ing. Giulio Fanti. Maybe science can not really\nexplain the Faith, as instead he claimed …).\nIn any case what we can observe on linen fibrils\ncould bypass our “very limited horizons”. That said\nI do not want to defend in a certain extremist way\nMark Antonacci and Art Lind …\nthey do not convince me yet (…but for sake of truth\nI have to say that, unfortunately, I have not yet bought\nthe last book by Antonacci. B.T.W.: Have you read\nthat new text?).\nAlso, if you want my advice for your trips to South / Central\nItaly, then I invite you to go for a ride to:\n– Manoppello (but I never went there)\n– Lanciano (I went there instead [several years ago!])\n– San Giovanni Rotondo (St.\nFather Pio. Even there I have never gone)\n","date":"December 30, 2015 at 3:43 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6622","author":"piero","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"I want to add that you could set up some interesting\nlab tests about the alleged reaction of alizarin (and purpurin)\nwith blood (see the inherent study on Heme-Alizarin\nwritten by Adrie van der Hoeven and the control of\nreaction temperatures) and in so doing can then\nclarify what happens in reality…\nSee also the behaviour of thin layers of\nstarched-and-madder-dyed linen…\n","date":"December 30, 2015 at 3:52 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6623","author":"piero","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"Hello piero. Welcome to the site.\nI’m just a boring old biochemist by training, and don’t have a clue about all these gee whizz physical scanning techniques that you continue to discover.\nHowever, the big however, even if I did, I would not be very optimistic about scanning the Shroud with your new positronor even AFM technique, considering it unlikely to  give immediate answers. Why not? Because one needs a theoretical model, maybe imperfect, but one that one can first model in the laboratory (or garage in my case) and scan using the same technique, in order to provide a baseline reference. Science operates best when it has reference models, even if they are highly simplified. \nNew York dialect? What prompted that ? Yes, I know New York, having visited it a few times while living and working in nearby Philadelphia. That was back in the 70s mind you, but I have fond memories of NY, it then having a vibrancy that hit you as soon as you stepped off the train.\nLondon too, which I visit every couple of weeks for pleasure, is now vibrant, but in a different way, being so very international. It’s a lot more  fun these days, exploring previously neglected streets and quarters, now packed with visitors, knowing there’s bound to be a good pub or restaurant close at hand, catering for the new influx. The Tube train is much better now too, with trains every 2 minutes on my regular routes.\nItaly: can you recommend a good tourist resort in the deep south?  I’ve never been further south than the Bay of Naples, and would now like to visit the “toe” and “heel”.\n","date":"December 28, 2015 at 4:20 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6605","author":"Colin Berry","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"PALS is a very interesting techniique.\nBut, for the moment, I prefer AFM techniques…\n— —\nI am referring to the dialect of\nNew York because of the type (the\n little man, perhaps a bit pathetic…\nJimmy Durante…!) indicated by Dan Porter\nin his last message (…the final farewell\nto all, in his interesting blog).\n— — —\nI live in northern Italy.\nI have been visiting the city of Bari (Puglia) only once.\nInstead I went only once in Sicily (near Taormina and\nthen, later, in Catania).\nI never went to Naples, but I know the famous story\nof Raimondo de Sangro, Prince of Sansevero …\nLink:\nhttps://en.wikipedia.org/wiki/Raimondo_di_Sangro\n","date":"December 29, 2015 at 3:49 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6612","author":"piero","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"Colin,\nAs you can see I wrote too fast … and I have erred by writing:\n“very interesting techniique.”\ninstead of\n“very interesting technique.”…\n… and it is obvious that it must be shown\nto be able to use the AFM techniques in a\ntruly non-destructive manner… or certainly\nwith minimum destructions!\n","date":"December 29, 2015 at 3:54 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6613","author":"piero","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"I have found a vague reference about the\nblood and the use of the AFM techniques…\nLink:\nhttp://www.nature.com/articles/srep06033\nIn any case, in 1998,\nI had indicated the AFM techniques as\nuseful way for determining the age of the\nlignocellulosic material (= determination\nof degree of polymerization of the cellulose\nby the use of AFM controls, etc.) …\nBut, see also:\nthe diffferent kind of operation\n(= another problem with respect the\ncontrols/evaluations about the cellulosic DP!):\nthe measurement of Young’s modulus ([= elasticity modulus] through\nAFM bending tests, indentation tests, etc.)…\n","date":"December 31, 2015 at 3:18 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6628","author":"piero","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"AFM? Atomic Force Microscopy? Or Annoyingly Futuristic Moonshine?\nHere’s some unsolicited but well-intentioned advice piero. If you can’t produce a detailed experimental protocol that has a reasonable chance of generating new insights, then make a New Year’s Resolution to stop cluttering up other people’s sites with your AFM mumbo-jumbo.\n","date":"December 31, 2015 at 5:37 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6629","author":"Colin Berry","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"Dear Colin,\nYou wrote:\n>AFM? Atomic Force Microscopy?\n>Or Annoyingly Futuristic Moonshine? … etc. …\nI appreciate your fair irony,\nsorry if I am boring.\n However…\nI think the Professor Engineer Giulio Fanti and\nthe new Scientific Committee of Engineers\n[= CRIS. See under the address:\nhttp://www.unipd.it/ilbo/sites/unipd.it.ilbo/files/Giornata%20di%20studi%20sulla%20Sindone%20a%20PD3.pdf ] should consider\nwhat I have written several times about AFM techniques.\n Therefore I am also referring to what was not presented\nduring the last conference in Bari (IEEE) on the Shroud …\nI think that you have to seriously consider the possibility\nto control linen fibrils with AFM techniques…\nAnd here it’s impossible to write (on few lines) a\nvery detailed experimental protocol …\n","date":"January 2, 2016 at 2:27 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6634","author":"piero","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"Have just spotted this comment on Stephen Jones’s site (which I refuse to link to until I get a proper apology for his falsely accusing me a while ago of  trolling his site under a pseudonym, and then proceeding to add further insult to injury):\nAs far as I’m aware there are no medieval paintings or sculptures depicting a naked Jesus Christ,( His genitalia are always concealed by a subligacum) so this peculiar aspect of the image of the Man of the Shroud is no doubt one of the many pieces of evidence pointing towards authenticity.\nThis is one point I usually highlight in my lectures about the Shroud.\nAntero de Frias Moreira\nCentro Português de Sindonologia\nDecember 28, 2015 at 7:35 PM\nThis is a non-argument, Dr.Moreira. Nobody disputes that the image on the TS is that of a recumbent man who, from the tidied-up position of his hands, is or was DEAD. By the same token, the position of those hands means that few if any finer sensibilities are going to be offended re exposed genitalia. They are NOT exposed, the hands serving exatly the same function in that regard as would be the case if the subject had been clothed.\nConclusion: one cannot cite the alleged “nakedness: as evidence against a medieval provenance, for the simple reason that the figure depicted is not that of a fully naked man, at least from the viewer’s perspective.\n Get real, you eternally wishful-thinking advocates of authenticity.  Let’s be having some genuine arguments please instead of these limp self-serving excuses for arguments.\n","date":"December 28, 2015 at 12:25 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6601","author":"Colin Berry","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"End of an era. Dan Porter finally closed up shop on his shroudstory site an hour ago. All comments threads have been closed (just as well since I had been planning an even-more surreal addition to that bizarre and dubiously-relevant  insertion from piero on what has to be the ultimate conspiracy theory, namely that all pre-1100 history has been cleverly faked!). \nI had to go a googlin’ to find the meaning of Dan’s “Goodnight, Mrs. Calabash, wherever you are” sign-off. It’s a reference to a catch-phrase made famous (in the US) by radio personality Jimmy Durante (1893-1980).\nhttps://en.wikipedia.org/wiki/Jimmy_Durante\nGoodbye Dan. You will be missed. Thanks for the appreciative comment in your final posting, my patience over 4 long years having finally been rewarded!\n","date":"December 28, 2015 at 9:45 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6600","author":"Colin Berry","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"Thank you about your intervention\nabout the strange ideas by Fomenko…\nYes, the New Chronology is terribly…\nB.T.W. in the blog by Dan we can read\n(an old argument):\n“What if, as the Russian mathematician Anotoly Fomenko\nbelieves, ancient Greece, Rome and Egypt were in\ninventions of the Renaissance and Jesus was was\nborn in A.D. 1053 and crucified in 1086. … … ”\n— — —\nInstead, here what I wanted to add (before\nthe “death of the blog”):\n>…still continuing in the review of the analytical tools now\nI would indicate what is the PALS …\n>Here an article:\nhttps://www.researchgate.net/publication/263940629_Perspective_of_Positron_Annihilation_Spectroscopy_in_Polymers\n“Perspective of Positron Annihilation Spectroscopy in Polymers”\nY. C. Jean,  J. David Van Horn,  Wei-Song Hung, Kuier-Rarn Lee\npublished in “Macromolecules” (Impact Factor: 5.8). 08/2013; 46(18):7133–7145. \nABSTRACT\nPositron annihilation spectroscopy (PAS) is a novel method that provides molecular-level information about complex macromolecular structure in a manner different from, but complementary to, conventional physical and chemical methodology. This paper presents a perspective of PAS in polymeric systems covering 12 aspects: historical, spacial, spherical quantum model, anisotropic structure, voids, positronium chemistry, time, positron annihilation lifetime spectroscopy and data analysis, variable monoenergetic slow positron beam techniques and depth profiling, elemental analysis, multidimensional instrumentation advances in PAS, and free volume and free-volume theories.\nPerspective of Positron Annihilation Spectroscopy in Polymers. Available from: https://www.researchgate.net/publication/263940629_Perspective_of_Positron_Annihilation_Spectroscopy_in_Polymers [accessed Dec 28, 2015].\n— — —\nAnother thing:\nNew York City English is one of the most recognizable of US dialects…\nDo you know that dialect? …\n","date":"December 28, 2015 at 3:51 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6604","author":"piero","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"Next posting here? I think it will be necessary to grasp a certain nettle as to who actually had legal title, i.e. owned in crude parlance, the Lirey Shroud at the time of its first display and thereafter. Charles Freeman – never my favourite historian due to glossing over or ignoring crucial detail – is now making out on the last two or three comments threads on the shroudstory site that it was the Lirey canons who owned the Shroud –  or at any rate considered themselves the owners – which if true would be convenient for his “just a painting, just a liturgical prop for an Easter ceremony” narrative.\nNo, those canons were NOT the owners. They were given the duties and responsibilities of stewardship and display, certainly, but that is not the same as having legal ownership, as was duly established much later. Stewards would have been affronted at having the Shroud transferred physically  from the Lirey church elsewhere, as happened decades later after Jeanne de Vergy becoming widowed in 1356, leaving them (or successors) with no key attraction to display. However, that is entirely different from signifying a loss of legal title if as seems likely they never had it in the first place.\nNothing  I’ve read so far, including ther Pierre d’Arcis memorandum that Freeman briefly cites in support of the canons as owners, suggests that those De Charny-appointed clerics and their successors were anything more than stewards.\n","date":"December 26, 2015 at 1:28 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6595","author":"Colin Berry","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"Thanks Hugh. I’ve only looked at the pictures so far. Interesting.\nAm looking forward to seeing your BSTS Newsletter 82! Merry Christmas.\n","date":"December 25, 2015 at 5:53 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6593","author":"Colin Berry","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"A while ago you were pondering about the burn holes, and whether they might have been designed to hide the fact that the shoulders were broken, as the figure was originally a crucifix. I’ve come across this recently: https://digilib.phil.muni.cz/bitstream/handle/11222.digilib/115545/1_Theatralia_14-2011-1_5.pdf?sequence=1\nwhich includes some movable armed crucifixes from 1350. More grist to the mill!\nHappy Christmas!\n","date":"December 25, 2015 at 10:18 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6591","author":"Hugh Farey","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"See the late addition to this posting, responding to a point raised by Angel on the shroudstory site, in which she claims that the man on the TS sports a ponytail.\n\nIf that ‘ponytail’ really represents hair, then why is the tone in that contrast-restored Shroud Scope picture totally different from the hair that is on the scalp as distinct from the neck and back region. The first is greyish, the second is reddish-brown.\nOne cannot assume the ‘ponytail’ represents imaging of hair, not in a medieval modelling scenario (I hesitate to use the term ‘forgery’ for reasons already alluded to). Why not? Because (a) one does not know what was used as subject (real person or effigy) and (b) one does not know the mechanism of imprinting or imprinting medium.\nAngel: you are making the common error of treating the TS image as it it were a photograph. It’s not.\n","date":"December 24, 2015 at 8:39 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6590","author":"Colin Berry","site":"colinberry"},{"title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?","post":"If you ask me, one  of those 5 or 6 chaplains exceeded his/their brief, possibly while his lord and master was being held captive in England for 18 long months. The brief was to make an imprint of the newly crucified Jesus in sweat and blood, as it might have appeared on Joseph of Arimathea’s linen, to accompany Hugh Farey’s life-size recumbent  wooden statue.  But with ample time on his hands,he got carried away, and made the dual sweat/blood imprint look FAR TOO REALISTIC. The rest as they say is history. Like taking away the statue, leaving what for all the world (bar those tedious sceptics) looked like it might be THE genuine 1st century shroud.\n","date":"December 23, 2015 at 7:16 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","id":"comment-6588","author":"Colin Berry","site":"colinberry"}]
