[{"title":"Who is Addai?","post":"Thank you Dan for this publication\nAccording to the Gospel of Hebrews – “And when the Lord had given the linen cloth to the servant of the priest, he went to James and appeared to him”\nThen based on above, I think most probably, Jesus gave the linen cloth to the James (but not to Peter)\n\n","date":"August 19, 2015 at 5:54 pm","url":"https://shroudstory.com/2015/08/19/who-is-addai/","cat":"history","id":"comment-208587","author":"Sampath Fernando","site":"shroudstory"},{"title":"Who is Addai?","post":"Interesting.  Of course no one in the Church has ever accepted the apocryphal writings as history or necessarily historical.  To use them to determine historical fact apart from the authority of the Church would be misguided, in my opinion.\n\n","date":"August 21, 2015 at 1:03 pm","url":"https://shroudstory.com/2015/08/19/who-is-addai/","cat":"history","id":"comment-208691","author":"Dcn Andy","site":"shroudstory"},{"title":"Who is Addai?","post":"Sampath, the risen Christ would not have given a burial cloth to the servant of the priest, of all people. It was an unclean object.\n\n","date":"August 21, 2015 at 1:35 pm","url":"https://shroudstory.com/2015/08/19/who-is-addai/","cat":"history","id":"comment-208695","author":"Louis","site":"shroudstory"},{"title":"Who is Addai?","post":"Thank you Louis. I don’t know why we can read that sort of statement in Gnostic gospels.  According to my understanding Jesus never consider anything as unclean like humans do. Jesus touch all sort of untouchable people.\nSo there must be a reason why Gnostic gospels have mentioned the Shroud in second century and not the canonical gospels in the first century. As such I don’t want to ignore gnostic gospels as today many people can identify Shroud as a genuine object.\nFurthermore today many Churches are not only discarding Gnostic Gospels but also they discarding the Shroud.\n\n","date":"August 22, 2015 at 5:06 am","url":"https://shroudstory.com/2015/08/19/who-is-addai/","cat":"history","id":"comment-208714","author":"Sampath Fernando","site":"shroudstory"},{"title":"Who is Addai?","post":"Hi Sampath\nYou are right about Jesus’ attitude. To provide an example, he lodged in the house of Simon the leper, in a leper colony, while he was on his way to Jerusalem on one occasion. The Israeli archaeologist Yigael Yadin,  who was convinced that Jesus was anti-Essene, thought that he did it on purpose in order to show the group what he thought about their views on rituals of purity.\nThat was typical of him, one way of demonstrating what God’s love meant.\nNow, that does not mean that others agreed with him, particularly the Sadducees, who were the priests controlling the Temple.\nAs for the Gnostic gospels, they have to be handled with care. They were written after AD 150, many of them also used the canonical gospels as sources, including the Gospel of Thomas. When it comes to their dualism a big problem is encountered. Studies are being made by respected European scholars, concentrating on a new way of understanding Christology, which may go to explain why the gnostics thought the way they did.\nWhat is called mysterium Christi began in the first century and continues till today.\n\n","date":"August 22, 2015 at 6:54 am","url":"https://shroudstory.com/2015/08/19/who-is-addai/","cat":"history","id":"comment-208716","author":"Louis","site":"shroudstory"},{"title":"Who is Addai?","post":"Louis you are a very good resource person. Thank you very much.\n\n","date":"August 22, 2015 at 10:47 pm","url":"https://shroudstory.com/2015/08/19/who-is-addai/","cat":"history","id":"comment-208743","author":"Sampath Fernando","site":"shroudstory"},{"title":"Who is Addai?","post":"You’re welcome, Sampath. I’ve been a Religion Writer for around twenty years.\n\n","date":"August 23, 2015 at 7:18 am","url":"https://shroudstory.com/2015/08/19/who-is-addai/","cat":"history","id":"comment-208761","author":"Louis","site":"shroudstory"}]
