[{"title":"Will the Alfred Rosenberg Diaries Tell Us Anything?","post":"At times, I feel sorry for those who are so dedicated to disbelief in either the concept of a deity or the authenticity of the Shroud so as to either ignore or disregard the evidence before us. I believe the main issue of the Shroud is not provenance but providence.\nThe Shroud’s near misses with oblivion including at least three times  barely escaping consumption by fire may not be “miraculous” but is certainly “providential.” And now we have a narrow escape from Nazis that were hunting for it.\nBut the most important sign of  providence is that it waited for science to catch up with it. Pia’s photographs were only a relatively  crude overture to the depth of the quantum examinations of STURP. Now even more vastly improved measurement devices functioning at the quantum level are available.\nAnd we are being hit with circumstances apparently unrelated that are focusing attention on the Shroud. Certainly any reference to the Shroud will in Rosenberg’s diary will be a big, big story. Yet, it will only be a part of an inexorable tide of interest that is sweeping across the world.\nIn Thus Spake Zarathustra, Friedrich Nietzsche celebrated the death of God. It had  happened in the extreme end of the Universe but the news was traveling to the world. Nietzsche wrote in the Nineteenth Century. The news arrived  not with a bang, but many bangs in the Twentieth Century. \nI realize that some of our agnostic or super physicist who read this blog may be upset by this statement: God is being reborn in this time and place through the instrumentality of the Shroud. The news has arrived.\nhttp://quantumchrist-jck.blogspot.com/\n\n","date":"June 14, 2013 at 8:23 am","url":"https://shroudstory.com/2013/06/14/will-the-alfred-rosenberg-diaries-tell-us-anything/","cat":"history","id":"comment-36945","author":"John Klotz","site":"shroudstory"},{"title":"Will the Alfred Rosenberg Diaries Tell Us Anything?","post":"This story about Hitler and his “obsession” with the TS is not new. He was born in a Catholic family and that was also the case with SS General Karl Friedrich Otto Wolff who is said to have received orders from the fuehrer to invade the Vatican but delayed the move,considering the idea to be madness. Relations with the Catholic Church were tense, as the friction between the Austrian Cardinal Theodor Innitzer and Berlin demonstrated. The American Jesuit Father Robert Graham is said to be the best authority in these matters but so far no one seems to be able to say anything with absolute certainty.\n\n","date":"June 14, 2013 at 8:59 am","url":"https://shroudstory.com/2013/06/14/will-the-alfred-rosenberg-diaries-tell-us-anything/","cat":"history","id":"comment-36948","author":"Louis","site":"shroudstory"},{"title":"Will the Alfred Rosenberg Diaries Tell Us Anything?","post":"First: “The shroud was transferred for its safety to the Benedictine sanctuary of Montevergine in Avellino, in the southern Campania region of Italy in 1939 and was only transferred to Turin in 1946.”\nThen : “The Holy Shroud was moved IN SECRET to the sanctuary in the Campania region on the precise orders of the House of Savoy and the Vatican.OFFICIALLY THIS WAS to protect it from possible bombing (in Turin). IN REALITY, it was moved to hide it from Hitler who was apparently obsessed by it. When he visited Italy in 1938, top-ranking Nazi aides asked unusual and insistent questions about the Shroud.”\nTo-day we know about the TS 20th c. CE CRYPTOhistory. Now arch-sceptics would like us to believe the TS has NO Late Antique and Medieval cryptohistory at all. In this, they are totally wrong (e.g. in terms of Late Antique cryptohistory, ‘just question’ early cryptochristians’ literature and iconography while in terms of Medieval cryptohistory, ‘just question’ Desert Egyptian hermits’, ‘Syriac monks’/hermits’, Benededictine monks’ and nuns’, French, Bavarian, Welsh poets’, Templars’ and affiliates’! How long will classical Art Historians be in denial of the TS Late Antique and Medieval cryptohistory?\n\n","date":"June 14, 2013 at 9:37 am","url":"https://shroudstory.com/2013/06/14/will-the-alfred-rosenberg-diaries-tell-us-anything/","cat":"history","id":"comment-36950","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Will the Alfred Rosenberg Diaries Tell Us Anything?","post":"Typo: How long will classical Historians and Art Historians be in denial of the TS Late Antique and Medieval cryptohistory?\n\n","date":"June 14, 2013 at 9:45 am","url":"https://shroudstory.com/2013/06/14/will-the-alfred-rosenberg-diaries-tell-us-anything/","cat":"history","id":"comment-36951","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Will the Alfred Rosenberg Diaries Tell Us Anything?","post":"Max: So long, until someone kicks some concrete out of the prestigious academic seats!\n\n","date":"June 14, 2013 at 2:21 pm","url":"https://shroudstory.com/2013/06/14/will-the-alfred-rosenberg-diaries-tell-us-anything/","cat":"history","id":"comment-36988","author":"O.K.","site":"shroudstory"},{"title":"Will the Alfred Rosenberg Diaries Tell Us Anything?","post":"I find it hard to accept that Hitler, of all people, would want the Shroud for any good reasons.  Knowing of some of the hateful, Godless atrocities that he and his  – committed before and during the war. Sounds like work of the Devil – Satan himself.\n\n","date":"June 14, 2013 at 2:28 pm","url":"https://shroudstory.com/2013/06/14/will-the-alfred-rosenberg-diaries-tell-us-anything/","cat":"history","id":"comment-36990","author":"Emmett","site":"shroudstory"},{"title":"Will the Alfred Rosenberg Diaries Tell Us Anything?","post":"Interesting.  This is what I would think is one of the reactions that could be expected of someone without faith.  The desire sounds superstitious.\n\n","date":"June 14, 2013 at 3:44 pm","url":"https://shroudstory.com/2013/06/14/will-the-alfred-rosenberg-diaries-tell-us-anything/","cat":"history","id":"comment-36996","author":"Andy Weiss","site":"shroudstory"},{"title":"Will the Alfred Rosenberg Diaries Tell Us Anything?","post":"Emmett: “Sounds like work of the Devil – Satan himself.”\nAgree! He instigated the original Fall of Humanity! He was there at the crucifixion! He was there at the burial. He was in the death camps. He has seen the image and He knows what it implies. He moved the hearts of men to evil atrocities. He would move his minion to capture the Shroud to hide the truth from later Ages. But the horseman, Faithful and True, will ride out in his blood-soaked cloak and He will be defeated! He is already defeated!\n\n","date":"June 14, 2013 at 4:46 pm","url":"https://shroudstory.com/2013/06/14/will-the-alfred-rosenberg-diaries-tell-us-anything/","cat":"history","id":"comment-36998","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Will the Alfred Rosenberg Diaries Tell Us Anything?","post":"if Christ appeared to the apostles to show them he actually rose from the dead why would He not leave and protect the existence of an object that shows his ressurection for the benefit future people.\n\n","date":"June 14, 2013 at 7:30 pm","url":"https://shroudstory.com/2013/06/14/will-the-alfred-rosenberg-diaries-tell-us-anything/","cat":"history","id":"comment-37018","author":"Paul","site":"shroudstory"},{"title":"Will the Alfred Rosenberg Diaries Tell Us Anything?","post":"\nPaul :\nif Christ appeared to the apostles to show them he actually rose from the dead why would He not leave and protect the existence of an object that shows his ressurection for the benefit future people.\n\nWhy shroud He? What benefit are you talking about?\nThen Jesus told him, “Because you have seen me, you have believed; blessed are those who have not seen and yet have believed.” John 20:29\n\n","date":"June 14, 2013 at 8:09 pm","url":"https://shroudstory.com/2013/06/14/will-the-alfred-rosenberg-diaries-tell-us-anything/","cat":"history","id":"comment-37022","author":"jesterof","site":"shroudstory"},{"title":"Will the Alfred Rosenberg Diaries Tell Us Anything?","post":"Doubting Thomas went on to preach the Good News (Gospel) and tradition says he was martyred in India. He believed becasue he saw. “Behold the signs of the tines.” The Shroud is a sign for our times. We live in an era when militant atheisim has Cristianity under attack, science is its cudgel. So in this time and place we have a sign that can only be realized completely throgh science. That IMVHO is Providence.\n\n","date":"June 15, 2013 at 3:46 am","url":"https://shroudstory.com/2013/06/14/will-the-alfred-rosenberg-diaries-tell-us-anything/","cat":"history","id":"comment-37074","author":"John Klotz","site":"shroudstory"},{"title":"Will the Alfred Rosenberg Diaries Tell Us Anything?","post":"That is a valid point, of course, however even at the times of militant atheism not existing these words were said and , sadly, they are true today as they were 2000 years ago :\n“He said to him, ‘If they do not listen to Moses and the Prophets, they will not be convinced even if someone rises from the dead.'”\nTherefore I doubt modern-time rabid atheists will believe even if they would have a direct proof…some – maybe, but not everybody…\n\n","date":"June 15, 2013 at 4:08 pm","url":"https://shroudstory.com/2013/06/14/will-the-alfred-rosenberg-diaries-tell-us-anything/","cat":"history","id":"comment-37116","author":"jesterof","site":"shroudstory"},{"title":"Will the Alfred Rosenberg Diaries Tell Us Anything?","post":"what benefit did the apostles get from seeing the risen Christ?\n\n","date":"June 15, 2013 at 4:51 pm","url":"https://shroudstory.com/2013/06/14/will-the-alfred-rosenberg-diaries-tell-us-anything/","cat":"history","id":"comment-37119","author":"Paul","site":"shroudstory"},{"title":"Will the Alfred Rosenberg Diaries Tell Us Anything?","post":"ask them :-)\nread The Acts.\n\n","date":"June 15, 2013 at 6:21 pm","url":"https://shroudstory.com/2013/06/14/will-the-alfred-rosenberg-diaries-tell-us-anything/","cat":"history","id":"comment-37122","author":"jesterof","site":"shroudstory"},{"title":"Will the Alfred Rosenberg Diaries Tell Us Anything?","post":"\njesterof :\nask them :-)\nread The Acts.\n\n I have read the acts and that is my point. His apperance proved His ressurection and gave them the strength to do what he told them. As they had proof why is it inconcievable that He would not leave material proof of His resurection for our strength.\n\n","date":"June 16, 2013 at 1:52 pm","url":"https://shroudstory.com/2013/06/14/will-the-alfred-rosenberg-diaries-tell-us-anything/","cat":"history","id":"comment-37159","author":"Paul","site":"shroudstory"},{"title":"Will the Alfred Rosenberg Diaries Tell Us Anything?","post":"Why would He do that?\nIf His whole teachings are based on trust and belief.\nAnd He knew, “For those who believe, no explanation is necessary. For those who do not believe, no explanation will suffice.”\n\n","date":"June 16, 2013 at 4:26 pm","url":"https://shroudstory.com/2013/06/14/will-the-alfred-rosenberg-diaries-tell-us-anything/","cat":"history","id":"comment-37165","author":"jesterof","site":"shroudstory"},{"title":"Will the Alfred Rosenberg Diaries Tell Us Anything?","post":"Satan knows the bottom line to this. It needs not to be explained.  Be rid of tangible proof of Jesus the Lord Son of God.\n\n","date":"June 16, 2013 at 6:54 pm","url":"https://shroudstory.com/2013/06/14/will-the-alfred-rosenberg-diaries-tell-us-anything/","cat":"history","id":"comment-37175","author":"Emmett","site":"shroudstory"},{"title":"Will the Alfred Rosenberg Diaries Tell Us Anything?","post":"\njesterof :\nWhy would He do that?\nIf His whole teachings are based on trust and belief.\nAnd He knew, “For those who believe, no explanation is necessary. For those who do not believe, no explanation will suffice.”\n\nI  remeber reading somewhere seek and you shall find but I do not remember any limits placed on where to seek\n\n","date":"June 17, 2013 at 9:06 pm","url":"https://shroudstory.com/2013/06/14/will-the-alfred-rosenberg-diaries-tell-us-anything/","cat":"history","id":"comment-37247","author":"Paul","site":"shroudstory"},{"title":"Will the Alfred Rosenberg Diaries Tell Us Anything?","post":"so seek, nobody puts any limits on your seeking.\nPaul, I honestly do not understand what is your point in asking, why won’t God do this or that.\n\n","date":"June 17, 2013 at 9:40 pm","url":"https://shroudstory.com/2013/06/14/will-the-alfred-rosenberg-diaries-tell-us-anything/","cat":"history","id":"comment-37248","author":"jesterof","site":"shroudstory"}]
