[{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"“I have never believed the letters were real but thought it was reasonable that the shroud made its way to Edessa. That something was in Edessa that sounds like the shroud still seems like a real possibility.”\nAgree!\n\n","date":"January 6, 2014 at 6:03 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72387","author":"Matthias","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"If the letters are not real, then there is NO GOOD REASON to suspect the Shroud folded in 8 parts could have been in Edessa.  If the letters are not genuine, then the Mandylion (which is a later addition to the legend) has very good chances to be non-genuine too.  This is pure logic.\n\n","date":"January 6, 2014 at 11:41 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72410","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Faulty logic. As others have alluded to the letters may be fiction but based on some truths, such as the possibility that the Mandylion may have been in Edessa folded as a tetradiplon. I’m not claiming that this is a fact. It’s just a possibility which you have not acknowledged.\nThe ancients often mixed fact and fiction. Personally, I see fact mixed with quite a lot of fiction (or what Borg calls “history metaphorised”) in the gospels. People get themselves in trouble when they view many of these ancient texts as either “fiction” of “literal truth” in a black and white sense, when they are often a combination.\n\n","date":"January 7, 2014 at 2:42 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72459","author":"Matthias","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Yannick:\nTaking this HISTORICAL FACT into account (look like this is something Ian Wilson haven’t done),\nHISTORICAL FACT ??? Or rather just scholarly OPINION?\nThe thing is not so easy Yannick. While it is highly probable that those letters between Abgar and Jesus are not authentic in the form (or rather forms) we know today (their authenticity was already questioned by Jerome and Augustine in the 4th-5th century, and was rejected by Decretum Gelasium as apocrypha), we cannot be sure that there were no correspondence at all. Remember the letter migh have been lost during pagan reaction in Edessa in the mid 1st century AD, and could have been reconstructed from memory with several interpolations.\nOn which basis those so called ‘experts’ claim that the correspondence cannot be authentic? Do they have a direct evidence for this? No, it’s only their (very often prejudiced, and a priori assuming negative) OPINION. The letters are of course suspect, but the case is not so simple as it seems to often narrow-minded ‘experts’ (especially New Testament scholars).\nAnd remember: there are no such things like HISTORICAL FACTS. There are only events described in historical sources which can be accepted, or rejected by historians. \n I ask you this: Since the whole Abgar legend is mainly resting on those (false) letters supposedly written by Abgar and Jesus\nNot true, the letters are actually the least important part of the story.\n, how in the world can the Mandylion (which is a much later addition to the legend) can have any chance to be authentic?\nAssociation fallacy.. There is no direct relation between the letters and the Mandylion.\n\n","date":"January 6, 2014 at 6:16 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72390","author":"O.K.","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"With all due respect for the enormous effort to trace the Shroud’s provenance back to Edessa or any other place, they are essentially legends. Physical facts are not legends they are facts. That is why the scientific examinations of the Shroud are crucial and determinant.\nI think Wilson’s work on the Vignon markings was very important. Both the markings on the Shroud and its artistic progeny are again physical facts. I am more comfortable relying on those.\n\n","date":"January 6, 2014 at 6:56 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72396","author":"John Klotz","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Each to their own John. I’ve never found the Vignon markings compelling.\n\n","date":"January 6, 2014 at 7:00 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72397","author":"Matthias","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Clearly some person, almost certainly in Edessa wrote the Abgar letter and had a deliberate purpose in mind in doing so. Eusebius gives a version of the story in 325AD, which he claimed to have obtained from the Edessa archives, but asserts it as a forgery. He does not mention the portrait, most likely because he is something of an iconoclast. \nJack Markwardt offers to my mind a very credible explanation. He notes that it was unlikely to have been written in the 1st century as it would then make Edessa so apostolically pre-eminent that it would never have subordinated itself in 200AD to the Church in Antioch. \nMarkwardt postulates that it was written at the behest of Abgar the Great to mark the city’s conversion to Christianity. It was written as an allegory out of caution. A papal mission to Edessa could only have occurred during the reign of the tolerant emperor Commodus between 180AD and 193AD. An Edessan coin during this period shows Abgar the Great with a cross on his tiara, and also the emperor Commodus. In 194AD the succeeding emperor Septimus Severus took Abgar’s rule from him for supporting Parthia against Rome, but he was retored to favour in 198AD. On the accession of the less tolerant Severus, Abgar neutralised the Christian imagery of his coinage. \nPope Eleutherius would only have dispatched a mission to Edessa during the period 180AD to 189AD. Abgar would not have accepted baptism after 193AD. In 201AD, Severus banned conversions to Christianity. The dilemma of recording the significant event of the city’s conversion was overcome by invoking the “disciplina arcana” and writing it up as an analogy (parables again!). \nThus in the Abgar legend, we can make the following substitutions: Abgar the Great seeking redemption becomes Abgar Ukkama a first century monarch seeking a cure; Abgar’s letter to Pope Eleutherius becomes his distant predecessor’s correspondence to Jesus; Ma’nu the royal emissary to Eleutherius becomes Hanan the 1st century archivist as emissary to Jesus; Eleutherius who authorises a papal mission becomes Jesus approving a posthumous apostolic mission; Bishop Avircius the papal missionary becomes Addai Christ’s emissary; Palut, Avircius’ companion and future bishop of Edessa, becomes Aggai, Addai’s principal aide. \nThere is much more to it. For those who wish to pursue Markwardt’s explanation further, refer: “ANCIENT EDESSA AND THE SHROUD: HISTORY CONCEALED BY THE DISCIPLINE OF THE SECRET” By Jack Markwardt, 2008 Ohio Conference:\nhttp://ohioshroudconference.com/papers/p02.pdf \nMarkwardt also asserts that the Mandylion had a role in Abgar’s conversion, but believes it was mainly stored in Antioch, until that city’s destruction by earthquake and the Persians, when it was then taken to Edessa. Certainly there was some venerated cloth object in Edessa, very likely with an image, and generally known as the Image of Edessa, or Mandylion, and quite conceivably it may have been the Shroud, but showing only the facial image.\n\n","date":"January 6, 2014 at 7:22 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72398","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Dave:\nClearly some person, almost certainly in Edessa wrote the Abgar letter and had a deliberate purpose in mind in doing so. Eusebius gives a version of the story in 325AD, which he claimed to have obtained from the Edessa archives, but asserts it as a forgery. He does not mention the portrait, most likely because he is something of an iconoclast.\nSome corrections, Eusebius asserts that the correspondence between Jesus and Abgar is genuine. Only later it has been discounted by Jerome and Augustine, on the basis that no authentic writings of the Savior would have been preserved in the Apostolic Church.\nThe Abgar story, according to Eusebius, can be found here: http://www.newadvent.org/fathers/250101.htm (‘Church History’, Book 1, chapter 13).\nLater version from Doctrine Addai (written between 4th-6th century): http://www.apostle1.com/doctrine-addai-syriac-orthodox1.htm\nAccording to Egeria (circa 384 AD):\nhttp://digital.library.upenn.edu/women/egeria/pilgrimage/pilgrimage.html\nThere are even more versions of it. There is an apocryphal text, called Greek Letter of Abgar, consisting of two letters, and a story of Mandylion. \nIt is however worthy to note, that in the Acts of Thaddeus written circa 600 AD (although New Advent claims 250 AD see http://www.newadvent.org/fathers/0826.htm ) there is no written letter of Jesus, only oral message. It is one of the two texts (the other is  ‘Story of the Image of Edessa’, written by, or on behalf of Constantine VII Porphyrogennetos) where the term tetradiplon appears.\n\n","date":"January 6, 2014 at 8:19 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72400","author":"O.K.","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Sorry , the sentence above is little bit confused, it should have been: \nOnly later it [the correspondence] has been discounted by Jerome and Augustine, on the basis that no authentic writings of the Savior had been preserved in the Apostolic Church, and they would have, had any of them existed.\nOr something in this way.\n\n","date":"January 6, 2014 at 1:55 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72417","author":"O.K.","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"As a wise man once said, “there is no smoke without fire”. I never believed the letters were authentic but I think they were made up to try to explain the presence of the Mandylion in Edessa. The description of the Mandylion as an Image not made by hand, sweat imprint, tetradiplon, coincides perfectly with the shroud. The art showing the Mandilion being received from Edessa as a long cloth with a face sticking out also makes sense.\n\n","date":"January 6, 2014 at 9:06 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72401","author":"Mike Morcous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Thank you for the link, Dale Martin is an excellent teacher and a captivating orator.\n\nTake a stand, decide you’re going to do something crazy and have an opinion.","date":"January 6, 2014 at 9:56 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72406","author":"anoxie","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"And I love the motto of his New Testament class, which is DOUBT EVERYTHING!!!  When you are doing real historical research (whether it concern the New Testament, the Shroud or anything else), this is the best motto to keep in mind…\n\n","date":"January 6, 2014 at 11:44 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72411","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"To me, the letters as well as the Mandylion are both forgeries that were probably not done at the same time (the letters clearly pre-dates the Mandylion in written accounts) but I really think they both served the same purpose:  To back-up the “orthodoxy” of the main Church in Edessa and to serve as powerful tools in his fight against heretic movements like the Monophysite Church that was present in Edessa (these people were denying the reality of God’s incarnation in Jesus-Christ’s flesh). The historical context of the first few centuries in Edessa strongly suggest that both the letters and the Mandylion were forgeries done for that purpose…\n\n","date":"January 6, 2014 at 11:50 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72412","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"History is replete with examples of events, people, artifacts, documents, etc. which, over time, have been misrepresented for reasons that have nothing to do with fraud or any other form of deception.  I’ll offer up a (completely off-topic) example.\nAmericans with an interest in naval history may recall some of the controversy in the 1990s surrounding the identity of the U.S.S. Constellation, one of the few surviving warships from the age of sail.  It is currently moored at the Inner Harbor in Baltimore, Maryland.  While everyone agreed the ship existed and that it was old, the question was how old, and which ship was it?\nWas it the U.S.S. Constellation constructed in 1797 — one of the six original frigates of the U.S. Navy and a sister ship of the U.S.S. Constitution, the oldest comissioned warship still afloat?[1]  Was it a separate ship, a sloop-of-war constructed in 1854?[2]  Was it an extensive refit or partial reconstruction, with pieces of the original frigate used to construct the hull of a new vessel?  The U.S. Navy was adamant: there was only one ship named Constellation in the Navy List, and it was never stricken.  Therefore, the ship at Baltimore had to be the original.  Historians were less certain.\nLong story short: an extensive, multi-disciplinary investigation was conducted (sound familiar?), and the team was able to determine the truth: they were two separate ships.[3]  There was never an attempt to deceive, just some sloppy record keeping by the Navy — which also very much wanted to believe it still had not one but *two* of its original 6 frigates.\nI think anyone reading this blog recognizes many of the scenarios or possibilities the team investigated.  They are the same that come up when debating the Shroud or any relic.  The only difference, of course, is that the Constellation finally yielded a clear answer to its true identity — something the Shroud stubbornly refuses to do.\nHistory often works in the exact opposite way from science.  STURP investigated and concluded it could not say what the Shroud image was, only what it was not.  The Shroud’s Edessan sojourn is one of several possibilities, none of which can positively be disproved.  So, I’m going to agree with John Klotz: all this is extremely interesting, but it needs to be approached as backstory.  History, art, even Scripture — none of them can positively rule out authenticity.  The Shroud itself, and therefore the science, is the most compelling evidence.  \n[1] http://en.wikipedia.org/wiki/USS_Constellation_(1797)\n[2] http://en.wikipedia.org/wiki/USS_Constellation_(1854)\n[3] http://www.dt.navy.mil/cnsm/docs/fouled_anchors.pdf\n\n","date":"January 6, 2014 at 12:27 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72414","author":"Jeffrey Liss","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"In my mind, what is very important to understand when we try to analyze the probability of Wilson being right or wrong with his idea that the Mandylion was the Shroud folded in 8 parts is the HISTORICAL FACT that the letters were the whole base of the Abgar legend and, only later on (possibly a few centuries later), the whole concept of an « image of Jesus not made by human hands » was ADDED to the original legend. In such context, if all the independent scholars (independent versus the question of the Shroud authenticity) agree to conclude that those letters were not genuine at all, I think the most rational conclusion is to, at the very least, also seriously doubt the possibility that the Mandylion could have been the same cloth as the Turin Shroud.\n\n","date":"January 6, 2014 at 12:48 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72416","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"I don’t think it is historical fact (or FACT) that the letters were the basis of the Abgar legend. I think daveb is closer to the mark in suggesting that it was the other way round – the legend stimulated the letters. The letters then become irrelevant, and what is important is the origin of the legend, which presumably was itself designed to explain how Jesus’s image came to be in Edessa at all.\nBut really, it cannot be said to be historical FACT that the letters didn’t orginally exist. For all I know Dr Dale is quite correct, and I dare say would substantiate some of his claims further in scholarly debate, but he only offers two pieces of evidence to his undergraduate class; firstly that Jesus couldn’t write Greek, and secondly that the letters contain similarilities to the Gospel of John. Neither of these is any real objection at all.\nFirstly, if a person who couldn’t speak Greek wanted to write a letter to someone who did, he went to a professional translator, who wrote the letter for him. In some countries this is still quite common.\nSecondly, the fact that the same person sometimes says the same things in similar contexts is hardly surprising, especially if that person is a teacher. We do repeat ourselves, I find…\nOK is quite correct. This is scholarly opinion, not historical fact.\n\n","date":"January 6, 2014 at 1:56 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72418","author":"Hugh Farey","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"I think i’ve got my answer concerning conspiracy theories.\n\n","date":"January 6, 2014 at 2:22 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72420","author":"anoxie","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Good points, Hugh.\n\n","date":"January 6, 2014 at 2:49 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72422","author":"O.K.","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Since history is not an “exact” science, it is open to all kind of spéculations and many people in the pro-Shroud world are experts when it comes the time to turn things around always in favor of the authenticity of the Shroud (at all cost I should say).  But take a wide bunch of historians specialized in the first centuries of Christiandom (those from outside the pro-Shroud world) and I can assure you that there would not be a lot to buy the idea that the Abgar legend (and the letters that were used to back-it up at the same time it was created or a bit later) could, near or far, be rooted in real historic facts related to Jesus of Nazareth and King Abgar V of Edessa because it is a well-accepted conclusion that the first Christian church in Edessa only appeared during the second century.  Listen carefully to what prof. Dale Martin say about the total absence of any recognition of Jesus Christ by non Jewish kings during the time he preached or even during the first few decades after his death and resurrection, and you’ll understand easily that he’s one expert among a majority of unbiased scholars who don’t trust anything regarding the possibility that the Abgar legend and the 2 « attached » letters could be authentic in any way…\n\n","date":"January 6, 2014 at 3:40 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72425","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"In such context, if all the independent scholars (independent versus the question of the Shroud authenticity) agree to conclude that those letters were not genuine at all,\n…then they all certainly must be wrong!\nThe historical context of the first few centuries in Edessa strongly suggest that both the letters and the Mandylion were forgeries done for that purpose…\nThe historical context is no evidence at all. It may suggest this or may suggest that, depending on the current context; that is which opinions (NOT FACTS!!!) are currently fashionable in academic circles.\nHISTORICAL FACT that the letters were the whole base of the Abgar legend and, only later on (possibly a few centuries later), the whole concept of an « image of Jesus not made by human hands » was ADDED to the original legend.\nThere are no HISTORICAL FACTS per se, only facts that were described in historical sources. And we have no evidence that the concept of an « image of Jesus not made by human hands » was ADDED to the original legend. One can find good reasons why it is not mentioned in the earlier versions of the Abgar legend, further one can find in the text of Eusebius, an iconoclast, some probable allusions to the image.\nI think the most rational conclusion is to, at the very least, also seriously doubt the possibility that the Mandylion could have been the same cloth as the Turin Shroud.\nObviously you have the right to do so, but your arguments are weak and I find rather quite demagogical. What has the issue of the authenticity of the text of the purported letters to the Mandylion? They are two separate issues.  \nThe letters exist in many versions -I hardly believe any of them is the original one, if there had been any letters (the current text being faked, or at least interpolated does not imply there were no letters at all). One should remember that some of them (with exception of the Doctrine Addai) are translations from Syriac into Greek or Latin. We don’t know the language of the purported original, whether Syriac, as implied, or the Aramaic (they were quite similar). And so on.\nAnd I am quite certain that the mandylion brought to Contantinople in 944 was actually the Shroud of Turin. Less so that the original Abgar’s Mandylion was the Shroud.\n\n","date":"January 6, 2014 at 2:42 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72421","author":"O.K.","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"@O.K. : “There are no HISTORICAL FACTS per se, only facts that were described in historical sources. ”\nSo glad to meet the last postmodernist! ;)\n\n","date":"January 6, 2014 at 4:07 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72428","author":"Tristan Casabianca","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Agree with the others who say that the Shroud made it’s way to Edessa, though the letters are likely forged. Didn’t Max Frei find pollen from Urfa on the Shroud(and before Ian Wilson’s Mandylion theory was public)? Or is he not considered reliable anymore?\n\n","date":"January 6, 2014 at 3:37 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72424","author":"Chesterbelloc","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"The fact is this:  there are absolutely no ancient record of the presence of a burial shroud of Christ in Edessa.  Nothing at all.  And you seem to dismiss the FACT that the Mandylion was a much later addition to the Abgar legend than the 2 letters.  So, again, I’ll ask you : If the letters are false, then why not the Mandylion, who appeared in the legend much later?\n\n","date":"January 6, 2014 at 3:42 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72426","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"For those interested in penetrating the mystery of the Abgar legend, I can only urge them to read with some discernment the Markwardt paper I referenced at #6 above. Included in the paper is an indication that the so-called Image of Edessa may well have had a part in the conversion of Abgar the Great. In summary: \n1) A 6th c. entry in the Liber Pontificalis records that Pope Eleutherius (174-189) received a letter from ‘British king Lucius’ (Britannio rege Lucio) asking that he might be made a Christian through his agency. Venerable Bede in 731 repeats this account, and that the king’s baptism was soon effected. However, Britain in the 2nd century was under Roman rule and had no king.  \n2) In 1904, Adolph Harnack deduced that the entry was not intended to refer to Britain, but to the ‘Britio Edessenorum’, Edessa’s citadel, and not to King Lucius, but to King Lucius Ælius Septimius Megas Abgarus VIII of Edessa, otherwise known as Abgar the Great. \n3) Abgar’s letter to Eleutherius could only have been sent with his most trusted confidantes, his ‘pasgriba’ and father-in-law Ma’nu, and his wife (Ma’nu’s daughter) Queen Shalmath. \n4) There is only one documented late 2nd c. ecclesiastical journey which begins in Rome and ends in Mesopotamia, that by Avercius Marcellus, bishop of Hieropolis (180-200), recorded on his epitaph and repeated in two other accounts. \n5) Avercius recounts that he is a disciple of a holy shepherd who feeds flocks of sheep on mountains and on plains, “And to Rome he sent me to contemplate majesty, and to see a queen golden-robed and golden-sandaled; there also I saw a people bearing a shining mark.” The reference to a queen would seem to imply Queen Shalmath. \n6) On departing Rome, Avercius writes: ““And I saw the land of Syria and all its cities, Nisibis I saw when I passed over Euphrates”. He would have travelled on the Silk Road, through Edessa and Antioch. The glaring omission of both these cities in the narrative may suggest that something historic, but too dangerous to acknowledge, may well have occurred there. \n7) Avercius also seems to write: ““But everywhere I had brethren. I had Paul.” The Doctrine of Addai records that a Christian named Palut serves as an aide to the missionary Addai, and on his death assumes leadership of the Edessan Church. A cleric named Palut was appointed by Bishop Serapion of Antioch in 198 to establish orthodox Christianity in Edessa, and in 200 was ordained first bishop of Edessa. \n8) Avercius writes further: “Faith everywhere led me forward, and everywhere provided as my food a fish of exceeding great size, and perfect, which a holy virgin drew with her hands from a fountain and this it ever gives to its friends to eat, it having wine of great virtue, and giving it mingled with bread.” A “fish of exceeding great size” could hardly refer to the eucharist (more usually rendered as a small fish held in both hands, and also separately mentioned by the reference to bread and wine).  \n9) The reference to the ‘great fish’ might well indicate that Avercius was entrusted with temporary custody of the Shroud as part of his missionary kit to Edessa, and may explain the inclusion of the the portrait in the Abgar story.\nAs I have explained at #6, the account of the conversion of Abgar and Edessa was too dangerous to set down in its literal form, but was written up as an analogy. Only the names were changed, to protect the guilty!\n\n","date":"January 6, 2014 at 5:38 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72431","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Be careful folks (and Dave), because it is a well-known fact that Markwardt, on the contrary to many scholars who doesn’t believe that the Abgar legend, the letters or the Mandylion were genuine, is an active pro-shroudie…  I don’t say that this necessarily equal “bias”, but personally, when it come to historical researches that can be somewhat related to the Shroud history (like the legend of Abgar and the letters and Mandylion associated with it), I will always tend to give more credit to historians that have no interest whatsoever in questions regarding the Shroud…\n\n","date":"January 6, 2014 at 5:44 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72433","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Why don’t we look at the evidence Markwardt gives instead of going personal? I find Anonymous to be unreasonable because he/she generalizes a lot.. Historians who are pro-shroudies and non-shroudies…why are we bunching everybody, labelling some opinions as facts and dismissing others as legends? They are Opinions at best…..nothing mentioned in this thread can be labelled Fact yet.\n\n","date":"January 6, 2014 at 7:22 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72438","author":"Mike Morcous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Yannick: \nListen carefully to what prof. Dale Martin say about the total absence of any recognition of Jesus Christ by non Jewish kings during the time he preached or even during the first few decades after his death and resurrection, and you’ll understand easily that he’s one expert among a majority of unbiased scholars who don’t trust anything regarding the possibility that the Abgar legend and the 2 « attached » letters could be authentic in any way…\nI have listened. And if you want to know my opinion, Dale Martin showed that he is ignorant moron.\nThis a great example of incompetence of the so-caaled Biblical Scholars.\nA quote from Eusebius on the purpotred letters (boldings mine)\nI have inserted them here in their proper place, translated from the Syriac literally, and I hope to good purpose.\nGreek? What Greek, to hell? Has this guy even read what had been written?\nJesus couldn’t write Greek? Funny. Hardly believable for someone who spent his childhood in hellenized Egypt, and semi-hellenized Galilee. Greek was lingua franca of its time, just like English today.\nAnd secondly that the letters contain similarilities to the Gospel of John.\nYes, but as Hugh noticed, this is not evidence yet.\nBut take a wide bunch of historians specialized in the first centuries of Christiandom (those from outside the pro-Shroud world) and I can assure you that there would not be a lot to buy the idea that the Abgar legend (and the letters that were used to back-it up at the same time it was created or a bit later) could, near or far, be rooted in real historic facts related to Jesus of Nazareth and King Abgar V of Edessa because it is a well-accepted conclusion that the first Christian church in Edessa only appeared during the second century.\nI will always tend to give more credit to historians that have no interest whatsoever in questions regarding the Shroud…\nYannick and everyone -I recommend exactly opposite way. Give less, or sometimes no at all credit to those, who have no interest about the Shroud. Their ignorance, stupidity, narrow-mindness, incompetence, bias, prejudices, a priori convictions, are terrifying! And those idiots are presented  as wowthorities of the New Testament era!\n\n","date":"January 6, 2014 at 6:11 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72434","author":"O.K.","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"I think I can agree with most of what O.K. has written above. I cannot recall a single paper contributing to our understanding of the TS that was ever written by a scholar with “no interest whatsoever in the Shroud”. In fact such an inference would be self-contradictory. \nIt is evident that the phantom of Yannick continues to misunderstand such issues, as did his more corporeal predecessor. \nWhat does it mean to say that a document, such as the Doctrine of Addai, is unauthentic?  Clearly it was written by some person of influence living in Edessa, with an interest in that city, and with a deliberate purpose in mind, apparently in an attempt to explain how Christianity came there, and as Eusebius mentions included in the Edessa archives. As such it is pseudonymous, a common enough practice for good reasons, as even Yannick’s current hero, Dale Martin mentions in his video. It was not written by some random individual from Babylon for no purpose whatsoever. \nIt is a serious mistake, as Markwardt shows, to take the story at its face value, as a letter from Agbar Ukkama to Jesus, and that Jesus provided a written response, and then claim that the story therefore has no significance. However, those brought up on a diet of literalism, will never understand such a distinction. The tradition of the “disciplina arcana” was never accepted nor understood by the 15th century Protestant reformers, determined to claim a strict literalism in the scriptures, and this outlook has permeated and persists in much of ordinary secular scholarship even yet. \nYannick and the army of scholarly detractors, will never be able to penetrate the meaning of the Abgar legend, so long as they continue their narrow focus on a literal interpretation of the text. The Doctrine of Addai is pseudonymous, not only in its authorship, but also in its caste of characters, as Markwardt has effectively shown with a most credible explanation of its actual meaning. It is more fruitful to address the issues, rather than to cast doubts on the integrity of persons writing about them.\n\n","date":"January 6, 2014 at 7:21 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72437","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Why all this big noise when it comes to the letters? The Mandylion in Edessa does not depend on them. It is likely that the legends grew as a result of the need to explain how the Mandylion/Turin Shroud reached the city, assuming they were one and the same object.\n\n","date":"January 6, 2014 at 8:30 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72443","author":"Louis","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"A significant problem with the Shroud, often exploited by its detractors, and recognised by Ian Wilson, is its apparent lack of provenance prior to 1355. Therefore any clue which may clarify this situation is worth pursuing. The Abgar story may well be one tenuous link in that chain of provenance. Jack Markwardt’s explanation, too long ignored by those interested in this problem, offers a credible explanation of what may actually may have been behind the Abgar story and the much discussed Image of Edessa. Hence I have taken a little trouble to set it out in some detail, for the possible enlightenment of those interested and not prepared to take the trouble to read it for themselves.\n\n","date":"January 6, 2014 at 10:04 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72446","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Much appreciated, Dave. This whole thread has made for fascinating reading. While I find it extremely doubtful that Jesus ever wrote any letter to anyone (when he never left so much as a post-it for his own apostles) the legend of the letter, as a allegory, is very intriguing.\n\n","date":"January 6, 2014 at 10:43 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72447","author":"David Goulet","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"The Bollandist Vita Alexius calls the Image of Edessa “sine humano opere imago Domini nostri Jesu Christi in sindone” , i.e. “an image of our Lord Jesus Christ made without human work on a sindone”; also the Latin Cod. Monac. Aug. S.Ulr. 111 says “Edisse [venit] in urbem, in qua sanguinea domini serva[ba]tur ymago non manibus facta”, i.e. “[he came] to the city of Edessa, in which there was preserved a blood-stained image of the Lord not made by hands”.\n\n","date":"January 7, 2014 at 7:47 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72479","author":"Matthias","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"John Markwardt’s paper is well-researched and interesting, however it is highly doubtful that Jesus was given to writing letters. In ancient literature scribes added some of their own spices to oral tradition in order to make it more digestible.\n\n","date":"January 7, 2014 at 2:10 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72494","author":"Louis","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"I thought I had made it clear that it was Markwardt’s contention that the alleged exchange of correspondence in the Agbar story between Agbar Ukkama and Jesus, was pseudonymous code for the exchange between Abgar the Great and Pope Eleutherius at some time during 180-189AD. Markwardt gives cogent reasons why the correspondence could not be outside this period, and was certainly not between Ukkama and Jesus, despite the literal text.\n\n","date":"January 7, 2014 at 3:54 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72501","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"That is exactly what I meant, albeit indirectly, in #33. Ian Wilson wrote that Jesus was the only historical figure known to have impressed his likeness on cloth, which is the starting point of his works on the Shroud. That something had been going on in Edessa in connection with an image has been pointed out even by  — of all people! — Robert Eisenman.\nDuring the interview he granted me Father Pfeiffer supported IW’s contention, stating that the Eastern Church only realised that they had a full-body image in their possession when the Image of Edessa/Turin Shroud reached Constantinople. That was embarrassing for the emperor, he said, and so the original preaching had to be changed.\nThe Orthodox Church’s version of the story can be seen at:\nhttp://www.stseraphim.org/iconnotmadebyhands.html\n\n","date":"January 7, 2014 at 4:40 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72508","author":"Louis","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"It is interesting that the story on the St Seraphim web-site mentions two traditions concerning the Image’s subsequent fate: 1) the Crusader ship taking the holy objects sank in the Sea of Marmora (wishful thinking?); 2) the Image was taken to the church of St Bartholomew in 1362.  From the D’Arcis text, Geoffrey de Charnay exhibited the Shroud at Lirey in 1355. This could suggest that the Image and Shroud might not necessarily have been the same object. It could be explained if the second tradition had become confused with some other object. I’m unaware of what relics might be claimed for St Bartholomew’s, Genoa.\n\n","date":"January 7, 2014 at 6:40 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72521","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Dave, read the Polish Wikipedia article on Mandylion:\nhttp://pl.wikipedia.org/wiki/Mandylion\nIt lists 5 (five) candidates for the Mandylion:\n1.The Sainte Chapelle Mandylion, sold to Louis IX disappeared 1793.\n2. The Genoa Mandylion.\n3. The Vatican Mandylion, stored probably since the 4th crusade.\n4. The Shroud of Turin.\n5. The Manoppello Veil.\nHow do you think, which one is the True Mandylion?\n\n","date":"January 7, 2014 at 7:00 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72523","author":"O.K.","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Ian Wilson’s book “Holy Faces, Secret Places” is a valuable source of information and mentions the controversies. It had no effect on the authorities since it seems relics are not easily available for scientific examination. It would have been helpful to judge who was right and about what.\n\n","date":"January 7, 2014 at 7:16 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72527","author":"Louis","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"There is a Holy Face at St Bartholomew’s Genoa, frame dates to 14th c. There’s some suggestion it may have links to the Veronica. As yet, I know little else about it.\n\n","date":"January 7, 2014 at 6:52 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72522","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"That is also dwelt upon in the book mentioned above.\n\n","date":"January 7, 2014 at 7:17 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72528","author":"Louis","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"I still ask, how do you think, which one is the True Mandylion?\nThe possible answer may be very surprising ;-)\n\n","date":"January 7, 2014 at 7:22 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72529","author":"O.K.","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Either 1 or 4. I think probably 4\n\n","date":"January 7, 2014 at 7:37 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72531","author":"Matthias","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Now I know why I didn’t respond immediately.  Much more fun to watch everyone else dance.  It doesn’t really matter if the letters were authentic or not.  The Shroud certainly was in Edessa.\n\n","date":"January 7, 2014 at 8:15 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72535","author":"Andy Weiss","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"O.K. reference at #37; I was able to make some reasonable sense out of the garbled Google translation from Polish, but still found it quite interesting. It sent me back to check out Daniel Scavone’s paper “Acheiropoietos Jesus Images in Constantinople:  the Documentary Evidence” his 2006 version. It is a most comprehensive paper, but shows what a veritable jungle any researcher has to hack a way through so many conflicting sources. I think it is probably one of the most complete and authoritative resources on the problem.  \nI had down-loaded it around Feb 2012, made a record of the URL, but it doesn’t show up there now, and my web-search was unsuccessful. Perhaps someone else knows where it is now. But it requires some detailed study, and note-taking if any kind of conclusion is to be attained.\n\n","date":"January 7, 2014 at 9:57 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72546","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Here is a (PDF) copy of Daniel Scavone’s paper “Acheiropoietos Jesus Images in Constantinople: the Documentary Evidence”:\nhttp://www.sindonology.org/scavone-acheiropoietos.pdf\n\n","date":"January 8, 2014 at 4:05 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72567","author":"Mario Latendresse","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"great paper. A key point is the clues that developed over time suggesting the Mandylion was much larger than just a face towel\n\n","date":"January 8, 2014 at 4:50 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72571","author":"Matthias","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Thank you kindly Mario; I had a MS.doc copy of it, wanted to quote the URL, but no longer there; I’m glad it’s found a good home, as it’s an excellent resource for researchers.\n\n","date":"January 8, 2014 at 6:46 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72577","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"I have personally studied this paper and I found out many signs of bias in it.  Of course, pro-shroudies around here won’t agree with me but I don’t care.  Believe me or not, Scavone, just like Wilson and Markwardt are completely biased about this wild hypothesis that the Shroud and the Mandylion were one and the same.  No serious historians that are impartial versus the question of the authenticity of the Shroud agree with these people…  This speaks to me louder than anything pro-shroudies can say on this subject.\nThe bottom line is this:  if we want to really trace the Shroud before the middle of the 11 century in Constantinople, we must look elsewhere than in the crazy hypotheses of Wilson, Scavone and Markwardt…\n\n","date":"January 9, 2014 at 11:43 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72746","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"If people don’t believe me, just give me the name of one credible scholar from without the pro-Shroud world who agree with Wilson or Scavone or Markwardt…  I’m aware of no one.\n\n","date":"January 9, 2014 at 11:51 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72749","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"I’m very interested in the Latin Cod. Monac. Aug. S.Ulr. 111 text I quote above.\nI have found a journal article from Linda Clark From “Modern Philology” from 1986, after the quote I’ve outlined above it refers to the face being decorated, which read as a whole might suggest knowledge of a blood stained whole body figure (hidden away), with the face framed “decorously”.\nThe problem is Clark refers to a German text from the mid 1850s that translate this text.\nI’d like to know when the Latin Cod. Monac. Aug. S.Ulr. 111 was written.Especially whether it was written before or after the mid 1300s when the shroud started to be displayed.\n\n","date":"January 7, 2014 at 10:02 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72547","author":"Matthias","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Sorry that should read “Linda Cooper” not Clark\n\n","date":"January 7, 2014 at 10:09 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72549","author":"Matthias","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Dave:\nIt sent me back to check out Daniel Scavone’s paper “Acheiropoietos Jesus Images in Constantinople: the Documentary Evidence” his 2006 version. It is a most comprehensive paper, but shows what a veritable jungle any researcher has to hack a way through so many conflicting sources. I think it is probably one of the most complete and authoritative resources on the problem. \nYes, it is one of the most complete and authorative resources, except the Count Riant’s\ncompendium (Exuviae sacrae constantinopolitanae, practically impossible to obtain, unless one is a specialist in that field) on which it is largely based. I used it extensively, when I was writing my paper about the relics of the burial cloths venerated across Europe through centuries (part 1 http://ok.apologetyka.info/ateizm/ile-byo-pocien-pogrzebowych-jezusa-cz1,749.htm and part 2 http://ok.apologetyka.info/ateizm/ile-byo-pocien-pogrzebowych-jezusa-cz2,750.htm ) The primary documents are indeed veritable jungle, but it is possible to obtain some good indications, and possible solutions to the problem of the burial clothes stored in Constantinople -and even some clues, about Byzantine attitude to some of them! There were probably three burial clothes in Constantinople before 1204, one of which was our Shroud of Turin, as well as at least two others, parts of which were gifted to Louis IX in 1241, and to Dionysius I, Metropolitan of Moscow circa 1380.\nMatthias: Either 1 or 4. I think probably 4\nSo modest your expectations are? In fact it is quite possible, that ALL OF THOSE 5 objects were actually the Mandylion, each in its own sense. Because in my opinion, the Mandylion never existed as a single object. It was an idea, the real image of Jesus, not a single piece of cloth. \nRemember, in Edessa, there were at least two copies made. There were later brought to Constantinople, along with the “original”\n1.The Sainte Chapelle Mandylion, sold to Louis IX disappeared 1793 -most probably an empty casket for the “original” Mandylion.\n2. The Genoa Mandylion -possibly one of the two copies from Edessa\n3. The Vatican Mandylion -the other copy from Edessa.\n4. The Shroud of Turin -probably the tetradiplon, the cloth folded in 8 layers, to show just a face, and resmeble the original face-only Mandylion of King Abgar. Which probably was…\n5. The Manoppello Veil -the colourful, looking like a painting, transparent face image of Jesus.\nThe people focused their minds on looking which one was this ‘true’ Mandylion, and never have noticed that the reality may be beyond their expectations!\n\n","date":"January 8, 2014 at 5:43 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72620","author":"O.K.","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"“So modest your expectations are? In fact it is quite possible, that ALL OF THOSE 5 objects were actually the Mandylion, each in its own sense. Because in my opinion, the Mandylion never existed as a single object. It was an idea, the real image of Jesus, not a single piece of cloth.”\nVery good point!\n\n","date":"January 8, 2014 at 7:59 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72633","author":"Matthias","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Someone in this forum has said that those who deny that the legend of King Agbar is historical only show a “prejudiced” opinion. Yes, the same “prejudiced” opinion that those who claim that there are no little green Martian invading Earth.\nFor a little bit serious and impartial historian worry by King Abgar someone would have to demonstrate or give an indication of the following:\n1. King Abgar V existed.\n2. There was a letter from King Abgar to Jesus.\n3. Jesus answered.\n4. Someone brought a picture of Jesus to the King.\n5. There were Christians in Edessa before the reign of Abgar IX (200 B.C).\n… and so on.\nOf course, no one has contributed anything concrete about it. Only suppositions and “imagine that”…\nIf historians had to deal with all the possibilities that can imagine anyone  to make plausible all the legends of the world, the story would not be history, but a madhouse.\n\n","date":"January 9, 2014 at 4:33 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72689","author":"David Mo","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Better: …”History would not be History…”\n\n","date":"January 9, 2014 at 4:47 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72693","author":"David Mo","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Great comment…\n\n","date":"January 9, 2014 at 11:39 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72742","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Edessa according to the 1913 Catholic Encyclopedia – http://www.newadvent.org/cathen/05282a.htm\n\n","date":"January 9, 2014 at 9:08 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72726","author":"Andy Weiss","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"David Mo:\nFor a little bit serious and impartial historian worry by King Abgar someone would have to demonstrate or give an indication of the following:\n1. King Abgar V existed.\n2. There was a letter from King Abgar to Jesus.\n3. Jesus answered.\n4. Someone brought a picture of Jesus to the King.\n5. There were Christians in Edessa before the reign of Abgar IX (200 B.C).\n… and so on.\nAd 1):\nhttp://www.iranicaonline.org/articles/abgar-dynasty-of-edessa-2nd-century-bc-to-3rd-century-ad\nhttp://books.google.pl/books/about/Edessa.html?id=54ge-4Z67t8C&redir_esc=y\nAd 2),3),4),5):\nhttp://www.newadvent.org/fathers/250101.htm\nhttp://digital.library.upenn.edu/women/egeria/pilgrimage/pilgrimage.html\nhttp://www.newadvent.org/fathers/0826.htm\nhttp://www.apostle1.com/doctrine-addai-syriac-orthodox1.htm\nIf historians had to deal with all the possibilities that can imagine anyone to make plausible all the legends of the world, the story would not be history, but a madhouse.\nIf there were no guys who believed in the old legends (dismissed as fable-tales by the Academian pseudo-historians), the ancient cities of Nineveh, Babylon, Pi-Ramesses, Myceane , Troy and Knossos had not been excavated to this day.\nAnd besides, in fact the historians do what you described -they deal with all the possibilities that one can imagine. They often build academic careers on re-reading the works of classics, and putting forward new hypotheses.\nFor future, please do not feed the trolls!\nYannick: If people don’t believe me, just give me the name of one credible scholar from without the pro-Shroud world who agree with Wilson or Scavone or Markwardt… I’m aware of no one.\nContradictory premises. It is impossible to be a credible scholar and outright reject the so-called ‘Wilson hypothesis’, without in depth analysis.\n\n","date":"January 9, 2014 at 5:44 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72794","author":"O.K.","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Yannick: If people don’t believe me, just give me the name of one credible scholar from without the pro-Shroud world who agree with Wilson or Scavone or Markwardt… I’m aware of no one.\nContradictory premises. It is impossible to be a credible scholar and outright reject the so-called ‘Wilson hypothesis’, without in depth analysis.\nDelete the “contradictory premises” (they are not there actually) The rest is fine.\nI have read several negative comments from the so called ‘credible scholars from without the pro-Shroud’ -who said how this Wilson is stupid, how poor and misleading his book is -but usually without any arguments (or very poor) against his work. The way of argument went usually this way:\nQ: Why Wilson is not credible?\nA: Because his work is not supported by credible scholars.\nQ: Why Wilson’s work is not supported by credible scholars?\nA: Because his work is not credible.\nCredible scholars… funny.\n\n","date":"January 9, 2014 at 5:58 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72795","author":"O.K.","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Very well said O.K.\n\n","date":"January 10, 2014 at 12:46 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72841","author":"Mike Morcous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Wilson’s ideas are not supported by credible scholars because he don’t follow properly the historical method by making wild speculations, extrapolations and suppositions in order to confort his preconceived notions about the Shroud’s early history.  Be certain that this is the correct and true reason why his ideas are not supported by credible scholars.\n\n","date":"January 10, 2014 at 11:50 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72902","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"OK I agree.\nDe Wesselow has pretty credible art history credentials and agrees with Wilson.\nHe also quotes some other credible art historians (can’t remember names) who also support this.\nLook, I would be the first to admit that the case is not bulletproof. But in my view it certainly has some quite compelling aspects to it.\n\n","date":"January 9, 2014 at 8:47 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72818","author":"Matthias","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Mention Wilson, and suddenly Yannick develops a blind spot, and no matter what one has to say on the subject, it’s like a red rag to a bull, we get yet another lecture telling us how no historian agrees with Wilson.  I know of no recent original paper by any one of the army of Yannick’s historians that has addressed the issues prepared to look at the possibility afresh, they only tell us that Wilson doesn’t know what he’s talking about (more ad hom than ad rem). Why? Because the majority of academe is more doctrinaire relying on the received wisdom of their esteemed predecessors, more so than any religious dogmatist could ever be! \nNobody believes in the literal truth of the Abgar story. Markwardt’s paper has a very credible interpretation of the story. It actually relates not to Abgar V Ukkama, but to Abgar VIII the Great some 150 years after Abgar V. What other reason could there possibly be for some scribe to set down such a story? \nI also think that Markwardt makes a good case for the mandylion, whatever it was, being stored in Antioch rather than Edessa, and it was only taken to Edessa upon the destruction of Antioch. Whether the mandylion was the Shroud or not, I’m happy to leave to others. They will have to explain how there happens to be more than one original image of Jesus, and if it wasn’t a burial cloth what was it? “A painting in choice colours”? A towel used for wiping his face after Gethsemane? A woman named “Veronica” (= true icon) or Hemorhissa (= blood flow) wipes his face on his way to the cross? The relics may be there, but none have been tested for authenticity. We only have aetiological legends in attempts to explain how an image came to be. But apart from the Sudarium of Oviedo, there is only one potentially authentic image of Jesus, and that is on his Shroud. Or are the much-vaunted historians prepared to admit that apart from the possibly naturalistically formed image on the Shroud, that other images of Jesus are in plentiful supply, and can only have been formed by his miraculous action. Or what other explanation have they to offer? \nThe “Image of Edessa” was so called because it was seen to have an image! There may be more to Wilson’s explanation, than others said to be smarter than he, seem prepared to admit!\n\n","date":"January 10, 2014 at 3:55 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72852","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"“Because the majority of academe is more doctrinaire relying on the received wisdom of their esteemed predecessors, more so than any religious dogmatist could ever be!”\nWell put. I’m doing a Phd part time and it’s amazing how indoctrinated much of academia is, very much blinded by doctrine are many.\n\n","date":"January 10, 2014 at 4:11 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72854","author":"Matthias","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"On the contrary to what you say Dave, I really think Wilson know what he’s talking about when it comes to the Abgar legend and the Mandylion, but unfortunatelly, he prefers to believe in the wild extrapolations he made over the years to comfort his personal preconceived notions than to acknowledge the reality with honesty, which is that this relic that was in Edessa is most certainly not the same thing as the Shroud.  I think Wilson came to a point where he had gone too far in the defense of his hypothesis so that he can’t retract, even though in the deepest part of his soul, I’m sure he came to realize at one point during his researches as well as me that the Mandylion cannot be the same thing as the Shroud…  He simply has not enough balls to say :  you know what folks?  For the last 35 years or so, I’ve followed a dead end road and I encourage you to start searching a better answer than mine in order to explain rationally the Shroud’s obscure years!\n\n","date":"January 10, 2014 at 2:16 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72916","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"In order to claim that the Mandylion is definitely NOT the Shroud, it is necessary to give at least some plausible explanation of what it might have been. The Image of Edessa was said not to have been made by human hands! It seems then not to have been a painting, although one version of the legend has it in “choice colours”. If not a painting, then it is necessary to concede that, although the Shroud image might have a naturalistic explanation, Jesus did in fact leave at least one miraculous image of his face. [There are at least four such contenders for the claim, although none have been tested for authenticity!] Does Anonymous then concede that the Mandylion was some such kind of miraculous image? If not, what plausible explanation does he accept for the “not made by human hands” image said to have been on the Mandylion? Alternatively, if indeed made by human hands, what was the template or model for it? I await his explanation.\n\n","date":"January 10, 2014 at 3:19 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72921","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Dave say : “The Image of Edessa was said not to have been made by human hands!”\nAnd I answer:  Yeah, yeah, yeah!  And one of the two letters related to the Abgar legend was said to have been written by the hands of Jesus in a very good Greek!\nIf you believe everything that the Church of those turbulent years of christianity said, then you’re more naive than I thought…\nDave say:  Does Anonymous then concede that the Mandylion was some such kind of miraculous image?\nAnd I answer:  Of course not!  I’m not a fool to believe everything the Church is saying as being automatically an absolute truth… I am a free minded  Christian who has not put aside his own conscience along the way!  I don’t even believe that Mary was a Virgin and there are a lot of other “truths” proclaimed by the Church I don’t believe…  Now, concerning the “image not made by human hand” slogan, this was simply what the “orthodox” Church of Edessa wanted to make people believe to support his battle against the heretical groups of Christians that were present in the region of Edessa (namely the Monophysite and Nestorian Churches).\n\n","date":"January 10, 2014 at 4:49 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72937","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"So we now know that Anonymous believes that the Image of Edessa was in fact made by human hands, despite the legends. And yet the Image of Edessa was claimed to be the main template for icons of Christ. You don’t have to resort to the Vignon markings to see the likeness of many icons to the Shroud face. What does Anonymous think was the original template or model for the Mandylion, if it was then man-made?\n\n","date":"January 10, 2014 at 5:08 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72941","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Probably a Pantocrator-like icon of the face of the living Christ…  And what was the model for this Pantocrator Christ?  I would say, with some prudence, the Shroud image but maybe just indirectly via a sketch or something similar…  So, you see, in the end, the Mandylion is important because it is probably the copy of a copy of a copy of the face we see on the Shroud…\n\n","date":"January 10, 2014 at 5:17 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72943","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"So we finally get to the point where Anonymous grudgingly agrees that the source of the Mandylion image is a copy of the face on the Shroud. It follows that the Shroud face was therefore known. It puzzles me why the copyist(s) did not seek to copy other features from the Shroud. And surprisingly there is very little in the way of evidence that these features were at all known. Perhaps it was because the Shroud was folded in a such a way as to conceal its original use as a burial sheet, in pretty much the way that Wilson describes in his tetradiplon theory. I mentioned that there may be more to Wilson’s theory than others seem prepared to admit! Gotcha!\n\n","date":"January 10, 2014 at 8:36 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72966","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Or simply because depicting gruesome details we see on the Shroud would have been seen as scandalous for the susceptibilities of the era in which the Mandylion and the Pantocrator icon were created…\nDave, you remind me a great deal of Wilson in the sense that you seem to forget good and important parts of the historical context in which those images of Christ came to be known publicly, especially the fact that, in those days, depicting a bloody and suffering Christ was not at all part of the normal way to depict him and the fact that, in those days, around Edessa, there was a big battle that was raging between the Orthodox Church and some heretic movements like the Monophysites and the Nestorians…  All those things could explain very well the making of a false relic like the Mandylion by the Orthodox Church of Edessa and can also explain very well why the Mandylion face was showing a living Christ without injuries or bloodstains.  Also, concerning this last topic, you MUST also consider the FACT that all the versions of the Abgar legend up until the so-called discovery of the Mandylion in Edessa (probably during the second half of the 6th century) ALWAYS located the action BEFORE the Passion of Christ!  Again, it’s a big point you seem to forget in your analysis!  In such a context of a miraculous image supposedly done by Christ before his Passion, don’t you think it is normal that the forger was not inclined to had bruises and bloodstains on his painted image of Christ, even though it is possible that he based is work on the Shroud image?  I really think so!  In that context, every time, I will expect to see an image of the living Christ with his eyes wide open and that’s exactly what we could see on the Pantocrator icon and on all the Mandylion depictions.\n\n","date":"January 11, 2014 at 7:20 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-73095","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"O.K:\nYou are a little old-fashioned. The time of romantic archaeologists who dug inspired by legends is over. But even they had some factual indications together with romantic speculations. (Evans, the ruins of Crete; Schliemann, some geographical references). These indications were guidelines to elaborate some verifiable hypothesis and were applied to a concrete program of digging. These tests showed as Schliemann or Evans was absolutely wrong in their romantic speculations. Yes. They find the ruins of a town in Hisalrik and a palace in Crete. Audaces Fortuna juvat. But they are neither the Homeric Troy nor the king Minos’ palace. (A different story is told to tourists. It seems that you have swallowed it). \nIf you wish to combine a set of relevant indications, a hypothesis about king Abgar and Jesus, elaborate a test and implement it, fine! While the sindonists merely confine them to claim the abstract probability of legendary narratives, this is not more than chatter. And chatter is not matter of History. \nBut I am a little astonished with your subsequent references. I don’t know why you send us to Eusebius of Caesarea or the legend of Addai. Are you saying they are evidences of the correspondence between Abgar and Jesus and the subsequent miracles? Really? I don’t believe!\nI neither understand your reference to trolls. Have you the David the Gnome’s syndrome? Take care of yourself.\n\n","date":"January 10, 2014 at 7:49 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72874","author":"David Mo","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Yannick, re your comment at 4.49 pm, I might agree with you if it wasn’t for multiple references or allusions over centuries to the Mandylion’s image being faint or as if imprinted by sweat. Along with the “not made by human hands” references this is actually quite suggestive of a non painted image consistent with the faint and ephemeral image of the Shroud.\n\n","date":"January 10, 2014 at 7:40 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72956","author":"Matthias","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"What is much less consistent though is the FACT that EVERY depictions of the Mandylion ALWAYS show the face of Christ without any signs of injuries or bloodstains…\nCan we please start looking at other possibilities to explain the Shroud’s obscure years?  The Mandylion, the Mandylion, the Mandylion…  There are other possibilities folks.\n\n","date":"January 11, 2014 at 7:07 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-73094","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Yannick: \n Dave say : “The Image of Edessa was said not to have been made by human hands!”\nAnd I answer: Yeah, yeah, yeah! And one of the two letters related to the Abgar legend was said to have been written by the hands of Jesus in a very good Greek!\nIf you believe everything that the Church of those turbulent years of christianity said, then you’re more naive than I thought…\nDave say: Does Anonymous then concede that the Mandylion was some such kind of miraculous image?\nAnd I answer: Of course not! I’m not a fool to believe everything the Church is saying as being automatically an absolute truth… I am a free minded Christian who has not put aside his own conscience along the way! I don’t even believe that Mary was a Virgin and there are a lot of other “truths” proclaimed by the Church I don’t believe… Now, concerning the “image not made by human hand” slogan, this was simply what the “orthodox” Church of Edessa wanted to make people believe to support his battle against the heretical groups of Christians that were present in the region of Edessa (namely the Monophysite and Nestorian Churches)\nProbably a Pantocrator-like icon of the face of the living Christ… And what was the model for this Pantocrator Christ? I would say, with some prudence, the Shroud image but maybe just indirectly via a sketch or something similar… So, you see, in the end, the Mandylion is important because it is probably the copy of a copy of a copy of the face we see on the Shroud…\nI want to remind in what circumstances the Mandylion was brought from Edessa to Constantinople. \nIn 942, John Kourkouas, a leading Byzantine general, on the order of usurper Romanos I Lekapenos, started his campaing in Northern Mesopatamia. The Arabs had never experienced such beating from the Romaioi!  “At the head of an exceptionally large army, some 80,000 men according to Arab sources, he crossed from allied Taron into northern Mesopotamia. Mayyafiriqin, Amida, Nisibis, Dara—places where no Byzantine army had trod since the days of Heraclius 300 years earlier—were stormed and ravaged.” Ultimately he turned to his ultimate goal -Edessa, the city of King Abgar, where legendary Mandylion was stored.\nAnd then, something unexpected happened. Kourkouas, who previously captured with ease so many cities, now on behalf of the Emperor gave to the Arabs, unexpected offer:\n* The Byzantines will withdraw from all the conquered territory.\n* They will give a gurantee that Edessa will not only be spared, but not attacked again.\n* They will pay a ransom of 12 000 pieces of silver.\n* And they will release 200 high-positioned Muslim prisoners.\nOn a single condition: GIVE US MANDYLION! Such was the price for such old piece of linen. For what cost the Byzantines wanted it? FOR ALL COST!\nWhatever the Mandylion was, it was definitely not an old, painted icon. One must be an idiot to suggest such preposterous idea.\n\n","date":"January 10, 2014 at 9:27 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-72973","author":"O.K.","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"OK: Those last few paragraphs you wrote have to be one of the most powerful arguments I’ve read that the Mandylion was something extra special, not just some particularly attractive painted icon. There was evidently something about it much more mysterious than that. I can think of no other occasion in history, not even Byzantine or other Middle Eastern history, when a general with so many troops and arms at his disposal, and on  such a winning streak offered so much to the losing side, merely to get some artifact his emperor said he wanted. As you say, it was “Get it, at all costs!” The reaction of the emperor’s sons on its arrival in Constantinople is also highly suggestive! It couldn’t have been a painting, despite what ‘Anonymous’ says about it.\n\n","date":"January 11, 2014 at 3:50 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-73009","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"yes, and its all too easy to assume that the ancients were gullible fools\n\n","date":"January 11, 2014 at 4:41 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-73016","author":"Matthias","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Here’s a suggestion for all of you who want to comment on historical topics related to the Shroud:  Do your homework before writing and try to ALWAYS keep in mind the socio-cultural and religious CONTEXT of the time.  Or else, you will have great chances to completely miss the target…  Any good historical research is always based on the context of the time.\n\n","date":"January 11, 2014 at 7:32 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-73097","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Yannick. With all respect, but what can you know about the CONTEXT of the time? What was the “socio-cultural and religious CONTEXT of the time”, that Byzantines, after victorious war with the Arabs, decided to give up all the spoils, for one old piece of linen?\nI got the impression, that you simply uncritically swallowed some nonsensical theories, invented by modern Academics, living several centuries after those events, and you call it “CONTEXT”. But before we’ll continue to discuss the context of those stories (I feel I could say something about it), I have some homework for you, before writing -especially before writing such nonsense like What is much less consistent though is the FACT that EVERY depictions of the Mandylion ALWAYS show the face of Christ without any signs of injuries or bloodstains… Read once again “The Story of the Image of Edessa” written by Emperor Constantine VII Porphyrogennetos (appendix C in Wilson’s 1978 book). Then we’ll talk about the “CONTEXT”.\n\n","date":"January 11, 2014 at 8:25 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-73105","author":"O.K.","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Answer:  I highly recommand that you read this previous comment of mine: https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/#comment-73095\nImportant note: the historical context I refer is the one that prevailed around the time the Pantocrator and the Mandylion came to be known (during the 6th century) and not the context surrounding the transfer of the relic from Edessa to Constantinople in 944…\n\n","date":"January 12, 2014 at 7:49 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-73182","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Yannick:\nAnswer: I highly recommand that you read this previous comment of mine: https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/#comment-73095 \nYannick, of course I have read it -and surprise, I mostly agree with what you have written. Except that conclusions are different.\nOr simply because depicting gruesome details we see on the Shroud would have been seen as scandalous for the susceptibilities of the era in which the Mandylion and the Pantocrator icon were created…\nDave, you remind me a great deal of Wilson in the sense that you seem to forget good and important parts of the historical context in which those images of Christ came to be known publicly, especially the fact that, in those days, depicting a bloody and suffering Christ was not at all part of the normal way to depict him and the fact that, in those days, around Edessa, there was a big battle that was raging between the Orthodox Church and some heretic movements like the Monophysites and the Nestorians… \nAs far as I remember, this mimics exactly the Wilson’s reasoning behind Mandylion=Shroud hypothesis! Haven’t you noticed that? \nAll those things could explain very well the making of a false relic like the Mandylion by the Orthodox Church of Edessa and can also explain very well why the Mandylion face was showing a living Christ without injuries or bloodstains.\nAll those things could explain very well why Shroud was folded in Mandylion face-only form, as suggested by Wilson. It is almost exactly the Wilson’s reasoning (except that motivations are slightly different)\nAlso, concerning this last topic, you MUST also consider the FACT that all the versions of the Abgar legend up until the so-called discovery of the Mandylion in Edessa (probably during the second half of the 6th century) ALWAYS located the action BEFORE the Passion of Christ! Again, it’s a big point you seem to forget in your analysis! In such a context of a miraculous image supposedly done by Christ before his Passion, don’t you think it is normal that the forger was not inclined to had bruises and bloodstains on his painted image of Christ, even though it is possible that he based is work on the Shroud image? I really think so! In that context, every time, I will expect to see an image of the living Christ with his eyes wide open and that’s exactly what we could see on the Pantocrator icon and on all the Mandylion depictions.\nJust want to remind, that all representations of the Veronica Veil, before 1600s, showed an image of the living Christ with his eyes wide open, no bruises and bloodstains and so on, except the legend which placed the creation of the relic during the Passion, on the road to Calvary. This has much in common with depictions of Mandylion -and this is not incidental.\nYannick, you still miss the point. Your problem is that you don’t ‘sense’ don’t ‘feel’ the story of Mandylion. To your satisfaction, I tell you that Wilson also probably missed the point (or maybe not, but rather delibaretely tried to dismiss it). There is one missing element, most people haven’t noticed. One missing piece of the puzzle -but apparently found recently. I don’t want to say here what, I have already said it not once, and not twice. See my posts #37 and #52 for some indications.\nAnd on the end:\nImportant note: the historical context I refer is the one that prevailed around the time the Pantocrator and the Mandylion came to be known (during the 6th century) and not the context surrounding the transfer of the relic from Edessa to Constantinople in 944…\nThe Mandylion from the 6th century is apparently the same as transferred to Constantinople in 944.\n\n","date":"January 12, 2014 at 8:40 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-73185","author":"O.K.","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Considering the historical context in which the Mandylion come to be publicly known, it is possible that, at first (at least during the 6th century and maybe during the 5th century), the painted image on a towel was considered as such: i.e. a painted image of Christ done by the official artist of king Abgar (this is in the first versions of the Abgar legend) and then, it is possible to think that the whole concept of an image “not made by human hands” came to light only around the start of the iconoclast debate inside the Church, at the beginning of the 8th century.  Of course, we talk about suppositions here (but suppositions that were proposed by serious historians), but this would fit nicely with the evolution of the Abgar legend during these centuries.\n\n","date":"January 13, 2014 at 4:28 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-73243","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"In other words:  At first, the image of Edessa would have not been considered miraculous at all but manmade (which fits with the first few versions of the Abgar legend) and then, a long time after this, when the iconoclasm debate was starting in the East, those Inside the Church who wanted to preserved the holy icons would have invented the concept of an image “not made by human hands” concerning the Mandylion.  This “tag” would have helped them to comfort their position by saying that God himself wanted the presence of holy icons inside the Church.  This is a true possibility that is far more possible regarding the known historical context of the time (and the known evolution of the Abgar legend) then to think the Mandylion was the Shroud folded in 8, while no one in Edessa would have ever found out the truth about it!\n\n","date":"January 13, 2014 at 4:35 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-73244","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Yannick, but you forget that there were at least one image “not made by human hands”: The Shroud.\nSimple question: if  the Shroud was not the Mandylion, then where it was?\nI have known only a single reliable alternative hypothesis, but later about that.\n\n","date":"January 13, 2014 at 4:44 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-73247","author":"O.K.","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Look at fact #9 in this very good paper: https://shroudofturin.files.wordpress.com/2012/06/clc3a9ment_questions-about-the-mandylion-hypothesis-of-wilson_2012-06-28.pdf\nFirst, this is, for me, one of the main historical fact that clearly indicate that the Shroud and the Mandylion were two separate objects and second, this is one important clue that tell us that, at the beginning of the 8th century, there were people Inside the Church who were aware of the presence of a relic known to be the Shroud of Christ.  But, of course, the question that remains is:  Was this shroud the same as the one in Turin?  There is no way to be sure about that since Damascene did not describe it.  Nevertheless, if we presume this was the same Shroud, we can think that around the time the Mandylion came to be known publicly (around the 6th Century), it is truly possible that the authentic Shroud of Christ was kept and well-preserved by the Church elsewhere (probably around Jerusalem at that time, since we have no record of a shroud of Christ in Constantinople before the middle of the 11th Century).  The testimony of Arculf (around 670) seem to confirm a bit more this possibility.  And if this is true, then we must assume that this Shroud was not often exposed publicly to veneration because there is absolutely no record from that era which talks about a Shroud of Christ with a body image and bloodstains on it…\n\n","date":"January 13, 2014 at 5:42 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-73250","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Look at fact #9 in this very good paper: https://shroudofturin.files.wordpress.com/2012/06/clc3a9ment_questions-about-the-mandylion-hypothesis-of-wilson_2012-06-28.pdf\nFirst, this is, for me, one of the main historical fact that clearly indicate that the Shroud and the Mandylion were two separate objects and second, this is one important clue that tell us that, at the beginning of the 8th century, there were people Inside the Church who were aware of the presence of a relic known to be the Shroud of Christ. But, of course, the question that remains is: Was this shroud the same as the one in Turin? There is no way to be sure about that since Damascene did not describe it. Nevertheless, if we presume this was the same Shroud, we can think that around the time the Mandylion came to be known publicly (around the 6th Century), it is truly possible that the authentic Shroud of Christ was kept and well-preserved by the Church elsewhere (probably around Jerusalem at that time, since we have no record of a shroud of Christ in Constantinople before the middle of the 11th Century). The testimony of Arculf (around 670) seem to confirm a bit more this possibility. And if this is true, then we must assume that this Shroud was not often exposed publicly to veneration because there is absolutely no record from that era which talks about a Shroud of Christ with a body image and bloodstains on it…\nGood, Yannick, you got it. The only one hypothesis that makes sense, outside Mandylion hypothesis, is that about the Arculfus Shroud. Although largely abandoned, it makes sense, after a few assumptions, but I find Mandylion track more reliable. Nevertheless, I have planned to write a short article about it for Dan, as a guest posting. I have some thoughts about it.\nAs to the shrouds, there were definetly more. In  #52 I wrote:\nThere were probably three burial clothes in Constantinople before 1204, one of which was our Shroud of Turin, as well as at least two others, parts of which were gifted to Louis IX in 1241, and to Dionysius I, Metropolitan of Moscow circa 1380.\n\n","date":"January 13, 2014 at 5:58 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-73251","author":"O.K.","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Quote: “Although largely abandoned, it makes sense, after a few assumptions, but I find Mandylion track more reliable.”\nAnswer: If you read well the point #9 of the paper written by Yannick Clément, how in the world can you still favored the Mandylion hypothesis?  Don’t you realize that, at the beginning of the 8th century, while the Mandylion was still present in Edessa and, if we believe Wilson, no one was supposed to know that it was the real Shroud folded in 8, there were people in the Church (like St John Damascene) who were aware of the presence of a Shroud of Christ as a relic venerated by the faithful (Damascene don’t say where this veneration was taking place but this cloth had nothing to do with the Mandylion), while at the same time, who were also aware of the presence of the Mandylion in Edessa as a DIFFERENT cloth not related to the Passion of Christ?  This testimony of Damascene is impossible to discard for all the partisans of Wilson’s wild ideas and that’s why no one ever talk about that, not even Wilson himself (to my knowledge)…\n\n","date":"January 14, 2014 at 11:44 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-73314","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"bit of self promotion at 5.42 pm Yannick???\n\n","date":"January 13, 2014 at 9:45 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-73262","author":"Matthias","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"I’m not Yannick…  I’m his phantom.  I said it many times…\n\n","date":"January 14, 2014 at 11:29 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-73313","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"OK / Yannick\nThe Arculfus Shroud does not sound like the Shroud of Turin:\n“Arculf saw also in that city of Jerusalem another linen cloth of larger size, which, as is said, St. Mary wove, and which, on that account, is held in great reverence in the Church and by all the people. In this linen cloth the forms of the twelve Apostles are woven, and the likeness of the Lord Himself is figured; one side of the linen cloth is of red colour, while the opposite side is green”\nhttp://faculty.colostate-pueblo.edu/beatrice.spade/seminar97/arculf/arculfus.htm\nClearly an artistic creation!\n\n","date":"January 14, 2014 at 4:12 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-73282","author":"Matthias","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"The main point I try to make here is this:  While Wilson and others pro-shroudies think that the various changes that occurred over the centuries concerning the Abgar legend were due to a progressive understanding of the real nature of the Mandylion (which would have been the Shroud of Christ folded in 8), I propose that most of these changes (if not all) took place because of the evolution of the theological views and battles that were going on inside the Church and in particular, in the region of Edessa, and later on, after the Mandylion came in that city, in Constantinople.\n\n","date":"January 14, 2014 at 11:47 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-73315","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Here’s a complementary question concerning my previous post :  If Wilson was correct and the various changes of the Abgar legend were due to a progressive understanding of the real nature of the Mandylion, then why in the world there is absolutely no version of the Abgar legend that clearly indicate that this cloth was a burial cloth and why there is absolutely no version of the Abgar legend that locate the miraculous imprint AFTER Jesus death on the cross?  And why there is absolutely no depiction of the Mandylion that show bruises and bloodstains?  If the understanding of the real nature of the relic would really have increase over the centuries, there is absolutely no doubt in my mind that, at some point, the truth would have come out regarding the burial aspect of the relic!  Since you can’t find anything clear about that anywhere (whether in art or in written sources),  then we must conclude that the Mandylion was not showing any signs of the Passion of Christ and therefore was not the Shroud of Turin…  To me, this is clear.\n\n","date":"January 14, 2014 at 12:48 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-73316","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Yannick:\nAnswer: If you read well the point #9 of the paper written by Yannick Clément, how in the world can you still favored the Mandylion hypothesis? Don’t you realize that, at the beginning of the 8th century, while the Mandylion was still present in Edessa and, if we believe Wilson, no one was supposed to know that it was the real Shroud folded in 8, there were people in the Church (like St John Damascene) who were aware of the presence of a Shroud of Christ as a relic venerated by the faithful (Damascene don’t say where this veneration was taking place but this cloth had nothing to do with the Mandylion), while at the same time, who were also aware of the presence of the Mandylion in Edessa as a DIFFERENT cloth not related to the Passion of Christ?This testimony of Damascene is impossible to discard for all the partisans of Wilson’s wild ideas and that’s why no one ever talk about that, not even Wilson himself (to my knowledge)…\nYes, I have read it , quite well I think. And I see no slightest problem at all with that.\nHow many times do I have to repeat, that the Shroud of Turin was not the only one burial cloth venerated at those times? In Constantinople there were at least three such burial cloths, one of them was the TS. I have recently posted a text about Arculfus’ Shroud, if you haven’t read it: https://shroudstory.com/2014/01/14/arculfus-shroud-a-guest-posting-by-o-k/\nNeglecting for a moment theoretical possibility that Arculfus’ Shroud and the Mandylion could have been the same object at various times, we have such possibilities:\nA) The TS is Mandylion, the Arculfus’ Shroud is another alleged shroud of Christ.\nB) The Mandylion is not the TS, Arculfus’ Shroud is TS.\nC) Neither cloth is TS.\nAnyway, the testimony of Damascene does not solve here anything, and does not exclude the possibility of Mandylion being TS.\nAnd one more thing: \nThe main point I try to make here is this: While Wilson and others pro-shroudies think that the various changes that occurred over the centuries concerning the Abgar legend were due to a progressive understanding of the real nature of the Mandylion (which would have been the Shroud of Christ folded in 8), I propose that most of these changes (if not all) took place because of the evolution of the theological views and battles that were going on inside the Church and in particular, in the region of Edessa, and later on, after the Mandylion came in that city, in Constantinople.\nFine. But do you really understand this? What “evolution of the theological views and battles that were going on inside the Church and in particular, in the region of Edessa”  are you talking about? What the changes in the legends about the Mandylion have in common with them? That’s only empty talk, unless you give some convincing explantions: what and why. On my side, I see no relation whatsoever, and no way how theological disputes might have led to the evolution of the idea what was the Mandylion. The other way makes more sense, the better the true nature of the Mandylion was known the more changes in the legend. But that’s really complex matter, because I think the story of Mandylion might have been much more complex than anyone suggested -especially if there is some missing link in the legend…\nIf Wilson was correct and the various changes of the Abgar legend were due to a progressive understanding of the real nature of the Mandylion, then why in the world there is absolutely no version of the Abgar legend that clearly indicate that this cloth was a burial cloth and why there is absolutely no version of the Abgar legend that locate the miraculous imprint AFTER Jesus death on the cross?\nDue to various reasons. First because there were probably some people who were not interested in revealing the truth. You wrote that if we believe Wilson, no one was supposed to know that it was the real Shroud folded in 8 Here I disagree with Wilson. I think there are some indications that the true nature of the Mandylion was actually known to few better-informed people. But they had some reasons to keep it secret, and maintain the mystery.\nSecondly, perhaps because of the some missing link, you still can not see -like most people. The old versions of the legend were possibly closer to the truth than later…\nAnd why there is absolutely no depiction of the Mandylion that show bruises and bloodstains?\nRead once again “The Story of the Image of Edessa” written by Emperor Constantine VII Porphyrogennetos (appendix C in Wilson’s 1978 book).\nIf the understanding of the real nature of the relic would really have increase over the centuries, there is absolutely no doubt in my mind that, at some point, the truth would have come out regarding the burial aspect of the relic!\nBy whom? If you know the history of the Mandylion, it is clear that there was no chance for that…\nSince you can’t find anything clear about that anywhere (whether in art or in written sources), then we must conclude that the Mandylion was not showing any signs of the Passion of Christ and therefore was not the Shroud of Turin… To me, this is clear.\nAnd to me, exactly opposite is clear…  Just from the same reasons. Yannick, don’t be naive, there was no one who could reveal the true nature of the Mandylion… unshadowing the Mystery…\n\n","date":"January 15, 2014 at 6:52 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-73396","author":"O.K.","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Quote: “Anyway, the testimony of Damascene does not solve here anything, and does not exclude the possibility of Mandylion being TS.”\nAnswer:  Oh yes it does and very well!  Why?  Because Damascene doesn’t included the Mandylion in his list of relics related to the Passion!  For Damascene, the Mandylion was related to an event in Jesus life before his death, just like the legend told us…  \nFrom the Damascene writings alone (and even more when you take all the other evidences together as a whole), it’s EVIDENT that the Mandylion was just like the copies we have, i.e. an image of the LIVING Christ, which had nothing to do with his death and burial.\nBut of course, since we don’t have the original Mandylion no more, everybody can take such good pieces of evidence and found a way to save Wilson’s idea…  And you’re free to do so.  But I will never follow you on this track.  There are just too many solid pieces of evidence that the Mandylion had nothing to do with a burial shroud and too many very good clues that Wilson is not always honest in his inquiry that I’m far from being ready to accept his conclusion…\n\n","date":"January 16, 2014 at 5:39 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-73479","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"From the Damascene writings alone (and even more when you take all the other evidences together as a whole), it’s EVIDENT that the Mandylion was just like the copies we have, i.e. an image of the LIVING Christ, which had nothing to do with his death and burial.\nThe only thing that is EVIDENT, is the opinion of the Damascene, nothing more. Probably referring to what majority thought at that time, except a few privy guys, of course.\nWhy? Because Damascene doesn’t included the Mandylion in his list of relics related to the Passion!\nThere are just too many solid pieces of evidence that the Mandylion had nothing to do with a burial shroud and too many very good clues that Wilson is not always honest in his inquiry that I’m far from being ready to accept his conclusion…\nIt seems I have to write a new guest posting for Dan…\n\n","date":"January 16, 2014 at 6:23 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-73483","author":"O.K.","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"The thing is this:  If you take the writings of Damascene and you compare them with the Acts of Thaddeus, you find out that BOTH AUTHORS made a CLEAR DISTINCTION between the cloth that received the imprint of the face of the living Jesus (Mandylion) and the burial cloth(s) that was(were) found in the empty tomb!  And I really don’t think this is due to the idea that both authors were mistaken by the reality of the Mandylion…  You read those texts (which were writen by Christian authors that surely had a good idea of what was the Mandylion and what was the burial cloth(s) of Jesus) and it is EVIDENT that, for BOTH WRITERS, the Mandylion was a small towel showing the face of the living Christ without any marks of injuries or bruises and that such a cloth had NOTHING TO DO with the burial cloth(s) that was(were) found in the tomb and this is in total agreement with all the depictions of the Mandylion that have survived to this day.\nI don’t think we have to go further to understand that the Mandylion was NOT the Shroud of Turin.  Now, was it the same cloth as the one we found in the Arculf account?  This is impossible to say.  We’ll never know, unless a new important discovery could be done, which would give us some clue.  Personally, I think the dimension given by Arculf for the Shroud of Jerusalem is interesting and should be seen as a potential clue to believe that, in fact, it really was the Shroud that was kept there.  But, again, in the present state of our knowledge, we can tell for sure.\n\n","date":"January 17, 2014 at 11:46 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-73545","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"we can’t tell for sure…  sorry.\n\n","date":"January 17, 2014 at 11:50 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-73546","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"I have a friend in France who is doing right now an extensive research on the subject and, after a while, he came out with the conclusion that, instead of being due to a progressive improvement in the understanding of the real nature of the Mandylion (Wilson’s idea), the numerous changes concerning the Abgar legend that we can detect over the centuries (including the introduction of the whole concept of an image “not made by human hands”) are most probably due to the evolution of the theological views of the orthodox Church in the Middle East, along with the great battles and debates that were going on between this Church and the various heretical groups of Christians that were living in the same region.  From an historical point of view (which take into account the religious and socio-cultural context), such a conclusion is the most probable and, therefore, the idea that the Mandylion was the Shroud folded in 8 and that a progressive understanding of the real nature of the cloth would have caused many changes in the Abgar legend doesn’t stand.  I agree 100% with such a conclusion…\n\n","date":"January 17, 2014 at 12:49 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-73550","author":"Anonymous","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"Excuse me, but has Mr. Clément espied Markwardt’s papers*. Also, given his opprobrium of Ian Wilson, I would also (kindly) inquire as to His own notional history of the Shroud.\nThank you.\n*http://www.sitelevel.com/query?crid=5b7907994c2a69a2&query=Markwardt&B1=Search\n\n","date":"March 16, 2014 at 11:07 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-89608","author":"Passing Stranger","site":"shroudstory"},{"title":"Yannick Clément on the Letters Between Jesus and King Abgar","post":"*HIS OWN* not “His own”\n\n","date":"March 16, 2014 at 11:30 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","id":"comment-89617","author":"Passing Stranger","site":"shroudstory"}]
