[{"title":"“I am defeated all the time; yet to Victory I am born.\"","post":"I agree that there is Victory in Christ. But I think modern man is almost unable to perceive what that Victory actually is.  Sullivan implies it’s all about feeling better about ourselves and our origins and our potential, which I think is way off the mark because it’s a humanistic reasoning. Man-centered. \nI think Genesis chapters 1-3 are a poetic account of creation that provides almost no details.  And yet there’s a lot that can be gleaned from it, not about the HOW but more about WHY. I believe God’s heart is revealed in those chapters but not His methods. \nI actually believe Evolution is a waste of time. How did our earth come into being?  Nobody will ever know the answers to that until we get to heaven and we can watch the home videos of God actually doing it. I suspect that everybody’s theories are off the mark. \nWhat totally annoys me about secular evolutionists is how they try to pound their theories into every new discovery, instead of appreciating the discovery for what it is. An ancient skull is very interesting, there’s no doubt about it. And even if carbon dating isn’t very accurate (which I don’t think it is), there’s still no doubt whatsoever that scientists have found some incredibly old skeletons in recent years. So of course they are fascinating.  Why ruin it with all the evolutionary stupid talk about millions and billions of year and how this skeleton is nearly almost the missing piece they’ve been looking for?  That’s a bunch of malarky.  Even Darwin knew that his theory would never be proven, there isn’t enough fossil evidence to do that. \nThere are some things that can be proven and other things that never will be. I think we waste time and money on some sciences that could be better spent on other kinds of research. \nIt’s important for us to STOP and consider what is knowable, and what isn’t.  People don’t seem to think of that, however, and so these ENDLESS discussions go on and on.  Calvinism vs. Arminianism for example: an ancient conflict that will always be a conflict.  And it’s not even important to our faith. It’s another question of HOW God does things. God doesn’t always explain the HOW. \nWhat Martin Luther fought for, now THAT is an important discussion. The Apostle Paul was the one who fought for Grace first and then Luther had to fight for it all over again.  Some things are essential to Christian faith. \nIf Sullivan’s Christian doctrine is basically sound, I’m glad to hear it.  He threw me off by saying that the Tower of Babel is a myth, and I still have my doubts about him. The Tower of Babel is actually on Google Earth, the spot is easy to find and investigate. \nSo what’s the myth?  That languages developed from then on?  Well, he could be right about that… Another theory is that God made it more difficult for people to UNDERSTAND one another:  even though they spoke the same language they could not come to agreement or understanding.  The turmoil that resulted caused them to abandon their Tower of Babel project and people scattered in various directions with everybody mad at everybody else.  That’s another possibility. \nIs there any way to prove exactly what happened? No. We weren’t there. The foundations of the Tower are still there, however, as testimony that the Tower of Babel did exist and God’s account must have some importance for us since it’s in the Bible. So I don’t think it’s right for Sullivan to call it a MYTH.  I am not likely to trust anything he says if Mr. Sullivan can’t show more respect for the Bible than that. \nWhether the Shroud of Turin is the real deal or not: well, that’s not exactly essential either but it’s one of those things that is just really Cool. And it’s encouraging for Believers, whether it’s the real Shroud of Christ or not. Because Christ really DID have a Shroud, and the Shroud of Turin helps us see Christ in yet another light. \nRegarding the current Pope, he was in charge of analyzing and clarifying and defining Church doctrine for many years. I have admired everything I have read so far, which admittedly isn’t all that much, but I really have admired his work regarding Christian doctrine. I think he’s remarkably clear-headed. Which shows that the heart of the man knows how to be in tune with the mind of God. I think he’s a good Pope, even though he’s not as charismatic as his predecessor. I’m not surprised the Cardinals selected him so quickly to be the new Pope, because his work was probably well-known among them. (I’m not Catholic, by the way.)\n\n","date":"September 12, 2011 at 7:45 pm","url":"https://shroudstory.com/2011/09/12/i-am-defeated-all-the-time-yet-to-victory-i-am-born/","cat":"history","id":"comment-3834","author":"AnnieCee","site":"shroudstory"}]
