[{"title":"Articles on the Shroud’s History","post":"The fact that the Associates of Biblical Research believe that one Pontius Pilate was a Roman governor in first century Palestine, and that men also walked with dinosaurs, says absolutely nothing about the truth value of either proposition. But in a free society one is entitled to believe either if one so chooses, but the sensible person will weigh whatever evidence is available for each.  Such freedom to believe what one chose or appeared reasonable or not, was not available in the Berlin of the 1930s, nor in the Eastern Europe of the 1950s. Nor was it even possible to debate certain topics under these successors of the heresy hunters.\nUnfortunately for somewhat similar reasons I find it impossible to discuss on this site in any kind of meaningful way, or even to exchange or to tease out ideas, any aspects concerning the principal theme of this header posting, due to the self-appointed guardian of what does and does not constitute legitimate historical enquiry concerning our principal subject. Suppression of course is as much the enemy of truth as is idle speculation.  But one should be free to speculate, as it can sometimes turn out to be productive, whereas suppression seldom can be!\n\n","date":"September 9, 2013 at 6:31 am","url":"https://shroudstory.com/2013/09/09/articles-on-the-shrouds-history/","cat":"history","id":"comment-43443","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Articles on the Shroud’s History","post":"Are you talking about me?\n\n","date":"September 9, 2013 at 6:57 am","url":"https://shroudstory.com/2013/09/09/articles-on-the-shrouds-history/","cat":"history","id":"comment-43449","author":"Dan","site":"shroudstory"},{"title":"Articles on the Shroud’s History","post":"I don’t know what he’s talking about at all. Pontius Pilate wasn’t governor?\n\n","date":"September 9, 2013 at 9:30 am","url":"https://shroudstory.com/2013/09/09/articles-on-the-shrouds-history/","cat":"history","id":"comment-43464","author":"David Goulet","site":"shroudstory"},{"title":"Articles on the Shroud’s History","post":"Certainly not referring to you in mine above, Dan.  You provide a wonderful site where free discussion could occur if allowed to by all the participants.  However, I find it somewhat tiresome to be endlessly lectured on the failings of a certain author and his particular theories on the history of burial cloths which may involve Edessa, when the lecturer is no better qualified to do so than other participants, and indulges in long rambling disjointed disoourses which tend to cramp what ought be open and free dicussion. It might have been a fascinating exercise to discuss John Long’s particular theories, but in that environment I think I may have come to the point where I find it too wearisome to do so.\n\n","date":"September 9, 2013 at 3:57 pm","url":"https://shroudstory.com/2013/09/09/articles-on-the-shrouds-history/","cat":"history","id":"comment-43504","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Articles on the Shroud’s History","post":"said like a good Wellingtonian!\n(From a fellow Wellingtonian now based in Australia)\n\n","date":"September 9, 2013 at 6:54 am","url":"https://shroudstory.com/2013/09/09/articles-on-the-shrouds-history/","cat":"history","id":"comment-43446","author":"Matthias","site":"shroudstory"},{"title":"Articles on the Shroud’s History","post":"Perhaps our problem is we are ‘poor colonials’ rather than European sophisticates!!!\n\n","date":"September 9, 2013 at 6:56 am","url":"https://shroudstory.com/2013/09/09/articles-on-the-shrouds-history/","cat":"history","id":"comment-43447","author":"Matthias","site":"shroudstory"},{"title":"Articles on the Shroud’s History","post":"To those interested in free, open-minded thought and speculation…\nI’ve been trying hard to find info about the first known epitaphios from Venice around 1200AD, without luck.\nThis object is referred to in brief in Schiller’s authoritative art history text.\n\n","date":"September 9, 2013 at 7:06 am","url":"https://shroudstory.com/2013/09/09/articles-on-the-shrouds-history/","cat":"history","id":"comment-43453","author":"Matthias","site":"shroudstory"},{"title":"Articles on the Shroud’s History","post":"I think that for many of us who take their Biblical Christianity seriously it is amazing how far secular rationalism has claimed a copyright to proper, objective thinking.  When I became a Christian in college (late 1960’s) I had to gradually work out the important questions of Biblical inerrancy, scientific origins, God’s role in human history, etc. I learned that there were plausible arguments to be made on each side. I eventually adopted many of the views Dan criticizes ABR for, but I did so because there were good, objective reasons for doing so (I could be wrong, but my quest was sincere). I suspect that most secularists have not carefully considered some of the better, serious work like found on the ABR website. I also realized how incongruent it was that God could make the universe and rise from the dead, but not keep his narrative accurate. But the final and most important step was to watch how my life changed for the better, and the many answers to prayer that the God who is There made happen. Could this God really have made so many mistakes in his historical narrative? I do respect other points of view, but there is still a good argument to be made for the traditional views ABR advocates.\nABR strongly endorses an objective (factual based) view of its interests (archaeology, science, history, Biblical interpretation, etc.). Although the Shroud is not one of their major interests, when one of their members (me) had a serious case to be made concerning its authenticity, they printed it. My four articles are an attempt to explain to the ABR fellowship that the Shroud has a history reaching to antiquity and deserves their consideration. I appreciate that Dan has seen fit to post a link.\n\n","date":"September 9, 2013 at 12:49 pm","url":"https://shroudstory.com/2013/09/09/articles-on-the-shrouds-history/","cat":"history","id":"comment-43487","author":"John Long","site":"shroudstory"},{"title":"Articles on the Shroud’s History","post":"Part 3 of the article introduced me to ivory carvings for the first time. I had not seen either the 11th century Lamentation from Schiller’s book (not naked, arms by sides, 5 fingers), or the 12th century Lamentation from the Victoria & Albert Museum (naked, arms crossed, 4 fingers). These spurred me on to find the 13th century Lamentation in the Metropolitan Museum of Art (not naked, arms by sides, 5 fingers). There is also a fascinating diptych on christusrex.org showing the tomb with quatrefoil holes in it.\nI agree with daveb, I think, in that I don’t really mind what ideas a site promulgates, however fanatically anti- or pro-. It is the evidence it adduces, particularly if I haven’t seen it before that interests me.\n\n","date":"September 9, 2013 at 12:59 pm","url":"https://shroudstory.com/2013/09/09/articles-on-the-shrouds-history/","cat":"history","id":"comment-43489","author":"Hugh Farey","site":"shroudstory"},{"title":"Articles on the Shroud’s History","post":"There is really no such thing as Bible Innerancy and it is only accepted by fundamentalists who end up as unbelievers (and anti-Christian!) when they realise they are wrong. It is difficult to find archaeological material from the Patriarchal period and the best Biblical scholars generally use the JEDP theory proposed by Wellhausen to trace the thought processes of the authors of the Pentaeuch. The historical-critical method is useful and there are good and respected scholars like Professor Blenkinsopp and Father Fitzmyer, and one can begin with Father Roland de Vaux’s history of ancient Israel.\n\n","date":"September 9, 2013 at 6:19 pm","url":"https://shroudstory.com/2013/09/09/articles-on-the-shrouds-history/","cat":"history","id":"comment-43517","author":"Louis","site":"shroudstory"},{"title":"Articles on the Shroud’s History","post":"Louis is probably aware that most serious Christians, scholars and lay alike, have maintained a high opinion of the Biblical documents in the past and have not changed their minds or renounced their faith.  True, there is more skepticism in recent generations (especially since the Enlightenment), but skepticism does not hold a monopoly on a careful consideration of the facts. Readers may want to review a sampling of conservative scholarship in Giving the Sense (2003; eds. Howard & Grisanti), a series of essays which addresses such issues as the Documentary Hypothesis (JEDP) and other OT questions. I notice that the volume can be had at a reasonable price on both e-bay and amazon.\n\n","date":"September 9, 2013 at 9:40 pm","url":"https://shroudstory.com/2013/09/09/articles-on-the-shrouds-history/","cat":"history","id":"comment-43529","author":"John Long","site":"shroudstory"},{"title":"Articles on the Shroud’s History","post":"John,you are right about what I would call a “direct line” to God (#8) which has nothing to do with what the biblical narratives say or do not say, in my view, and which can change people’s lives for the better. You may have noticed that there have been highly critical  — and highly respected —  scholars like D.N. Freedman, a convert to Christianity, who became a Presbyterian minister and did not lose his faith.\n\n","date":"September 10, 2013 at 10:58 pm","url":"https://shroudstory.com/2013/09/09/articles-on-the-shrouds-history/","cat":"history","id":"comment-43686","author":"Louis","site":"shroudstory"}]
