[{"title":"Bad Science? Bad Journalism? Religious Hoaxes All?","post":"Another hoax is Benjamin Radford who poses as a knowledgeable historian on his web-site and doesn’t know the difference between a genuine hoax, a mistaken belief, a credible possibility, and a sensational fact!  Hoaxes: Let’s tick off 1, 3, 4, 7;  Mistaken belief: tick 5; credible possibility: tick 6 – He’s apparently unaware the the Israeli Courts have dismissed the charges of fraud brought by the Israeli Antiquities Authority:  Sensational fact: tick 2 – Radford clearly knows next to nothing about the Shroud of Turin!\n\n","date":"October 2, 2012 at 6:17 am","url":"https://shroudstory.com/2012/10/02/bad-science-bad-journalism-religious-hoaxes-all/","cat":"history","id":"comment-17147","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Bad Science? Bad Journalism? Religious Hoaxes All?","post":"Radford does not seem to have done his homework and has therefore been mixing things unnecessarily, particularly by mentioning the Shroud. As for the James ossuary, Prof. Amos Kloner, former Jerusalem District Archaeologist, and one of those involved in debunking the “Jesus Family Tomb”, had this to say:\n“The inscription looks new. The writer tried to impart an ancient form to the letters by using contemporary letters….”  It did not mean that Oded Golan was involved in the forgery as he acquired the ossuary in the controversial antiquities market, where the IAA is struggling to preserve order. There are very serious people there. In 1967 they listened to Father Roland de Vaux, former editor-in-chief of the Dead Sea Scrolls, about how to handle these precious documents. Bedouin had been selling fragments in the market.\n\n","date":"October 2, 2012 at 8:55 am","url":"https://shroudstory.com/2012/10/02/bad-science-bad-journalism-religious-hoaxes-all/","cat":"history","id":"comment-17150","author":"Louis","site":"shroudstory"},{"title":"Bad Science? Bad Journalism? Religious Hoaxes All?","post":"Be refreshing if Bradford would avoid the books and visit Shroud.com to read the huried papers there, then opine…\n\n","date":"October 3, 2012 at 9:59 pm","url":"https://shroudstory.com/2012/10/02/bad-science-bad-journalism-religious-hoaxes-all/","cat":"history","id":"comment-17203","author":"Andy Weiss","site":"shroudstory"}]
