[{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Yannick, a very good initiative of yours… (and Dan’s).\nStep by step, I’ll try to address your most pressing questions and make some effort to be a little more articulated as much as possible for once (not that easy while working on professional files and with only free time in snatches). Never mind. Let’s go!\nYou write as “Fact #1 : Every known reproduction of the Mandylion ALWAYS represent a living Christ with his eyes wide open and without any signs of injuries, bruises or bloodstains. The most important thing to note is the fact that many of them were done during the time the relic was kept in Constantinople and publicly showed at least once a year, from 944 until 1090 (at least). Many of these copies were probably done by artists who were able to see the relic with their own eyes, or at least, who were able to get precise information about his physical aspect from eyewitnesses who had seen it in Constantinople. But despite that fact, absolutely none of these copies that have survived until this day represent a bloody and beaten Christ, easily associated with his Passion, the way we see it on the Shroud of Turin. If Wilson’s hypothesis is correct, WHY is this so ???” \nTHE TRUE FACTS HERE ARE:\n1/ Firstly, today’s viewer shall realise that whether in the 1st century CE or in Byzantine times, the Shroud face image could have been viewed animistically, that is, as a living presence and thus be aware of the theory of animism as people in ancient times instinctively saw images as quasi-living beings. Such an animism is TOTALLY CONSISTENT with the coming into existence (4th -12th century CE) of Christ’s faces copies and representations of the Turin Shroud  (TS afterward) face all depicting Yeshua’s  with his eyes wide open to evoke not so much his death or death mask than his divine nature as resurrected Christ. The Abgar legend shall be read in this light and so the Holy Mandylion reproductions. \n2/ not only have a few reproductions of the Mandylion but also of the Keramidion/Keramion & the Sindon reached us… \n3/ the vessel/reliquary table (60cm high x 45cm wide x 8cm deep) of the Holy Face of the Holy Mandylion was in the Paris Saint Chapel till the Revolution. Its precious stones were despoiled and its gold gilt trellis melted.\n4/ in Byzantine times, each of the three famous relics was kept in a characteristically gold gilt trellised vessel/reliquary-table with a central occulus on the front side so as to see the Holy face. Both the Mandylion’s and Keramidion/Keramion’s vessel were about square-shaped whereas the Sindon’s was double-square/gold rectangle-like shaped. When seen in mosaics, frescoes and miniatures, it is most currently overlooked by Shroud searchers that, with no scale indication, each of the representation of the three relics kept within their reliquary can look alike or almost alike to the viewer.\n5/ the Holy Face of the Mandylion (later known as the Holy Shroud of the Holy Veronica of Rome is now kept in Manoppello and known as the Holy Veil. that is most likely a very ingenuous copy of the Sindon face; very ingenuous in terms of half acheiropoetic and half man-made “in-rusted natural template” of Yeshua’s burial cloth death mask. It is a fine transparent Byssus.\n(From the start, don’t you misunderstand me: I only 25% agree with the Wilson hypothesis)\n\n","date":"June 29, 2012 at 9:53 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13180","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"All these questions can easily be answered if one consider that there were many copies of the Mandylion and that what Wilson proposed is essentially that the Shroud of Turin was in Edessa prior to 944, that the Mandylion was essentially the Shroud, that is, directly based on it, that the Shroud was closely guarded in Edessa, that only very selected people could directly see it, that the mass of people would only see a copy of it (the Shroud), and that the Shroud was transferred from Edessa to Constantinople in 944. That’s the essential elements of what Wilson proposed. You have some other details you can debate on.\nAdd to that what Max Patrick Hamon wrote on point 1.\nAt many times, it is likely that many confused the Shroud and the copies of it shown as the “Mandylion”. Yet it is possible, for some official occasions, that the Shroud was shown folded such that only the face was visible.\nIn any case, given all textual and iconographic evidences, what was the most likely location of the Shroud between 5xx-944? Edessa. \nAnd to complete about the possible confusion: ask some of your acquaintances if they think the Shroud of Turin shows a complete picture of a body or only a face. You will see that many (majority?) thinks that it is only a face. This is even true today after full complete photos of the Shroud have been in circulation for more than 80 years. The Internet has not even removed this confusion for many.\n\n","date":"June 29, 2012 at 12:37 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13186","author":"Mario Latendresse","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"\nMario Latendresse :\nAll these questions can easily be answered if one consider that there were many copies …\n\n1.The Mandylion was extended at least twice. During the siege of Edessa the metropolitan extended it in front to the people. It also was extended before transfer to Constantinople to compare two copies and make sure it was the real Mandylion. (Andrea Nicolotti: “Forme e vicende del Mandilio di Edessa secondo alcune moderne interpretazioni”, p. 280, 296). It’s hard to believe that the Mandylion custodians not extend it ever. This lack of curiosity is unbelievable. (Emmanuel Poulle: “Les sources de l’histoire du Linceul de Turin”, p. 770).\n2.People describe the Mandylion are not “someone’s friends” or people passing by. They are important imperial figures and custodians of the canvas. Do not ask your friends the size of the Shroud of Turin. Ask the Custodian Cardinal or Mme. Flury-Lemberg. They will tell you the actual measurements. Sure. \nYou answer “easily”… too “easily”. With imagination is easy to find solutions for everything. Imaginary solutions. History is more complex problem.\n\n","date":"June 30, 2012 at 3:08 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13201","author":"David Mo","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"‘Given all textual and iconographic evidences, what was the most likely location of the Shroud between 5xx-944?’ – Neverland.\n\n","date":"June 29, 2012 at 1:28 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13187","author":"Davor Aslanovski","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"To DA: \nAs far as the TS is concerned, your “most sectionnal”/reductivistic superfiical  field of pseudo comprehensicve expertise is most definitely Neverland/DeadendLand…\n\n","date":"June 29, 2012 at 7:48 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13196","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Mario.  ‘Can easily [sic!!] be answered’. Well, there are seven questions here in the first para and only documentary evidence for one- the transfer of the Image of Edessa. The rest are highly dubious speculations and most seem to be very unlikely. Wilson’s argument is a very precarious pile of cards,only one of which needs to be removed for the whole lot of fall down. This is not history as it should be done.\nMario : ‘It is likely that many confused the Shroud and the copies of it shown as the “Mandylion”.’\n I am not surprised!!\n\n","date":"June 29, 2012 at 3:03 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13190","author":"Menedemus","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"DA: ” ‘Given all textual and iconographic evidences, what was the most likely location of the Shroud between 5xx-944?’ – Neverland. ”\nDA thus demonstrates the limitations of individual single specialities / specialists in coming to any kind of rational decision on complex problems.  These are insufficient by themselves.  Our courts don’t work that way, not in NZ anyhow.  They might do of course in DA’s world! \nHe could start at the beginning, say by reading Dr Pierre Barbet’s llittle booklet “A Doctor at Calvary” published as long ago as 1953, and progress from there if he can.  If it was in Neverland, “Make one!”,  No-one can! Not to date, anyhow, not even Richard Dawkins! .\n\n","date":"June 29, 2012 at 4:30 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13193","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"daveb of wellington nz demonstrates the limitations of non-specialists in coming to any kind of rational decision on complex problems. \nHe could start at the beginning, say by asking himself what the meaning of the word ‘specialist’ is.\n\n","date":"June 30, 2012 at 9:08 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13210","author":"Davor Aslanovski","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Quote from Mario : “Given all textual and iconographic evidences, what was the most likely location of the Shroud between 5xx-944?’ – Edessa”.\nComment from me :  This is PURE speculation.  Here, Mario falls in the same trap than Wilson, who is a champion of bad speculations.  The historical FACT is this :  Nowhere in ancient sources there is one direct link between the city of Edessa and the presence of a Shroud of Christ (or some burial garments of Christ) and nowhere in ancient sources there is one direct link between the Mandylion and a cloth related to the Passion of the Christ.  In fact, it’s precisely the opposite, because we have many ancient sources that make a clear separation between the Mandylion and the Shroud (or burial cloths) of Christ, and we also have many ancient list of relics associated with the Passion of Christ and, IN ABSOLUTELY NONE OF THEM can we find a direct or even indirect mention of the Mandylion and/or the Abgar legend.  This is so clear that, in all logic, this can only mean one thing : That the image on the Mandylion had nothing to do with Jesus Passion, death and emtombment.  And note that this conclusion is in total agreement with what was always reported to be concerning the Mandylion, i.e. that it was a small towel showing only the face of the living Christ, without any bruises or bloodstains on it. \nALL THIS IS NOT GREAT FOR WILSON’S HYPOTHESIS !!!\nThese are solid historical FACTS.  Now, do what you want with them !!!  If you want to do science-fiction like Wilson in order to comfort your preconceived ideas, it’s your problem, but if you really want to stay “scientifically correct” (meaning that you make sure to go where the FACTS lead you), you should conclude that there is no evidence at all to let us think that the Shroud of Turin ever stay even one single day in Edessa !  That’s the reality and I know that EVERY real Byzantine Historians would agree with me on this point.\nAnd for the idea that there was many copies of the Mandylion in Edessa, this is a fact but these copies were of the same dimensions than the original (I.e. a small towel for the face).  We know this because, in 944, when the Byzantines wanted to take the original Mandylion, they had to make a close examination of the relic in order to make sure it was not a painted copy.  From this single fact alone, we can be sure that the Mandylion and the Edessenian copies of it (there was at least 2 documented copies) were very similar, meaning, most probably, that they were 3 small cloths showing only the face of the living Christ…  In conclusion, the fact that there was at least 2 copies of the Mandylion in Edessa at the time the relic was transferred to Constantinople has nothing to do with the idea that the original Mandylion could have been a burial shroud folded to show only the region of the face.  This is, again, pure speculation !\n\n","date":"June 30, 2012 at 4:26 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13236","author":"Yannick Clément","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Unfortunately, Yannick is not addressing the precise question that I put forward, namely, “Given all textual and iconographic evidences, what was the most likely location of the Shroud between 5xx-944?’”. Just take an extreme example to try to make my point (hopefully) clear. (It is almost a pure mathematical exercise.) Say that the list of locations under consideration is “Montreal and Constantinople”. What would be the answer to the above question? I think it is clear that the most likely place between these two cities is Constantinople (Montreal did not exist, and we have no evidence from the autochthons’ culture of a shroud of Christ in America during that period). Take another example: “Damas, Constantinople”, …, Constantinople is the most likely place again. Take a longer list of cities “Constantinople, Edessa, Paris, Bern, Antioch, Rome”. What is the most likely place from this last list?  Make the list longer if you like, and you can answer the question. If you have another city that beats Edessa, name it. Otherwise you are not answering the question and you are dealing with a different issue. (And Yannick, do not send me personal, insulting emails, I do not want any of them.)\n\n","date":"June 30, 2012 at 5:02 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13237","author":"Mario Latendresse","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Mario’s comment is, again, purely speculative.  In all the ancient historical sources that clearly indicate the presence of a shroud, NO ONE talk of the city of Edessa.  This is a fact, but this fact seems, for an unknown reason, to be completely forgotten by Wilson and his fan club.  \nThis is a FACT that we have some ancient sources (very few) that talk about a the presence of a Shroud of Christ in Jerusalem.  This is also a FACT that we have numerous ancient testimonies (like the ones of Nicolas Mesarites and Robert de Clari) that talk about the presence of a Shroud of Christ (or burial cloths in the plural) in Constantinople (ALONG WITH THE PRESENCE OF THE MANDYLION AND THE KERAMION, WHICH WERE 2 COMPLELY DIFFERENT RELICS, NOT ASSOCIATED WITH THE PASSION OF THE CHRIST).  But I repeat it :  there’s absolutely no ancient accounts to even suggest that a relic showing the bloody and beaten face of the Jesus of the Passion was kept even one single day in Edessa.  THIS IS A FACT.  In fact, on the base of ancient sources, the only 2 images of Christ that we can trace in Edessa are the Mandylion and the Keramion, and both were said to be images of only the face of the living Christ…\nIn order to follow properly the scientific method, if we take all those facts into account, one good hypothesis would be to think that the Shroud of Christ (which is not clear if he really was the Shroud of Turin) went directly from Jerusalem to Constantinople, sometime between the beginning of the 8th century and 958.  No reason to think Edessa would have been part of the journey of this Shroud of Christ.  Absolutely no reason…  And if you don’t think like that, it’s just because you don’t want to follow the FACTS where they lead you.  By acting like that, someone just prove that he has no respect for the scientific method.  Note :  this last statement is not direct toward Mario personally…  It’s a general observation that can be applied, I think, to many people in the Shroud world.\n\n","date":"June 30, 2012 at 5:38 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13242","author":"Yannick Clément","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Now, we have a clear hypothesis proposed by Yannick vs Wilson: the Shroud of Christ (which Yannick does not make equal to the Shroud of Turin) would have been transferred from Jerusalem to Constantinople (with no transition to Edessa at any period of time) between the 8th century and 958. I think you never proposed that after numerous attacks on Wilson’s proposed hypothesis. I think you should pinpoint the evidences for this hypothesis and compared them to the hypothesis that the Shroud of Christ (and we should say the Shroud of Turin) was never in Edessa.\n\n","date":"June 30, 2012 at 6:03 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13244","author":"Mario Latendresse","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"I just followed the historical evidences.  That’s a fact that a shroud of Christ was in Jerusalem but no source mentioned that it bears an image or even blood on it.  It’s a fact that there was a shroud of Christ in Constantinople from 958 at least. But one precision :  I don’t pretend to have a real hypothesis to explain the obscure years of the Shroud of Turin.  I’m not that pretentious or that dishonest.  The reality is this :  From the ancient documentary and artistic sources we have, it’s simply impossible to retrace a complete path for the Shroud between the year 30 (or 33) in Jerusalem and the year 1350 in Lirey, France.  It’s impossible…  In my previous comment, I just wanted to underline the fact that there were some sources that talk about a Shroud in Jerusalem and some others that talk about a Shroud in Constantinople, but there was no source at all that talk about a shroud in Edessa.  This is a FACT.\n\n","date":"June 30, 2012 at 6:13 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13245","author":"Yannick Clément","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Yannick you really think anyone would have kept the SHroud in Jerusalem or Palestine till the 8th century, seriously? Palestine was conquered by the Persians’ in the 7th century. I’m sure without any doubt the Shroud would have been taken out, if there at all. It is more likely it was taken to a safe area such as Antioch or Edessa well before then. THere is no FACTS of whether the Shroud was or was not in Edessa but that is why Wilson hypothesizes the Shroud may have been known as the  Mandylion. Yes folded in 8, covered so only the face showed and then shown very very rarely to anyone. Whether the people in Edessa knew this was a full length Shroud or not, we can only guess, maybe it was never unfurled due too worries of sacrilege? Or maybe it was known that it was a full length burial Shroud but only by a certain few in the hierarchy and kept a secret for obvious security reasons….Only to be realized in 944 when forcefully taken from Edessa. The fact that the image of Edessa or Mandylion was never described as a burial Shroud or the fact blood markings were not mentioned could be solved by this hypothesis. and would explain alot.\n\n","date":"June 30, 2012 at 7:54 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13248","author":"Ron","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Dan I seem to be having issues anytime I try to reply to any comments. It starts to pop the cursor out of box and I am unable to cursor to where I left off. This has been occuring for awhile now, making it almost impossible to finish my comments properly. It happens only if I try to use reply or quote, I’ve noticed.\nThanks.\nR\n\n","date":"June 30, 2012 at 8:00 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13249","author":"Ron","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Yannick, #13. You wrote at comment #11\n“In order to follow properly the scientific method, if we take all those facts into account, one good hypothesis would be to think that the Shroud of Christ (which is not clear if he really was the Shroud of Turin) went directly from Jerusalem to Constantinople, sometime between the beginning of the 8th century and 958.”\nNow in comment #13 we read “That’s a fact that a shroud of Christ was in Jerusalem but no source mentioned that it bears an image or even blood on it. It’s a fact that there was a shroud of Christ in Constantinople from 958 at least.” \nFrom these two “sources” you conclude that the shroud in Jerusalem went directly to Constantinople. The shroud in Constantinople had an image on it. So we have two shrouds that according to you do not match that much. Where are your evidences of this “one good hypothesis” of #11? You accuse others of speculation…\nDid you mean the following instead: “we have a shroud in Jerusalem in 30-33AD , we have a shroud in Constantinople in 7xx-958, and we have no evidence that they are related.”? That would not be an hypothesis, that would be a non-hypothesis.\nAnd then you jump into another issue “From the ancient documentary and artistic sources we have, it’s simply impossible to retrace a complete path for the Shroud between the year 30 (or 33) in Jerusalem and the year 1350 in Lirey, France. It’s impossible…” You are obviously tackling another issue that is far more demanding. \nThe question was “Given all textual and iconographic evidences, what was the most likely location of the Shroud between 5xx-944?’”.\n\n","date":"June 30, 2012 at 8:17 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13250","author":"Mario Latendresse","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"What I wanted to say is this :  From ancient sources, if we want to retrace of the manuscript that talk SPECIFICALLY (without having to make special assumptions or speculations, like Wilson always do) talk about a shroud of Christ (in the sense of a burial cloth associated with his Passion), all we can found is a few references to the presence of a shroud of Christ kept in Jerusalem (or elsewhere in Palestine) from the 6th century until the 8th century.  No reference is make for the possible presence of blood and/or a body image on this shroud.  After that, I have not seen one single reference to a shroud of Christ until 958 in Constantinople and then, there’s many references to a burial cloth of Christ like that (associated with his Passion) until the sack of Constantinople.  But what is not easy is the fact that only the testimony of Robert de Clari from 1204 make a clear mention of the presence of a full length body image on it.  So, did the shroud mentioned in a letter of the emperor Constantine VII in 958 is the same that is mentioned by Robert de Clari in 1204 ?  Again, it’s impossible to tell without making speculations.  Personally, in the light of all the existing references we have, I don’t think that it is possible to draw a proper hypothesis for the obscure years of the Shroud.  But having said that, I want also to state that I agree totally with Paul Vignon on this topic :  all the Pantocrator icons and all the Holy faces images (like the Mandylion and the Keramion) presents too much similarities with the image of the Shroud to be due to hasard.  And that lead Vignon to conclude that all these images (note that they’re all image of the LIVING Christ without bloodstains or injuries) come, directly or indirectly, from the image on the Shroud.  In other words, all these images of the living Christ are based, directly or not, on the image that we see on the Shroud.  And for Vignon, and for me, that was enough to prove that the Shroud was present in the Near East, at least, from the 5th century on.  And if we think that the few images of Christ found in Roman catacombs with long hair and beard could also have been based, directly or not, on the image of the Shroud, that mean the Shroud was there during the 4th century.  But it’s not because these images of Christ were probably connected with the image of the Shroud that it mean they were on and the same !!!  I think there’s enough clues in ancient artistic depictions of Christ (the Mandylion being one of them) to prove that the Shroud was present and known by some artists, from the 5th century on, and maybe from the 4th century on.  But these good clues are not enough to produce a real solid hypothesis concerning the Shroud and is whereabouts during all these years…  I hope this comment of mine will help you to understand perfectly what I wanted to say the other day !!!\n\n","date":"July 2, 2012 at 5:08 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13341","author":"Yannick Clément","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"I forget to mention that we have 2 or 3 references (that some historians have questioned the credibility) that also talk about the presence of the Shroud of Christ (the same that Robert de Clari had seen in 1203 at the Blachernes Church) in Athens, probably in the hands of Othon de la Roche.  After that, nothing until the D’Arcy memorandum of 1389, telling that the Shroud of Turin was put in public display in Lirey, France, around 1357 or so (just after the death of Geoffroy de Charny).  So, in retrospective, we can say that we have some testimonies about the presence of a shroud of Christ in Palestine (some mentioned Jerusalem, some talk about another location, like the banks of the Jordan river) between the 6th and the 8th century.  Then, after that, we have many mentions of a shroud of Christ in Constantinople between 958 and 1204.  Then, we have just a few testimonies (hard to tell if they are credible) that talk about the presence, in Athens, of the Shroud that was kept in Constantinople, in the first few years following the sack of Constantinople in 1204.  Then, nothing until the D’Arcy memorandum of 1389, which indicate that the Shroud of Turin was in Lirey, France, at least from 1357 on.  That’s all we can learn from ancient sources without making any kind of speculations like Wilson do for the Mandylion.  And it’s impossible to tell if the Shroud of Jerusalem was the same than the one that was kept in Constantinople.  But, on the contrary, I think there’s very good clues that exist to say that the Shroud that Robert de Clari saw in Constantinople in 1203 was probably the same than the one that was publicly showed in Lirey around 1357…  It’s not 100% sure of course, but I think we can say that the chances are pretty good that it is the case.\n\n","date":"July 2, 2012 at 6:08 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13344","author":"Yannick Clément","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"\nMario Latendresse :\nThe question was “Given all textual and iconographic evidences, what was the most likely location of the Shroud between 5xx-944?’”.\n\nPetitio principii!\n“Given all textual and iconographic evidences” there is no evidence of the existence of a shroud with the Crhist’s image neither in Constantinople, or nowhere. Until 1204 (Robert de Clari).\n\n","date":"July 1, 2012 at 1:37 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13253","author":"David Mo","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"This comment of David Mo is exactly right.  There is no DIRECT reference of a Shroud of Christ with a body image on it before 1204 with Robert de Clari.  And prior to that (in 1200 or 1201), there is just one INDIRECT reference of a Shroud of Christ with a body image on it and it come from Nicolas Mesarites, the guardian of the relics of Christ that were kept in the Pharos Chapel.  He wrote this : “the Burial sindones of Christ: these are of linen. They are of cheap and easy to find material, and defying destruction since they wrapped the uncircumscribed, fragrant‑with‑myrrh, NAKED body after the Passion.”  As Baima Bollone once said in the book he wrote in 2000 about the Shroud, when we know the repultion of the Byzantine to represent Christ naked during that period of time, this bizarre mention of the nudity of Christ in a description of his burial cloths must be related to the naked body present on the Shroud of Turin.  I agree completely with this point of view.  I don’t see any good reason that this Byzantine guy would have talked about the nudity of Christ while talking about his burial garments if the Shroud of Turin was not among them.\nBut the most important thing to note is the fact that these 2 testimonies are the ONLY ones, in all ancient writtings, to make any kind of reference to the presence of a body image on the Shroud of Christ, prior to his public showing in Lirey around 1357.  And that fact lead Paul Vignon to conclude this about this Shroud of Constantinople (I think his point of view is very close to the truth) : The Shroud was probably kept folded in a receptacle and that the practice of exhibiting it every Friday, attested by Robert de Clari, begin only after the Byzantine Emperor made his residence in the Palace of Blachernes, which would have been 2 or 3 years before the sack of the city in april 1204 (remember that this Shroud was still probably kept in the Pharos Chapel in 1200 or 1201).  Before that possible non recorded transfer of the Shroud to the Blachernes in 1201 or 1202 (or even 1203), it is truly possible that this cloth was never publicly showed or, if it was, only the backside of the cloth (with no body image truly visible) could have been showed…  It is truly possible to think that the Orthodox Clergy in charge of protecting the relic was affraid to show the dead, naked, bloody and suffering body of Christ to the faithful and that the mentality (and/or the theological thinking) of the time (around 1200) had changed enough to permit the first public exhibitions of the relic and his image.  This is a scenario which is truly possible regarding the period of time…  No one can prove it yet, but I think Vignong’s hypothesis is very interesting and truly rational.  One little difference from my point of view :  Vignon think that the first exhibitions of the relic in the Blachernes Church would have been caused by the change of residence of the Byzantine Emperor, from the Great Palace (where the Pharos Chapel was) to the Blachernes Palace around 1201 or 1202.  I think it is truly possible that the first public showing of the Shroud could have been due to the arrival of the crusaders in front of the city in 1203.  It is possible to think that the Byzantine authorities (the Emperor, the Clergy, etc.) would have decided to show the inner part of the Shroud (the one with the body image) to the crowds in the Blachernes Church at that moment, in order to ask some Divine protection against this major threat against their city.  Effectively, it was common in ancient time to use a relic of Christ as a palladium for the city…  The Mandylion was probably used for this task in Edessa in more than one occasion and now, it is possible that it was the turn of the Shroud of Christ to play this important role in 1203-1204.  If my idea is right (it is only a speculation here), then that would mean that the palladium role of the Shroud was not effective at all because the city was sacked in 1204 !!! ;-)\n\n","date":"July 2, 2012 at 9:15 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13348","author":"Yannick Clément","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Yannick: \n1. Mesarites speaks of two different objects. One is the Mandylion and the other the shroud.\n2. Mesarites is not talking about a picture of a naked body. Only says that the shroud wrapped the naked body. They are two very different things.\n3. You have a lot of imagination. We’ve had a nice story. But the history is not done with imagination, but with data. And you tell us some things that are not true. It is not true that the Byzantines did not show naked Christ. In the Byzantine mosaics of Italy there are naked Christs. It is true they did not like to show the corpse of Christ (nude or not). So they painted one only in 1204. Other things in your story are not true. For example, the shroud was extended several times. (Bernard Flusin: “L’image d’Édesse, Romain et Constantin” en Adele Monaci ed., Sacre impronte e oggetti “non fatti da mano d’uomo” nelle religioni; p. 268). Other: an object that remains folded for centuries left clear marks on the fabric. Etc,.etc. Once again, imagination is good for telling stories. But stories are not history.\n\n","date":"July 3, 2012 at 1:35 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13352","author":"David Mo","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Reply to David (one by one) :\nYou wrote : “1. Mesarites speaks of two different objects. One is the Mandylion and the other the shroud.”\nComment from me :  I know that very well and that’s exactly what I reported in my article…\nYou wrote: “2. Mesarites is not talking about a picture of a naked body. Only says that the shroud wrapped the naked body. They are two very different things.”\nComment from me : When I talked about this topic, I was refeering to Baima Bollone’s opinion and said that I agreed with him.  His point of view was very rational on this question : When someone knows how much the Byzantine where not inclined to talk or show Christ’s nudity (I’m not talking about the few icons of his baptism that still hide his nudity in some clever way… These are much more the exception than the rule), so when someone know that HISTORICAL FACT, the fact that Mesarites talk about Christ nudity in relation with his burial cloth is VERY STRANGE and UNCOMMON for the time !  For me, it is a very good clue that the Shroud describe by this guardian of relics is the very same shroud that was seen by Robert de Clari 3 years later in the same city.  And when you take these 2 eye-witnesses testimonies and all the informations contained in the artworks of the Pray Codex and you put them together to see the whole picture, I don’t think there’s too much doubt that the Shroud of Turin was present in Constantinople between at least the second part of the 12th century until the sack of Constantinople in 1204.  Of course, this is not a full proof without any doubt, but if we use the Ockham Razor principle, I really think that the most probable answer concerning these works (Mesarites, de Clari and Pray Codex) is that they refers in some way to the Shroud of Turin and that this relic was then kept in Constantinople.  The odds are in favor of that.\nYou wrote : “It is not true that the Byzantines did not show naked Christ. In the Byzantine mosaics of Italy there are naked Christs.”\nComment from me : Sorry for not having been enough precise in my statements.  In my mind, when I refers to the Byzantine art, I refers to the artworks that were done in the Middle East by Byzantine artists, not to artworks that were done in the West following the Byzantine style.  In the Byzantine world of the Middle East, I really don’t think you’ll find much depictions of Christ showing him completely nude (like in the artworks of the Pray Codex) and/or showing with bruises, injuries and/or bloodstains before the 14th century.  Again, you can maybe found a few Mid-Eastern artworks like that before the 14th century but they will surely represent the exception and not the rule !\nYou wrote : “the shroud was extended several times…”\nComment from me :  First of all, the reference you gave us from the article of Flussin is completely irrelevant because it talk about the Mandylion, not the Shroud of Christ !  Also, here’s a message for you :  Show me the references please where an ancient text talk about a public showing of a Shroud of Christ with a body image on it !  The first time a Shroud of Christ was clearly said to bears a body image was in the testimony of Robert de Clari of 1204.  Before that, there’s just the testimony of Mesarites of 1200-1201 that can be seen as a tacit reference to an image.  Before that, nothing !  We have absolutely no clue from ancient historical sources to think that the Shroud of Turin was publicly exhibited prior to 1203-1204 at the time the crusaders came in front of the city.  Of course, once the Shroud was exposed in Lirey around 1357, it’s pretty obvious that the relic was often extended completely.  But before 1203, we have absolutely no clue of any public exhibition of a Shroud of Christ showing a body image on it.\nAnd you also wrote : “an object that remains folded for centuries left clear marks on the fabric…”\nComment from me :  You don’t agree with me or what ?  I’m not sure to understand the critic here.  Use your logic please.  If you do, you’ll understand that a linen cloth that would only have a part of it exposed to air, dust and sunlight for century while always remaining in the same configuration will surely show some noticeable differences (physical and/or chemical differences) at fibers level (and even at the naked eye !  It’s most probable that we would see more dust and dirt in the exposed region, more oxydation of the fibers too, etc…\nIf the Shroud have no noticeable difference of content like that, it is most probably because the configuration in which the relic was kept did changed often along the years.  Just because of the burn holes, we know that the relic was kept in at least 3 or 4 configurations before 1532.  From this little clue, we can easily expect that the cloth was kept in some more configurations along the years… \nAnd for your comment about my imagination, what can I say ?  I made it clear that I didn’t invent anything and that all the 22 facts I gave you come from credible sources (at least I think so).  Look, I even gave you a list of these sources at the end of my paper.  Of course, it’s truly possible that my interpretation of some of these facts can be different than yours, but I really don’t think I have been a daydreamer in this paper.  In fact, I’ve tried to stay honest, rational and prudent.\nOne thing you’ll need to put you in your head :  It’s not because there are 2 or 3 known depictions of Christ in some specific way that it means that this was an artistic trend at the time those few artworks were done !!!\n\n","date":"July 4, 2012 at 8:32 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13473","author":"Yannick Clément","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"We have no clear way of knowing whether the Blachernae Shroud mentioned by Robert de Clari in 1203/4 is the Shroud of Turin. It is a single reference and not precise enough to make the connection for sure (e.g. one would expect some reference to the double image). The fact that there is no other mention of this shroud by sources within Constantinople itself ( a city which provided quite a lot of lists of relics) suggests it was not considered among the more prestigious relics of the city.\nHowever, we know the Blachernae relic collection was first built up in the fifth century and we know that under the auspices of the imperial family, many relics came direct to the chapel from Jerusalem which  was still  directly under Byzantine control. The link between the two cities was considered very important after the empress Helena transferred two nails from the Cross to Constantine himself as the time of the city’s foundation in 330.\nSo ,and this is pure speculation, the Blachernae Shroud may have come direct from Jerusalem in the fifth century and remained in the Blachernae Chapel ever since then. It was just not considered important enough alongside the very prestigious relics Constantinople had, for it to be mentioned in a relics list before an outsider, de Clari, saw  it.\n I just put forward the idea as one which as likely as others suggested here and certainly much more likely than the highly convoluted theories of Ian Wilson!  There s no question that that this could be the Mandylion moved without any documentary evidence to the Blachernae Chapel between 1201 and 1203. These translationes were major public events and it would have been recorded- after  all the Mandylion, unlike the Blachernae Shroud, was a top class relic.\n\n","date":"July 1, 2012 at 5:08 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13259","author":"Menedemus","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"When it comes to the cloth of Edessa-Turin Shroud issue, can any serious Shroud researcher take Davor Aslanovsky et al seriously when they keep asserting ad nauseam that there is NOT THE SLIGHTEST EVIDENCE the cloth of Edessa and the Turin Shroud can be one and the same object? \nThe fact is, when I read DA et al assertive and somewhat arrogant posts/articles, I cannot help thinking these guys have a serious problem:\nMOST OBVIOUSLY\n1/they have neither any in-depth knowledge of the Greek, Latin nor Syriac original texts; \n2/they have neither any in-depth knowledge of the Byzantine nor Medieval iconography; \n3/they have neither any in-depth descriptive knowledge of the Turin Shroud nor any archaeological vista. \nIn other words, they are just IGNORANT all the more so as they think themselves much smarter than any other Shroud scholars especially… an archaeocryptologist.\nIF THEY WANT A FEW PIECES OF EVIDENCE, I’ll be VERY HAPPY to provide them. \nARE READY TO READ THEM ON THIS BLOG TO THEIR UTTER PUBLIC SHAME & DISCREDIT?\nThat’s the question…\n\n","date":"July 2, 2012 at 4:22 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13301","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Mistyping: “ARE THEY READY”\n\n","date":"July 2, 2012 at 4:25 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13302","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Typo error: “they are just IGNORANTS”\n\n","date":"July 2, 2012 at 4:39 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13303","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Then I do hope Davor Aslanovsky et al will be men enough to accept they were totally off track in Dead-endLand….\n\n","date":"July 2, 2012 at 6:16 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13304","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Mistypin: “to recognize” (instead of “to accept”)\n\n","date":"July 2, 2012 at 6:18 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13305","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Can the cloth of Edessa & the Turin Shroud be one and the same object?\n(The true facts, continuation + a few pieces of evidence) \n6/ in 730 CE, in his Apologetic Treatises against those Decrying the Holy Images, John of Damascus described the Image of Edessa as a himation.\n7/ A himation is an ankle-length cloak/garment. It can be made of wool or heavier drape (winter/autumn wear), linen and cotton. In Arabic, the word mandul < Byzantine Greek mandylion) translates as scarf, turban, face towel/veil. Since the Holy Mandylion was a fine transparent sea Byssus face veil, it just cannot be the 3/1 twill weave long rectangular Turin Shroud (see the pre-1618 century CE Sancto Vultus Veronicae Sudario of Rome aka the Manoppello Veil).\n8/ The Greek himation when used alone (i.e. without a ketoneh/chiton) as work wear, summer wear or evening/nightwear was called an achiton. Oftentimes in Byzantine & Medieval iconography, Yeshua/Christ wears both himation over a chiton and himation alone (= achiton). \n9/ « wearing the himation: The garment is worn either alone or over a chiton/ketoneh. The himation is worn draped about the body from shoulder to ankle.\na. One end of the garment is thrown over the left shoulder to hang between calf and ankle.\nb. The remaining material is brought around under the right arm, across the back and thrown over the left shoulder.\nc. The remaining material is draped along the length of the arm to hand down towards the left foot. » \nFIRST EVIDENCE: had Davor Aslinosky et al proceeded to a more thorough probing of the topic, they would have been aware that for a man 5”8” to 6'2” the himation should be roughly 4.2m long & 1.4m wide i.e. exactly the same long rectangular shape and roughly the same size as the Turin Shroud 440cm long &115cm wide.\nSECOND EVIDENCE: had Davor Aslinosky et al really been aware of the Byzantine iconographic himation of Christ, they would have notice its striking similarity with a long rectangular cloth. (See e.g. the Resurrection mosaic, Hosios Loukas, 10th century CE + the Armenian miniature by Toros Roslin (http://lasabanaylosescepticos.blogspot.com/2009/09)\n                                                                                                  (TO BE CONTINUED)\n\n","date":"July 2, 2012 at 9:55 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13315","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Typo error: “described the CLOTH of Edessa as a himation”\n\n","date":"July 3, 2012 at 7:49 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13383","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Correction: “Mandylion is a Byzantine-Greek borrowed from the Arabic MANDIL (mindil in Syriac) i.e. a kerchief, towel, turban, towel, face veil”.\n\n","date":"July 3, 2012 at 3:41 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13406","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"The true facts in terms of textual & visual pieces of evidence that the cloth of Edessa and the Turin Sindon are most likely to be one and the same object (continuation)\nTHIRD EVIDENCE (the Parthian connection): there were three Parthian vessels/reliquary-tables in Constantinople: The Mandylion and the Keramidion/Keramion near-squared reliquary-tables/vessels + the pseudo-Mandylion/Sindon long squared reliquary-table/vessel). The Byzantine 11th-12th three iconographic reliquary-tables not only do show ‘Parthian frontality’ but are also gold gilt trellised with the same Parthian central floral pattern when seen e.g. in the light of a 2nd century CE statue of Parthian King Uthal of Hatra.\nFOURTH EVIDENCE (the Parthian connection): from 1978 Schwortz Turin Sindon face photograph, a short portion decal of a text in Nestorian type of Syriac script can be detected on the digitally enhanced area just under the beard (see Thierry Castex’s blog in which the same faint almost iligible writing is most unfortunately misinterpreted by Puesch et al as square Hebrew script).  This faint writing should be futher investigated in the light of Rabbi Yeshua’s/the Christ’s apocryphal letter to King Abgar.\n(TO BE CONTINUED)\n\n","date":"July 3, 2012 at 7:01 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13379","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"11/ writers (e.g., MARTIALIS Martial) used the Greek word sindon in Latin (sindon, is) as early as the 1st century CE in accounts of very fine linen, silk and sea Byssus veil. In 4th century CE Latin (e.g., Vulgata), the same word comes to also refer to the burial of Rabbi Yeshua of the synoptic gospels (Matthew, Mark and Luke). The (deliberate?) confusion between Mandylion (very fine Byssus veil) and Sindon (Yeshua’s burial cloth) would then find here its (philo)logical explanation.\n(TO BE CONTINUED)\n\n","date":"July 3, 2012 at 12:02 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13393","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"12/ In The Book of the Thousand Nights and a Night, the Edessa city palladium is referred to as the “Mandil” (head kerchief/face-veil/mantle/garment) [of Divine] Mercy [for the Salvation of Acting]; “Mandil” [of Divine] Safety.\n\n","date":"July 3, 2012 at 5:35 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13414","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"(TO BE CONTINUED)\n\n","date":"July 3, 2012 at 5:44 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13415","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"13/ Arabic منديل mandiil — tablecloth, handkerchief, mantle, from Late Latin mantellum ≠ early Latin mantile, mantele. Byzantine Greek mandylion, Old French mandil; see also Spanish and Portuguese mandil — all from Arabic mandiil, turban-cloth, haircloth, face-veil, towel, coase apron.\n\n","date":"July 3, 2012 at 5:58 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13416","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"More still to follow…\n\n","date":"July 3, 2012 at 6:05 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13417","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"13/ The Hymn of the Pearl is the earliest known testimony of the Edessan Christianity (possibly dating from as early as the first but no later that the 3rd century C.E.). It deals with the essence of divinity residing in G.od’s clothing – a heavenly double of the mortal human skin. Any bona fide archaeocryptologist can read in the Syrian poem a most accurate description of the Turin Sindon.\n1st reading key to The Hymn of the Pearl: \nAn oyster forms PEARLs by SECRETting a mineral substance called nacre and uses it to to COAT (or quarantine LAYER upon layer until the IRIDESCENT gem is formed) an intruder (or irritant), such as a grain of sand or bit of floating food slipped in between one of the two shells of the oyster and the protective layer that covers the mollusk’s organs, called THE MANTLE (Syriac mandiil, Arabic mindiil). \n(TO BE CONTINUED)\n\n","date":"July 4, 2012 at 9:42 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13452","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"+typo error: “Syriac mindiil, Arabic mandiil”\n\n","date":"July 4, 2012 at 9:48 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13455","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Typo error: 14/\n\n","date":"July 4, 2012 at 9:43 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13453","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Typo error: “the MANTLE”\n\n","date":"July 4, 2012 at 9:47 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13454","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Yannick: \nA correction: When quoting Flusin I did not mean the shroud, but the Mandylion. The context explains it. If not, I say now.\nEastern Byzantine art largely disappeared with the iconoclasm. Italian Byzantine art comes from the Byzantine occupation. It is as Byzantine as Eastern. Example: Ravenna. There is no aversion for Jesus naked in Ravenna.\nIf you see all or almost all medieval representations of Christ in the tomb depict him naked under the shroud. Mesarites could have in head the same thing. He need not have seen any representation of naked Jesus in a shroud.\n\n","date":"July 5, 2012 at 3:30 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13485","author":"David Mo","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Like I said, to really judge properly the comment of Mesarites regarding the nudity, I think you have to put it beside the testimony of de Clari and also to put it beside the Pray Codex.  I think these 3 particular documents build a very good case in favor of the presence of the Shroud of Turin in Constantinople from at least the second part of the 12th century until 1204…  Of course, we’re dealing with probabilities here and surely not certainties, but I think if we use properly the Occam’s rasor principle, we will ended up saying that the most rational hypothesis concerning these 3 documents is the one stating that the Shroud of Turin was the basis for all 3 documents (even if the artist of the Pray Codex artworks could have been someone who did not see the Shroud with his own eyes).  Honestly, I really think that the conjuncture of these 3 documents lead to the conclusion that the Shroud of Turin was MOST PROBABLY (this is not a certainty) in Constantinople from the second part of the 12th century at least until 1204.\n\n","date":"July 8, 2012 at 6:38 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13617","author":"Yannick Clément","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Yannick: \nOccam’s razor is usually interpreted as recommending accept between two hypothesis that one than uses fewer assumptions and explains the same. To identify the three images you need to make a centenary of assumptions: about how was the image of Clari, what Mesarites thought, what are the holes in the Codex Pray, why are the wounds in the palms, on what the angel is sitting, and so on. The hypothesis that there are three different images makes no assumptions and explains the same: the presence in different places and times of three different images. According to Occam’s razor, is more likely.\n\n","date":"July 9, 2012 at 2:17 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13629","author":"David Mo","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"2nd reading key (to the famous passage in the Hymn of the Pearl)\nThomas’ full name is Thaddai/Addai (= Aramaic/Syriac short for Hebrew Yehudah/Jude, ‘Praised’) Toma (Aramaic/Syriac, ‘TWIN’, for Thomas).\nThe vision of his soul is not so mch a double/TWIN IMAGE of himself as his TWIN In Imitatio Chrsiti as he is said to be the TWIN brother of Jesus of Nazareth, Heb. Yeshua Ha-Notsry, litterally the HIDDEN/ Troglodyte [Prince of] [Divine/Providential] SALVATION/SAFETY’\nNow, literally speaking, the cloth of Edessa is ‘the Mandiil of [Divine/Providentail] SAFETY/SALVATION’, in other words ‘the Mandil of Yeshua/Jesus. This is totally consistent with the Arabic name ‘Al-Mandiil ʿĪsā’ given to the Edessa city’s [atropaic/Gorgone-like] Palladium (see The Thousand and a Night’).\nAs ‘Al-Mandiil Er-RaHm’a, ‘The Mandiil of Mercy’,  it shall be read in the light of Psalms 6:3 … Have MERCY on me, O Lord, for I am wasted away: make me well, for even my bones are troubled.\n\n","date":"July 6, 2012 at 9:04 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13528","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Typo errors:\n– ‘the Mandil of Yeshua/Īsā/Jesus\n– This is totally consistent with the Arabic name ‘Al-Mandiil Es-Salama”\n\n","date":"July 6, 2012 at 11:44 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13533","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"+ Typo error: ‘Al-Mandiil Er-RaHma’\n\n","date":"July 6, 2012 at 11:46 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13534","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Now, in the 12th century Madrid Skylitzes (Byzantine manuscript owned by the Biblioteca Nacional in Madrid), the TWIN THEME resurfaced in conjunction with the arrival/translation of the Holy Mandylon in Constantinople. This is the earliest known documented case of conjoined twins (942 CE). \nThe caption reads:\n“In the time of Romanos Lekapenos a pair of Siamese twin boys were brought to Constantinople from Armenia and they ‘stayed in the city for a long time and everybody went to see them as if they were some kind of curious monster; and then they were expelled from the city because they were thought to be an evil omen.”\nIs it a mere coincidence or is it cryptically deliberate?\n\n","date":"July 6, 2012 at 11:12 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13530","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Typo error: arrival/translation…TO Constantinople.\n\n","date":"July 6, 2012 at 11:49 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13535","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"First one HEAD then two DOUBLE BODIES…\n\n","date":"July 6, 2012 at 11:17 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13531","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"(TO BE CONTINUED on the TWIN THEME in conjunction with the Edessa cloth/Mandylion/Turin/Sindon)\n\n","date":"July 6, 2012 at 11:53 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13536","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"If we are to rely to the two most intriguing testimonies about the bearded “idole” of the Saviour that the Knight Templars worshipped:\nFIRST, it is cryptically said to have two heads and four legs (much alike to a SIAMESE TWIN). Couldn’t it be a cryptic reference to the Sindon Image taken out from his gilt silver trellised long-squared Edessan/ Constantinopolitan reliquary-wooden table and seen unfolded? \nThe head is ALSO cryptically said to be in figuram baffometi (i.e. « in the likeness/semblance of a baphomet). Now what happen if we try visualise the head as a monstrance i.e. within a relic kept in the Edessan/Constantinopolitan reliquary-table so that the sole head appeared through the crystal rock of a vastoculus (central opening in front side), in conjunction with the neologism « baphomet ?\nA phrase in Hebrew  surfaces : ba-pheo-Emet, literally ‘in his mouth [is] the Truth’, the Hebrew equivalent to the Italian nella Bocca della Verità… \nNow we just have to take a look at the Bocca della Verità in Rome and imagine the Sindon Face embedded in its Edessan/Constantinopolitan monstrance to get a very accurate idea of what the Templars really meant by  a head ”en semblance de baphomet’…a head in the likeness of the Mouth of Truth, in reference to The Holy Sindon/Mandylion once kept in Edessa and Constantinople…\n\n","date":"July 6, 2012 at 1:09 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13539","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Mistyping: (much alike SIAMESE TWINS)\n\n","date":"July 6, 2012 at 1:11 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13541","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Typo errors:\n“If we are to rely ON the two most intriguing testimonies”\n“FIRST, it is cryptically said to have A HEAD and four legs”\n“in figuram baffometi” …”If we try TO visualise” …”the sole head appearS…”\n“a vast oculus”…”to the Italian phrase ” è la Bocca della Verità””\n\n","date":"July 6, 2012 at 5:00 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13549","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"(STILL TO BE CONTINUED)\n\n","date":"July 6, 2012 at 1:10 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13540","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Here are my replies (in stages)\nFACT 1 / FACT 2\nThroughout most of history Jesus has been shown in art as risen and glorious after his death. Before his death, after the descent from the cross, he is also usually shown with minimal wounds. Certainly most art will usually show him – at worst – with wounds in the palms, and feet, the side wound, and sometimes blood on the head. It is very rare for more widespread body wounds, including flagrum marks, to be shown.\nActually, I disagree with Yannick’s comment that Christ’s body-wide wounds began to be shown in the early 1200s after the crusades. Actually, the only time in history where Jesus’s widespread body wounds were depicted clearly in graphic detail was a period in the mid to late 1400s in German art.\nThe fact that earlier art eg. Byzantine art – didn’t show wounds on Jesus’s body does not prove that the Shroud did not exist in this earlier period. Simply, in theological terms, Christ was God, and his humanity including physical suffering was minimised. Remember, the Bible mentions the flogging Jesus received, his body wide scourging. Anyone who read the Bible from ancient times knew that Jesus’s body would have been severely wounded. Yet he was not represented this way in art.\nThe FACT that Jesus’s comprehensive body-wide wounds have not usually been shown in the history of art – apart from a period around the mid to late 1400s in German art – is a very strong point supporting the Shroud’s authenticity.\nIndeed, from an art history perspective if any time in history made sense for the Shroud’s creation it would be in the mid to late 1400s. But we know that the latest that the Shroud could have been created by a GENIUS would have been the mid 1300s.\nThe fact that depictions of the Mandylion show Jesus with open eyes is almost irrelevant. These depictions were not copies, they were art. In addition, an alternative explanation is that actually the image on the Shroud is very faint when viewed in the flesh ie. without our modern day photographic enhancements. It wouldn’t necessarily have been clear that Jesus’s eyes were closed to people viewing the Shroud in ancient times\n\n","date":"July 7, 2012 at 5:00 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13563","author":"Matt","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Re: the German art in the mid to late 1400s showing Jesus’s body wide wounds, refer this information that I posted on Stephen Jones’s website:\nExamples from the late 1400’s of art that shows body-wide cuts, marks and blood can be found at these websites:\nhttp://www.bridgemanart.com/asset/229986/German-School-15th-century/Ms-351455-fol.148v-The-Entombment-from-%27The-Life?lang=en-US\nhttp://en.wikipedia.org/wiki/Matthias_Gr%C3%BCnewald\nhttp://en.wikipedia.org/wiki/Andachtsbilder\nAll are German art, so there must have been a movement in Germany around the late 1400s to early 1500s to show Jesus’s body in a much more tortured and injured manner.\nFrom Wikipedia:\n“In the Late Middle Ages, increasingly intense and realistic representations of suffering were shown,[22] reflecting the development of highly emotional andachtsbilder subjects and devotional trends such as German mysticism; some, like the Throne of Mercy, Man of Sorrows and Pietà, related to the Crucifixion”\n(From: http://en.wikipedia.org/wiki/Crucifixion_in_the_arts#Through_history)\n\n","date":"July 7, 2012 at 5:04 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13564","author":"Matt","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Matt you wrote: \n“Remember, the Bible mentions the flogging Jesus received, his body wide scourging. (…) Yet he was not represented this way in art.\nThe FACT that Jesus’s comprehensive body-wide wounds have not usually been shown in the history of art – apart from a period around the mid to late 1400s in German art – is a very strong point supporting the Shroud’s authenticity.”\nThe TRUE fact is there are quite a few depictions of Yeshua being flogged (front & back) prior to the mid to late 1400s (between 1245 and 1350  CE)….\n\n","date":"July 7, 2012 at 8:06 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13577","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"if you see the 1516 copy of  the Shroud you will see that the copyist showed Jesus with open eyes supporting my earlier point:\nhttp://www.shroudofturin4journalists.com/Details/copy1.htm\n\n","date":"July 7, 2012 at 5:06 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13565","author":"Matt","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Very good point Matt.\n\n","date":"July 7, 2012 at 5:36 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13568","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Matt, you wrote: “These depictions (of the Mandylion showing Jesus with open eyes) were not copies, they were art.”\nAs far as the Veil of Manoppello aka the pre-1618 CE Sancto Vultus Sudari Veronicae of Rome aka the Holy Face of the Holy Mandylion is concerned, it is more than a mere copy.\nThe ingenuous artist used a true relic namely Yeshua’s burial byssus face veil that was wrapped on top of the Sindon at head level. The artist used very faint marks left by Yeshua’s death mask as guide lines/a template to “recontruct” his face with open eyes and mouth much after the Bocca della Verità in Rome or the Gorgone i.e. much in an atropaic head style.\n\n","date":"July 7, 2012 at 6:00 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13571","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Typoe errors: “Sanctus Vultus Sudario Veronicae”\n\n","date":"July 7, 2012 at 6:32 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13573","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"I would recommend anyone who lives in a city with a good university to track down this book:\n“Iconography of Christian Art” by G. Schiller\nThe book, in two volumes, has hundreds of plates showing Jesus’s depiction in art through history up to about the 1500s / 1600s, in chronological order. It very clearly demonstrates that Jesus was almost never shown with body wide wounds including scourging other than the period in the 1400s in German art\n\n","date":"July 7, 2012 at 5:15 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13567","author":"Matt","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Yannick says there is a lack of evidence indicating the Mandylion was in Edessa before the mid 500s\nActually, the story of St Alexius shows that he was in Edessa in the early 400s, and he saw an icon that spoke to him.\nWhilst not conclusive, I consider this is the Mandylion / shroud:\nhttp://www.courseportfolio.org/peer/potfolioFiles/anonF/shopkow-l-2003-1/alexis.htm\n Refer to paragraph 18 which mentions that the saint went to Edessa “to see an icon that he had heard tell of”, and later on the icon calls for the Saint’s servant to call for St Alexius\n“Linda Cooper `The Old French Life of Saint Alexis and the Shroud of Turin’, Modern Philology [a journal devoted to research in medieval and modern literature], University of Chicago Press, August 1966, pp.1-17. The eleventh century Old French Life of Saint Alexis, generally recognized as the first masterpiece of French literature, contains the passage: Then he [Alexis] went off to the city of Edessa Because of an image he had heard tell of, Which the angels made at God’s commandment… As Linda Cooper shows in this highly scholarly paper, the `image’ referred to is none other than the Image of Edessa, and when the various versions of St. Alexis’s life are studied, it makes a great deal of sense that this was one and the same as the Shroud. She cites, for instance, the Bollandist Vita Alexius which calls it `sine humano opere imago Domini nostri Jesu Christi in sindone’ , i.e. `an image of our Lord Jesus Christ made without human work on a sindone’; also the Latin Cod. Monac. Aug. S.Ulr. 111 … `[he came] to the city of Edessa, in which there was preserved a blood-stained image of the Lord not made by hands’. Both passages clearly refute arguments that the Image of Edessa was incompatible with the cloth we know today as the Turin Shroud.” (BSTS Newsletter, No. 16, May 1987, p.14).\nSt. Alexius (or Alexis) lived in Edessa between 412 and 435:\n“Saint Alexius or Alexis of Rome or Alexis von Edessa was an Eastern saint whose veneration was later transplanted to Rome, a process facilitated by the fact that, according to the earlier Syriac legend that a “Man of God” of Edessa, Mesopotamia who during the episcopate of Bishop Rabbula (412-435) lived by begging and shared the alms he received with other poor people was, after his death there, found to be a native of Rome.” (“Alexius of Rome,” Wikipedia, n 24 March 2012).\n\n","date":"July 7, 2012 at 5:38 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13569","author":"Matt","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"I myself was about to refer (a little later) to the Sanctus Alexius connection.  \nit must be reminded though that the LATIN sindon can refer to both Yeshua’s burial cloth and his Byssus face veil (bearing the atropaic in-rusted image of his face with open eyes and mouth).\n\n","date":"July 7, 2012 at 6:13 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13572","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Mystyping:: (bearing the atropaic in-rusted RECONSTRUCTED image of his face with open eyes and mouth).\n\n","date":"July 7, 2012 at 1:57 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13587","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Before 550, all we have is some documents (not a great number) that speaks of a painted PORTRAIT of Christ in Edessa.  It is not evident to judge if this is an historical fact but it is well possible that the Image of Edessa was a painted portrait of the living Christ (as reported in the Doctrine of Addai for example) and, during the last part of the 6th century, for an unknown reason, this painted image of Christ was considered miraculous instead.  From the historical sources we have, this is the most simple explanation (if we don’t use any kind of special assumptions) concerning the Image of Edessa (Mandylion).  From all the known sources we have, that’s the most rational conclusion regarding this relic of Christ (who was maybe not even considered as a real Christian relic until the second part of the 6th century)…\nAnd concerning the late source (11th century) you quote, you have to remember that, at that time, the Mandylion was truly considered as a miraculous relic of Christ.  This story, even if it refers to early 400s cannot be taken as an historical proof (or just even a clue !) that the Image of Edessa was publicly known at that time and was already considered as a miraculous image !  That’s not how you do good history…  You always have to consider the period of time when this manuscript was written.  Normally, it will tells you more, historically speaking, than the period of time refers byt the writer !\n\n","date":"July 8, 2012 at 6:49 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13618","author":"Yannick Clément","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"I don’t have time to reply in detail to Yannick’s piece, but thank you Yannick for an excellent piece, it’s a great resource\n\n","date":"July 7, 2012 at 5:40 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13570","author":"Matt","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Yannick\nYou said:\n“The first 2 known epitaphios artworks are dated around 705 and were located in a chapel build by pope John VII in the Vatican. These artworks show a depiction of the body of Christ being deposit in his Shroud and there are many details that agreed with the Shroud and his body image. Among which there is the fact that we don’t see the thumbs, while we can see 4 long fingers on each hands. Also, the hands are crossed over the pubis, just like we see on the Shroud.”\nI have never heard of this. Can you provide further information, including links to images if possible?\nMatt\n\n","date":"July 7, 2012 at 7:45 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13576","author":"Matt","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"In the 2000s, I wrote in a still unpublished paper untitled Archéo(crypto) logie du terme “baphomet”:\n                 “D’étymologie hébraïque, le mot baphomet est la romanisation de ba phéo émèt, littéralement “dans sa bouche [c’est la] vérité”, autrement dit “la vérité sort de sa bouche” ou bien encore “dans sa bouche nul mensonge”. Il n’est donc autre que le quasi calque sémantique de l’italien è la Bocca de la Vérità, littéralement “[c’]est la Bouche de la Vérité”, expression applicable, au Moyen Âge, à un témoin digne de foi et véridique.\n                 Or dans tout le Nouveau testament, et plus précisément dans l’Apocalypse, seul le Christ, “revêtu d’un vêtement [de lin] trempé dans le sang [de sa mort sacrificielle sur le bois de la croix]” est désigné comme “témoin fidèle et véridique” (Apo. 19, 12). Ainsi ce mot, jusque-là non élucidé, peut-il renvoyer à la fois au Christ et à son Linceul.\n                  Quant à la Bocca della Verità, “La Bouche de la Vérité”, elle fait référence à ce médaillon de marbre de Phrygie (l’actuelle Turquie), de grand diamètre (175 centimètres), orné du masque érodé par le temps et d’aspect relativement terrifiant du Titan Océan, le père des fleuves qui y apparaît sous les traits d’un homme barbu, chevelu et cornu la bouche, les narines et les yeux évidés et creux.\n                 Dans la mythologie grecque cette divinité est à l’origine de la Vie*. Sis au cœur de l’ancienne colonie greco-byzantine du forum Boarium où était le premier port fluvial de la Rome antique  (see Legend of Sanctus Alexius) et  daté aux environs du IIe siècle avant J.C., il se trouve encastré, depuis 1632, dans la paroi du pronaos (ou portique d’entrée) de l’église de Sainte Marie en Cosmédine.\n                Comment justifier de la présence murée et bien visible d’un telle idole païenne à gauche de la porte de cette église du Haut Moyen-Âge où, aujourd’hui encore, on officie selon le rite byzantin? Ne faudrait-il pas y avoir, outre une évocation de la grande meule de pierre circulaire qui fermait la bouche de la grotte-tombeau du Christ sur le mont Golgotha, un rappel de sa Sainte Face empreinte sur le Saint Mandylion de Constantinople ?\n                Si l’on juxtapose une représentation byzantine du Saint Mandylion,  le  Visage de l’Homme du Linceul de Turin et le masque de pierre du dieu Océan de Rome, on obtient, tant la ressemblance entre ces trois têtes d’hommes barbues et chevelues est frappante, une sorte de preuve par trois validant l’identification de cette mystérieuse Tête d’homme barbue qui chez les templiers, faisait l’objet, d’une adoration secrète.”\n\n","date":"July 7, 2012 at 9:29 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13580","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"In a more recent draft (2004), I wrote:\nLa Bouche de la Vérité (ou Bocca della Verità  en italien) est un  masque de marbre rose de Phrygie érodé par le temps qui se trouve dans la zone du forum Boarium où était le premier port fluvial de la Rome antique (à proximité, on peut encore voir le temple de Portunus, la déité tutélaire du port). Les yeux, les narines et la bouche sont évidées et creuses, le tout inscrit dans un médaillon de grand diamètre (175 centimètres) et d’aspect relativement terrifiant. Son nom de « Bouche de la Vérité » provient d’une croyance populaire qui remonte au moins jusqu’au Moyen Âge : celle qu’à travers la bouche, le diable pouvait happer la main du parjure et la retenir pour la mordre violemment. Datée aux environs du IIe siècle avant J.C., la sculpture représente, de fait, le Titan Océan, le dieu des cours d’eaux à l’origine de la vie. Il y apparaît sous les traits d’un homme barbu et chevelu. En guise de couronne, deux dauphins sautent du sommet de sa tête. Au sein des boucles de ses cheveux ondulés, près de sa tempe gauche, plonge un poisson. Deux autres dauphins émergent à mi-corps de sa barbe/Une testicule pend de chaque côté dans la partie inférieure de sa barbe. À l’origine, ce masque de pierre devait très probablement faire office de couvercle au collecteur d’eaux pluviales d’un temple appelé Jupiter Jurarius où l’on avait jadis coutume de prêter serment et situé sur l’île Tibérine. Il fut encastré, en 1632, dans la paroi de l’entrée (ou pronaos) de l’église de Sainte Marie en Cosmédine ; église du Haut Moyen-Âge au cœur d’une ancienne colonie grecque de Rome où, encore aujourd’hui, on officie selon le rite byzantin.\n\n","date":"July 7, 2012 at 11:04 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13584","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"I think Yannick is the victim of a much-repeated received idea (from F. Bonnet-Eymard?).\nThe Umbella “epitaphios” of the old side chapel built by pope John VII in St Peter’s of the Vatican dated back not to 705 CE but the late 12th century CE. Too bad, I have no time to check it out. to-day\n\n","date":"July 7, 2012 at 9:39 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13582","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Actually the idea came first from Müntz and was relayed by… Maurus Green (one of Yannick’s gurus)….\n\n","date":"July 7, 2012 at 3:01 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13588","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Correction: The altar of St Veronica was buit very early in the “13th century CE” e.i. a very short time the Holy Mandylion disappeared from Constantinople…\n\n","date":"July 7, 2012 at 5:06 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13589","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Correction: The altar of St Veronica was built very early in the “13th century CE” e.i. a very short time after the Holy Mandylion disappeared from Constantinople…\n\n","date":"July 7, 2012 at 5:08 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13590","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Read the paper of Maurus Green.  He talk specifically about this issue.  You can find the link to read for free this good paper from Green at the end of my own paper…\n\n","date":"July 8, 2012 at 5:02 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13614","author":"Yannick Clément","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Note :  this comment from me goes for the question Matt asked me in comment #66…\n\n","date":"July 8, 2012 at 5:03 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13615","author":"Yannick Clément","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"My answer to Matt comment #69 :  I recommand you to read the very good paper of Maurus Green in which he talk in details about that.  Here’s the link to Green’s paper : http://www.monlib.org.uk/papers/aj/aj1969green.htm\nYou’ll see that there was 2 epitaphios (the first 2 known epitaphios in history) in that chapel but they were both lost when the St Peter’s Basilica was rebuilt between 1506 and 1626…  Too bad these artworks were lost !  But, at least, there was a man named Grimaldi who made sketches of these artworks before the chapel was destoyed during the renovation of St Peter’s Basilica…  That’s why we know what they looked like.  I’ve just found one sketches of the umbella of John VII (one of the 2 epitaphios) in my research and you can see it here : http://www.crc-resurrection.org/878-histoire-du-saint-suaire.html\n\n","date":"July 9, 2012 at 9:55 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13674","author":"Yannick Clément","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Yannick, have you considered all the illustrations of the Shroud in Edessa (present day Sanliurfa) both Ian Wilson & Mark Guscin recorded as seen in Wilson’s “The Shroud” from 2010?\n\n","date":"July 7, 2012 at 6:04 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13594","author":"Andy Weiss","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"I prefer to consider the 22 FACTS I gave you in my paper…  And I’m sorry but there is absolutely no illustration of a burial Shroud showing Christ with blood and bruises that would have been kept in Edessa prior to 944 when the Mandylion was transferred to Constantinople…  If such an image would exist, no doubt that the question of whether or not the Shroud of Turin was present in the Middle East prior to his first public exhibition in Lirey, France, would be already settled and we could answer a big “yes” without any doubt !!!  It’s interesting to note how people around here used the term “Shroud” as a synonymous of “Mandylion”.  The reality is this :  it’s not at all the same thing and so, even if there are some ancient text that describe the Image of Edessa as a “sindon” (see fact #8 in my paper) !\n\n","date":"July 8, 2012 at 6:59 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13621","author":"Yannick Clément","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Sorry Yannick, but at closer examination, at least half of your 22 alleged facts are not TRUE (or SCIENTIFIC/ARCHAEOLOGICAL/PHILOLOGICAL/ICONGRAPHIC/HISTORICAL) facts…..\nJust a couple of examples to back up my point:\n1/ “John VII” alleged Umbella does not date back to 705-709 CE. It is very late 12th/very early 13th century CE. Grimaldi’s 17th testimony SHALL/JUST CANNOT be taken at face value (as Müntz, Green & Bonnet-Eymard most uncritically did).\n2/ On the Pray Ms iconographic sindon (page III, ink drawings 3 & 4), you’ll see not only a mark above Jesus’ right eye corresponding to the reversed `3′ bloodstain on the Turin Sindon but more blood-stains namely those of the left-right side wound much schetchically drawn in conjunction with that of the letf-right forearm).  Still in conjunction with the iconographic sindon (Unction scene), you’ll notice a tiny ‘spy clue’: at first sight, it may look as Joseph of Arimathy ‘s right-left foot or shoe; actually, it is a trellis patterned ray as if emanating from the butial sheet in reference to its trellised Parthian reliquary-table.\nEtc etc etc\n\n","date":"July 9, 2012 at 3:21 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13632","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Most obviously and as far as the pray Ms iconographic Sindon is concerned, the pen & ink drwings are not the work of  a Byzantine artist. That’s the exception that proves the rule. This is the work of a Latin (French?) Benedictine artist monk. Did the latter accompagnied future Hungarian king Bela III? This just cannot be totally excluded.\n\n","date":"July 9, 2012 at 9:41 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13646","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"The umbella of John VII have been dated of his Papacy between 705 and 707.  In the article of Maurus Green, it is clearly state that the 2 epitaphios that were in this chapel dated from 705.  If you got another sources that tell a different date, I don’t know what can I say to you.  Even in one number of the BSTS newsletter, this date was accepted.  Look here : http://www.shroud.com/bsts4609.htm\n\n","date":"July 9, 2012 at 9:36 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13672","author":"Yannick Clément","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"By the way Max, I think you read again my paper because, concerning your point #2, I just want to inform you that I don’t even mention the Pray Codex in my list of 22 facts !  I agree with you that the Pray Codex was most probably based (in my mind, indirectly) on the Shroud of Turin but that has nothing to do with Wilson’s hypothesis about the Mandylion…\n\n","date":"July 9, 2012 at 9:40 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13673","author":"Yannick Clément","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Maurus Green blindly  relied too much on Müntz who blindly relied too much on Grimaldi’s 17th century CE testimony. They UNCRITICALLY accepted the Umbella as pope John VII’s (705-707 CE) when ACTUALLY it was the Umbella of pope John VII’s SIDE CHAPEL in saint Peter of the Vatican. Cannot you read me? How shall I put it for you to understand?\n\n","date":"July 10, 2012 at 3:46 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13699","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Yannick,\n  BTW, what do you make of this very basic philological FACT (the Abgar legend HIMATION = ACHITON = SINDON, a long rectangular cloth more than 4m long x 1m wide with a face imprint on it? How you, Green, Belting, Cameron Aslanovki etc etc etc can have missed such a FACTUAL spy-clue? Ths is just beyond me!\n\n","date":"July 9, 2012 at 3:40 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13634","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Max, I’m sure you know that the word “sindon” in ancient greek can mean a lot of thing depending of the litterary context !  Nowhere in ancient sources you can find this term “sindon” associated with the Passion of the Christ or in the context of the death and burial of Christ (a term, by the way, that disappeared after the cloth was transferred to Constantinople).  In every versions of the Abgar legend, the miraculous image is formed BEFORE good friday…\n\n","date":"July 9, 2012 at 9:15 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13669","author":"Yannick Clément","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Yannick,\nThe word HIMATION used in the VIth century CE Abgar Legend DOES refer to a LONG RECTANGULAR CLOTH more than 4m long x 1m wide. \nWhether you like it or not THIS IS A PHILOLOGICAL ARCHAEOLOGICAL FACT as far as an HIMATION is concerned! \nAccording to the legend, Yehua’s face imprint is said to be on an HIMATION (a LONG RECTANGULAR CLOTH more than 4m long x 1m wide). \nCannot you read? How shall I put it?\n\n","date":"July 10, 2012 at 3:21 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13695","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"…and a teradiplon sindon (sindon = spring/summer night/evening wear=achiton or himation spring/summer wear or workwear), a (long rectangular) cloth folded in four/folded four times onto itself….that is reduced to the size of a towel/veil = a mandylion….\n\n","date":"July 10, 2012 at 3:27 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13696","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"“sindon tetradiplon” is an expression used in the manuscript of the Acts of Thaddeus in a context where Jesus ministry still going on before his Passion and while he was alive and well !   And it is specifically written that he washed only his face when the miraculous image was formed !  All this is completely out of context versus the idea that this cloth would have been a burial shroud of more than 4 meters !  In fact, this is one of very best example of Wilson’s propention to use extrapolations and speculations to the max in order to make believe in his preconceived ideas…  Sorry but that’s not the way good historical researches and hypotheses are done.\n\n","date":"July 11, 2012 at 7:32 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13756","author":"Yannick Clément","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"If we are to rely on the Gregory Sermon (944 CE), the imaged cloth of Edessa had a blood-stain from the wound inflicted on Rabbi Yeshua’s’ side, and therefore contained an entire body not just a facial image. As Mark Guscin put it : « No amount of contrived pseudo-translations or explanations can get away from this simple [linguistic] FACT ». \n  One must reminded here that in Edessa, in addition to the prototype in the hands of the Nestorians, there were 2 face-only copies of the relic : one in the hands of the Melkites (a copy of copy) ; the other in the hands of the Monophysites (Syriac orthodoxes). That of the Monophysites was a very ingenuous false-true copy made from Rabbi Yeshua’s very fine Byssus genuine burial face-veil/kerchief (Byzantine Greek Mandylion now known as the Veil of Manoppello). \nAs « public Mandylion » featuring a living Yeshua, the ingenuous copy was a more handable and presentable (less trerrifying) Holy Face than Rabbi Yeshua’s blood-stained death mask and tortured body recorded full length on the inner side of his burial linen cloth (Greek sindon). The latter was folded in four/onto itself four times as « secret Mandylion » and kept within a Parthian style trellised gold gilt reliquary-table.\n\n","date":"July 10, 2012 at 3:31 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13698","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Yeshua’s burial very fine transparent face-veil/kerchief (now kept in Manoppello) was placed on top of the sindon (now kept in Turin) at face level and fastened with a burial head-dress (now kept in Cahors) to conteract rigor mortis (making of a “jaw-box’ with three wooden pieces cut/sawn off the titulus damnationis?). (My reconstruction)\n\n","date":"July 10, 2012 at 4:20 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13703","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Abramos knew the imaged cloth of Edessa was more than just a portrait. That’s the very reason why he was able to dicriminate between the prototypic face image and its copies.\n\n","date":"July 10, 2012 at 4:33 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13704","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Iconographically speaking, this DOES show until today:\n– in the very FACT that the Holy Face of the Holy Mandylion is depicted BOTH in landscape (long square/secret Mandylion) and portait (square or almost square/public Mandylion) configurations. \nPhilologically speaking, this DOES show until today:\n– in the very FACT e.g. that  both in French and in English  the two words ‘suaire’/’shroud’ (originally a face-cloth) and ‘linceul’/’burial sheet’ (a whole body cloth) are still indifferently used to speak of the famous relic.\nArcheaologically speaking, this DOES show until today: \n– in the very FACT of the vast nimbus-like discoloration all around the Sindon face (implying it was shown in a monstrance with  a central circular opening.\n\n","date":"July 10, 2012 at 4:04 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13700","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Correction: (implying it used to be shown in a monstrance with a vast central circular opening on a reliquary front side).\n\n","date":"July 10, 2012 at 4:50 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13706","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Please help as I am confused.An ordinary handkerchief that one takes out of a drawer is folded four times so tetradiplon cloth does not have to be large.\nIn the only reference to tetradiplon I can find (the Acts of Thaddeus) tetradiplon describes the cloth BEFORE Christ wipes his face with it so it can’t be the Turin Shroud. The Acts also say that the burial shrouds,not the same cloth, remained in the tomb. So perhaps there are some documents I have missed . Yannick and Matt please help as this tetradiplon argumnt is seen to be so important.\n\n","date":"July 10, 2012 at 4:45 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13705","author":"LyFe","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Legend shall not be taken  at 100% face value. However it can still contain a few accurate and more less hidden information. \nThe word tetradiplon is used in conjunction with a SINDON not a mandylion. To get an idea of the difference in the fold marks on the “public” Holy Face of the Holy Mandylion as veil/kerchief of the living/resurrected Yeshua (with open eyes and mouth) and the secret Holy Face & Body Holy Mandylion aka SINDON (with its death mask) see: \n– The Veronica depicted (with transverse fold marks) by a Flemish master. \n– Jackson’s study of the Turin Sindon folds and wrinkles (although I don’t 100% agree with Jackson reconstruction as they are so many ways to fold a long rectangular cloth in four or four times onto tself to have the face imprint show in front).\n\n","date":"July 10, 2012 at 5:05 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13707","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Jackson’s hypothesis concerning the folds is purely speculative for numerous reasons (the first one being the FACT that nobody can date a fold mark !!!).  And because of this particular and, excuse me, completely ludicrous and non-scientific hypothesis, Jackson’s bias regarding Wilson’s hypothesis is as obvious as the nose in anyone’s face…  \nMax, I recommend you to read again carefully the fact #22 in my article.  This is TRUE AND CORRECT SCIENCE, not science-fiction based solely on speculations.  And what this TRUE AND CORRECT SCIENCE tell us ?  That there are absolutely no signs of any kind of physical and chemical differences between the region of the face and the rest of the cloth, not only at thread level, but even at fiber level !!!  On this subject, let me remind you that the Spanish team of Sindonology have been able (very easily) to prove what was the side of the Sudarium that was always exposed to the faithful (probably for century) just by the amount of dirt and dust that was more present on this particular in comparison with the other side that was hidden to the eyes of the public (and consequently protected from air and sunlight).  Why would it be different in the case the Mandylion hypothesis was correct ???  Come on !!! \nBy the way, this particular hypothesis of Jackson concerning the folds remind me of another ludicrous hypothesis proposed by himself regarding the bloodstains on the Shroud !!!  Effectively, in one paper he published in Shroud Spectrum in the 80s, Jackson was pretending that there was not only real bloodstains on the cloth but also “images” of bloodstains !!!  Wow !  No doubt that we are right into the Twilling Zone here… :-)  And I’m not even talking about his other hypothesis concerning the Shroud that was, in fact, the tablecloth for the Last Supper !!!  Totally incredible…  It’s the right word I guess.\n\n","date":"July 11, 2012 at 7:27 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13754","author":"Yannick Clément","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Yannick you are just making extrapolations (absence of proof is not prood of absence). I stick to TRUE facts. This is the main difference between you and me.\n\n","date":"July 12, 2012 at 8:51 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13772","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"You understand perfectly the fact that the expression “sindon tetradiplon” that we found only in the Acts of Thaddeus and that can be translate as “a cloth folded 4 times” has nothing to do, in the context of this manuscript, with a burial shroud of more than 4 meters !  Your interpretation is correct.  This is pure speculation on the part of Wilson and his fans to see a direct description of the Shroud of Turin that would have been folded here…  I recommand you to read carefully the Fact #18 in my article.  You’ll see that this word “sindon” was almost completely forgotten by all the Byzantine authors after the Mandylion came to Constantinople in 944 !!!  This FACT speak very loud to me !  If the Byzantine would have seen the Shroud’s face inside the frame of the Mandylion, do you think for one second that they would not have kept the word “sindon” to describe the relic, while putting this expression in a “burial” context ?  Because of the numerous bloodstains in the region of the face that are an evident sign of the crown of thorns, I really think so !  But the reality is completely different…\n\n","date":"July 11, 2012 at 7:12 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13753","author":"Yannick Clément","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Yannick, Yannick\nHOW LONG can you think that absence of proof is proof of absence?\nHOW do you account for the specific use of the Greek word tetradiplon in conjunction with  the word sindon? \nWhat do you make of the use of the word HIMATION (implying a long rectangular cloth more than 4m long x 1m wide) used to describe the cloth that received the facial imprint? \nEtc etc etc.\nYour selfserving omissions & ignorance to hammer your opinion is NOT SCIENCE AT ALL!\nYou can be wrong in your opinion, you cannot be wrong in your facts. \nThe light discoloration all around the Sindon face is a VISUAL FACT (you can detect it not only on enhanced orthochromatic, traditional siver & extensive digital Sindon\noverall photographs but also in situ by placing yourself at a distance between 15 to 30m from the relic).\nYou are JUST IN DENIAL…. Are you not man enough to face TRUE facts contrary to your own belief as far as the Sindon is concerned?\n\n","date":"July 12, 2012 at 9:14 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13773","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"There ARE visual and textual pieces of evidence of the link between the imaged cloth of Edessa and the imaged Turin Sindon. If you put ALL the pieces of evidence together that makes a CRUCIAL EVIDENCE.\n\n","date":"July 12, 2012 at 9:19 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13774","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Had any of the STURP members ever heard of the Greek words himation and tetradiplon in 1978? Had any of them take the trouble to study the relic at a distance of 15m-30m? Did Jackson or Schwortz even noticed Frei lifted off at least one sticky sample form the Sindon face? Do you seriously think all the STURP team member are infallible? Are you kidding?\n\n","date":"July 12, 2012 at 9:44 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13776","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Mistyping: Had any of the STURP members ever heard of the Greek words himation and tetradiplon in 1978? Had any of them taken the trouble to study the relic at a distance of 15m-30m? Did Jackson or Schwortz even notice Frei lifted off at least one sticky sample form the Sindon face? Do you seriously think all the STURP team member can be at one and the same time fallible and infallible according to you own good will? Are you kidding?\n\n","date":"July 12, 2012 at 9:48 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13777","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Yannick,\nIt does seem you are STILL totally enable to discriminate between the Holy Face of the Holy Mandylion as an ingenuous  true-false copy (now kept in Manoppello) and its prototype; the Holy bloody  face and body of the tetradiplon/” folded in four” Sidon (now kept in Turin). The whole confusion does come from the very fact the more than 4m long x 1m wide cloth was reduced to the size of a towel (mandylion in Byzantine Greek) and kept on a board or between boards within a twice wider than high gold gilt trellised reliquary/vessel/monstrance. It was displayed in full, half or quarter length in the Blachernae chapel only for private purposes and in times of great dangers.\n\n","date":"July 12, 2012 at 11:04 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13778","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Mystyping: “You are STILL UNABLE to dsicriminate”\n\n","date":"July 12, 2012 at 11:10 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13779","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"The tetradiplon Sindon kept within its monstrance (i.e. folded four times onto itself in eigthth length/mandylion-like fashion through a vast circular central opening on its front side) was displayed once a year on Transfiguration day only as the Holy face was evocative of the sweat of Yeshua’s agony in the Gethsemane garden.\n\n","date":"July 12, 2012 at 11:28 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13780","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Yannick,\nHOW do you account for the 11th & 12th century CE iconographic Mandylion & Keramion/Keramidion to be depicted BOTH in landscape AND portait modes?\n\n","date":"July 12, 2012 at 11:54 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13782","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"The Holy Face of the Holy Mandylion (square portrait) used to kept (second mid-13th century till 1792 CE) in a 60cm high x 45cm wide x 8cm deep reliquary-tablet/vessel (Treasure of the Sainte Chapel of Paris).\n\n","date":"July 10, 2012 at 5:13 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13708","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"The Veil/kerchief was no longer in the reliquary  (only its painted representation on a board).\n\n","date":"July 10, 2012 at 5:31 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13710","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"\nYannick Clément :Jackson’s hypothesis concerning the folds is purely speculative for numerous reasons (the first one being the FACT that nobody can date a fold mark !!!). And because of this particular and, excuse me, completely ludicrous and non-scientific hypothesis, Jackson’s bias regarding Wilson’s hypothesis is as obvious as the nose in anyone’s face…\nMax, I recommend you to read again carefully the fact #22 in my article. This is TRUE AND CORRECT SCIENCE, not science-fiction based solely on speculations. And what this TRUE AND CORRECT SCIENCE tell us ? That there are absolutely no signs of any kind of physical and chemical differences between the region of the face and the rest of the cloth, not only at thread level, but even at fiber level !!! On this subject, let me remind you that the Spanish team of Sindonology have been able (very easily) to prove what was the side of the Sudarium that was always exposed to the faithful (probably for century) just by the amount of dirt and dust that was more present on this particular in comparison with the other side that was hidden to the eyes of the public (and consequently protected from air and sunlight). Why would it be different in the case the Mandylion hypothesis was correct ??? Come on !!!\nBy the way, this particular hypothesis of Jackson concerning the folds remind me of another ludicrous hypothesis proposed by himself regarding the bloodstains on the Shroud !!! Effectively, in one paper he published in Shroud Spectrum in the 80s, Jackson was pretending that there was not only real bloodstains on the cloth but also “images” of bloodstains !!! Wow ! No doubt that we are right into the Twilling Zone here… :-) And I’m not even talking about his other hypothesis concerning the Shroud that was, in fact, the tablecloth for the Last Supper !!! Totally incredible… It’s the right word I guess.\nYannick always keep in mind all hypotheses are somewhat speculative. Secondly you forget the afformentioned folds were noted by the STURP team before Wilson’s first book was even published!, so less likely Jackson ‘thought-up’ his hypothesis from Wilson. The fact that folds cannot be dated is a sticky point, agreed, but not so relevant when the folds have been deemed; “fact” that they exist and prove unquestionably, that the Shroud was for some extended period of time, folded in such a way as it would agree with Wilson’s Image of Edessa ‘landscape’, ‘tetradiplon’ theory. Why do you ignore these facts?\nAnother thing; Just because one hypothesis put forward by someone may prove wanting, does not mean all hypothesis put forward will follow. Anyways as for “images of bloodstains”; Jackson is not the only one who believes so, as some of the blood markings are seen on what some suggest are non-contact areas. Can you prove them incorrect? …I highly doubt so. \nAlso to state that because the Sudarium shows evidence of being dirtier on the ‘assumed-shown-side’ can relate or pertain at all to the Shroud is a HUGE assumption, if there ever was one. Especially when we know very little of how or where they were kept for much of their existence. The EDICES assumption that the dirtier side was the most shown side is completely speculative, there can be other very reasonable causes for this evidence.\nR\n\n","date":"July 12, 2012 at 5:16 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13788","author":"Ron","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"For the fold marks that, supposedly, were found by Jackson, it’s a totally subjective kind of thing.  The fact is this :  There’s foldmarks scattered everywhere on the cloth ! ;-)  So, they can have been formed anywhere, anytime.  And I’m sorry but Jackson published this in Shroud Spectrum International in the 80s and Wilson’s first book came out in 1978, before the STURP investigation.  So, he was surely well aware of Wilson’s hypothesis at the time.\nFor the blood, this is one of the dumbest thing I’ve ever read !  Like Barrie Schwortz once told me (and he was damn right !) :  Bloodstains on a dead body doen’t project themself on a cloth, at a distance !  The bloodstains on the Shroud all came from DIRECT CONTACT between the cloth and the body and those who don’t agree with that are people who don’t understand well the blood transfer phenomenon that occured on the Shroud and that came from exudates of blood clots that were still humid to leave an imprint of themselves on the cloth (causing mirror images of these humid clots that were on the body).  I’ve read the paper of Jackson about that and it was based on the fact that there are some bloodstains on the forearms of the man of the Shroud that are almost of the same color than the body image.  It’s very thin to then pretend that they are also images of the same nature than the body image !!!  If there is different colors (and physical aspects) in the bloodstains on the forearms, it just prove that the blood transfer wasn’t perfectly the same everywhere (the result of the direct transfer on the cloth wasn’t totally homogeneous) and, in fact, this is one more little clue that the Shroud is not the work of an artist !  In fact, that simply prove that there was some blood clots that were more humid on their surface than others at the time of the transfer on the cloth, causing slight differences of tones and physical aspects in the bloodstains of that region…  That’s all !  We don’t need to call for some supernatural images of blood on the cloth in order to explain these small differences !!!\nFor the last part of your comment, I just want you to read again carefully the last fact (fact #22) in my paper !  THAT’S SOLID SCIENCE and not speculation or extrapolation !  Adler didn’t found ANY NOTICEABLE DIFFERENCED AT ALL between a non-image thread coming from the head region and other non-image threads coming from 3 other parts of the cloth.  Sorry but we don’t need speculation here to understand that the region of the face of the Shroud could not have been the only one exposed to air, dust and sunlight for centuries, since there’s absolutely no chemical or physical proofs of such an exposition.  And even if the cloth would have been kept almost all the time inside a reliquary, it’s impossible that such an ancient reliquary could have been impermeable to the air (which is a natural oxidative element and a very good carrier for dust)…  Much more than Jackson’s supposed foldmarks, there would have been some physical and chemical differences (more oxidation, more dirt, more dust, etc., etc.) FOR SURE between the face region and the rest of the cloth if Wilson’s hypothesis was correct.  No doubt about that.  This is called “a fact” my friend and sorry but that doesn’t leave any place for doubt.  Not in my mind at least ! ;-)\n\n","date":"July 13, 2012 at 3:32 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13828","author":"Yannick Clément","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"It seems essential to remember as Yannick has pointed out that the word tetradiplon was only applied to the cloth that was applied ti Jesus’ face before he wiped himself with it. If you read Wilson’s 2010 book he gives the impression that the cloth is referred to as tetradiplon only AFTER it has become the image of Edessa. In the Acts of Thaddeus there is, though Wilson does not tell us this, a SERARATE reference to the burial cloths as remaining in the tomb. Wilson’s argument collapses completely as soon as the original document is read.\n\n","date":"July 13, 2012 at 5:17 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13830","author":"LyFe","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Amen.  You did a fine analysis of the question.  \nAnd why do you think Ian “Dan Brown” Wilson doesn’t tell us all the infos about this ?  Because he want to redirect the fact in favor of his idea.  That’s not at all how good historical research goes.  But nevertheless, most people in the Shroud world don’t want to see this.  Blinded by their preconceived ideas versus this weak hypothesis ?  You bet !  It’s funny because when it comes to someone like Dan Brown, these same people have a totally different language and opinion !!!  That speak very loud.  \nI don’t have nothing else to say (for the moment).\n\n","date":"July 13, 2012 at 5:33 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13832","author":"Yannick Clément","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Thanks, Yannick. It does seem to undermine the Freeman argument that tetradiplon referred to the way the Edessa Image was folded for storage, after the image was made, but it does seem to support Freeman (and you) when he says never trust Wilson without reading the documents he quotes for yourself. They often say something completely different from what he says they say and anyone who bothers can find this out on the internet. Not a difficult man to out and you have done some good work here.\nAs you say , you can take out ALL the Wilson stuff and still have an authentic Shroud.\n\n","date":"July 14, 2012 at 1:16 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13837","author":"LyFe","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"The last thing you said is so true.  Pro-authenticity people must never have fear that Wilson’s ideas can be wrong about the history of the Shroud.  Something, it seem to me that people of the Shroud world think he’s the God of the history of the Shroud !!!  As I often say :  What’s the big deal to think that the Shroud have no solid historical root before the second part of the 12th century in Constantinople ?  That doesn’t mean this cloth is a 12th century forgery at all !  \nSimple hypothesis from me (just to start a reflection) : I think the very bloody and morbid nature of the cloth is the main reason why we don’t have any clear mention of it in any ancient sources before the 12th century…  I think it’s fair to assume that the inner part of the cloth (where the image of the dead Christ and also, where most of the blood can be seen) was never publicly exhibit before 1203, when the relic was exposed each Friday in the Blachernes Church of Constantinople (possibly like a Palladium to protect the city against the threat caused by the arrival of the Latin Crusaders).  Because of its nature, I think it’s rational to think that the relic was privately kept and hidden for a long time after the resurrection and when it falls into the hand of the Church, only some important members of the Clergy were aware of the real aspect of the inner part of the cloth and did their best to avoid that it would be publicly showed.  \nThat’s only a personal hypothesis (of course, totally incomplete), but I don’t think it’s worst or more crazy than the one defended by Wilson.\n\n","date":"July 15, 2012 at 7:06 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13882","author":"Yannick Clément","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Yannick. You have hit on a big problem. Too few people have seen that Wilson’s theory of the Edessa Image being the same as the Turin Shroud has had zero support from any specialist working in this field. Because they go on believiing it ,people have failed to do any work at looking at the other ways in which the history of the Shroud might be traced. If only Wilson could be discared you would release a lot of new ideas some of which might have more evidence to support them\n\n","date":"July 17, 2012 at 9:42 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13917","author":"LyFe","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"The reality is this : Tracing back a complete and solid history for the Shroud prior to the second half of the 12th century in Constantinople is IMPOSSIBLE in the present state of the historical research concerning ancient, European, Byzantine and Syriac sources.   Period.  Before that time, we just can make assumptions, while doing the best we can to avoid bad extrapolations and bad speculations (like Wilson always do).  And when you do this, you realize rapidly that it is a “mission impossible” to trace back the Shroud before the 4th century (because that’s when the first known depiction of a Jesus with long beard and long hair started to appear – in the Roman catacombs).  Before that :  NOTHING !  But as I often say : That’s not because we get absolutely no clue before that time that the Shroud is not a real burial cloth of the first century A.D. and that it cannot be the one of Jesus of Nazareth !!!  Having no clue for a specific period of time don’t necessarily mean that this object wasn’t there !!!\n\n","date":"July 17, 2012 at 3:40 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13922","author":"Yannick Clément","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Yannick, you wrote: \n“Bloodstains on a dead body don’t project themself on a cloth, at a distance! The bloodstains on the Shroud all came from DIRECT CONTACT between the cloth and the body”. \nThis is just common sense. In case the corpse is put to rest in extra height on one of its sides, by sheer gravity effect, remoistened blood can rivulet into a drop when meeting an obstacle (such as head flowers, plants or other solid objects laterally pressed onto the body)… (See e.g. TS left elbow).\nYannick you also wrote: “Sorry but we don’t need speculation here to understand that the region of the face of the Shroud could not have been the only one exposed to air, dust and sunlight FOR CENTURIES, since there’s absolutely no chemical or physical proofs of such an exposition.”\nTHE WHOLE IMAGE WAS EXPOSED TO AIR, DUST AND SUNLIGHT FOR CENTURIES? THIS IS NOT ONLY PURE SPECULATION THIS IS FALSE. The TRUE FACT is, most of the time, it was kept either hidden or within a reliquary. As both a secret and most sacred relic, it was very rarely publicly displayed both in Parthian and Byzantine times (only once ot twice a year).\nOnce again I am asking you: HOW do you account for the specific use of the Greek word TERADIPLON in conjunction with the word SINDON? Could you PLEASE ANSWER my question. For once, don’t you use selfserving omissions and ignorance!\n You then wrote: “And even if the cloth would have been kept almost all the time inside a reliquary, it’s impossible that such an ancient reliquary could have been impermeable to the air (which is a natural oxidative element and a very good carrier for dust)… Much more than Jackson’s supposed foldmarks, there would have been some physical and chemical differences (more oxidation, more dirt, more dust, etc., etc.) FOR SURE between the face region and the rest of the cloth if Wilson’s hypothesis was correct. No doubt about that. This is called “a fact” my friend and sorry but that doesn’t leave any place for doubt. Not in my mind at least! “. \nAbout dirt and dust, you’d better reread what a Byzantine emperor wrote in 958 CE… The relics were regularly remoistened with water (during the Holy Week and in times of war or great dangers. The collected water was then to be sprinkled over the Byzantine soldiers and the faithfuls. \n“YOUR FACT” is defintiely NOT a fact AT ALL whereas the vast NIMBUS-LIKE shaped vast discoloration all around the face is A VISUAL FACT implying once it\nwas shown in a monstrance with a central circular aperture.\n\n","date":"July 14, 2012 at 5:31 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13839","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Yannick, \nwhat do you really kow about the way the Parthian/Byzantine reliquaries were really devised? \nNOTHING.\nHow can you be so sure they were not devised to be as much as possible humidityproof and dustproof? \nNOTHING. \nWhat do know about the way Byzantine relics were really used, kept and cared for?   \nNOTHING.\nWhat FACT(S) make(s) you think that the Turin/Constantinople Sindon reliquary was exactly devised like that of the Oviedo Shroud?\nNONE. \nWhat FACT(S) make(s) you think both relics were kept in exactly the same air, humidity, dust conditions? \nNONE. \nActually, each time, YOU’RE ARE JUST SPECULATING (mistaking your own speculations for facts)\n\n","date":"July 14, 2012 at 8:09 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13841","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Correction: \nWhat makes you SO SURE they were not devised to be as much possible humidityproof and dustproof?\nNOTHING.\n\n","date":"July 14, 2012 at 8:16 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13842","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Max, I think it is you who must do the explaining.\n1) The only source Wilson gives for tetradiplon is The Acts of the Holy Apostle Thaddeus, sixth century. Do you know of any others as it is important we have all the known examples to work from?\n2) In the Acts the word is only used to describe the sindon ( a normal name for a linen cloth) BEFORE Jesus wiped his face with it. In other words a cloth was brought that was tetradiplon ,and THEN given to Jesus. The word tetradiplon is, so far as I know not used otherwise.\nSo how does Wilson deal with this?\nP. 190. 2010 edition of The Shroud.\n‘Although its initially off-putting aspect [of the Acts] is that it ‘explains’ the creation of the Image as by Jesus washing himself, it intriguingly GOES ON [my capitals] to describe the cloth on which the Image was imprinted as tetradiplon’.\nNow by using ‘goes on’ Wilson implies that tetradiplon is used of the cloth AFTER the image is on it, instead of BEFORE as the Acts make clear. Is he simply being imprecise or is he deliberately misleading? Please let us know what you think.\nHe is misleadng on sindon. Look up any traditional Greek lexicon, e.g. Lddell and Scott and you will find the word probably originated as cloth from India but then became a generic term for fine linen or just linen. So forget any connection with burial shrouds from the gospels, this is simply a linen cloth being brought to Jesus for him to wipe his image on.\nWilson also makes great play about a four folded cloth having to be large- nonsense- if you have a pocket handkerchief you will see that during ironing, if you do such thngs, it is folded over four times. (Sometimes being the family ironer pays off!) So size has nothing to do with it.\nAs Yannick suggests this makes Jackson’s folding irrelevant  to the issue.\nRead on in the Acts and there is a separate reference to the crucifixion and burial of Jesus with the burial cloths described in the same Acts as being LEFT in the tomb. (This would not,of course, stop them from being gathered from there and becoming what is now the Turin Shroud.)\nSo it is up to you to provide any reason why these burial cloths should be tetradiplon. Contrary to what Wilson argues it is the ACTs temsleves, the very document he uses, that destroys his own argument about tetradiplon. By using ‘goes on’ you could say he is being misleading by misrepresenting the order of events as set out in the Acts and so creating an argument that has never existed.\nThis is why Yannick feels so strongly about these things- it only needs a little,bit of research, and Yannick has done a lot to see how quickly much of what Wilson writes collapses when the original sources are consulted.\n\n","date":"July 14, 2012 at 7:59 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13840","author":"LyFe","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"To Yannick and Lyfe:\nAs long as you JUST CANNOT account for the use of the word TETRADIPLON (“folded in four/folded four times onto itelf/doubled in four”) in conjunction with the word SINDON to describe the imaged cloth of Edessa, allow me to think it refers to “a sindon folded in four, folded four times onto itself or doubled in four.” \nTHIS IS A LINGUISTIC FACT you just cannot selservingly ignore.\nAs long as you JUST CANNOT account for the use of the word HIMATION in conjunction with the cloth on which Yeshua would have left his facial imprint, allow me to think the latter was left on a long rectangular cloth more than 4m long x 1m wide (for a man 5’8″-6’2″ tall) characteristic of an ‘himation’ called ‘achiton’ when worn right to the skin as summer/spring wear and ‘sindon’ when worn as night/evening wear or workwear.\nTHIS IS A PHILOLOGICAL ARCHAEOLOGICAL FACT you just cannot selfservingly ignore.\nShall I repeat here, I only 25-50 % agree with Wilson as the latter gave us only one possible translation for tetradiplon when there are three. Wilson aslo totally missed to discriminate between the Holy Face of the Mandylion and the Holy Face of the (tetradiplon) Sindon as two distinctive objects: the former being just an ingenuous only facial copy of the latter.\n\n","date":"July 14, 2012 at 9:07 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13845","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Shall I also repeat here, I don’t either 100% agree with Jackson’s recontruction from the fold maks as there are not only one but three possible translations for tetradiplon.\n\n","date":"July 14, 2012 at 10:18 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13847","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Wilson also missed that KEY FACT: a himation is more than 4m long  x 1m wide for a man 5’8″-6’2″ tall and can be worn as an achiton/sindon (see Mark and the garment/sindon/sadin left by the young man who “ran away naked” scene)\n\n","date":"July 14, 2012 at 10:01 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13846","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Lyfe you wrote: “if you have a pocket handkerchief you will see that during ironing, if you do such thngs, it is folded over four times. (Sometimes being the family ironer pays off!) So size has nothing to do with it.”\nIf you closely read ALL “the Abgar legends”, you shall notice there is a (deliberate?) confusion between a face cloth and a long rectangular cloth; the latter whether or not it is folded four times onto itself.\nNow If you fold in four/four times onto itself a mere (hand)kerchief about 55cm long x 40cm wide (i.e. the size of the Mandylion as face cloth), the FACE the size of an average man JUST CANNOT leave its WHOLE IMPRINT…\n\n","date":"July 15, 2012 at 6:15 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13855","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"…on it.\n\n","date":"July 15, 2012 at 7:09 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13858","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"However if you fold in four/four times onto itself a himation worn next to the skin that is as achiton (summer-spring wear)/sindon (evening-night wear, workwear), you can get  the WHOLE IMPRINT of an average sized face on it in landscape mode (see 11th & 12th century CE iconographic imaged cloth of Edessa/Mandylion. \nShall I endlessly repeat, the Holy Face of the Holy Mandylion was just an ingenuous only facial copy (now kept in Manoppello) of the Holy Face & Body of the Holy (tetradiplon) SINDON (now kept in Turin).\nNot only Wilson  but Art Historians such as Belting, Cameron, Nicoletti, Aslanovski etc just missed this relatively simple fact.\n\n","date":"July 15, 2012 at 6:28 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13856","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Don’t you ever forget: most of the time, Late Antique and Medieval Christian legends contain a kernel of truth…\n\n","date":"July 15, 2012 at 7:07 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13857","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"My own research on the Head venerated by the Knights Templar tends to prove Wilson was right. He was also partially right when he identified the tetradiplon SIndon to the Turin Sindon.\n\n","date":"July 15, 2012 at 7:14 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13859","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"My own findings:\n1/  (2010) a short portion decal of a text in Nestorian type of Syriac script can be detected on the area just below the beard (from digitally contrast enhanced 1978 Schwortz Turin Sindon face  photograph). This faint writing should be futher investigated in the light of King Abgar’s & Rabbi Yeshua’s/Christ’s apocryphal letters.\n2/(1994 & 1998) a vast nimbus-like shaped light discoloration all around the Turin Sindon face can be detected not only on high contrast enhanced orthochromatic, traditional silver & extensive digital Sindon overall photographs but also in situ cathedralis torinensis by standing  at a distance between 15 to 30m away from the relic.\n3/(2010) a himation is more than 4m long x 1m wide for a man 5’8″-6’2″ tall (eactly 4,20m long x 1,40m) and can be worn as an achiton/sindon (evening-night wear or workwear). This is consistent with the Turin Sindon and one Late Antique version of the Abgar legend.\netc, etc etc.\nDO CONFIRM a direct link between the imaged Edessa cloth and the imaged Turin Sindon.\n\n","date":"July 15, 2012 at 7:36 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13860","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Correction: “consistent with one EARLY MEDIEVAL version of the Angar legend”\n\n","date":"July 15, 2012 at 7:41 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13861","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Has Davor Aslanovski ever heard of Art Historians having made serious mistakes?\n\n","date":"July 18, 2012 at 4:35 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13951","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"History is far from being a perfect science Max…  It’s mostly a science (I prefer to use the term “an art”) of interpretation.  Errors are frequent in that field.\n\n","date":"July 18, 2012 at 4:52 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13954","author":"Yannick Clément","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Yannick, thank you for the info just in case I were not already aware…\n\n","date":"July 18, 2012 at 6:01 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13961","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"Yannick, \nplease do reread Aslanovski’s comments: as “Art Historian Academics”, he does think himself, Cameron, Nicoletti etc as NATURALLY infallible… and Wilson, as a non Art Historian Academic, TOTALLY off-track…\n\n","date":"July 18, 2012 at 5:58 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13960","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"…which is your own “credo” BTW…\n\n","date":"July 18, 2012 at 6:02 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-13962","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson","post":"At the end of my paper concerning the hypothesis of Ian Wilson about the Mandylion, I wrote that if I kept searching, I would find other historical or artistic facts that would permit to question even more this hypothesis.  And now, guess what ?  I’ve already found one more fact like that while reading the interesting book The Rape of the Turin Shroud, by William Meacham !!!\nEffectively, here’s what Meacham wrote in page 9 of his book : “There are, however, NUMEROUS PROBLEMS with a Shroud/Mandylion link (Cameron 1980), notably the difference in size, SEPARATE MENTION IN RELIC LISTS and the SILENCE of its eventual “revelation” as a burial cloth.”\nWhile I mentioned the first two big problems he talk about in this part of his book, I completely neglect the third one, which is an authentic HISTORICAL FACT. Context : if we believe Wilson’s hypothesis, just after the arrival of the Mandylion in Constantinople in August 944, that’s when some persons would have found that the Mandylion was not just a face cloth, but that it was instead a larger cloth showing at the very least an image of the chest (with the side wound) and the head of Christ (with bloodstains).  Be the historical fact is this :  After this arrival of the Mandylion (and this so-called “discovery”), there is ABSOLUTELY NO WRITEN MENTION ANYWHERE stating clearly and specifically that the Mandylion was in fact a shroud (or a burial cloth) of Jesus-Christ directly related with his Passion and death !!!  \nNote : If we believe Wilson’s interpretation of some texts (followed closely by Scavone and Dubarle), this rapid finding would have been done by members of the Royal family (in a private showing of the relic with the future emperor Constantine VII being there) and also by members of the Byzantine Clergy (with Gregory Referendarius and his sermon).  In fact, the most important thing to note is the FACT that there is no ancient document written after 944 that made a direct link between the Mandylion (and/or the Abgar legend) and a shroud (or burial cloth) of Christ (or his Passion and death on Good Friday), even if Wilson and others pro-Shroud researchers declared that, on the first day of its arrival in Constantinople, there was already some persons who knew that the Mandylion was something else than a face cloth showing a living Christ without bloodstains.  If Wilson’s hypothesis is correct, WHY IS THIS SO ???  \nIt seems completely ludicrous to think that a very important finding like that (a finding by the way who would have been already announced publicly if we interpret the sermon of Gregory Referendarius like Wilson, Dubarle and Scavone) would have stayed in the dark afterward and never mentioned again (in detail and much more clearly) in other Byzantine texts written after.  If we put ourselves in the historical context of the time, it is 100% SURE that a great finding like that would have been reported in many other manuscripts and liturgical texts by Byzantine writers.  But the FACT is that there’s absolutely no clear mention of this so-called “discovery” made in 944 in later ancient Byzantine texts, while there is a vast amount of ancient sources written afterward (many lists of relic in particular, most probably written by eye-witnesses) that continue to describe the Mandylion has a small cloth bearing only the face of the living Christ (without any reference to his Passion and death or to the presence of injuries and/or bloodstains on the cloth).  The literary evidence we can trace from the period between the end of the 10th century and the sack of Constantinople in 1204 make it totally inconceivable that there really was a great finding like that, i.e. a finding that would have give a clear proof that the Mandylion was in fact a burial cloth of Christ directly related to his Passion and death (this idea is based on personal interpretations from Wilson, Scavone, Dubarle, etc., all pro-Shroud people, that were not followed by any real Byzantine scholars).  In all logic, if Wilson’s hypothesis would be correct, we would have a bunch of ancient manuscripts that would talk about this most important finding in great details, but THAT’S NOT THE CASE AT ALL !\nMeditate on that folks !!!  From now on, I consider this FACT as the 23rd fact of my list !!!  I still don’t know how I could have forget to talk about that before !!!  At least, you got it now !!!  And I have to say that I’m still convinced that if I keep searching, I will found other facts that will permit to question this very weak hypothesis of Ian Wilson even more.  I’m really sorry for those who took this hypothesis for granted, but as I said, it’s not because the hypothesis of Wilson is most probably wrong that it means the Shroud is not the authentic burial cloth of Jesus of Nazareth…  It simply mean that we have to search elsewhere for a better (i.e., more rational) explanation.\nYannick Clément\n\n","date":"August 1, 2012 at 8:30 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","id":"comment-14382","author":"Yannick Clément","site":"shroudstory"}]
