[{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"I don’t know whether Barrie has read my article or not but he seems to confuse depictions of expositions that are the basis of my research and copies of the Shroud which I don’t deal with. Some of these copies are so different from the Shroud that I suspect they may be other examples of grave cloths rather than intended to be copies of the Shroud. This might be an important lead in that it will help with one of the biggest problems – why two images instead of one. There appear to be some Spanish cloths that might be double images and mistakenly seen as copies of the Shroud rather than independent paintings. Another area where there is lots to be done.\nOf course, I would argue that the artist of the Shroud was drawing on traditional iconography ( much of it such as the overall flagellation very recent) rather than traditional iconography being inspired by the Shroud.\nStill the Herald has told where my article can be found so that readers will doubtless access it to make up their own minds – if these are not already closed!\n\n","date":"October 29, 2014 at 3:27 pm","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166649","author":"Charles Freeman","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"Mr. Freeman, even If I really respect your work, especially when it comes to dismiss Wilson, Scavone and others researchers’ claims concerning the so-called Mandylion “theory”, I think that when it comes to the question of the authenticity of the Shroud, you have not consider the strong evidence coming from the blood and serum stains with enough care.  I say this because the evidence coming from these stains are the most compelling thing in favor of authenticity.  Of course, as I said in my previous paper about this piece of evidence (http://www.holyshroudguild.org/uploads/2/7/1/7/2717873/yannick_clment_shroud_of_turin_the_evidence_of_the_bloodstains.pdf), it is still possible to imagine a scenario in which the Shroud would be the burial cloth of another anonymous crucified man (which would have eventually been wrongly considered as the real burial cloth of Jesus) or a scenario involving what I called “a natural forgery” involving a real crucified body looking like Christ of the Gospels, but frankly, in face of all the known data available (the physical and chemical data being much more important in my mind than anything coming from ancient artistic and litterary sources), it is much easier to consider this cloth just as what it was reported to be, i.e. the authentic burial cloth of Jesus of Nazareth. Even if I’m a believer in the Resurrected Christ myself, you can be sure of one thing: if the evidences would have convinced me that this cloth is most probably not the authentic shroud of Jesus, I would not be here today writing this message to you…\nBy the way, here’s a news for you and anyone else: in an upcoming paper (I wish I could publish it online before the end of the year or early next year), you’ll see me doing a long analysis of the first scenario I described in my paper about the bloodstains evidence (i.e. the one involving an accidental resemblance with Jesus, which involves the burial cloth of an anonymous person)…  While doing this analysis, it didn’t took me too long to realize that such a scenario is highly unlikely in face of all the data we know.  And I think the same for the “natural forgery” scenario.  That leaves me with the hypothesis of the authentic burial cloth of Jesus and nothing else…  Of course, it’s impossible to be absolute about that, but in my mind, I truly think the probability of such a thing must be estimated very high (let’s use the same probability as the C14 labs in 88: at least 95% confidence).\n\n","date":"October 29, 2014 at 3:49 pm","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166656","author":"Yannick Clément","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"It did seem like Barrie did not know what the article was about. It would have been nice if Barrie had deferred to a medievalist or an art historian. We all love Barrie and no one has done more to advance Shroud knowledge in the world. But as Barrie is always telling us, stick to your field of expertise.\n\n","date":"October 29, 2014 at 3:53 pm","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166657","author":"WmW","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"Excellent point WmW!  Here is the first sentence of the comment I wrote (that the Catholic Herald editor deleted):  “Those aspects of the Shroud are far from my areas of expertise.”\n\n","date":"October 29, 2014 at 4:04 pm","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166662","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"It would have been nice if Charles had focused on historical work and not guesswork whether there was actually a loincloth on the Shroud or not or whether Mc Crone proved it was a painting, it spoils his article.\n\n","date":"October 29, 2014 at 4:32 pm","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166669","author":"anoxie","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"The Catholic Herald article is well-balanced presenting both the Freeman and Schwortz perspectives on the Shroud. \nMr Freeman I believe is lacking in any scientific credentials at all, and the only science that appears in his article is that which supports his case and is widely discredited or has at least been seriously challenged.  Such inferences he makes as “overwhelming evidence that the Shroud is 14th century” and his opening salvo with the discredited D’Arcis memorandum hardly signals an objective intent.  Not one single flake of the paint which he alleges originated the image survives nor has ever been reported in any single historical document.  On the other hand we have ancient documents that report that the image was perceived as “not made by human hands”.   Byzantine epitaphioi, notably the Stavronitska, some dating from the early 12th century, would seem to be persuasively derived from the Shroud image, and the Shroud therefore can hardly be 14th century.  Mr Freeman blithely dismisses in his obviously agenda driven hypothesis any such argument and carefully selects only that which supports his tenuous case. \nWhat are we to make of the scientific credentials of one who is still prepared to firmly assert that no AB type blood appeared in the human species before 1000 AD and was the result of the Magyar admixture of A and B types from the Mongol incursions of that time when it is known that there are significant populations of AB scattered throughout the world, particularly in the Far East and Middle East, and AB is even found among certain non-human anthropoids.   \nMr Freeman glosses over why any artisan should choose to make a mirror image of the Christ with its chest wound appearing on the left hand side of the body, when all liturgical traditions have the wound on the right side of the body, as it happens to be forensically correct to drain the right side of the heart of its blood, a mortal blow known to the Roman soldiery.  The left hand side is what we see as the result of a type of contact imprint, and any competent artisan would have seen to it in the design of his template by reversing it.  The image has been carefully studied by several forensic pathologists, none of whom entertained any doubt that the image was of a genuine crucified human male, and was no artifact.  \nWe expect that any art historian worthy of the name ought to be able to categorise a work of art, assign to it the particular prevalent style, comment on the genre, place it within the context of other like works, identify the methods used, if he cannot identify the artist to place it within a certain school of art, and compare it to other like works.  This Mr Freeman is unable to do, not because its contemporary companions no longer exist, but because they never existed at any time at all!  Any artisan who might have constructed such a work, only ever did it once, he left no record of how he did it, nor is there any trace of his failed attempts, and no-one else ever thought to record the event either.  \nAs Mr Schwortz implies, it is the Science which authenticates the Shroud as the burial cloth of the Christ, and it cannot be dismissed by the agenda driven hypothesis of any misguided   art historian.\n\n","date":"October 29, 2014 at 3:47 pm","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166655","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"Excellent daveb\n\n","date":"October 30, 2014 at 1:10 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166782","author":"Thomas","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"Absolutely! DaveB why don’t you write a Shroud book correcting mistaken historians from then to now.\n\n","date":"October 30, 2014 at 2:26 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166793","author":"clublu22014","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"To clublu2:  I believe we both may have assisted in one such recently [Clue – Ch 18],  But my email to you bounced, I guess your filter was set just a little too high for me.  Kind regards.\n\n","date":"October 30, 2014 at 2:59 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166803","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"Hey Dave, could you try emailing me again?\n\n","date":"October 30, 2014 at 10:31 pm","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-167036","author":"clublu22014","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"“it is the Science which authenticates the Shroud as the burial cloth of the Christ”\nA typical example of wishful thinking. Science never authenticated the Shroud.\n\n","date":"October 30, 2014 at 1:46 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166786","author":"PHPL","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"That is a matter of perception and interpretation of the weight of evidence.  A long list of forensic pathologists were in no doubt that they were looking at the image of a real crucified human male who had also suffered the gratuitous punishment of a helmet of thorns.  They considered it to be no artifact.  The rest is merely corroborative.  Scientists can be prone to nit-picking, and may be consulted as experts only, but juries are comprised by persons who are reasonable, not nit-pickers.  But it may be fair to nit-pick when selecting representative samples on which to weigh the evidence!\n\n","date":"October 30, 2014 at 3:11 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166808","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"Most of the points raised by DaveB are covered in my article. A lot of it is concerned with placing the iconography of the Shroud alongside fourteenth century equivalents.\n\n","date":"October 30, 2014 at 3:04 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166805","author":"Charles Freeman","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"Daveb:\n“On the other hand we have ancient documents that report that the image was perceived as “not made by human hands”.”\nAre you confusing the Mandylion with the Shroud? This is an old mistake. \n“ Byzantine epitaphioi, notably the Stavronitska, some dating from the early 12th century, would seem to be persuasively derived from the Shroud image, and the Shroud therefore can hardly be 14th century”.\nI don’t know the “Stavronitska” epitaphios. If you are speaking of the epitaphios of Stavronikita monastery in Mount Athos I don’t see “it seems to be persuasively derived from the Shroud”. I see a lot of differences between them. But this one is dated in the 14th-15th centuries. http://www.elpenor.org/athos/en/e218ck20.asp Perhaps we are speaking about different things.\n\n","date":"October 30, 2014 at 3:44 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166816","author":"David Mo","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"Daveb raises a very good point about the position of side wound, which is NOT raised in the article. It is atypical and almost certainly suggests the image was created by contact with an object (Jesus’s body if you are authenticist, or bas relief if not) rather than painted on. \nWhy would an an obvious painting created for ceremony – as Freeman suggests – be then exhibited and venerated? Freeman suggests an association with a miracle as a possibility. I think it far more likely that it was exhibited as Christ’s true burial shroud or at least a representation of it, and its mysterious and unique ghostly image (totally unlike a painting) was part of its attraction. I have previously argued that the image was always faint, referring to a number of depictions from the 1500s that clearly attempt to depict its faint ghostly nature. I also argued that the bolder depictions do not prove that the image was once much bolder, but rather represent a less skilled depiction OR the artist’s desire to show the detail of the image rather than faithfully try to depict its faintness. \nCrowds go to see the ghostly image today so why not crowds in the 1600s. Why does its display and attraction of large crowds imply that the image was much bolder?\nI also struggle to see why a ceremonial prop as Freeman proposes would need to show frontal and dorsal images. Why depart from a tradition of just showing a frontal image? eg. the epitaphios\nAnd the nudity remains a problem. Very rare indeed in depictions of Christ. Even in the 1300s the overwhelming majority of depictions showed Christ with loin cloth. I know of one or two small paintings, but am unaware of statues or large artistic representations used for public display / worship that show Christ without loincloth. \nThere are many more problems with this theory but I don’t have the time now.\n\n","date":"October 30, 2014 at 4:12 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166823","author":"Thomas","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"Thomas -as I make clear in my article, the artist was recreating an image that might have been left if the Shroud had contacted the body and so he attempted a negative, primarily by moving the wound from the conventional right to the left.\nAs I discuss in my podcast, the similarity between the pattern of bloodstains on the Shroud and those on fourteenth century examples such as the Holkham Bible ( 1330) and the Roettgen Pieta are so close ( drops around the Crown of Thorns, blood running along the arms) that I  wonder whether there was a template that artists copied when making these Shrouds. it may even be possible that the painting is in fact an imposed pattern but it seems clear from the early descriptions that the quantity of ‘blood’ on the Shroud ( see examples in my article) was so great that it may have been added separately. \nI agree that two images, which, as I say in my article, could not be from the same body unless it had longer arms than any others known to anatomists,needs further research. (One of the consistent features of early depictions is a space between the elbows and body on the back image- lie down in this pose and your arms won’t meet in the front!) Double images are quite common in Byzantine art so that is one starting point. It is also a possibility that some of the so-called copies of the Shroud are not copies at all but independently made double images- these seem to come mainly from Spain- so research needs to concentrate there.\nAgain and again I make the point that there are many areas of research on the Shroud that have not yet begun. We have a long way to go before we know whether my proposals have academic support or not. The first reactions I have from medieval experts have been supportive- I don’t think there is anyone commenting on this site who has any academic background in medieval iconography and ritual but there are people who have.\n\n","date":"October 30, 2014 at 5:15 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166836","author":"Charles Freeman","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"“Double images are quite common in Byzantine art so that is one starting point.” That’s very interesting, as I don’t think I have come across any. Can you give a few examples?\n\n","date":"October 30, 2014 at 5:57 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166847","author":"Hugh Farey","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"Now that the Savoys have been mentioned one is prompted to ask why would they keep a forgery in their possession a secret for a hundred years? It doesn’t make sense:\nhttps://www.academia.edu/7447446/Was_there_a_link_between_the_Knights_Templar_and_the_Turin_Shroud_An_interview_with_Dr._Barbara_Frale\nAnother problem for the history article is that there is nothing in any of the STURP papers or other peer-reviewed material published by scientists who were not a part of the team about any sign of a painted image being scraped by a knife.\n\n","date":"October 29, 2014 at 4:16 pm","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166663","author":"Louis","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"They did not keep it secret – see your Beldon Scott who details the expositions. It was not until it was moved to the new Savoy capital in 1578 that they had a big enough display area to make a ceremony of the exposition. Beldon Scott is excellent on this.\nMy article is rooted in medieval iconography and ritual. STURP knew nothing about this and there are no references in any STURP report to these areas. I have found nothing in any STURP report that places the Shroud within that small but crucial period of 0 to 30 AD .\nBut their finding of calcium carbonate and an image on the outer fibrils fit well with what medieval craftsmen manuals advise for preparing a surface for painting.\n\n","date":"October 30, 2014 at 2:38 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166795","author":"Charles Freeman","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"P.S.Forgery. the time the Savoys got the Shroud it had already been accepted by the Church as worthy of veneration with an indulgence attached. For the historian of relics one of the fascinating things is to see how an object of veneration was transformed into an actual relic  as happened here.\nI do wonder whether people commenting here have actually read my article as one of my main themes is that that  Shroud was never the forgery of a burial cloth but produced for a completely different function – probably the Easter ceremony of Quem Queritis where a grave cloth had to be held up in front of the empty tomb to show that Christ had risen. See the Lirey pilgrim badge for the way it was done- note the empty tomb under the Shroud.\n\n","date":"October 30, 2014 at 3:08 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166806","author":"Charles Freeman","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"Some of what you state is true, and we have to be objective as far as possible, whether we belong to the pro- or authenticity camps.\nIt is true that the STURP report has nothing that places the Shroud between AD 0 and 30. Their examination was in 1978 and during that period everything was calm in the realm of Shroud studies. Not so after that. It was slowly transformed into a minefield, with only chummies allowed to publish whatever they wanted — you yourself noted that — whether it corresponded to the truth or not. This is to say nothing about infighting and a lot more.\nDid this reach Rome? Of course it did. Unless things change for the better there is no hope for STURP II or any other possibility of hands-on examination. Pope Francis is a tough South American hombre, tougher than his Bavarian predecessor, not one to swallow nonsense, wherever  it comes from. See the first three paragraphs of:\n https://www.academia.edu/8841978/Professor_Giulio_Fanti_discusses_the_controversies_in_the_realm_of_Shroud_studies\nThere is another big problem. Rome has left the question to science and scientists have no access to the relic now because of the situation that was created, also due to internal and external factors. The expositions are not being held to tell the faithful, the curious and sceptics that their faith or scepticism will depend on the whatever we can learn from the relic.\nOn the contrary, the position of the Church is the traditional one, based on the narratives in the New Testament, as pointed out by Benedict XVI in his book “Jesus of Nazareth”, found in the last paragraph of:\nhttps://www.academia.edu/7893085/The_Quest_for_Jesus_in_Shroud_research\nIn a nutshell, it is Resurrection faith,not Empty tomb faith or Turin Shroud faith.\n\n","date":"October 30, 2014 at 8:27 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166883","author":"Louis","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"I agree.\n\n","date":"October 29, 2014 at 6:58 pm","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166702","author":"Emmett McMahon","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"The scraping by a knife description by CF really made me laugh!  Right…like shredding threads by monotone painting….what artwork indeed!\n\n","date":"October 30, 2014 at 2:29 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166794","author":"clublu22014","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"Well you might laugh for all you are worth but this is what the medieval manuals advised as the means of putting on gesso. If you put it on with a brush then it is hard to remove excess, if you put it on with a knife you can scrape off the excess. The aim was to keep the gesso layer as thin as possible across the outer surface of the cloth.\n\n","date":"October 30, 2014 at 2:41 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166796","author":"Charles Freeman","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"On canvas not on expensive linen.\n\n","date":"October 30, 2014 at 8:04 pm","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166998","author":"clublu22014","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"Charles wrote: “I don’t think there is anyone commenting on this site who has any academic background in medieval iconography and ritual but there are people who have.”\nI have a professional background (a nearly ten years’ experience) in cryptology applied (among other fields) to intriguing, enigmatic and coded Medieval iconography and literature. On professional achievement, I managed to  decipher the Knight Templars enigmatic graffiti in the Coudray Tower in Chinon, France (it took me 3 years, part-time) and all the Grail scenes and symbols in Medieval Arthurian Literature (it took me 4 years, part-time). I achieved what so-called “academics” failed to achieve so far. I got authorized opinion on my findings.\n\n","date":"October 30, 2014 at 6:06 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166849","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"Just to give you an example of the TS ‘GHOSTLY IMAGE’-HOLY GRAIL connection, the very surname of Arthur’s wife, GUINEVERE (Guenuuera, Guennevera, Guennvere, Guenhumara) : \nCurrent etymology: It would come from the Norman French form of the Welsh name Gwenhwyfar, composed of the elements gwen meaning “translucent fair, translucent white, sacred” and hwyfar meaning “smooth, resilient, supple, pliable” or… “ghostly image (according to Loth, from the Welsh Gwynhwyvar, “FAIR or WHITE/SACRED GHOSTLY or TRANSLUCENT IMAGE”).\nIt also wordplays via regressive metathesis with both Latin VIR-GINIS/GINIS-VIR and two old Breton words “guin” and “bara” to mean wine and bread that is the blood and body of Christ in other words the Eucharist.\nBesides how come in the Arthurian Romance, poets could have compared Yeshua’s body image on his burial cloth with that of a woman?\nRe the so-called ‘Klinefelter Syndrome’ the TS man could have suffered according to ‘Angel’, DO remember her telling us on this very blog she “looked at the full Shroud of Turin, frontal image of Jesus. (She) placed (her) hand over the head and looked only at the body. With the head covered, the body definitely looks like the body of a female, including breasts, by the way. The fingers on the hands are long and dainty, like a female’s hands.”\nThe very name of GUINEVERE in Athurian Romance does refer to A MALE-FEMALE-LIKE GHOSTLY IMAGE just the one we can see on the TS…\n\n","date":"October 30, 2014 at 7:03 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166858","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"…THIS is ‘an archaeopareidolia’ as the TS does behave like an oversized Rorschach bloodstain test.\n\n","date":"October 30, 2014 at 7:18 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166863","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"You’ve said this many times before Max and I do find it an intriguing claim. Do you have any psychologists who support this observation? As the Rorschach is an accepted psychology tool, I’m sure this must be an easy claim to corroborate.\n\n","date":"October 30, 2014 at 10:44 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166909","author":"David Goulet","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"Yes I have, David! \nIn this very blog:\n-See Thread: A mysterious work of art?\nOn May 4, 2013, I wrote: “… you can see the Grail Chalice-of-Christ-Blood-like shape… right in the\nTurin Shroud positive bust image vertical axis seen upside down.”\n-See Thread: A million people to see Jesus’ Holy Robe\nOn April 17, 2012 \n-See Thread: Paper Chase: Dan Scavone’s Besancon Presentation at …\nOn December 30, 2011 \n-SeeThread: Ian Wilson Responds to a Posting in This Blog | Shroud of …\nJanuary 30, 2014 – \nIn Colin Berry’s blog:\n-See Thread: Shroudie-Alert: Day 7 Shroud Mk 1 – somebody’s private joke\nOn February 25, 2013\nCan you or cannot you see the pareidoliac vision/semblance of a Blood Chalice embedded in the TS man’s bust image right in its main vertical axis by yourself?\nIf you cannot, then just ask your/a psychoanalyst if he can… You could be quite surprise as he could see it!\n\n","date":"October 30, 2014 at 3:16 pm","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166947","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"Latest News:\nIt may be time to forget the canonical gospels and the Shroud, something more interesting has arisen. It is — you said it! — the book “The Lost Gospel” by S. Jacobovici and B.Wilson.\n http://www.amazon.com/Lost-Gospel-Decoding-Marriage-Magdalene/dp/1605986100/ref=la_B001H6U22W_1_1?s=books&ie=UTF8&qid=1414667013&sr=1-1\nSensationalism always sells, makes it to the New York Times” bestseller list in seconds.\nWe have the blurb with j.D. Crossan saying that it is the last nail in the coffin of “biblical literalism”. But who said that to believe one has to be a biblical literalist in every sense? There are things that are to be taken literally, others not.\nS. Jacobovici must be careful with Crossan’s comment, it can backfire. If we walk backwards we reach the OT and what happens next? Rabbi Jacob Neusner’s warning has fallen on deaf ears.\nIt’s a pity I concentrated on the chair Karl Marx sat on to write “Das Kapital” for more time than necessary at the BL. Our English “Shroudies”, those in the anti-authenticity camp included, could drive there and look for the manuscript.\n\n","date":"October 30, 2014 at 11:54 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166917","author":"Louis","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"As vehemently as Colin despises pseudo-science, I despise pseudo-Biblical scholarship and archeology. They only thing they prove is the old adage ‘there’s a sucker born every minute’.\n\n","date":"October 30, 2014 at 11:58 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166919","author":"David Goulet","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"Quite right.\n\n","date":"October 30, 2014 at 12:22 pm","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-166924","author":"Louis","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"I think the scientific and other evidence makes it most unlikely the Shroud was made in any medieval age.  I would never begrudge anyone to think what they want, but I don’t think the preponderance of the evidence supports an opinion of in-authenticity.\n\n","date":"October 31, 2014 at 12:33 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-167066","author":"Andy","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"Reblogged this on Best of Shroud Story.\n\n","date":"November 6, 2014 at 3:19 pm","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-169329","author":"Dan","site":"shroudstory"},{"title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science","post":"Hello all,\n     What blows my mind is how the image of the body ended up on the linen clothe and how, in my opinion, it is the most outstanding achievement of the artifact that none of you and not even science itself can explain. All the blah, blah, blah surrounding this issue is for not because it cannot be told how this had happened.\n     Now, if you consider this to be the burial clothe of Jesus and if he is who he claimed to be; historically speaking, God’s savior to all mankind, the last sacrificial lamb, then it wouldn’t be a stretch to say the image was created by his coming back to life in a supernatural way and this is why science and those who have no clue of the history of Jesus’s claims cannot explain how it came to be on the shroud itself.\n     This is where science needs to let history play a part of coming to a solid conclusion and let certain historical books explain things that they now nothing of. Yes and let’s go back to the old testament. If one wants to sincerely seek all things involved unbiasedly and get down to what this involves then one must research everything in order to come to a solid conclusion to what the shroud is all about. (Real or memorix) A historical documentation, so to speak, of the things of what has been documented in the Bible. All one needs to do is to research prophetic scripture and you will see all that is on the shroud was foretold. I look at the shroud and read it like the book of books.\n     Science is fascinating but belief in something that is outside our understanding is difficult without faith.\n     So, if this was the burial shroud of the risen Yehoshua Hamashiac, then WOW!!!\nThank you to all involved\n\n","date":"September 19, 2015 at 9:31 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","id":"comment-210704","author":"G","site":"shroudstory"}]
