[{"title":"Believing is Seeing?","post":"I don’t understand Yannick’s comments on the Mandylion.  In my reading of Wilson, he never states that he thinks he sees, but rather provides evidence which seems to make his case believable.  Yannick, do you want to explain?\n\n","date":"September 3, 2012 at 1:11 pm","url":"https://shroudstory.com/2012/09/03/believing-is-seeing/","cat":"history","id":"comment-15789","author":"Andy Weiss","site":"shroudstory"},{"title":"Believing is Seeing?","post":"\nBelieving is seeing? How much of what we believe about the shroud is what we think we see? \nIf in my Ipad I jump to the contiguous column, I see the answer\nWe simply do not have enough reliable information to arrive at a scientifically rigorous conclusion\nI think,  Dan that you have given the answer. I would add thatin the aspects that have gone through a rigorous scientific process like the blood and forensic issues, nobody can say that « I believe I see». This should show us the way for the rest of things: if we want to say goodbye once and forever to the “I believe I see” lullaby, let’s go scientific by adopting the protocols and methodologies of scientific research. It has worked with the forensic aspects, why not for the rest?\n\n","date":"September 3, 2012 at 4:06 pm","url":"https://shroudstory.com/2012/09/03/believing-is-seeing/","cat":"history","id":"comment-15803","author":"Gabriel","site":"shroudstory"},{"title":"Believing is Seeing?","post":" In this comment  I explain how could it be.\n\n","date":"September 4, 2012 at 5:10 am","url":"https://shroudstory.com/2012/09/03/believing-is-seeing/","cat":"history","id":"comment-15826","author":"Gabriel","site":"shroudstory"},{"title":"Believing is Seeing?","post":"IAs soon as 2010, I did rapidly tackle the issue with French Canadian American Computer Scientist Mario Latendreese at Frascati. Actually what is first and foremost most needed are the detailed HAL 9000 HD Shroud images taken under normal light,+ additional ones taken under  raking light, transmitted light and ultraviolet light.\n\n","date":"September 4, 2012 at 8:00 am","url":"https://shroudstory.com/2012/09/03/believing-is-seeing/","cat":"history","id":"comment-15835","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Believing is Seeing?","post":"Mistyping: As early as 2010\n\n","date":"September 4, 2012 at 9:36 am","url":"https://shroudstory.com/2012/09/03/believing-is-seeing/","cat":"history","id":"comment-15837","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Believing is Seeing?","post":"Some “crazy stuff” have been written about the Turin Sindon by:\n1/ ALL those who “think they see what was not really there”,\n2/ ALL “those who more sensed than correctly identified what was really there hidden to the non-initiated eye”\n3/ ALL those who “think they don’t see what was really there”. \nNow just guess which category  better applies to Di Lazzaro, Murra, Guscin, Dan Porter, Yannick Clément etc when it comes to partial coin images, flower head, plant images, and ghost writings?\n\n","date":"September 3, 2012 at 4:54 pm","url":"https://shroudstory.com/2012/09/03/believing-is-seeing/","cat":"history","id":"comment-15808","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Believing is Seeing?","post":"Max on this, I agree with you 100%!\nR\n\n","date":"September 3, 2012 at 11:47 pm","url":"https://shroudstory.com/2012/09/03/believing-is-seeing/","cat":"history","id":"comment-15821","author":"Ron","site":"shroudstory"},{"title":"Believing is Seeing?","post":"I have recently found some very interesting information about the coin images or possible coin images on the Shroud. I will post here more on the subject, once I’ve checked the facts from some sources.\nR\n\n","date":"September 3, 2012 at 11:51 pm","url":"https://shroudstory.com/2012/09/03/believing-is-seeing/","cat":"history","id":"comment-15822","author":"Ron","site":"shroudstory"},{"title":"Believing is Seeing?","post":"Mistyping: \nNow just guess which category BEST applies to NON-epigraphists, NON-palaeographers, NON-botanists, NON-professional numismatists, NON-archaeological image analysts or cryptanalysts such as Guscin (a linguist), SCHWORTZ (a technical photographer), Porter (a business executive),  Di Lazzaro (a laser physicist), Murra (a laser engineer) and Clément (a geographer) when it comes to identifying partial GHOST coin images, flower head, plant and  writings nearly invisible to the naked eye?\n\n","date":"September 4, 2012 at 7:32 am","url":"https://shroudstory.com/2012/09/03/believing-is-seeing/","cat":"history","id":"comment-15833","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Believing is Seeing?","post":"NOT BELIEVING IS NOT SEEING?\nThe fact is e.g. THERE ARE intriguing tiny blood stains’ constellations nearly invisible to the naked eye on the 2D Shroud image in the facial area at right eye, left lower eyelid and mid left eyebrow arch levels see 1931 Enrie’s, 1978 Miller’s and 2002 Durante’s Shroud face positive and negative photographs  (BEWARE: the alleged 2002 Durante Shroud face photograph currently provided on Mario’s Shroud Scope is biased as actually it is just a detailed view of the 2002 Durante Shroud OVERALL photograph. Therefore many tiny relevant details are lost). \nThe colour of these stains varies from light brown to carmine brown and to carmine red with outlines that needed to be established and clarified (see my Torun paper to come or part of the “ultimate version” of my Frascati paper).\nHad Di Lazzaro & Murra been able/allowed to recur to laser light to detect in-the-state-of-the-art (i.e. directly from the Turin Shroud face itself) any possible faint tiny blood decal partial more or less latent imprints (image resolution limit 0,5mm) left on the eye areas by a solid object such as an ancient coin and worked hand in hand with e.g. a professional numismatist and a professional archaeological image analyst or cryptanalyst, THEN they would have written a quite different paper. \nThey would have to take into account THIS TRUE FACT: some “crazy stuff” had been written about the Turin Sindon NOT ONLY by all those who “think they see” what is not really there” BUT ALSO by ALL those who “think they don’t see” what is really there as it is still hidden to the non-initiated eye (namely the NON-epigraphist’s, the NON-palaeographer’s, the NON-professional numismatist’s, the NON-archaeological image analyst’s or cryptanalyst’s). \nDi Lazzaro & Murra would then have been aware that Filas had more sensed than correctly identified what is really there: partially bloodstained Pilate coin obverse faint tiny partial decal patterns left on both eye areas and at two different scales (nearly 1:1 on right eye area and 3:4 on left lower eyelid area).\n\n","date":"September 5, 2012 at 8:54 am","url":"https://shroudstory.com/2012/09/03/believing-is-seeing/","cat":"history","id":"comment-15885","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Believing is Seeing?","post":"BTW archaeocrytologically speaking, in order to be really detected both ghost and latent images shall be observed under raking light. That’s a must.\n\n","date":"September 5, 2012 at 9:23 am","url":"https://shroudstory.com/2012/09/03/believing-is-seeing/","cat":"history","id":"comment-15889","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Believing is Seeing?","post":"They are very few those who do have an eye for true paleographic, epigraphic or botanic forms. Even fewer those who are really able to make the non initiated eye really see.\n\n","date":"September 3, 2012 at 6:03 pm","url":"https://shroudstory.com/2012/09/03/believing-is-seeing/","cat":"history","id":"comment-15812","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Believing is Seeing?","post":"…real ghost images.\n\n","date":"September 3, 2012 at 6:11 pm","url":"https://shroudstory.com/2012/09/03/believing-is-seeing/","cat":"history","id":"comment-15813","author":"Max Patrick Hamon","site":"shroudstory"}]
