[{"title":"Secrets of the Shroud:  What say you all?","post":"Thanks Dan, here is an example of what I might include.  This comes from Dr. Gil Lavoie’s work.  On the Shroud we see blood that appears to be in the hair.  Its not in the hair.  The blood was on the face.  Since the image came later, the blood only appears to be in the hair when you pull the cloth flat.  This is a powerful proof point that the cloth indeed wrapped a corpse.  Now why the image is vertically collimated is anyone’s guess.\n\n","date":"December 6, 2012 at 9:32 am","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-19912","author":"Russ Breault","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Hi Russ, I presented a paper at the third Dallas Conference (2005) that challenges this claim, that is, the paper shows that the bloodstains appearing in the hair was not on the face but really in the hair. The paper is accessible at http://www.sindonology.org/papers/latendresse2005a.pdf (see Section 3 for details about bloodstains vs Lavoie’s theory). There is also a summary of the paper at http://www.sindonology.org/archives/2009/index2009.shtml (see entry April 18, 2009). Essentially, the theory that the Shroud was flattened when the images were formed contradicts some simple geometrical observations whereas there are no contradictions with these observations when assuming that no flattening occurred. I have never read a refutation of what is presented in that paper.\nBest, Mario Latendresse\n\n","date":"December 6, 2012 at 2:48 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-19930","author":"Mario Latendresse","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"I truly think Mario’s challenge concerning Lavoie’s hypothesis is totally wrong because he didn’t understand correctly the blood transfer that occurred on the Shroud, which mostly came from exudates of humid blood clots.  As anyone here knows, Mario, unlike Gilbert Lavoie, is not at all a medical or blood expert, so I think we can excuse his erroneous thinking about that important aspect of the Shroud…  \nIn sum, what Mario truly don’t understand is the SCIENTIFIC FACT that ALL THE BLOODSTAINS on the cloth comes from A DIRECT CONTACT !  Look carefully at the Shroud and it’s EVIDENT that the cloth was once tightly compressed with the vast majority of the corpse during the burial and then, this compression was released in many places. In other words, there MUST HAVE BEEN A CLOSE CONTACT with almost every part of the corpse in order to leave so many bloodstains on the cloth that came from exudates of blood clots (which cannot be transferred on a linen cloth otherwise than by a direct contact and in many cases, some kind of pressure on the cloth is even necessary to get the so well-defined blood imprints we see on the Shroud).   \nThe bloodstains and scourge marks that are located in places of the cloth where there is no body image at all is the most important fact that strongly suggest that there really was a change of position that occurred during the burial, i.e. from a generally tightly compressed position (responsible for the presence of most bloodstains on the cloth) to a more loose position that allowed an image formation without important distortions.  \nIn that context where an evident change of position occurred, I think Lavoie’s hypothesis is highly probable.  Here we have to understand one important thing :  most of the medical expert agree that it is IMPOSSIBLE to get superficial blood flows like we see on top of the loose long hair on both sides of the face if there is no important pressure applied on the cloth.  For example, we can see blood flows like this on the backside of the head because there was an important body weight pressure. But on the sides of the face, it’s impossible for the cloth to have been tightly compressed on the hair when the image formation process was active, because if it would have been that way, the resulting image would have been highly distorted laterally.  \nI think Mario should realized that he was most probably correct in his paper versus the fact that the cloth was loosely draped over the corpse during the image formation process but that he was dead wrong concerning the idea that there was no change of position during the burial…  This particular conclusion is totally contradicted by the FACT that there is bloodstains in almost every parts of the Shroud, which means (and this is what Mario don’t understand) that there was once a DIRECT CONTACT in ALL THESE PLACES between the corpse and the Shroud, including where we see some BLOODSTAINS IN PLACES WHERE THERE IS NO BODY IMAGE.  And in the end, if the Shroud would have been kept in a close proximity like that with the body when the image formation occurred, great distortions and possibly also some image saturation, would have happened, which is not the case.\nIn sum, here’s my personal conclusion (after a long reflection where I considered all the most important facts regarding the blood on the Shroud) : The conjuncture created by the presence of numerous bloodstains and scourge marks on almost every parts of the body image, the presence of some bloodstains and scourge marks located outside the body image, the presence of some scourge marks under the knees where no body image has been formed on the cloth, the fact that each one of these bloodstains or scourge marks was formed by a direct contact between the body and the cloth and the quasi-total absence of distortion and saturation in the body image strongly suggest that at some point during the burial of the Shroud man and certainly before the image formation process really began, the very tight position of the Shroud around the body was changed manually to become more natural (i.e. a looser draping over the body without the use of any fastening).  \nPlease note that Lavoie’s hypothesis is truly consistent with this conclusion of mine…\n\n","date":"December 6, 2012 at 6:06 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-19944","author":"Yannick Clément","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"\nYannick Clément :\n The conjuncture created by the presence of numerous bloodstains and scourge marks on almost every parts of the body image, the presence of some bloodstains and scourge marks lohe body image, the presence of some scourge marks under the knees where no body image has been formed on the cloth, the fact that each one of these bloodstains or scourge marks was formed by a direct contact between the body and the cloth and the quasi-total absence of distortion and saturation in the body image strongly suggest that at some point during the burial of the Shroud man and certainly before the image formation process really began, the very tight position of the Shroud around the body was changed manually to become more natural (i.e. a looser draping over the body without the use of any fastening).\n\nYannick,  in your model,  how is it that in this change the bloodstains remained undisturbed?\n\n","date":"December 6, 2012 at 6:32 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-19947","author":"Gabriel","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Simply because this change of position of the Shroud occurred during the burial of the Shroud man, while the surface of the blood clots was still humid !  The disturbance described by Barbet only occurred once the remoistened clots have completely dried again and are stuck to the fabric…  A careful removal of the pressure on the Shroud while the blood clots are still humid should not produce any noticeable disturbance in the bloodstains that just left a fresh imprint on the cloth.\n\n","date":"December 7, 2012 at 9:33 am","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-19975","author":"Yannick Clément","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Yannick, I understand that this scenario involves three different stages\n1. Recent blood produces initial stains on the cloth. The shroud is removed while bloodstains are still fresh\n2. An intermediate period of a few  hours in which blood gets definitely dried and no cloth is covering the body. Please, note that this stage is necessary. Otherwise if the manual change of the Shroud had been carried out inmediately, blood would still be fresh and a second groups of stains would have been formed\n3. The shroud is used to cover the body in a more loose fashion and image starts to form \nThe second stage implies that fewer hours were available for image formation, so perhaps no more than 24 hours are available for image formation\n\n","date":"December 7, 2012 at 1:54 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-19984","author":"Gabriel","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Gabriel, this is not exactly how I see things.  Here’s my hypothesis:\n1- The body is put in the Shroud in a central place inside the tomb while the blood clots on it are all dry.\n2- Soon after this enshrouding, because of the convenient conditions coming from the damp environment of the tomb and/or the release of ammoniac gases and/or other post-mortem gases and/or heat and/or water vapor, the surface of these dry clots started to get remoistened.\n3- The enshrouded corpse is transported from this central place to his final resting place, which is probably a stone bench carved in a wall of the tomb.\n4- During this short moving of the enshrouded corpse, some manual compressions occurred on many areas of the body (more on the right side than on the left, where most of the off-body bloodstains are located), which lead to the transfer of some bloodstains and scourge marks in these places, including those that are located where no body image would eventually be formed later on.\n5- Right after the enshrouded body was placed on a stone bench for his final resting place, the persons in charge of the burial decided for some reason to replace the Shroud more naturally and loosely over the body and left it like that without any use of linen strips, most probably because they knew they  would have to come back on Sunday morning and re-open the Shroud to complete the burial (with an anointing of the body and maybe a washing too).\n6- Some time after the end of the burial (maybe not long after), the natural image formation process (that surely involved ammoniac gases and other post-mortem gases) started.\n7- Less than 72 hours after death, the cloth was strangely separated from the body while this separation didn’t disturbed any of the numerous bloodstains and scourge marks on the cloth.\n8- A long time after this cloth-body separation, a coloration started to appear on the surface of the cloth which lead eventually to the complete and non-distorted body image we still see today on the cloth.\nThat’s how I see things right now, after a very long reflection that take account of all the known data and observations about the Shroud I could get.\n\n","date":"December 7, 2012 at 3:48 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-19986","author":"Yannick Clément","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"I one to make one more precision concerning the hypothesis I described in my previous comment :\nSince it is truly possible that some release of ammoniac gases could be the main reason why the surface of some dried blood clots started to get remoistened soon after the enshrouding of the corpse inside the cloth, it is also truly possible that the image formation process really began at that time, which was before the enshrouded corpse was moved to his final resting place on a stone bench inside the tomb.  \nNote that the possible released of ammoniac gases inside the Shroud could have come from two sources : 1- from the pores of the skin and from the nose and mouth (as described by Rogers) and 2- from the urea that would have been left on the skin of the Shroud man after the abundant sweat that covered his dead body would have completely dried.\nIn sum, this truly possible released of ammoniac gases (as well as maybe some other post-mortem gases) inside the Shroud soon after the body was placed in it can well be the main reason why so many dried blood clots were eventually able to left a mirror imprint on the Shroud and also why a faint image of the body would have been left on the cloth… I don’t say that a released of ammoniac is the only factor that can explain both the bloodstains and the image on the cloth, but I really believe it was a major factor in both types of imprints…\n\n","date":"December 7, 2012 at 4:44 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-19988","author":"Yannick Clément","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Last precision :  In the point #2 of the hypothesis I described above, when I talk about the possible release of ammoniac gases and/or other post-mortem gases and/or heat and/or water vapor, I want to make sure you understand that I’m talking about gases and/or heat that come from the tortured and crucified body and nothing else…  I just wanna make sure you get me right about that.\n\n","date":"December 7, 2012 at 6:21 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-19998","author":"Yannick Clément","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Yannick, I have difficulties with your point #2. Jerusalem is quite dry and more hours are needed before gases are significantly released. Even so, I dont see how amines or any other gases can remoisture blood stains. Which mechanism are you thinking of?\n\n","date":"December 7, 2012 at 7:40 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20001","author":"Gabriel","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"The remoisturing of blood clots by ammoniac gases as been proposed by Vignon at the beginning of the century.  I don’t say this is surely the main factor that has remoistened the clots, but it is one possible option because we can’t be absolutely sure that there wasn’t any released of ammoniac from the possible deposits of urea on the skin at the time the corpse reached the tomb.  In other words, I don’t say it is probable but I say it is one possible solution.  One thing I’m sure is the fact that most blood clots were already remoistened before the enshrouded corpse could be move from the central room of the tomb to his final resting place (i.e. most probably a stone bench).  Barbet’s hypothesis was that the remoistening came from the water vapors released by the tortured corpse, as well as some possible vapors coming from the mixture of aloes and myrrh in powder that was probably put inside smaller cloths and placed all around the body, inside the Shroud).  This is an interesting option too.\n\n","date":"December 9, 2012 at 6:11 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20111","author":"Yannick Clément","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Oh, by the way, it is also possible to think that the remoistening of the blood clots could have happened before the corpse reached the tomb but to me, this is less probable…  But since no one knows what was the particular environmental and biological conditions of the Shroud man between the time of his death and the time he reached the tomb, this hypothesis of an eventual remoistening of the surface of the dry blood clots before the body was placed inside the Shroud is another possible explanation for the presence of some off-body bloodstains made of pre-mortem blood (like some scourge marks behind the legs and some bloodstains off the right and maybe also off the left elbow) and the presence of bloodstains in the hair that originally came from both sides of the face.\nNote that Lavoie and Adler believed that the blood clots were still humid and never had time to get completely dry when the body was first placed inside the Shroud.  This is also a possible explanation but it’s far from being a favorite of mine because it would mean that the corpse reached the tomb no more than 1 hour or so after death, which seems to be too fast if we take into account the Gospels story of Joseph of Arimatea and his requisitioning of the body to Pilatus as well as the fact that he had to find a proper burial cloth for the burial…  Also, the fact that such recent blood clots are very easy to disturb is another problematic fact concerning such an hypothesis.\n\n","date":"December 9, 2012 at 7:21 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20114","author":"Yannick Clément","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Do we need to clarify what we mean by ‘undisturbed’? The bloodstains as they appear on the cloth now are clearly nothing like they would be if the cloth had been stained with blood and left undisturbed for hundreds of years. The whole thing has been heated, folded, soaked and goodness knows what else, and nearly all the blood has come off. Presumably the point is that the bloodstains show no smearing, so were undisturbed as long as they were wet. After they had dried, whether they were cementing a body to the cloth or were on the cloth only, then disturbance would have resulted in flaking and crumbling, without distorting the shape. Is that correct?\nIf a body wrapped in cloth had covered it in bloodstains, and after they had dried the doth had been rearranged to provide a suitable film for the other form of image transference, the blood stains could have retained their initial shapes.\n\n","date":"December 7, 2012 at 5:29 am","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-19963","author":"Hugh Farey","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Barbet made it very clear about the fact that the bloodstains on the Shroud have not the usual disturbed shape (with missing parts) of a stain that would have been formed on the cloth by a direct contact with exudates of remoistened blood clots and that would have later been separated from the body after this stain would have completely dried (and would have been stuck to the fabric).  The appearence of the bloodstains on the Shroud really seems to indicates : 1- that the cloth was separated from the body very soon after the deposit of the corpse inside the Shroud and before the remoistened blood clots were still humid (this is virtually impossible because in such a scenario, there would not have been enough time for any kind of natural image formation process) OR 2- that the cloth was separated from the body in such a way that, even if the blood was dry and was strongly stuck to the fabric, that separation didn’t disturbed the general appearence of the bloodstains on the cloth, which seems to be scientifically impossible to explain in such a condition.\nConcerning the disturbance of the bloodstains on the Shroud that could have occurred during the long history of the relic, Alan Adler was very clear about the fact that the only signs of disturbance he had detected were microscopic abrasions of the surface of the bloodstains that were mainly due to the numerous foldings and unfoldings of the cloth during the centuries.  No other important signs of disturbance was detected in the bloodstains by Adler (like, for example, some wrenching signs or some holes in the bloodstains).  In sum, the only signs of disturbance of the bloodstains on the Shroud are microscopic ones due to the way it was handled over the years and nothing else.\n\n","date":"December 7, 2012 at 11:51 am","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-19980","author":"Yannick Clément","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Hugh, you asked:  “After they had dried, whether they were cementing a body to the cloth or were on the cloth only, then disturbance would have resulted in flaking and crumbling, without distorting the shape. Is that correct?”\nThis is more or less the description given by Barbet in his book but I think it would truly be possible to get also some modifications in the original shape of the bloodstain during that kind of cloth-body with blood clots separation…  The main outcome of this kind of separation is certainly to produce some holes and missing parts in the bloodstains (which is not what we see on the Shroud), but I also think it would be possible to get a deformation of the original shape of the bloodstain if some parts of it located on the border of the stain would be taken away by the cloth-body separation.  I truly don’t think we can exclude such a possibility.\n\n","date":"December 7, 2012 at 6:18 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-19997","author":"Yannick Clément","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"I’d be interested to see a quotation from Adler concerning the disturbedness of the bloodstains. Have you access to it? In his first Applied Optics paper (1980) he refers to a sticky tape sample he received, in which, among “several hundred linen fibrils” and assorted other debris, he found “less than a dozen possible bloodstained fibrils and a single brownish red translucent crystal.” That seems to me remarkably little to be extracted from a ‘whole’ bloodstain. Furthermore, have you looked at, for example, the Shroud Scope image of the back of the head? All the bloodstains have a curiously bubbly appearance, whitish in the middle and darker round the outside, which I attribute to lumps of encrustation falling off, or possibly remaining on a ‘body’ when the cloth was peeled off. What do you think? Furthermore, the pale weave of the cloth is plainly visible over every one of the stains. If this is abrasion of the surface, it is far from microscopic, and if not, then where did the blood which originally covered the threads go?\n\n","date":"December 7, 2012 at 1:17 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-19983","author":"Hugh Farey","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Hugh, let me just adress one of the topic you raised.  You said : “All the bloodstains have a curiously bubbly appearance, whitish in the middle and darker round the outside.”\nMy friend, along with the presence of a halo of serum around the bloodstains, this is truly one of the clearest “signature” of a blood transfer tcoming from exudates of moistened blood clots !  The fact that the boudaries of the bloodstains are more dark and thick is a scientific sign that these stains where not formed by liquid blood but by exudates of humid blood clots!  And concerning Adler’s observation of the disturbance of the bloodstains, just wait until Sunday and I will come back with some relevant quotes from his book The Orphaned Manuscript…\n\n","date":"December 7, 2012 at 4:49 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-19990","author":"Yannick Clément","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"This is a long reply to Hugh comment #15 which may interest some other readers too (like Gabriel):\nHugh, you asked for some quotes from Adler’s book concerning the signs of abrasion he detected for the bloodstains.  Here they are (with some other complementary quotes) :\n1- “The blood areas… shows all the characteristics that would be expected for a clot retraction transfer to a fabric. As confirmed by the probing needle, the fibers are cemented together by the applied chromophore (note: the blood material coming from exudates of humid blood clots) and show capillarity in that they penetrated to the back of the cloth. They can also be seen under the crossing threads of the weave. There is evidence of abrasion of the chromophore from the more exposed surface as would be expected if this were an applied material with mechanical characteristics different from its cloth substrate. There is a variation in the color of the adherent particles from orange yellow to deep red as would be expected for clotted blood.”\n2- “…stretching causes cracking and flaking of any adherent materials such as proteinaceous blood derived materials…  Low magnification micrographs of the blood image areas of the Shroud already show marked extensive abrasion of this type of damage from past rolling and folding activities.” Note: the expression “extensive” used by Adler can be misleading because it can be taken as a proof that an important part of the bloodstains were abraded by the numerous folding and unfolding of the cloth over the years.  Of course, this is not what Adler meant there.  His quote has to be understood at microscopic level.  After that, Adler said: “Moreover, the sampling tapes demonstrate that these abraded materials have become redistributed over the entire cloth surface, leading to some confusion in assigning specific chemical structures to specific parts of the images.”                               \n3- “All these visual characteristics are also clearly seen in the 3.6X microphotograph, as well as the fact that the diffuse borders are not as sharp as would be expected if these transfers were of fresh blood and not a clot exudate.”  Note:  Here, Adler doesn’t talk about the visible well-defined aspect of the bloodstains we can see with naked eyes.  He’s talking about the microscopic aspect of the blood material that is stuck to the fabric and which can only be observed with a microscope.”\n4- “Vignon and Barbet also noted that the blood images were forensically consistent with those of clotted blood and not a freshly flowing wounds in that they appear thickened on the edges. As blood forms a scab it contracts, thickening the edge of the scab and exuding serum onto the surface and edges of the contracting clot.  This phenomenon is simply termed clot retraction and they noted that the major blood wounds (note: the side wound for example) even showed to the eye what appeared to be forensically correct serum contraction rings.”\n5- “…the conditions and timing of the clotting process have been experimentally investigated to demonstrate that only clotted blood will give the type of clear unsmeared blood images seen on the cloth and therefore these wound marks are really images of CLOT EXUDATES GOTTEN ONTO THE CLOTH BY CONTACT and not whole blood images.”  Note that this is not the kind of result we would see on the cloth if the wounds would have been washed and fresh post-mortem blood in liquid state would have then stained the cloth, as it was wrongly proposed by Zugibe…\n6- “The borders of the blood marks show the diffusive character and color gradient expected for the appearance of serum clot retraction rings.”  Again, we must note that this is not the kind of result we would see on the cloth if the wounds would have been washed and fresh post-mortem blood in liquid state would have then stained the cloth, as it was wrongly proposed by Zugibe…  Jesus corpse was not washed at all before he was placed inside the Shroud and the very particular characteristics of the bloodstains are totally clear about that because they show the well-known characteristic of a transfer of exudates of moistened blood clots and not of fresh blood coming out of freshly washed wounds. That means the corpse was still naked and covered with dirt and dried blood clots (as well as some fresh and humid post-mortem blood clots coming from the side wound and the feet) at the time he was placed inside the Shroud, which clearly indicates a very hasty burial.  This is totally consistent with the Gospel accounts of Jesus burial. \n7- “The blood marks that appear to be on the hair without matting it together are seen to be actually on the cheeks where bloodflows from the wounds in the temples would be expected to be found. The apparent discrepancy arises from the fact that the BLOOD MARKS HAVE BEEN TRANSFERRED TO THE CLOTH BY DIRECT CONTACT WITH CLOT EXUDATES FROM WOUNDS, while the man’s FACIAL FEATURES HAVE BEEN PROJECTED ONTO THE CLOTH BY A NON-CONTACT MECHANISM OF A RADIATIONAL TYPE. Therefore, they are NOT IN STEREOREGISTER. This same evidence of non-stereoregister can also be seen by careful examination of some of the scourge marks on the edges of the legs…”  Note that this last observation was first reported by Miller and Pellicori of STURP in their paper about the Ultraviolet fluorescence photographs of the Shroud.  Also, it’s important to note that this particular quote from Adler is in total contradiction with Mario Latendresse’s conclusion that we can found in his 2005 paper, in which he said that the bloodstains and the body image on the Shroud were imprinted on the Shroud while the it stayed all the time in the same natural draping position over the corpse.  Effectively, Adler’s conclusion clearly show that, because they all came from a direct contact with the cloth, the position of the bloodstains on the Shroud is not coherent with the non-distorted body image that has been formed by an image formation process that has worked at a short distance from the corpse. This non distortion imply, as Mario cleverly conclude in his paper (this was in fact a simple confirmation of Jackson et al. 3D study for STURP), that the body image must have been produced while the cloth was loosely draped over the body in a natural position and not tightly wrapped around it, as it is often portrait in TV documentaries about the Shroud or in artworks. However, this also imply that the cloth must have been located much closer to the body at some point during the burial in order to left so many bloodstains in so many different areas of the cloth.  \nThat’s where Mario made a big mistake of interpretation…  Sorry for him but because they all came from a direct contact with the cloth (this is a scientific FACT), there would NEVER have been as many bloodstains on the Shroud if the cloth would have been loosely draped over the corpse from the beginning and this position of the cloth would never have changed afterward.  In other words, a shroud loosely draped over a dead body (i.e. the most probable position for the recording of the non-distorted body image) would never has been able to get on it as many bloodstains as we see on the Shroud of Turin.  In this context, in all the places where there would not have been a direct contact between the cloth and the corpse, NO bloodstain would have been formed on the cloth. IT IS AS SIMPLE AS THAT AND THIS IMPLY THAT A CHANGE OF POSITION OF THE CLOTH MUST HAVE OCCURRED AT SOME POINT DURING THE BURIAL OF THE SHROUD MAN. \nNevertheless, you must note that, just like Mario, I don’t agree at all with Lavoie’s conclusion that this non-stereoregister of the bloodstains and body image must be due to a probable supernatural event that has flattened the Shroud prior to the formation of the body image (note that the same kind of supernatural hypothesis as also been proposed by people like Isabel Piczek).  No, in fact I firmly think that a much more rational and simple explanation exist for this particular observation and this imply a manual and/or weight compression of the cloth at some point during the burial of the Shroud man that was soon followed in many places by a removal of this compression that lead to a re-positioning of the Shroud in a more natural and loose configuration over the corpse. This change of position of the cloth around the body probably occurred near the end of the burial, just after the enshrouded body was transferred from a central room inside the tomb to his final resting place on a stone bench carved out in one of the wall of the tomb, while the blood clots were still humid (which had the effect of not disturbing the fresh new bloodstains on the cloth).  This is by far a the most rational explanation that exist to explain the non-stereoregister of the bloodstains and body image that has been detected on the Shroud and there’s absolutely no doubt that it is not as strange as the one proposed by Lavoie, which imply a direct act of God at the time of the Resurrection…  \nTo conclude, note also that Adler was a teammate of Lavoie in the study that showed quite clearly that the Shroud must have been in direct contact at some point with the sides of the face and this is what has caused the blood clots that were originally on the tempers of the Shroud man to eventually appears in the long and loose hair on both side of the face in the final image.  Note also that Alder, unlike Lavoie, as never claimed that the Shroud must have been completely flattened during the formation of the body image and I truly believe that he never agreed with such a supernatural hypothesis…  He never said it publicly (to my knowledge), but it’s probable that is idea was not very different from mine (i.e. that the compression that is responsible for the numerous bloodstains on the cloth must have been changed at some point during the burial of the Shroud man to become more natural and loose over the body). \nHugh, you said : “That seems to me remarkably little to be extracted from a ‘whole’ bloodstain.”\nMy answer :  This is normal since the sticky tape samples were only able to collect loose material from the surface of the Shroud, including some “debris” coming from the bloodstains, which are in fact some tiny parts of the bloodstains that were removed from the surface of the bloodstains by abrasion each time the cloth was folded and unfolded over the years. So, you can never expect this particular sampling method to remove a whole bloodstain or a major part of it from the surface of the cloth because these bloodstains are well stuck to the fabric and have even soak through the cloth (i.e. the blood material that formed these stains is not only located on the surface of the fabric).  And by the way, this is exactly what was expected by STURP because they didn’t want to use harmful methods of sampling that could have change drastically the blood or body image imprints on the cloth.\nHugh, you said : “Furthermore, the pale weave of the cloth is plainly visible over every one of the stains. If this is abrasion of the surface, it is far from microscopic, and if not, then where did the blood which originally covered the threads go?”\nMy answer : What you describe is not abrasion of the surface of the bloodstains but the residual blood material that first stained the surface of the fabric but which very soon penetrated the cloth often through the whole thickness of the cloth (in these numerous cases, the blood material is visible also on the reverse side of the Shroud.\nTo conclude this long comment, I just want to share a reflection with all of you.  It’s a bit off-topic but nevertheless, it’s worth the reading !  Here it is:  We often hear or read that the body image on the Shroud of Turin is unique and that should be seen as a proof that it came from a very extraordinary event.  I disagree completely with this line of thinking.  Here’s what I would say instead:  No one has the right to say that the body image on the Shroud is unique and extraordinary for the simple and good reason that we don’t have another example of a well-preserved antique burial cloth of a scourged and crucified man that only covered this corpse for less than 72 hours (i.e. before the arrival of the first liquid of putrefaction).  Because of this, we can’t be certain (scientifically speaking) if such a body image is really a unique case in history and if the same environmental, biological and clothing conditions would have been also present in the case of another crucified body, a similar image (along with many bloodstains and scourge marks) would not have been formed on the surface of his grave cloth.  In fact, regarding the Shroud, it would be much better to say this :  The uniqueness of the Shroud of Turin don’t really come from the body image or bloodstains that are present on the cloth but much more from the simple fact that such a gruesome burial cloth of a real scourged and crucified man, which is covered with bloodstains and scourge marks, has been kept and well-preserved for centuries until this day.  For me, THAT IS THE TRUE UNIQUENESS OF THE SHROUD OF TURIN. And along with the undisturbed aspect of the bloodstains, this can be seen as the greatest SIGN (not proof!) of the Resurrection of Jesus Christ.  In sum, the presence of the Shroud with us IS the TRUE SIGN!  I don’t think we have to search elsewhere…  In sum, if the Shroud of Turin is not the real burial cloth of Jesus Christ, why someone would have dared to conserved such a gruesome cloth?  As the mother of Barrie Schwortz once told him very cleverly: “They wouldn’t have kept it for 2000 years if it wouldn’t belong to Jesus!”  SHE WAS DAMN RIGHT AND UNDERSTOOD PERFECTLY THE REAL MEANING OF THE PRESENCE OF THE SHROUD WITH US TODAY (i.e. that there was at least one of Jesus disciple who was so convinced after Easter morning that he was Resurrected from the dead that he dared keeping such a gruesome burial cloth even if it was against Jewish Law)!  As Barrie said in interview: Not bad for an old Jewish mom!  Effectively…\nIt’s important to note that, in itself, this doesn’t prove the Resurrection but it’s still very important because it proves that there was at least one person after Easter morning that was truly convinced this event was real!  In sum, we can say that the fact that Shroud has been kept and well-preserved during 2000 years constitutes a TESTIMONY of the Resurrection of Christ as strong as the Gospels themselves!  Now, every person is free to believe this very particular testimony or not and there will NEVER be a scientific proof that will comes from the shroud to force them to believe in it.  That’s called “LIBERTY OF CHOICE” (or liberty of conscience if you prefer) and that’s one of the most important principle defended by the God of Jesus Christ who’s called Love.\nEND OF MY PREECH ON THE SHROUD… for today at least! ;-)\n\n","date":"December 9, 2012 at 6:53 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20113","author":"Yannick Clément","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Thank you so much, Yannick. I don’t have Adler’s book and your quotes are very instructive.\n\n","date":"December 10, 2012 at 5:26 am","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20122","author":"Hugh Farey","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"My pleasure Hugh…  By the way, anyone’s interested in the Shroud MUST read Adler’s book !  Here, you can buy a copy of this pearl about the Shroud: http://holyshroudguild.org/orphaned-manuscript.html\nAdler’s quotes are truly important to understand the real transfer mechanism that has produced the vast majority of the bloodstains on the Shroud.  In sum, the most important thing to understand is the FACT that everywhere you see a bloodstain or a scourge mark on the Shroud, it means the cloth MUST have been in direct contact with the corpse there for at least a moment (not necessarily for a long time).  It’s crucial to understand this fact because it is the very best piece of evidence that the cloth was compressed on most part of the corpse at one point during the burial and at least a portion of that compression (especially on the sides of the body, including the sides of the head) MUST have been removed before the end of the burial, cause if this compression would have been kept, there’s no doubt that the body image on the cloth would have been seriously distorted laterally in many places.  Also, the fact that where there was a direct contact when the image formation process was active, that’s where the body image is denser on the cloth is another very good piece of evidence that there MUST have been a change of position of the cloth at some point during the burial of the Shroud man (from a tight position to a more natural and loose position over the corpse). \nAnd what I wanted people to realize is that this FACT is in total agreement with Lavoie and Adler’s hypothesis concerning the idea that the blood we see in the hair of the Shroud man was in fact on both tempers on the corpse…\n\n","date":"December 10, 2012 at 11:54 am","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20140","author":"Yannick Clément","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"What is also important to understand versus these quotes from Adler is the fact that the bloodstains on the Shroud are fragile (especially their exposed surface) as we can expect of real bloodstains on a linen cloth and the fact that many tiny particles of blood have been found in almost every sticky tapes collected by STURP is a proof that there has been an important microscopic abrasion of the surface of the bloodstains on the Shroud, which mainly comes from the numerous folding and unfolding of the cloth over the years.  It’s also interesting to note that things are completely different concerning the body image and Alder talk also about that in his book.  Effectively, he noticed that the coloration that produced the body image is very stable and has not been altered in any way by the vagaries that have affected the cloth over the centuries.  This simple observation is enough to understand that the bloodstains and the coloration making the body image are completely different in their chemical composition.\n\n","date":"December 10, 2012 at 2:48 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20155","author":"Yannick Clément","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"I am afraid that with our comments we are moving away from what Russ and Dan were trying to inspire with this post. Coming back to this, an important detail we discussed here some weeks ago brought about by Daveb, was the fact that the dimensions of the Shroud were associated to a Syrian measurement unit of 1st century workshops in the East Mediterranean area. I think that this may represent an indirect confirmation of authenticity, very difficult to forger in Middle Ages.\n\n","date":"December 8, 2012 at 5:25 am","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20022","author":"Gabriel","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Ah, yes, sorry, I do tend to get carried away by details, but so often I feel it is the details that  are most subject to generalisations and innacuracy. The shroud’s dimensions have, I think, only been taken twice, and both are different, as one was before and one after the new backing was added. What’s more, I think it most unlikely that a 1st century cloth merchant would have had either a very accurate measure, or, indeed, would have cut his cloth accurately anyway. Try buying 4 meters of cloth today, and then measuring exactly how much you get. I don’t know anything about hand-weaving in the Middle East today, but has anyone actually researched whether looms are built to a specific width, and if so, how precise are they? It is clear that the shroud is about 4m x 1m, but whether that represents any particular standard I suspect would be difficult to prove beyond reasonable doubt.\n\n","date":"December 8, 2012 at 7:59 am","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20031","author":"Hugh Farey","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Thank you Gabriel for the reminder about the Syrian cubit measure.\nThe discussion can be found at Dan’s posting of Oct 15, “Quote for Today: Diana Fulbright on Wishful Thinking”, but it’s also mixed in with a whole lot of other material which is seriously in error, particularly the discussion about cotton contamination, which Thiebault Heimburger has since corroborated is solely confined to the Raes sample.  It was the cotton contamination which had suggested to me that the weave was of Syrian provenance, but since then it became evident that there was in fact a medieval trade in cotton to Europe, possibly as early as the 12th century, could even be earlier.  Getting back to cubits, the posting can be found at: https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/  .\nThe main discussion is at comments #19 of Oct 16, and #25 of Oct 18.  The cubits mentioned in #19 is rare, but #25 seems authoritative.  Some relevant comments by Max Patrick Hamon also follow.  Max had alerted me to this aspect of Syrian cubit measure.  There is a URL ref at #25, on Guralnick’s article “Sargonid Sculpture and the Late Assyrian Cubit,” Iraq, Vol. 58, 1996, pp.89-103.  There were three Assyrian cubits: Standard Late Assyrian cubit 51.5cm; Royal cubit (religio-mythological royal emblemata) 56.6cm; Slab featuring King Sargon 55cm;   It seems that the Royal cubit may well have been used for the cloth, but it is not exact.  This may be due to some historic stretching and shrinking, or even some weaving practice such as selvedging, trimming, loom margins etc.  \nIt has been suggested that the cloth may have been intended for a special purpose such as a temple garment (van der Hoeven in 2011), which could explain why a Royal cubit may have been used.   \nAt this stage, I feel the issue needs looking at in a little more depth than we’ve managed to do just by blogging.  Max also commented: “The fact is there are a couple of more possibilities here (see e.g. Mechthild Flury-Lemberg’s & César Barta’s primeval fold theory)” but i’ve not followed this further.\n\n","date":"December 8, 2012 at 6:21 am","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20024","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Other aspects which Russ may also like to follow up might include: \n1)  Some of the pollen work carried out by Israeli botanists, subsequent to Max Frei’s investigations.  I’m fairly sure (from memory) that they were able to confirm Dead Sea halophytes. \n2)  Work by Kohlbeck & Nitowski on Jerusalem travertine aragonite limestone particles: “New evidence may explain image on Shroud of Turin” by Kohlbeck and Nitowski. Biblical Archeological Review (BAR), vol 12 n. 4, 1986, pp.23-24)  A problem with lack of peer-review, but at face value, might be considered indicative.  Needs corroboration.  The title is a misnomer, in that the paper seeks to corroborate that the TS man made contact with limestone dust identical with that found in Jerusalem.  \n3)  Gabriel has sometimes mentioned that strontium studies could be of considerable value, I think in terms of percentages present, which could assist in location provenance, not sure about whether radioactive decay of Sr can be used or not for purposes of dating.  We have sometimes discussed this topic.  \n4) Roger’s work on vanillin may be useful for dating, but seems temperature dependent, and the cloth has been subject to sporadic high temperatures from fires.  Rogers also, I understand, considered that the flax for the linen was processed in accordance with a description by Pliny the elder – Yannick may be able to comment on this aspect. \n5)  Superficiality of the image is a distinctive feature – often suggested that it is confined to a starch(?) coating, rather than the cellulose of the fibrils.  Yannick Clement has often commented on the need to have a much better understanding of the chromophore. \n6)  The geometric distortion of the image is minimal – it seems to conform to an orthogonal projection, such as a photograph might, no lateral stretching, and no side views of the body are visible.  This implies constraints on the disposition of the cloth, whether it was merely draped as many think, or whether it was fully wrapped and tied as Max Patrick Hamon has claimed.  I think it may also have implications for the image formation process.  I personally find it difficult to imagine how a chemical process might produce such an orthogonal image.  The sides of the body may have been packed with some of the 100lb package brought by Nicodemus, hence no sides visible.  Also see paper: “The Turin Shroud Was Not Flattened Before the Images Formed and no Major Image Distortions Necessarily Occur from a Real Body” by Mario Latendresse, Ph.D.. \nSome of these may be worthwhile following up.\n\n","date":"December 8, 2012 at 7:04 am","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20026","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Pursuing DaveB’s excellent ideas, I would like an exhibition/presentation actually to do some of the experiments which might confirm, deny or at least demonstrate the arguments put forth.  It may not be possible to get bits of actual shroud, but microscope slides of pollen from the environs of Jerusalem can be compared to the any material presented by the “pollen men”; lumps or powder (or thin sections) of the relevant limestone can be compared to the findings of the “limestone men”; Samples of linen, subjected to various conditions of heat (even samples of ancient linen if available) can be tested for vanillin; models covered in wet paint can have cloths wrapped or draped or simply laid over them (a paint made from pure cocoa powder and water is fun if you use live models); photographs of faces, face on, with dark backgrounds and lit from in front can be analysed live in Photoshop to show brightness contours, etc. I find myself that presentations tend to be full of what ‘would have happened,’ which, however interesting, do not capture the imagination half as much as “look at this.”  I have been interested in the shroud for over 40 years, but nothing has actually excited me more than just last month, and actually seeing the fluorescence produced by scorching linen with a brass ornament. Chemical experiments with real myrhh, aloes, ammonia, urea, sodium hydroxide and any other chemicals that may be relevant are possible as well.\n\n","date":"December 8, 2012 at 7:48 am","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20029","author":"Hugh Farey","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Daveb and Hugh have mentioned the idea of experiments. We all know that direct access to the Shroud is impossible. But other materials that do not need a physical access like HR images are never made available.\nThey could be left on a website for free access and a coordinated open research project focused on a set of relavant aspects could be started up. Anyone could take part in it and the results would be more than solid. NOwadays there are truly objective methodologies to address at least the following objectives:\n1. Are there coins, flowers and letters on the SHroud? Yes or not. Statistical test could be caried out and a final scientifically sound solution would arise.\n2. How is the 3D profile we see in the Shroud? It could be characterized and certainly would shed light (isotropy, variograms….)\n3. The images (UV or other) provide evidence of a medieval reweaving different to the main body of the SHroud. Yes or not.\n\n","date":"December 8, 2012 at 9:34 am","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20037","author":"Gabriel","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"One among many of the unique data points that are often left out of a general overview “for time/space sake” OR, I’d rather say, most unfairly dismissed by non qualified experts IS the attested presence by qualified experts of ghost writings & inscriptions and solid objects very faint imprints (such as those of plants and flower heads) on & around the Sindon face area.\n  Most curiously NON QUALIFIED EXPERTS’ non-authoritative opinions in the 5 main relevant fields of expertise and/or approaches here involved (namely palaeography, numismatics, botany, archaeological image analysis and cryptanalysis), still do prevail in the Shroud world nowadays as such opinions by Guscin (a linguist), Schwortz (a technical photographer), Nicoletti, (an Art historian), Di Lazzaro (a laser physicist) and Murra (a laser engineer) are currently promoted via articles, Dan Porter’s blog posts and conference papers.\n  Now these Shroud researchers have definitely not the trained eye & brain to authoritatively decide whether or not any writings and/or solid object very faint imprints are ghostly recorded on the linen cloth as they are all too prone, as non qualified experts, to be the victims of negative pareidolie (“I think I don’t sees/I don’t think I sees”) when it comes to forms, signs and images there are not familiar with. \n  Reminder as a telling-tale example of a pseudo-authoritative misleading opinion on ghost writings, Barry Schwortz wrote (see Dan Porter’s blog November 23, 2009 entry):\n  “To make matters worse, Marion and Courage based all of their imaging work solely on the 1931 Giuseppe Enrie photographs.”\n  This is total disinformation. The true fact is (late) Pr. Marion and Ms Courage based their research work on BOTH 1931 Enrie’s and 1978 Miller’s Sindon face photograph (see their book).\n  Barry also wrote:\n“As for the Marion and Courage inscriptions themselves, these were carefully evaluated from a linguistic point of view in 1999 by Shroud scholar and language expert, Mark Guscin”.\n  The very fact both (late) Pr. Marion & Ms Courage did misread a few ghost inscriptions/writings does not necessarily imply (as suggested by Barry’s article), there is no ghost inscriptions/writings on and around the Sindon face at all.\n  Contrary to Italian palaeographer, Pr. Aldo Marastoni who did identify a few Latin and Greek ghost inscriptions/writings around and on the Sindon face, French optic engineer, (late) Pr. André Marion and French computer science expert, Thierry Castex who both did confirm the presence of such ghost inscriptions/writings on the linen cloth, neither Schwortz nor Guscin are a palaeographer, a papyrologist, an epigraphist and/or an optic engineer. As a mere linguist (and no matter how talented he may be as such), Guscin’s opinion on THE PRESENCE OR THE ABSENCE of ghost palaeographic inscriptions/writings on the linen cloth is, first and foremost, that of a non qualified expert in both optic engineering, computer science and palaeography and should be taken as such. The same applies to Schwortz’s as a mere technical photograph (no matter how talented he may be as such).\n  The true facts are mostly non qualified experts’ opinion (whether for or against the real presence of such ghost writings and solid object very faint imprints) still do prevail nowadays in the Shroud literature of all persuasion as qualified experts’ most scarce presentation of their findings should be better refined in order to really help the non initiated eye to see. Last but not east, a really conjugated interdisciplinary approach is more than ever needed in the 5 main relevant fields here involved not to spoil/discredit real findings such as ghost writings and solid object very faint imprints on and around the Sindon face area.\n\n","date":"December 8, 2012 at 11:54 am","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20041","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Max, Max, Max…  Can I remind you of one FACT concerning Barrie’s negative opinion about the whole question of the possible coins over the eyes ?  He cleverly based his judgment on the profesionnal opinion express by Don Lynn at the beginning of the 1980s who was the true imagery expert of STURP (he worked on many important project for the NASA) and who analyzed the question in deep.  Lynn was categorical about the FACT that it was scientifically impossible that so tiny coins letters could get imprinted on the kind of coarse threads of the Shroud in such a way that they could be readable…  That’s the definitive argument that convinced Barrie that the whole coin thing is scientifically untenable.  Barrie’s opinion is truly based on a real imagery expert and I hope you’ll finally realize that.\n\n","date":"December 9, 2012 at 6:42 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20112","author":"Yannick Clément","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Yannick, Yannick, Yannick, should I remind you what I wrote about Barry being WRONG (along with Lynn) not only in his opinions but ASLO in his facts about Shroud image resolution limits when it comes to partial coin pattern recording on the Turin Sindon? Shall I remind you both Schwortz and Lynn are definitely NEITHER archaeological image analysts and cryptanalysts NOR ancient blood pattern analysts? Here is two extracts from my 2011 Torun paper entitled Turin Shroud: The Third face of the coin-on-eyes issue Or A Full Reappraisal of Intriguing Tiny Bloodstain Patterns: \n“AS A PRELIMINARY APPROACH, we shall use here a set of rhetorical questions to probe the optical and numismatic potential of the linen clothe in connection with the coin-on-eyes issue. Hopefully, the real quality of both arch sceptics’ and arch advocates’ main opinions and reasoning will emerge in the following and help the reader to judge for himself on more solid and objective grounds.\n1/Are there any button-like protrusions over the eyes in the 3D Shroud images?\nFrom 3D reconstructions of a close up of the Shroud face, three eminent forensic medical examiners [namely Pr. Buckling, Pr. Baima-Bollone and Pr. Zugibe]1 and four computer science experts (among whom a 3D image analyst) [namely Mottern, Halarick, Pr. Tamburelli and Pr. Balossino] confirmed the finding, by the American physicist John Jackson, of flat somewhat rounded foreign solid object imprints on the eye areas. Unless one can demonstrate the eight researchers’ intersubjectivity, this is a rather well established optical and “extra-anatomical” fact.\n  Actually the whole problem the Shroud researchers were facing was to correctly identify the said object imprints.  In 1978, the late American theologian, Francis Filas, submitted a photographic enlargement (a third generation reversed photonegative copy) of the right eye area to the American professional numismatist and Greek classical coin expert, Michael Marx. \n  The latter could then identify the possible reading of “UCAI” – between 9.30 and 11.30 o’clock – as a fragment of the full Greek legend TIBEPIOY KAICAPOC, ″of Tiberius Caesar″, that appears on the obverse side of a small Roman colonial bronze coin 15.5-16mm in diameter minted under the authority of the prefect of the province of Judea, Pontius Pilate (26-36 CE).\n  Between 29-32CE, two small bronze coin types, a “dilepton” and a “lepton” featuring a “lituus”  (short curved wand used by Roman priests to foretell the future) and a “simpulum” (libation bail with angular shaft and handle) on their respective obverse side, were actually minted under the authority of Pontius Pilate. Both coin types bear the Greek legend TIBЄPIOY KAICAPOC,     ″ [coins] of Tiberius Caesar ″.\n  In the 80’s of the past century, some Shroud researchers who were neither professional numismatists, nor archaeological image analysts or cryptanalysts or even familiar with late ancient Greek alphabets, claimed to have found half a dozen lituus dilepta (Greek plural of dilepton) showing a rounded U (without a tail) substituted for an upsilon (Y) and a lunate sigma (C) for a kappa (K) by a die maker confusing his Latin and Greek in the legend TIBЄPIOY KAICAPOC.\n2/ Are misspellings such as TIBЄPIOU CAICAPOC or TIBЄPIOY CAICAPOC really to be found on extant Pilate coins?\n  In actual numismatic fact, the claimed misspellings cannot be observed on any extant Pilate coins. They are only due to misreading inscription fragments on much worn out coins. This is pretty obvious from the following figure (figure 4) presenting the three alleged “best specimens”.\nIn spite of my deep respect for Filas’, Whanger’s and Moroni’s pioneering work5, their “coin legend misspelling theory” shall therefore be dismissed here as totally erroneous.\n  Actually the reading of the “UCAI”-like fragmentary tiny inscription on the right eye area from authentic (first generation) reversed orthochromatic film or slide copies of the Shroud face and 3D image enlargements can be specifically associated with the same reading “UCAI” embedded within the inscription KAICAPOC on tens of existing Pilate coins minted in the 16th, 17th and 18th regnal year of Tiberius. This is a spy numismatic detail. Here are a few examples (figure 5):\n  In the hypothesis the impression on the right eye area would have been left by an ancient coin 2/3 the size of an average fingerprint: \n3/Would not the Turin Shroud’s three up, one down twill-weave linen fabric have been far too coarse to resolve the average 1.5mm high letters on such a small coin?\n  The Shroud thread count is 38 lengthwise (warp) threads of 0.14mm in average diameter and 26 widthwise (weft) threads of 0.25mm in average diameter woven into a measured one-centimeter square of the shroud fabric6.\n  The 0.5cm Shroud body image resolution limit should not be mistaken for the 0.5mm Shroud blood imprint resolution limit that is also the visual resolution limit. Now – and contrary to the body image – it should be here emphasized that the intriguing faint and very tiny faint brown letter-grouping-like patterns on the right eye area do appear photographically positive like the blood stains on the linen cloth. If we apply the Occam razor principle (i.e. if we try to give the simplest explanation to account for sharply defined appearance of the very tiny impressions), in the light of a funeral custom, it might well be the kind of incomplete decal or tell-tale sign a coin manipulated with blood-stained fingertips and placed over the right eyelid of the deceased is expected to leave on the internal upper side of a shroud soaked with a watery solution and pressed to the face. This has been demonstrated by experiments [Rodante’s and Moroni’s] (see figure 6) and just bypasses the theoretical objection that the threads would be too large to show this type of faint brown tiny letters on the Shroud face image.”  \nIf any interested to see my paper research extract 6 illustrative figures, I can sent them by email to Dan’s to publish them on his blog along with the corresponding extract.\n\n","date":"December 10, 2012 at 10:08 am","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20134","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Therefore metrologically, optically and experimentally speaking, nothing at all precludes a 1.5mm high letter resolution blood decal to have been left on the facial image by a Pilate coin 16mm± 0.5mm in average diameter.\n\n","date":"December 10, 2012 at 11:53 am","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20139","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"(contination, second extract)\n4/ Can the reading of “UCAI” on the Shroud be a “mere figure in clouds” due to the photographic procedure, the computer processing or the variegations on the linen cloth?\n  If we take a glance at digitized 2D reversed photographic enlargements of the right eye area from 1931 Giuseppe Enrie’s, 1978 Vernon Miller’s and 2002 Gian Carlo Durante’s photo-negative of the Shroud face, the same letter-grouping-like shapes can be detected (though as if a little bit out of focus on both Miller’s and Durante’s compared to Enrie’s). This means it is not an artefact of a certain photographic procedure as it can be depicted by photographs shot in different techniques whether orthochromatic, traditional silver and extensive digital (See figure 7, Photographic enlargement comparison of the right eye area from 5 Shroud face reversed photonegatives).\n  The letter images are not apparent on 1978 Schwortz’s and 1997 Durante’s Shroud face photograph just because of the use of two different lighting techniques. In 1978, Schwortz lit the Shroud from the front so as to minimize weave appearance to invisibility thus causing some already faint bloodstain patterns nearly standing out on the Shroud fabric to technically disappear from the photographs. In 1997, the “UCAI” sequence orientation happened to be nearly aligned with the incoming light direction thus causing a form of obfuscation from illumination to occur.\n  As far as 2D to 3D conversion by digital processing is concerned in terms of reduction in the weave pattern and increased sharpness of image, it must be noted that no additional graphic data can be found in a resulting 3D image from an authentic (first generation) orthochromatic film or slide copy, had not the graphic information been integral to the original 2D image8. \n  The letter-grouping-like shapes are thus clearly distinguishable from the vagaries of the weave (see figure 8, Digitized reversed photographic enlargement of the right eye area from: (a) authentic orthochromatic film copy; (b) Tamburelli’s digitized 3D image; (c) 3D visualization within a maximum 16 mm diameter area)\n. If the reading of “UCAI” had really come from the banding, both vertical and horizontal, encroaching on the area of the right eye, or been a mere “figure in clouds” on 1931 Enrie’s, 1978 Miller’s, 2002 Durante’s Shroud face photographs and 1981 Tamburelli’s 3D reconstructions of the said area, how come then the same “figure in clouds” can be also seen – visually embedded within the inscription KAICAPOC as a spy numismatic detail – on tens of existing Pilate coins minted in the 16th, 17th and 18th regnal year of Tiberius (see Fig. 5)?\n  The photographic, eidomatic and numismatic evidence offers therefore a complete rebuttal against the “mere figure-in-cloud theory”8. \n5/ Can Enrie’s black and white orthophotographs of the Shroud face taken eighty years ago on large glass plate negatives still yield usable and accurate information?\n  Besides mechanical squeeze and 3D scanning, it is common knowledge, among archaeological analysts and cryptanalysts that the best aids for deciphering purposes of 3D encoded ancient images and inscriptions invisible or almost invisible to the naked eye are applying false colour, 2D to 3D conversion and digital squeeze of photographs taken under appropriate raking light.\n  1931 Enrie’s Shroud face orthophotographs are not simply very aesthetic as some Shroud researchers would too hastily think. Mostly because of a longer time exposure under appropriate raking light and the use of specially designed filters which enhance local contrast, they did capture the finest details of the Shroud face image and haematic (or blood) imprints along with the characteristic weave pattern and the folds and creases of the linen fabric at scales 1:1 and 2:3. As such and regardless of 2008 HAL9000’s high definition digital photograph that should allow researchers* to analyse the Shroud in unprecedented detail, Enrie’s reversed negatives and positives are still the best candidates available so far (along with 2002 Durante’s digital photograph of the Shroud face as double or triple check) for detecting and studying any possible 3D encoded blood-stained coin tiny patterns embedded in the suspected image areas. Enrie’s photographs do yield usable and accurate information even more modern photographs fail to do. This is made pretty obvious with the photographic enlargement comparison of the right eye area from Shroud face photographs shot in different techniques (see Fig. 7).\n\n","date":"December 10, 2012 at 1:15 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20147","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Max, when you understand how a true imagery expert Don Lynn was, I think you can’t reject what his conclusion as easy as you do.  It’s like the anti-Rogers group who always try to discredit every conclusion he made versus the Shroud while in fact, he was the very best chemist expert to ever examine the Shroud up, close and personal! In the present state of our knowledge, I don’t see any good reason to discard the conclusion these true expert scientists made about the Shroud, whether it concern the impossibility for tiny coins letters to be readable on the coarse threads of the Shroud or the very high probability that the Shroud image was caused by a natural process acting at normal temperature. Of course, when can’t presume of a future run of direct examination that could be done someday, but right now, I think the conclusions of these experts must be regarded as the most probable ones.\n\n","date":"December 10, 2012 at 2:00 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20151","author":"Yannick Clément","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"I redo my last phrase: Of course, we can’t presume of a future run of direct examination that could be done someday, but right now, I think the conclusions of these experts must be regarded as the most probable ones.  People should listen more to experts like that.\n\n","date":"December 10, 2012 at 2:03 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20153","author":"Yannick Clément","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"YC, Shall  I endlessly repeat neither Lynn nor Schwortz are  qualified experts in the fields  of professional numismatic, paleography, archeological image analysis and cryptanalysis or/and ancient blood pattern analysis?  \n  As a mere computer science expert and cabin-air-conditioning & ice protection designer for the DC-8 aircraft and nuclear systems, Lynnn’s eye & brain coordination system definitely was/is NOT TRAINED (nor Scwortz’s either) to discriminate between Shroud  archeaological solid objects faint brown partial ancient blood decals  and body images. \n  THE TRUE FACT is blood decals visual resolution limit is TEN TIMES HIGHER than body images, whether you like it or not (0.5mm vs 0.5cm). This is an optical fact.\n  Your own sight & brain as a Geograph is not trained either to judge in such matters and/or promote as a fact what is not a fact but only a non qualfied expert’s opinion in one of the 5 main fileds of expertise here involved. Most sadly, the main problem  with Shroud Studies is non qualified experts are making excursions in fields of expertise they are totally ignorant and their non qualified opinions is retained as authoritative when actualy it definitely is not (and even  very far from it!).  \n  Earnestly, how can Schwortz or Lynn’s opinion can be authoritative in field such as paleography, numismatics, blood pattern analysis, archaeologcal image analysis and cryptanalysis?  Are you kidding?\n\n","date":"December 10, 2012 at 6:39 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20165","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"YC,\n  Shall i endlessly repeat It has been DEMONSTRATED BY EXPERIMENTS  [Rodante’s and Moroni’s] that the threads ACTUALLY ARE NOT too large (contrary to Lynn’s theoritical objection) to show this type of faint brown/carmin blood decals of tiny letters on the Shroud face image. Can you really read me? Have you ever heard of Rodante’s and Moroni’s experiments?\n  The final result for both IS: blood-stained Pilate coin fragmented legend/inscription once lightly pressed on a watery-solution in-soaked  3:1 twill weave linen fabric, CAN be recorded and readable much like the letter-like shaped group is recorded and readable on the Turin Shroud! THIS IS AN EXPERIMENTAL FACT NOT AN IMPOSSIBILITY!\n\n","date":"December 10, 2012 at 7:26 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20169","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"How long will  non qualified experts’ dogmatic opinion (in the main 5 fields of expertise and /or approaches involved in the coin-on-eyes issue, namely professional numismatics palaeography, ancient blood pattern analysis, archaeological image analysis and cryptanalysis) prevail in the Shroud world?\n\n","date":"December 10, 2012 at 7:45 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20171","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Sorry for my tyos. No time to correct them.\n\n","date":"December 11, 2012 at 5:01 am","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20192","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Typo: “as they are all too prone, as non qualified experts, to be the victims of negative pareidolie (“I think I don’t sees/I don’t think I sees”) when it comes to forms, signs and images THEY are not familiar with. “\n\n","date":"December 8, 2012 at 1:09 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20044","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Reminder (from my TS man’s burial reconstruction as an archaeocryptologist’s thought\nexperiment): “[…] A U-shaped folded headband with Latin & Greeek inscriptions was placed on the deceased’s face. Then two wooden pieces (sawn off the Yeshua’s trilingual titulus damnationis to make a small ‘jawbox’: a wooden piece is stuck on both sides of the tilted forward head, between head and dried blood, sweat and dust stiffened long hair side strands hard like cardboard. And then the top half of the long burial sheet is tautly wrapped lengthwise over the body from head to toe. A shorter burial sheet (about 2m long and 1m wide) or large bandage/strips [about 2m long and 50cm wide) is transversely tightly wrapped around the moistened long inner burial sheet to close the stiff rigid body at the pelvis level and counteract dislocated arms rigor mortis. Two (alkaline water in-soaked?) long linen strips/thin bandages are then used to bind the corpse widthwise from shoulders to feet in order to keep the Sindon close around the torso, pelvis and legs. A small veil of fine transparent byssus is placed over the enshrouded face; a third shorter wooden piece sawn off the titulus damnationis is stuck under the enshrouded chin and between the two enshrouded lateral wooden piece ends and a skull cap is fastened on top of it all to keep the deceased’s mouth close and the Sindon close around the head. […]”\n\n","date":"December 8, 2012 at 2:43 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20051","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Reminder # 0: “As the bottom half of the in-soaked lenghty burial sheet is pulled rigidly tight and the body laid on it and the two stones, fresh antiseptic insect repellent aromatic flora (Gr. aromaton) and solid objects such as a cane of Arundo donax, a cord or rope etc are laid alongside the body with a few items such as a cord or rope, cane etc. (+ symbolic & affective tokens laid on top?). A U-shaped folded headband with Latin & Greeek inscriptions…”\n\n","date":"December 8, 2012 at 3:01 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20052","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Reminder # 2: As early as the 4th centry, the Titulus Damnationis (the inscription at the head of the cross) is described as a relic divided into three pieces (one in Rome, one in Jerusalem and one in Constantinople).\n\n","date":"December 8, 2012 at 3:57 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20054","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Typo: “solid objects such as a cane of Arundo donax, a cord or rope etc are laid alongside the body (+ symbolic & affective tokens laid on top?).”\n\n","date":"December 8, 2012 at 3:41 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20053","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Yannick Clément is only making is own Vignon’s ammonia vapor diffusion hypothesis. Nothing new (although I do agree with him ammonia contained in heavy sweat residues can have something — not everything — to do with the Sindon image formation process).\n\n","date":"December 8, 2012 at 4:40 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20056","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Typo: only making his own\n\n","date":"December 8, 2012 at 4:41 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20057","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"Further to my comments, #18 & #19 above (Dec 8, timed at 6:21am, 7:04am): \nProfessor Diana Fulbright has some excellent examples of early complex weaves, text and graphics in her paper: “Akeldama repudiation of Turin Shroud omits evidence from the Judean desert” Diana Fulbright, Frascati Conference May 2010;\nhttp://www.acheiropoietos.info/proceedings/FulbrightAkeldamaWeb.pdf  \nUnfortunately the PDF is secure and it’s not possible to extract any direct copies of he graphics or text from it.  Possibly a contact with Prof Fulbright, might allow the info there to be extracted for Russ’s purpose.\n\n","date":"December 8, 2012 at 5:33 pm","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20061","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Secrets of the Shroud:  What say you all?","post":"One additional among many of the unique data points that are often left out of a general overview “for time/space sake” OR, I’d rather say, most unfairly dismissed by non qualified experts IS, in the most likely hypothesis, the Turin Sindon image is Yeshua’s, his buriers DID follow a Second Temple period burial custom (see John 19:40 and my reconstruction). The specific Judean burial practices to which the Turin Sindon’s man was subjected is the very key to the understanding of the image formation process.\n\n","date":"December 9, 2012 at 10:06 am","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","id":"comment-20093","author":"Max Patrick Hamon","site":"shroudstory"}]
