[{"title":"Ben Wiech’s video about the Justinian coin from AD 692","post":"The images on those coins are really close to the Christ Pantocrator icon that appeared a century before them.  I have a feeling that they were influenced directly by those icons of the Pantocrator that were very popular at the time those coins were produce.  So, it cannot be taken as a clear sign that the artists who made those images did it directly from the image on the Shroud.  But, at the same time, when you take into account those coins, plus the image of Edessa (Mandylion) and the Pantocrator icons (and we can also add some frescos from the Roman catacombs, dating from the 4th century), it make a pretty strong evidence that the Shroud of Turin was already there at that time.  I have a feeling that all those images were made a “model” image (lost and unknown) that was done while the artist was looking at the Shroud.  Or maybe a “model” image never exist but there was some people who had seen the Shroud and gave good and precise testimonies to the artists that did those “sacred” images.  It’s another possibility.  But, personally, I doubt that the Shroud was the direct source of those images.  More an indirect kind of source…  That’s my feeling.\n\n","date":"February 3, 2012 at 2:07 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","id":"comment-7892","author":"Yannick Clément","site":"shroudstory"},{"title":"Ben Wiech’s video about the Justinian coin from AD 692","post":"Oups, I miss one word.  You should read : “I have a feeling that all those images (including the Mandylion) were made FROM a “base model” image (lost and unknown) that was done while the artist was looking at the Shroud.  Or maybe a “model” image never exist but there was some people who had seen the Shroud and gave good and precise testimonies to the artists that did those “sacred” images.”\n\n","date":"February 3, 2012 at 4:32 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","id":"comment-7894","author":"Yannick Clément","site":"shroudstory"},{"title":"Ben Wiech’s video about the Justinian coin from AD 692","post":"Very interesting post, this one and also the previous one on McCrone/Lirey. Great comment too Yannick.. The level of the discussions we are seeing here is really high. Personally, I am learning a lot.\n\n","date":"February 3, 2012 at 5:26 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","id":"comment-7895","author":"Gabriel","site":"shroudstory"},{"title":"Ben Wiech’s video about the Justinian coin from AD 692","post":"Una mejor imagen de un solidus de Justiniano II, este de la colección del “Deutsche Bundesbank”","date":"February 3, 2012 at 6:18 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","id":"comment-7896","author":"co","site":"shroudstory"},{"title":"Ben Wiech’s video about the Justinian coin from AD 692","post":"In my mind I think it’s ‘Highly’ probable that what we have in the coins and in the pantocrator very strong evidence that it was the Shroud that was found in Edessa in the 6th century. During or just prior to Justinian’s reign. Evidence as in the depictions of Christ almost immediately afterward changed to what we now see in the pantocrators and in the coins 100 years later during Justinan II’s reign. Justinian I was the one who ‘rebuilt’ Hagia Sophia (where Christ depictions changed overnight, immediatley after the Edessa discovery), and had St Catherine’s monastery built. He was known to have sent many gifts to St. Catherine’s, maybe including the Pantocrator. I suspect it would be highly likely Justinian dispatched artists to Edessa after learning of the recovery, to either paint many renderings or maybe a “Template” in which all artists could follow. This seems evident considering the multitude of congruence in later depictions and too the Shroud we see today.\nR\n\n","date":"February 3, 2012 at 6:38 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","id":"comment-7897","author":"Ron","site":"shroudstory"},{"title":"Ben Wiech’s video about the Justinian coin from AD 692","post":"Oh almost forgot, about the two slightly different looking coins; I’ve read somewhere where those two coins are different denominations and different sizes, and evidently may have been created by two different stampers or forgeries…explaining the differences, but still quite obviously created from some ‘Master’ template.\n\n","date":"February 3, 2012 at 6:50 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","id":"comment-7898","author":"Ron","site":"shroudstory"},{"title":"Ben Wiech’s video about the Justinian coin from AD 692","post":"THERE IS ABSOLUTELY NO PROOF AT ALL IN THE ANCIENT TEXTS THAT THE SHROUD EVER SPEND ONE SINGLE DAY IN EDESSA.  I have studied the subject deeply and this theory of Ian Wilson is a joke, really…\n\n","date":"February 3, 2012 at 7:01 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","id":"comment-7899","author":"Yannick Clément","site":"shroudstory"},{"title":"Ben Wiech’s video about the Justinian coin from AD 692","post":"You know what I really think Ron ?  I think the Shroud inspired (maybe directly, probably not directly) the creation of the Image of Edessa (also known as the Mandylion, an artwork most probably).  And then, because this Image of Edessa was considered by the faithful as “an image not made by human hands”, his popularity was growing and growing…  And during the iconoclast period (726 to 843), also known as the “quarrel over images”, the Image of Edessa became even more popular amongst those defending the right to venerate the sacred images (like Saint John of Damascus for example who used the Image of Edessa as a “proof” that God permit the veneration of sacred images because his Son even create himself an image on a cloth).  So, because people really thought that this Image was a true miraculous image from Christ, I really feel that it got enough prestige to impose a very popular style among all the depictions of Christ made in the Middle East first, and then, among all the depictions of Christ everywhere.  I have a feeling that this “consolidation” in the depictions of Christ, that start during the second half of the 6th century (the same time that the Image of Edessa appeared suddenly in that city and the first Pantocrator was created) was mainly caused by the high prestige of the Image of Edessa, that was considered a miraculous image made by Christ himself (a false relic that was inspired, in my opinion, directly or indirectly, by the image of the Shroud of Turin).  We also have to take into account the very big popularity of the Pantocrator icons that surely helped the consolidation of the style.  For those icons, again, I also think the face of Christ was inspired, directly or indirectly, by the image of the Shroud of Turin.  So, I really think that the Shroud is responsible for this “consolidation” of the depictions of Christ from the second half of the 6th century and on, but I have a feeling it was only indirectly, from a sketch made directly from the Shroud or from a very precise oral description of the image of the Shroud made by an eye-witness…  One thing’s for sure :  In order to “impose” a main style that was preserved until this day, it must have taken something really important to do so !  And what I can see that his the most likely answer is the growing prestige of the Image of Edessa, the so-called “image not made by human hands”…  So, this “consolidation” in the style of the depictions of Christ came from the Shroud image, but only indirectly, via the Image of Edessa and, probably also, via the Christ Pantocrator icons.  That’s what my exhaustive research on the subject and my long reflection led me.  Now, you’re free to think something else, of course…  But, when you consider all the ancient sources, I don’t think my hypothesis is really more foolish than the one of Wilson !!!\n\n","date":"February 4, 2012 at 12:34 am","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","id":"comment-7908","author":"Yannick Clément","site":"shroudstory"},{"title":"Ben Wiech’s video about the Justinian coin from AD 692","post":"I think your thinking is a litlle more of speculation and/or extrapolation then anyother I’ve heard. There’s alot of “I think” in there Yannick! With very litlle to back it up. You should consider all the ancient sources yourself and not assume no one else has studied this topic in depth. Forget all the squabbling that may have gone on in the past just look at the time-lines and the FACT that the pantocrators and coins match up to Shroud we have today almost to a ‘T’ atleast in a court of law it would be 100%. Then think when did these first appear? When did they find the Mandylion (shroud)? …With very little “extrapolation” I can put the two together. Also the renditions of the cloth are much too perfect in congruence to have been done in any other way then with direct view of the Shroud or of a template of the Shroud.\nR\n\n","date":"February 4, 2012 at 1:46 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","id":"comment-7921","author":"Ron","site":"shroudstory"},{"title":"Ben Wiech’s video about the Justinian coin from AD 692","post":"The double lines for the collar do seem to have a correspondence with the double line creases on the shroud as Dan mentions. They both have a similar inflection (ie a flex in the normal artistically simplified flow of the garment, or if you’re a mathematician the double derivative of line changes sign in the similar way). This isnt that impressive as the flex is almost inevitable in real life but often artists will simplify especially if working on a small scale  like a coin. Why flex when a simple arc would do? I suppose comparing to other contemporary coins of other rulers who help resolve whether the artist went out of his/her way to add the inflection.\nThis does however lead on to a more interesting observation: if the Shroud did exist in 692 AD, and was displayed revealing mainly the head,  such that artists would quite naturally confuse a crease in the cloth of the shroud for the top of a garment worn ( you wouldnt make this mistake if the whole were revealed), would this help support Ian Wilson’s theory that the shroud was displayed folded in 8, just revealing the head.  If one presumes only the head was shown for reasons of convenience of size (the shroud isnt the most convenient of sizes and at 4.4m compares with Jackson Pollack paintings on width and awkwardness on finding suitable displaying venues) and mainly propriety (ie a nude would be scandalous at the time), it is quite understandable that  an artist might confuse the double lines of the crease as a  part of a garment worn by Jesus.\n\n","date":"February 3, 2012 at 7:09 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","id":"comment-7900","author":"ArtScience","site":"shroudstory"},{"title":"Ben Wiech’s video about the Justinian coin from AD 692","post":"This is pure speculation, sorry.  An artist doesn’t need to be confuse as you say in order to create a garment worn by Jesus…  And this idea of Wilson that the Shroud was folded in 8 come from an extrapolation of the ambiguous term “tetradiplon” found ONLY in the manuscript “The acts of Thaddaeus”.  This is the first ever book to add the Mandylion in the Abgar Legend.  Most historians agree that we cannot find no solid historical base in this legend in order to learn something about the real history of the Mandylion.  In fact, this cloth really seem to have “appeared” in Edessa during the second half of the 6th century and no official record was produce about this event.  It really look like the relic just appeared there…  And after the Acts of Thaddaeus, NO other manuscript that tells the story of the Abgar legend use this bizarre term (that seem to have been create for this particular story).  If the author knew the cloth was folded in 8, why he didn’t used another term more clear to say that ?  It really look like a “litterary” creation on the part of this particular author that probably tells nothing about the real dimensions of the cloth.  In fact, in this particular story, Jesus wipe ONLY his face and the author never said one word about the real dimension of the cloth !  HOW CAN SOMEONE THINK THE AUTHOR OF THE TEXT CAN REFER, IN THAT CONTEXT, OF A BURIAL SHROUD THAT IS MORE THAN 4 METERS LONG !!!  It need a very big extrapolation in order to do so and really, it’s completely ludicrous…  And people buy that crap from Wilson simply because they never investigate the subject deeply !  For instence, who knew what I just said about the FACT that this term “tetradiplon” was never used again after the writting of the Acts of Thaddaeus ?  If this term was so important to describe the cloth, don’t you think other writers would have use it ???  On the contrary, the vast majority of those writers (many of which were eye witnesses unlike the author of the Acts of Thaddaeus, which is a purely legendary book) always used terms like a towel in order to show that the cloth had small dimensions…  But people don’t want to see that and prefer to believe the extrapolations and speculations of Wilson and Al.  It’s very sad to see that.  In fact, the more I was searching into the ancient sources, and the more I realised how much bias there was in this theory of Wilson.  It’s incredible.  I cannot say all I want to say about that because I would need 50 pages.  I will just finish with this :  If you got an open mind, trust me, this theory of Wilson (which is no more than a weak hypothesis when you submit it to every ancient source we have) is completely OFF-TRACK !  I hope someone will believe me on this…  I don’t want you to think I’m pretencious or something like that.  I don’t have a theory to defend.  My only goal is to say THE TRUTH, which is not what Wilson and Al. have done over the years (not completely at least) !!!\n\n","date":"February 3, 2012 at 7:34 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","id":"comment-7903","author":"Yannick Clément","site":"shroudstory"},{"title":"Ben Wiech’s video about the Justinian coin from AD 692","post":"Hi Yannick, Oh I’m more than willing to admit pure speculation but its always a good way to start (I’m a pure novice to Shroud studies but sometimes coming from a different background might reveal something…most probably that I’m an complete idiot, but who knows!). I did a very brief google search for ancient coins trying to find collars or lapels with that distinctive flex. Well the first thing that struck me was how rare a frontal portrait was on an ancient coin (rough estimate 1 in 200). I was looking for a double line collar with a flex. I only found one double line so far (google “ancient coins front portrait” near the bottom of the page). I agree with your assertion that an artist could quite easily create such a collar without seeing the shroud, but on viewing the coins I’ve seen on google so far, it mightn’t  be so daft an idea to query whether this might have happened. I’ll just state again what I find peculiar about this collar is that inflection….artists will normally use an economy of means to indicate form (ie a simple arc would have sufficed, so why the flourish of an inflection particularly if you are doing double close  lines where you have to be careful to keep lines roughly same distance apart in a wax original). Just an idea!\n\n","date":"February 3, 2012 at 8:48 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","id":"comment-7906","author":"ArtScience","site":"shroudstory"},{"title":"Ben Wiech’s video about the Justinian coin from AD 692","post":"And what do you think of the collar in this depiction of Christ from the Hagia Sophia basilica in Constantinople that represent precisely the Christ Pantocrator : http://en.wikipedia.org/wiki/File:Jesus-Christ-from-Hagia-Sophia.jpg\nLook pretty much the same to me.  Another important sign that the depiction of Christ on those coins was inspired directly by the Pantocrator icons and not by the Shroud (at least, not directly)…  I think your idea that the collar by represent a clue that the Shroud was folded in 8 is somewhat of a very big stretch of mind.  I would recommand you to be a bit more prudent because speculations like that have great chances to be false in the end.  That could be anything really.  It could just be an artistic choice coming purely from the imagination of the first artist who did the Pantocrator icon (probably the icon that is found today in the Ste-Catherine Monastry in the Sinai desert, dating from the end of the sixth century).\n\n","date":"February 3, 2012 at 9:06 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","id":"comment-7907","author":"Yannick Clément","site":"shroudstory"},{"title":"Ben Wiech’s video about the Justinian coin from AD 692","post":"Hi Yannick,  sorry to disagree but the Christ Pantocrator you reference has a single black line lapel but the image  on the coins have a double line (and they are not fold lines, because horizontal fold lines on the edge of garment wouldnt flow like that through the inflection). I also looked at the the icon from St Catherine’s, and there is no line there at all. I also googled early images of Jesus and again couldnt find any double line lapels (also on coins a rarity). So I do still think one can ask a valid question, did those double lines on the coin get inspired by viewing the Shroud directly or are they just an artist’s whim or perhaps a sign of regality added distinguish a ruller? I dont know what the answer is, but given the relative uniqueness of the double line it seems to beg the question.\nYannick,perhaps you can help me with an unrelated question: where did the two fork like hair strands on the forehead come from, as I see them in many subsequent images of Jesus but they are not on the Shroud as far as I can see? Thanks\n\n","date":"February 4, 2012 at 5:46 am","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","id":"comment-7909","author":"ArtScience","site":"shroudstory"},{"title":"Ben Wiech’s video about the Justinian coin from AD 692","post":"Have you considered Yannick, that the “Mandylion’ which was described so often was actually a copy of the real Shroud that was found in the gates of Edessa? That the ‘real’ Shroud was hidden for various reasons, but the Mandylion was created to have something to show the public? ….just speculation.\n The word “Tetradiplon” is of great importance here, maybe not a common word, but a very discriptive word of what was seen or known. It can’t be disregarded just because it was not used afterward….THAT would be “Ludicrous’…and I don’t know how much clearer a description could be then “folded in eight”!! How would you describe it? Another thing is IF the shroud was folded in eight and covered as described in many drawings; How would anyone know it was anybigger of a cloth?. Not everyone or actually very few would have access to the Mandylion…these things must be taken into account. You have not done so/…that is clear.\nR\n\n","date":"February 4, 2012 at 2:02 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","id":"comment-7922","author":"Ron","site":"shroudstory"},{"title":"Ben Wiech’s video about the Justinian coin from AD 692","post":"What I have discovered in my extensive historical research is that there is less than 1% probability (my estimation of course) for this Mandylion theory to be correct.  Just one single evidence of that (among many) is that there is numerous lists of relics (going from 726 or 730 to 1204) that mention both the Shroud of Christ AND the Mandylion together in the same list !  Now, unless I’m a total fool, this is a proof that those 2 relics are not the same !  You can twist it all you want (and Wilson did that a lot in order to wrote a theory like that… A lot of speculations, extrapolations and so on), but the bottomline is this :  THERE IS ABSOLUTELY NO MENTION IN ANCIENT TEXTS THAT A SHROUD OF CHRIST WAS EVER PRESENT IN EDESSA (unlike Jerusalem, Constantinople and Athena) AND THERE IS ABSOLUTELY NO MENTION IN ANCIENT TEXTS THAT MAKE A CLEAR LINK BETWEEN THE MANDYLION AND A BURIAL CLOTH.  And remember that ALL the artistic depictions of the Mandylion show the image without any blood stains (and some of those depictions were done in the 12th century by artists most probably looking at the Mandylion).  I say all this because I’m disgusted to see how many people have bought this Wilson theory in the Shroud World while the vast majority of the historians outside the Shroud World know full well it is off-track regarding all the ancien documentary and artistic sources we possess today…  I know many people want desperately to believe that the Shroud have a clear and simple ancient history but the reality is this :  Beside the testimony of Robert de Clari in 1204 and the artistic depiction we found in the Pray Codex (dating from 1192 to 1195), there is no clear proofs that the Shroud of Turin was really present anywhere.  But, as I say, there is at least good evidences (not proofs) that the Shroud was present at least from the 4th century on.  And the Mandylion (an artistic forgery in all probability), along with the Pantocrator icons, are part of those evidences because there’s too much points of congruency between those images and the Shroud image to be only due to hasard…\n\n","date":"February 3, 2012 at 7:13 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","id":"comment-7901","author":"Yannick Clément","site":"shroudstory"},{"title":"Ben Wiech’s video about the Justinian coin from AD 692","post":"Yannick you keep forgetting that Wilson’s hypothesis is just that; ‘an hypothesis’ of what writings and evidence he has found. How many of these “other historians” that you mention have done the research Wilson has done? (I’d say none)…How many times has the Shroud and the Mandylion been mentioned in the same list?? and as I’ve pointed to you before in one case the person whom had made up the list may have NOT actually seen one or the other! That is extrapolation, you make! …Again your back to the no blood on the Mandylion,…so what? It is clear the head wounds (blood) is not very discernable when viewed naturally or to distinguise the colour differences, you should know this very well from Barbet’s observations. Especially considering this was back in a time where there was no electric light, just candle light in dark cathedrals….pretty easy to surmise the artists didn’t pick-up on the blood stains….so a weak argument on your part. I understand what you are saying in the sense of actual strong evidence such as the Pray Codex etc; but alot of times evidence is not so clear-cut and deductions’ must be made in the investication of history.\nR\n\n","date":"February 4, 2012 at 2:21 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","id":"comment-7923","author":"Ron","site":"shroudstory"},{"title":"Ben Wiech’s video about the Justinian coin from AD 692","post":"The other observation (very minor) is that the heft sheen on the top side of the beard in the right coin image does correspond to the sheen on the shroud image’s beard (admittedly on the negative image of the Shroud). Doesn’t sound impressive until you have the two images side by side and its about the first thing that catches the eye!\n\n","date":"February 3, 2012 at 7:22 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","id":"comment-7902","author":"ArtScience","site":"shroudstory"},{"title":"Ben Wiech’s video about the Justinian coin from AD 692","post":"Yannick, I dont really know the Mandylion theory, but I do know that even in contemporary times an art object of great value will be hidden away in vaults whilst a poor substitute is displayed (and in times before photography this might go unnoticed and unremarked). I could imagine that  eventually the substitute (the Mandylion) becomes the icon of veneration whilst the original glides along unnoticed and unwanted and so preserved for generations.\n\n","date":"February 3, 2012 at 7:43 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","id":"comment-7904","author":"ArtScience","site":"shroudstory"},{"title":"Ben Wiech’s video about the Justinian coin from AD 692","post":"Ok…  I hope I understand your point.  If I do, it’s pretty much like mine.  What I think is this :  The Shroud was probably kept in Jerusalem for a long time, up until maybe the beginning of the 6th century when it could have been taken to Constantinople while the Palestine had to face 2 successive threats : by the Persians (actual Irak) and just after that, by the Arabs (from Saudi Arabia).  It is a FACT that 3 major relics of the Passion of Christ were taken to Constantinople in 629, between the 2 threads :  The cross, the lance and the sponge.  The ancient sources don’t say a word about the Shroud of Christ but we can think (this is just a supposition based on the historical context) that it could well have followed the same road than those 3 relics around the same time…  What I think is that the Shroud was silently taken to Constantinople during this time of war threads just to protect it and that it stayed there until the sack of the city by the crusaders in 1204.  Why no record exist of a complete body image on the burial Shroud of Christ during all those centuries is THE mystery historian have to face and there’s no satisfying answer for the moment.  The most logical hypothesis is that it was almost always kept into a reliquary and almost nobody knew that there was an image on it.  But this hypothesis is somewhat contradict by those art depictions (Image of Edessa, Pantocrator, Coins, Frescos in catacombs, etc.) that look a lot like the Shroud…  My personal idea is that there was one artist who saw it during the 4th century of before and made a portrait of it.  This unknown portrait was then the fundamental base of all the depictions of Christ from the 6th century and on, while the actual Shroud was kept inside his reliquary.  This is just my 2 cents…  The mystery is huge regarding the fact that there is NO mention of a Shroud of Christ with a body image on it until the testimony of Robert de Clari in 1204 in Constantinople.  VERY HARD TO EXPLAIN.  At least, I gave you one explanation that can be seen as possible, even if it’s not evident at first sight : How in the World some artists would have make a depiction of Christ using the Shroud as the main base while no ancient writer would say nothing about this very particular image that was resting on an important relic of the Passion of Christ ?  This is a real mystery to me, because I really believe the Shroud is authentic !  But I have great difficulty to believe that no ancien writers would not have been tempted to describe the images we see on it…\n\n","date":"February 3, 2012 at 8:12 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","id":"comment-7905","author":"Yannick Clément","site":"shroudstory"},{"title":"Ben Wiech’s video about the Justinian coin from AD 692","post":"“Somewhat contradicts the depictions of the Pantocrator, coin images”!, Yannick that is ludicrous to the extreme! Your theory carries very little weight whatsoever. C’mon Yannick, You would assume along with the cross, lance etc; they brought the ‘Burial Cloth” of Jesus to Constantinople with absolutely no mention? No veneration whatsoever?…the most important finding of all items? I would think more in line that the cloth being what it was; a direct proof of Jesus’s ressurection (to those whom held it), and an item which Jewish law forbid, to have found it’s way out of Jerusalem quickly and quietly,- that means in secret, hense no mention of the Shroud or it’s image in any early writings. Where it was brought no one knows for sure, but we can assert from early writings (maybe just stories but most stories are based on some truths), that it was taken to Eddessa or Antioch-(another theory). But the fact remains the pantocrator depictions started in the mid- 6th century, not earlier and not as late as when the other items were brought to Constantinople.\nR.\n\n","date":"February 4, 2012 at 3:02 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","id":"comment-7925","author":"Ron","site":"shroudstory"},{"title":"Ben Wiech’s video about the Justinian coin from AD 692","post":"The hypothesis I bring forward are just my way to open some possibile explanations to the FACT that the Shroud was a different relic than the Mandylion.  I think what can explain the FACT that there is no report at all in ancient texts about the presence of a body image on the cloth is because this relic was almost constently preserved in his reliquary and was never showed publicly.  This is the only logical explanation I can see for the lack of testimonies until 1203 when Robert de Clari report he had seen a Shroud of Christ with a complete body image on it.  And I have this to say to you :  If you don’t consider a fact a bunch of lists of relics (not just one or two) stating clearly that there was a Shroud AND a Mandylion in Constantinople a fact, I don’t know what to think.  And your idea that the Mandylion that was showed in Constantinople was just a copy is contradict by the testimony of John of Damascus who wrote in 726 or 730 an important document in which we found a clear mention of the Mandylion (with a link with the Abgar legend) AND, elsewhere in the SAME document, a clear mention of the Shroud of Christ, along with many other relics of the Passion of Christ that were all found later in lists of relics from Constantinople !!!  I remember you that Wilson hypothesis that they made a copy of the Mandylion says that it was only done AFTER the cloth arrived in Constantinople in 944, while some person, supposetely, would had noticed that it was a burial Shroud (a great fact that would have stayed in the shadows and never recorded in a text !!!), then the copy of the Mandylion would have been made in order to preserve the Abgar legend.  That’s the speculation of Wilson and his followers.  Sorry but this text of Damascus was written 2 centuries prior to the arrival of the Mandylion in Constantinople !!!!  And let me remind you that this guy was no fool !  He his consider one of the doctor of the Church and he’s a Saint.  Not the kind of guy from a street corner that can say anything.  We can trust what he said.  And what he said is this :  During his time, he was aware that there was a so-called miraculous image in Edessa (linked to the Abgar legend) AND, at the same time, he was aware that the Christians were venerated many relics of the Passion of Christ, among them was a Shroud of Christ along with strips of linen, and that those relics of the Passion had NOTHING to do with the Mandylion !  The only bizarre thing about that his the fact that Damascus don’t seem to be aware of the presence of a full body image on this Shroud of Christ, just like the totality of the ancient writers prior to Robert de Clari… Again, the only logical explanation that can fit with all the ancient sources we have is that this Shroud of Christ was constently preserved in a closed casket and was never showed to the public (maybe because the keepers of the relic were aware of the real nature of the relic and knew that showing an image of Jesus dead with a lot of injuries and blood stains would have been considered sacrilegeous at the time).   And the fact that Damascus list of relics is almost the same as many lists of relics from Constantinople (like the list of Robert de Clari and even the list of relics contain in the document made when saint Louis bought 22 relics from the emperor of Constantinople in 1247).  This good match up is a good evidence that the Shroud we found in Damascus list is probably the same we found later in Constantinople’s lists of relics and the same that was seen by Robert de Clari in 1203, just prior to the sack of Constantinople.  And, when we take the Pray Codex artwork into account, we then have a good probability that the Shroud from Damascus list (writen in 726 or 730) was really the Shroud of Turin !  It is a probability of course, and not a certainty.  And the bottomline is this :  For Damascus, this Shroud was completely different and completely unrelated with the Mandylion of the Abgar legend !!!!  SO, I HOPE YOU WILL MEDITATE OF ALL THIS WITH AN OPEN-MIND…  This is true to all the readers too…\n\n","date":"February 4, 2012 at 8:50 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","id":"comment-7938","author":"Yannick Clément","site":"shroudstory"},{"title":"Ben Wiech’s video about the Justinian coin from AD 692","post":"\nArtScience :Hi Yannick, Oh I’m more than willing to admit pure speculation but its always a good way to start (I’m a pure novice to Shroud studies but sometimes coming from a different background might reveal something…most probably that I’m an complete idiot, but who knows!). I did a very brief google search for ancient coins trying to find collars or lapels with that distinctive flex. Well the first thing that struck me was how rare a frontal portrait was on an ancient coin (rough estimate 1 in 200). I was looking for a double line collar with a flex. I only found one double line so far (google “ancient coins front portrait” near the bottom of the page). I agree with your assertion that an artist could quite easily create such a collar without seeing the shroud, but on viewing the coins I’ve seen on google so far, it mightn’t be so daft an idea to query whether this might have happened. I’ll just state again what I find peculiar about this collar is that inflection….artists will normally use an economy of means to indicate form (ie a simple arc would have sufficed, so why the flourish of an inflection particularly if you are doing double close lines where you have to be careful to keep lines roughly same distance apart in a wax original). Just an idea!\nArtScience- I think both your observations are well warranted and your not alone in your observations. Many others have noticed these ‘clues’ and your theory that the artist’s may have confused the creases as such, is also very telling and a most probable assertion; (At the very least it makes sense), seeing as we know the image would be very faint and covered below that point. This we know as fact from the many paintings we have of the Mandylion. There is also the main ‘clue’ in that the Mandylion was of a ‘landscape’ design as opposed to the more typical ‘portrait’ setting, as would ‘always’ be used by artists of any era.\nR\n\n","date":"February 6, 2012 at 1:15 am","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","id":"comment-7969","author":"Ron","site":"shroudstory"},{"title":"Ben Wiech’s video about the Justinian coin from AD 692","post":"Readers of this blog shoud check out the document: “CHAPTER I. Acheiropoietos Jesus Images in Constantinople: the Documentary Evidence***Daniel C. Scavone, University of Southern Indiana (6/21/96; 4/23/01;2-25-04; 11-24-04, 12-02-05, 01-03-06, 10-07-2006″ accessible on http://www.scribd.com.\nNote that Scavone is an independent authority who is doing a lot more than just echoing Ian Wilson’s theory.  He gives a detailed exposition of the case.\nScavone makes a highly authoritative and well-documented case for the Mandylion and Shroud being the same object. He notes that there are several comments about the Mandylion being blood-stained, notwithstanding that copies of the Mandylion on icons might not be shown as blood-stained. He further observes that although the anniversary of the arrival of the Mandylion in Constantinople was universally celebrated in Eastern Christianity, there was no such celebration for the arrival of the Sindon. This is a further indication that they were one and the same object.\nYannick’s plea for an OPEN MIND is something he might try applying to himself.  However, I fear he has already made up his mind that they were two separate objects, and no amount of rational argument will change a CLOSED MIND on any topic!\n\n","date":"February 6, 2012 at 2:38 am","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","id":"comment-7970","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Ben Wiech’s video about the Justinian coin from AD 692","post":"I can’t seem to be able to open that document you talk of Dave ;- (   …Nevertheless the whole topic of “No blood on the Mandylion paintings” is a nonsensical argument, that needs no explaination…Do ANY of the Pantocrator paintings show any blood? …absolutely not, so why would it be expected to be on any Mandylion depictions?…again this argument is nonsensical and not based on any logic.\nR\n\n","date":"February 6, 2012 at 1:22 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","id":"comment-7989","author":"Ron","site":"shroudstory"},{"title":"Ben Wiech’s video about the Justinian coin from AD 692","post":"Ron, full URL for Scavone’s paper is:\nhttp://www.scribd.com/slavisa_jevtic/d/66288478-1 \nScavone makes the point that there are a number of comments by observers of the Mandylion that it seemed to be blood-stained.  One of the arguments used by Yannick for there being two separate objects, seems to be that various icons known to be modelled on the Mandylion show they have not copied the blood-stains.  Therefore he says the Mandylion can’t be the Shroud, otherwise the blood-stains would be shown on the icons.  I agree with you that his argument is tenuous to put it kindly.  Point is, that there were apparently bloodstains on the Mandylion.\nThis is only one incidental point that Scavone mentions, and his paper is a fairly solid effort and a heavy read, but if you can access it, you might want to download it, for a complete authoritative coverage as to why the Mandylion and Shroud were one and the same object.\n\n","date":"February 6, 2012 at 3:45 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","id":"comment-7998","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Ben Wiech’s video about the Justinian coin from AD 692","post":"It’s very interesting that most of the early christian and Hebrew images found deep inside the catacombs of Rome show them to be black people. Does that mean Rome was originally a black dominated nation? I read that Africans or black people were the first to settle in Europe, including southern Europe where Rome is located. The ancient Hebrews, I know, were black people. But does it mean Hebrews were of significant numbers in ancient Rome, too? Here are some links: \n1. https://www.facebook.com/photo.php?fbid=10151781501217436&set=a.10150653864112436.415633.519477435&type=1&theater \n2. http://www.jesuswalk.com/christian-symbols/\nEarly Christian Symbols of the Ancient Church from the Catacombs\nhttp://www.jesuswalk.com \n3. http://www.egyptsearch.com/forums/ultimatebb.cgi?ubb=get_topic;f=15;t=001894 EgyptSearch Forums: Hebrews and black women\nhttp://www.egyptsearch.com   \n4. https://www.facebook.com/#!/photo.php?fbid=10151781749267436&set=a.10150653864112436.415633.519477435&type=1&theater \n5. https://www.facebook.com/#!/photo.php?fbid=10151781713617436&set=a.10150653864112436.415633.519477435&type=1&theater  \n6. https://www.facebook.com/#!/photo.php?fbid=10151781605982436&set=a.10150653864112436.415633.519477435&type=1&theater\n7. https://www.facebook.com/#!/photo.php?fbid=10151781747972436&set=a.10150653864112436.415633.519477435&type=1&theater  \n8. http://www.youtube.com/watch?v=Mo4eoIt9Kuw    \n9. http://sarabe3.tripod.com/israeliteimages.html   \n10. The world’s first civilizations were all black civilizations \n                 http://www.realhistoryww.com\n\n","date":"August 15, 2013 at 7:20 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","id":"comment-41368","author":"Amah Jones","site":"shroudstory"}]
