[{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"Good shot (and quite predictable), Mario, but still inconclusive.\nI could give you some advice re persons involved with this coffer, but there is something more important you missed in recent post:\nT3) The letter of Theodore Angelus to Innocent III (allegedly 1205), mentioning: “the most sacred of all, the linen in which our Lord Jesus Christ was wrapped after his death and before the resurrection […] in Athens.” Some (for example Nicolotti) maintain its 18th century forgery. The letter comes from Palermo, Sicily, almost 1000 miles away from Besancon.\nhttps://shroudstory.wordpress.com/about/acheiropoietos-jesus-images-in-constantinople-the-documentary-evidence/\n(Document XV).\nThe document was rediscovered in 1981, but is much older. It was once a part of so called Chartularium Culisanense codex from Palermo, a codex of document of Saint Sophia Order, associated with Sicilian de Angelis family. The Chartularium itself was lost during WWII, but there was a 18th century transcript of some documents (including the letter to Innocent III), testified in 1859 by Benedetto d’Acquisto, arcibishop of Montreal, and former abbot at Monte Casino, considered distinguished humanist. The document is spurious, and as a copy, it is likely interpolated. But that’s not so important, as the info it contains about sacred linen in Athens in 1205. This is consistent with Otto theory.\n\n","date":"December 1, 2015 at 6:14 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215413","author":"O.K.","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"Daniel Raffard de Brienne believed that the Shroud was in the hands of Otho de la Roche in 1205, that it remained there till the fourteenth century, and was taken to France by the last Duke of Athens.\nHe dismissed the Knights Templar hypothesis, on which I am working, with a better plate, going a bit further than Ian Wilson’s contention, as proposed in his last Shroud book:\nhttps://www.academia.edu/9156258/Shroud_Studies_in_France\n\n","date":"December 1, 2015 at 8:22 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215421","author":"Louis","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"Yes, Daniel Raffard de Brienne († 2007) in his “Dictionnaire du Linceul de Turin”, pp. 12-15, clearly shows his preferences for the theory of Othon in possession of the Shroud in Athens.  But he also stated his preference for the Shroud to have been brought back to France, after 1311, by one of his ancestors, the wife of Gautier V de Brienne, and his son Gautier VI would have given it to Geoffroy de Charny. But there is no tradition or document to support that route, except the letter of Theodore Angelos discovered in 1981 by Pasquale Rinaldi, but whose authenticity has been questioned (e.g., Karlheinz Dietz, Andrea Nicolotti). We could think that Daniel Raffard de Brienne favored the theory of Othon because it would made his family as part of the story of the Shroud. But again, I believe that Othon de la Roche is a dead end for many reasons.\nAs for the Templars to have been involved with the Shroud: it is largely based on suppositions, and I am afraid, another major misleading route. By the way, I am surprised that researchers proposing the Templars as owner of the Shroud have never (as far as I know) cited the translation of the relics from Constantinople to Paris as a probable path for the acquisition of the Shroud by the Templars. It is indeed related, in the story of the translation of the relics to Paris, that the Templars in Syria kept several relics deposited by Baudoin II in exchange for financial help. These relics were transferred to Paris after Saint Louis financially help Baudoin II. But the Templars could have extracted the Shroud from one of the reliquary, the Mandylion reliquary, so that an empty Mandylion reliquary arrived in Paris! That would be a nice story. But I do not believe it at all. But one thing that needs to be pointed out: the translation of the relics from Constantinople to Paris do not appear to have been studied by the researchers proposing the Templars as owning the Shroud, because they could base it on these documents.\nYou can spend a lifetime researching misleading routes (because they never lead to a solid solution), so better avoid them, and instead follow the ones that appear most likely given the documents we have that are surely authentic. We have statements from the clerics of Lirey (Philippe VI gave the Shroud to Geoffroy de Charny), the statements made by the son and granddaughter of Geoffroy de Charny (son: a gift, granddaughter: acquired from war). These statements should not be contradicted unless solid reasons are given. In which occasion would Geoffroy de Charny receives the Shroud as a gift and due to his war services to king Philippe VI (and most probably from a relic taken from the Sainte-Chapelle, documents: inventories of the Sainte-Chapelle)? That is a more fruitful route coherent with an authentic tradition and documents.\n\n","date":"December 2, 2015 at 2:41 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215468","author":"Mario Latendresse","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"If the Shroud would have been transferred from Constantinople to Paris with all the other relics Saint Louis got from Baudouin II, then, in all logic, this would have been this relic that would have been presented by the king as the most precious of all instead of the crown of thorns.  The fact that, historically, it was the crown of thorns indicates that there was most probably no burial cloth with a body imprint of Jesus in that batch of relics…  \nHere, we must remember that, based on the account of Robert de Clari, the most precious relic in Constantinople at the time of the 4th crusade was, without a doubt, this burial cloth of Jesus and not the crown of thorns.  Effectively, Robert de Clari was clear about the fact that this was THE relic that was exposed each week in Constantinople and not any other relics related with Jesus…\nIf the Shroud was really in the hands of Philippe VI at one point (this is far from being proven), it is more likely that such a precious relic would have reached Paris at another time and through a different path.\n\n","date":"December 2, 2015 at 10:43 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215484","author":"Joe","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"De Clari says nowhere that the cloth he saw in the Blachernae church was the most precious relic in Constantinople. In this particular church it was the famous icon of the Virgin which, it was claimed, saved the city from capture in 626. De Clari does not mention whether the cloth he saw was subject to the major processions before the crowds that the icon was.\nThe relics in the Pharos Cahpel in the imperial palace were much more important than any of the ‘shrouds’ mentioned in the documents. You can find,online, the important survey of these relics by Holgar Klein,’ Sacred Relics and Imperial Ceremonies at the Great Palace of Constantinople’. You will see that no shroud comes anywhere among the relics that were incorporated in the major imperial ceremonies.\nIt was the public processional display of a relic that marked its importance, that or its incorporation into one of the major imperial rituals such as the coronation of the emperor.\nThe Savoys did manage to incorporate the Shroud into their ducal rituals, both religious and familial ( e.g weddings.).\n\n","date":"December 2, 2015 at 11:23 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215489","author":"Charles Freeman","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"Quote: “It was the public processional display of a relic that marked its importance…”\nEXACTLY!  Taking this as a fact, then we MUST conclude that, during the time of the 4th Crusade, the Shroud of Christ was truly among the most precious relics of the city, because it was put on public display EACH FRIDAY!  As I know, this is a unique case for a relic of Christ during that time of turmoil in Constantinople and that, alone, is enough to prove the great importance it got in the eyes of the Emperor…\n\n","date":"December 2, 2015 at 11:33 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215490","author":"Joe","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"And if the Shroud would have been among the batch of relics Saint Louis got from Baudouin II, we would have clear textual mentions of such a transfer, just like we got clear textual mentions of the transfer of the crown of thorns.  Because there’s no such thing, we must conclude that, most probably, the Shroud Robert de Clari saw in Constantinople was not among the relics of Saint Louis…\n\n","date":"December 2, 2015 at 11:35 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215491","author":"Joe","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"Joe- some relics were on permanent display-as they still are in many Catholic Churches.The fact that it was brought out on a Friday but is nowhere else listed or mentioned in any other relic list suggests that it was not seen as especially important. As I have said it was the icon of the Virgin which was this church’s top relic and it was exhibited in procession.\nRemember also that the Blachernae church was outside the walls of Constantinople. It was an important shrine because of the icon which had been there since the fifth century but we would have known from the documentary record if the shroud there was considered important. Just because de Clari saw what appears to have been a single, not a double, image does not make it important\nDo read Klein as he is good on what WAS important among the prestige relics of the imperial family.\n\n","date":"December 3, 2015 at 2:17 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215523","author":"Charles Freeman","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"Charles wrote: “Just because de Clari saw what appears to have been a single, not a double, image does not make it important.”\nWhat makes it important is the FACT that, during the time the crusaders were surrounding the city, this was this particular relic (and not something else) that was displayed each friday…  This is the reason why this relic, at that particular point in time, had reached a very particular and, no doubt, a very important status for the city and the imperial court.  Note that Robert de Clari talked also about the Mandylion, which was kept elsewhere in the city and which was, at that time, not placed in public display, on the contrary to the Shroud…\nLast thing: A shroud of Christ is often mention in lists of relics from Constantinople.  The fact that none of these lists mentioned an image on it doesn’t prove that this was a different shoud than the one Robert de Clari saw in public display.  We can think that, if none of these lists talked about an image, it can well be due to the simple fact that the pilgrims only saw the reliquary and not the actual cloth.  And since we must wait for the testimony of de Clari to see the mention of an image, we can think that, prior to the 4th Crusade, the body image on that Shroud never was placed in public display.  Also, based on the testimony of de Clari alone, I don’t think we can reach a solid conclusion on whether there was a single or a double body image on this particular cloth.\n\n","date":"December 3, 2015 at 10:44 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215557","author":"Joe","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"Charles, you wrote “Remember also that the Blachernae church was outside the walls of Constantinople.”\nYes, at the time the Blachernae church was outside the  walls of Theodosius II (but later the walls were modified to include it inside the city). We can conjecture that the reason the unfolded Mandylion was shown at the Blachernae church was to keep the Latin outside the city as much as possible. Robert Clari only describes the reliquary of the Mandylion (a cloth) hanging in the Pharos Chapel. How come we do not have a description of that cloth? Because he did not see it in the Pharos Chapel …\n\n","date":"December 3, 2015 at 12:22 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215568","author":"Mario Latendresse","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"The Mandylion never was considered as a relic of the passion…  The Mandylion and the Shroud were 2 separate objects.  But here, people want to see both cloths as the same objects, nevermind the tons of evidence against such a wrong hypothesis.\n\n","date":"December 3, 2015 at 1:03 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215573","author":"Joe","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"Personaly, I don’t think the Shroud ever got to Paris, because if it would have reached the capital in the hands of one of the king of France during the 13th or 14th Century, we would have clear textual mentions of the arrival of such a great relic in Paris, just like we got clear textual mentions of the arrival of the crown of thorns in Paris in the hands of Saint Louis in August, 1239…\n\n","date":"December 2, 2015 at 10:52 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215485","author":"Joe","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"Joe, did the Mandylion reached the Sainte-Chapelle of Paris or not?\n\n","date":"December 3, 2015 at 9:58 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215553","author":"Mario Latendresse","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"For me (and most historians), yes.  But this was a different relic than the Shroud.  It wasn’t a relic of the passion and that’s probably why the crown of thorns was considered by Saint Louis as having much more value.\n\n","date":"December 3, 2015 at 10:36 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215555","author":"Joe","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"Joe, you wrote “It wasn’t a relic of the passion”.\nIn the chronicle of the translation of some of the relics written by Gérard de Saint-Quentin-en-l’Isle, the Mandylion reliquary is described as tabula quedam quam, cum deponeretur Dominus de cruce, ejus facies tetigit[p. 298, Miller, 1878] (a board that touched the face of the Lord, when he was laid down from the cross)\nHe was describing the reliquary that contains the Mandylion, and clearly he thought this was used during the Passion of Christ. How clearer can it get?\n\n","date":"December 3, 2015 at 12:28 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215569","author":"Mario Latendresse","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"When I wrote “never was considered a relic of the passion”, I talked about the time the Mandylion was kept in Constantinople.\nIf you base your judgment about this issue on one single text, while discarding all the other evidences against the idea that the Mandylion was a burial cloth, that’s no good.  Also, the fact that the person who wrote the description you mention never talked specifically about bloodstains being present on the face open the door to a lot of interpretations…\n\n","date":"December 3, 2015 at 1:07 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215574","author":"Joe","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"Joe, you wrote “For me (and most historians), yes”. \nAnd on which documents do you base this affirmation? How do you know the Mandylion reached the Sainte-Chapelle of Paris?\n\n","date":"December 3, 2015 at 3:01 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215579","author":"Mario Latendresse","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"Most historians who studied this issue agree that a Mandylion was part of the Golden Bull of Baudouin II, which described all the relics he sold to Saint Louis. Of course, the description is not 100% clear about that, but most historians (I’m not talking about Shroud researchers like you, Wilson or others) reached that conclusion.\n\n","date":"December 3, 2015 at 3:35 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215580","author":"Joe","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"Another important factor to consider concerning Mr. Latendresse claim, is this : If Geoffroy de Charny would have got the Shroud from the king of France, we would certainly have a lot of textual mentions of such a royal transfer, which is simply not the case!  If the relic would have come from the king himself, Geoffroy would certainly have use this fact to legitimate the exhibitions of the Shroud he did in his new chapel… Most historians agree about the fact that, on the contrary, Geoffroy (or his relatives) did not wanted to let anyone know where and when he got this relic.\n\n","date":"December 2, 2015 at 11:08 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215486","author":"Joe","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"Joe, (please, what is your full name?),\nThe “shroud of Christ” was not considered the most precious relic at Constantinople. You can see it from the history of the relics in that city.\nYou have to study in details many documents, including the translation of the relics from Constantinople to Paris, how the relics were kept at the Sainte-Chapelle of Paris, and all inventories of the relics at the Sainte-Chapelle to understand the scenario that the Shroud may very well have gone through the Sainte-Chapelle without being noticed. Without this study, it is not possible to answer all your questions.\nPlease see http://www.sindonology.org/sainte-chapelle.shtml\nRemember this very basic fact well proven by history: the Latin (the West) did not know anything about the Mandylion by the time they reach Constantinople in 1204. And that goes on at least for another century or two. The West even create its own story about the image of christ (known as the Mandylion in the East): the Veronica.\n\n","date":"December 2, 2015 at 11:54 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215493","author":"Mario Latendresse","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"At the time the Crusaders were surrounding the city, I think it’s fair to say that the Shroud of Christ was the most precious relic.  At that point in time, it was probably bigger in importance versus the Mandylion.  And if that Shroud would have been transferred by Saint Louis to Paris with the Crown of Thorns, it would have made at the very least the same big noise, which is not the case…  People can ask: Then why the Mandylion did not also make a big noise at that time? The most probable answer is it is because this relic was not a relic of the Passion (which is easy to conclude when you look at the most ancient depictions of the Mandylion), on the contrary to the Crown of Thorns, which indicates the superiority of relics associated directly to the Passion of Christ for that place (Europe) and that time (beginning of the 13th Century) versus all the other relics, including the Mandylion.\n\n","date":"December 2, 2015 at 1:23 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215499","author":"Joe","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"Considering the historical context, I firmly believe that Geoffroy de Charny got the Shroud in secret, very quietly, which can indicates that he got it without the king of France or any other important people from the French court being involved.\n\n","date":"December 2, 2015 at 1:27 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215500","author":"Joe","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"People should note that, from the moment Geoffroy got the Shroud, its authenticity was always questioned, which is enough to understand that the king of France had nothing to do with the arrival of the Shroud in Lirey…\n\n","date":"December 2, 2015 at 1:31 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215502","author":"Joe","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"Also, people should understand that it’s not what happened for relics like the Crown of Thorns, for the good reason it has been transferred to Paris directly by the king of France himself… \nSo, if Geoffroy would have got the Shroud from the king, its authenticity would not have been questioned in the manner it has been.\n\n","date":"December 2, 2015 at 1:34 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215503","author":"Joe","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"Directed to Mario Latendresse\nAlthough I am not a trained historian like Ian Wilson (MA, Oxon) I studied history for two years in college and began writing on the topic soon after that, beginning with two articles published in a major daily, one of which is preserved in the library of one of the world’s top universities. The other one was sent to the Vatican Secretary of State, without my knowledge, because the topic involved both Church and State and there were people trying to influence a decision that had to be taken in Rome. Whatever the discussions there, the decision they took was in favour of the line I was pursuing.\nI would not that be that harsh with Daniel Raffard de Brienne. He wrote for the best history magazines in France and was always frank with me. He did not really believe that the Knights Templar possessed the Shroud and it is possible, repeat, possible, that he was thinking about his ancestor Gauthier V de Brienne, who was the Duke of Athens, but it did not influence his views when we were discussing the topic.\nIf we look at it that way, my great-great grandfather, a member of the Portuguese parliament in the 1840s, received the title “young nobleman” and awarded Knight of the “Ordem Militar de Cristo”, the Order of Christ — to which greats like Vasco da Gama, Ferdinand Magellan, Pedro Álvares Cabral belonged — by the King of Portugal. The Knights Templar were reconstituted in Portugal, becoming the Knights of Christ. That was what the Portuguese King Diniz insisted on when he took the matter to Pope John XXI.\nIt does not in any way influence my decision to research the Templar hypothesis. I agree with Ian Wilson that the the historical group “fits the requirements with uncanny precision.”\nThe Image of Edessa/Shroud was stolen during the Fourth Crusade, in 1204:   https://www.academia.edu/7447446/Was_there_a_link_between_the_Knights_Templar_and_the_Turin_Shroud_An_interview_with_Dr._Barbara_Frale\nIt was the Order of Knights Templar, not the Hospitalers, who guarded the relics and the Templars had heavily guarded monastery-fortresses. You have mentioned “statements” and this nothing more than hearsay.\nMy next Shroud article will be on the Templars.\n\n","date":"December 2, 2015 at 12:13 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215495","author":"Louis","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"For Daniel Raffard de Brienne, I do not think it was harsh, I was pointing out that the scenario he promoted for the transfer of the Shroud from Greece to France involved explicitly one of his ancestors. That scenario has been promoted *only* by him.\nAs for the statements, they are not “hearsay”! They are supported by written documents for which there is no controversy of their authenticity. The statement about Philippe VI giving the Shroud to Geoffroy de Charny is from a manuscript written by a cleric of the collegiate of Lirey around 1525. We have four copies of this document kept in the archives of BnF and AnF (Paris). The statement by Marguerite de Charny that it was “acquired” or “obtained” by his grandfather was recorded in a court document (I should amend here my previous statement that was using the word “war”, a slip of my tongue, no such thing is implied by Marguerite). The statement by the son of Geoffroy de Charny that the Shroud was a “gift” (sibi liberaliter oblatam), was written by the son in a Bull to pope Clement VII.\n\n","date":"December 3, 2015 at 12:41 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215520","author":"Mario Latendresse","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"Daniel Raffard de Brienne never mentioned his ancestor to me and the closest he got to involving Gauthier was when he said that he was looking for a correspondent in Athens who could search the archives there. Other “Shroudies” were stressing the link he is supposed to have made between Athens and Lirey by placing his ancestor in between.\nThe documents you cite do not mean much, in that the question about what happened between 1204 and the years that Philippe VI ( 1293-1350) was in power is not answered. We need more information because it was easy to say that the relic was “gifted” or “acquired”, but what exactly happened before that?\nThat is the reason I am pursuing the Knights Templar as the possible owners of the Shroud. We know that they did not take part in the Fourth Crusade. Who did were the French and Italian mercenaries paid by Enrico Dandolo, the Doge of Venice. Yet, the Templars had spies in Constantinople.\nWhy did they keep quiet if they possessed the relic? Was it because Pope Innocent III sent a letter to the mercenaries telling them that they had been excommunicated? The Pope knew that relics were being stolen. See question two and the response:  https://www.academia.edu/7447446/Was_there_a_link_between_the_Knights_Templar_and_the_Turin_Shroud_An_interview_with_Dr._Barbara_Frale\n\n","date":"December 3, 2015 at 8:25 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215543","author":"Louis","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"Quote: “The statement about Philippe VI giving the Shroud to Geoffroy de Charny is from a manuscript written by a cleric of the collegiate of Lirey around 1525.”\nThis is 200 years after the events!  Even if the authenticity of the manuscript in which we can find such a claim is valid, no way you can claim that this is absolute truth! \nThe simple FACT that the authenticity of Shroud displayed by Geoffroy was questioned from the beginning and always was afterward is enough to understand that he did not got it from the king of France.  Or else, that question of authenticity would never have been raised, especially by some French bishop…\n\n","date":"December 3, 2015 at 9:32 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215547","author":"Joe","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"The simple fact that the authenticity of Geoffroy’s Shroud was questioned from the start is enough to understand that, most probably, he did not got it through an official way…  And the fact that no one seemed to have a clue about it’s previous journey before its arrival in Lirey is another good clue that back-up my conclusion.  The silence of Geoffroy and his family about that is also another good clue.  Note that no one in his family ever mention a clear history of this Shroud before it felt in Geoffroy’s hands…\n\n","date":"December 3, 2015 at 9:38 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215548","author":"Joe","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"Louis, you wrote “Other “Shroudies” were stressing the link he is supposed to have made between Athens and Lirey by placing his ancestor in between.”\nIt is not other “Shroudies” who stressed that link, it is Daniel Raffard de Brienne who did. You wrote “he is supposed”. This is not the case, he is the first one who explicitly proposed and described that link in details in his “Dictionnaire”. This is not a supposition.\nOne of the important implications of Geoffroy II de Charny and Marguerite de Charny’s statement is that the Shroud does not come from Jeanne de Vergy. And that is coherent with other documents we have. I also do not see no any document or solid arguments to disprove the statement from the clerics of Lirey that Philippe VI gave the Shroud to Geoffroy de Charny. This is an important link. What comes before is obviously an open question.\nYou wrote “Was it because Pope Innocent III sent a letter to the mercenaries telling them that they had been excommunicated?”\nWhich “mercenaries”? Are you referring to the Templars as “mercenaries”? Supposing any such letter would contradict other known authentic documents. The Templars were involved in helping keep some relics that were in Constantinople. And this is not a supposition, this is a documented fact.\n\n","date":"December 3, 2015 at 9:38 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215549","author":"Mario Latendresse","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"Hello Mario\nDaniel Raffard de Brienne and myself discussed some things at length, only part of which has been published. He also dwelt on the Round Table convened by Cardinal Severino Poletto in Turin, at which he was present, together with Ian Wilson, Father Heinrich Pfeiffer, Professor Avinoam Danin and others. He was still President of CIELT then and the organisation’s newsletter was still being published, in fact he mentioned my interview with Father Pfeiffer, on the Manoppello veil and the Shroud, in one of the issues.\nI have no copy of the “Dictionnaire”, only a book he wrote about the theory of evolution and two booklets, based on his highly conservative way of thinking. Sometimes people are afraid of what they tell journalists and, consequently, of what may be published, so I suppose that objections to the ancestor theory had already been raised, and he may have thought it wise to keep quiet about it.\nI, for one, have always kept confidential whatever information is given to me, publishing only that for which permission has been given in order to not put people into trouble.\nAs you may have seen, it is precisely what you call an “open question” that I am dwelling on, the reason for a small piece on the Knights Templar that is being written, going just a small step further than what Ian Wilson has published.\nThe mercenaries I referred to were the French and Italians on the payroll of the Doge of Venice, obviously not the Templars. It is these mercenaries who were stealing the relics. Perhaps some of those that reached Rome were among the pieces that were returned by Pope John Paul II to Patriarch Bartholomew I of Istanbul.\n\n","date":"December 3, 2015 at 10:28 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215554","author":"Louis","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"Anyone who hasn’t studied the vast Ray sur Soane\nData is wasting their time, please believe me !!!\nGoogle : Eugene Ray / Shroud of Turin\n\n","date":"December 1, 2015 at 6:41 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215452","author":"Eugene Ray","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"Mario Latendresse wrote :\n>…In which occasion would Geoffroy de Charny\nreceives the Shroud as a gift and due to\nhis war services to king Philippe VI (and\nmost probably from a relic taken from the\nSainte-Chapelle, documents: inventories\nof the Sainte-Chapelle)? …\nSo…\nI cannot resist to the temptation to quote\n“The Shroud of Turin and the Sainte-Chapelle of Paris”,\na text written by the same person,\nMario Latendresse:\n>In the chronicle of the translation of\nsome of the relics written by Gérard de\nSaint-Quentin-en-l’Isle, the Mandylion is\ndescribed as “tabula quedam quam, cum\ndeponeretur Dominus de cruce, ejus facies tetigit”\n[p. 298, Miller, 1878] (= a board that touched\nthe face of the Lord, when he was laid\ndown from the cross).\nLink:\nhttp://www.sindonology.org/sainte-chapelle.shtml\nThen I am curious to find more robust proofs\n(than “The sequences De sanctis reliquiis as\nSainte-Chapelle inventories” by Karen Gould.\n[In:] Mediaeval Studies [Toronto:\nPontifical Institute of mediaeval studies,\nBd. 43 (1981), S. 315-341])\nabout that strange\n“board that touched the face of the Lord”…!\n— — —\nHere another vague\nbibliographic reference: \n“Sacre impronte e oggetti non fatti da\nmano d’uomo nelle religioni. Atti del\nconvegno internazionale, Torino, 18-20 maggio 2010”\nby\nAdele Monaci Castagno\nUniversità di Torino, 2011 – 323 pages.\n\n","date":"December 3, 2015 at 10:40 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215556","author":"piero","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"Piero,\nYou wrote:\n“Then I am curious to find more robust proofs\n(than “The sequences De sanctis reliquiis as\nSainte-Chapelle inventories” by Karen Gould.\n[In:] Mediaeval Studies [Toronto:\nPontifical Institute of mediaeval studies,\nBd. 43 (1981), S. 315-341])\nabout that strange\n“board that touched the face of the Lord”…!”\nI do not quite understand what you wrote: you want a more robust proof of what? The paper by Karen Gould has indeed many details about the relics that were in the Sainte-Chapelle of Paris in the Grande Châsse.  But a proof of what? That this description of Gérard de\nSaint-Quentin-en-l’Isle was the reliquary of the Mandylion? There is a simple proof: if you match all description of relics and reliquaries given by  Saint-Quentin-en-l’Isle, the only one that can correspond to the Mandylion reliquary is that one.\n\n","date":"December 3, 2015 at 2:00 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215576","author":"Mario Latendresse","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"Well, Joe (who cannot even post with a real identity), we have reached the bottom of the baril. It is obvious to me that you have not even researched the subject. Your answer (among others)\n“Most historians who studied this issue agree that a Mandylion was part of the Golden Bull of Baudouin II, which described all the relics he sold to Saint Louis. Of course, the description is not 100% clear about that, but most historians (I’m not talking about Shroud researchers like you, Wilson or others) reached that conclusion.”\nmeans that you believe and repeat what others have written without even reading on why they reach such a conclusion. You do not know why they stated that the Mandylion reached the Sainte-Chapelle.\nBut, as a meta comment, you are doing a profound disservice to yourself and others to behave the way you are behaving: posting behind some other identities, spreading misleading information, avoiding to read on the subject matter, and more. \nI know who you are.\n\n","date":"December 4, 2015 at 11:58 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215632","author":"Mario Latendresse","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"We don’t have the same ideas on the subject matter.  Who cares?  You’re not an historian and I prefer by far to base my opinion on the pros who studied that subject.\nNo big deal.  I don’t think we need to keep on this useless debate.\nGod bless you!\n\n","date":"December 4, 2015 at 1:06 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215636","author":"Joe","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"The missing years 1204-1355 continue to be enigmatic, and serious problems continue to arise with any of the explanations attempted.  And yet Robert de Clari’s sighting of a Christ-imaged cloth in the church at Blachernae in 1204 seem unequivocal, and there are several earlier Byzantine references to such a cloth, a himation, the cloth that God wore, and so on.  Our Shroud next emerges some 150 years afterwards in the French village of Lirey in 1355, apparently the property of Geoffrey de Charney, reported by his descendants to be a reward for services rendered and freely given, and hence not acquired through thievery or conquest.  \n1)  The recent enquiries by Mario Latendresse demonstrate that there appears to be no known family tradition connecting Othon de la Roche with the Shroud and that the casket in the Castle Ray-sur-Saone purported to be its reliquary seems only to have been recently labelled as such.  \nThere are also other serious problems with the Othon theory.  In 1204, Othon as a medieval lord owed fealty to his own lord and military commander, Boniface de Montferrat, both owing fealty to the recently elected emperor Baldwin IX of Flanders.  If the Theodore Angelos letter to Pope Innocent III happens to be genuine, and if Othon did indeed possess the Shroud, then this would have been known in 1205.  Baldwin was captured and likely killed by the Bulgarians in April 1205, and Boniface survived until September 1207.  \nIt would seem inconceivable that either Baldwin or Boniface would have knowingly deferred to Othon’s possession of such a highly prized relic.  If they were unaware of Othon’s seizing of the Shroud, then he effectively stole it from those to whom he owed sworn fealty.  It would seem unlikely that Othon would have deceived his liege lords in this way, and if he had, then it is also unlikely that they did not learn of it, and reclaim it from him by force if necessary. \n2)  No shroud was ever inventoried among the relics placed by King St Louis in his new Sainte Chapelle.  We read of a “Du sainte suaire” = ‘a piece of the holy shroud’, and “une sainte face” = ‘a holy face’.  Later inventories refer to the latter as a ‘a holy towel in a frame’, seemingly the mandylion of Edessa.  If the mandylion was ever the Shroud, then it had been unfolded long ago in Constantinople, according to those advocating this hypothesis.  The holy towel in a frame continued to be inventoried until at least 1575 when the actual Shroud was already on its way from Chambery to Turin.  \n3)  The mainstay of Ian Wilson’s Templar hypothesis for their secluding the Shroud during its missing years, seems to be the alleged worship of an idol in the form of a head from confessions obtained under torture.  He also refers to a painting of a Shroud-like Christ found in the 1940s on a ceiling panel of oak boards found at Templescombe, possibly dating to about 1300.  \nDaniel Scavone has noted that no two Templars ever gave the same description of the alleged idol, none ever described it as a cloth image, some said it was a skull, yet others said it had three heads.  He also notes that some of these Templars were menials, and not part of the inner circle present at the secret meetings when the idol was supposedly exposed.      \nMore significantly, he notes that the inquisitors used the same questions in the trials of the Cathars, and that it would seem that the inquisitors themselves intruded the idol into the interrogations, and the members of the Order described one in the hope of leniency. \n4)  We turn next to certain heretical dualistic sects in southern Europe as possible Shroud repositors.  They seemed to have their origins in a type of Neo-Manichaeism imported from the Paulician sect of Armenia and Asia Minor.   The Bogomils flourished in the Balkans between the 10th and 15th centuries, fusing Paulician dualism with a certain Slavonic movement aimed at reform.  During the 11th and 12th centuries it spread over many European and Asian provinces of the Byzatine empire.     \nThey considered that the visible material world was created by the devil and rejected the doctrines of the Incarnation, Baptism, the Eucharist and the whole organisation of the Orthodox Church.  By the early 13th century the dualistic communities of Southern Europe comprising the Paulicians and Bogomils in the East and the Cathari in the West, formed a network stretching from the Black Sea to the Atlantic.  \nIn the 13th and 14th centuries, Rome dispatched several legations and Franciscan missionaries to convert or expel Bosnian heretics.  With the Ottoman conquest of South-east Europe in the 15th centuries, obscurity descended upon the Bogomil sect. \n5)  The Cathari in southern France and northern Italy, emerged in France during the 12th and 13th centuries.  They professed a neo-Manichean dualism, reinforced by western dualists returning from the Second Crusade, and also by visiting Bogomil bishops.  By 1140 they were an organised church with a hierarchy, liturgy and a system of doctrine.  They became well-established in the general Pyrenees area particularly in the kingdom of Leon, which incidentally provides a link with Oviedo its former capital.  They became known as the Albigensians.  \nLike the Bogomils, they preached that Christ had only been a ghost who only appeared human, and denied his incarnation, death and resurrection, and also the eucharist, transubstantiation and the mass.  \nIn 1218 the Cathari were confronted in the city of Leon by a Catholic prelate, Lucas of Tuy.  Having personally destroyed one of their chapels, he wrote De Altera Vita, detailing various Cathari tenets and religious practices, displaying his own pathological hatred of heretics and Jews.  \nIf De Altera Vita is to be believed, then there was evidently a wide disparity between Cathari beliefs and their practices.  For Lucas claims that the Cathari had manufactured a most unusual crucifix, departing in many ways from traditional orthodox depictions.  Essentially this was a ‘crux simplex’ comprising an upright stipes with no cross-beam, an inscription plate and a foot-rest.  The figure of Christ was portrayed attached by only three nails, with one driven through his crossed feet, and the heretics claimed that Christ was pierced in his left side by a Roman lance.  Evidently his arms were extended directly above his head attached to the stipes.  \nGiven their strong aversion to images, the Cathari ought not to have produced such an object, and yet Lucas asserts that in fact they did.  Furthermore, in doing so and given the strong tradition of the form of the crucifix, they ought to have followed some of these traditions, but they did not.  Also given their rejection of the Eucharist, they ought not to have invited the leader of the Albigensian Crusade, Amaury de Montfort, to see the body of Christ that had become flesh and blood in the hands of their priest.  \nA syndonic solution may resolve this paradox, the disparity between Cathari belief and their practices as alleged by Lucas.  Uninformed by modern medical science, and failing to perceive that the Shroud was a mirror reversal, they judged that Christ’s arms were extended vertically above his head, and that the chest wound was on his left side.  Indeed Barbet was later to propose that the feet were crossed and fastened by a single nail, as Lucas asserts of his Cathari crucifix.  A Eucharist solution is not possible to explain the invitation to Montfort, but a bloodied Shroud image might serve as an adequate explanation.\nGiven Cathari aversion to images, it is curious that inquisitors were to charge them with worshipping an idol in the form of a head, as later inquisitors also charged the Templars. \n6)  The disappearance of the Christ-imaged cloth as reported by Robert de Clari in the chaos of the Crusader sacking of Constantinople in 1204, might then be explained by a Bogomil seizure of the relic and its transference through their extensive Neo-Manichean network to the Cathari in Languedoc.  \nPope Innocent III had attempted to put down the Cathari heresy but this ended in disaster in 1208 with the murder of the papal legate.  Amaury de Montfort had led the Albigensian Crusade in 1214-1224 ravaging Toulouse and Provence.  A more orderly persecution sanctioned by King St Louis IX of France was more successful, with the capture and destruction of the castle at Montsegur, the Cathar stronghold in  1244.  During the siege, four Cathari were said to have scaled down the steep cliffs taking with them a treasure of unknown content. \nThere would then seem to be two possible routes by which the Shroud might have come into the hands of Geoffrey de Charnay.  \nThe first of these is that following the capture of the Montsegur castle, the Shroud came into the hands of King Louis IX.  Not being part of the Contantinople relic booty, it failed to be catalogued with these relics.  However it would then seem peculiar that it does not seem to be otherwise recorded in any other known inventory.  Eventually it would be bestowed upon Geoffrey de Charnay for services rendered as claimed by his descendants. \nThe second possible route might seem more credible.  It would postulate that following the 1244 siege, the Shroud still remained hidden somewhere in the south of France.  In the Spring of 1349, Charny’s royal annuity was modified to include the first forfeitures that might occur in the Languedoc senechaussees of Toulouse, Beaucaire, and Carcassonne.  If the Shroud were then discovered during these forfeitures, it would rightfully become the property of Geoffrey de Charney in accordance with this grant.   \n7)  There are several defects and anomalies in the various attempts to date at explaining the sojourn of the Shroud between Constantinople in 1204 and its arrival at Lirey in 1355: a) it does not seem to have been catalogued with the collection of the Louis IX Sainte Chapelle relic collection from Constantinople; b) nor could it have been subsumed there under the identity of a holy face nor as a Shroud fragment; c) it is an open question as to whether the Shroud was ever in Besancon; d) the Othon de la Roche story with its Castle Ray storage no longer seems viable;  e) there also seems no adequate basis to support Ian Wilson’s Templar hypothesis. \nThe victors’ customary practice of destruction of the conquereds’ records and documents always creates problems for any historian.  Given the various defects and anomalies, the Cathari route for the Shroud is no less credible than most other attempts at a solution, and might even stand up to better scrutiny.  It may in fact be its actual route. \nI am indebted to Jack Markwardt for some of the information in this posted comment, both through personal communication and also his papers:  “Was the Shroud in Languedoc During the Missing Years?”, 1997, and “The Cathar Crucifix: New Evidence Of The Shroud’s Missing History”, 2000.\n\n","date":"December 5, 2015 at 6:21 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215689","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"Davidb, you wrote “and ‘une sainte face’ = ‘a holy face’. Later inventories refer to the latter as a ‘a holy towel in a frame’, seemingly the mandylion of Edessa.”\nSorry, but this is the not case, and this is essential. \nWhen the Mandylion arrives at the Sainte-Chapelle of Paris, it is not refer as a “sainte face”, and later inventories does not refer to the Mandylion as “a holy towel in a frame”. This is the other way around. The Mandylion is also referred by TWO distinctive descriptions in the early years of its arrival at the Sainte-Chapelle: 1) In the Golden Bull (1247), it is a “holy towel in a frame or box”; 2) Saint-Quentin (around 1245) describes it as “a board that touched the face of the Lord, when he was laid down from the cross”.\nSo, one description refers to it using the word ‘cloth’ but with no image, the second does not use the word ‘cloth’ but with an image on the reliquary. \nLater inventories of the Sainte-Chapelle confirm that there is a face of Christ painted on the bottom of the inside of the reliquary. But with NO cloth. Ever. There is no late inventories of the Sainte-Chapelle that describes a cloth inside the reliquary of the Mandylion. The cloth is gone.\nI think we can see a simple explanation for the early description: the cloth could not be seen with an image because it was folded and the bottom of the reliquary stated what was supposed to be in it.\nSo, by the time the Shroud is in Lirey or Chambéry, there is no cloth mentioned in the Mandylion reliquary from the inventories of the Sainte-Chapelle.\nAll the details are presented at http://www.sindonology.org/sainte-chapelle.shtml\n\n","date":"December 5, 2015 at 8:46 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215694","author":"Mario Latendresse","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"Quote: “Saint-Quentin (around 1245) describes it as “a board that touched the face of the Lord, when he was laid down from the cross”.”\nDo you know that, in Constantinople and in some ancient version of the Abgar legend, there were 2 relics related to the Mandylion, i.e. the Mandylion itself and a tile that was showing the same image of the face of the living Christ, which is maybe what Saint-Quentin was talking about…\nA lot of different interpretations are possible regarding the few references given by Mr. Latendresse and we should remain very prudent before coming to a conclusion that we can consider as “solid”.\nOne thing’s for sure, if the Mandylion really got to Paris and would have been in fact the Shroud of Turin folded in 8, we would have some testimonies that would talks about this relic as being a real burial shroud, which we don’t have.  Here, we must remember that it is a fact that, before he bought the batch of relics from Baudouin II (who was a relative), Saint Louis sent some people in Constantinople to watch closely these relics in order to make sure they were all “genuine”.  You can be sure that if the Mandylion would have been the Shroud folded in 8, these people would have note it and the bull of Baudouin II would have talked about a shroud of Christ, which is not the case.  It’s also obvious that this particular relic would have been presented by Saint Louis to the crowd as the main relic of the batch (maybe along the crown of thorns), which is not what happened.  It’s also obvious that if Geoffroy de Charny would have got the Shroud from king Philippe VI as an official gift for his precious service, we would have clear and official texts referring to this, which is not the case, and the authenticity of Geoffroy’s shroud would never have been questioned the way it has been since the day he placed it on public display (and especially not questioned by the French clergy the way it has been). Finally, if that would have been the way Geoffroy would have got the Shroud, he and his family would have been proud to claim it high and loud to everyone, because this kind of royal gift would have legitimate his relic and the public exhibitions he did with it and it would also have add some prestige to it, which, once again, is not at all what happened historically.\nFor all these reasons (and many more), most historians do not believe the Shroud ever got to Paris in the hands of Saint Louis (whether this would have been under the name “Mandylion” or not) and they do not believe Geoffroy de Charny got it as a royal gift from a king of France, whether it would be Philippe VI or someone else.\nI think the testimony of Robert de Clari is very important here.  If people don’t rely on special assumption (like Latendresse did), de Clari’s testimony show two important facts in that puzzling mystery:  1- the Shroud was a different relic than the Mandylion (and also the tile, which he described along with the Mandylion) and 2 – on the contrary to the Mandylion and the tile, the Shroud disappeared during the sack of Constantinople in April 1204.\nNow, how this “stolen” shroud got in the hands of Geoffroy de Charni? This question remain to be solve, but the fact that the authenticity of his Shroud was highly questioned from the start and the fact that nor Geoffroy nor his family dared to clearly mention when and how he got it clearly indicates that this was a family secret, which can lead us to believe that he got it through a very questionable path (which is very different than Latendresse’s hypothesis).\n\n","date":"December 6, 2015 at 6:55 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215744","author":"Joe","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"One last comment:  When it comes to the “Mandylion was the Shroud” hypothesis (far from being a proven theory btw), people have to make a lot of wild assumptions, which is (every serious historian will tell you this) not the proper way to build historical scenarios…\n\n","date":"December 6, 2015 at 7:08 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215746","author":"Joe","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"An impressive summary indeed, but oh so negative in the final analysis. Where’s the beef?\nHad there been that iconic double image – both sides of the same man, aligned head-to-head – in someone or other’s possession for 1300 or years prior to Lirey, it would have leaked out into the public domain, if only as a rumour.  It would have required just one quick sketch, scarcely more than graffiti, to become an instantly recognizable logo, signalling the sheet that enveloped the crucified Jesus, leaving his supposed faint bloodied imprint of BOTH sides. \n But there’s no record pre-1355 of any such iconic double image. So why not just accept that the double-image did not exist before the mid-14th century? Why not regard it as an ingenious artefact that has (allegedly) perplexed the brightest and best of modern day scientists? Or has it? Which top notch scientists have been invited to examine it? If anyone here knows of any, then please name them and their research achievements. Don’t be content to say they were “experts” or highly regarded in their chosen field. State the discoveries and insights for which they are famous.\n I say the TS has never been investigated by a top notch scientist associated with a major discovery, no disrespect to the Hellers, Adlers, Rogers etc, certainly not of Nobel Prize standard. Yet the UK institute where one of my medically-qualified offspring works does  immunological research is reputed as having a still-active Nobel Prize winner on every floor! They do exist, and I’ve no doubt some are quite approachable. Why has the TS not been evaluated by someone of that standing? \nI’d be happy to give them some pointers, like urging them to ignore the mantra that says the image cannot be a thermal imprint on account of it not fluorescing under uv. Expect to see 3 new short postings soon – the first detailing the properties of my recently acquired uv source, the second describing the results of using it to illuminate direct thermal scorches (Mk 1 model, with hot metal templates applied to linen) compared with the largely irrelevant charred edges of full-thickness burn holes as per 1532 Chambery fire, an improper reference standard if ever there was, and, phew, the third with oven-roasted white flour imprints, still using my own hand as cold template  – and still the currently favoured Mk 2 model.\n\n","date":"December 6, 2015 at 3:30 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215707","author":"Colin Berry","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"Thank you Mario for your response.  You have clearly put in a lot of research into your paper, which I hope will be thoroughly analysed by those in a better position than myself to be able to do so.  Clearly there will not be unanimity on your conclusions, but with so much controversy and uncertainty concerning the Missing Years, every avenue needs to be thoroughly explored as a possible route, and each case must be made and hopefully objectively appraised.  For this reason alone, your paper must be considered a significant contribution towards these endeavours, regardless of the accuracy of any conclusions which might be made.   \nMy earlier comments concerning the Sainte-Chapelle hypothesis may have been derived from a paper by Daniel Scavone who I note you mention in your ‘Response to Objections’. \nA possible major hurdle to overcome is the confusion in many minds with the Mandylion of Edessa, and the inclusion in the inventories of the image with the trellis work, when supporters of the Mandylion thesis assert that it had already been unfolded and revealed in Constantinople.  The apparently casual approach towards the actual nature of specific relics by those compiling the inventories, also seems to create ambiguities in accurately identifying these relics. \nI hope to be able to study your paper in more depth during the next few weeks.\n\n","date":"December 5, 2015 at 11:40 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215701","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Must Read Regarding the Othon de la Roche Hypothesis","post":"This is a proven fact Dave that can help us see more clearly:  Between the 10th and the beginning of the 13th Century, many lists of relics were made in Constantinople and NONE of these lists (including the testimony of Robert de Clari) considered the Mandylion as being a relic of the passion of Christ, while many of these lists (including the testimony of Robert de Clari) talks about a shroud of Christ as being a separate relic. Again, if we don’t rely on special assumptions, we’re lead to, at the very least, conclude that, at the same time and in the same place, there were 2 very different relics, i.e. a shroud of Christ associated to the Passion and a Mandylion that was not associated to the Passion.\n\n","date":"December 6, 2015 at 7:49 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","id":"comment-215747","author":"Joe","site":"shroudstory"}]
