[{"title":"Bible Archeology: The mystery continues","post":"I wanted to bring this up. It doesn’t have anything to do with this topic. Does anyone know anything about the Balatlar Church in Turkey? It was built in the year 660. One of the image show a similarity of the Shroud. Its\n the fifth picture along the bottom of the screen. I have never seen it before. Your thoughts? http://www.fotopedia.com/albums/NT-pD7R48GM\n\n","date":"August 1, 2013 at 10:00 am","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","id":"comment-40247","author":"Donn Reile","site":"shroudstory"},{"title":"Bible Archeology: The mystery continues","post":"A strange thing happens when you google that church name. You get links to sites mentioning rape – it seems the word means rape in Eastern languages. One site does mention a book called The Rape of the Shroud of Turin. Very odd.\nThe image itself is intriguing. It could be a coincidence but I wonder if the artist may have seen or heard of the Shroud and was struck by its composition and was inspired to use it for his fresco.\n\n","date":"August 1, 2013 at 10:34 am","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","id":"comment-40249","author":"David Goulet","site":"shroudstory"},{"title":"Bible Archeology: The mystery continues","post":"The Rape of the Shroud of Turin is an excellent book by Bill Meacham. I highly recommend it.\n\n","date":"August 1, 2013 at 2:27 pm","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","id":"comment-40266","author":"Dan","site":"shroudstory"},{"title":"Bible Archeology: The mystery continues","post":"I second that Dan.  Effectively, this is a must-read book for all the Shroud fans.\n\n","date":"August 1, 2013 at 2:30 pm","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","id":"comment-40267","author":"Yannick Clément","site":"shroudstory"},{"title":"Bible Archeology: The mystery continues","post":"Dan; “Well, no, the authors of the Bible weren’t good and accurate historians.” -There are a lot of Biblical scholars that would argue you on that point. It has been said that Luke is one of the best historians of antiquities by several scholars. The Gospel writers did not write their works as historical writings, but because of their accuracy in details of the time, have incidentally done so. So many details, such as names, places, people’s titles, geography etc. that it is ridiculous to assume the writings were fictional or inaccurate.\nR\n\n","date":"August 1, 2013 at 11:57 am","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","id":"comment-40254","author":"Ron","site":"shroudstory"},{"title":"Bible Archeology: The mystery continues","post":"I’d take Luke over Dan Brown that’s for sure. :)\n\n","date":"August 1, 2013 at 12:29 pm","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","id":"comment-40258","author":"David Goulet","site":"shroudstory"},{"title":"Bible Archeology: The mystery continues","post":"As one fellow Christian to another, I have some thoughts to share with Mr. McKinney. Carbon dating is only one of many categories of evidence that can be used to date the Shroud. Scripture, physics and chemistry, and medical analysis are perhaps the most important, with others like historical text, art analysis, textile analysis, debris (pollen, soil, etc) analysis, nonbody imagery and miscellaneous features also contributing. Those researches, and especially physics and chemistry, have made the Shroud the most intensively studied artifact in history with the results published by professionals in the professional literature. If interested Christians cannot reach a firm decision on the Shroud, how can they do so on similar controversies? I doubt Mr. McKinney would agree that just because archaeologists don’t agree if there was an Exodus or Conquest or historians that the Resurrection actually took place, he would conclude “Who are we to believe when the experts cannot agree among themselves?” Mr. McKinney would rightly point to all the positive evidence, some of it developed since modern secular scholarship reached their negative conclusions in the middle 20th cen., as the best insight on these and related matters. He might also point to such Christian organizations as The Associates for Biblical Research as excellent sources for reliable, up to date information and analysis. I do not know what sources upon which Mr. McKinney is relying for his Shroud information, but I can strongly recommend Verdict on the Shroud (dated, but one of the best Christian introductions to the subject), Report on the Shroud (also dated but an excellent source for the basic science), and Resurrection of the Shroud (written by a knowledgeable, hard-headed attorney and packed with up to date facts) – all available and at very affordable prices at Amazon. These and other resources should help Mr. McKinney join an increasing number of interested persons who conclude that although numerous Shroud mysteries do remain (the 1988 C14 dating, the nature and production of the image, question of nonbody imagery, etc.) The Mystery has been solved.\n\n","date":"August 1, 2013 at 2:31 pm","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","id":"comment-40268","author":"John Long","site":"shroudstory"},{"title":"Bible Archeology: The mystery continues","post":"Hi, it is not the Bible writers intent to give you history lessons per-say. The Bible is the given word of God Almighty about your soul and your being able to obtain Heaven.  Not to ace your History final in school.\n\n","date":"August 1, 2013 at 2:59 pm","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","id":"comment-40270","author":"Emmett Mc Mahon","site":"shroudstory"},{"title":"Bible Archeology: The mystery continues","post":"Wrong…  God and Jesus never wrote one damn line of this book call the Bible!  Wake up please…  This expression “the word of God” served the interest of the Religious leaders since religion exist (the Jewish, Muslim and Christian religions in particular).\nLook, I’m a Catholic myself but I’m not so dumb to think everything that went in the Bible is in sync with the reality of God.  \nBible, the word of God?  Let me laugh.  This is the WORD OF SIMPLE HUMANS LIKE YOU AND ME who tried to express their own experience of God (or Jesus).  That’s the reality and since these were just poor men like you and me, they can well have committed many mistakes of understanding versus the true reality of God.\nSometimes, as I read some comments, I have a hard time to believe we really live in 2013 and not in the Middle Ages.\n\n","date":"August 1, 2013 at 3:39 pm","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","id":"comment-40274","author":"Yannick Clément","site":"shroudstory"},{"title":"Bible Archeology: The mystery continues","post":"Wake young man, of course the writing was done by a human being but it is God inspired.  You don’t sound like an intelligent Catholic to me. Are you denying that Apostles wrote the words that Jesus spoke?\n\n","date":"August 1, 2013 at 3:58 pm","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","id":"comment-40276","author":"Emmett McMahon","site":"shroudstory"},{"title":"Bible Archeology: The mystery continues","post":"Excuse my strong language in the previous post Emmett, but it was too much for me…  There are so many conflicting things in the Bible that IT IS SIMPLY IMPOSSIBLE THAT EVERYTHING WAS INSPIRED BY GOD.  PERIOD.  In one book, you read something and in the next one, you read the contrary…  It’s evident that there’s a lot of good things in the Bible that are in sync with the God of Love and Mercy revealed by Jesus, but there’s a lot of garbage too that have nothing to do with the loving and mercyful Father revealed by Christ.  An intelligent Christian MUST learn to separate the good grains from the weeds (if I can use this expression)…\n\n","date":"August 1, 2013 at 4:21 pm","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","id":"comment-40277","author":"Yannick Clément","site":"shroudstory"},{"title":"Bible Archeology: The mystery continues","post":"We are talking about the Bible, not one book and then another that do not agree in their facts or verbiage..\n\n","date":"August 1, 2013 at 5:02 pm","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","id":"comment-40281","author":"Emmett McMahon","site":"shroudstory"},{"title":"Bible Archeology: The mystery continues","post":"And to answer your question, which was “Are you denying that Apostles wrote the words that Jesus spoke?”, I would say this (even if it will shock you probably a bit):  Not always!  I have a strong confidence in the historicity of most of Jesus’ deeds (especially those where he show the Mercy of God for sinners, which include his Passion, death and Resurrection), but I’m very doubtful about many “sayings” supposedly spoken by Jesus himself but who sound to me much more like the personnal theology and ideas of one writer placed into Jesus mouth…  Nevertheless, I don’t have any doubt about the historicity of Jesus words when he talks about a God of love and mercy because this is in total sync with most of his deeds (especially his Passion, death and Resurrection).\n\n","date":"August 1, 2013 at 4:38 pm","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","id":"comment-40278","author":"Yannick Clément","site":"shroudstory"},{"title":"Bible Archeology: The mystery continues","post":"Emmett, don’t you realize that the word “Bible” mean “collection of books” ?  This is not in fact one single book but a collection of many book, which are very different from one another…\n\n","date":"August 2, 2013 at 8:33 am","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","id":"comment-40307","author":"Yannick Clément","site":"shroudstory"},{"title":"Bible Archeology: The mystery continues","post":"There is the Biblical text and its manyfold translations/interpretations. Many a passage is tricky and very seldom they are translated/interpreted by really inspired so-called ‘Biblical scholars’ or ‘theologians’.\n\n","date":"August 1, 2013 at 6:20 pm","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","id":"comment-40284","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Bible Archeology: The mystery continues","post":"The stated agenda of the “Biblical Archaeology” web-site is to use archaeology to prove the Bible is a historically accurate document. It would therefore seem to be adopting a literalist perspective of the Bible, which to me is a mistaken undertanding of the Bible’s true intent. It leads to such fruitless projects as the various searches for Noah’s Ark on Mt Ararat, which is a failure to understand the true purpose of the story. \nThere is not even agreement as to what books constitute the “Bible”. This was evident as early as the Samaritan separation from the rest of Judaism (~722BCE). The Samaritans only acknowledge the Torah, the first five books alleged to be given by Moses, and do not acknowledge the prophetic books which only seem to have been compiled around the time of the Babylonian captivity in the 6th century BCE, or afterwards.  Deprived of their temple worship, the Jews in Babylon sought to assert their special identity by recalling their ancient stories and writing them down. Many of these stories were incorporated into the already existing proto-Genesis and proto-Exodus books. Their exposure to Babylonian science also had an influence. The story of Creation in Gensis ch.2 is a very ancient anthromorphic story and was retained, but the more elevated Creation story in Gen ch.1 is a product of their time in Babylon, and was placed first. Likewise they took the flood myths of the Babylonians and reinterpreted it in greater depth to yield the story of Noah. \nThe early Christians had as their scriptures the Greek Bible compiled in Alexandria over a considerable period after 300BCE, and it is frequently quoted in the New Testament. It includes the deutero-canonical or apocrophyl books, including much of the wisdom literature. Its use by the early Christians led to a Jewish reaction in the Council of Jamnia which declared the additional books to be non-canonical, and they reverted to the Hebrew Bible. Despite their acceptance by Jerome and their continued inclusion in the Catholic canon, the Protestant reformers adopted the same position held at Jamnia and also excluded them. The Catholic Council of Trent reacted by declaring the disputed books to be canonical, and reasserted this position at the First Vatican Coucil of 1870. \nWhen we come to the New Testament, the inclusion of some of the books were also matters of occasional dispute. By about 200CE, the criteria for canonicity had generally been settled as: apostolicity, true doctrine, and general usage. All three criteria had to be satisfied. Thus although the Shepherd of Hermas, the First Letter of Clement and the Didache were all accepted as containining true doctrine and in general use, they did not satisfy the criterion of apostolicity. Nevertheless the Letter to the Hebrews, with its non-forgiveness of apostasy, was only reluctantly accepted in the West, and Revelations is still considered dubious by the Eastern churches. Martin Luther was reluctant to accept the Epistle of James but eventually acquiesced into accepting it. \nProbably as a reaction against the Protestant reformers emphasis on scripture as the sole arbiter on matters of true doctrine, the Catholic position towards scripture seems to have been to subordinate it somewhat. It possibly saw scripture as the product of a living Church, and the Church was to be seen as the sole arbiter of its intent and interpretation. The encyclical Providentissimus Deus of Pope Leo XIII in 1893 was a turning point against any such trend, with its establishment of the Pontifical Institute of Biblical Studies. Further impetus and encouragement for the faithfuls’ study of the Bible came with the encyclical Divina afflante Spiritu of Pope Pius XII in 1943. The topic of Revelation was at first contentiously debated at the Second Vatican Council, some 60% of the Council fathers being quite dissatisfied with the preliminary drafts. However the final document Verbum Dei, Dogmatic Constitution on Divine Revelation came to be considered the second most important document promulgated by the Council, only after Lumen Gentium, the Dogmatic Consitution of the Church. \nAlthough the Catholic Church seems to have come belatedly to the serious study of the scriptural sources, particularly when compared to the 19th century Protestant scholars, it would be fair comment to say that it has now very likely surpassed present Protestant scholarship in the study of the scriptures.  \nTo see the Bible as proclaiming history or as an arbiter of science, is to demean its purpose. Its content is filtered by the times and understanding and the perceptions of those who first inscribed its text over the course of many centuries. I see its purpose as proclaiming the dealings of God with humanity, and of humanity with God. Yes, it contains an understanding of history and an understanding of science, but it also contains codes, aphorisms of wisdom and proverbs, liturgy, poetry, parable in its many forms, apocalyptic writings, and even a wedding song. In the New Testament, the intent is to proclaim Jesus Christ as Lord, Saviour and Redeemer.\n\n","date":"August 1, 2013 at 9:04 pm","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","id":"comment-40289","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Bible Archeology: The mystery continues","post":"10TH CENTURY IMAGE OF SHROUD?\nWas reading a book on Medieval Art today and came across this image of Otto III’s enthronement around 1000AD::\n\nthat is a very shroud-like object being held by 4 symbols of the evangelists\n\n","date":"August 3, 2013 at 2:47 am","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","id":"comment-40337","author":"Matthias","site":"shroudstory"},{"title":"Bible Archeology: The mystery continues","post":"100% agreed all the more so as the Turin Shroud image SHOULD be read in the light of the Book of Revelation archaeopareidoliac visions.\n\n","date":"August 3, 2013 at 11:30 am","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","id":"comment-40345","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Bible Archeology: The mystery continues","post":"Personally, I rather prefer to read this image in the light of the introduction of St John’s Gospel, which talk about the Incarnation of God and also in the light of the introduction of the Passion in the same Gospel (the first few verses of chapter 13).\nOf course, this is only my personal way to see and understand the image of Christ that is found on the Shroud…  But I think it’s far from being a bad one!\n\n","date":"August 3, 2013 at 4:43 pm","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","id":"comment-40369","author":"Yannick Clément","site":"shroudstory"},{"title":"Bible Archeology: The mystery continues","post":"I’m just a little old Catholic and cannot complain about your view, I have given my thoughts before as it totally grabbed my consciousness when I saw the facial view on the Shroud in a “cleaned up” photo of it.\n\n","date":"August 4, 2013 at 7:28 pm","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","id":"comment-40451","author":"Emmett","site":"shroudstory"},{"title":"Bible Archeology: The mystery continues","post":"This blog could help its cause by spelling “archaeology” correctly, instead of “archeology.”\n\n","date":"August 4, 2013 at 9:26 pm","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","id":"comment-40455","author":"Joe Marino","site":"shroudstory"}]
