[{"title":"Byzantine Coins Again","post":"The twin edges to depictions of Christ’s tunic are often referred to a couple of creases in the Shroud very visible in some of the Enrie photographs of 1933. However these creases are wholly invisible in the Secondo Pia photos of 1896, and are almost certainly artefacts of the way the shroud was rolled up between the two photographs. Vignon, very wisely, does not mention them.\n\n","date":"July 10, 2015 at 5:41 am","url":"https://shroudstory.com/2015/07/10/byzantine-coins-again/","cat":"history","id":"comment-205116","author":"Hugh Farey","site":"shroudstory"},{"title":"Byzantine Coins Again","post":"Hugh wrote: “However, when, after a period of exile, Justinian returned to the throne (705 – 711 AD), the same sort of coins (with the same designation – Christus Rex Regnantium) have a closely shaven Christ with tightly curly hair”.\nThis is not so much a depiction of “a closely shaven Christ with tightly curly hair” as most likely a portrait of Justinian II as Christ Emmanuel and/or a representative on earth of Christ Pantocrator.\n\n","date":"July 10, 2015 at 6:13 am","url":"https://shroudstory.com/2015/07/10/byzantine-coins-again/","cat":"history","id":"comment-205120","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Byzantine Coins Again","post":"For an extremely comprehensive discussion of the reasons for historic changes in Byzantine attitudes towards depictions of Christ on coins and iconography relating to the Shroud see Markwardt’s St Louis paper:  “Modern Scholarship And The History Of The Turin Shroud” Presented by Jack Markwardt at Saint Louis Shroud Conference on 12 October 1214.\nhttp://www.shroud.com/pdfs/stlmarkwardtpaper.pdf   \nThe discussion begins at p.24 and takes up much of the rest of the 76 page paper.  Initially Byzantine objections to a naked Christ even depicted icons of the Crucifixion with Christ wearing a full length tunic, despite the gospel accounts of his “being stripped of his garments”.  The paper mentions the Homs vase showing a Shroud-like Christ and the Justinian II coin of 692.  Used as labara, the images rather than showing a suffering Christ, more often displayed a triumphant Christ. but with Shroud-like features. \nIf portraits of Christ or else the True Cross displayed in battle as labara resulted in victories, this was taken as divine approval of the practice, whereas defeats were interpreted as divine disapproval and usually initiated bouts of iconoclasm.    \nFrom p.41, Markwardt begins a section on the ‘Road to Iconoclasm’.  The Justinian II solidus illustrated above was issued in 692.  He awaited God’s verdict on this use of the image for imperial purposes, which was not long in coming.  “In 695, Justinian was deposed, and his enemies, aware of a Byzantine tradition requiring an emperor to remain unblemished, cut off his nose before sending him into exile. A decade later, Justinian would return at the head of a foreign army, capture Constantinople, and reclaim his throne; however, apparently convinced that his use of the Image of God Incarnate had incurred God’s wrath, he employed only non-Pantocrator images of Jesus on coinage minted during his second reign.”  Hence we have the later solidus shown at the head of this posting, essentially a non-Pantocrator type image.   \nOn p.48, he commences a new section ‘The Imperial Covenant with God’.  From about the year 740 a series of destructive earthquakes struck Constantinople, and they were interpreted as a sign of divine disapproval for the displaying of a cloth with the divine image as discussed in the Tarragon manuscript, and it was kept locked up in a golden case.  “From that time on nobody has dared to open the case or to see what might be inside it, as everyone believes and fears that if anyone tries to open it the whole city will be struck by another earthquake.”  This cannot refer to the Mandylion which only arrived in the city about 940, and clearly some other relic is meant.  The only complying image at that time was the ‘Image of God Incarnate’.  From that time on the earthquakes ceased, and the Image was consigned to four and a half centuries of obscurity.  Note that following its arrival in the city ~940, the Mandylion continued to be shown to western royal visitors and others.  \nFrom p.67, Markwardt describes how the imperial covenant was eventually broken at the turn of the 13th century under the emperor Alexios III Angelos, who from his general behaviour seems to have had little respect for any possible threats of divine wrath.  Hence we have Nicolas Mesarites’ of 1201, “that Jesus’ resurrection was being reenacted in Pharos Chapel ceremonials which involved a sindon that had “…wrapped the mysterious, naked dead body after the Passion” “.\n\n","date":"July 10, 2015 at 4:45 pm","url":"https://shroudstory.com/2015/07/10/byzantine-coins-again/","cat":"history","id":"comment-205174","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Byzantine Coins Again","post":"Note that the epitaphioi depicting a a frontal more or less naked Christ, usually with crossed hands over the pelvis and with scourge marks and other wounds, that were commonly used in the Easter liturgies, begin to date from the early 1200s, signifying that the full Shroud image had by then become widely known, since Alexios III had allowed the ‘Image of God Incarnate’ to be taken out of its casket after some 460 years of concealment.\n\n","date":"July 10, 2015 at 11:47 pm","url":"https://shroudstory.com/2015/07/10/byzantine-coins-again/","cat":"history","id":"comment-205209","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Byzantine Coins Again","post":"Problem 1:  The Carolingian Stuttgart Psalter scourging scene dates from 800-814, and might be linked to Charlemange’ sojourn in Constantinople.  However the Covenant with God concealing the cloth would seem to have commenced soon after the earthquakes of ~740.  So it might have to depend on a memory or a verbal account of the image.  (The mandylion did not arrive in Constantinople until afterwards)\nProblem 2:  The Hungarian Pray manuscript showing the laying out of Christ and the visit of the holy women, dates from ~1192.  If the HPM is derivative of the Shroud image, then it would have to be assumed that the covenant had already been broken.\n\n","date":"July 10, 2015 at 11:59 pm","url":"https://shroudstory.com/2015/07/10/byzantine-coins-again/","cat":"history","id":"comment-205212","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Byzantine Coins Again","post":"I have received a note from Jack Markwardt.  Relying on a faulty memory, I had thought that Charlemagne had close contact with Byzantium, but can now find no evidence that this was necessarily the case.  In fact at this particular time as Jack has pointed out, the relationship between East and West was quite strained.  Very likely the Stuttgart Psalter illustration drew on the gospel accounts of Jesus being stripped of his garments and then scourged, crossed hands and epsilon-like finger signs notwithstanding.  \nSecondly, as Bela I was temporarily designated heir apparent, he would most likely been entitled and allowed to view the cloth concealed in its casket, which subsequently gave rise to the Shroud like illustration in the HPM.\n\n","date":"July 12, 2015 at 4:10 pm","url":"https://shroudstory.com/2015/07/10/byzantine-coins-again/","cat":"history","id":"comment-205410","author":"daveb of wellington nz","site":"shroudstory"}]
