[{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"Yeah, that was a fascinating thread. I have nothing materially to add because I am not read on the matter but I will offer one thought. \nI thought I read somewhere, and I thought it was in Rogers’ work, that the image on the shroud may not have been immediately visible because it was created through a function of accelerated aging of the carbohydrate coating on the linen. So both the linen and it’s coating started aging but the coating aged faster and produced the image in time.\nMaybe if it took some time for the image to show up the shroud was merely locked away somewhere and thought of as an old bloody burial sheet. It doesn’t really hold a place of prominence in the Gospels and really is just mentioned in passing when the Resurrection is discovered. I think folks would be most interested in the artifacts of the crucifixion itself. Prior to discovering an image on the shroud maybe it was taboo to show given its association to a dead body.\nPerhaps if the delayed image theory has any merit to it then it might explain the relation to the sudden change in art. Maybe someone finally opened up and looked at the shroud after a few centuries of being stored away and suddenly discovered the image.\nWeak I know, but it crossed my mind at one point.\n\n","date":"February 4, 2012 at 8:29 am","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7912","author":"Chris","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"Hmm, I don’t think that the Edessa link can be dispensed with quite that easily. If the only thing we had to go on was the legend about St. Jude bringing a cloth that Jesus wiped his sweat on to Edessa, then yes, that would be extremely weak, even contradictory. But there are other stories and descriptions that mention there being blood on it for certain, including blood from the spear wound on his side specifically, and that seem to indicate that it was a full length image. There are other descriptions that describe it as a very faint, ghostlike image, and which indicate that the Edessa cloth was stored in a way that it wasn’t totally visible. And there appears to be internal evidence from the Shroud itself that it was kept folded in a way that may have only made the face and upper chest visible.\nI think you can conclude from the Edessa stories themselves that there was confusion caused by people’ limited knowledge of the image. For instance, the image almost certainly had blood on it, but the story of Jesus merely wiping his face on it was developed by someone who didn’t know that. The story that attributed it to him wiping his face at Gethsemane was developed by someone who was aware of the facial blood and tried to account for it, but wasn’t aware of the blood elsewhere on the Shroud, later attributed to his side wound. Legends that involved Jesus imprinting his whole body by wiping his face were developed by people who realized there was more than just a face there and wanted to explain it, etc.\nThat’s all to say that there are some descriptions of the Edessa cloth that seem to fit an identification with various aspects the Shroud and some that don’t, but also internal evidence from just the descriptions themselves that some of those stories were developed by people who weren’t aware of many of the Edessa cloth’s properties, likely because of the way the cloth was stored and displayed (much as how we didn’t learn about the reverse-side image on the Shroud until just a couple years ago!)\nI don’t think the identification of the two is a lock, but I do think it’s a plausible conclusion, and not based just on pure supposition.\n\n","date":"February 4, 2012 at 10:18 am","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7919","author":"The Deuce","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"Very good points Deuce, one that is of importance is the ‘folding marks’ found by Dr Jackson in his studies and prove this Shroud was folded (for some time) in the described “Tetradiplon” fashion.\nR\n\n","date":"February 4, 2012 at 3:26 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7928","author":"Ron","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"Actually I don’t think it was Dr. Jackson that first noticed the fold marks, but he and his team have thru further study shown strong evidence to these fold marks and their longevity.\nR\n\n","date":"February 4, 2012 at 3:30 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7930","author":"Ron","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"Yeah, just by looking at the Shroud itself, you can tell that the sides were folded in at about shoulder width, and that it was also folded in half lengthwise several times.\nI think the idea that there was a copy of the Shroud face that was often shown in its place is plausible to explain the confusion over whether the Edessa cloth had blood on it, but not necessary. The blood stains and their placement don’t become obvious for what they are until you look at the Shroud image in negative and brightened up (and particularly when you see the whole body, front and back). It would be easy for someone peering into only a part of it, stored inside a box with a view hole at the very faint facial image (which is appears to be how the Edessa image was kept) to miss it. And then there’s the circumstantial evidence of Christ Protector, the coins, etc\nIt’s not a complete lock, but there are many disparate puzzle pieces that fit together pretty nicely there.\n\n","date":"February 4, 2012 at 4:28 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7931","author":"The Deuce","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"Btw, I thought the image at Taylor Marshall’s place, of what you get if you fold the Shroud along its fold lines, was pretty interesting. The upper chest is still in the picture, but without the context of the rest of the image in view and the aid of photo negativity, you really can’t tell that there’s anything there but the face.\nhttp://cantuar.blogspot.com/2011/05/christs-holy-image-of-edessa-and-is-it.html\n\n","date":"February 4, 2012 at 4:32 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7932","author":"The Deuce","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"Your correct, there’s some clues like that found in a short list of manuscripts BUT no one of those manuscripts have the same descriptive nature than a list of relics done by an eye-witness.  In fact, many of them are TOTALLY LEGENDARY STUFF and some other relied so much on theological stuff that it is almost like a parable in the Gospel.  It’s pretty dangerous to take for granted some descriptions coming from those kind of books !!!  And you have also to remember that this handful of manuscript doesn’t represent at all the majority regarding all the ancient source we have.  A lot of the stuff you talk about (the possible presence of blood in the image, the fact that the image texture would have been like sweat, etc.) could well be some form of litterary creation from those ancient authors that made them in order to deliever a spiritual or theological message to their readers…  Like I said, they pretty much all came from legendary kind of books and not eye-witnesses testimonies like some lists that described the relics in one particular place.  To stay scientifically correct, you cannot considered the information you take from those books on the same level as a list of relics for example.  It’s like apples and oranges really.\n\n","date":"February 4, 2012 at 10:59 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7944","author":"Yannick Clément","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"The Deuce wrote : “The story that attributed it to him wiping his face at Gethsemane was developed by someone who was aware of the facial blood and tried to account for it, but wasn’t aware of the blood elsewhere on the Shroud, later attributed to his side wound.”\nI’m fully aware of this version of the Abgar legend that can be found in the “Narratio de Imagine Edessena” along with the traditionnal version of the Abgar legend.\nThis is another very good example of pure speculation !  Taking a legendary account like that for a real and pure physical description of the Mandylion is purely speculative…  And let’s assume for a second that your idea (that was really push forward by Mark Guscin in recent years by the way) is correct.  HOW IN THE WORLD A CHRISTIAN WRITER COULD LOOK AT THE SHROUD FACE, THEN HE WOULD NOT RECONGNISED THE EVIDENT SET OF BLOODSTAINS COMING FROM A CROWN OR CAP OF THORNS AND CONFUSE THEM WITH THE BLOODY SWEATOF CHRIST IN GETHSEMANE ???  Sorry but this is complete non sense and extrapolation.  Show the Shroud face to an average Christian believer and ask him what represent the blood stains we see everywhere in the hairs, in the forehead and on the head, and check out his answers !!!  I bet 99% of them would answer : the crown of thorns of course !!!  If your idea was true, you can bet your house that the writer would have place his scenario during the way of the cross, during the crucifixion or, even more likely, after the death of Christ, simply because the Shroud (no matter if you look just at the face region or at the whole cloth) has an evident “sepulchral” feature attach to it that any average Christian believer can see…  So, here’s an advice :  Forget the hypothesis you just develop about this version of the Abgar legend, it just don’t pass the Occam razor test…  This reference to the agony of Christ in Gethsemane is most probably due to a will of the author to deliever a theological or spiritual message (there is many theological reference in that particular manuscript), much more than to really describe physically the image of Edessa (don’t forget that this book is a legendary kind of book and not an eye-witness account like a list of relics).\n\n","date":"February 5, 2012 at 12:08 am","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7945","author":"Yannick Clément","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"Yannick:\nTaking a legendary account like that for a real and pure physical description of the Mandylion is purely speculative…\nIt’s notable in that the account illustrates that they were trying to explain an image with blood on the face, not just possible sweat. And the “side wound” reference illustrates that it had blood on it for certain, and not just on the face, contrary to the impression you’d get just from the version of the story where Christ merely wipes his face on it.\nHOW IN THE WORLD A CHRISTIAN WRITER COULD LOOK AT THE SHROUD FACE, THEN HE WOULD NOT RECONGNISED THE EVIDENT SET OF BLOODSTAINS COMING FROM A CROWN OR CAP OF THORNS AND CONFUSE THEM WITH THE BLOODY SWEATOF CHRIST IN GETHSEMANE ???\nI think it would be quite easy. Take a look at what the Shroud looks like when folded along its fold lines, in which configuration it was evidently stored for a long time (long enough to permanently imprint the fold lines):\n\nNow, imagine that was *all* you’d ever seen of the Shroud. Imagine that you’d never seen it in negative, and that you’d never seen the rest of the body and crucifixion wounds, or the back side of the image with the blood all over the top of the head. Even though the upper chest is in the picture, you can’t really make it out without more context, and it’s not obvious that the blood stains are blood stains. Now imagine that you’d only seen it indoors in pre-electricity lighting conditions, stored inside a box with a view hole with a lattice.\n\n","date":"February 6, 2012 at 9:58 am","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7983","author":"The Deuce","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"Btw, while not related to the Shroud’s possible presence at Edessa specifically, I think we need to remember the Sudarium of Oviedo as corroborating evidence for the Shroud’s ancient existence.\n\n","date":"February 4, 2012 at 10:25 am","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7920","author":"The Deuce","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"I agree with you on this comment.  Yes, the sudarium offer a much better “evidence” (even if it’s not a 100% proof because of the 2 C14 that gave a 6th and 7th century age for this cloth) than the Mandylion theory of Wilson…  The reason is very simple : The Sudarium is an object that is still with us today and CAN BE COMPARED SCIENTIFICALLY WITH THE SHROUD OF TURIN !!!  Unlike the Mandylion who was most probably destroyed by the french revolutionnaries in 1792…  I hope you knew that saint Louis king of France bought 22 relics in 1247 from the latin emperor of Constantinople.  Among those relic was a “sacred cloth” with a face image of Christ that was most probably the authentic Mandylion !  By the way, A LOT of historians agree with this idea.  And this “sacred cloth” was then most probably destroyed by the revolutionnaries in 1792…  No more Mandylion = No possibility for a comparison with the Shroud !\n\n","date":"February 4, 2012 at 7:20 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7933","author":"Yannick Clément","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"I added my comments in the thread linked above, sorry I didn’t know this thread had started. Nevertheless I think Yannick needs to open his mind a bit, not settle on his own “speculations and extrapolations”, that he derives from his readings.\nR\n\n","date":"February 4, 2012 at 3:18 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7927","author":"Ron","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"This is absolutely not speculation my dear Ron…  If you had done the same extensive research than mine, the truth would hit you in the face just like me because I know you’re not dumb…  A bit of a closed-mind, maybe (it’s normal because nobody love to get his convictions shaken by someone else).  But you’re not dumb.  The only advice I can give you at the moment is this :  Please meditate on that :  from 726 or 730 until 1204, there is a bunch (over 10) testimonies (most of which from eye-witnesses) that specified that the Shroud of Christ and the Mandylion were 2 separate relics.  I’m sorry but THIS IS NO SPECULATION !\nAnd if you could see all the evidence and data that come from all the ancient source and then, you would used the Occam rasor principle to judge the likelihood of the different hypothesis versus the Mandylion, you would be forced (like I was) to conclude that the Mandylion was really just what the vast majority of the ancient writers and artists report it to be :  A small cloth that show ONLY the face of Christ and didn’t show any blood stains or injuries.  That’s all I can say to you…  I’m sorry you’re not more willing to open your mind to this probability because the fact that the Mandylion hypothesis is very improbable don’t mean that the Shroud of Turin don’t have a real history before 1350 !  It is just that this history is not directly linked with the Mandylion of Edessa…  Period.\n\n","date":"February 4, 2012 at 7:37 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7934","author":"Yannick Clément","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"I am not the one with a closed mind here and I definately do not need to meditate on anything. I have read several books and papers on the matter, probably much of the same as you and I can tell you clearly there is much speculation in your comments. Your insistence that there was several ‘lists’ written mentioning the two artifacts and by eye-witnesses is just on extrapolation you make from your interpretation of your readings. Reason; Your assuming these list ‘takers’ actually saw the items mentioned! Or were truthful in their inventory plus they were not very discriptive of what they listed, especially when it came to cloths…Then there is your insistence on the Mandylion not having blood markings; I have covered this twice already for you but you have ignored my comments, the answer can be very simple; these people (back then) saw the Mandylion very rarely and when they did it would not be thru a camera lens (with deeper contrast), but from a distance or in a dark cathedral and looking at the ‘actual image’ which is so faint most cannot discern the blood markings from other markings, this last statement is common fact when the cloth is viewed in real life!!…even your idol Barbet mentioned this fact. I have shown here how BOTH of your points can and have been shot down in a couple of quick sentences, and not by just me but by scholars, yet you will stand fast that your thinking is the ‘right’ thinking and all others here are wrong, closed minded and full of “speculation and extrapolations” lol….okay!\nR\n\n","date":"February 5, 2012 at 3:41 am","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7949","author":"Ron","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"Again, as always, when I read Ron, I just have this word in my mind :  Bullshit… :-)  LOL\n\n","date":"February 5, 2012 at 9:28 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7962","author":"Yannick Clément","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"And I found it really funny that you accuse me of using speculations and extrapolations while you and The Deuce used weak arguments like the foldings on the Shroud !  \nOn the contrary, baking my opinion on all the ancient sources that exist about the Shroud and the Mandylion, this is not what I call “speculation” or “extrapolation”, sorry…\nAnd I repeat it again :  I don’t have a book to sell or a TV documentary to promote.  I don’t have my own little hypothesis to promote.  I don’t want to get famous.  I JUST WANT TO LET THE WORLD OF SHROUD KNOW THAT MANY OF HIS MEMBERS (like Ron and The Deuce obviously) WERE SIMPLY FOOLED BY WILSON HYPOTHESIS !!!  I JUST WANT PEOPLE TO UNDERSTAND THE TRUTH ABOUT THOSE 2 DIFFERENT RELICS :  THE SHROUD AND THE MANDYLION.  That’s it !\n\n","date":"February 4, 2012 at 7:47 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7935","author":"Yannick Clément","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"Sorry but the fold marks are ‘very important’ evidence here, you can’t just disregard them because it goes against your ideas.\nI don’t think I or Deuce have been ‘fooled’ by any hypothesis, thats your interpretation as you have closed your mind to what you have concluded, AND IT SHOWS IN YOUR REPEATED STATEMENTS.\nR\n\n","date":"February 5, 2012 at 3:21 am","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7948","author":"Ron","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"As always… Bull…\n\n","date":"February 5, 2012 at 9:29 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7963","author":"Yannick Clément","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":">there is no clear proofs that the Shroud of Turin was really present anywhere.\nThis is false, but it would take a huge amount of time and space for me to prove it, and even then I doubt that Yannick would accept it.\nIt all depends on: 1) what Yannick has read; and 2) his personal standard of proof in each instance.\nAs an example of 2), the late great liberal New Testament scholar Rudolf Bultmann claimed (from memory) that there were only 14 lines of the New Testament that tell us anything reliable about the Jesus of history. The Jesus Seminar scholars say much the same thing.\nAnd 1) highlights a major problem with the Internet. Anyone can say anything and if they sound authoritative enough, most readers don’t have the means to check it out in depth for themselves. In the end you have to read books and journal article on any topic to fully master it, just as you would have to if you were doing a university degree. When I did my Biology degree in 2000-04, the lecturers emphasised that Internet only articles (i.e. that were not copies of journals or books) were not acceptable as scholarly references for assignments and papers. For what its worth, I own and have mostly read about 120 books on the Shroud, not counting hundreds of articles.\nWhen I get to “4. History of the Shroud,” in my PowerPoint presentation-based series “Shroud of Turin: Burial sheet of Jesus!” I will outline the historical evidence of the Shroud going back to the 1st century, with references, so readers can have some basis to make up their own minds.\n\n","date":"February 4, 2012 at 8:33 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7937","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"I just want to add something to make it clear on the subject you mention :  \n1- A list of relic written by an eye-witness that report the Shroud AND the Mandylion in the same document, this is what I called a very good evidence agains Wilson hypothesis.\n2- Seven different lists of relics, written mostly by eye-witness between 726 or 730 and 1204, that all mention the Shroud of Christ AND the Mandylion in the same document, it is what I call a great set of evidences that point into only one direction (if you avoid speculations) :  the hypothesis of Wilson is incorrect.  Period.\nAgain, I don’t make anything up, I don’t make any speculation, I simply made an extensive research in all the known sources reported in many historic books (most of them very recent, like the one by Guscin called “The Image of Edessa”) and just followed the trail made by the FACTS.  It led me to conclude this hypothesis of Wilson is off-track.  Honnestly, if you take all the evidences and observations regarding the Shroud and the Mandylion and you put them all into a scale, 99% of those will fall in the direction that says the Mandylion was just the cloth that was generally reported to be :  a small cloth (often called a towel) that show only the face of Christ without any injuries or blood stains and that was never directly linked with a burial cloth.  On the contrary, there is absolutely no written source that said the Shroud of Christ was related (directly or indirectly) with the Abgar legend or with the image of Edessa.  THOSE ARE SOLID AND CREDIBLE EVIDENCES FROM ANCIENT SOURCES, NOT SPECULATIONS OR EXTRAPOLATIONS LIKE IMAGINING THE WORD “TETRADIPLON” MEAN A BURIAL SHROUD OF OVER 4 METERS LONG !!!  Sorry but any cloth can be folded in 8 !  Any cloth.  And the writters was not describing the relic in his reliquary when he mention that !!!  This term is only found in one single version of the Abgar legend and nowhere else…  And it is found IN A LEGENDARY kind of book and NOT in a desciptive kind of book like a list of relic for example.  People tend to forget that…  There’s absolutely no way to be sure that this author had even seen the relic !  The fact is that in this ambiguous term, nobody can make a link with a burial shroud at all !  The context of the story completely prevent someone honest to do so…  The time of the miracle is during Jesus ministry !  How in the world someone could have give him a burial shroud in order that he could wipe his face after he had washed it ????  IT’S LUDICROUS COMPLETELY !!!  The author could have in mind a long towel like a beach towel for all we know !!!  By the way, try this at home folks :  if you take a beach towel or a long bath towel and you folded in 8, what do you get ?  Right !  A cloth that has almost precisely the correct dimension of a normal adult face !!!  Meditate on that…  The link between the term “tetradiplon” and the Shroud of Turin is a great example of the high speculations and extrapolations made by Wilson in order to confort is own little hypothesis…  And that has worked pretty fine for him since he sold A BUNCH of different books on this subject.  You know what ?  I don’t want to sell ONE SINGLE book.  I just want people to KNOW THE TRUTH about that…  That’s all I want, really.\n\n","date":"February 4, 2012 at 9:29 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7941","author":"Yannick Clément","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"If I can defend myself here, I would say this :  I didn’t said that there is no clear proofs (in ancient texts and in ancient artistic depictions) that the Shroud of Turin was really present anywhere, I said that there is ABSOLUTELY NO PROOF AT ALL THAT THIS SHROUD WAS EVER PRESENT EVEN ONE DAY IN EDESSA !!!  It’s pretty different…  And on this particular topic, I defy anyone to give me only ONE PROOF that the Shroud of Turin was ever present in Edessa !!!  JUST GIVE ME ONE PROOF from ancient documentary or artistic sources !!! JUST ONE…  You can try to find it but I tell you what :  It will be a lost of time cause there’s no such thing anywhere !!!  Sorry but that’s the reality.  The link between the Shroud and Edessa has no real historical base.  It’s only when you used speculations and extrapolations (not a very great scientific way to work) that someone like Wilson (and after him, Dubarle, Scavone, Guscin and Al.) can see somewhat of a link !  In all the ancient sources that talk about the Shroud of Christ (mainly from Jerusalem and Constantinople), THERE IS ABSOLUTELY NO REFERENCE MADE THAT CAN INDICATE THAT THIS SHROUD OF CHRIST CAN BE LINK IN SOME WAY WITH THE ABGAR LEGEND OR THE MANDYLION !!!  This is not Yannick Clément inventing something to confort his preconception here, this is A FACT !!!  This is not a speculation or an extrapolation, this is a fact !!!  I just follow the facts and they led me to conclude that this Mandylion hypothesis is simply wrong… Completely off-track to be honnest.  So much that I consider this hypothesis to be THE BIGGEST CRAP THAT WAS THROWN INTO THE FACE OF THE SHROUD WORLD EVER !!!  I’m sad to see how many people have bought that crap over the years (especially in the Shroud World) because I know from my extensive research that there is no way this hypothesis can be true…  In fact, I’m sorry for those people that were all fooled by Wilson and Al.  And remember one important thing that people always tend to forget :  When you step outside the Shroud World, there is almost no credible historian that defend Wilson’s hypothesis !!!  That doesn’t ring some bells to you ???  The only ones who defend Wilson are all PRO-SHROUD PEOPLE…  This is another fact and not a speculation.\n\n","date":"February 4, 2012 at 9:03 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7940","author":"Yannick Clément","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"I’ve forget to add in the intro of my last comment :  Read again my ancient post on that topic.  You’ll find this :  “Beside the testimony of Robert de Clari in 1204 and the artistic depiction we found in the Pray Codex (dating from 1192 to 1195), there is no clear proofs that the Shroud of Turin was really present anywhere.”\nI think that clearly show that I was misquote by M. Jones…\n\n","date":"February 4, 2012 at 9:35 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7942","author":"Yannick Clément","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"One more important question I would ask to anyone here :  Why people in the Shroud world, when they faced an historical hypothesis like the one of Wilson, they generally don’t seem to get the same level of scrutiny that they seem to have regarding hard science topics (that could be directly related to physics, chemistry or something like that) ?  As I know, Wilson hypothesis and ideas never were submitted to a bunch of his peers (and more than his peers because is more of a journalist than an historian) so that they could say what they think of this…  \nAnd no matter his hypothesis was disregard by the vast majority of the credible historians outside the Shroud World, people don’t seem to care one bit about that fact and continue to follow him with his weak hypothesis…  I don’t understand why it is like that regarding historical hypothesis versus hard science hypothesis like the one of Rogers or the one of Fanti or Di Lazzarro and Al. !!!  I really don’t understand why people seem to put aside their good sense when an hypothesis like that his thrown in the public place.  It’s really not the same thing that goes on when it comes to hard science hypothesis, and it’s a shame that it is the reality that goes on in the Shroud World.  It should not be the case, but sadly, it is…  Maybe it is more like that for Wilson’s ideas than others ?  Maybe this guy is a better peddler than most of the credible historians out there ?\n\n","date":"February 4, 2012 at 10:13 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7943","author":"Yannick Clément","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":">>there is no clear proofs that the Shroud of Turin was really present anywhere.\n>This is false, but it would take a huge amount of time and space for me to prove it, and even then I doubt that Yannick would accept it.\nI later remembered that Ian Wilson had also presented empirical evidence that the Mandylion was the Shroud folded in eight (doubled over and then folded four times), with the top eighth being the face of the Shroud in landscape mode:\n“For me a crucial breakthrough in overcoming this objection surfaced in the 1960s, when I noticed how a sixth-century Greek version of the Abgar story, the Acts of the Holy Apostle Thaddaeus’, describes the Edessa cloth as a tetradiplon. In all the corpus of Greek literature tetradiplon is an extremely rare word, and totally exclusive to the Edessa cloth. Yet, because it is a combination of two common words, tetra meaning `four’ and diplon meaning `two fold’ or `doubled’, its meaning is actually very clear: `doubled in four’, suggesting four times two folds. This immediately raised the thought: `What happens if you try giving the Shroud four times two folds?’ When I tried this, using a full-length photograph of the Shroud, I was dumb-founded by the result – as I continue to be today. There was the Shroud face, front-facing and disembodied-looking on a landscape aspect cloth, exactly as on the earliest artists’ copies of the cloth of Edessa. Whenever the Shroud is presented in this manner – and it is a very logical way to present and make manageable a 437 cm length of cloth – its nature as a `shroud’ is in fact subordinated to its rather more socially acceptable nature as a `portrait’. And historically such an arrangement finds ready support in the description of the Edessa cloth, on its arrival in Constantinople, as `fastened to a board and covered with the gold which is now to be seen’.  It therefore readily explains the many centuries of silence about an image-bearing `shroud’ as such. Furthermore, when the man of the Shroud’s eyes are viewed on the cloth itself, as the Edessans and Constantinopolitans might have viewed them, rather than on the photographic negative that we tend to be more familiar with today, they appear open and staring, just as if he was alive, thus readily corresponding to this aspect of the Abgar story. … Clearly a crucial component of this theory is that the Shroud should bear signs of its once having been folded, for some significant length of time, in the ‘doubled in four’ manner postulated. When the STURP team worked on it in 1978, at my urging they specifically included in their test programme raking light photography to show up as clearly as possible the innumerable ancient and not-so-ancient creases that criss-cross its surface. When Dr John Jackson carefully analysed these creases to gauge whether there were any significant and long-established fold-marks consistent with the ‘doubled-in-four’ theory, he found that indeed they were there. He even found that the way they fell, with two particularly pronounced concentrations – one at the level of the topmost part of the back of the head, the other just below the crossed hands – indicated that the cloth had at one time been stored so that, if it was pulled upwards, the imprint of the man of the Shroud would appear to rise up from whatever casket in which it was stored.” (Wilson, I. & Schwortz, B., “The Turin Shroud: The Illustrated Evidence,” Michael O’Mara Books: London, 2000, pp.110-11).\nSee also Dan’s:\n“Tetradiplon or Doubled in Fours”\n“The Definitive Shroud of Turin FAQ: Tetradiplon”\n“Shroud of Turin FAQ: Comment on Wikipedia Text”\nThis is empirical proof beyond reasonable doubt that the Mandylion was the Shroud folded so that the face only is visible.\n\n","date":"February 5, 2012 at 3:11 am","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7947","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"I found the thread above quite interesting, but I feel that it is Yannick who is being close-mnded here, and I don’t see his need to insult Ian Wilson’s research and work.  We don’t know how those inventories were made, whether it was from a recollection of seeing the same object, at two different times under its two different aspects.  The keepers of the Mandylion/Shroud were very secretive about exhibiting either. Any records clerk may well have been ignorant of the true nature of the Mandylion as the Shroud.\nWhat I find persuasive about Wilson’s theory is that the so-called Vignon markings on the Shroud are also shown on copies made of the Mandylion on many of the various icons.  The only reason for depicting the Vignon markings are that many of them can only be found on the Shroud, as a result of the injuries iniflicted by the Roman soldiery.\nIf the Mandylion was a separate object, then it would need to have been made during the Way of the Cross to have shown the same markings, rather like the Veronica legend.\nAnother factor is the cultural abhorrence of displaying a burial cloth, which seems to me a sound reason of why the early Jewish church fails to mention it, and why they were probably relieved to send it off to a good Gentile home where it would be more appreciated, than they were capable of doing.  We can also understand a Byzantine reluctance to display a naked Christ, as notwithstanding earlier Greek sculptural models, the nude was not in the Byzantine artistic repertoire, particularly when it came to objects of reverence.\n\n","date":"February 5, 2012 at 7:13 am","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7952","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"Further to mine above.  Yannink claims that there are inventories dating from 726(730?) to 1204 listing both relics.  The Mandylion is known to have been in Edessa from 544 until 943 when it was then taken to Constantinople.  So what was the status of those inventories listing both relics from 544 to 943?  Did the inventories specify the location of the relics, or were they merely based on hearsay.  I would doubt they were based on any kind of formal stocktaking.  I should like to know a great deal more about these inventories, but Yannink doesn’t mention his sources in any of the above.  He just makes his assertions.  He then goes on to say that there is no mention of the Shroud until Robert de Clari’s testimony of 1204 and the Hungarian Pray manuscript (1192-1195).  If the Shroud existed as a physical object before 1192, then it had to be somewhere.  But he has said it’s in the inventories.  There’s some inconsistency in his argument, and I would say the case is mounting for both Mandylion and Shroud to have been the same object.  The Shroud’s Vignon markings on the icons are persuasive.\n\n","date":"February 5, 2012 at 3:46 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7958","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"Readers of this blog shoud check out the document: “CHAPTER I. Acheiropoietos Jesus Images in Constantinople: the Documentary Evidence***Daniel C. Scavone, University of Southern Indiana (6/21/96; 4/23/01;2-25-04; 11-24-04, 12-02-05, 01-03-06, 10-07-2006” accessible on http://www.scribd.com.\nScavone makes a highly authoritative and well-documented case for the Mandylion and Shroud being the same object.  He notes that there are several comments about the Mandylion being blood-stained, notwithstanding that copies of the Mandylion on icons might not be shown as blood-stained.  He further observes that although the anniversary of the arrival of the Mandylion in Constantinople was universally celebrated in Eastern Christianity, there was no such celebration for the arrival of the Sindon.  This is a further indication that they were one and the same object.\n\n","date":"February 5, 2012 at 4:54 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7959","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"Yannick, have you ever thought of the very fact that the French words “Linceul” (Shroud) and “Suaire” (Face cloth) were and are still applied to the same relic? Doesn’t that ring some bell to your “open mind”?\n\n","date":"February 6, 2012 at 10:40 am","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7986","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"…and this was well before Wilson’s theory…\n\n","date":"February 6, 2012 at 11:00 am","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-7987","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"Further to mine above, the full URL for Scavone’s paper is:\nhttp://www.scribd.com/slavisa_jevtic/d/66288478-1 \nA solid read, but authoritative and comprehensive, and independent of Wilson.\nCan probably be downloaded for an intensive read for those who want.\nAdequately demonstrates that Mandylion and Shroud were one and the same object.\n\n","date":"February 6, 2012 at 5:35 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-8005","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"Thanks Daveb\n\n","date":"February 6, 2012 at 6:14 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-8006","author":"Ron","site":"shroudstory"},{"title":"Calling all history buffs: Interesting comments from Yannick Clément","post":"I’ve read this paper before, but I can’t remember where I did. Very interesting read nontheless. It may be available at shroud.com for download also…I think ;-)\nR\n\n","date":"February 7, 2012 at 4:16 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","id":"comment-8031","author":"Ron","site":"shroudstory"}]
