[{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"Althouhg Mr Freeman once was proud to have done so far without ARCHAEOCRYPTOLOGY , GLADLY I can see Mr Feeeman is NOW FINALLY “DOING WITH” it as my series of critical comments in this blog do seem to have INSPIRED HIM on the tetradiplon issue. So much so, Mr Feeman we has gone as faras changing his previous most erroneous way of seeing it. Never too late Mr Freman. STILL he does have some more howmework to do before he really reached BOTH the historical and archaeological truth about the Image of Edessa.\n\n","date":"October 9, 2012 at 7:17 am","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17359","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"Mistyping (sorry): Althouhg Mr Freeman once was proud to have done so far without ARCHAEOCRYPTOLOGY , GLADLY I can see Mr Feeeman is NOW FINALLY “DOING WITH” it as my series of critical comments in this blog do seem to have INSPIRED HIM on the tetradiplon issue. So much so, Mr Feeman has gone as far as changing his previous most erroneous way of seeing it. Never too late Mr Freeman. STILL he does have some more howmework to do before he really reached BOTH the historical and archaeological truth about the Image of Edessa.\n\n","date":"October 9, 2012 at 7:20 am","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17360","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"Funny the way Mr Freeman first advocated a small face cloth and  now is advocating a more larger cloth…\n\n","date":"October 9, 2012 at 7:24 am","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17361","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"Max. No, I do not suggest a larger cloth. I am only concerned with the METHOD  of folding and I am not suggesting that the Image of Edessa was as big as a peplos. The example I use in my illustrations in my article is of a table napkin. I think the Image of Edessa was probably larger than this but the illustrations of it that survive ( which may not represent it as it really was,of course) are not much bigger than a table napkin. It would, of course, have been quite small when it was folded up tetradiplon to be given to Jesus to unfold before he wiped his face with it. The illustrations of the Image of Edessa show clearly that whoever painted them did not believe that it was a folded cloth and there is no other evidence that it ever was folded after Jesus’ face was imprinted on it ( as those who read my full article will discover)..\n\n","date":"October 9, 2012 at 9:35 am","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17367","author":"Charles Freeman","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"Question for M. Freeman :  Have you ever consider the possibility (truly reaslistic in my mind) that the linen cloth that was showing the Image of Edessa was NEVER really folded at all and that the use of this term in the Acts of Thaddeus was nothing more than a literary creation that was invented by this author for whatever reason ???  If my feeling is correct, then maybe this was imagined by the anonymous author of this legendary story in order to create an aura of mystery around this cloth by using a brand new term to describe it ???  I don’t see why historian would have to automatically buy the idea that the cloth was really once folded many times just because we found this very odd expression in one particular ancient manuscript.  Note that this term was never use again in the context of the Abgar legend until the Narratio de Imagine Edessena was written shortly after the arrival of the Image in Constantinople in 944 and this is not surprising since it is a fact that the author (or authors) of the Narratio have used the Acts of Thaddeus as one of their sources to wrote the story of Abgar and the miraculous Image of Edessa. I think this is pretty thin to automatically consider the use of this term “tetradiplon” as being a real physical description of the exact way the cloth was once folded while it was kept in Edessa…  If I was an historian, I would be very prudent before considering this like an historical fact…  What do you think M. Freeman ???\n\n","date":"October 9, 2012 at 3:48 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17378","author":"Yannick Clément","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"Additional comment for M. Freeman :  I think we can both agree that it is far from being proven that the anonymous author of the Acts of Thaddeus ever saw the cloth with his own eyes.  I also hope we can agree that a legendary kind of text like the Acts is far from being the same type of a list of relics !  And finally, do you know many copies of the Image of Edessa that clearly show some folding in the cloth ?  Personally, I don’t recall having ever seen one !!!  In that context, I think we have to be VERY prudent before considering the use of the term “tetradiplon” as really being part of an authentic physical description of the cloth that was kept in Edessa at the time…\n\n","date":"October 9, 2012 at 4:00 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17379","author":"Yannick Clément","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"Yannick- yes ,I completely agree with you. I think the author had heard of the ceremonies in which a cloth had been folded Tetradiplon as in the Parthenon ceremonies and thought it would be a good embellishment to the legend to add in the term here. Who knows whether Leo the Deacon had the same idea when he used the term peplos?\nSo I agree with you that this is most likely purely a literary creation and that in reality the Image of Edessa was never folded except when it was stored.\n\n","date":"October 9, 2012 at 4:03 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17380","author":"Charles Freeman","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"M. Freeman, I see we’re on the same line of thinking you and me !  And when you say that it was maybe only folded when it was stored, it’s not even sure.  The Narratio indicates that the cloth had been nailed to a wooden board long before it was brought to Constantinople.  Is this a real historical fact ?  Hard to say, but at first sight, this look plausible because in many copies of the Image of Edessa (like the Holy face of Laon for example), we can clearly distinguish a wooden board on which the cloth seem to be nailed, just like it is said in the Narratio.  And if this is an historical fact, then I seriously doubt that this cloth was ever folded during the time it was kept in Edessa and in Constantinople (and maybe even when it was probably kept in France!).  I think it could have been simply put unfolded on his wooden board into a reliquary designed for this particular configuration.  What do you think of this hypothesis ???\n\n","date":"October 9, 2012 at 4:44 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17382","author":"Yannick Clément","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"By the way, here’s another question for you :  Can you give me the exact quote of Leo the Deacon concerning the Image of Edessa ?  During my researches, I have heard this name but I don’t recall having been able to find this particular quote…  Thank you in advance for this.\n\n","date":"October 9, 2012 at 4:48 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17383","author":"Yannick Clément","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"Thanks, Yannick. Yes, we are on the same lines. As you will see from my full article, I think that the mention of the tetradiplon folding was purely imaginary on the part of the author of Acts of Thaddeus although I make the point that even a table napkin CAN be folded tetradiplon so that the author of the Acts of Thaddeus could have known that the Image of Edessa was quite small but still could be IMAGINED as folded tetradiplon.\nI have been trying to get the exact reference for peplos made by Leo the Deacon but it is clear that I will have to find it in the Cambridge University Library- I am just between leading tours to Istanbul and Trieste so I don’t think I have time to get there ( 70 miles from me) but if I get further i will let you know. Several books cite the use of the word by Leo but we should try and track down the original if we can as we all know that some citations in books about the Shroud prove not to be what they say they are when the original is checked!\nIt is, of course, only an interesting sideline in my argument- why did this particular word get used over five centuries after the end of the ceremony of the peplos on the Parthenon?\nAs we know references to a larger garment always refer to garments worn by living people,never to a shroud.\nGood researching!\n\n","date":"October 10, 2012 at 4:37 am","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17391","author":"Charles Freeman","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"Mistyping: a much larger cloth\n\n","date":"October 9, 2012 at 7:24 am","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17362","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"Fot those interested in my view on the Image of edessa, I have sent Dan a “two page flash illustrated paper” on Turin Sindon archaeoperception entitled: DORMANT ARCHAEOPAREIDOLIAS OF A MOST SECRET EDESSEAN LITURGICAL RITUAL?.For the sake of both debate balance and fairness, I do hope Dan will publish it here…\n\n","date":"October 9, 2012 at 7:46 am","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17365","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"I will publish it when I return home from New York tomorrow.\n\n","date":"October 9, 2012 at 7:55 am","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17366","author":"Dan","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"Thank you Dan to publish its slightly revised and corrected version I sent you.\n\n","date":"October 9, 2012 at 10:27 am","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17368","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"An interesting theory, but I still find Wilson’s more convincing.\nWhy would the author of the Acts have referred to ceremonial cloth by the number of folds? Especially when there is no other reference to ceremonial cloths being “tetradiplon”? When they could simply describe it as being a “Ceremonial cloth” or something similar?\nI think it is more convincing to argue that the reference to “tetradiplon” was cryptic reference by the author to the Shroud which he knew was doubled 3 times = 8 portions (4×2 hence “tetradiplon”), hence presenting as the Image of Edessa – a landscape portrait of Christ’s face\n\n","date":"October 11, 2012 at 7:21 am","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17471","author":"Matt","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"OK Matt, you may be right with a few others, it may well refer to a large cloth simply folded in four doubled layers of eight portions to have the face imprint uppermost and in landscape mode (here the Greeek then would put the emphasis on the visual result). \nArchaeologically speaking however you cannot totally ruled out the fact it may also refer to a long rectangular cloth (a himation as sindon) folded in four according to a less obvious successive folding to also have the face imprint uppermost in landscape mode (here the Greek would be simply the transcription of a syriac term that puts  the emphasis on the very nature of the cloth as a 4 X 2 Assyrian royal cubit long X 2 Assyrian royal cubit wide cloth).\n\n","date":"October 11, 2012 at 10:06 am","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17482","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"Ch. Freeman wrote to Y. “Clément : As we know references to a larger garment always refer to garments worn by living people,never to a shroud.”\nIconographically, this is TOTALLY false (see e.g; Nicholas de Verdun’ Christ entobment, Christ IS actually buried in a Himation). Resurrecting Christ is alos depicted dressed in a himation, see e.g;  Lorenzetti) etc. Cannot you BOTH do some iconographic homework, PLEASE.\n\n","date":"October 11, 2012 at 8:52 am","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17476","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"That is because he left the burial cloths in the tomb and after his resurrection he had returned to life- so one would never depict him still in a burial cloth!\n\n","date":"October 11, 2012 at 10:46 am","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17486","author":"Charles Freeman","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"Charles PLEASE see e.g. NIcholas de Verdun ‘s Christ entombment. Most obviously in the eye of somedy who can discriminate between Geek different clothing type) the dead Christ IS dressed in a himation. This is an iconographic fact.\n\n","date":"October 11, 2012 at 12:35 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17488","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"In Lorezetti’ fresco, the Resurrecting is JUST getting out of his tomb. Do you infer he bought his himation in Hell?\n\n","date":"October 11, 2012 at 12:36 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17489","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"Correction (typing too fast)\nCharles PLEASE see e.g. NIcholas de Verdun ‘s Christ entombment. In the eye of somebodydy who can discriminate between Greek different clothing types, most obviously\nthe dead Christ IS dressed in a himation. This is an iconographic fact.\nIn Lorenzetti’ fresco, the Resurrecting Christ is JUST getting out of his tomb. Do you infer he bought his himation in Hell? Are you kidding?\n\n","date":"October 11, 2012 at 12:39 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17490","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"Each time, the iconographic fact is that Yeshua’s burial cloth is assimilated by the artist to… a HIMATION, a large rectangular cloth.\n\n","date":"October 11, 2012 at 12:46 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17492","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"…An himation worn as achiton i.e. next to the skin, implying Yeshua is all naked beneath.\n\n","date":"October 11, 2012 at 12:49 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17494","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"Correction:…A himation worn as achiton i.e. next to the skin, implying Yeshua is all naked underneath.\n\n","date":"October 11, 2012 at 12:50 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17496","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"Well, I have found it and this is certainly not a depiction of the Turin Shroud and it does not look much like a himation either so I am not sure what the point you are making is. Please explain.\n\n","date":"October 11, 2012 at 12:53 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17498","author":"Charles Freeman","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"If the body is clothed in a himation then this is not the Turin Shroud which covers the head – a himation certainly does not. So is Nicholas de Verdun making the argument that the burial cloth of Jesus is a himation and thus cannot possibly be the Turin Shroud as we know it?\nIt would help if you could provide the link to the article you cite. Thanks.\n\n","date":"October 11, 2012 at 12:50 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17495","author":"Charles Freeman","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"In the Lorenzetti  or Nicholas de Verdun e.g. the cloth IS NOT covering the head. Remember in John’s Gospel, Mary of Maddala, mistook Yeshua for the Gardener because (among a couple of other details) he was dressed in a himation next to the skin as work wear.\n\n","date":"October 11, 2012 at 1:06 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17500","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"Because he dressed himself with his long rectangular burial cloth as in a himation/achiton.\n\n","date":"October 11, 2012 at 1:12 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17502","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"Or you NOW JUST try to  explain  me the reason why Mary of Magdala mistook Yeshua for a Gardener?\n\n","date":"October 11, 2012 at 1:14 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17503","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"Mary of Magadal didn’t not mistook him for an angel/a divine messenger, just for the gardener.\n\n","date":"October 11, 2012 at 1:17 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17504","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"Mistyping: Mary of Magadal didn’t not mistake him for an angel/a divine messenger but just for the gardener.\n\n","date":"October 11, 2012 at 1:19 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17505","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"The more I read your comment, the more I do think I  do have to spell it out for you…\n\n","date":"October 11, 2012 at 1:29 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17507","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"The gospel sources  ( see John Chapter 20) make it clear that the burial cloths were found in the tomb BEFORE Jesus was seen resurrected. So when he was seen by Mary Magdalene he was either  naked or dressed in some conventional clothing of the time. We would have surely been told if he was naked so I assume the latter and he may have been wearing  a himation. What is absolutely clear, if this gospel source is to be believed, is that Jesus could not possibly have been clothed in the cloths in which he was buried unless he magicked them out of the tomb and got them on AFTER Peter and the other disciple had seen them lying in the tomb!\n\n","date":"October 11, 2012 at 1:31 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17508","author":"Charles Freeman","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"Most obviously, history and Art history having being doing without archaeocryptology for too long…\n\n","date":"October 11, 2012 at 1:33 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17509","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"I cannot help thinking you’re a bit too short as an exegete too…\n\n","date":"October 11, 2012 at 1:40 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17510","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"Charles, nearly 2000 years after the event, could you tell me which piece or pieces of evidence REALLY makes it clear BEYOND THE SHADOW OF A REASONABLE DOUBT that the long rectangular cloth was still in the tomb when the two disciples discovered the latter empty?  Could you reconstruct the exact sequence of the different events that took place on that very morrning? Which is the good translation of the relevant passage? Can you REALLY tell me?\n\n","date":"October 11, 2012 at 1:50 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17511","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"Gladly, I note “[you] assume he may have been wearing a himation.” Hence this may be where the FAMOUS himation comes in in the Image of Edessa Legend associated to a living (resurrected?) Yeshua…\n\n","date":"October 11, 2012 at 1:59 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17512","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"Most curiously, the very fact that Mary of Magadal (who can tell an angel/divine messenger from a man) didn’t not mistake Yeshua  for an angel/ divine messenger but just for the gardener “AFTER  his resurrection”, is generally overlooked or downplayed by  Christian exegetes.\n\n","date":"October 11, 2012 at 2:39 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17513","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"Mistyping: Iconographically, speaking, this is TOTALLY false (see e.g. Nicholas de Verdun’ Christ entombment, Christ IS actually buried in a Himation). The Resurrecting Christ is also depicted dressed in a himation, see e.g. Lorenzetti) etc. Cannot you BOTH do some iconographic homework, PLEASE.\n\n","date":"October 11, 2012 at 8:56 am","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17477","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"How long will Freeman and YC endlessly repeat this totally erroneous opinion on the matter?\n\n","date":"October 11, 2012 at 9:05 am","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17478","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Charles Freeman:  Tetradiplon – the Mystery Solved?","post":"Do,they want to only convice themself it is so?\n\n","date":"October 11, 2012 at 9:06 am","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","id":"comment-17479","author":"Max Patrick Hamon","site":"shroudstory"}]
