[{"title":"Charles Freeman:  the manifold problems with Wilson’s hypotheses","post":"Before I post my upcoming long comment, I want to say a big “thank you” to M. Freeman’s comment about me.  By saying that “he is opening the debate wider among a community who are often unaware ‘of the manifold problems with Wilson’s hypotheses”.  That’s exactly the unique goal I seek by constantly remind pro-Shroud people of the weakness of Wilson’s hypothesis !!!  I just want to open their eyes to the possibility that, maybe, there could be another more rational and solid explanation for the Shroud’s obscure years (i.e. before 1357 in Lirey, France).  I have a sense that most pro-Shroud people who speak English have only learn one possibility about this dark age of the Shroud and that’s Wilson’s hypothesis, which, in itself, is a great shame !!!  But I don’t blame them, I blame more the known Shroudies (many researchers are among that group) who have constantly push Wilson’s case in the Shroud world over the years with a complete blind mind and without any critical sense !!!  I also have a great sense that most pro-Shroud people who believe in Wilson’s hypothesis think (falsely) that if Wilson’s case should be proven wrong, that would mean the Shroud is probably not the genuine Shroud of Jesus !!!!  THAT’S WRONG MY FRIENDS !!!!  TOTALLY WRONG !!!  As I often say :  read again the very interesting hypothesis of Paul Vignon !!!  You can read a good summary of this in the great paper published in 1969 by Maurus Green (http://www.monlib.org.uk/papers/aj/aj1969green.htm).  Vignon, just like me, believed the Shroud was genuine but at the same time, he NEVER thought for 2 seconds that the Mandylion could have been the same relic !  His hypothesis, if it is correct, push the dating of the Shroud to at least the 6th century (and most probably even the 5th).  As I said recently, that’s a very good start don’t you think ???  I hope people who read my numerous comments about Wilson’s hypothesis and who have read (or who will read) the paper I published here will start to OPEN THEIR MIND on the possibility that Wilson could be wrong about the Shroud-Mandylion connexion (even if it’s truly possible that a real connexion existed indeed) and start a reflection (and why not a research) on the subject to see if there could not be another possible avenue to explain the dead silence that seem to exist in ancient historical sources about a Shroud of Christ that would bears a body image along with bloodstains…  That’s what I do personally and I still seek the truth !  But one thing’s for sure : I’m 100% convinced now that this truth is not to be found in Wilson’s hypothesis or any other historical hypothesis he has brought forward over the years (like the very weak but still very good selling idea of a possible connexion with the Knights Templars)…\n\n","date":"September 2, 2012 at 5:46 pm","url":"https://shroudstory.com/2012/09/02/charles-freeman-the-manifold-problems-with-wilsons-hypotheses/","cat":"history","id":"comment-15739","author":"Yannick Clément","site":"shroudstory"},{"title":"Charles Freeman:  the manifold problems with Wilson’s hypotheses","post":"Here’s my long comment (sorry again for the length of it) :\nFor those of you who have not done the exhaustive research I’ve done concerning the history of the Mandylion and the Shroud (I assume the vast majority of the readers of this blog can be included in this category), let me give you a simple example in order to make you understand better the situation concerning the hypothesis of Ian Wilson who pretend that the Mandylion was the Shroud folded in 8 equal parts and showing only the region of the face :\nIf we take all, I repeat : ALL of the vast amount of historical and artistic data relevant to the subject and we build a giant pie with that, we would only get a very thin slice of less than 1% of data that could lead us to think that MAYBE the Mandylion was a larger cloth than a small towel, that MAYBE there was a full-length body image on it instead of just the image of the face of Christ and that MAYBE there was also bloodstains on the cloth, while all the rest of this gigantic pie (representing more than 99% of it) would clearly indicate that the Mandylion was a small towel, that it showed only the face of Christ, that this image was believed to have been formed (by a miracle or by a painter)during the ministry of Jesus, that there was absolutely no bloodstains or injuries on that cloth and that this cloth was not a relic related to the Passion of Christ.\nThis is exactly the kind of pie we would get if we consider ALL the historical and artistic data relevant to the subject.  Now, it’s up to you to decide if you want to follow the data that are included in the enormous slice of 99% in the direction they point to (i.e. that the Mandylion was NOT the Shroud but a relic of the living Christ showing just his face) or if you prefer to only consider seriously the thin slice of 1% as the real truth while finding imaginative ways (resting mainly on speculations, extrapolations and special assumptions) to explain how and why the giant slice of 99% is not really pointing in the direction it seem to point !!!\nHere, I want to remind all of you that the Occam’s razor principle (a principle largely accepted in science) can be summarized like this : The hypothesis that includes the smallest number of special assumptions has the highest probability of being closest to the truth.  Having said that, I think anyone who would used the Occam’s razor principle here WITH HONESTY WHILE LEAVING OUT HIS BIAS AT THE DOOR would have no other choice than to conclude that the MOST PROBABLE ANSWER should be the one that come from this big slice of 99%, i.e. that the Mandylion was NOT the Shroud but a relic of the living Christ showing just his face.  In fact, if we use the Occam’s razor properly to analyze the data coming from both the Shroud and the Mandylion, we have to conclude that these 2 relics are most probably what they’re reported to be, i.e. the authentic burial Shroud of Jesus of Nazareth and a small towel showing just the face of the living Christ (probably painted). \nHere, it would be great if the fans of Wilson could at least recognize this simple truth : In order to work, Wilson’s hypothesis need a wild bunch a special assumptions linked with speculative and extrapolative arguments.  When you know well most of the data coming from historical and artistic sources regarding the Mandylion and the Shroud, this truth is OBVIOUS.  And if we recognize the validity of the Occam’s razor principle, we have no other choice than to consider the hypothesis of Wilson as HIGHLY PROBLEMATIC AND UNLIKELY (to say the least) for the simple and good reason that it rest (not uniquely but in good part) on a lot of special assumptions, which is totally contradictory with this great logical principle of analysis…\nYou don’t like the Occam’s razor principle ?  No problem !  Why not used what I call “the court room” test ?  This is another very simple and very clever way to analyze the validity of a hypothesis.  To do that, you just have to take all the parts of one hypothesis and imagine that you are an advocate facing a judge and you have to convince him that this particular hypothesis is good beyond any reasonable doubt.  The burden of the proof is on your shoulder.  In the case of the Mandylion hypothesis of Wilson, remembering the gigantic pie of data I mention earlier with a slice of 99% of data pointing in the opposite direction, do you seriously believe that your case would stand for a long time in front of this judge and against all the questions of the Byzantine scholars opposing party ?  If you’re really honest, in front of all the known historical and artistic data relevant to the subject (my big pie), you have no choice than to conclude that Wilson’s case is a loser that, in the present state of our knowledge (I don’t predict future) cannot be convincing enough to someone neutral like a judge in a court room. On the contrary, if you do the same test with the hypothesis stating that the Mandylion was really what it is reported to be, i.e. a small towel showing just the face of the living Christ, I really believe you got a winner case in your hands that can convinced anyone who is neutral beyond any reasonable doubt.\nSo, it’s up to you my friends…  Do you really want to act and think like real scholars or do you prefer to act and think like Pro-Shroudies that are full of bias (and in doing so : unworthy of the real and authentic scientific spirit) ???  If you choose the second path, be sure that the vast majority of the Byzantine scholars (who know the subject even better than me and who are mostly neutral versus the question of the authenticity of the Shroud) will laugh at you. In fact, by acting like this, you will just contribute to diminish even more the credibility of sindonology in the eyes of the major part of the international scientific community (just like if its credibility was not at an all-time low presently !!!).  If you really choose this path, I want to say :  Bravo !  Keep on !  In a near future, the credibility of sindonology will be completely gone.  \nAnd for all of you who think Wilson is a genius and the main Prophet of Sindonology, I hope you understand that what I just described (i.e. the all-time low level of credibility of today’s Sindonology in the eyes of a very good portion of scientific community) is due in good part to his great “contribution” to the World of the Shroud… Great legacy !  My dream is that one day, History will put his books in the same category than those of Dan Brown and Thomas de Wesselow.  Note that what enrage me the most versus Wilson is not him personally (I don’t know him anyway), but the way he carefully choose some isolated “facts”, the tendency he has to take them out of their context, the way he change the natural interpretation of many others facts and the way he “forget” some others, all this in order to comfort his preconceived ideas about the Shroud.  FOR CHRIST’S SAKE, AM I THE ONLY ONE HERE TO UNDERSTAND THAT IT’S NOT THE RIGHT WAY TO DO GOOD SCIENCE ?!?\nI don’t have any doubt that Wilson has contributed that a lot of English speaking person has discovered the Shroud over the years.  The problem is not there.  The main problem is that he has filled these persons with many biased and incorrect notions about the Shroud.  If that’s what you call a great legacy, fine for you !!!  But on my part, seeing this makes me sick.  I truly think the Shroud deserves better !!!\nYou’re still not convince ?  Here’s just one example among a multitude : the term “poker holes” came directly from Wilson and has been adopted by many persons who have read his books and even worse, has been adopted by some Shroud researchers, as incredible as it seems, while science is almost sure now that the formation of the 4 series of little holes has absolutely nothing to do with a hot poker but come most probably from the drop of burning grains of incense or some corrosive liquid on the Shroud while he was folded in four equal parts !!!  It’s just one good example of the great imagination of Wilson…  \nSeeing many actual Shroud researchers praising Wilson that much and following his footsteps so closely makes me even sicker because by doing so, they risk to kill completely the few amount of credibility that can still be present in Sindonology today.    \nOne last comment :  In his recent report about the Valencia Conference in Spain for the BSTS, Mark Guscin wrote this about a paper presented there by Pablo Di Lazzaro: “He showed (Di Lazzaro) how our brain works to FILL IN SPACES and make us “see” things that we WOULD LIKE TO SEE, but which quite simply ARE NOT THERE. In reference to the Shroud this could be applied to the supposed inscriptions, the supposed coins, the supposed flowers and the supposed many other things that people “see” from time to time.”  I think M. Guscin should have add to his list the desire of Wilson and his followers to see the Mandylion, a small towel showing only the face of the living Christ, which we can see in a great number of ancient copies that has survived to this day, turn suddenly into a burial Shroud full of bloodstains that show 2 different images (front and back) of a complete body…  This process can be called “Seeing things we desperately wants to see even if they are not really there” and it can start to operate not only from the eyes, but directly from the brain. Wilson’s hypothesis is a very good example of that.\n\n","date":"September 2, 2012 at 5:46 pm","url":"https://shroudstory.com/2012/09/02/charles-freeman-the-manifold-problems-with-wilsons-hypotheses/","cat":"history","id":"comment-15740","author":"Yannick Clément","site":"shroudstory"},{"title":"Charles Freeman:  the manifold problems with Wilson’s hypotheses","post":"May I summarise why I entered this debate. My book Holy Bones, Holy Dust, How Relics Shaped the History of Medieval Europe was published by Yale University Press in 2011, the paperback is due out next month. If you go the Yale University Press US website and access the book and then click on reviews you will see that it has been well received by the academic community (after all, it is published by a university press),including the Catholic press. In the medieval world the Turin Shroud was one of many  thousands of relics claiming to be from the first century -it did not stand out from the others and I did not discuss it. I knew a little of Ian Wilson and knew that among the historians I had read on relics he was never taken seriously. He could be ignored.\nHowever, I was then sent a copy of Thomas de Wesselow’s new book The Sign in the hope that I would review it. Dr. de Wesselow is billed as a brilliant Cambridge art historian and it appeared that he was a man of high academic credibility. He claimed that he had spent several years working on the Shroud. i disagreed, as everyone else had, with his thesis that the Shroud helped create the early Christian communities, but I was amazed to read that after all his years of study he agreed with Ian Wilson all the way through. So Ian Wilson who is not taken seriously by anyone in the academic world was being given an imprimatur by ‘a brilliant Cambridge art historian’. This is when I decided that I would set out the main objections to Wilson’s theories, which as Yannick Clement is pointing out again and again, collapse as soon as they are properly examined. I have since written a second article ‘The Tetradiplon Revisited’ in which I pay tribute to Yannick Clement and others on this very site for alerting me to the way that Wilson has misguided us about ‘tetradiplon’.\nStephen Jones used a Wikipedia article about me which he claimed I had written myself. I had not, I knew nothing about it and it is very limited. I have written a short biography which is in the Authors’ section of Yale University Press LONDON ( e.g. not the US site).\nI am sorry that Stephen Jones has been so misleading about me. I accept his withdrawal of his comments that I am a ‘hired gun’ who would even write what I knew to be false in order to make money.This is a serious accusation when I have to try and sell books to university presses ( I am also published by Oxford University Press)!!  I hope he is more careful in writing his blog in the future. He can, of course, continue his long attack on my articles but,as one commentator has already said, his work on this is ’embarrassing’. I see no reason why I should respond to him.\n\n","date":"September 3, 2012 at 3:11 am","url":"https://shroudstory.com/2012/09/02/charles-freeman-the-manifold-problems-with-wilsons-hypotheses/","cat":"history","id":"comment-15768","author":"Charles Freeman","site":"shroudstory"}]
