[{"title":"A Rare Piece of Cloth","post":"I think there are two points here, namely how ‘expensive and rare’ the Shroud material is, and whether a ‘forger’ would be bothered to acquire it.\nI think the first must not be over-hyped. It is undoubtedly true that the weave of the Shroud is extraordinarily rare, in the sense that there are vanishingly few examples of it in any century, 14th, 1st or 21st, and that it requires a four-heddle loom, which is a more complicated piece of equipment than a one-heddle loom. However, having set the warp threads up in the heddles, the actual manufacture of the cloth is a relatively simple and tediously repetitive affair. There are dozens of examples of more complicated weaves from before and after the 14th century involving elaborate diamond patterns that required considerably more skill. So, more expensive than ‘normal’ cloth, certainly, but not fabulously extravagant.\nThe second point depends on what the ‘forger’ was trying to do. As a 14th century artefact, the Shroud was manufactured towards the end of the great Byzantine relics craze, and most of the alleged remnants of the time of Christ, from the manger to the cross, were already well established. The chances of an adventitious painter persuading the Dean of Lirey to try to pass off a quick monocrome brass-rubbing as holy relic are, I suspect, small, and I do not think that was the Shroud’s route to fame. It is far more likely that it was made for a liturgical purpose, almost certainly connected with Easter, and acquired its relic status fortuitously. That’s why I have kept the word ‘forger’ in quotes – I do not think the Shroud was necessarily originally meant to deceive people into thinking it was authentic. And if it were created for a liturgical purpose, then selecting a rich and rare material does not seem unlikely.\n\n","date":"July 21, 2015 at 3:31 am","url":"https://shroudstory.com/2015/07/21/a-rare-piece-of-cloth/","cat":"history","id":"comment-206254","author":"Hugh Farey","site":"shroudstory"},{"title":"A Rare Piece of Cloth","post":"Thanks for your comments Hugh. Can we therefore say that you agree with Charles Freeman ?\n\n","date":"July 21, 2015 at 4:11 am","url":"https://shroudstory.com/2015/07/21/a-rare-piece-of-cloth/","cat":"history","id":"comment-206258","author":"PHPL","site":"shroudstory"},{"title":"A Rare Piece of Cloth","post":"In principle yes, although there are a number of points about which we disagree, particularly concerning the appearance of the shroud when it was first displayed, and others about which I do not think we can be as certain as Charles appears to be.\n\n","date":"July 21, 2015 at 4:27 am","url":"https://shroudstory.com/2015/07/21/a-rare-piece-of-cloth/","cat":"history","id":"comment-206259","author":"Hugh Farey","site":"shroudstory"},{"title":"A Rare Piece of Cloth","post":"The three-in-one herringbone is still used today for church vestments and it was this weave that was chosen for the chasuble for the inauguration of Rowan Williams as Archbishop of Canterbury. The reason is that the silk shimmers in the light.\nExtensive studies of this weave shows no example before a few silk fragments in the third century AD which had, of course, to be made on very special looms. The standard ancient twill is 2/2 but shrouds.e.g. those from ancient Israel tend to be plain weave, as detailed by Omit Shamir in the article on Israeli textiles posted on this site recently .\nHugh is right that fabrics of extraordinary quality were produced in the Middle Ages, far finer than the Shroud.  The density of the weave is not exceptional among other painted cloths where 38 threads in both warp and weft can be found.e.g. finer than the Shroud weave.\nLinen was the downmarket fabric, compared to ,say, silk. The Cistercians deliberately had their vestments made in linen as part of their rejection of the opulence of normal church vestments. We have quite a lot of prices from inventories and a painted linen was worth about as tenth as much as the same picture painted on board. So I am not sure how Stephen Jones has come to believe that the Shroud would have been expensive n comparison to other fabrics.\nThree-in-one herringbone is much easier to weave on a medieval treadle loom as it is easier to manipulate with\nyour feet the several heddle rods needed.\nN.B. The Holkham Bible (1330), naked Christ, all-over scourge marks, similar patterns of bloodstains on the head. Michelle Brown, the authority on these illuminated manuscripts, thinks the Bible may have acted as a pattern book for lesser artists to copy. Interesting.\n\n","date":"July 21, 2015 at 8:43 am","url":"https://shroudstory.com/2015/07/21/a-rare-piece-of-cloth/","cat":"history","id":"comment-206275","author":"Charles Freeman","site":"shroudstory"},{"title":"A Rare Piece of Cloth","post":"I struggle to see how the Shroud could have been created as a liturgical tool when it was being exhibited in Lirey in 1355 as a relic. Also I really don’t think a liturgical aid would have displayed Christ’s buttocks. That’s a nonsense. Give me Colin’s theories any day!!!!\n\n","date":"July 21, 2015 at 5:40 am","url":"https://shroudstory.com/2015/07/21/a-rare-piece-of-cloth/","cat":"history","id":"comment-206261","author":"Thomas","site":"shroudstory"},{"title":"A Rare Piece of Cloth","post":"Well said Thomas (even without the reference to my own clumsy attempts to arrive at a solution).\n\n","date":"July 21, 2015 at 7:30 am","url":"https://shroudstory.com/2015/07/21/a-rare-piece-of-cloth/","cat":"history","id":"comment-206267","author":"Colin Berry","site":"shroudstory"},{"title":"A Rare Piece of Cloth","post":"You may well struggle, Thomas, but most public relics (as against private collections where it was easy to dupe the unwary) had started their lives as something else and were adopted by those hoping to set up a shrine. In many cases the owners of the Shrine genuinely believed that they had the real thing although the Shroud is unusual in not having a back story (compare the chest of relics from Christ’s Passion found at Oviedo, for instance). \nThe dukes of Savoy created one which told how the Shroud had been given by the patriarch of Jerusalem to the Lusignon family and that ti came to Chambery via Cyprus.\n However, we have no evidence that the Lirey shrine attracted any of the elite and it was quickly suppressed until Geoffrey the Younger managed to find a way of exhibiting the Shroud with official ( papal) approval in the 1390s. It was this kind of compromise that allowed relic shrines to continue at a time when papal approval was needed for a new shrine to become ‘legal’.\nI\n think genitalia, the seat of sin according to Augustine, were more likely to be banned than buttocks although these did come in for censure at the Council of Trent in the more prurient climate of the Counter-Reformation..\n\n","date":"July 22, 2015 at 4:17 am","url":"https://shroudstory.com/2015/07/21/a-rare-piece-of-cloth/","cat":"history","id":"comment-206306","author":"Charles Freeman","site":"shroudstory"},{"title":"A Rare Piece of Cloth","post":"“I really don’t think a liturgical aid would have displayed Christ’s buttocks. That’s a nonsense. … ”  ” … genitalia, the seat of sin according to Augustine, were more likely to be banned than buttocks although these did come in for censure … ” \nCheck out the amazing virtual tour of the Sistine Chapel:\nhttp://www.vatican.va/various/cappelle/sistina_vr/index.html  \nCertainly most of the figures are draped, and the nudes are often provided with strategic drapery or fig leaves.  However there are several exposed buttocks and even genitalia, e.g. check out Adam.  The artist is of course Michelangelo and this is the central church of Western Christendom.  However nudes of the saints are few, and they and angels usually have these areas concealed.  My recollection of Michelangelo’s Pieta statue is that it is strategically draped.  I suspect that the Shroud would almost be unique in exposing the buttocks of Christ, although the scourging scene in the Stuttgart Psalter also shows them but is a cartoon style of drawing, rather than a medieval realistic representation.  \nI think there would be almost no crucifixes without a loin-cloth, and the early Byzantine icons of the crucifixion even showed a full length tunic.   \nApart from the Shroud and its various direct copies, I would hazard that there would be very few representations of Christ’s buttocks, particularly outside of Italy, and I can recall none showing his genitalia.   Such a display just might be admissible in a realistic art-work.  As Thomas has indicated, it would be considered quite inapt in a liturgical prop or other rubric.\n\n","date":"July 22, 2015 at 5:05 am","url":"https://shroudstory.com/2015/07/21/a-rare-piece-of-cloth/","cat":"history","id":"comment-206308","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Rare Piece of Cloth","post":"That’s fair enough. We don’t know how the Dean of Lirey acquired his Shroud. Accepted wisdom is that it was a de Charney or de Vergy possession, alhough d’Arcis does not mention them. Either way, there is a mystery about the Shroud’s whereabouts between the Sack of Constantinople (1204) and 1355. If it was an artefact, it had plenty of time to transmute into  relic even if it were made at the end of the 13th century.\n\n","date":"July 21, 2015 at 5:56 am","url":"https://shroudstory.com/2015/07/21/a-rare-piece-of-cloth/","cat":"history","id":"comment-206262","author":"Hugh Farey","site":"shroudstory"},{"title":"A Rare Piece of Cloth","post":"Ancient complex weaves: \nAkeldama, Cave of Warrior, ~4000 BCE. shroud, 7 metres x 2 metres, material – linen, woven as single sheet on ground loom with beams at least of 2 metres, would have required 3 to 4 weavers (traditional Bedouin practice), edges decorated by bands of more elaborate weave, with brown and black threads, enhanced by fringe of hand-tied tassels. Refs: Dr Tamar Schick,  “The Cave of the Warrior, a fourth millenium burial in the Judean desert” IAA Reports No. 5, 1993;  “A 6000 year old Nobleman: Finds from the Cave of the Warrior”, Israel Museum 2003. \nKhirbet Qazone, Jordan, 3500 shaft graves, 2nd & 3rd centuries CE, 42 shroud pieces discovered, some intact or near-intact, various materials, at least one is single piece of cloth; Ref: H Shanks “Who Lies Here? Jordan tombs match those at Qumran” BAR Vol 25, No 25, Sep-Oct 1999. \nMurabba’at, Seven twill-weave fabrics, including dark blue cloth of fine and regular herring-bone twill weave (2:2), Z spun warp threads, mixed S & Z spun weft threads, likely imported.  Ref: Grace & Elizabeth Crowfoot, “The Textiles and Basketry” in Judean Desert, II, Les Grottes de Murabba’at, par P Benoit et al, Clarendon, 1961. \nMasada, numerous textile fabrics, includes 14 twill weave textiles, some in diamond twill, most believed to be imported from Anatolia and/or Germany, but generally wool. Ref: A Sheffer & H Granger-Taylor, “Textiles from Masada: A Preliminary Selection” in “Masada IV: The Yigael-Yadin Excavations 1963-65, Final Reports” Israel Exploration Society 1994.\nCave of Letters, woolen cloth woven in a twill pattern, Ref: Y Yadin, “The Finds from the Bar Kochba Period in the Cave of Letters” IES 1963. \nSeveral other samples of ancient complex weaves can be cited.  It was apparently possible to produce large cloths of complex weave even on large ground looms, providing a team of 3-4 weavers were engaged in producing the final product.  It eludes me why critics should see a particular problem in that a number of the products are in wool or other textiles  not necessarily linen.  In view of the extensive trade routes carried out in Roman times, and the vast expanse of the empire, I should think that whether the Shroud cloth was manufactured in the Middle East or imported from elsewhere, even northern Europe, is a matter of little consequence.\n\n","date":"July 21, 2015 at 6:39 am","url":"https://shroudstory.com/2015/07/21/a-rare-piece-of-cloth/","cat":"history","id":"comment-206264","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Rare Piece of Cloth","post":"Thank you Thomas and Davebfor your valuble contribution to discard Shroud created as a liturgical tool as suggested by Mr. Freeman and supported by Mr. Farey.\n\n","date":"July 21, 2015 at 5:02 pm","url":"https://shroudstory.com/2015/07/21/a-rare-piece-of-cloth/","cat":"history","id":"comment-206298","author":"Sampath Fernando","site":"shroudstory"}]
