[{"title":"Charles Freeman’s theory now in Wikipedia","post":"So, no sysop noticed it? Tough not a policy (which means you don’t get blocked for violating it), COI is frowned upon as described in this guideline: http://en.m.wikipedia.org/wiki/Wikipedia:Conflict_of_interest\nIt would have been more elegant to simply contact one of the several users following these pages to add the content following an evaluation.\n\n","date":"November 21, 2014 at 4:18 am","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","id":"comment-172340","author":"Eric","site":"shroudstory"},{"title":"Charles Freeman’s theory now in Wikipedia","post":"Well, my argument was already put up there in brief and rather than pretend to be anonymous or use a false name, as seems to be possible, I provided a clear summary of my argument with my name attached. ( I did not realise that I had left the ‘s’ off until I had posted it but it is quite obvious it is me.)\nOf course, I expect critiques of my argument, as is the case with other information posted on this site.\n\n","date":"November 21, 2014 at 4:27 am","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","id":"comment-172341","author":"Charles Freeman","site":"shroudstory"},{"title":"Charles Freeman’s theory now in Wikipedia","post":"P.S. I was scrupulous in following Wikipedia guidelines in terms of accuracy and neutrality. I say nothing about whether my argument is supported or not. I am quite happy for any editor who has actually read my article in full to make their own summary to replace my own and, so long as it does not misrepresent what I have written, I shall be happy.\n\n","date":"November 21, 2014 at 4:47 am","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","id":"comment-172342","author":"Charles Freeman","site":"shroudstory"},{"title":"Charles Freeman’s theory now in Wikipedia","post":"I am still very curious regarding the possible link with the particular “numismatic dating” of engineer Giulio Fanti.\nIt seems that everyone (apart our friend Barrie Schwortz!) want to forget or ignore this type of dating.  … and then:\nWhy?\nPerhaps it would be appropriate to include a few lines about\nthe issue (but respecting the copyrights of Prof. Giulio Fanti!\n\n","date":"November 21, 2014 at 9:52 am","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","id":"comment-172383","author":"piero","site":"shroudstory"},{"title":"Charles Freeman’s theory now in Wikipedia","post":"… and then … maybe …  some say we should do all this for free…\n\n","date":"November 21, 2014 at 9:59 am","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","id":"comment-172384","author":"piero","site":"shroudstory"},{"title":"Charles Freeman’s theory now in Wikipedia","post":"Mr. Freeman, your willingness to continually double down on something that’s scientifically implausible (i.e. that the Shroud is a painting) reminds me of my fundamentalist friends that continually argue about how the earth is 6000 years old.  It is obvious that you are “too far over your skies” on this one to listen to reason.\n\n","date":"November 21, 2014 at 1:59 pm","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","id":"comment-172404","author":"Mordecai Boone","site":"shroudstory"},{"title":"Charles Freeman’s theory now in Wikipedia","post":"Well, I have just lectured to an audience of sixty and have shown them other faded linens that were once painted, similar to the Shroud, lots of depictions of the shroud in the sixteenth and seventeenth centuries that show features that are now vanished ( so how were they put  on if they were not painted?)and the evidence from the gesso on the outer fibrils only and no one had any problems with the painting hypothesis. And this was a sophisticated audience.\n\n","date":"November 21, 2014 at 5:01 pm","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","id":"comment-172422","author":"Charles Freeman","site":"shroudstory"},{"title":"Charles Freeman’s theory now in Wikipedia","post":"have shown them other faded linens that were once painted, similar to the Shroud\nIn what aspects?\nlots of depictions of the shroud in the sixteenth and seventeenth centuries that show features that are now vanished ( so how were they put on if they were not painted?)\nOr existed only in the imagination of drawing those depictions.\nand the evidence from the gesso on the outer fibrils only and no one had any problems with the painting hypothesis. And this was a sophisticated audience.\nToo sophisticated, or selected to applaud your sophisms.\n\n","date":"November 21, 2014 at 5:09 pm","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","id":"comment-172425","author":"O.K.","site":"shroudstory"},{"title":"Charles Freeman’s theory now in Wikipedia","post":"Similar to the Shroud-e.g show ghostlike figures after the pigments had disappeared. The Zittau Veil ( painting disappeared after the veil was used as a cover for a steam bath) has some good panels for this.\nExisted in imagination. No ,the trick is to show a series of paintings by different artists over 125 years and show that there are certain things, like the Crown of Thorns that are shown in similar detail again and again.\nSophisticated audience. You weren’t there so how can you judge? We do have really quite intelligent people around where I live and they won’t be hoodwinked easily.\n\n","date":"November 21, 2014 at 5:32 pm","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","id":"comment-172430","author":"Charles Freeman","site":"shroudstory"},{"title":"Charles Freeman’s theory now in Wikipedia","post":"Hi Charles, I hardly ever comment here but I had to ask about the Cellini method of sizing canvas and your idea that that it seems to tie in to the shroud’s image on the outer fibrils of the linen. Now from the description of Cellini’s method it just sounds like the standard way I used to size my canvases (in fact most artists used to until modern methods came along within last 40 years). \nSo here’s the method: what I’d do is heat up rabbit skin glue till dissolved in water, and apply this solution thinly to the surface of the stretched canvas. Applying thinly allows the dried sizing to make a thin flexible protective layer (flexible so canvas can take knocks and recover and indeed can even be rolled up – Titian if I remember correctly, often sent paintings far and wide this way), and protecting the fibres from any corrosive action of the paint or paint medium. An additional gesso layer adds not only another protective layer but most importantly a reflective white surface that the semi-translucent paints within a medium (oil or egg tempera) could be applied to.\nNow the problem I have with your theory (unless I’ve understood it wrong) about the shroud being a flaked painting done in some similar such manner to the above, is that you seem to be saying that the painting done on top of these protective layers somehow penetrated through to affect the outer fibrils, such that when flexed over the centuries all that is left, after the painting/gesso/rabbit skin size layer falls off, is an imprint of the painting onto the linen a couple layers below. Can you see why I have a problem with this cornerstone of your theory?\nAnd additionally the imprint has 3d information within. \nI am a physicist and not very good painter (but I try!)  plus bit of an amateur art method historian e.g. studying how Vermeer, Carravagio achieved their realism. Whenever I see the shroud dismissed as a just painting I weep because that sweeping statement will convince many yet completely hides the many difficulties in creating the shroud. I’m not convinced the shroud is authentic but my scepticism also is honest enough to say that it is by far the most baffling artwork in existence…size, technique, novelty, subtlety, realism, surprises, details.\nBTW I did have a painting flake off in parts, and though I wasn’t really looking for it, I can’t remember seeing any imprint of the painting coming through. But in true scientific manner, rather that dismiss your idea out of hand, I suggest you try doing the rabbit skin glue, gesso, then oil paint (though perhaps in 13/14th century oil paints weren’t in regular use then, perhaps egg tempera instead) a nice big black X on the surface, leave for a couple months and then flex like hell until all the sizing comes off and see if the X appears on the canvas. You never know I might get a surprise!\n\n","date":"November 21, 2014 at 2:40 pm","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","id":"comment-172409","author":"ArtScience","site":"shroudstory"},{"title":"Charles Freeman’s theory now in Wikipedia","post":"Art science. Thanks for an interesting posting. With the Shroud,of course, you have several hundred years during which the Images were subject to all kinds of treatment. I don’t think there is any evidence that, other than the bloodstains, the pigments penetrated below the surface as they should not,of course, if Ceninni’s instructions had been followed. My own feeling is that the presence over several hundred years, perhaps into the nineteenth century, of the painted surface images , may have left shadows below. It is a pity we do not have several hundred years to experiment.\nOne of my illustrations in the lecture I have given is a panel from the Zittau Veil in which the figures ( originally painted on linen  cloth in 1472) are amazingly similar to those of the Shroud in their ghostlike appearance . I think my audience who had thought that the images on the Shroud were like no other were quite surprised to find that there were comparative samples although I need to find many more to consolidate the point. The Zittau pigments came off when the Veil was used as a steam bath cover by Russian soldiers in the Second World War. So perhaps you could try steaming your painted cloth. however, you still have the problem that the surface images have only been on a short time and it may be that the similarities between the Shroud and the Zittau Veil were because both had had the pigments covering the outside of the cloth for several hundred years and this left an impression that we can see when the pigments and gesso had disintegrated.\nHowever, I know of someone trying to recreate the Shroud as if it were a medieval painting but we still have the period of finding that five hundred years!\nAnd yes oil paints  were not used so you would have to mix up the pigments with tempera.\nThere is no problem with the quality of painting on linen. Caroline Villers (ed.) book on medieval textile painting has wonderful examples among the few survivors where the paint has, often thanks to the cloth being put onto a wooden backing, survived.\n\n","date":"November 21, 2014 at 5:17 pm","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","id":"comment-172426","author":"Charles Freeman","site":"shroudstory"},{"title":"Charles Freeman’s theory now in Wikipedia","post":"Look at the fantastic quality of the Four Scenes from the Passion of Christ by Niccolo di Pietro Gerini. All painted on linen and of superb quality, preserved only because they were placed on panels.Probably only twenty other examples have survived as the rate of attrition for linen paintings is so high. As the paint/ gesso is applied only to the outer fibrils ,they are very vulnerable if not secured to a panel!!\n\n","date":"November 21, 2014 at 5:37 pm","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","id":"comment-172431","author":"Charles Freeman","site":"shroudstory"},{"title":"Charles Freeman’s theory now in Wikipedia","post":"hi Charles thank you for that informative reply.\nI’ve thought about your shadow idea and though ingenuous has some problems/advantages in that,\n1) in order to make shadows on the cloth it has to penetrate the gesso layer which is a high reflectance surface (but again there’s a good test of this, hold up a gesso covered canvas to strong light to see whether there is a discernible glow, showing at least some light getting through). Next put a simple image (again say a 5 cm black X say from cut out card) and see if you can read it through the other side of your canvas with bright light passing through, testing image fidelity.\n2)there might a natural negativity of shades produced because say dark pigments on the surface, absorb light, so not allowing much to get through to the canvas, whereas light pigments reflect light and so perhaps allowing more onto the canvas and darkening the canvas there. So you might expect tone reversal as on the shroud.\nThe Zittau Veil, yes looks interesting in the areas where pigment has fallen off. I suspect not all the pigment has fallen off (a close up photo would be nice if you have) giving the faint image. You mention that it was keep in a steamy environment, so it is quite possible the pigments have leaked past the sizing boundary (weakened by steam) onto the cloth.\nThe shroud image seems to be mainly composed of darken fibrils with minimal contribution to pigments that have been detected on its surface. \nMy own theory about how I might go about making a shroud would be to get a front and back facing low relief brass effigies made (i.e. just like those used in brass rubbing but not so flat, maybe having slightly more relief differentials in the surface to try to capture some of the face subtlety).  These I’d heat to a glowing heat and the allow to cool and give time for  heat to become more uniform, to a scorching temperature. Then I’d apply the shroud on top but only touching the surface by means of a roller mechanism  (e.g. like an etching press). This allow a nice uniform contact time to be achieved and pressure deferential scorch image to be produced. Some tentative bits of evidence to this method is the presence of those awkward fold lines across the shroud….this is very typical of what you get if you use an etching press and don’t use the prerequisite number of blankets to press down on your paper – without the blankets the paper rides up ahead forming a buckle what is eventually squashed down as the roller proceeds, giving those awkward folds.  The shroud has a number of these running roughly sideways across the length (there are some longish ways that I can’t explain so easily). The other bit of evidence for this approach is that the areas with the smallest cross-ways width tend to be darker (i.e. as the weight of roller is applied over a smaller elevated section, the pressure is higher…..hence for example the head seems darker). This technique has all the relevant technologies available at the time form brass plates, to rollers. However there still seem to be lots of other subtleties about the shroud (e.g. the presence of fine almost invisible whip marks, no image under blood (if true)) that make me not completely won over to my theory.\n\n","date":"November 22, 2014 at 8:36 am","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","id":"comment-172520","author":"ArtScience","site":"shroudstory"},{"title":"Charles Freeman’s theory now in Wikipedia","post":"Oh and the other aspect of the roller theory is that it would also might make a faint secondary image on the opposite side of the cloth (such an image seems to be there in high pressure areas like head). The image here would be less do with scorching (as its not against the brass panel) but more due to pressure crushing the opposite surface differentially. However if the roller was hot as well, this might help image formation. Again….I’m not totally convinced but it does have a number of things going for it.\nThough I would like the Shroud to be authentic, brutal truth must win out unfortunately.\n\n","date":"November 22, 2014 at 9:06 am","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","id":"comment-172527","author":"ArtScience","site":"shroudstory"},{"title":"Charles Freeman’s theory now in Wikipedia","post":"Art science. I am looking forward to hearing how the Shroud that they are making works out although I suspect it will take some time to produce. Yes ,there are lots of issues to explore which is why it is important to gather other faded linens for comparison with the Shroud. I\nI have no other photos of the Zittau Veil but it was worked on by a conservation team and you may be able to track them down.\nWhen I hear people saying how would one reproduce the Shroud as it is now, my reply is why  would one want to do this? I want to reconstruct the Shroud as it was when it was first created wherever and whenever that was! Then we would surely learn a lot more about it. ( Compare the Antikythera Mechanism- there would be no point in reproducing the fragments we have now, but there is a lot of point in trying to work out what it was like when it was made. Ditto the Shroud.)\n\n","date":"November 22, 2014 at 9:41 am","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","id":"comment-172534","author":"Charles Freeman","site":"shroudstory"},{"title":"Charles Freeman’s theory now in Wikipedia","post":"Thanks Charles. Yep, only problem with trying to produce the shroud how it might have been say 7 centuries ago is we have no clear idea of what it looked like….was it in colour, were the outlines delineated, was there a background image, what medium was used, was there rabbit skin glue sizing applied? Still the fundamental question is how to get the faint yet detailed image onto  the cloth.\nWith the Antikythera Mechanism, we know for sure that its ultimate form was not to be a corroded mess of gears, but a fully functioning astronomical instrument whose predictions we will be able to verify as accurate by tallying up to know astronomical data. Whereas the Shroud in its present form is able to function as an object of veneration and wonder and who is to say it is definitely different to what it was 7 centuries ago (ok burnt holes etc and most probably fainter are different, but whether a full blown painting, I’m not sure but you might be right….I just can’t see the mechanism to get the painting transformed onto the bare cloth with such high fidelity)  \nWithout seeing the Zittau Veil in detail its hard to know how it compares to the shroud but I’d caution about jumping to conclusions that because on cursory  look it appears similar to shroud, its the same mechanism at work.  I know that when I try and reuse a canvas by scraping down, you are left with a faint image but it is still composed of pigments, not a shadow.\n\n","date":"November 22, 2014 at 2:13 pm","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","id":"comment-172566","author":"ArtScience","site":"shroudstory"}]
