[{"title":"To hide away and suppress the Cluny Medal","post":"Conspiracy theory is more logical.\n\n","date":"February 23, 2013 at 7:15 am","url":"https://shroudstory.com/2013/02/23/to-hide-away-and-suppress-the-cluny-medal/","cat":"history","id":"comment-25386","author":"Frank Ly","site":"shroudstory"},{"title":"To hide away and suppress the Cluny Medal","post":"Talking about conspiracy theory (1532 fire) :\n\nColin Berry :\nThere was collateral damage, certainly, but that was necessary in the interests of credibility (a single burnt hole would have immediately aroused suspicion). That is why there is no gradation of roasted/non-roasted panels, as Hugh has pointed out. Why? Because the Shroud was never roasted inside an reliquary – the selective scorching was done with the Shroud  on a convenient work surface.","date":"February 23, 2013 at 7:34 am","url":"https://shroudstory.com/2013/02/23/to-hide-away-and-suppress-the-cluny-medal/","cat":"history","id":"comment-25389","author":"anoxie","site":"shroudstory"},{"title":"To hide away and suppress the Cluny Medal","post":"These speculations by Colin Berry are not pseudo-science, they are trash science. The only science involved is ophthalmology and the only conclusion is that Berry needs a new pair of glasses.\n\n","date":"February 23, 2013 at 7:47 am","url":"https://shroudstory.com/2013/02/23/to-hide-away-and-suppress-the-cluny-medal/","cat":"history","id":"comment-25391","author":"John Klotz","site":"shroudstory"},{"title":"To hide away and suppress the Cluny Medal","post":"Tend to agree there John, this posting from Colin seems obsessive and deluded. He’s reading all sorts of things into that badge – ironic given his claims that shroudies read all sorts of things into items such as the Hungarian Pray Manuscript . What he calls the ‘chain’ across the back and the flames at the feet are simply representations of the blood which obviously could not be represented with any clarity in a literal copy of the shroud on a medal of this small scale.\n\n","date":"February 23, 2013 at 8:29 am","url":"https://shroudstory.com/2013/02/23/to-hide-away-and-suppress-the-cluny-medal/","cat":"history","id":"comment-25395","author":"Matthias","site":"shroudstory"},{"title":"To hide away and suppress the Cluny Medal","post":"Methinks CB intellectually does needs a pair of highly magnifying archaeological, historical and iconological glasses lest he would keep using his old science bod’s polarising paranoid glasses all the rest of his life as he most aberrantly thinks they are very reliable scientific advanced tools.\n\n","date":"February 23, 2013 at 8:33 am","url":"https://shroudstory.com/2013/02/23/to-hide-away-and-suppress-the-cluny-medal/","cat":"history","id":"comment-25396","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"To hide away and suppress the Cluny Medal","post":"Further, the bulky shoulder blades etc which Colin refers to are NOT armour. They are merely the understandably clumsy portrayal of anatomy on a small piece of metal.\nIt’s instructive to analyse the mold that was used to make other badges commemorating the shroud on the 14th century, the words on the mold say ‘Shroud of Christ”….The shroud was displayed as the Shroud of Christ and not an image of some dude being fried on a stake…\nOne more thing on the suggested “chain”. If indeed there was chain imagery on the shroud, and this was ‘removed’ via intentional scorching and the painting of blood, then why the following:\n– What Colin perceives to be a chain on the medal extends well to the right and left of the dorsal image. The scorching and blood on the shroud does not extend far enough to the right or left. There is no evidence on the shroud to the right or left of the arm area of any chain imagery, nor of any potential chain imagery that was disguised / removed\n– The thin rivulets of blood on the small of the back are nothing like the thick chain that Colin ‘sees’ on the medal. Again the thick “chains” on medal are just the crude miniature portrayal of the shroud blood\n\n","date":"February 23, 2013 at 8:48 am","url":"https://shroudstory.com/2013/02/23/to-hide-away-and-suppress-the-cluny-medal/","cat":"history","id":"comment-25398","author":"Matthias","site":"shroudstory"},{"title":"To hide away and suppress the Cluny Medal","post":"Mario Latendresse’s Lirey pilgrim’s badge I have in our slideshow with his permission & it’s been there for quite some time.  Shhh, don’t tell anyone.\n\n","date":"February 23, 2013 at 12:10 pm","url":"https://shroudstory.com/2013/02/23/to-hide-away-and-suppress-the-cluny-medal/","cat":"history","id":"comment-25412","author":"Andy Weiss","site":"shroudstory"},{"title":"To hide away and suppress the Cluny Medal","post":"THE CHAIN (DORMANT IMAGINARY) MOTIF AS LATE ANTIQUE (AND MEDIEVAL) ‘SINDONO(CRYPTO)GRAPHIC’ LITERARY HINT\n  Re the chain motif: the true archaeo(crypto)logical fact is CB is far from being the first to ‘think he sees’ a chain motif in the blood flow in the small of the back’ of the TS man/crucifixion victim image (See my research paper Reinterpreting The Book of Revelation, Late Antique Christian hagiography, Nestorian secret liturgical rituals and Medieval Graalic visions in light of the Turin Shroud image) or An ‘archaeo(crypto)perceptive’ long quest). \n  As early as the 1st century CE, YôHanan/John in his Book of Revelation associated the chain (and key) motif with Yeshua in his glory as both ‘crucifixion victim’ and ‘sacrificial lamb’ “wearing a garment soaked with blood” (Rev. 19:13). Had e.g. CB read it and been a true archaeo(crypto)logist, he couldn’t have missed the ‘sindonocryptographic hint’ in Yeshua being described via John’s mystic vision as “the messenger (sent by G.od) having THE KEY of the bottomless pit, and A GREAT CHAIN IN HIS HANDS” (Rev. 20:1) as “he laid hold on the dragon, that old serpent, which is the devil, and satan, and bound him a thousand years and cast him into the bottomless pit” (Rev. 20: 2-7). \n(As an archaeopareidolic vision, a chain-like shaped blood twin rivulets along with a key-like shaped can be unconsciously or deliberately misperceived as ‘chain and key’ on the TSM’s left forearm and hand areas and even be associated with the chain-like shaped blood flow on the small of the back area. A good trick if you want to initiate your eye-and-brain coordination system to see it (“primary visualisation”), just squint through semi closed eyelids)\nCan CB now figure out the dragon/crocodile and Yeshua laying hold of it to bind him? (The only snag is CB is definitely NOT a ‘crypto-Christian, hagiographic, ‘hagiomysteric’ and Graalic ‘dormant imaginary’ specialist).\nAs I wrote nearly one year ago on this very blog (see my posting on February 28, 2012 at 6:58 am | #6) :\n “John’s Revelation can be read in cryptic conjunction i.e. in “primary visualisation” with the Shroud image as oversized Rorschach. Too bad it was damaged in the 1532 fire (meaning a few of John’s ‘sindonocryptic hints/visions’ are now lost on us).”\n\n","date":"February 23, 2013 at 4:10 pm","url":"https://shroudstory.com/2013/02/23/to-hide-away-and-suppress-the-cluny-medal/","cat":"history","id":"comment-25429","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"To hide away and suppress the Cluny Medal","post":"Typo: on the TSM’s RIGHT forearm and LEFT hand areas\n\n","date":"February 23, 2013 at 7:04 pm","url":"https://shroudstory.com/2013/02/23/to-hide-away-and-suppress-the-cluny-medal/","cat":"history","id":"comment-25442","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"To hide away and suppress the Cluny Medal","post":"How about a posting from you, Dan Porter on what – or whom – you represent with your plethora of authenticity-promoting websites? I see that shroudofturin4journalists is under (re)- construction. The new version would appear to be more RC -oriented, judging by the newly-installed, as yet inactive tabs. \nCome on, Dan, aka episcopalian. You know you want to go the extra mile, if only to attend weekly confessionals. Come on, confess to us first. What was the real reason for your mid-life crisis re the Shroud? Ought you not to have shaken it off by now, judging by the photo (tempus fugit etc)?.\nMy enduring obsession is simple – I like enigmas, one of them being Daniel R. Porter…\n\n","date":"February 23, 2013 at 4:15 pm","url":"https://shroudstory.com/2013/02/23/to-hide-away-and-suppress-the-cluny-medal/","cat":"history","id":"comment-25431","author":"colinsberry","site":"shroudstory"},{"title":"To hide away and suppress the Cluny Medal","post":"No one has been able to figure me out, Colin. That surely makes me authentic.\n\n","date":"February 23, 2013 at 5:59 pm","url":"https://shroudstory.com/2013/02/23/to-hide-away-and-suppress-the-cluny-medal/","cat":"history","id":"comment-25437","author":"Dan","site":"shroudstory"},{"title":"To hide away and suppress the Cluny Medal","post":"Authentic what? Authentic mystery man? How does an authentic mystery man differ from a non-authentic mystery man?  Call me old-fashioned if you like, but I prefer transparency … even if I don’t like what I see.\n\n","date":"February 23, 2013 at 6:21 pm","url":"https://shroudstory.com/2013/02/23/to-hide-away-and-suppress-the-cluny-medal/","cat":"history","id":"comment-25438","author":"colinsberry","site":"shroudstory"},{"title":"To hide away and suppress the Cluny Medal","post":"I cannot help thinking Dan’s pun is totally lost on CB.\n\n","date":"February 23, 2013 at 6:38 pm","url":"https://shroudstory.com/2013/02/23/to-hide-away-and-suppress-the-cluny-medal/","cat":"history","id":"comment-25440","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"To hide away and suppress the Cluny Medal","post":"What about CB’s sense of humour? Gone with his scorching wind?\n\n","date":"February 23, 2013 at 6:45 pm","url":"https://shroudstory.com/2013/02/23/to-hide-away-and-suppress-the-cluny-medal/","cat":"history","id":"comment-25441","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"To hide away and suppress the Cluny Medal","post":"REMINDER FOR CB: TURIN SHROUD caution: to be taken in small doses only,\n\n","date":"February 23, 2013 at 7:14 pm","url":"https://shroudstory.com/2013/02/23/to-hide-away-and-suppress-the-cluny-medal/","cat":"history","id":"comment-25444","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"To hide away and suppress the Cluny Medal","post":"Reminder 2 for CB, Yeshua said : … ‘He who is near to me is near the fire [of the Word of G.od/Truth]’\n\n","date":"February 23, 2013 at 7:19 pm","url":"https://shroudstory.com/2013/02/23/to-hide-away-and-suppress-the-cluny-medal/","cat":"history","id":"comment-25445","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"To hide away and suppress the Cluny Medal","post":"Typo: key-like shaped bloodstains\n\n","date":"February 23, 2013 at 4:22 pm","url":"https://shroudstory.com/2013/02/23/to-hide-away-and-suppress-the-cluny-medal/","cat":"history","id":"comment-25432","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"To hide away and suppress the Cluny Medal","post":"NOTE: The trellis work on the Lirey Medaillion reverse side, together with the herring bone pattern on the obverse side do echo to the same combination carved in alabaster we can observe on the (4th?)-6th c. St Mark’s cathedra; trellis work in reference to the Holy Mandylion and herring bone to the Holy Shroud.\n\n","date":"February 25, 2013 at 3:56 pm","url":"https://shroudstory.com/2013/02/23/to-hide-away-and-suppress-the-cluny-medal/","cat":"history","id":"comment-25661","author":"Max Patrick Hamon","site":"shroudstory"}]
