[{"title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route","post":"Some people believe in miracles and some don’t.  Our Lord Jesus left this for us as a reminder of who and what he is and to remember what he went through in his human body for us. His physical agony and death were foretold, we need not be surprised. We should accept his gift to us..\n\n","date":"August 15, 2014 at 6:21 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","id":"comment-144020","author":"Emmett McMahon","site":"shroudstory"},{"title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route","post":"The Edessa-Constantinople route everyone knows cannot so easily be dismissed.  But I say to Charles, research on and coordinate with the experts to explore his hunch.\n\n","date":"August 15, 2014 at 8:41 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","id":"comment-144040","author":"Andy","site":"shroudstory"},{"title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route","post":"Charles has now come to making the point that Shroud cloth is not such a unique weave from ancient times, such as the first century.  He refers to such complicated weaves as the Rameses girdle, but which would not require the same large size of loom as required to weave the Shroud.  He has previously been reluctant to admit the possibility of a Middle East provenance of the Shroud because linen threads are Z twist, whereas most known surviving cloths from there are S twist, although I gather this is particular to Egyptian cloth.  Perhaps it is conceivable that other Middle East linen cloth was made as Z twist.  \nA search for comparable control samples for the 1988 C-14 testing was apparently fruitless, and I believe that the only control samples that could be found were only of plain weave.  Apparently no other surviving linen specimen of 3 to 1 herringbone could be found for purpose of a control sample. \nHe expresses frustration at researchers’ unwillingness to look outside the Edessa-Constantinople route, and I think the point can be taken that perhaps the Shroud or Mandylion would not have survived long walled up in the damp climate of Edessa, which was prone to flooding.  \nResearchers have seen similarities between the Shroud image and the multitude of icons said to have been based on the Mandylion or the Image of Edessa, and this would seem to be a principal reason why the Edessa route has persisted in Shroud lore.  Certainly there was such an object as the Mandylion held at Edessa and taken to Constantinople.  Of that there can be no question.  Nevertheless there is a strong argument that there has to be some kind of connection between the Shroud image and the Mandylion image, whatever its origin.  \nI make no secret of my belief that the Shroud is the burial cloth of Christ, and bears his image.  But I cannot suppose that Jesus was in the habit of regularly wiping his face with towels or veils and dropping his image on to them, as various legendary accounts would have it.  It is not Jewish, it may even have been considered offensive, and it is certainly not scriptural.  I believe there is only one time that it ever occurred, and that was in the tomb, however that may have been caused.  Multiplying the occasions when it happened, are clearly derivative, and are merely pious attempts to explain the otherwise inexplicable of the one single proto-image.  Alternatively they are attempts to sanctify clearly derivative objects, such as icons. \nI have previously mentioned Markwardt’s theory that the Shroud was taken to Antioch and kept there.  It makes a lot of sense to me, more than taking it to Alexandria as Charles would seem to have it.  We know that Peter was first bishop of Antioch, and there is good indicative evidence that he held the burial cloths.  Markwardt suggests that the hiding of the Shroud in a wall in Antioch for safe-keeping when other relics were being pillaged or destroyed there, may be the true basis of the similar story from Edessa,  Antioch, although often prone to earthquakes, and on the Orontes, could more likely have had a more conducive climate for the cloth’s survival in a wall than Edessa.  He suggests that it was taken to Edessa only when Antioch was under threat from the Persian Chosroes.  Arriving in Edessa, it was of course not stored in a wall but in the Hagia Sophia cathedral there. \nAccounts of stories often get garbled in the retelling, and there are always local agendas which like wonders to be self-referential.  Perhaps scribes have too limited an attention span to tell the full story of what they may hear.  The truth of what actually happened is usually rather more complicated than the stories which emerge as the establishment tradition.  This would be one reason why I believe Markwardt’s theory the more credible.\n\n","date":"August 15, 2014 at 8:57 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","id":"comment-144043","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route","post":"Hello Mr. Daveb of Wellington. I normally do not post outside my own channel anymore but I felt compelled to so hear goes some wild speculation.\nI think of Joseph of Arimathea purchased the closest approximation to what he could find that would substitute for a burial shroud and purchased a fine linen table cloth/court hanging type linen from a merchant outside the Damascus Gate before going to see Pilate to get permission to get the body.  Sometime around 3:30 PM that afternoon. \nI think the head cloth is also purchased at the same time the Shroud linen is obtained, then Joseph of A returns to Golgatha where the head cloth was placed over Jesus and then he goes the route back through the Damascus Gate to see Pilate.\nThe distance between Golgatha and the Damascus Gate is a short distance.\nI think the time gap between leaving Golgatha, going to see Pilate and returning is about 1 hour.    I think Jesus is taken down from the cross around 4:30 to 5:00 PM,  sun sets between 6:30 and 7:00 PM, not much time left. \nLikely some kind of exchange of money between Pilate and Joseph of A.   Scripture account says Joseph went boldly to Pilate, begged/craved the body of Jesus, as in “He really wanted it bad and was going to get the body of Jesus no matter what it cost”\nDuring the Passover there will be a lot of different merchants from surrounding countries coming in to sell their textiles/goods, the Damascus Gate is the main entrance to the city and the place where a merchant would have the highest probability of selling their goods.  Big festival events always draws a lot of merchants selling goods, fully well knowing a lot of rich people are around with money to spend.   Enter Jospeh of A. \n Joseph of A came upon a merchant selling linens with the right dimensions that could be used as a head cloth and burial shroud and he bought them.  If there would have been a plain weave white linen available quickly,  I believe he would have got that instead.\nThe herringbone twill must have been the best option at the moment.\nFabric on Shroud and head cloth are same thickness, same threads per surface unit.   Evidence the same weaver was at work on both cloths.   Perhaps one being a table napkin, the other a table cloth,  to be used for the Passover Meal.  instead they find a greater purpose.     A different kind of lamb/meat was placed on the linen fabric that the weaver could not have foreseen in his/her wildest dreams.   \nObviously I believe The Shroud is authentic.   I am going to stop here.  I enjoy reading your commentary.\n\n","date":"August 16, 2014 at 4:34 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","id":"comment-144155","author":"Dave Hines","site":"shroudstory"},{"title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route","post":"‘Researchers have seen similarities between the Shroud image and the multitude of icons said to have been based on the Mandylion or the Image of Edessa, and this would seem to be a principal reason why the Edessa route has persisted in Shroud lore.’\nIf this is indeed the reason,then you have to deal with the great authority on Roman images, Paul Zanker’s contention in his The Mask of Socrates that the bearded Christ first appears in Rome about  AD 300 and can be seen, for instance, in the example in the church of San Pudenziana in Rome of c. 390.\n Sceptics would, I assume,  say that the image on the Shroud was actually derived from previous depictions of the bearded Christ rather than the other way around. I leave the question open for discussion.\nAs I have made clear, the ingenuity of weavers from very early on was impressive- weaving is after all the main skill of daily life and aristocrats, then as now, wanted only the best. The same was true of the Middle Ages and Renaissance- you only have to look at the pictures of aristocratic sitters to see what amazing things weavers were capable of. Nothing particularly special about the Shroud here. ( I was only making this point because Wilson persists in saying that the Shroud was especially fine when it clearly is not in comparison to the finest linens of the first or second centuries.)\nThe problem for earlier textiles is survival and if one is beginning from the first century then it is inevitable that one considers environments in which linen survives -this is how new avenues of research get started- they may lead nowhere ,of course, but if one ignores them completely then the subject stagnates. I am really amazed at how little new thinking seems to be emerging from the St. Louis conference- although I shall, like others, wait and see.\nMeanwhile I applaud Hugh for trying to get new thinking out there. Good  research starts with imagination. Suppose  the Shroud is authentic, then work through all the different environments and communities where it might have been preserved. I see no particular reason to privilege Antioch above other possibilities from the speculative ‘evidence’ that Markwardt can provide in support of his thesis.\n\n","date":"August 15, 2014 at 11:01 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","id":"comment-144053","author":"Charles Freeman","site":"shroudstory"},{"title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route","post":"Hello Mr. Charles Freeman:\nI am not a expert, but I can tell you where I believe The Shroud was kept in the early centuries but I cannot prove it.  I want to note for the record immediately what I am posting is  pure speculation.   I would expect my theory to be ridiculed on this blog and not looked at seriously.  I am not going to debate anyone on this blog about this subject.  It is a speculative theory only . If I am proved wrong I have no problem standing up and saying “sorry I was wrong about that”\nAnyways here goes, I believe the Shroud was moved to the CALLIXTUS catacombs underneath Rome.  I believe Peter himself brought it there and met with Paul of Tarsus and together they decided upon a place to store it.  This is a place no one would expect it to be hidden and would be extremely difficult for enemies of the Christians to find because the catacombs go on for about 12 miles.   There is a bunch of tombs down there, it would blend in perfectly with the motif. \nI believe there is reference to Shroud being moved to Rome in scripture and Paul of Tarsus gives Peter a code name, Carpus, because Peter was a fisherman. Carpus is Peter.  In the letter he says he left a “The Shining Wrap”  a “The Illuminated Shroud”  with this guy and now he wants it brought to Rome Italy.  He mentions Troas but I think he is referring to  Constantinople or some other city so if his letter is intercepted by his enemies they will be looking for some guy in Troas named Carpus when in fact such a person does even exist.\n  I believe the person who had this “Shining Wrap”  is really Peter and he is not in Troas either, who knows what city he is really talking about.\n  I believe at times Paul of Tarsus is anticipating some of his letters could be intercepted and is writing in codes, so that in the case his enemies intercept his letter, he is not giving valuable information out, like for example where the Mandylion/Shroud of Turin is located.  He was the leader of the early christian movement, a highly intelligent person with good gift of foresightedness.   Again, a lot of speculation here. \nEither The Shroud or another very good reproduction of it had to be in those catacombs at some point the early centuries to be able to do the frescoes. I believe The Shroud served as the role model to reproduce/ paint them.  \nI believe this is also the reason there are microscopic traces of cinnabar and hematite on the cloth.  I do not think it is out of line or crazy to believe that they must have had a good supply of cinnabar and or hematite in the tombs to be able to do all the frescoes and some traces of that organic material  got onto the Shroud during the time it was in the catacombs. \n The red flecks McCrone (1980, 2000) claimed were hematite had an organic matrix (Heller 1983, Rogers 2004).\nIt is interesting to note. that cinnabar was also used in ancient burials of high profile people, Lords and Queens and is associated with immortality and resurrection.  \nThe Maya culture believed that the color red was a symbol of death and second birth. The dead bodies had scraps of cinnabar, or red sulfide, laid on them to substitute pigment.\nAs the color red was associated with death, corpses were sprinkled with the shavings of the red mineral cinnabar and were then wrapped in cotton for burial. They believed the person  would then more easily reach the afterlife.  (Sorry, that is a whole different subject) \nThere is cinnabar on The Shroud and it possibly could have come from the catacombs or from people placing their paintings on The Shroud and even a combination of both things. \nI think part of the reason Rome converted to Christianity was because The Mandylion/Shroud was there.   Part of the reason.  Not all of it of course.\nPerhaps shown to groups of people at very carefully chosen times and then brought back to it’s hiding place in the tombs. \nI am clearly aware that this cannot be proved beyond a reasonable doubt.  Not even close.\nSpeculative theory only and some flimsy circumstantial evidence that supports,  I am not the smartest guy, but not dumb enough to spend to much time on this or include it in my closing argument for authenticity.   At least not yet, not without a bit more physical evidence and some scripture that supports it.\nThere exists this possibility I am correct. My suspect is the Catacombs in Rome.\nWe cannot eliminate my suspect.\nOften times the suspect who cannot be eliminated is the person responsible for the act.\nPerhaps we should bring my suspect in for questioning, and start probing into his past and see what we find.  See if we can get a straight answer from him.   Go into his cell phone records and bank accounts.   Follow the money trail and see where it leads.\n\n","date":"August 16, 2014 at 1:55 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","id":"comment-144136","author":"Dave Hines","site":"shroudstory"},{"title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route","post":"Dave: the evidence is so limited that speculation rules. If, as some argue, it was Peter who took possession of the Shroud, then, of course, it would be far more likely that  he took it to Rome with him than left it concealed in  Antioch (the Markwardt thesis) where the damp would have most likely got it( remember there is no sign of damp damage on the Shroud). Those who are attached to the Vignon thesis would then be able to explain why the first representations of the bearded Christ come from Rome rather than the east.\nSo yet another area for further research, especially among the art of the catacombs!\nHowever, personally. , I haven’t seen any evidence that upsets my default position that the Shroud is medieval- it is too easy to link an ‘icon’ to e Shroud without any other supporting evidence- as you will see from catacomb art ,there are no shortage of icons around and they can’t all be the Shroud!\n\n","date":"August 16, 2014 at 3:00 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","id":"comment-144144","author":"Charles Freeman","site":"shroudstory"},{"title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route","post":"P.S.  You also have a wealth of information about the transfer of relics from the catacombs to the rest of Christian Europe so even more scope for research.\nI continue to be amazed that no one have even considered these avenues of research. I doubt that they would necessarily lead anywhere but if you buy into the “Peter took possession of the Shroud” thesis, then the Rome to northern France route is more likely than the Antioch/ Edessa/ Constantinople/Lirey route which is full of gaps. If Christians were, as the evidence suggests, venerating the tomb of Peter as early as AD 150, then they would have been likely to have been venerating the relics that he brought with him and the Christian communities would have preserved them through the next centuries in the catacombs. Still the problem of damp but at least there would have been a community consistently giving them care. This is an alternative to Alexandria and Egypt where again there were strong early Christian communities ( going back to the first century as the surviving papyri of early Christian texts show) who would not have had to worry about the problem of damp!\nBut all these are speculation, it is just that some are more probable than others  and I put the Edessa route as among the least probable.\n\n","date":"August 16, 2014 at 3:23 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","id":"comment-144148","author":"Charles Freeman","site":"shroudstory"},{"title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route","post":"Good Evening Mr. Charles Freeman,\n I guess I am not the only person wrapped up in the Shroud in the middle of the night.  thanks for responding so quickly.\n I am going to look into this matter deeper in the manner you are suggesting.\n I am going to take a break now and let some other people “sound off their instruments”   Hopefully  some good sounding notes.   I need some time to be silent/think/pray on the matter.   Buenas Noches.\n\n","date":"August 16, 2014 at 4:52 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","id":"comment-144157","author":"Dave Hines","site":"shroudstory"},{"title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route","post":"Hello Mr. Freeman:\nYou inspired to make a video.  I wanted you to see it.   This happened because of our conversation on this blog site.  thanks.","date":"August 18, 2014 at 6:35 pm","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","id":"comment-144621","author":"Dave Hines","site":"shroudstory"},{"title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route","post":"Hi David! Good video, although I think the fresco looks more like Johnny Depp than Peter O’Toole (Lawrence of Arabia). In fact, of course, exactly the same effect can be achieved using almost any two full face portraits of anybody at all, so is useless as a diagnostic identification tool.\nHowever, it provokes a thought. I have recently returned to my country through an ePassport facial recognition machine, which is able to make fairly reliable identifications of people using only their passport photos and their actual appearance at the booth. Their skin-tone, hair-length, clothes and other variables do not seem to matter. It would be interesting to try to ‘smuggle’ portraits of Christ, Depp, O’Toole, da Vinci, Durer and various others past such a machine, using the Shroud as their passport photo. I wonder how they’d get on.\n\n","date":"August 19, 2014 at 12:30 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","id":"comment-144662","author":"Hugh Farey","site":"shroudstory"},{"title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route","post":"Hi Hugh,  good to hear from you.   In the case of this fresco, it would be a good idea to get 7 of the top experts in this field of math science to map out the points of congruency and see if they come up with the same numbers.  Preferably  researchers who could care less whether the Shroud is genuine or not.   People that just love doing accurate math. That being accomplished it would then be necessary to calculate the odds of probability and chance that the Shroud was not used as a role model for the image.\nThat is my idea anyway.   Yes, 7 different experts not just 1 person,  but 7.   Just like they were supposed to do with the Shroud samples, take 7 samples from 7 different areas.   Instead they took only 1 sample and cut it into 3 pieces.    Let’s not make that mistake with the tests done to establish a accurate number of  congruency points on this Fresco to The Shroud Image.  That way we can show to the world that we can learn from our mistakes.  How was your trip?   What country do you live in?\n\n","date":"August 19, 2014 at 3:02 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","id":"comment-144684","author":"Dave Hines","site":"shroudstory"},{"title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route","post":"Hi, I am not a expert in Math Science or qualified to accurately calculate the number of congruency points between 2 images.  But I read that facial images are polytypic or complex in structure, and the forensic criteria for declaring two facial images to be the same is 45 to 60 points of congruence. The detail and the points of congruence would depend both on the skill of the artist as well as whether he was working directly from the Shroud image or from copies of varying degrees of accuracy. Control studies with both actual faces and various unrelated art works were typically found to have 10 to 35 points of congruence which is statistically and forensically insignificant.  150 points matching is significant, if the number is correct. How hard can it be to verify that?    We do have both images intact still.\n\n","date":"August 19, 2014 at 3:31 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","id":"comment-144690","author":"Dave Hines","site":"shroudstory"},{"title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route","post":"Dave- you need to read Paul Zanker  The Mask of Socrates -you can find it online without payment-  to sort out the bearded Christ in Rome where the earliest examples tend to be. (It would follow that if you support the Vignon markings, you would also need to support the Shroud being known early on in Rome  and if you support the view that Peter took charge of  the Shroud in Jerusalem  then it makes sense that he would have taken it with him to Rome.)\nI am not an authenticist but have no problems in suggesting avenues of research that can be pursued by authenticists and non- authenticists alike. I find ‘the Image of Edessa is the same as the Shroud’ idea totally unconvincing , even more so when the other ways in which a relic from the first century that would have been very vulnerable to damp might have reached northern France  have not even been explored.   I discount any theory that requires the Shroud to have been hidden away especially in a wall in an area that is humid. Then as now it needs constant care and if authentic, would have needed to have  been with a stable Christian community from the earliest times- Alexandria, Rome and others known to us- are possibilities.\n\n","date":"August 19, 2014 at 4:48 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","id":"comment-144700","author":"Charles Freeman","site":"shroudstory"},{"title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route","post":"Good Evening Mr. Charles Freeman:  There is a fresco believed to be from 1st or 2nd century found in the Callistus Catacombs that I wanted you to see.  I do not know how to post a photo on this site so I posted 4 of the photos on facebook.  Starting with The Shroud, the image as it appears on the linen, (not the positive image)  then slowly blending the fresco into the Shroud and then the fresco by itself.   I did not alter any of the images, only blended them together using Sony Vegas Editing Video Editing software.\n  https://www.facebook.com/robert.page.5688/photos\nFeel free to copy and paste the photo link above to see some visual “evidence” \nI own a vacation rental property so you’ll see photos of my house in Costa Rica and some pictures of me,  Of course you don’t have to look at those.\n(Anyone on this blog site is free to look at these photos of Jesus as well)\nThis is something that was written about the fresco that I copied and pasted.  I don’t know how reliable the source is.\nThe Callistus Fresco\nThe Callistus Fresco is an Image of Jesus whose authenticity is qualified by its Source and history. The artist of the beautiful fresco of the Face of Jesus found in the Callistus Catacomb is anonymous, but it is logical to assume that someone who had seen Jesus painted it, maybe a close disciple of His, as only the early Christines gathered in the Catacombs. The Fresco not only resembles the likeness of Jesus on the two known Relics that have an imprint of His Image and His only known Real Photo, but it has 150 PC with the imprint on cloth of the Face of Jesus on the Holy Shroud of Turin. Besides being a magnificent art piece, the ‘Callistus Fresco’ is the first and most ancient portrait known of Jesus the Christ. It is believed to be of the first century as Pope Urban II is shown in the painting looking intently at the face of the Christ. Pope Urban II reigned from 222-230 AD\nAnyone on this blog site is free to look at these photos as well.\n\n","date":"August 17, 2014 at 2:57 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","id":"comment-144315","author":"Dave Hines","site":"shroudstory"},{"title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route","post":"Hello again Mr. Charles Freeman\nAdditional  comment on old textiles and why I think The Shroud fabric remains in good condition despite it’s age.\n Because it has a micro thin layer of myrrh and aloes on it.\nMyrrh is like tree sap with similar chemical properties to that of cellulose acetate, that would help preserve the linen. \nThese are some comparative notes I wrote on the subject.  \nCOMBINED CHEMICAL PROPERTIES OF STARCH FRACTIONS & PECTIN IN COMPARISON TO MYRRH AND ALOES AS MENTIONED IN THE GOSPEL \nThese substances (Starch fractions & Pectin) were found to make up the micro thin layer where the image of The Shroud of Turin Resides.  (By Ray Rodgers)\nLet’s begin by defining what starch & pectin is made up & see if the chemical properties match up with “the 100lb weight of myrrh and aloes” as mentioned in the Gospel of John. \nAmylose was found on the Shroud of Turin (by Ray Rodgers) and is a spiral polymer made up of D-glucose units.   It is the main component which makes up starch. Starch and cellulose are polymers derived from the dehydration of D-glucose.\nStarch is a polysaccharide (meaning “many sugars”) made up of glucose units linked together to form long chains. \nThe main component of Pectin is D Galacturonic acid, which is a sugar acid, an oxidized form of D-Galactose.\nPectin is a polysaccharide of 1 – 4 linked polygalacturonic acid with intra chain Rhamnose insertion, neutral sugar side chains and methyl esterification from many of the rhamnose residues, side chains of various neutral sugars branch off. The neutral sugars are mainly D-Galactose, L-Arabinose and D-Xylose, \nPECTIN is also a uronic acid,  Naturally occurring uronic acids are D-glucuronic acid, D-galacturonic acid.\nLet’s make a simplified list of what Starch and Pectin are made up of.\n1.Uronic Acids\n2.D Gluceronic Acid & D-Galacturonic acid.\n3.Polygalacturonic acid  (An oxidized form of D Galactose)\n4.Glucose\n5. L-Arabinose\n6.D-Xylose\n7.Rhamnose\nNOW LET’S TAKE A LOOK AT THE CHEMICAL PROPERTIES OF MYRRH AND ALOES IN COMPARISON TO STARCH AND PECTIN \nMyrrh resin contains D Galactose and L Arabinose, Xylose and 4>0 methyl D-Gluceronic acid  From the resin yields Uronic Acid 19% D-Galactose 60%\n L-Arabinose 10% and L-Rhamnose 5% \nMany of the health benefits associated with Aloe vera have been attributed to the polysaccharides contained in the gel of the leaves.\nA variety of polysaccharides are present in the cell wall matrix. An overall carbohydrate analysis showed that the cell walls of the aloe leaf hold mainly polysaccharides, cellulose and pectic polysaccharides whereas the skin of the leaf contains in addition significant quantities of xylose-containing polysaccharides\nAloes contain cellulose and hemicellulose and store carbohydrates.\nSaccharides in aloes are,  Mannose, Glucose, L-Rhamnose, Aldopentose\nTHE PRIMARY POLYSACCHARIDE IN ALOES IS A PECTIC SUBSTANCE.\nMYRRH & ALOES                                                 STARCH & PECTIN\n1. Uronic Acids                                                      1. Uronic Acids\n2. D Gluceronic Acid & D-Galacturonic acid.         2. SAME\n3. D Galactose                                                      3. Oxidized D Galactose\n4. Glucose                                                            4. Glucose\n5.  L-Arabinose                                                     5. L Arabinose\n6. D Xylose                                                            6. D Xylose\n 7. L Rhamnose                                                     7. L Rhamnose \nDr. Baima Bollone a professor of forensic medicine in Turin claimed to have found myrrh and aloes in the BLOOD by antibody-antigen testing. ( A good way to test for it)\nOf course Myrrh resin also contains many volatile oils and other chemical properties such as (limonene, eugenol, pinene, terpenes, sesquiterpenes, esters, cinnamaldehyde, cuminaldehyde, cumic alcohol, heerabolene, dipentene, m-cresol and cadinene), resins (myrrhin, alpha-, beta- and gamma-compiphoric acids, commiphorinic acid, alpha- and beta-heerabomyrrhols, heeraboresene, commiferin, campesterol, beta-sitosterol, alpha-amyrone\nAll of which would have evaporated and no longer be present over the course of almost 2000 years  with only the remnant of the sugars/carbs of the myrrh remaining.\nThere is, on the outermost fibers of the cloth a clear washing residue: a thin coating of starch fractions and the various saccharides found in soapwort: glucose, fucose, galactose, arabinose, xylose, rhamnose, and glucuronic acid.\nSugars in myrrh and aloes are the same sugars in soapwort\n1.Glucose\n2. Galactose\n3. Arabinose\n4. Xylose\n5. Fucose\n6. Gluceronic Acid\n7. Rhamnose\nAnd there came also Nicodemus, which at the first came to Jesus by night, and brought a mixture of myrrh and aloes, about an hundred pound weight. Then they took the body of Jesus, and wound it in linen clothes with the spices.\nI believe one of the reasons this was done, was because the Lord wanted the fabric preserved so it would last.  Myrrh would react to laser light by changing color, light yellow, medium yellow/ sepia.  The color where image resides on Shroud fabric is a dead on match to myrrh resin, no one can deny that.    D Galactose is a reducing sugar, the main ingredient in myrrh resin.  In this way I agree with a maillard reaction but not with ammonia, with light.  Laser light, in straight lines.\nI believe Mr. Light is responsible for The Shroud image,  the other suspects are eliminated beyond any reasonable doubt, note I said reasonable.\nNone of the other suspects possess the intelligence and the ability to encode distance information as seen on Shroud.  Eliminate Mr. Paint, and Mr. Imprint and also Eliminate also Mr. Ammonia,  not smart enough and he stinks.\nMr. Light is the last remaining suspect who can’t be eliminated as being responsible for Shroud image.  He’s the fastest and the smartest.  Sorry to get off track.    My apologies to everyone on this blog site for getting off the subject Charles asked about here at the end.\nTo produce Shroud image you need to be fast and smart.  Mr. Light is both.\nI do not normally post outside my own channel,  I refuse to get into a negative argument with anyone.   I am peace seeking person, not a negative arguments.   Bear that in mind in responding to this.  Thanks.\n\n","date":"August 16, 2014 at 3:39 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","id":"comment-144151","author":"Dave Hines","site":"shroudstory"},{"title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route","post":"Dave H: I think you need a smoking gun, if your catacomb hypothesis is to get any legs.  Wilson had them for his Edessa theory, and Markwardt had them for Antioch.  Alexandria has no legs as yet.  I predict that Markwardt may spring one or two surprises at St Louis. \nConcerning the Pastoral Letters attributed to Paul addressed to Timothy and Titus: The extract referring to “bring the cloak I left with Carpus at Troas” is II Tim 4:13.  It has been discussed before on this site, and the word used generally translated as “cloak” is unknown elsewhere.  It’s possible it may be some other object, even a carrying-case for the parchments mentioned in the same sentence.  Opinion is divided.  However an Encyc Brit article asserts that the Pastoral Letters are pseudonymous, and probably not written by Paul at all.  So caution is required.  Re these Pastoral Letters the article states: \n“They are all pseudonymous, using Paul as an epistolary model and using pseudonymous devices, such as naming individuals known to be Paul’s co-workers. Paul’s authority is invoked to lend credence to the teachings contained in the letters: the avoidance of heresy, holding to sound doctrine, and piety of life. The author is anonymous, the place of writing and the addressees are unknown, but they probably are later spiritual children of Pauline teaching. The date of the letters is about the turn of the 2nd century.”\n“II Timothy uses the background of Pauline imagery most fully. It is cast at least in part in the testament form to Timothy as his spiritual heir because Paul is depicted as suffering, fettered in prison, and awaiting the martyr’s crown. He exhorts Timothy and through him the church to share in these sufferings as they will eventually share in glory.”   \nMake of this what you will.\n\n","date":"August 16, 2014 at 4:51 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","id":"comment-144156","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route","post":"Hello Mr. Daveb of Wellington,  I like the title.  It fits in with the genre of other famous figures in history.  Paul of Tarsus, Joseph of Arimathea, Jesus of Nazareth, Daveb of Wellington.   Your right, the Paul of Tarsus passage is flimsy.  We cannot even prove beyond a reasonable doubt that he is even the author.   That hurts.   We cannot even complete step 1. I am dropping the display from my closing argument because of that.  To many clinks in the armor of the passage.\nUnless there is a historical record found saying “And Paul of Tarsus and Peter took the 14′ long Mandylion /Shroud  and hid in the catacombs of Rome”\n It is my belief only, after it’s mission was completed in Rome, meaning Rome converted to Christianity, the Shroud was moved back to Edessa.  (Hugh Farey would say I need to see physical evidence of that please)\nJust looking at the location only, (the catacombs)not saying that The Shroud was kept there.  It would be a good location to hide it.  12 miles long, and 4 or 5 different levels, A big underground city.  A bunch of graves and tunnels, imagine having to go in and find it, even knowing it was there.   You would have to start exhuming several dozen into hundreds of bodies or looking for hidden places within walls, ect.\nThere is what is believed to be a 1st Fresco of Jesus (perhaps as late as 3AD) found in these catacombs, it is one of the closest matches to The Shroud I have seen.\n I know that does prove the authenticity of The Shroud.  No one piece of evidence does. Only when all of the evidence both for and against authenticity is combined together and each small stone/piece of evidence is given a numerical value and placed on a scale can we see where it is tipping.\nWe would need a group of experts to assign and agree upon the weight value of each piece of evidence. both for and against.    Then bring out the scale and start the process.\nSee which way the scale tips at the end. \nLIke I said previously,  I enjoy reading your commentary.\nPEACE\n\n","date":"August 16, 2014 at 6:04 pm","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","id":"comment-144257","author":"Dave Hines","site":"shroudstory"},{"title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route","post":"Hello Mr. Daveb of Wellington:  Is there a way to post a photo on this site?   There is a fresco I wanted to show you from the callistus catacombs.  Let me know, thanks.\n\n","date":"August 17, 2014 at 2:11 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","id":"comment-144309","author":"Dave Hines","site":"shroudstory"},{"title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route","post":"Good Evening Mr. Daveb of Wellington.   Here are some photos of what is believed to be a 1st or 2nd century fresco of Jesus from the Callistus Catacombs.\nhttps://www.facebook.com/robert.page.5688/photos\nI blended the face of the fresco with the Shroud image from the linen, because that is what they saw, not the positive image.   Then there are photos of each separated.\n They are on the top page, front row.\n(There are also a number of photos of my vacation rental property in Costa Rica that you are free to look at if you want)\nThis was written about the fresco.  I do not know how reliable the source is.\nThe Callistus Fresco\nThe Callistus Fresco is an Image of Jesus whose authenticity is qualified by its Source and history. The artist of the beautiful fresco of the Face of Jesus found in the Callistus Catacomb is anonymous, but it is logical to assume that someone who had seen Jesus painted it, maybe a close disciple of His, as only the early Christines gathered in the Catacombs. The Fresco not only resembles the likeness of Jesus on the two known Relics that have an imprint of His Image and His only known Real Photo, but it has 150 PC with the imprint on cloth of the Face of Jesus on the Holy Shroud of Turin. Besides being a magnificent art piece, the ‘Callistus Fresco’ is the first and most ancient portrait known of Jesus the Christ. It is believed to be of the first century as Pope Urban II is shown in the painting looking intently at the face of the Christ. Pope Urban II reigned from 222-230 AD\n\n","date":"August 17, 2014 at 3:10 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","id":"comment-144317","author":"Dave Hines","site":"shroudstory"},{"title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route","post":"This discussion between DaveB, Dave H and Charles is a model for how I wish we all interacted on this blog all the time. Respectful, points granted, points challenged and in the end rich food for thought for all. Thank you gents!\n\n","date":"August 16, 2014 at 12:17 pm","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","id":"comment-144208","author":"David Goulet","site":"shroudstory"},{"title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route","post":"Thanks, David. Despite frequent claims that the Shroud is the most researched artefact in history, there are still a lot of areas, among them those raised here, where research has not yet even begun.\n\n","date":"August 16, 2014 at 1:33 pm","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","id":"comment-144220","author":"Charles Freeman","site":"shroudstory"},{"title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route","post":"My concern is less to do with research that has not yet been done through lack of academic curiosity. It’s to do with pre-emptive so-called research, read rhetorical dissing, designed to block off certain avenues, declaring them to be bad or dangerous neighbourhoods. \nShroudology reeks of agenda-driven control-freakery. I expect to be banned (or issued a yellow card) for saying that. So I’ll say it again. Shroudology reeks.\n\n","date":"August 16, 2014 at 2:16 pm","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","id":"comment-144223","author":"Colin Berry","site":"shroudstory"},{"title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route","post":"Good Afternoon Mr. Charles Freeman:   When it comes to authenticity of The Shroud a person is either convinced or not convinced.  There is no in between.  Undecided is not convinced.   Harboring some doubt is not convinced.   The “not convinced side” compels people to go way outside their normal comfort zone and actually have to start learning something new.  Shroud research makes it necessary to study art & literature,  science, math, history, add infinitum to the list of different paths a person could be pursuing and where that person will eventually wind up as a result of launching a investigation in the authenticity of The Shroud.  It is positively life transforming.\n If we did not have the “not convinced side” looking for the clink in the armor of The Shroud  it would take all the fun out of Shroud research.  There would be far less urgency to learn anything new.   A person setting out to prove the image was man made could wind up discovering some new way of making images that could make that a person a millionaire.\nOr someone could find a way to change cinnabar into gold, because The Shroud forces you to have learn things about chemistry and physics, whether you want to or not.\nIf this Shroud Blog Site was all one sided toward authenticity it would take away from the excitement, fun and joy of doing the research.  To all those “not convinced” The Shroud is authentic and posting comments,  thank you.  I am a better man because it.  There is the old saying, “Success is about the person that you become”    Shroud research has made me a better person.  Without the skeptics, my knowledge of The Shroud would be at least 80% less than what it is.  Keep posting those challenging comments Mr. Freeman!\n\n","date":"August 16, 2014 at 7:04 pm","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","id":"comment-144263","author":"Dave Hines","site":"shroudstory"},{"title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route","post":"CF: “… frequent claims that the Shroud is the most researched artefact in history,”\nCB: “Shroudology reeks of agenda-driven control-freakery.” \nIt has sometimes been stated that it is also the most badly researched artefact in history.  But I wouldn’t extend that comment to all research on the relic.  We do know a great deal more about it now than was known when Secondo Pia took his first photographs in 1898. \nI think the “freakery” accusation can be made because the object is so enigmatic.  It is a puzzle which still eludes a solution.  Historically scientific puzzles have often seemed to generate “freakery” ever since the days of the phlogiston theory, and even earlier.  The search for a solution to the puzzle means a quest into the unknown;  Lines of enquiry open up possibilities; sometimes there appear to be promising leads, but then end up as a dead end.  The researcher has an investment in his work, it becomes his baby, and he defends it against all onslaughts.  The more enigmatic the puzzle, the longer time that a solution delays its emergence.  Meantime the various theories thrive, no matter how outlandish they may appear to be.  Difficulties of access to the object of research also creates problems of discovering the solution.\n\n","date":"August 16, 2014 at 4:21 pm","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","id":"comment-144242","author":"daveb of wellington nz","site":"shroudstory"}]
