[{"title":"Translation: When you come, bring the Shroud of Turin","post":"Very interesting. http://www.bibal.net/04/proso/psalms-ii/pdf/dlc_tanakh-pauls-cloak-b.pdf provides some intersting exegesis on the point.\n\n","date":"December 3, 2013 at 6:15 am","url":"https://shroudstory.com/2013/12/03/translation-when-you-come-bring-the-shroud-of-turin/","cat":"history","id":"comment-55563","author":"Hugh Farey","site":"shroudstory"},{"title":"Translation: When you come, bring the Shroud of Turin","post":"Thanks, Hugh, good searching.  Essentially David Roberts is creating a story based on an extremely rare Greek word, in fact the only place it can be found is in Tim 4:13. English transliteration is “phailonen”, and you won’t find it in your on-line Greek lexicons.  Now try an English-Greek lexicon, look up “cloak”, you’ll get about 46 entries, including “phainole” and interestingly, “mandua” (check mantle, mandylion?).  Jerome tranlsates phailonen as Latin “paenulam” =  a woolen cloak, and translators after him have followed this lead. \nHugh’s ref on “Paul’s cloak” makes some very relevant comments. The full text of Tim 4:13 tells Timothy to bring with him the cloak(??) that Paul left with Carpus, along with the books, but especially the parchments. One interpretation is that the phailonen may have been some kind of carrying case (book jacket?) for the literature. Paul would have had easy access to obtaiing a cloak for himself in Rome; alternatively if a cloak is indeed meant, maybe he intended Timothy to use it on the jouorney as winter was approaching. \nI think it verges on the preposterous to suggest as the video does,that Paul was toting the Turin Shroud around with him as a visual aid to convert the pagans, and he wouldn’t be leaving it with some mate in Troy. If it was in anyone’s possession at all, it would certainly be one of the twelve, James or Peter, not the come-lately-to-the-scene Paul.\n\n","date":"December 3, 2013 at 7:31 am","url":"https://shroudstory.com/2013/12/03/translation-when-you-come-bring-the-shroud-of-turin/","cat":"history","id":"comment-55595","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Translation: When you come, bring the Shroud of Turin","post":"According to the New American Bible, Revised Edition, 2011: “When you come, bring the cloak I left with Carpus in Troas, the papyrus rolls, and especially the parchments.” This strikes me as being a disrespectful way of referring to the Holy Shroud. I’m working on a review of a book, written by an atheist, which argues that the Holy Shroud is authentic (Thomas de Wesselow, The Sign: The Shroud of Turin and the Birth of Christianity) in order to prove that life ends in the grave. The author was dissatisfied with the theories that explained the rise of the Catholic Church, and got a bright idea.  His thesis is that 1st century people were more driven by anthropomorphism and animism than they are today. When they saw the Holy Shroud, they assumed that Jesus was alive. This explains 1) the renewed fellowship of Jesus’ disciples after the crucifixion, 2) Paul’s conversion, 3) why Jesus came to be called the Messiah/Christ , 4) Sunday became a day of worship, and 5) the emphasis on the Jewish belief in the resurrection of the dead.\n\n","date":"December 3, 2013 at 8:38 am","url":"https://shroudstory.com/2013/12/03/translation-when-you-come-bring-the-shroud-of-turin/","cat":"history","id":"comment-55635","author":"David Roemer","site":"shroudstory"},{"title":"Translation: When you come, bring the Shroud of Turin","post":"More interesting and only now becoming known is the Gospel of the Hebrews an ancient 2nd century text stating that Jesus himself gave the ”linen cloth” to the servant of the priest prior to His appearance to James, recently added to wikipedia. I believe it was Josephus the servant of Nicodemus who helped bury Jesus.\n\n","date":"December 3, 2013 at 9:03 am","url":"https://shroudstory.com/2013/12/03/translation-when-you-come-bring-the-shroud-of-turin/","cat":"history","id":"comment-55650","author":"Vincenzo Giovanni Ruello","site":"shroudstory"},{"title":"Translation: When you come, bring the Shroud of Turin","post":"The 3-shaped bloodmark on the forehead is interpreted as a literal reference to the number three (9:40). However, Hindu numerals did not yet exist at the first century.\n\n","date":"December 3, 2013 at 10:22 am","url":"https://shroudstory.com/2013/12/03/translation-when-you-come-bring-the-shroud-of-turin/","cat":"history","id":"comment-55680","author":"Jos Verhulst","site":"shroudstory"},{"title":"Translation: When you come, bring the Shroud of Turin","post":"“Is it a bit of a stretch?”\nAnswer: No. It is a very big stretch and not a “bit of a”.\n\n","date":"December 3, 2013 at 2:02 pm","url":"https://shroudstory.com/2013/12/03/translation-when-you-come-bring-the-shroud-of-turin/","cat":"history","id":"comment-55802","author":"Anonymous","site":"shroudstory"},{"title":"Translation: When you come, bring the Shroud of Turin","post":"It is interesting and I like the comparison to Elijah’s mantle.  Perhaps Paul asked for these things but there is no evidence that Timothy came through.  Perhaps the Shroud remained in Turkey for some reason.  I agree with Dave that Paul did not need the Shroud as some evidentiary proof of the resurrection.  Paul frequently refers to the “power” that accompanied his preaching.  This was not long after Pentecost and no doubt people getting healed or delivered was all the evidence they needed.\n\n","date":"December 3, 2013 at 2:45 pm","url":"https://shroudstory.com/2013/12/03/translation-when-you-come-bring-the-shroud-of-turin/","cat":"history","id":"comment-55823","author":"Russ Breault","site":"shroudstory"},{"title":"Translation: When you come, bring the Shroud of Turin","post":"There is absolutely no clear indication of the presence of a Shroud of Christ in Turkey before the middle of the 11th century (in Constantinople, not in Edessa where there was just a false relic, most probably painted, of the face of the living Christ until 944).  These are the historical facts.\nAt the time of Paul, the most logical place where the Shroud was is in some hidden place and probably still in the Jerusalem area (where the Christian Community was still present in good number until the first Jewish revolt).\n\n","date":"December 3, 2013 at 4:40 pm","url":"https://shroudstory.com/2013/12/03/translation-when-you-come-bring-the-shroud-of-turin/","cat":"history","id":"comment-55868","author":"Anonymous","site":"shroudstory"},{"title":"Translation: When you come, bring the Shroud of Turin","post":"Of course, my last sentence is only a hypothesis but, to me, it is the most probable in regard of the fact.\n\n","date":"December 3, 2013 at 4:40 pm","url":"https://shroudstory.com/2013/12/03/translation-when-you-come-bring-the-shroud-of-turin/","cat":"history","id":"comment-55870","author":"Anonymous","site":"shroudstory"},{"title":"Translation: When you come, bring the Shroud of Turin","post":"in regard of the facts…  Sorry.\n\n","date":"December 3, 2013 at 4:41 pm","url":"https://shroudstory.com/2013/12/03/translation-when-you-come-bring-the-shroud-of-turin/","cat":"history","id":"comment-55871","author":"Anonymous","site":"shroudstory"},{"title":"Translation: When you come, bring the Shroud of Turin","post":"The authorship of the Pastoral letters including II Timothy is disputed. The language and linguistic peculiarties do not fit the bulk of the Pauline corpus, the references to journeys contradict Paul’s own description and those in Acts, the expectation is of a church with an earthly future rather than an impending end-time, the letters don’t appear in an early 3rd c. manuscript, and there is no clear attestation of them until the end of the 2nd century. References to Paul’s various known associates may be an attempt to give some credibility to a Pauline authorship, and the verse II Tim 4:13, (Bring the books & manuscripts with you) may be a similar attempt. \nIt would seem that Jerome thought the word “phailenon” a typo, for the word “phainole”, and others followed likewise. Alternatively it might have been a short-lived new word perhaps for a carrying case for the books, that not even Jerome was aware of. \nThere are several better and more viable explanations for the whereabouts of the Shroud, than it being part of Paul’s baggage. Some of these are mentioned in Albert Dreisbach’s 2005 Atlanta paper “Lazarus and Jesus”.  \nRevelations 19:11-14 is highly suggestive; the horseman whose name is “Faithful and True” rides into battle, BUT his cloak is already soaked in blood, and behind him are armies dressed in white linen. \nThere are a number of early references to altar cloths being likened to the Shroud of Christ; VGR above mentions the gospel of the Hebrews where it is given to the servant of the priest (van der Hoeven suggests that it was Mark); there are other references to it being given to Pilate’s wife, thence to Luke, thence to Peter; there are references to Peter wearing it as a turban during ordinations, but more likely this may have been the soudarion. There are references to it being taken to Antioch by Peter. These are easily researched and can be found reasonably easily. Any of them would have more credibility than it being part of Paul’s conversion equipment.\n\n","date":"December 3, 2013 at 5:25 pm","url":"https://shroudstory.com/2013/12/03/translation-when-you-come-bring-the-shroud-of-turin/","cat":"history","id":"comment-55900","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Translation: When you come, bring the Shroud of Turin","post":"Likely Peter was secretly in Rome, and if Paul here refers to the Shroud, it doesn’t mean he was in charge of it, nor that Timothy could getit without clearance from another.\n\n","date":"March 13, 2014 at 1:03 pm","url":"https://shroudstory.com/2013/12/03/translation-when-you-come-bring-the-shroud-of-turin/","cat":"history","id":"comment-88317","author":"petravis","site":"shroudstory"},{"title":"Translation: When you come, bring the Shroud of Turin","post":"Petravis: I noted above that it is highly doubtful that II Tim was in fact written by Paul, but is pseudonymous. There are better interpretations of the particular text, (see above).\n\n","date":"March 13, 2014 at 3:27 pm","url":"https://shroudstory.com/2013/12/03/translation-when-you-come-bring-the-shroud-of-turin/","cat":"history","id":"comment-88361","author":"daveb of wellington nz","site":"shroudstory"}]
