[{"title":"Challenging the Othon de la Roche Story","post":"No, Mario, we have at least three, seemingly independent testimonies linking the Shroud to Otto:\n1. MS826, you mentioned.\n2. The letter of Theodeore Angelus, allegedly from 1205:\nTheodore Angelus wishes long life for Innocent [III], Lord and Pope at old\nRome, in the name of Michael, Lord of Epirus and in his own name.\nIn April of last year a crusading army, having falsely set out to\nliberate the Holy Land, instead laid waste the city of Constantine.\nDuring the sack, troops of Venice and France looted even the holy\nsanctuaries. The Venetians partitioned the treasures of gold, silver,\nand ivory while the French did the same with the relics of the saints\nand the most sacred of all, the linen in which our Lord Jesus Christ\nwas wrapped after his death and before the resurrection. We know\nthat the sacred objects are preserved by their predators in Venice,\nin France, and in other places, the sacred linen in Athens . . .\nRome, Kalends of August, 1205\nhttps://shroudstory.wordpress.com/about/acheiropoietos-jesus-images-in-constantinople-the-documentary-evidence/ (Document XV).\n3. The tradition of the chest from Ray-sur-Saône, claimed to be used to transport the Shroud from Greece, see http://www.acheiropoietos.info/proceedings/PianaMYHSWeb.pdf\nThree witnesses, likely unrelated -that’s relatively solid basis for claims that Otto did possess the Shroud at some point…\n\n","date":"May 29, 2015 at 7:41 am","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","id":"comment-200514","author":"O.K.","site":"shroudstory"},{"title":"Challenging the Othon de la Roche Story","post":"Although I could not agree with everything\nsays Nicolotti here I am forced to remember\nwhat wrote Andrea Nicolotti\n(November 30, 2014 at 8:08 am):\n>Oskar, I do not want to start discussions with you, but the letter of Theodore Angelus is a forgery, and does not make the name of Otto nor tell something about shrouds with images or shrouds in Besançon, and the 18th century MS 826, as we know, was written 500 years after, and it is a falsification of medieval sources, as Vignon, Zaccone and other know and explained many years ago. …\nLink:\nhttps://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/\n-*-*-*-*-*-*-*-\nSee also on this blog:\n“Dan Scavone Responds to an Earlier Charles Freeman’s Article”\nLink:\nhttps://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/\nNovember 1, 2014 at 3:57 pm\nNicolotti:\n>… All the Chartularium Culisanense, obviously, is a forgery …\n— — —\nSo: where we can finish with that story?\n\n","date":"May 29, 2015 at 9:55 am","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","id":"comment-200525","author":"piero","site":"shroudstory"},{"title":"Challenging the Othon de la Roche Story","post":"See also on this blog:\n“Dan Scavone Responds to an Earlier Charles Freeman’s Article”\nLink:\nhttps://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/\nNovember 1, 2014 at 3:57 pm\nNicolotti:\n>… All the Chartularium Culisanense, obviously, is a forgery …\n— — —\nSo: where we can finish with that story?\npiero:\nRead the wholemy discusion with Nicolotti in this thread. Up to the my post from  November 1, 2014 at 4:18 pm.\nNicolotti has not proved this particular document to be forgery. He can’t do that. \nBut it is common for (pseudo-) historians to label some spurious documents as forgeries, even when the situation is not clear (alleged letter from Aristotle to Alexander the Great, and correspondence between Paul and Seneca come to my mind).\n\n","date":"May 29, 2015 at 11:03 am","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","id":"comment-200530","author":"O.K.","site":"shroudstory"},{"title":"Challenging the Othon de la Roche Story","post":"Mario states:  “the dissertation refers to documents that never mention that Othon received a shroud or owned any shroud.”   \nAbsence of Evidence does not mean Evidence of Absence.\nOtto could have hid the Shroud based on a fear that either the Pope or the King of France would force him to turn it over.  \nAs an analogy,  Bishop Athanasius wrote in the 300s that the “Icon of our Lord” (the Shroud) was secreted away to Syria (Antioch) upon the attack of the Romans on Jerusalem.  From 70 A.D. until 540 A.D (date of the destruction of Antioch by Chosroes), the Shroud was not displayed in Antioch, due to the fear of the Arian Christians (and later the Monophysites) that the Churches in Constantinople and Rome would either take it away from them or destroy it.  Absence of Evidence is not Evidence of Absence.\n\n","date":"May 29, 2015 at 8:12 am","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","id":"comment-200515","author":"Nabber","site":"shroudstory"},{"title":"Challenging the Othon de la Roche Story","post":"I agree Nabber.  Just because there is a lack of evidence in no way proves anything except there is no evidence of which we are aware.  It is reasonable in light of no evidence to not make unsupported claims, but there is equally no problem putting forth the idea as one possibility.  One from either side cannot claim the other to be erroneous since there is no evidence to support or refute either idea.\n\n","date":"May 29, 2015 at 10:37 am","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","id":"comment-200528","author":"Dcn Andy","site":"shroudstory"},{"title":"Challenging the Othon de la Roche Story","post":"Daniel Raffard de Brienne, a descendant of Walter V de Brienne, Duke of Athens, didn’t think so. The de Brienne and de la Roche families were related by marriage.\nhttps://www.academia.edu/9156258/Shroud_Studies_in_France\n\n","date":"May 29, 2015 at 9:35 am","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","id":"comment-200521","author":"Louis","site":"shroudstory"},{"title":"Challenging the Othon de la Roche Story","post":"I wonder if Mario would make this wonderful and interesting book available in English?  Since I cannot read French, this would be inaccessible to me.  I think it is important.\n\n","date":"May 29, 2015 at 10:32 am","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","id":"comment-200527","author":"Dcn Andy","site":"shroudstory"},{"title":"Challenging the Othon de la Roche Story","post":"Google Translate of the back cover of the book:\nThe Shroud of Besancon was very popular for nearly three centuries, attracting large crowds in his early ostensions the 16th century. Its popularity is so great that in 1705 King Louis XIV ordered the suspension of ostensions to prevent the German soldiers took the city by hiding among the tens of thousands of foreign pilgrims.\nThe Shroud of Besançon in 1794 disappeared during the French Revolution, but there are still many ancient manuscripts and publications describing. 826 The manuscript of the 18th century Besançon’s library archive is composed of two separate essays pursuing diametrically opposite goals, the first arguing for the authenticity of the Shroud of Besançon and the second to the contrary.\nThis book presents an original transcript of the first essay and a modernized version of the second essay published in 1831, with comments.\nThe authors of these essays comparing the Shroud of Besancon with the Shroud of Turin, sometimes to determine which would be genuine. The reader can judge the relevance of these comparisons and better discover these two Shrouds. He also discover modern elements of the second essay and particularly an authentic shroud is more credible if it produces a three dimensional image, a very pertinent remark by modern scientific developments on the Shroud of Turin.\nWhat is the origin of the Shroud of Besancon? Was he as popular as the Shroud of Turin? Does the history of the Shroud was combined with that of the Shroud of Turin? The knight Othon de la Roche is it really the origin of the Shroud of Besançon or perhaps is it rather the cause of one in Turin? These are some fascinating questions addressed in this book.\nThe author is a researcher in computer science and bioinformatics research center in Silicon Valley. He has a PhD in computer science and mathematics from the University of Montreal and has published numerous scientific articles in computer science, bioinformatics and applied mathematics. He is also the editor of the website sindonology.org on the Shroud of Turin. He is the proud father of two lovely girls.\n\n","date":"May 29, 2015 at 10:41 am","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","id":"comment-200529","author":"Dcn Andy","site":"shroudstory"},{"title":"Challenging the Othon de la Roche Story","post":"There is much evidence for the link of. Le Ray castle & Othon de la Roche of Ray Castle w/ the Shroud of Turin….Jeanne de Vergy, our ancestor inherited the Shroud of Turin from Othon de la Roche and married the great French knight de Charney bringing it to the Orient Forest where it was deposited in the le Ray (lirey) chapel they built for this preservation…\nALL DOCUMENTED DATA…. What else doe one need ? google : Eugene Ray shroud of Turin ….or Eugene ray : le Ray castle or Eugene Ray : Le Ray Chapel..\n\n","date":"May 29, 2015 at 5:23 pm","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","id":"comment-200549","author":"Eugene Ray","site":"shroudstory"},{"title":"Challenging the Othon de la Roche Story","post":"I note that in Mario’s May 10 entry, he claims that the first ostentation would have been in 1356 or in 1357.  I think there is a good argument that it might well have been 1355.  On 1356, May 28, Bishop Henri of Troyes goes on record as praising Geoffrey I de Charnay for founding the Lirey church.  On Sept 19, that same year 1356, Geoffrey I was killed at the Battle of Poitiers.  The Lirey badge commemorating the first ostentation shows the De Charnay arms on the dexter side and the De Vergy arms on the sinister, which according to the ordinary conventions of heraldry would imply that Geoffrey was still alive at the time when the badge was struck, i.e. before Sept 19, 1356.  Writing in 1389, Pierre D’Arcy alludes to the first showing as some 34 years previously, implying a date sometime in 1355.  That is as close as D’Arcy can claim, even though he ought to have had access to Bishop Henri’s Troyes diocesan records giving a more specific date.  The figure 34 years, is clearly taken to the nearest whole year, not just the nearest 5 years or thereabouts.  Considering the significance of the badge, a first showing in 1357 seems unlikely, and if one presumes Geoffrey’s presence at the actual showings, and his likely absence from Lirey while preparing for the Poitiers campaign, then even 1356 might seem doubtful.  The year 1355 is more consistent with the D’Arcy allegations, even though it would pre-date Bishop Henri’s praising of Geoffrey, and over-ride any objections Henri might have had to the ostentation.\n\n","date":"May 29, 2015 at 6:55 pm","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","id":"comment-200557","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Challenging the Othon de la Roche Story","post":"It was de Vergy my Gruyere ancestors who inherited the shroud\nDe Charney , her husband, was a famous French knight but he\nWas only Jeanne de Vergy’s husband / they built le Ray chapel !)\n\n","date":"May 29, 2015 at 8:50 pm","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","id":"comment-200562","author":"Eugene Ray","site":"shroudstory"},{"title":"Challenging the Othon de la Roche Story","post":"Is there any evidence for the Gruyère inheritance?\nOr that Lirey derives from Le Ray?\n\n","date":"May 30, 2015 at 8:19 am","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","id":"comment-200596","author":"Hugh Farey","site":"shroudstory"},{"title":"Challenging the Othon de la Roche Story","post":"Yes Plenty…! GOOGLE : EUGENE RAY / le Ray CHAPEL\nGOOGLE  : EUGENE RAY / SHROUD OF TURIN\nOur DeGruy(ere) / Vergy ancestors chateau Magny Fouchard\nWas located near the le Ray Chapel in the Orient Forest where Bernard de Clairvaux designed Knights Templar bylaws\nGOOGLE : EUGENE RAY / ORIENT FOREST\n\n","date":"May 30, 2015 at 2:07 pm","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","id":"comment-200608","author":"Eugene Ray","site":"shroudstory"},{"title":"Challenging the Othon de la Roche Story","post":"Yes I tried that, but got nowhere. I find your blog site very difficult to work through, and “Orient Forest” does not seem to have any evidence for anything in it. Can you be a bit more specific?\n\n","date":"May 30, 2015 at 2:36 pm","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","id":"comment-200610","author":"Hugh Farey","site":"shroudstory"},{"title":"Challenging the Othon de la Roche Story","post":"From Mario’s posting: “For example, the receipt of Humbert de Villersexel, given in 1418 to the clerics of the collegiate church of Lirey, states clearly that the reliquary containing the Shroud had the coat of arms of de Charny, not of de Vergy. The son and the grand-daughter of Geoffroy de Charny also stated clearly that the Shroud was from Geoffroy de Charny, not from Jeanne de Vergy.”  \nThere are still several possible explanations which might not exclude the Othon – Jeanne de Vergy chain.  Under French matrimonial property law of the time, it might be thought that any property brought to the marriage was legally the husband’s.  Humbert was the second husband of Margaret de Charnay, the grand-daughter of Geoffrey I.  As the Shroud had come into her possession from her father Geoffrey II, and she herself goes under the de Charnay name, it is not unreasonable that it should be stored in a reliquary bearing her father’s coat of arms, rather than her grandmother’s.  Despite the Shroud coming direct to Margaret de Charnay from her father, it is Humbert her husband who assumes the role of agent in the matter dealing with the Lirey canons, whether or not it was presumptuous of him to do so.  The Shroud may have come from Othon down to Jeanne de Vergy, surrendered to King Louis as were other Byzantine relics, and the king may then have thought it meet to return it to Geoffrey I de Charnay in recognition of his services, which would explain the statements given by his offspring.  If Othon had taken the Shroud from Byzantium, there may have been a family cover-up to protect Othon’s name, in view of such illicit actions, which had been condemned by the Pope.    \nI should be interested to know more from Eugene Ray as to his family’s traditions in this matter, if he feels free to express them here.\n\n","date":"May 30, 2015 at 4:12 am","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","id":"comment-200586","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Challenging the Othon de la Roche Story","post":"For Hugh Farey….GOOGLE : EUGENE RAY / ORIENT FOREST. There is much important data easily found in blogs I have written over a ten year period…the Orient Forest has a vital history / it is where the original 9 Knights Templars originated plus St. Bernard de Clairvaux and several powerful Christian Families / my Verloin de Gruy(ere) (Vergy) ancestors chateau at Magny Fouchard…Counts de Gruyere married Vergy (as did last Habsburg H.R.E. Otto) Gruyere Counts to 5 Crusades close to Othon de la Roche de Ray / study my Blogs info it is not accidental that Gen. De Gaulle settled Orient Forest & flew Cross of Lorraine Flag as did Joan de Arc… Merovingian DNA / Priory de Sion play Roles w/ Templars / St Bernard ! Also finally the Savoy Dukes related to the Gruy(ere)-de Vergy-de Ray acquired the Shroud !!!\n\n","date":"June 2, 2015 at 11:01 am","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","id":"comment-200894","author":"Eugene Ray","site":"shroudstory"},{"title":"Challenging the Othon de la Roche Story","post":"For Deveb of Wellington    De Vergy were the most powerful family in Burgundy w / many Castles . The Last Count de Gruyere died in a Vergy Castle / de Charney was a famed French Knight but remember de Charney was burnt at the stake near where the Shroud Plaque was found in the Seine River / the largest castle in a Burgundy was the deRay Castle at Ray sur Saone…it is still there  w/ the original wooden casket that held the Shroud ! Read “The Counts of Gruyere” on the internet / King Francois I cousin of the last Gruyere Count was a direct descendent of my de Bresse ancestors who became the Duke de Savoy and became custodians of the Shroud GOOGLE : EUGENE RAY  / DUKE de BRESSE\n\n","date":"June 2, 2015 at 11:21 am","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","id":"comment-200896","author":"Eugene Ray","site":"shroudstory"},{"title":"Challenging the Othon de la Roche Story","post":"Tomorrow, June 5th, 2015 I shall publish my blog , eugenerayarchitect.blogspot.com devoted\nTo our French families many links to the Shroud Of Turin and to much else of French history..\nRemember it is the Orient Forest of our de Gruy(ere) ancestors where the Troyes Fraternity of Shroud Devoted families lived where the Knights Templars  / Priory de Sion of St. Bernard originated at Clairvaux Abbey, 15 kilometers from Magny Fouchard Chateau of the Gruy and the same distance from General de Gaulle who flew the Merovingian Flag Of Lorraine Cross and who actually considered returning France to a Merovingian (Charlemagne) Kingdom !!!\n\n","date":"June 4, 2015 at 3:28 pm","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","id":"comment-201091","author":"Eugene Ray","site":"shroudstory"},{"title":"Challenging the Othon de la Roche Story","post":"Why not put some of your evidence here? Your blog is incomprehensible to me.\n\n","date":"June 4, 2015 at 5:11 pm","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","id":"comment-201093","author":"Hugh Farey","site":"shroudstory"},{"title":"Challenging the Othon de la Roche Story","post":"I think what is important here is not so much that Eugene asserts various claims for connecting the Shroud with Othon de la Roche and the Le Ray castle, but that the claims made are true in fact.  That is much more difficult to do, although the various claims made may illuminate this process, but the substance of the evidence needs to be shown and explained.  From my own personal experience I have discovered that long-held family traditions can at times be discovered to be quite erroneous, even when affirmed by reputable bodies.  Mistakes can be made.  My mother held a certificate from the NZ Founders Society asserting that two of her ancestors arrived here on one of the first sailing ships in 1840.  I later discovered that although the ancestors likely arrived soon afterwards, it seemed unlikely that it was on either of the two ships concerned.  That is a much more recent example, and going back another several hundred years, the proving of historic assertions is so much more difficult.\n\n","date":"June 4, 2015 at 6:58 pm","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","id":"comment-201097","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Challenging the Othon de la Roche Story","post":"Addendum:  What Eugene is claiming is not at all clear to me, and certainly whatever it is he is claiming seems to me at present quite lacking in any kind of adequate proof, that might be accepted here.  He needs to state his evidence for his claims.\n\n","date":"June 5, 2015 at 5:12 am","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","id":"comment-201124","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Challenging the Othon de la Roche Story","post":"I have published my blog on the history of The Shroud Of Turin in the Orient Forest of France\nAt the le Ray (Lirey) Chapel with the Troyes Fraternity (Templars, Priory de Sion) Bernard de\nClairvaux led families …of which our deGruy(ere) Chateau Magny Fouchard was the ancient\nCenter until it was destroyed in the First World War …study carefully the blog…you cannot be\nSerious researchers if you don’t SEE !  Eugenerayarchitect.blogspot.com… Remember I have researched this for longer then a decade.. The de Ray Castle at Ray sur Saone France\nHas a large Cross on the oldest Tower as a symbol of the importation of the Holy Shroud !\nThe wooden Shroud Casket inside is exactly the correct size of the folded Shroud…All of this is well documented French History and remember I have BEEN THERE about 40 journeys &\nStudied the work of many researchers..PLEASE STUDY MY FACEBOOK PAGE AS WELL !\nEugene Ray Architect ….there is much additional data linked to my career as a professor. &\nArchitect that was inspired by Genetic Memory of this de Gruyere / Bresse French History !\nYou cannot deny the history of the Shroud in the Orient Forest or the ultimate acquisition by\nThe Duke de Bresse de Savoy our direct ancestors (of my de Gruy & de Bresse ancestors)\n\n","date":"June 5, 2015 at 11:02 am","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","id":"comment-201136","author":"Eugene Ray","site":"shroudstory"},{"title":"Challenging the Othon de la Roche Story","post":"No, Ray, this won’t do.\n1) I don’t believe the name Lirey has anything to do with “Le Ray”. Have you any evidence to suggest that it might?\n2) I don’t believe that the Chateau Magny Fouchard was the centre of the Priory de Sion. Have you any evidence to suggest that it might?\n3) Ray-Sur-Saone castle has what looks like a bricked up crosslet loophole high on its tower. I don’t believe it has anything to do with the Shroud. Have you any evidence to suggest that it might?\n4) “The wooden Shroud Casket inside is exactly the correct size of the folded Shroud.” According to Ian Wilson, the casket is 14″ x 6.5″ x 10″ high. This is a highly unsuitable size for the folded Shroud, and quite possibly too small altogether. I do not believe it ever held the Shroud. Have you any evidence to suggest that it might?\n5) “You cannot deny…..” I can. I do. Have you any evidence to suggest I might be wrong?\nPlease stop directing us to your website. It is extraordinarily cumbersome to navigate, and provides no evidence for any of the things I do not believe.\n\n","date":"June 5, 2015 at 12:49 pm","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","id":"comment-201142","author":"Hugh Farey","site":"shroudstory"},{"title":"Challenging the Othon de la Roche Story","post":"It is obvious that Farey has a closed mind. I could refute his\nFive points easily but it would do no good / I shall not waste\nAny more time w/ him / I hope others shall look at my blog\nTomorrow that shall have expanded data (also Facebook)\n\n","date":"June 5, 2015 at 2:33 pm","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","id":"comment-201148","author":"Eugene Ray","site":"shroudstory"},{"title":"Challenging the Othon de la Roche Story","post":"Hugh Farey and I frequently have different opinions on the question of authenticity, on what constitutes evidence, and the interpretation of that evidence, and sometimes either one of us aggravates the other.  On this occasion I find I am in full agreement with him.  I remain open to any evidence that Eugene Ray can present here to support his claims.\n\n","date":"June 5, 2015 at 3:26 pm","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","id":"comment-201150","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Challenging the Othon de la Roche Story","post":"“It is obvious that Farey has a closed mind.” Farey does not have a closed mind. Farey is open to any evidence for any of his points that Ray can present. Farey wonders why Ray thinks that his evidence would not change Farey’s mind. Does Ray not have much faith in it himself? Farey is sorry that Ray’s website in impenetrable to him, in spite of considerable effort to understand it, and hopes that other commenters on this blog may be able to explain it to him.\n\n","date":"June 5, 2015 at 6:03 pm","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","id":"comment-201157","author":"Hugh Farey","site":"shroudstory"}]
