[{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"This is very good comprehensive summary of facts that might form a case for the Shroud’s authenticity.  I guess it is a matter of style, but I prefer to leave the Shroud as a mystery, a fabulous mystery in the same league as the pyramids or Stonehenge…all of which remain unsolved at their core regarding who and how they were made…many theories but no definitive answer.  As you lecture, make every effort to refrain from dogmatism.  The Shroud could be authentic.  Thats it, that is as far as we can take it.  Who knows…maybe there is a medieval artist out there who predated Leonardo by at least 100 years, and we don’t know who he is, or how he did it.  Not likely I grant you yet still a possibility.  In fact if the Shroud was on trial we would have to look at two burdens of proof…”beyond a reasonable doubt” for a criminal trial and “preponderance of evidence” for a civil trial.  Personally, I don’t think will ever get to “beyond a reasonable doubt.”  Preponderance of evidence I would agree with…but that really only means there is better than a 50% chance of it being authentic.  But that is ok.  It is fun to explore the mystery, and as we do, we encounter the heart of the gospel.  I love letting the audience decide.  Is it possible?  Did God preserve an image of himself for an age when we communicate more with images than we do with words?  Is it silent witness to the one miracle that had no eyewitnesses?  All these are tantalizing and wonderful things to ponder.  But at the end of the day, it is up to each person to decide.\n\n","date":"February 26, 2012 at 11:56 am","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8756","author":"Russ Breault","site":"shroudstory"},{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"Dan,\nThanks a ton for making mention of this as it took me many months of work (and yes, that’s a picture of me — Scribd auto linked it from my facebook).\nRuss,\nI understand your position, and at no point can we prove any what we’re saying. The Shroud bares a lot of importance to me because it was putting it in the context of apologetic writings (albeit in a far more underdeveloped form than in the lecture) that made me leave my atheism/agnosticism and to, after roughly half a year, be baptized and chrismated into the Eastern Orthodox Church. Hence I felt I had a duty to at least compile my thought together and put it out there for people to examine. But again, I understand the reservation of others — we need to proceed to research it non-dogmatically if we’re going to learn more about it.\n\n","date":"February 26, 2012 at 3:43 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8759","author":"Nick","site":"shroudstory"},{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"Nick, \nThat is a wonderful testimony you have shared.  Father Peter Rinaldi of the Holy Shroud Guild always said we need to lead people “through the linen to the Lord.”  The Shroud may or may not be authentic but it certainly testifies to the historical events of the crucifixion and resurrection.  It lines up perfectly with Scripture which makes it a perfect tool to explore what happened to Jesus as we also explore the mystery of the Shroud itself.  The very fact that the Shroud remains a mystery is amazing itself.  If it was an obvious work of art, we would have figured that out a long time ago.  Kudos to your new found faith!\n\n","date":"February 26, 2012 at 5:04 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8761","author":"Russ Breault","site":"shroudstory"},{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"rb. we can build a pyramid today or stonehedge but we cannot make the shroud and 100 years from now their will only be one shroud in existence. it is not comparabe to any man made object.\n\n","date":"February 26, 2012 at 10:47 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8769","author":"PAUL","site":"shroudstory"},{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"Paul,  I think you are missing my point.  The Shroud remans an unsolved mystery.  In that same vein, so are Stonehenge and the Pyramids. As a lecturer and a presenter, I have been invited to some of the best universities in the country (Duke, Penn State, Cal State, and many others). I am totally focused on how to get the world at large to embrace the Shroud as a legitimate artifact to study and explore.  And the only way (IMO) is by focusing on the mystery and losing the dogmatism.  Once we become so oriented towards claiming and proving it to be authentic, we lose the very people we are trying to reach with the message of the Shroud. I am all for building a case for authenticity. However, carbon 14 will remain an issue until it is dated again.  There remain many reasonable questions that do not yet have adequate answers. I am happy with the Shroud being a mystery.  Who can argue with that?  Whether it is authentic or not, it remains a mystery.  That is what makes it fascinating. If we had all the answers, it wouldn’t be nearly as interesting.  Again, if I didn’t make it clear, I am speaking to my approach in taking the Shroud outside the walls of the Church.\n\n","date":"February 26, 2012 at 11:31 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8771","author":"Russ Breault","site":"shroudstory"},{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"It will be figured out eventually. It is a matter of access, because of its fragility.\n\n","date":"March 2, 2012 at 6:50 am","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8882","author":"Robert Burns","site":"shroudstory"},{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"For me, not accepting the Shroud as authentic, creates more problems than my brain could possibly cope with.  RB – The weight of evidence is much more than a mere 50%, it has to be closer to 80%, even more!\nOn the other hand, I’m also fond of saying that God does not compel belief, He invites belief.  To reject belief in the face of 100% certainty would be a sin against the Holy Spirit for which there can never be forgiveness Mt 12:31-32.  But God wants all to be saved, and so He is generous in just leaving that little room for a residue of doubt to remain.\n\n","date":"February 27, 2012 at 11:46 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8789","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"I’ll side with Daveb of Wellington on the percentage of evidence, but I can understand completely Russ’s point. I’ve found, (in my personal experience) when mentioning the Shroud or attempting to spark up even the slightest conversation about it, most people will just cringe. Furthermore, even if asking them to just look at it as an historic or archaeological artifact, it is still like your going to pry teeth out of their heads lol…so I get what he’s saying and I think it’s a good approach.\nWould sure like to see Russ get up here to Toronto some day! I wouldn’t miss it, if he did.\nR\n\n","date":"February 28, 2012 at 7:25 am","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8794","author":"Ron","site":"shroudstory"},{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"Yeah, I agree with Dave as well, the preponderance of the evidence points to authenticity. But I also accept that we will never have “proof” because God requires an Act of Faith for most of us. I believe some folks are granted proof for whatever reason (i.e. the Apostles and those who saw the Risen Jesus ascend to Heaven, for them Faith is no longer required because they have seen and know). I also agree with the sentiment that Faith is not compulsory as it is quite clear from the Gospels that God will not abrogate our free will (demonstrated be Jesus instructing His Apostles to walk away from those that would not receive them and the Gospel). It is probably because of God’s respect for free will that He requires an act of Faith from most.\nRon’s point about discussion regarding the shroud is spot on. It is a very polarizing subject even among Christians. It challenges folks to the very core of their world view in many ways and people do not like that being touched at all. Most folks, I think, seek validation of their world view and the shroud poses a huge problem for a lot of people comfortable in their outlook, even Christians. This is exactly why you get so much activity on the part of those who hold the shroud is irrelevant or inconsequential. They *need* to believe it’s not real while those of us who have Faith don’t need it at all. If it were definitively shown to be a fake tomorrow it wouldn’t mean a hill of beans to Christianity and it’s tenets. But as long as it is not falsified I believe it bothers some folks to no end because of what it implies.\n\n","date":"February 28, 2012 at 12:25 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8800","author":"Chris","site":"shroudstory"},{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"Not being able to recreate the Shroud, has no bearing on proving its authenticity. It is a fake. The earth was always round, but it had to be proved that it wasn’t flat before anyone believed.\n\n","date":"March 2, 2012 at 6:58 am","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8883","author":"Robert Burns","site":"shroudstory"},{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"Many a half-truth, biased/non confirmed observation, pseudo fact and received idea actually litter most of Shroud literature and set both Shroud science and archaeology back. Before one can credibly assert the body and blood image on the Shroud cannot be recreated, the whole issue should be totally clear up. Most sadly, both “miraculists” and “fraudulists” tend to occupy and bias the whole scientific and archaeological debate at the expense of a more naturalistic/ritualistic approach. .\n\n","date":"March 2, 2012 at 9:14 am","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8890","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"Robert,\nYou’re assuming the conclusion before the evidence is even in, pure and simple. That isn’t free-thinking at all.\nMax,\nWould you mind clarifying/elaborating on what you mean? I understand how ‘miraculist’ and ‘fraudulist’ biases may get in the way, but what is the ‘naturalistic/ritualistic’ approach?\n\n","date":"March 2, 2012 at 1:28 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8896","author":"Nick","site":"shroudstory"},{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"If I say that Robert Burns is a fake, that doesn’t necessarily make him one.  Similarly when Robert Burns asserts that the Shroud is a fake, that doesn’t make the Shroud a fake either.\nIt has to be shown to be a fake by some kind of weight of evidence process, and so far that hasn’t been done.  Neither has it yet to be shown to be authentic beyond all shadow of doubt whatsoever, but that’s probably not possible of any artifact.  But there is a reasonable amount of evidence that shows that the Shroud is probably authentic, as indicated in Dan’s heading at the top of this blog site.\nIt might perhaps best be illustrated by means of an electric circuit analogy.  If the steps in logic are connected in series, and one of the steps break down, then that part of the circuit completely fails and that part of the logical process fails.  However if the various components in the deductive process are connected in parallel, then it needs every component in the circuit to fail, before the whole logical process fails.\nThis gives the lie to the XYX mantra invoked on this site at various times.  If X, Y and Z are connected in parallel, then it requires all of X, Y and Z to fail before the logic breaks down, but that hasn’t happened.  If X breaks down, and Y and Z remain secure, then the circuit still works, and similarly if both X and Y break down but Z remains secure, then the logic is still there.\nX will break down, if only one of its series elements, X1, X2,  … Xn breaks down.  So that’s my lesson in how to arrive at a logical conclusion.  I hope that it is sufficiently clear that all may understand it.  And who knows?  We might have us all thinking logically for a welcome change.\nIncidentally, even Aristotle knew that the earth was round, simply by observing the earth’s shadow during any lunar eclipse.  Whereas it is very likely that Robert Burns’ most valuable asset, is probably registered on a ‘flat earth’ plan in some Government Title Deeds office!\n\n","date":"March 2, 2012 at 11:44 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8900","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"Daveb said; “It has to be shown to be a fake by some kind of weight of evidence process, and so far that hasn’t been done” …exactly, and herein lies the main problem with most all skeptics/ opponents to the Shroud’s authenticity, …well said Daveb.\nThere is also the hypocricy of these skeptics/ opponents to the Shroud’s authenticity, in claiming to be the ‘scientific’, ‘rational’ thinkers lol, …what a bunch of turds.\nAs for Max’s statement above; How about a naturalistic/ritualistic bias Max. Until you can claim to understand all the secrets of nature and the universe, I think it would be prudent to not exclude a supposed ‘miraculous’ image formation completely! It has been claimed by far smarter people then I, that there may be a new understanding of physics hidden in the Shroud!….Remember we are still very young in the understanding of things, to claim or assume otherwise is just plain conceit and utter nonsense.\nR\n\n","date":"March 4, 2012 at 2:45 am","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8911","author":"Ron","site":"shroudstory"},{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"In the hypothesis the Shroud is Rabbi Yeshua’s, Ron I do agree with you, a STRICKLY naturalistic approach is not bias-proof either. Especially when one thinks of Kersten, Gruber and Felzmann’s “survivalistic” approach. Although very interesting, Vignon’s vaporography theory, Rogers’ Maillard reaction hypothesis or Volckringer’s Herbal theory have their own shortcomings too.\nCuriously enough the “miraculists”, the “fraudulists” and the “naturalists” have the following bias in common: none of them ever thought the Turin man’s corpse might well have been subjected to a purifying & drying-up Judean ritual! The fact is “non completed burial rite” & “loosely/naturally draped shroud” received ideas die hard. Cannot possibly any of the\n“miraculists” or “naturalists” AT LEAST read the Gospels in the light of the Greek philology, a possible Aramaic/Hebrew substratum, the History, Archaeology and halakha (Judean religious law) of the Second Temple period? How can at one and the same time such Shroud researchers (or old students) tell the Shroud image almost literally mirrors Yeshua’s Passion as it is related in the Gospels while only very remotely minding the accurate meaning of the Greek verbs used by the Evangelists to describe Yeshua’s burial? As Shroud researcher, I might well be the only one to personally advocate the ritualistic approach as the most likely (i.e. the less bias-proof) to solve the Shroud Turin mystery.\n\n","date":"March 4, 2012 at 10:03 am","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8916","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"Max we went thru this whole “accurate meaning of the Greek verbs” thing several weeks ago. Your argument to me lacked any substance, atleast enough substance to advocate your “naturalistic-ritualistic” hypothesis. That doesn’t mean I completely refute your hypothesis, but that it seems unlikely someone can come to those conclusions from the vague information we have or should I say lack of information given to us in scripture. I think everyone is aware of Jewish burial rituals/customs, not precisely 1st century customs though, but close. Whether or not they were completed or not is not evident, and which rituals were followed is not apparent either, seeing as they would be different depending on the situation of the death, eg; Was he washed or not? Was he wrapped in several cloths or just one shroud? Was he annointed or not? We can only speculate on the answers to these questions and that is the point I’ve been trying desperately to convey to you….But if we are to take the Shroud as being the true Shroud that covered the crucified body of Jesus, then we can deduce forensically from the evidence, (and only to a certain extent) what had actually occured…the evangelists were much too vague to come to any solid conclusions on the matter.\nR\n\n","date":"March 4, 2012 at 2:17 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8924","author":"Ron","site":"shroudstory"},{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"Correction: “(i.e. the less BIASED)”\n\n","date":"March 4, 2012 at 10:16 am","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8917","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"Ron,\n in a previous post you first wrote: [your exegesis of Rabbi Yeshua’s stiff rigid body wrapping] makes no sense” and now you go again with “[your argument about the] accurate meaning of the Greek verbs [used by the 4 evangelists in the Gospels to describe the wrapping of Yeshua’s body] lack[s] any substance […].”\nDoes it/they really? Relying on the Gospels in the light of the Turin Shroud, the halakha (the Judean religious law) and the Judean burial practice and custom of the Second Temple period, my contention is Yeshua’s stiff rigid body was tightly wrapped up to counteract the effect of rigor mortis and his shed innocent blood to be purified and kept with the body. Hence the most likely reconstruction from the 4 evangelists could imply the long interior shroud (Gr. sindôn, soaked with a watery solution?) to be first tautly wrapped (Gr.\nenetulixen, Matthew 27, 59; Luke 23, 53) lengthwise around the stiff rigid bloody body and the latter thus wrapped to be then compressed (Gr. eneilesen, Mark 15,46) and fastened (Gr. edesan, John 19,40) width wise, with spices (Gr. aromaton, i.e. here fresh medical plants and flowers used as insect repellents), (in a veil, a prayer shawl used as a shorter shroud?) and two additional long linen strips (cut off from the lengthy original burial sheet, Heb. sovev).\nShall we prefer your exegetical absolute miraculistic “ready-to-think” and infer from the same 3 Greek verbs (entulisso, “wrapped, encircle”; eneileo, “compress, tightly wrap up” and deo, “fasten, bind) Yeshua’s body was LOOSELY wrapped on his entombment as you infer? I shall let the readers of this blog judge for themselves whether Yeshua’s body was loosely or tightly wrapped up on his entombment. And so on with die hard received ideas about Rabbi Yeshua’s burial.\nBTW, if you are so damn sure Yeshua’s body was LOOSELY wrapped, how then can you add:  “the evangelists were much too vague to come to any solid conclusions on the matter”? In terms of exegesis, I shall let the readers of this blog judge for themselves again whether or not you are serious and “full of substance”.\nSadly; the more I read some Christian “arch-miraculists’ comments on my posts”, the more I cannot help thinking their Christian faith in Yeshua’s Resurrection is perverted by an idolizing faith in the supernatural of the Shroud image at the very expense of their Christian virtues and their insights into the relevant passages of the Gospels. “Examine everything carefully; hold fast to that which is good”.\n\n","date":"March 5, 2012 at 10:53 am","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8953","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"Max I’ve never claimed/stated that Yeshua’s body was loosely wrapped or argued it was not bound. My argument has always been against your interpretation of the scriptures, which bring you to your conclusions. As I’ve stated before I believe he was bound by the side-strip, adding the ‘tightly’ is the adjective I do not agree with or find any evidence for that in scriptures, you may, but I don’t agree with your interpretations thats all. As I’ve also stated and I think most here would agree with me; descriptions of the burial in scriptures are far too wanting for anyone to come to such a ‘precise’ hypothesis of the “inner wet shroud with an outter shroud…Get what I’m saying Max?, I can’t say it any clearer.\nR\n\n","date":"March 5, 2012 at 12:57 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8956","author":"Ron","site":"shroudstory"},{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"Ron,\nYou wrote you are a Catholic and believe in John Jackson’s cloth collapse theory (an American Catholic). Now the study done by Jackson, Ercoline et al implies the Shroud to be loosely draped over the body. Therefore it just means you do believe the Shroud was LOOSELY draped/LOOSELY wrapped during the image formation process.  In January 2012, you totally denied the Shroud could have been tightly wrapped up on Yeshua’s entombment. This is a fact.You even wrote as a ferocious critic on my reconstruction: “My common sense tells me you are delusional if you really want to know. Your hypotheses are not based on any common sense whatsoever […].” And now, playing on words, you want me/us to believe you never directly or indirectly asserted the Shroud was LOOSELY wrapped? I shall let the readers of this blog judge for themselves again whether or not you are serious and “full of substance”.\n\n","date":"March 5, 2012 at 4:15 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8961","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"Max I think you are a little mixed up here. First of all I am Roman Catholic and Yes I agree Jackson’s hypothesis may be probable, and answers alot of questions, atleast better then most others, but I believe his hypothesis INCLUDES the Shroud being ‘bound’ with the side-strip, not just loosely draped/layed over the body, but also not necessarily bound ‘tight’…get it?. If it was not bound how would certain image areas be explained in Jackson’s hypothesis? Areas such the back of the legs for instance, an 8+ centimeter distance? …You should really watch the videos at Shroudtv.com on this aspect of the Shroud to fully understand Jackson’s hypothesis. As for the ‘tightly’ adjective again, it was your interpretation of certain words that got me off, especially with your firm insistence your interpretation was the only true interpretation. I believe you are so insistant because with this interpretation it suits your personal image hypothesis. There is no evidence for this except your conjecture…understand now?\nR\n\n","date":"March 5, 2012 at 5:26 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8969","author":"Ron","site":"shroudstory"},{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"I do understand my reconstruction would just ruin the John Jackson’s cloth collapse theory you adamantly believe in/adcocate. Because of your religious bias, you VERY PARTIALLY decided I cannot and I shall not be right otherwise you would have a serious problem. Understand now?\n\n","date":"March 5, 2012 at 5:38 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8971","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"Jackson changed his mind in the late 1990s i.e. after he read either French Shroud scholar Legrand or the memo I wrote in which I first emitted the side strip theory (just in case you still want to ignore the fact). Though jackson included Legrand and Hamon’s side strip theory afterward, the Shroud still appear loosely wrapped around the body. He first thought the Shroud was LOOSELY draped and only slightly changed his mind.\n\n","date":"March 5, 2012 at 5:54 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8973","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"BTW mentioning John Jackson’s cloth collapse theory, what do you make of the U-shaped discontinuous laterality of the face imprint implying the use of a chin-band, head-dress or, better, the use of a “jaw box”? Nothing I guess as it would contradict his non-archaeological/non-exegetical reconstruction you believe in.\n\n","date":"March 5, 2012 at 6:37 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8976","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"What do you make of Avinoam Danin’s finding of floral images and of  Flurry-Lemberg’s discovery of the Shroud “primeval fold” which Jackson’s theory totally ignores? Nothing again, I guess.\n\n","date":"March 5, 2012 at 7:00 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8977","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"Get what I am saying Ron?\n\n","date":"March 5, 2012 at 4:17 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8962","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"Shall I repeat, the late ancient Greek verb deo, “to bind” semantically does imply the action of TIGHTLY enclosing, encircling or… wrapping a (linen) strip or band around especially when one has to bind a corpse to counteract the effect of rigor mortis? Once again, Ron, are you used to bind LOOSELY?\n\n","date":"March 5, 2012 at 4:57 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8966","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"Simply Max, I don’t agree….So lets agree to disagree on this matter, shall we.\nR\n\n","date":"March 5, 2012 at 5:37 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8970","author":"Ron","site":"shroudstory"},{"title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture","post":"You way of desagreing is not serious and has no substance, I do agree.\n\n","date":"March 5, 2012 at 5:42 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","id":"comment-8972","author":"Max Patrick Hamon","site":"shroudstory"}]
