[{"title":"David Rolfe we need you","post":"Here’s a quote from Ray Rogers’ writings that gives us a very solid physico-chemical PROOF that the Mandylion hypothesis of Ian Wilson CANNOT be correct :  “All parts of the Shroud are the same age, and all parts have been stored in the same location through the centuries. Therefore, all parts should have been exposed to the same kinds and amounts of (natural) radiation. Any additional radiation effects found in image areas would indicate excess radiation in that location. Direct comparison between image and non-image parts of the Shroud show exactly the same amounts and types of radiation damage in the two types of areas. This suggests that the image was not produced by any mechanism that involved heat, light, or ionizing radiation.”  You can find this quote at #63 in my recent paper entitled “Raymond N. Rogers’ observations and conclusions concerning the body image that is visible on the Shroud of Turin”. Here’s the link to it: http://shroudnm.com/docs/2013-01-10-Yannick-Clément-Reflections-on-Ray-Rogers-Shroud-Work.pdf\nAnd here’s the personal note I add just after this quote in which I linked Rogers’ observation with another important finding made by Adler and where I emphasize the importance of these experts observations in regard of the Mandylion hypothesis (note that, in this comment, I answer to the very weak (because it is non-historical) argument often used by Wilson and his partisans concerning the idea that the Mandylion was always kept inside a reliquary and was never exposed): This particular observation of Rogers can be seen as a very good confirmation of a spectral analysis done by Alan Adler in the 1990s on four non-image fibers coming from various locations of the frontal part of the Shroud (i.e. the head, chest, knees and feet areas). Adler was clear about the fact that his spectroscopic results showed that there were no evident differences in the chemical content for all of these areas, which indicates, like Rogers said in his paper, that each part of the cloth is really showing the same age and the same degree of natural oxidation. It is very important to note that such a conclusion is in total contradiction with the Mandylion hypothesis proposed by Ian Wilson. Effectively, if Wilson’s hypothesis was correct, the region of the face on the Shroud would have been the only one exposed to light, dust, air and natural radiations for many centuries (if not for over 1000 years). In that context, we should expect to see evident signs of an accentuated aging (i.e. more oxidation of the fibers, along with more dust) for the non-image fibers located in the vicinity of the face, but the observations of Rogers and Adler (and also those of other STURP members, like Samuel F. Pellicori and Mark S. Evans) proved that this is not the case. Along with Rogers own observations cited here,this homogeneity in Adler’s spectral results concerning a non-image fiber coming from the head region of the frontal side of the Shroud and other non-image fibers coming from different locations can be seen as a very strong physico-chemical proof that Wilson’s hypothesis is surely incorrect and this should lead Shroud’s historians to search elsewhere in order to find a better explanation for the apparent silence of ancient documentary and artistic sources concerning the presence of a Shroud of Christ that was showing all his stigmata and his complete body image before the first attested appearance of the Shroud of Turin in the small town of Lirey, France, ca. 1357. I know that some defenders of Wilson’s hypothesis will pretend that the Mandylion was probably kept almost constantly inside a reliquary and that would explain Rogers and Adler’s conclusions but this kind of rationalisation is totally contradicted by the evident difference that exists in the aging aspect of both sides of the Shroud. Effectively,during their direct examination of the cloth in 1978, the STURP team (including Rogers himself) easily noticed that the back side of the cloth (i.e. the one protected by the Holland backing cloth for some 444 years at the time of the examination) was showing less signs of aging (oxidation) than the frontal side (i.e. the one exposed that showed the body image), even though we know for a fact that, during all that time, the Shroud had been kept almost constantly inside a reliquary, except for some pretty rare public showings. Here’s the first impression of Ray Rogers when he was able to see a portion of the back side of the cloth in 1978: “The back side is whiter than the front.” It’s important to note that such an observation was made very easily with the naked eye and without any need for the use of a microscope. So, in all logic, if Wilson’s hypothesis was correct, we should expect to see the same kind of accentuatedsigns of natural aging (i.e. more oxidation and most probably more dust and dirt also) for the region of the face versus the rest of the cloth than what the STURP team easily noticed in 1978 for the frontal side of the cloth versus the back side. Unfortunatelly for Wilson and the partisans of his hypothesis, Rogers and Adler’s observations and analyses proved that this is absolutely not the case.  \nI know I will never convince any partisans of Wilson (sadly, Dan Porter being one of them), but at least, these persons will have to find a scientifically sound explanation (good luck!!!) for the fact that the face region on the Shroud was never more exposed to light, air, dust and dirt than the rest of the cloth!  In the light of Rogers and Adler’s observations, I think it’s fair to say that the burden of proof rest on the shoulders of Wilson and his partisans!\n\n","date":"February 22, 2013 at 11:53 am","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25289","author":"Yannick Clément","site":"shroudstory"},{"title":"David Rolfe we need you","post":"Great analysis Yannick, I agree with it.\nHowever, whilst I think the Mandylion and Shroud are not the one and the same, I think there is the possibility that the Mandylion was based on the Shroud.\n\n","date":"February 22, 2013 at 6:50 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25335","author":"Matthias","site":"shroudstory"},{"title":"David Rolfe we need you","post":"Before I dismiss the theory that the Mandylion and Shroud are one and the same, some questions:\n– If the Shroud was folded and framed as the Mandylion, could it have had a glass cover to protect against dust etc. Was glass used in framing in say 400-600AD?\n– If glass was not used, surely the Mandylion / shroud could have been covered most of the time, and only sporadically shown, perhaps for only a very short time (perhaps even minutes) to select audience, given its sacredness. Especially if the showings were usually in low light conditions, this might mitigate Yannick’s objections? \nWhat troubles me with the argument that the mandylion and shroud are not the same is this:  if the Mandylion wasn’t the shroud, then what was it? Surely  people would not have been ‘fooled’ by a painting for centuries. It is easy as modern people to dismiss the intelligence and integrity of the ancients, and claim their gullibility, but I don’t hold that view given much of the great wisdom and intelligence of antiquity. Surely, the poor uneducated masses of those days might have had those characteristics, but not the educated elite.\nThere is a certain logic in thinking that the ghostly, un-painterly like Shroud facial image COULD have presented as a mandylion that convincingly appeared as some mysterious / miraculous image of Christ’s face, rather than an obvious painting.\nThoughts?\n\n","date":"February 22, 2013 at 7:11 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25337","author":"Matthias","site":"shroudstory"},{"title":"David Rolfe we need you","post":"Base on common sense and on the comparative work of Vignon, I think exactly the same as you do Matthias.  I also think the same for the first known depiction of the Pantocrator found in Ravenna, Italy and which was probably done around 500 A.D.\nThe only question I have versus these human depiction of the face of the living Christ is this :  Did they were done by an artist that was directly looking at the image on the Shroud or, more likely in my mind, did they were based on a sketch model made from the Shroud elsewhere by an unknown artist ?\n\n","date":"February 24, 2013 at 4:56 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25546","author":"Yannick Clément","site":"shroudstory"},{"title":"David Rolfe we need you","post":"It is not all that surprising that the back of the cloth shows less exposure to light than the front of the cloth, as the Shroud as such is known to have been periodically exposed over the last 800 years, probably since before 1204 (e.g. Robert de Clari comment).  However Gazay claims the Calvary dates from 1304 (his interpretation of the Romanized date inscription), and it can be clearly seen that in this depiction, the sculpture has been given a type of classic Mandylion presentation, facial image only, and landscape aspect within a solid frame, not what we would have expected if the sculptor had modeled it from what he might have seen from viewing the Shroud.  This could argue that at this time the Shroud and what was thought to be the Mandylion, or a depiction of it, were in fact two separate objects. \nIn his paper, Gazay has clearly brought into the Shroud and Mandylion being the one and the same object, but I don’t see that his argument necessarily follows.  \nBy blowing up Gazay’s photograph of the Calvary to 400%, I can persuade myself that the forehead may bear an epsilon mark as shown on a Shroud positive photo (not the 3 as per negative).  Beyond 400%, there is too much graininess to discern it.  \nIf the Calvary is meant to be a depiction of the Mandylion, this would argue that the original of the Mandylion was in fact modelled at a very early time on the Shroud facial image.  There are too many other correspondences between the Shroud facial image and the various iconic representations of Christ, to deny that the Shroud served at some time as the primal source of these various depictions, quite regardless of the controversy as to whether the Mandylion and Shroud were or were not the same object.  The debate is irrelevant to this issue.  \nAs indicated in Dan’s posting, a higher standard of photography showing a clearer picture of the forehead is required to settle as to whether the epsilon is present or not.\n\n","date":"February 22, 2013 at 5:23 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25327","author":"daveb of wellington nz","site":"shroudstory"},{"title":"David Rolfe we need you","post":"The most important thing I wanted to emphasize with my recent comments is the obvious FACT that the face region of the Shroud would have showed some pretty obvious signs of having been more exposed to air, light, dust and dirt than the rest of the cloth IF that relic was in fact the Mandylion of Edessa at an earlier time.  Since it’s NOT the case, we must consider the hypothesis of Wilson has being irrelevant.\nFor example, if Wilson was right, Rogers and Adler would have obviously detected a more important degree of oxidation concerning the most superficial linen fibers and the STURP team in general would have obviously detected a more important amount of dust and dirt stuck in between the fibers and the threads in the region of the face versus the rest of the cloth. THIS IS NOT THE CASE.  I don’t have anything else to say about that.  I think the physico-chemical FACTS speaks for themselves here.  And if someone don’t like that, don’t blame me.  Blame Rogers and Adler’s work !  I just follow what the FACTS (not the wild speculations and extrapolations done by Wilson and other; the FACTS) are telling me.\n\n","date":"February 22, 2013 at 5:45 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25330","author":"Yannick Clément","site":"shroudstory"},{"title":"David Rolfe we need you","post":"A further thought on the Gazay Calvary: If the sculptor had seen both the Shroud face and a classic depiction of the Mandylion, he may have been struck by the similarities of the images and decided to amalgamate them, that is both the Mandylion face in a framed landscape aspect, and the forehead epsilon of the Shroud (but only assuming that it is in fact represented on the Calvary).  In that case it would not be necessary for the epsilon to show on the depiction of his Mandylion model.\n\n","date":"February 22, 2013 at 6:27 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25331","author":"daveb of wellington nz","site":"shroudstory"},{"title":"David Rolfe we need you","post":"In view of Yannick’s emphasis of the uniformity of the shroud, I wonder if he has anything to say about the great fire of 1532, when the shroud, folded into 32 layers, was subjected to the temperature of molten silver in its reliquary. Is it not remarkable that the outside layers suffered no more discolouration from the heat than the inside layers?\n\n","date":"February 22, 2013 at 7:43 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25341","author":"Hugh Farey","site":"shroudstory"},{"title":"David Rolfe we need you","post":"\nHugh Farey :\nIs it not remarkable that the outside layers suffered no more discolouration from the heat than the inside layers?\n\nI don’t think temperature was high enough on the outside layers, you need very high temperature to discolour flax fibers, this happened around the holes, through all the layers. And you can see a steep temperature gradient, this proves once again heat radiation isn’t a good candidate to discolour the shroud.\n\n","date":"February 23, 2013 at 4:36 am","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25375","author":"anoxie","site":"shroudstory"},{"title":"David Rolfe we need you","post":"Isn’t 900 degrees C hot enough? Have you ever heated a cloth to 900 degrees C? I have put cloth samples in an domestic oven at 250 degrees C for ten minutes, and they have been seriously scorched. At more than three times the temperature I think some discolouration would be more than likely, wouldn’t you?\nOr are you implying that the cloth was not, in fact, in its reliquary, but outside the scope of the fire, and the hot silver was dropped onto it from some other source, producing the temperature gradient you describe?\n\n","date":"February 23, 2013 at 6:38 am","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25381","author":"Hugh Farey","site":"shroudstory"},{"title":"David Rolfe we need you","post":"900°C ? Where ? How long ?\nAt least locally, on the reliquary, long enough to melt silver. Does it mean the temperature reached 900°C inside the reliquary ? I don’t think so.\nWas the water poured directly on the shroud or more likely on the reliquary to cool it down ?\nWas the shroud still on fire when water was poured or had the silver cooled down and was the fire smothed ?\n\n","date":"February 23, 2013 at 7:14 am","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25385","author":"anoxie","site":"shroudstory"},{"title":"David Rolfe we need you","post":"For those not familiar with Catholic traditions, I will say that all over Europe there are thousands of via crucis formed by stone crosses along a path. Each cross represents a station and most particularly, the sixth station (cross) is the Veronica wiping Jesus face of blood and sweat. Many crosses corresponding to this sixth station depict the same we see in this Briton calvary\n\n","date":"February 23, 2013 at 5:24 am","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25378","author":"Gabriel","site":"shroudstory"},{"title":"David Rolfe we need you","post":"Gabriel, I’d like more confirmation before coming to your conclusion.  Gazay claims to have studied Calvarys all over Brittany, and claims that this particular Breton Calvary is quite distinctive.  I still find it intriguing that he sees comparisons with the Shroud face, including the forehead epsilon.  In this particular case, the face is presented on a landscape framed aspect, (a classic Mandylion presenation) and it is held by a cherub-like figure, not by St Veronica.  He mentions that he has studied some 3000 Breton Calvarys and none others have these features.  The Atlas of Finistere crosses and Calvarys does not mention any other Calvary of this type.  PDF is ‘secured’ so I can’t do a Copy & Paste of the particular paragaph on p. 10 of the paper, but you can read it there.\n\n","date":"February 23, 2013 at 3:42 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25426","author":"daveb of wellington nz","site":"shroudstory"},{"title":"David Rolfe we need you","post":"You do not need a very high temperature to discolour flax fibres. 200 degrees C is more than enough. Guerreschi and Salcito (http://www.shroud.com/pdfs/aldo4.pdf) show a picture of the niche in the wall where the silver reliquary was kept, secured, according to tradition, by an iron grill that needed the attention of a blacksmith before the shroud could be rescued. It is quite high in a wall above an altar, and Guerreschi speculates that the fire started in some combustible material below the niche. We know very little else about it, or how far it spread (to the roof for instance?). Assuming the temperature of the fire managed to reach the melting point of silver at all (which is far from obvious), and assuming that the reliquary was, in fact, made of silver (which is also far from obvious), the niche in the wall was effectively an oven. I do not think it necessary that the inside of the reliquary reached a uniform 900 degrees C, but at least a small part of it must have done, or the silver would not have melted through. Guerreschi demonstrates quite convincingly that the hole in the shroud could not have been made by molten silver, but more likely by a solid, such as a roof panel, fallen in after its fastening (to the rest of the reliquary) had melted or burned away. Remarkably, the water stains associated with the burn holes are extremely minor (nothing like the much bigger patches associated with Guerreschi’s ‘urn event’), and suggest an attempt to quench the heat with as little water as possible, rather than pouring buckets of it over the reliquary and in through the hole. Much important information is lost to us and remains highly speculative, such as how the reliquary (hot or cold) was removed from the chapel, and how the shroud was removed from the (burnt away? badly damaged?) reliquary. However, in view of all the above, it seems to me extraordinary, and verging on incredible, that the temperature inside the reliquary did not get high enough to make any difference to the material of the shroud at all.\n\n","date":"February 23, 2013 at 7:52 am","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25392","author":"Hugh Farey","site":"shroudstory"},{"title":"David Rolfe we need you","post":"Was the reliquary made of pure silver, or was it a hardwood box lined with silver? Does anyone know for sure? I would think that if the heat from the fire reached temps high enough (900C) to melt the silver (lining) of the reliquary, then ‘internally’, the reliquary temperature would be very close indeed….I would suggest it was a miracle the Shroud was not completely destroyed ;-)\nR\n\n","date":"February 23, 2013 at 4:02 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25428","author":"Ron","site":"shroudstory"},{"title":"David Rolfe we need you","post":"Ron, according to  Guerreschi’s paper we don’t know if silver or the lining of the reliquary did melt at all.\nThe niche in the stone has protected the reliquary from heat and direct flames.\nA metallic (?) object may have been a thermal bridge between the fire and the shroud.\n\n","date":"February 24, 2013 at 6:42 am","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25479","author":"anoxie","site":"shroudstory"},{"title":"David Rolfe we need you","post":"For having exchanging some emails directly with Aldo (a GENTLEMAN !) on that subject, he told me that he thought the holes were caused by a part of the lid of the reliquary, which could have been a very hot mettalic bar that was located under the lid to give it a good support.  It would be this bar under the lid that would have fell diagonaly into the cloth and burned it, causing bigger burn holes on top of the folded cloth and smaller burn holes as we get more deep into it.  The form of the holes make it difficult to believe they could have been caused by a drop of molten silver.  Aldo’s hypothesis is hard to dismiss because he clearly show that a hot mettalic bar can cause the same kinds of holes we see on the Shroud.  I think he was even able to reproduce the burn holes with a replica of the Shroud and a hot mettalic bar or a similar object.\n\n","date":"February 24, 2013 at 5:10 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25547","author":"Yannick Clément","site":"shroudstory"},{"title":"David Rolfe we need you","post":"Guerreschi’s experiment, which so accurately reproduced the burn patterns on the shroud, was carried out while the cloth was cold. He did not explore the circumstances of the original burn, which reputedly took place while the reliquary was engulfed by fire.\n\n","date":"February 24, 2013 at 6:12 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25555","author":"Hugh Farey","site":"shroudstory"},{"title":"David Rolfe we need you","post":"Anyway, he was able to show that a mettalic bar that fell into a folded cloth like the Shroud with a diagonal angulation can produce the same kind of holes we see on the cloth.  That’s good enough for me.\n\n","date":"February 24, 2013 at 6:29 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25556","author":"Yannick Clément","site":"shroudstory"},{"title":"David Rolfe we need you","post":"Thank you for this very interesting reference. Reading this article I definitely think temperature was much lower, and actually a slow pyrolysis due to a direct contact to an overheated object seems very likely.\n\n","date":"February 23, 2013 at 8:08 am","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25394","author":"anoxie","site":"shroudstory"},{"title":"David Rolfe we need you","post":"Thanks for this reference, Hugh.  I’ll look forward to reading it with considerable interest.\n\n","date":"February 23, 2013 at 3:24 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25425","author":"daveb of wellington nz","site":"shroudstory"},{"title":"David Rolfe we need you","post":"I shall rephrase here my too hasty comment on Paper Chase and Historical C14 Challenge: Relations of a Breton Calvary with the Shroud and the Templar Knights (see #8 on February 20, 2013 at 8:53 pm)\nThe only snag is the Breton calvary of the “Park ar Groaz ru” is JUST supposed to be of templar origin. The two stone-sculpted inscriptions on the pedestal read:  1600 CE (on the West face) and LANVOXO (1515 CE) the North face) NOT MCCCIV (1304 CE) as François Gazais most misleadingly claimed (misreading).\nBesides the Capital writing style of both inscriptions just cannot be early 1300 CE style. The  same goes for the general aspect of the Christ face embossed in granite. However the latter’s most original/intriguing features (Christ head with no nimbus and epsilon letter-like shape mark, right in centre of stone sculpted and landscape frame 2X1) could indicate this is a stone copy of a much older stone template dating back to the Knights Templar. If so, how much is it faithful to the original? This is yet another speculation.\n\n","date":"February 24, 2013 at 9:56 am","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25488","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"David Rolfe we need you","post":"E.g. compare the Breton calvary head lower-relief in granite with Albrecht Dürer’s The Vernicle Held By Two Angels (1513 CE). The single little winged angel holding the frame with both hands, his head right above that of Christ, could be also regarded as an additional departure from the 15-16th CE iconography of the Veronica Veil (if the stone-sculpted face were to be identified with the famous Roman relic).\n\n","date":"February 24, 2013 at 1:22 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25524","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"David Rolfe we need you","post":"See also Rome, flag with Veronica of the Swiss Guard dating from 1512.\n\n","date":"February 24, 2013 at 1:42 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25526","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"David Rolfe we need you","post":"See also the Veronica depicted in a manuscript of the Divine Comedy, Venice, 1390\n\n","date":"February 24, 2013 at 1:46 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25527","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"David Rolfe we need you","post":"See + The Opusculum of Grimaldi of 1618 showing the face of Jesus on the Veil of Veronica with his eyes open\n\n","date":"February 24, 2013 at 1:49 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25529","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"David Rolfe we need you","post":"See ++ the Veronica by a 15th Flemish master\n\n","date":"February 24, 2013 at 1:54 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25530","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"David Rolfe we need you","post":"Something just doesn’t fit in\n\n","date":"February 24, 2013 at 1:55 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25531","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"David Rolfe we need you","post":"It does look as a mix of the two holy faces…\n\n","date":"February 24, 2013 at 2:00 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25532","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"David Rolfe we need you","post":"Now the Holy Face on the Templecombe panel does also look like a mix of BOTH the Holy Face of the Veronica Veil and that of the Holy Shroud.\n\n","date":"February 24, 2013 at 2:03 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25533","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"David Rolfe we need you","post":"What now if the original Edessan Image was catually a mix of the Holy Face of the Holy Mandylion and that of the Holy Shroud as the two had been kept in the same reliquary, the veil face overlaying that of the shroud?\n\n","date":"February 24, 2013 at 2:08 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25534","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"David Rolfe we need you","post":"…and been separated sometimes between the early 7th and the mid-10th CE?\n\n","date":"February 24, 2013 at 2:14 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25536","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"David Rolfe we need you","post":"Typo: The two stone-sculpted inscriptions on the pedestal read: 1600 CE (on the West face/no photograph provided) and “LANVOXO” (1515 CE) on the North face NOT AT ALL “MCCCIVOXb” (1304 CE + sculptor’s initials (sic!)).\n\n","date":"February 24, 2013 at 7:31 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25563","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"David Rolfe we need you","post":"Since I am very busy at the moment and have no time to go check out on site, could someone provides a HD/quality photograph for the West face written inscription for comparison sake? Thank you.\n\n","date":"February 24, 2013 at 10:02 am","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25490","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"David Rolfe we need you","post":"Typo: could someone provide\n\n","date":"February 24, 2013 at 10:28 am","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25498","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"David Rolfe we need you","post":"TYPO: the general aspect of the Christ face BAS RELIEF in granite\n\n","date":"February 24, 2013 at 10:37 am","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25500","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"David Rolfe we need you","post":"This research should have been done years ago. That the Knights Templar were not heretics can be gauged from the fact that (Avignon) Pope Clement V summoned Jacques de Molay, based in Cyprus, to discuss new crusading plans. It was in the interest of the Grand Master to boost morale after the Fall of Acre, but he fell into the hands of Philippe le Bel, whose treasury was empty.\nOne scholar in France who refused to accept the Templar hypothesis was the late Daniel Raffard de Brienne (see the interview-article “Shroud Studies in France”, on the HSG website). Some years after that came the successful research conducted by Barbara Frale on the Chinon Parchment and unfortunately all hope in further findings turned out to be an illusion when she apparently made some distortions while working on Arnaut Sabbatier, destroying an entire chapter in an important Shroud book.      \nWe are now left hoping that Breton can provide some clues.\n\n","date":"February 24, 2013 at 11:01 am","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25502","author":"Louis","site":"shroudstory"},{"title":"David Rolfe we need you","post":"I think the hypothesis of Othon de la Roche in Athena is much more credible and rational regarding the known historical facts and it got at least one solid manuscript to base upon.  That particular hypothesis (still far from being proven) has been defended by great French historians like Antoine Legrand and Emmanuel Poulle and I personally favored it too.\n\n","date":"February 24, 2013 at 5:14 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25550","author":"Yannick Clément","site":"shroudstory"},{"title":"David Rolfe we need you","post":"One further comment: Philippe le Bel had treated Boniface VIII very badly, that being the reason why Clement V knew who he was dealing with. All information in favour of the Templars was suppressed by the French king, who had absolutely no power to prevent de Molay from being led to the stake. If both Church and State are blamed for what happened to the Grand Master then that is like giving a green signal to Baigent, leading to what is now being said about Lirey and Cluny.\n\n","date":"February 24, 2013 at 11:56 am","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25514","author":"Louis","site":"shroudstory"},{"title":"David Rolfe we need you","post":"Correction: Clement V had absolutely no power to prevent de Molay from being led to the stake. The French monarchy had lost the confidence of the Church, therefore the successors of the Templars were the Knights of Christ, in Portugal.\n\n","date":"February 24, 2013 at 12:11 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25517","author":"Louis","site":"shroudstory"},{"title":"David Rolfe we need you","post":"See also limestone head of Christ, late 15th–early 16th century\nNetherlands, North Brabant\n\n","date":"February 24, 2013 at 4:30 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25542","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"David Rolfe we need you","post":"See also the Lateran palace image (thought to have been painted in Rome between the 5th and 6th century CE). Originally, the image was that of an enthroned Yeshua with a crossed halo, featured as the Teacher holding the scroll of the Law in his left hand while his right is raised in benediction. The face completely changed when Pope Alexander III (1159–1181) had the present one, painted on silk, placed over the original with the head sole appearing as if in LANDSCAPED FRAME (2×1) the rest of the icon being covered  with an embossed silver plate and precious stones.\n\n","date":"February 24, 2013 at 4:52 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25545","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"David Rolfe we need you","post":"The Uronica/Acheropita also shows a little winged angel head, just underneath Christ’s face though…\n\n","date":"February 24, 2013 at 6:51 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25561","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"David Rolfe we need you","post":"Most likely the calvary stone-sculpted face is a mix between the Holy Shroud face, the Holy Face of the Veronica and the Uronica/Acheropita in terms of landscaped frame 2×1 in conjunction with little winged angel head.\n\n","date":"February 24, 2013 at 6:59 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","id":"comment-25562","author":"Max Patrick Hamon","site":"shroudstory"}]
