[{"title":"Was the Shroud of Turin a Tablecloth?","post":"so go to the link to the book where you will see an alternative (apparently authoritative) Jewish view that table cloths WERE in common use in the first century AD.\nI’m not convinced either that the shroud was the table cloth at the last supper, but neither am I prepared to totally write it off. After all the width and length of the shroud generally fits with the dimensions of a table cloth that would fit with a table of the right sort of dimensions to accommodate the last supper.\nAlso, if you believe in Shroud authenticity, why else would the shroud have been selected, and where from? I would think there would be other more obvious types of wrapping cloths.  \nThe idea that the shroud was the last supper table cloth also kinda works symbolically, in terms of the meal symbolism of Christ and the Bible, the body as the bread and the blood as the wine etc. And some efforts might have gone towards securing the high quality table cloth – shroud – given the importance of the last supper.\nanyhow, just a thought\n\n","date":"March 20, 2013 at 8:40 am","url":"https://shroudstory.com/2013/03/20/was-the-shroud-of-turin-a-tablecloth/","cat":"history","id":"comment-27894","author":"Matthias","site":"shroudstory"},{"title":"Was the Shroud of Turin a Tablecloth?","post":"Inspired by this post, I ahve posted a piece on my own blog: http://johnklotz.blogspot.com\nI ask the question: The image on the Turin Shroud: Is a laser like light the explanation?\n\n","date":"March 20, 2013 at 8:59 am","url":"https://shroudstory.com/2013/03/20/was-the-shroud-of-turin-a-tablecloth/","cat":"history","id":"comment-27895","author":"John Klotz","site":"shroudstory"},{"title":"Was the Shroud of Turin a Tablecloth?","post":"Biophotons – The Light in Our Cells\nWhat are biophotons ?\nBiophotons, or ultraweak photon emissions of biological systems, are weak electromagnetic waves in the optical range of the spectrum – in other words: light. All living cells of plants, animals and human beings emit biophotons which cannot be seen by the naked eye but can be measured by special equipment developed by German researchers.\nThis light emission is an expression of the functional state of the living organism and its measurement therefore can be used to assess this state. Cancer cells and healthy cells of the same type, for instance, can be discriminated by typical differences in biophoton emission. […]\nAccording to the biophoton theory developed on the base of these discoveries the biophoton light is stored in the cells of the organism – more precisely, in the DNA molecules of their nuclei – and a dynamic web of light constantly released and absorbed by the DNA may connect cell organelles, cells, tissues, and organs within the body and serve as the organism’s main communication network and as the principal regulating instance for all life processes. The processes of morphogenesis, growth, differentiation and regeneration are also explained by the structuring and regulating activity of the coherent biophoton field. The holographic biophoton field of the brain and the nervous system, and maybe even that of the whole organism, may also be basis of memory and other phenomena of consciousness, as postulated by neurophysiologist Karl Pribram an others. The consciousness-like coherence properties of the biophoton field are closely related to its base in the properties of the physical vacuum and indicate its possible role as an interface to the non-physical realms of mind, psyche and consciousness.\nThe discovery of biophoton emission also lends scientific support to some unconventional methods of healing based on concepts of homeostasis (self-regulation of the organism), such as various somatic therapies, homeopathy and acupuncture. The “ch’i” energy flowing in our bodies’ energy channels (meridians) which according to Traditional Chinese Medicine regulates our body functions may be related to node lines of the organism’s biophoton field. The “prana” of Indian Yoga physiology may be a similar regulating energy force that has a basis in weak, coherent electromagnetic biofields.\nBackground\nFirst discovered in 1923 by Russian medical scientist Professor Alexander G.Gurvich (who named them “mitogenetic rays”) and in the 1930s widely researched in Europe and the USA, biophotons have been rediscovered and backed since the 1970s by ample experimental and theoretical evidence by European scientists. In 1974 German biophysicist Fritz-Albert Popp has proved their existence, their origin from the DNA and later their coherence (laser-like nature), and has developed biophoton theory to explain their possible biological role and the ways in which they may control biochemical processes, growth, differentiation etc. Popp’s biophoton theory leads to many startling insights into the life processes and may well provide one of the major elements of a future theory of life and holistic medical practice based on such an approach. The importance of the discovery has been confirmed by eminent scientists such as Herbert Froehlich and Nobel laureate Ilya Prigogine. Since 1992, the International Institute of Biophysics, a network of research laboratories in more than 10 countries, based in Germany, is coordinating research in this field which promises rapid development in the next decade. […]\nFull report:\nhttp://transpersonal.de/mbischof/englisch/webbookeng.htm\nLuke 24:3-4 And they entered in, and found not the body of the Lord Jesus. And it came to pass, as they were much perplexed thereabout, behold, two men stood by them in shining garments\nMatthew 28:1-4 In the end of the sabbath, as it began to dawn toward the first day of the week, came Mary Magdalene and the other Mary to see the sepulchre. And, behold, there was a great earthquake: for the angel of the Lord descended from heaven, and came and rolled back the stone from the door, and sat upon it. His countenance was like lightning, and his raiment white as snow: And for fear of him the keepers did shake, and became as dead men. \nRevelation 21:23 And the city had no need of the sun, neither of the moon, to shine in it: for the glory of God did lighten it, and the Lamb is the light thereof.\nEphesians 5:14 Wherefore he saith, Awake thou that sleepest, and arise from the dead, and Christ shall give thee light.\nPsalm 17:15  As for me, I will behold thy face in righteousness: I shall be satisfied, when I awake, with thy likeness.\nMalachi 4:2  But unto you that fear my name shall the Sun of righteousness arise with healing in his wings; and ye shall go forth, and grow up as calves of the stall. \nDaniel 10:5-6  Then I lifted up mine eyes, and looked, and behold a certain man clothed in linen, whose loins were girded with fine gold of Uphaz: His body also was like the beryl, and his face as the appearance of lightning, and his eyes as lamps of fire, and his arms and his feet like in colour to polished brass, and the voice of his words like the voice of a multitude\nRevelation 1:14-16  His head and his hairs were white like wool, as white as snow; and his eyes were as a flame of fire;  And his feet like unto fine brass, as if they burned in a furnace; and his voice as the sound of many waters. And he had in his right hand seven stars: and out of his mouth went a sharp twoedged sword: and his countenance was as the sun shineth in his strength. \nExodus 34:29-35  And it came to pass, when Moses came down from mount Sinai with the two tables of testimony in Moses’ hand, when he came down from the mount, that Moses wist not that the skin of his face shone while he talked with him.  30 And when Aaron and all the children of Israel saw Moses, behold, the skin of his face shone; and they were afraid to come nigh him. […] And till Moses had done speaking with them, he put a vail on his face.  34 But when Moses went in before the LORD to speak with him, he took the vail off, until he came out. And he came out, and spake unto the children of Israel that which he was commanded.  35 And the children of Israel saw the face of Moses, that the skin of Moses’ face shone: and Moses put the vail upon his face again, until he went in to speak with him.\nNumbers 6:24-27  The LORD bless thee, and keep thee:  The LORD make his face shine upon thee, and be gracious unto thee:  The LORD lift up his countenance upon thee, and give thee peace.  And they shall put my name upon the children of Israel; and I will bless them. \nDaniel 12:2-4  And many of them that sleep in the dust of the earth shall awake, some to everlasting life, and some to shame and everlasting contempt.  3 And they that be wise shall shine as the brightness of the firmament; and they that turn many to righteousness as the stars for ever and ever.  4 But thou, O Daniel, shut up the words, and seal the book, even to the time of the end: many shall run to and fro, and knowledge shall be increased.\netc etc..\n\n","date":"March 20, 2013 at 12:03 pm","url":"https://shroudstory.com/2013/03/20/was-the-shroud-of-turin-a-tablecloth/","cat":"history","id":"comment-27913","author":"EGM","site":"shroudstory"},{"title":"Was the Shroud of Turin a Tablecloth?","post":"Back to the question of the table-cloth, I would tend to have my doubts – it sounds like speculation, a nice pious thought linking the body in the Shroud to the eucharist.  Although Matthew, Luke and John merely say that Joseph (and Nicodemus) wrapped the bosy in a clean shroud, Mark (earliest gospel – source Peter?) says that Joseph PURCHASED a shroud which wouldn’t seem necessary if it was already in possession as a table cloth. \nA.A.M. van der Hoeven wrote a paper in 2011, “The Turin Shroud as John Mark’s temple garment” with a considerable amount of supporting evidence, and which seems more credible.  I went to check the URL source last night, on the ‘jesusisking’ site where vd Hoeven has several other relevant papers. However I got stung with a virus which my security failed to detect and have spent the last 18 hours on recovery, so CAUTION if you’re tempted to investigate this site, and it may be best if you search for it elsewhere.  \nHere’s the opening paragraph:\n“In this article I will show how the garment left by the young man who “ran away naked” (Mark 14:51-52) became the burial shroud of Jesus. The properties of the Turin Shroud for its identification as a garment, even a priest‟s garment, are its Pharisaic enlarged border and cut off corners (and fringes), its apparel weave, the threads‟ possibly sacerdotal Z-twist, and its images of a priest‟s oval ornament and seal with its cord. The most outstanding biblical fact that identifies Jesus‟ shroud as a priest‟s garment is the beloved disciple‟s belief that Jesus had risen because he saw the shroud rolled up and placed aside (John 20:7-8), just as a priest‟s garment was always rolled up and placed aside in the temple. In this article I argue that the beloved disciple was the secret disciple John Mark, the Sanhedrin‟s priest-secretary.”\n\n","date":"March 20, 2013 at 11:34 pm","url":"https://shroudstory.com/2013/03/20/was-the-shroud-of-turin-a-tablecloth/","cat":"history","id":"comment-27945","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Was the Shroud of Turin a Tablecloth?","post":"Daveb – although Mark says Joseph ‘purchased’ a cloth, as we know there are many discrepancies between the gospels – maybe Mark was wrong on this point!\nI come back to the point, IF the shroud is authentic, then it doesn’t really make sense to me that it was purchased by Joseph to wrap Jesus’s body. Surely a wider, more encompassing cloth would have been purchased?  The Shroud is hardly wide enough to properly wrap a body. Yet it is about the right width to have covered a table, and the right length to have extended along a long table that could accommodate Jesus and the disciples.\n\n","date":"March 21, 2013 at 3:42 am","url":"https://shroudstory.com/2013/03/20/was-the-shroud-of-turin-a-tablecloth/","cat":"history","id":"comment-27952","author":"Matthias","site":"shroudstory"},{"title":"Was the Shroud of Turin a Tablecloth?","post":"Both Matthew & Luke draw heavily on Mark (~90% of Mark in Matthew), snd specifically the Passion narrative, so I can agree that it’s interesting that they both decided to omit Mark’s “purchase” story.  If it was Mark’s temple garment, he could be expected to know if Joseph paid money for it, either to Mark himself or to the temple. Alternatively it would be Peter’s belief that Joseph purchased it. Joseph was a secret follower, he was on the Council which might give him special access, and he was also wealthy. A.v.d. Hoeven makes a credible case for it being a temple garment.  I suggest if you can acquire v.d. Hoeven’s paper safely (possibly on Shroud.com site?) that you have a good read of it.  Using a table-cloth for a shroud doesn’t seem to me such a good idea, but I could be wrong. It’s also interesting that later in the first century, Gamaliel required that all future shrouds be of plain weave. Did Gamaliel come to hear of the purpose to which Mark’s temple garment had been used, a burial cloth for a condemned person, possibly compounding the alleged blasphemy?  All very interesting, necessarily speculative, but v.d. Hoeven makes some interesting points!\n\n","date":"March 21, 2013 at 4:26 am","url":"https://shroudstory.com/2013/03/20/was-the-shroud-of-turin-a-tablecloth/","cat":"history","id":"comment-27954","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Was the Shroud of Turin a Tablecloth?","post":"Hoevan’s theory has holes in it. One: It is clearly stipulated in the Gospels that Jesus was wrapped in a ‘clean’ cloth. If it had been worn “by the young man who ran away naked”, it would definitely not be considered clean. Two: Hoeven mis-identifies the Shroud as the napkin which had been rolled up by itself in the tomb….next theory.\n I don’t agree fully with Jacksons’ hypothesis of the Shroud possibly being a table cloth for the same reason as mentioned, that it would not be a clean cloth,…but I am not ready to totally dismiss it either. One really needs to ask the question; Where did Joseph get the sheet on the dawn of the Sabbath? He couldn’t buy it, all shops would be closed. Was it actually a burial sheet or something else? It seems a little extravagant for a burial sheet and especially as it is written that Jews of the time should be buried in a simple garment. Nothing extravagant.\nThoughts?…\nR\n\n","date":"March 21, 2013 at 2:30 pm","url":"https://shroudstory.com/2013/03/20/was-the-shroud-of-turin-a-tablecloth/","cat":"history","id":"comment-27985","author":"Ron","site":"shroudstory"},{"title":"Was the Shroud of Turin a Tablecloth?","post":"maybe ‘clean’ is relative? Maybe the shroud – as table cloth – if shaken free of bread crumbs etc was relatively ‘clean’. Alternatively, maybe the use of the word ‘clean’ was artistic, symbolic licence?\n\n","date":"March 22, 2013 at 5:13 am","url":"https://shroudstory.com/2013/03/20/was-the-shroud-of-turin-a-tablecloth/","cat":"history","id":"comment-28031","author":"Matthias","site":"shroudstory"},{"title":"Was the Shroud of Turin a Tablecloth?","post":"ps Wellington is my hometown! (I now live in Australia)\n\n","date":"March 21, 2013 at 4:29 am","url":"https://shroudstory.com/2013/03/20/was-the-shroud-of-turin-a-tablecloth/","cat":"history","id":"comment-27955","author":"Matthias","site":"shroudstory"},{"title":"Was the Shroud of Turin a Tablecloth?","post":"Mark 15:46 actually should be read: “And he (Joseph of Arimathea) HAD BOUGHT (literally “HAVING bought” in koine Greek as it is in the aorist)  a linen cloth (for his own burial), and he took him down, and wrapped him in the linen cloth and laid him in a tomb that had been hewn out in the rock and he rolled a stone”. The aorist here renders the Hellenised Aramaic/Hebrew wayyiqtol used as ‘pluperfect’) so the undefined tense of this verb looks like an aorist.\n\n","date":"March 21, 2013 at 7:00 am","url":"https://shroudstory.com/2013/03/20/was-the-shroud-of-turin-a-tablecloth/","cat":"history","id":"comment-27962","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Was the Shroud of Turin a Tablecloth?","post":"I agree with Ron that Hoeven’s theory is far from perfect. I even believe there may be a few glaring errors in it. For example, (s)he seems to me to identify the writers of the second and fourth gospels as the same person, merely on the basis that their Jewish names were John. In the fourth gospel, “the disciple that Jesus loved” is more usually identified with the writer of that gospel, and there seems to be a strong tradition that this was a son of Zebedee, a fisherman, not a temple secretary.  This “loved disciple” is the one who hesitates to enter the tomb, but is then supposed to recognize his temple garment. Augustine of course has a different take on “and then he believed (the women)”.  \nHowever, I think Hoeven makes a credible case for it being a temple garment. In view of Max’s comment, is it possible that it was actually Joseph’s temple garment? It was actually Gamaliel II in the 2nd century who insisted on being buried in a plain weave linen cloth, to counteract the then Jewish trend for extravagant and costly funerals, and the requirement for plain weave shrouds dates from this example. Hoeven covers the case for the requirement of a ritually clean burial cloth by it being a temple garment. I think Hoeven has tried to piece together a disparate jigsaw but I suspect that all the pieces don’t come from the one and the same puzzle.\n\n","date":"March 21, 2013 at 3:56 pm","url":"https://shroudstory.com/2013/03/20/was-the-shroud-of-turin-a-tablecloth/","cat":"history","id":"comment-27993","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Was the Shroud of Turin a Tablecloth?","post":"Daveb; “I think Hoeven makes a credible case for it being a temple garment.” …Actually I don’t believe he does. I remember reading, (Don’t ask me where, I can’t remember), but trust I am not making it up, that temple garments were adorned along the edges with a “blue?” stripe, designating one of the temple…Where is this adornment on the Shroud?\nR\n\n","date":"March 21, 2013 at 6:43 pm","url":"https://shroudstory.com/2013/03/20/was-the-shroud-of-turin-a-tablecloth/","cat":"history","id":"comment-28007","author":"Ron","site":"shroudstory"},{"title":"Was the Shroud of Turin a Tablecloth?","post":"Ron: Question of the seam is adequately covered in Hoeven’s paper. I suggest you read through it, but not necessarily accepting the full paper.\nPage 1, para 3: “So, the commandment of Nu 15,38 can be read as a prescription to put on every robe an ornamental margin with a blue cord in it. In order to fulfil this commandment in a meticulous and Pharisaic way, even for his all-white linen temple garment, Mark probably applied a margin to his mantle by making a long seam a few centimeters from one of its long edges, and made a hole in the corners of this margin, to which a blue cord could be fastened (for out-of-temple situations, such as in the House of Caiphas in the Upper City and perhaps also Caiphas‟ office palace in Antonia) or loosened (for in-temple situations, especially for when in the Chamber of Hewn Stones in the Court of the Israelites).” \nPage 5, para 4: “Now, in order to remain a secret disciple he had to prevent anyone from recognizing the rolled up burial shroud as his temple sindōn. It would be sufficient to cut off the margin along the ornamental seam, for then this seam would look like an ordinary functional hem, applied to prevent the edge from loosening, and not like the unique ornamental seam of his „talith‟. And he did not have to cut off the margin for the complete length of the cloth, for the seam was only visible in the last and next to last layer of the roll, formed by the ends of the cloth when it is doubled in the middle and rolled up from the fold. And on removing the two ends of the margin he of course simultaneously removed its two holes to which the blue cords were fastened.”\nHoeven at least recognises the issue and attempts to deal with it.\n\n","date":"March 21, 2013 at 8:45 pm","url":"https://shroudstory.com/2013/03/20/was-the-shroud-of-turin-a-tablecloth/","cat":"history","id":"comment-28013","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Was the Shroud of Turin a Tablecloth?","post":"Question – how would the shroud be worn as a garment? I can’t see it. Maybe if it was wrapped around and over some how?\n\n","date":"March 22, 2013 at 5:15 am","url":"https://shroudstory.com/2013/03/20/was-the-shroud-of-turin-a-tablecloth/","cat":"history","id":"comment-28032","author":"Matthias","site":"shroudstory"},{"title":"Was the Shroud of Turin a Tablecloth?","post":"The sindon could be worn either as a himation (i.e. as outer garment over a tunic) or as  achiton (i.e. as inner garment next to the skin = indoor wear/work wear). It was worn either draped about the body from shoulder to ankle (as himation) or draped about the body from shoulder, girdled and tucked to knees (as achiton).\na. One end of the garment is thrown over the left shoulder to hang between calf and ankle.\nb. The remaining material is brought around under the right arm, across the back and thrown over the left shoulder.\nc. The remaining material is draped along the length of the arm to hand down towards the left foot. »\nd. the length can be tucked when the linen cloth is girdled around the waist.\nFor a man 5”8” to 6’2” the himation/achiton should be roughly 4.2m long & 1.4m wide i.e. exactly the same long rectangular shape and roughly the same size as the Turin Shroud 440cm long &115cm wide.\n\n","date":"March 22, 2013 at 6:49 am","url":"https://shroudstory.com/2013/03/20/was-the-shroud-of-turin-a-tablecloth/","cat":"history","id":"comment-28037","author":"Max Patrick Hamon","site":"shroudstory"}]
