[{"title":"Davor Aslanovski: Sindonology a Heresy","post":"Davor A. wrote: “[…] in the midst of falsehoods and appearances (and psychological issues and quests for a meaningful calling and wishful thinking and fetishism and quotation battles and blown-up egos and copyright problems (??!!) and ad hominem attacks….” \n…AND conventional Art historians’ Academic ignorance (as far as the Image of Edessa is concerned) I would add…\n\n","date":"October 7, 2012 at 9:59 am","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17281","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"…making DA an heretic himself.\n\n","date":"October 7, 2012 at 10:01 am","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17282","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"Shall the “choice (i.e. heresy) of ignorance” be now the norm?\n\n","date":"October 7, 2012 at 10:14 am","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17283","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"I find the use of the word “heretic” to be an anachronism. Galileo, for example was a heretic and escaped the stake by retracting his truth. Can we have an intelligent discussion without some true believer claiming that others are heretics. And by whose definition: Pius Xii, John xxiii, Benedict XVI or Jerry Falwell?\nPlease, let’s determine the facts to to best of our ability and the implications of those facts. Frankly, for anybody to attempt to win an argument by declaring some else a heretic is, well, asinine. Quit the braying fool! (Do I sound angry?).\n\n","date":"October 7, 2012 at 10:34 am","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17285","author":"John Klotz","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"It’s not my fault that you are unwilling to read the whole thing, or that Dan happens to think that the ‘heresy’ part is more important than this part: \n‘(…) first Christians thought so very little of this cloth that bore not only the image of their Lord but His most sacred BLOOD that they let it slip out of memory.’ \nBut if you’re just going to read and comment on one line, then let it please be this one:\n‘We, Christians, have once FORGOTTEN that there was a cloth, in some niche above some city gate, that bore Christ’s BLOOD.’ \nThank you.\n\n","date":"October 7, 2012 at 11:16 am","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17286","author":"Davor Aslanovski","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"It was a very good idea to post the comments by Davor Aslanovski on this blog, first  because despite his scepticism he is still open-minded and draws attention to the fact that Christian faith does not depend on relics. Secondly, what he has noticed is also what struck Benedict XVI, therefore his message as read out by Bishop Kevin Vann of Forth Worth, Texas at the last Shroud conference in Dallas. \nThat said, it is also true that “heresy” was not the right word to use, but it seems that Davor was using it in a very broad sense. A scholar like him can contribute much in the field of Shroud studies  —- if he is given the right conditions.\n\n","date":"October 7, 2012 at 11:56 am","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17287","author":"Louis","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"\nLouis :\nhis message as read out by Bishop Kevin Vann of Forth Worth, Texas at the last Shroud conference in Dallas?","date":"October 7, 2012 at 12:23 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17288","author":"Davor Aslanovski","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"Yes, Davor, that’s right. If you contact BSTS they have the entire message in one of the previous issues and you may also find it in pdf format over the internet as many issues are now available online. Benedict XVI stressed the need for cooperation.\n\n","date":"October 7, 2012 at 12:50 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17289","author":"Louis","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"Yes, I’ve read it, but I don’t see how it relates to what my post is about. Can you please explain?\n\n","date":"October 7, 2012 at 2:47 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17295","author":"Davor Aslanovski","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"DavorA; “It’s not my fault that you are unwilling to read the whole thing, or that Dan happens to think that the ‘heresy’ part is more important than this part:” …To your heresy part, I answer to you with this Jesus quote;\n“Do not judge, or you too will be judged, for in the same way as you judge others, yet you will be judged, and with the measure you use, it will be measured to you” – Matt 7:1-2\nAlso;\n“Why do you look at the speck of sawdust in your brothers eye, and pay no attention to the ‘plank’ in your own eye” -Matt 7:3\nAs to your second part;  ‘(…) first Christians thought so very little of this cloth that bore not only the image of their Lord but His most sacred BLOOD that they let it slip out of memory.’ …I quote Jesus again;\n“Do not give to the dogs what is sacred, do not throw your pearls to the pigs, they may trample them under their feet, and then turn and tear you to pieces” Matt 7:6\nWith that said, and the fact you claim to be an historian, mind you I understand simply an art historian; I still for the life of me cannot understand that you cannot place yourself in the shoes of the first Christians and the conditions or environments in that they must have endured? They were being persecuted! Tortured and killed! Anything to do with the faith was being destroyed by the pagen rulers who would endlessly conquer throughout the early centuries! With that in mind; How hard is it to contemplate that ‘Important’ relics such as the Shroud, were being hidden ‘securely’ and their location(s) ‘secretly’ guarded and ‘known’ only to the very few? This ‘secret’ again guarded and carried down generations, as well as humanly possible, but with the onslaught of invasions and persecutions, the likelyhood, being highly probable, those few with knowledge of the secret, simply being killed and the secret lost along with them? …Better to die in silence, then to give these pearls to the dogs…\nBut I quess since I have no academic credentials or relevant training in the disciplines, I may just be blowing alot of hot air here.\nR\n\n","date":"October 7, 2012 at 1:39 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17291","author":"Ron","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"Ron, I don’t think that you are blowing hot air. I believe that you’re speaking sincerely and from the heart, which is nothing to be sniffed at, but you are deeply mistaken on these issues.\nCalling something a heresy has nothing to do with the speck of sawdust in your brother’s eye. According to your interpretation, St Paul already, in passages like 1 Tim 6:20, directly contradicts the Lord’s instruction ‘not to judge.’ And what you would have to say of people like St Irenaeus, who have put together vast tomes precisely entitled ‘On/Against Heresies’ – I don’t even want to know. \nAs for the question of prosecutions and ‘anything to do with the faith (…) being destroyed by the pagen rulers who would endlessly conquer throughout the early centuries!’ – I’m not even going to go into the fact that persecutions did not happen *throughout* the early centuries. In a word, I am not going to give you a historian’s answer. I am just going to ask you, one Christian to another, if this secret was lost along with those very select few who knew it, how many other secrets were also lost? And what would Christianity look like today if we could recover those ‘lost secrets’?\n\n","date":"October 7, 2012 at 3:12 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17296","author":"Davor Aslanovski","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"Well I think you may be mistaken, as I believe, when you state/claim ‘sindonology’ is a heresy, and in saying so, you are basically stating sindonologists themselfs are in the act heresy or of a sin, (which I cannot begin to understand how this can possibly be true), hense my quotes and their relevance.\nAs to you to stating; “I’m not even going to go into the fact that persecutions did not happen *throughout* the early centuries.”;  I suggest you reevaluate that statement and consider doing some more research into the early centuries. As to your last questions; I am quite sure much has been lost, take Edessa for example; almost everything has been lost or destroyed from the early centuries, some ‘things’ just coming to light recently, but to answer how finding any new ‘presumed lost secrets’ would change how Christianity would look today, would be PURE conjecture. I also believe that you err in your presumption that any new findings would or could ‘change’ how we view Christianity. Who is to say any new findings might not strengthen our present views?\nR\n\n","date":"October 7, 2012 at 3:59 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17298","author":"Ron","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"It relates to the first paragraph of what you wrote.\n\n","date":"October 7, 2012 at 4:10 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17299","author":"Louis","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"Can you be more specific, please?\n\n","date":"October 7, 2012 at 4:20 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17302","author":"Davor Aslanovski","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"The above comment was the response to Davor Aslanovski’s query.\n\n","date":"October 7, 2012 at 4:12 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17300","author":"Louis","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"OK, I don’t have time for this. I thought for a moment that I could and should clarify some things for you, but this sort of a thing I don’t do. Especially not on the internet.\n\n","date":"October 7, 2012 at 4:18 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17301","author":"Davor Aslanovski","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"Just to make it absolutely clear: the above was in response to Ron, not to Louis.\n\n","date":"October 8, 2012 at 7:23 am","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17328","author":"Davor Aslanovski","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"Unless Jesus was buried naked contrary to the Gospels, there were definitely some burial cloths of his, and ones that bore his blood. Given the magnitude of the resurrection, I doubt the apostles/disciples would have promptly incinerated or disposed of his burial cloths. So it is reasonable to assume that they must have been/still are in existence. No early references to them is moot.\n\n","date":"October 7, 2012 at 5:25 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17304","author":"ChrisB","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"I will deal with this in the next part of this series of posts.\n\n","date":"October 8, 2012 at 7:22 am","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17327","author":"Davor Aslanovski","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"Can for instance Art Historian high priest’s’ servant DA clarify the Image of Edessa being both described as “rakos tetradiplon” and “himation”? He just can’t.\nCan he clarify whether the Image was in portait or in landscape mode? He just can’t.\nCan he clarify whether it was a small or long rectangurlar cloth? He just can’t.\nCan he clarify whether the Edessa Image was a truly archeiropoetic, half-painted-half acheiropoietic or painted image on cloth? He just just can’t.\nCan he discriminate between the true Image of Edessa and its two other Edessan copies? He just can’t.\nCan he tell us what made Abramos discrimate between the Image of Edessa and its two copies? He just can’t?\nCan he account for the Nestorian Easter secret ritual reported in 10th c. CE liturgical tractactes in conjunction with the Edessa Image? He just can’t.\nCan he clarify whether there were two, three or else there was no constant iconological formulae at all involved to depicting the Image of Edessa? He just can’t.\nShall we to rely on DA conventional academic/elistic ignorance as far as the Image of Edessa is concerned?\nA very big NO!\nNo matter how really wrong or right may be Ian Wilson, the TRUE HERESY would be to blindly rely on Art historians such as Davor Aslanovski, Andrea Nicoletti, Cameron  etc as they all are more ignorant than really knowledgeable as far as the image of Edessa is concerned. Whatever may be their academic credentials, the true fact is they are (almost) no better off than Wilson they keep criticizing (to say nothing of their parrot groupy, the French Canadian Geograph Clément).\n\n","date":"October 7, 2012 at 5:48 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17307","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"As a Jew Jesus would not have been buried naked and perhaps it was the magnitude of the resurrection, as mentioned by ChrisB, that made the disciples realise that they had been in close contact with the divine and the reason for preserving the burial shroud.\n\n","date":"October 7, 2012 at 6:19 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17308","author":"Louis","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"That is the most likely of reasons, one would suspect, or perhaps, Jesus simply asked them to collect them and to keep them safe and secure for posterity.\n\n","date":"October 10, 2012 at 12:36 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17419","author":"Ron","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"Mistypings: \n“Can he clarify whether the Image was in portait or landscape mode? He just can’t.”\n“Shall we rely on DA conventional academic/elistic ignorance as far as the Image of Edessa is concerned?”\n\n","date":"October 7, 2012 at 6:23 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17309","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"DA also wrote: \n“We, Christians, have once FORGOTTEN that there was a cloth, in some niche above some city gate, that bore Christ’s BLOOD.”\nI would just paraphrase him and tell him “You Christans have TAKEN GREAT CARE  that the cloth be kept from generation to generation until to-day.”\n\n","date":"October 7, 2012 at 6:28 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17310","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"Seems DA also forgets that the Sudarium Christi was also hidden in a well for 50+ years in the mountains of northern Spain! Maybe not forgotten, but reminiscent of a strange hiding place i.e; the arch of a large entrance gate, where the Shroud purportedly stayed for several centuries…and hidden by Christians nonetheless.\nR\n\n","date":"October 7, 2012 at 7:10 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17316","author":"Ron","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"Davor Aslanovski  also wrote: “We, Christians…”.\n Does he really think he is speaking on behalf of all Christians worldwide? Did he mention ‘blown egos’ in his black list?\n\n","date":"October 7, 2012 at 6:36 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17311","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"Mistyping: “blown-up egos”\n\n","date":"October 7, 2012 at 6:44 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17312","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"Louis wrote about DA: \n“A scholar like him can contribute much in the field of Shroud studies —- if he is given the right conditions.”\nOn the contrary I just think he can benefit very much in the field of Shroud Studies —-if he REALLY opens his mind to find himself an ignoramus.\n\n","date":"October 7, 2012 at 6:50 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17313","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"Mistyping:\n“On the contrary I just think he can benefit very much FROM the field of Shroud Studies —-if he REALLY opens his mind AND find himself an ignoramus.\n\n","date":"October 7, 2012 at 7:09 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17315","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"Some clarification is needed about my comments, so here they are:\nDavor has been critical about the personal attacks, insults that are seen in the field of Shroud studies. And, he is not the only one outside the field to point this out. Given the situation, which is not new, there is no reason to doubt that this was brought to the attention of Benedict XVI, and therefore the link made between Davor’s remarks and the message of the Pontiff — particularly the words about cooperation between Shroud groups —as read out by Bishop Vann in Dallas. \nIt seems that it has fallen on deaf years and the lack of respect can only contribute to make scholars —sceptical about the Shroud or not — from participating in some way or the other to the field of Shroud studies. In my view, there is no doubt that Davor can contribute with constructive criticism, if there are conditions for this, and this includes eliminating the hostility, wherever it comes from. \nThis blog is certainly the best for exchanging views about the relic, but at the rates things are going, a lot more moderation may be needed to maintain the good standard.\n\n","date":"October 7, 2012 at 7:57 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17317","author":"Louis","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"Thanks for the clarification, Louis.\n\n","date":"October 8, 2012 at 4:38 am","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17325","author":"Davor Aslanovski","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"You’re welcome, Davor.\n\n","date":"October 8, 2012 at 9:26 am","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17331","author":"Louis","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"Louis’ concilatory approach towards the current high priest of Byzantine art history is to be applauded.  However I find myself unable to share his faith and confidence that this discipline will at present be able to “contribute with constructive criticism” and shed some light on the history of Shroud of Turin, which I think is a great pity.  One would prefer to think that potentially it might be able to, as indeed several other disparate disciplines have contributed positive understandings of this relic.  However there are few or even no signs that it can do so at present.  \nDavor has categorised me as an adolescent sexagenarian, (which flatters my actual age), and has taken a solemn vow to ignore any of my subsequent postings.  Other readers of this blog may judge for themselves whether his appelation is accurate or not.  However I should like to hope that of such is the kingdom of heaven.  I too can indulge in wishful thinking.  At least I do not seek to be boring. \nHis primary thesis is to create out of his imagination, and from his ivory tower cocoon, two categories, that of the exoheretic and endoheretic.  His purpose in doing so seems to be create a protective mantle from the great mass of the unwashed for his own specialised discipline.  He identifies himself as a “pompous and arrogant git”, which might very well be true, but this pathetic attempt at “false modesty” is in fact an inverted “ad hominem” argument, and simply won’t do.  \nI think there is much for thought in his observation: “We, Christians, have once FORGOTTEN that there was a cloth, in some niche above some city gate, that bore Christ’s BLOOD.”  There are of course many reasons for why this might have occurred: vigorous persecutions in the early Church; recurring bouts of iconoclasm; the known acquisitiveness of Byzantine emperors, even Constantine himself, and the obvious need for secrecy in preserving such a sacred relic from beng converted into the emperor’s pyjamas.  It is little surprise that much has indeed been forgotten.  The greater population of Europe for instance seems to have forgotten most of its Christian heritage, and this fault extends even to my own tiny country.     \nHowever when we consider other disciplines, particularly in the hard sciences, major contributions have been made in our understanding of the Shroud.  Medical forensics: Yves Delage, Paul Vignon, Pierre Barbet, David Willis have all contributed positive evidence.  In Botany, even the primitive work of Max Frei identified pollen samples exclusive to the Dead Sea area, Palestine, Turkey, Greece, as well as the more ubiquitous Mediterranean species, and subsequent investigators have confirmed these findings.  Textile specialists have affirmed contamination from cotton exclusive to the Middle East, that the linen has been manufactured in accordance with known ancient Syrian practices, that the cloth itself is exactly 8 x 2 Royal Syrian cubits, while other investigators such as Nitowski, believed that there is pursuasive evidence of Jerusalem aragonite limestone comtamination.  In Chemistry one needs only mention the comprehensive studies carried out by Ray Rogers.  Photography and modern space imaging technology have contributed to our understanding of the image. \nTo all of this, Aslanovski and his brethren turn a blind eye.  The best he himself can come up with is that there may or may have not been a first century burial cloth with an image of Christ crucified on it, or it may be a medieval scorch mark!  This only emphasises the cloud cocoon of a singular disciplinary approach which grants little credit to other more scientific disciplines than the received wisdom of Byzantine art theology and its divine revelations.      \nThere is a single vacuum in our understanding of the Shroud, that is, its provenance and its history.  Various investigators have attempted to fill this void in their own particular way.  This has not satisfied the “true experts” who have abdicated from their responsibility in seeeking out an alternative that might satisfy.  They have shown that they have nothing to offer.  Nevertheless, the hard sciences have demonstrated that the authenticity of the Shroud is a credible proposition.  To this, the Byzantine Art Historians say: “Sorry, we have nothing to offer!” \nPerhaps it does not matter that there is this void.  The Shroud is here and now, for our own particular technological age to understand and make of it what we will.  Perhaps it is indeed a love letter from Jesus, meant for our own time, a witness aganst a disbelieving age.  \nDavor Aslanovski, may as he is so vowed to ignore my posting. I don’t think I really mind if that is his choice.  Others may like to cogitate more deeply.\n\n","date":"October 8, 2012 at 4:32 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17340","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"The big problem is that there are Christian scholars who guarantee that the Shroud is 100% genuine but refer to it as the “Shroud” and not as the “Holy Shroud”, others who are not 100% certain that the relic is genuine and give talks about it in churches. For some more, Cardinal Giovanni Saldarini  referred to it as an “icon”, his predecessor Cardinal Anastásio Ballestrero was photographed leaning over it, Prof.Carlos Chagas who was the president of the Pontifical Academy of Sciences during the 1988 CD test did not believe it was genuine. No wonder one review of “The Sign” said that the author was more convinced about the authenticity than the Pope. \nLast but not the least, scholars who believe that Jesus got out of the Shroud alive get more attention than they deserve, a non-Christian, who seems to be furthering the interests of his own sect, is the one who helps decide what should appear on the Shroud book list. In these circumstances, who has the right to demand that the Church conduct further tests? Is this the way to convince Professor Christopher Ramsey to kindly continue to keep the doors of his laboratory open?\nGiven what has been stated above, with no personal attacks or insults, it is clear that the correct procedure would have been to let Davor Aslanovski state what he wanted without being provoked and attacked. He has clearly said that he is sceptical about the Shroud’s authenticity,  but he is also open-minded and may have a lot to offer.\n\n","date":"October 8, 2012 at 6:57 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17343","author":"Louis","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"Dear Mr Belz,\nI hope it brings you some consolation that, though I will continue to ignore you here, such will by no means be the case on my blog. Quite to the contrary, you will find that I have already written a few things that address you directly.\n\n","date":"October 10, 2012 at 10:53 am","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17417","author":"Davor Aslanovski","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"I note Dr Aslanovski’s sustained and prolonged attack against my personal character on his blog.  Sadly that is the freedom of the Internet.  I certainly do not recall accusing him of a phallic complex, unless it was within the context of a response of something he may have written which might have warranted it.  It does not seem to be my style.  Perhaps it is a Freudian slip on his part.  I certainly do not intend to give him the satisfaction of exposing myself to further calumnies from him on his blog site for the mere titillation of the few readers who may visit it. \nTo the point:  He demonstrates no understanding of any persuasive scientific work on the Shroud relic whatsoever.  He can only interpret the Shroud in terms of a cult.  His reductionist approach, evident in his comments on such cultic matters, even demonstrates a failure to understand phenomenology in the matter of Religious Studies.  It is clear that he has no room in whatever he believes for the Shroud’s possible authenticity.  For if he supposed at all that it MIGHT be the authentic burial cloth of Jesus Christ, he would know that, given his scholarly abilities as demonstrated by his grand announcements, he would have a moral duty to look into the matter much further than he has.  However he has done his homework by looking into the historical record only, and come up with exactly nothing.  This is suffcient for him to dismiss it.  No evidence before the 14th century;  Ergo it didn’t exist before the 14th century.  What arrogance!!\nI am afraid that this puts the kibosh on Louis’ hoped for reconciliation and expectation that we might see something useful from Dr Aslanovski in the way of a clue to its provenance.  Sorry Louis; Dr Aslanovski has given his decision. It didn’t exist before the 14th century!\n\n","date":"October 11, 2012 at 7:10 am","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17468","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"Well stated again Dave, and I second your descriptive statements to Dr Asslanoviki’s character.\nR\n\n","date":"October 11, 2012 at 1:08 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17501","author":"Ron","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"A footnote: Most of us elderly folk have achieved sufficient from a life’s labour, for a well-earned rest.  Some of us spend what little remains to us thinking up stupid things to say for our own amusement, or indulge in other mischief, while yet others of us use this time for more constructive purposes.  The portrait decorating Dr Aslanovski’s web-site suggests he is of more youthful years, and that he ought to be more preoccupied in the business of earning a living and making his own useful contribution instead of indulging in long rambling grandiloquent verbiage.  It shows a lean and hungry look, and there is an ancient rumour that such are dangerous. \nI have achieved enough already to have the confidence of considering myself an interesting character, but hardly enough to warrant a neurotic or psychotic obsession, as evidenced by Dr Aslanovski”s undue preoccupation with my character on his web-site.\n\n","date":"October 11, 2012 at 4:25 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17518","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Davor Aslanovski: Sindonology a Heresy","post":"It is very difficult to be a Christian, and that, perhaps, is what led Nietzsche to say, “The last Christian died on the cross.” That was no doubt an exaggeration he needed to justify the direction he was taking. One can not lose hope, even in this realm of Shroud studies, where it is not fresh news that there was some talk about who among the “Shroudies” was Christian. All of us who use the label “Christian” need to think about it from time to time. It takes us to the “mustard seed” in that parable of Jesus….\n\n","date":"October 11, 2012 at 9:54 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","id":"comment-17524","author":"Louis","site":"shroudstory"}]
