[{"title":"Did the Apostles Notice an Image on the Cloth?","post":"Just a thought I had this evening….Why would someone faking Jesus’s Shroud actually want to create a body image on it as we see on the SOT? After all, there is nothing in the Bible that says a burial cloth of Jesus was left behind with his image on it, nor anything in the bible that suggests Jesus resurrected as a radiant being that might have left a scorch on a cloth. Of course one could imagine such a scenario, and maybe that’s what a Shroud faker might have done…but art showing Christ as a radiant figure exuding light / energy does not appear until at least the 17th century\nSurely a cloth of ancient origin (1st century Palestine) – or at least made according to the techniques of this time in history – with bloody stains would have been the best case for a fake? eg. something like the Sudarium of Ovieto?\nThe traditions of the Mandylion etc speak of Cloths with a facial image either divinely transferred, or transferred via a sweat stain etc. There is simply no tradition, beyond the Shroud, of Christ’s full body having left an image – of whatever origin – on a cloth.\nSo, following this line of thought, the SOT as a faked relic doesn’t really make any sense, nor does it seem consistent with any tradition or history\n\n","date":"December 23, 2013 at 8:04 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-65540","author":"Matthias","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"I was in the middle of a lengthy comment on this when my computer decided to take me to another screen. My draft was lost. So a short one.\nThere is no simple answer to these  questions which have been asked and debated before. Go look it up. I might suggest going to shroud .com  as a starter. https:\\\\shroud.com\n It has a great search function on its home page. There is simply no simple answer to your questions although I expect you will get “trust me I know it all” from some of the bloggers.\n\n","date":"December 23, 2013 at 8:16 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-65548","author":"John Klotz","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"Very interesting speculative question.  In John’s gospel, it reflects that John saw and believed.  What did he see?  A cloth with an image or a tied cloth without a body?\n\n","date":"December 23, 2013 at 9:07 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-65593","author":"Andy Weiss","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"Matthias, your comment is very pertinent and something I have often wondered about. There are a number of possible answers. So, for a moment, just suppose….\n1) Shrouds are not long and thin. They are roughly the length of a body, and about three times as wide, for ease of wrapping. So why forge a long thin one?\na) It was cut from a bolt of old cloth, and easier to keep in one piece than cut and resew.\nb) It was specifically designed to fit a space (behind an altar, say) which was about 4m long.\n2) Most relics are so obviously fake that it seems unnecessary to create such a ‘realistic’ looking one. Why bother?\na) It was a question of ‘my shroud has to be better than your shroud,’ and there were plenty of unmarked shrouds already in existence by the 13th century.\nb) The turn of the 13th/14th century was quite late in the relic craze era, and new ones had to be increasingly realistic to avoid the scrutiny of the Lateran Council.\nc) The Shroud was originally as obviously fake as any other, but the painting has deteriorated so badly that only a stain produced by its medium remains.\n3) The Shroud is unique in all art (apart from art derived directly from it) in showing two images of Christ simultaneously. Why did the forger do that?\na) If the dimensions of the cloth were already determined, then one image would be rather small for the cloth. If it lay in in the middle, it would beg the question “where exaclty was Jesus lying?” and if to one side it would look dreadfully unbalanced. If you decided on two, then a front and a back seem the logical design.\n4) If I were laying someone out on a long thin shroud, I would keep the spare roll at the feet end, so that it could be peeled back for a last look at the face before leaving the tomb. Why are the shroud figures head-to-head?\na) Because the two heads of Christ would then form the centrepiece, immediately above and behind the tabernacle, and not the two feet ends, which seems a little disrespectful.\nDoes the concept of a fake make any more sense now? As usual, I can’t say that any of the above is true (or even probable), and nor do I want to, but can anybody claim that it is unreasonable?\n\n","date":"December 23, 2013 at 9:27 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-65611","author":"Hugh Farey","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"Hugh, interesting thoughts.\nSome thoughts in reply:\nPoint 1:\nIf one accepts the basis of your point 2 that a relic maker was trying to outdo others, why create a relic that is so obviously not typical of a shroud? Sub point (a) seems far fetched on the basis that such a determined relic maker would surely try better with the cloth given all the other efforts, sub point (b) is an interesting proposition….How long typically were altar tables? If one was 2 metres long and say 1 m high, then the 4m shroud would cover the table, and then fall down over each end of the table to the floor. If the frontal and dorsal heads were central on the altar table, then the space between the head images might have been where the bread and wine was placed….and then there would be a symbolic connection between the body and blood of Christ as seen on the Shroud, and the bread and wine….this is totally speculative but worth a shot! \nPoint 2\nI’ve always been a little bit unconvinced by the authenticist’s argument of “why go to so much effort to fake a relic when much more unconvincing fake relics were being flogged and traded”.\nLike any market, I’m sure more convincing fake relics could attract higher prices.\nSo your subpoints a and b are good ones, although I think ultimately fall down for several reasons being the usual concerns around “how”.\nRe: your subpoint b, that’s an idea I’ve though of, but I’m just not convinced by it for several reasons, most particularly the ultra realistic body image of the dorsal (I’m convinced that no painter of that era would have depicted the body in that fashion – de Wesselow argues convincingly to that effect)\nAnother thought…with the un-shroud like dimensions of the SOT, can one contemplate Joseph of Arimathea desperately seeking SOME form of linen cloth to wrap Jesus, and being unable to obtain a typical shroud, making do with a cut from a merchant that would suffice?    .\n\n","date":"December 25, 2013 at 7:54 pm","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-67821","author":"Matthias","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"It is probable that the way in which the burial cloth lay in the sepulchre convinced the disciples instantaneously that the body had not been stolen, it had left the cloth. Whether an image had contributed to the conviction is another story because the Gospel makes no mention. But we must also remember than any image would not be noticed there and then, being on the inner side of the cloth. Just the position of the cloth would be enough for the disciples, excited as they were.\n\n","date":"December 23, 2013 at 9:32 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-65612","author":"Louis","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"Baima Bollone reported the presence of myrrh (and aloe) on the Shroud using immunofluorescent techniques; STURP (Rogers), on the other hand, using chemical methods reported a negative finding.  In the BB studies, rabbits were immunized with myrrh extract.  The antisera generated in rabbits are polyclonal, the products of many different cells (clones), meaning that multiple specificities will be represented in the sera.  More modern immunological techniques have the advantage of utilizing monoclonal antibodies (products of a single clone), where the specificity is more defined.  This on its own is not really a concern, but together with the fact that an extract was used for immunization (as opposed to a purified protein), it does urge some caution regarding exactly what the reactivity consists of.  I would like to see the specificity more defined.  This particular antisera was not obtained commercially, where the specificity is often more detailed.  The anti-aloe, anti-myrrh results were compared against non-immune serum as a negative control (that’s good), but were not cross-checked against each other in experimental stains (that would have been good). So, in my own opinion, and that’s all it is, I would take it with a grain of salt-maybe, maybe not.  I would like to see more specificity defined here.\nAlso, I believe that others have mentioned that burial spices may have been placed around the body (in bags or jars?)-I am not sure if this is in addition to or instead of being smeared on the body/cloth. \nRegarding the kinetics of the image, that’s a very interesting question-I believe the disciples might have kept the cloth either way.\n\n","date":"December 23, 2013 at 9:32 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-65613","author":"Kelly Kearse","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"Some comments:\nMatthias: Surely a cloth of ancient origin (1st century Palestine) – or at least made according to the techniques of this time in history – with bloody stains would have been the best case for a fake\nNO!!! NO BLOODSTAINS!!! The whole Christian tradition, up to 20th century, maintained that the body of Jesus was washed before burial! The forger must have been a madman to create a false relic with not only image, but above all the bloodstains on the cloth.\nThere is simply no tradition, beyond the Shroud, of Christ’s full body having left an image – of whatever origin – on a cloth.\n“Ad monumentum Petrus cum Iohanne cucurrit recientaque in linteaminibus defuncti et resurgentis vestigia cernit.”\n“Peter ran to the tomb with John and saw the recent imprint of he who was dead\nand risen on the cloths” – the Old Mozarabic Liturgy, see http://www.shroud.com/pdfs/n71part14.pdf\nHugh:   It was a question of ‘my shroud has to be better than your shroud,’ and there were plenty of unmarked shrouds already in existence by the 13th century. \nHardly true. I have recently written a two-part article about the relics of the burial cloths venerated through the centuries around the world, see http://ok.apologetyka.info/ateizm/ile-byo-pocien-pogrzebowych-jezusa-cz1,749.htm and part two: http://ok.apologetyka.info/ateizm/ile-byo-pocien-pogrzebowych-jezusa-cz2,750.htm\nAt the end of part one there is a list of all alleged burial cloths:\n* The Shroud of Turin. Bloodstains and the double image, front and back, of a man. Some historians identify it with eithe Mandylion, or (less probable) with Arculfus Shroud.\n*The Shroud of Besançon. The image of alleged bloodstains, and only front of a man. Most probalby just a copy of the Shroud of Turin. Destroyed 1794 during the French Revolution\n*Sindon Munda from Kornelimünster and The Shroud from Compiègne (the latter destroyed between 1789 and 1840) –probably two halves of the same piece of cloth. No image of the bloodstains, and no reports about the image of a man. Possibly Arculfus Shroud, its copy or lining, or a copy or lining of the Shroud of Turin\n* Sudarium Domini from  Kornelimünster. No traces of blood or image. Theoretically it could be Arculfus Shroud. Possibly external shroud, or used to transfer the body from the cross.\n*The Shroud of Cadouin. Most probably fake, perhaps “found” during the 1st Crusade in Antioch to boost the morale of the crusaders.\n* A linen shroud from Constantinople (distinct from the Shroud of  Turin). Some pieces sent to Louis IX. Another candidate for Arculfus Shroud.\n*Arculfus Shroud. The greatest unknown -it could have been any shroud mentioned above.\n*Sudarium of Oviedo. Bloodstains.\n* The Coif of Cahors. Wrapped around the head, binding the jaw. Bloodstains, no information about image.\n*The cotton sudarium from Constantinople, some fragments in Halberstadt.\n* Sudarium Capitis from Carcassonne. No traces of blood and image. Allegations that it was cut from The Shroud of Cadouin, or perhaps from some another cloth.\n* The Manoppello Veil, according to some recent hypotheses laid on the Shroud of Turin. Image, no bloodstains.\n* Several fragments of the cloths mentioned above, dispersed among several dozen churches around the Europe.\n\n","date":"December 23, 2013 at 9:58 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-65628","author":"O.K.","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"OK, that piece by Guscin on the Old Mozarabic Liturgy is fascinating, thank you. I’d never come across it\nWhen was it written, and where was it published?\nMerry Christmas!\n\n","date":"December 23, 2013 at 11:13 pm","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-66154","author":"Matthias","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"A Reader:\nI don’t know if anyone has addressed the issue of the large amount of ointment which Nicodemus procured along the tomb, presumably along with the cloth itself, which is somewhat fancy as a burial cloth. \nKelly: Also, I believe that others have mentioned that burial spices may have been placed around the body (in bags or jars?)-I am not sure if this is in addition to or instead of being smeared on the body/cloth. \nThe excavations performed in the 70s in the jewish catacombs at Via Nomentana in Rome, suggest that only small amount (perhaps 0.5 kg) of circa 30 kg of myrrh and aloe were used to anoint the body. The rest was used to smear the walls and the surface of the tomb. The burial niches were full with the remnants of the spices. \nAnd also for Kelly, Baima-Bollone published several microscopic picture were microdrops of some oily substances are clearly visible.\n\n","date":"December 23, 2013 at 10:16 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-65643","author":"O.K.","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"OK, what a terrific article! It will take me a while to work through it, but it seems masterly. It does seem to confirm that other shrouds were around though.\n\n","date":"December 23, 2013 at 11:30 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-65692","author":"Hugh Farey","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"It is highly unlikely that the apostles or any other saved the shroud.\nIn Jewish tradition the corpse was unclean and everyone who touched it had to undergo a stringent purification.\nThe early Christians, for their part, were very critical of the sacred images. I know any image of Christ as a person until the third or fourth century. Even the cross became the symbolic staurogramm. \nThe interest of the early Christians by the relics was zero. They had a highly spiritualized sense of their faith and needed any material proof. And I point to anyone. “Blessed are those who have not seen and yet have believed”, you know. We have to wait to fourth century when Saint Helen became relics fashionable.\nIt seems unthinkable that if the apostles or any other Christian who had access to the tomb had kept the cloth with a miraculous image or without it, he had not made it public and the great event would not have been collected in the Gospels as another miracle.\n\n","date":"December 24, 2013 at 4:40 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-66357","author":"David Mo","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"Unless the body was not there.  What could be considered unclean if there was no dead body?\n\n","date":"December 25, 2013 at 1:57 pm","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-67603","author":"Andy Weiss","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"David Mo: “It is highly unlikely that the apostles or any other saved the shroud.”\nThe arguments mentioned by DM have been extensively discussed in any number of papers, many of which appear on the shroud.com site, and present an entirely different perspective. \nFor starters, I suggest a reading of “LAZARUS & JESUS” by Albert Dreisbach, presented at the Atlanta conference 2005. It can be found at:\nhttp://shroudstory.files.wordpress.com/2012/03/dallasdreisbach.pdf\nOther writers including Jack Markwardt believe the Shroud was first taken to Antioch by the Apostles, most likely St Peter. There are various highly suggestive references to linen cloths, both in the Acts of the Apostles, and also in Revelations. \nShrouds are supposed to contain bodies, but there was no corpse to be found. Yet it evidently contained life blood, which ought to buried together with the body. Did they think the body might be found, and so save it? Or was the image a factor in the decision? There’s no direct mention of it, as it had to remain secret. \nwhat about the water marks, along one edge indicating that it was folded loosely concertina fashion and stored in an earthen jar similar to the storage of the Dead Se scrolls. There are no pat answers, and dogmatism in our state of ignorance is bound to lead us astray. Nothing is self-evident! \nChange of topic: Nicodemus brought 100lbs of herbs and spices for the burial, 45kg. I don’t believe that all of it was spread around the walls of the tombs and implied above. What if the herbs and spices were packed in bags alongside the body? Would that have been a factor in producing the image? Is that the reason why there is no side view of the body, because the sides were masked by the spice bags? Or is there some other reason, why the image appears to be orthogonal, that is some kind of vertical emanation from either the earth or the body? Why vertical, instead of body-normal?\n\n","date":"December 24, 2013 at 6:46 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-66433","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"Dave,\nThere comes a time when all good (and bad) scientists and philosophers  seemed  compelled to cite Okkam’s (Occam’s) razor: The simplest solution is probably the correct one. I have a radical application to the mystery of the image that is in keeping with all the evidence except pseudo-skeptics dominated by  a world view that excludes my simplest explanation will probably start chewing the rug: My solution depends on a mysterious processes. No, not the Resurrection, but quantum mechanics.\nThe simplest solution is the Resurrection.\n\n","date":"December 24, 2013 at 7:52 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-66477","author":"John Klotz","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"I have a mouthful of rug already… delicious!\n\n","date":"December 24, 2013 at 8:31 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-66500","author":"Hugh Farey","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"Hugh,\nTry it with the Grey Coupon, although frankly, stateside, I prefer Gulden’s Yellow.\n\n","date":"December 24, 2013 at 9:06 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-66529","author":"John Klotz","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"Reference in Acts to (linen?) cloth and uncleanness: Check Acts 10:9:18. A mystic might read rather more into the extract than appears on the surface. The extract is embedded into the story of the conversion of the Roman centurion Cornelius. \nPeter is hungry, has a vision of a large sheet descending from heaven containing all sorts of animals and reptiles, and a voice tells him to slaughter and eat. Peter objects saying he has never eaten anything unclean. He is instructed: “What God has made clean, you are not to call profane.” It happens three times – emphasis! \nThere is a turning point here. We have the image of a sheet which is unclean. Might there be a subtle secret reference here to the burial cloth, if that was preying on Peter’s mind, what to do with this unclean cloth, perhaps already showing its image, which Christ has now made clean? He is told to take and eat, a eucharistic prayer? Fanciful, or a secret subtle message? \nIt is now Christmas morning in NZ, I pass a milestone, today turning 75 years, 3/4 of a century already. It doesn’t seem that long. My son and grandson from Australia are still asleep. Last night we took them to the Family Christmas Vigil Service at our local parish church, absolutely packed, including a children’s pageant with shepherds and angels everywhere, with a 12 week old baby as the infant Jesus. Great music group, lots of carols; The priest told them a charming little story about a shepherd boy, and finished by playing a little tune on a flageolet, I’ve never seen him do that before. A family occasion. We’ll pick up the rest of the family later this morning, and have a NZ Christmas meal, cold ham, chicken and salads, exchange gifts, try out the new TV I purchased only last night. \nMerry Christmas to all. May you be showered with blessings in 2014.\n\n","date":"December 24, 2013 at 3:14 pm","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-66805","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"Merry Christmas and Happy Birthday To you, Dave. Merry Christmas to all other people reading this blog.\n\n","date":"December 24, 2013 at 4:32 pm","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-66855","author":"O.K.","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"Merry Christmas, OK and all.\n\n","date":"December 25, 2013 at 1:59 pm","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-67606","author":"Andy Weiss","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"\nJohn Klotz :\nDave,\nThere comes a time when all good (and bad) scientists and philosophers  seemed  compelled to cite Okkam’s (Occam’s) razor: The simplest solution is probably the correct one. I have a radical application to the mystery of the image that is in keeping with all the evidence except pseudo-skeptics dominated by  a world view that excludes my simplest explanation will probably start chewing the rug: My solution depends on a mysterious processes. No, not the Resurrection, but quantum mechanics.\nThe simplest solution is the Resurrection.\n\nI’m afraid you have misunderstood Ockham’s razor. You can also say it another way: ” Entia multiplicanda non sunt sine necessitate ” . This means that given two explanations you must choose which requires fewer assumptions. In the case of the Shroud of Turin two explanations are possible: a) Result of a miracle b ) Result of a decomposition of the original image or similar. From an empiricist or scientific point of view -that was the Ockham’s perspective-, the alternative b ) is the simplest , because a) oblige us to introduce a lot of assumptions unproven (and not demonstrable ) concerning unknown energies , bodies that dematerialize and the like. The b ) simply admit a very simple thing: we do not know exactly how it was done . And this is something very common in science.\nThis mistake is widespread. You seem to be unaware that Ockham formulated his principle to rid science of metaphysical principles and allow free passage to faith. It’s an interesting point of view. It is certainly more consistent than those that mix science and faith in the same jam.\n\n","date":"December 25, 2013 at 4:32 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-67214","author":"David Mo","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"\nHugh Farey :\nI have a mouthful of rug already… delicious!\n\n“Have a mouthful of rug”? Sorry, but this is expression is not in my dictionary. May I know what means? Thank you.\n\n","date":"December 25, 2013 at 5:18 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-67238","author":"David Mo","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"“T\n\nDavid Mo :\n\nHugh Farey :\nI have a mouthful of rug already… delicious!\n\n(…) but this is expression is not in my dictionary.(…)\n\n…this expression is not…\nSorry.\n\n","date":"December 25, 2013 at 5:24 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-67244","author":"David Mo","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"“Ockham’s razor” is so named, only because William of Ockham used it so frequently, and employed it so sharply. The principle was, in fact, invoked before Ockham by Durand de Saint-Pourçain, a French Dominican theologian and philosopher of dubious orthodoxy, who used it to explain that abstraction is the apprehension of some real entity, such as an Aristotelian cognitive species, an active intellect, or a disposition, all of which he spurned as unnecessary. Durandus is primarily known for his opposition to the ideas of St Thomas Aquinas. \nDurandus’ attack on the teachings of Aquinas came at a time when Aquinas already was accepted as the official theological doctor of the Dominican order. Durandus taught that a philosopher should prefer the conclusions of his own reason to any authority except in articles of faith; the acceptance of truths of faith, on the other hand, did not depend on reason at all. This separation of reason and faith undermined the position of Scholastic philosophy generally, because much of it represented an attempt to bolster articles of faith by speculative reasoning.\nHowever as recently as Pope Benedict’s visit to the UK for the canonisation of John Henry Newman, he made it clear that both “Faith and Reason” were necessary, and condemned Faith without Reason as leading to fanaticism. What price Okham’s razor now?  [Source for Durandus’ ideas – Encyc Brit article]  \nIn science, Nicole d’Oresme, a 14th-century French physicist, invoked the law of economy, as did Galileo later, in defending the simplest hypothesis of the heavens. Other later scientists stated similar simplifying laws and principles.  However in his search for simplicity, Galileo refused to accept Kepler’s discovery that the planets and other celestial bodies actually moved in ellipses rather than circles, his preferred Platonic and Ptolemaic idealistic approach which Galileo wished to retain. Newton’s discovery of the inverse square law of gravitation, following on from Kepler’s work, confirmed that the centripetal gravitation caused by large bodies, resulted in orbits of the various conic sections.  Enough said, to demonstrate that Okham’s razor has limited utility and provides no infallible path to the truth!\n\n","date":"December 25, 2013 at 5:39 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-67252","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"Dave,\nYou are among the most, if not the most, articulate and knowledgeable contributors to this blog. Reading your posts is not just an education, it’s edifying.\nMerry Christmas.\n\n","date":"December 25, 2013 at 8:23 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-67350","author":"John Klotz","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"Thanks Dave.  In my little reading about William of Ockham, he was on the verge of dubious orthodoxy as well.\n\n","date":"December 25, 2013 at 2:03 pm","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-67608","author":"Andy Weiss","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"When I shared with another writer whose work on the shroud is legendary, he replied that when I began my E-Mail with “Dear XXX, I am a lawyer,” his first thought was, “Oh no, not another lawyer.” Then after he read the enclosure, he changed his attitude and has since said  some very nice things. That was two years and  a lot of research ago. The six month time frame I gave my self is now going to be two years + but maybe Ash Wednesday and certainly by Holy Week 2014.\nI introduce this comment with that story, because horrors of horrors, I am now going to say something as a lawyer. The most complex thing of all is fraud. “Oh what tangled webs we weave, when first we practice to deceive.” By the way, I just this instant learned something. I would have though that line was from Bobby Burns, but it was from Sir Walter Scott. (he was Scottish too)\nDuring my career, I instigated  or was  principal instigator of several investigations for fraud. Two of them standout, one was an international financier who stole more than a billion dollars during the course of his career. I once said to his lawyer, that my client would settle its claims for two million dollars. He said “It’s hard to talk two million dollars with you when you are the one who put my client out business.” He hesitated and then continued on with obvious anger , “There is no question about it: Miami, Atlantic City, you are the one who put him out of business.” My response was unspoken: “From you lips to God’s ear.” I say that not to simply blow my horn but to indicate when I say that fraud, and the proof thereof, is a complex thing, I write from some experience.\nIncidentally, a former FBI agent who has been in the international news this week once told me over breakfast in Miami. “It’s pleasure to help you. I know who you are what you have meant to the Bronx.\nIn his memoir of the Shroud, John Heller who was advised by Einstein when he was an undergraduate at Yale introduced me to the “gededenkenexperiment.” (thought experiment). That means to think through a proposition taking into all the knowns and applying science to them. The great ting about the gededenkenexperiment, Einstein told his young student, “it doesn’t require much of a budget.”\nHeller and Adler conducted a gededenkenexperiment on forging the Shroud, they ended up painting with a 12 foot or so paint brush looking through a telescope as they painted with a brush whose hair was a hundredth or so finer than any ever manufactured.\nWhen you say the Resurrection is the most complex of all explanations you are betraying not a scientific fact but an existing bias. Marcello Truzzi who was one of the founders of Center for Skeptical Inquiry quit after a couple of years because he discovered that most of his colleagues were not interested in the dispassionate search for truth but only to validate pre-existing assumptions such as  there is no God and no miracles.\nMy point is simple. If you eliminate the possibility of the Resurrection, you are going to come-up with proposed solutions which are all false and really, more complex than the Resurrection. The Shroud is the artifact of the transformation of Christ’s body into another form. We have yet to ken the process. My belief is that it is a whole lot simpler than forgery or inventing photography four centuries ahead of time or using a crucifix to produce a bas relief. \nThis comment is a little longer than it probably should be. I really appreciate the chance of using the blog as a sounding board before a critical audience. \nBut his morning I arose to wrap the last few presents. We celebrate the birth of Christ whose birth transfigured human nature. But as we contemplate that transformation we must recall, the horrible death that awaited him 33 years in the future. Isabel Pizcek has called the Shroud an “event horizon.” I happen to agree, as I shall explain. Hopefully before Easter.\nMy favorite Christmas carol has a line that I think sums up the joy of the day to me and I think everyone whether they realize or not:\n“Long lay the world, in sin and error pining,\ntill he appeared and the soul felt its worth.”\nMerry Christmas\n\n","date":"December 25, 2013 at 8:15 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-67345","author":"John Klotz","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"Hi David!\nIts bibilical equivalent would be “rending ones garments.” It refers to a state of such frustrated rage than one is reduced to foaming at the mouth, thrashing about on the floor and biting whatever covers it. Mr Kotz anticipates (probably correctly) that quasi-scientific literary constructions involving quantum mechanics (also biophotons, energetics, holograms and magnetism) can reduce real scientists to jibbering incoherence. To avoid losing my chakra completely, I have started on my carpet already…\n\n","date":"December 25, 2013 at 2:59 pm","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-67636","author":"Hugh Farey","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"John, Kenotic Christology tells us that Christ emptied himself of his divine attributes in order to become a human being. It would be something like this, at least in my view: The Virgin Birth was the divine action for him to enter our “wavelength” and the Resurrection for him to leave it. There were some signs of his divinity in between, but no prerogatives were used. The prerogatives in the beginning (birth) and departure(Resurrection) were “triggered from above”, not by him, and I guess you will understand that.\nThe NT passages that help in a way to grasp this are:\nJohn 1: 1-18\nPhilippians 2: 5-9\nThe Jerusalem-based Irish Dominican biblical scholar Father Jerome Murphy-O’Connor, who died recently, felt that to interpret Philippians literally would imply indulging in docetism and James Dunn gave a more allegorical interpretation, both of which are not convincing.\n\n","date":"December 25, 2013 at 4:58 pm","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-67732","author":"Louis","site":"shroudstory"},{"title":"Did the Apostles Notice an Image on the Cloth?","post":"Daveb:\nThank you for your philosophical lesson. Ockham’s razor is a useful indicator only when the evidence (or lack of) of two alternative hypotheses is comparable. Generally it is used to work on more elegant assumptions and simplifying too baroque hypothesis including no tested suppositions. But if we come to it you have to face the consequences, which in that case are not those proposed by John Klotz.\nHugh Farey:\nThank you also for your English lesson. But Ockham’s razor is different of the coherence criterion.\nRegarding the principle of coherence/consistency, quantum physics doesn’t invalidate it. This is an inaccurate and too repeated inference. Quantum physics only invalidates a particular translation of the CP to facts. I.e. the classic physics translation of CP to subatomic particles.  CP maintains all his classical validity in the phenomenal world. Here a radiation cannot be a camel. And a shroud is not a handkerchief. This is what is important to make clear here. Because if someone decides not to follow the principle of consistency in their statements I go elsewhere. \nHave I congratulated you on your new position at the head of the BSTS Newsletter? If not, good luck and much success!\n\n","date":"December 26, 2013 at 4:23 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","id":"comment-68095","author":"David Mo","site":"shroudstory"}]
