[{"title":"What did Wilson and/or Flury-Lemberg actually observe about stitching?","post":"The three references to Mme Flury-Lemburg’s reports cited in Ian Wilson’s Bibliography [‘The Shroud’, Bantam Press, 2010] are: \n– Flury-Lemburg, Methchild, ‘The Linen Cloth of the Turin Shroud: Some Observations of its Technical Aspects’, in “Sindon”, new series, no. 16, December 2001, pp.55-76\n[Author] “Sindone” 2002, ‘L’Intervento Conservativo, Preservation, Konservierung, ‘ Turin, Editrice ODPE, 2003\n[Author] ‘The Invisible Mending of the Shroud in Theory and Reality’, in “Shroud Newsletter”, 65, British Society for the Turin Shroud, June 2007, pp.10-27.  \nAny other informed comments?\n\n","date":"July 25, 2013 at 4:28 pm","url":"https://shroudstory.com/2013/07/25/what-did-wilson-andor-flury-lemberg-actually-observe-about-stitching/","cat":"history","id":"comment-39734","author":"daveb of wellington nz","site":"shroudstory"},{"title":"What did Wilson and/or Flury-Lemberg actually observe about stitching?","post":"Wilson’s Chapter VI ‘The Cloth’s Own Tale’, Fig 8 is a diagram of a ‘Very Rare Type of Invisible Seam’ found on cloth fragment from Masada excavation, which Wilson says Mme F-L asserts was exactly the type of seam used to join the segments of the Shroud.\n\n","date":"July 25, 2013 at 4:35 pm","url":"https://shroudstory.com/2013/07/25/what-did-wilson-andor-flury-lemberg-actually-observe-about-stitching/","cat":"history","id":"comment-39735","author":"daveb of wellington nz","site":"shroudstory"},{"title":"What did Wilson and/or Flury-Lemberg actually observe about stitching?","post":"It seems that M. Flury-Lemberg is quoting Aviram J., Foester G., Netzer E. eds. (1994), “Masada IV. Final Reports”, Jerusalem: Israel Exploration Society.. It also seems that Flury-Lemberg makes some mistakes. Cf. Antonio Lombatti: “La Sindone e il giudaismo al tempo di Gesù”, Scienza e Paranormale numero 81, settembre/ottobre 2008, on line (in Italian):\nhttp://www.cicap.org/new/stampa.php?id=273770# . Lombatti claims that in Masada there aren’t any funeral cloth and least of all 3:1 herringbone linen. (“Section two (pp. 152-282; A. Sheffer and H. Granger-Taylor; with V. C. Koren and O. Shamir) covers textiles, dyes, and loom weights/looms. The unusual corpus of textiles preserved in Masada’s dry climate includes fragments of both men’s and women’s tunics, mantles, and cloaks; hair-nets; coverlets; linen towels; and goat-hair sacks”, -from the abstract of “Masada IV. Final Reports”). Diana Fulbright (Fulbright, Diana (2010): “Akeldama Repudiation of Turin Shroud omits evidence from Judean Desert”. ENEA, Frascati, http://www.acheiropoietos.info/proceedings/FulbrightAkeldamaWeb.pdf ), discussing about the Turin Shroud, also refers to Masada. I don’t know why.\n\n","date":"July 26, 2013 at 3:04 am","url":"https://shroudstory.com/2013/07/25/what-did-wilson-andor-flury-lemberg-actually-observe-about-stitching/","cat":"history","id":"comment-39757","author":"David Mo","site":"shroudstory"},{"title":"What did Wilson and/or Flury-Lemberg actually observe about stitching?","post":"David Mo: I think there is some confusion. I am not aware that M Flury-Lemburg has ever asserted that there were any funeral cloths like the TS at Masada. The extract I’ve mentioned in Ian Wilson’s text is confined solely to the type of stitching in the invisible weave between a side strip and the main cloth when the cloth was originally made up. The apparent purpose would seem to be to create the impression that the cloth was an entire weave by providing selvedges on both the outer edges. It was only revealed when the backing cloth of the TS was removed under the direction of Mme F-L. Her comment was that in her 40 years of working with ancient textiles, she had only come across this particular stitching from cloths recovered from Masada. There is no mention there of what purpose such Masada cloths were intended. One might well suppose that if a tailor was expert in the method, he might apply it to all sorts of purposes where invisible weaving was desired. \nI am well aware of Diana Fulbright’s paper on other Akeldama Judean cloths, and there is previous recent comment on her paper on this site, some of it for whatever reason adverse, and even hostile. I suspect it may have been because a correspondent disliked her findings, or because of professional jealousy, accusing her of being no expert in such matters, an ad hom argument rather than ad rem. As I recall, the intention of the Fulbright paper was to demonstrate that 1st century weavers, Judean and others, were quite capable of intricate, elaborate  and complex weaves, including the 3:1 herring bone twill such as on the TS. Plain weaves for burial cloth purposes, only became fashionable for the well-to-do in the 2nd century when Gamaliel II set such an example, to discourage a previous extravagance in funerary attire, which up till then seems to have been a fairly normal type of practice.\n\n","date":"July 26, 2013 at 5:06 am","url":"https://shroudstory.com/2013/07/25/what-did-wilson-andor-flury-lemberg-actually-observe-about-stitching/","cat":"history","id":"comment-39764","author":"daveb of wellington nz","site":"shroudstory"},{"title":"What did Wilson and/or Flury-Lemberg actually observe about stitching?","post":"i do think, however, that Fulbright needed to make it clearer which of her examples were wool and which linen or silk. Masada is almost entirely wool. The excavators report suggest that this was because flax was not grown in Judaea in the first century, but rather in Galilee and wool would have been the normal local fabric for clothes which the majority of the Masada textiles were. Later,the second century AD onwards,  apparently because the Romans provided better irrigation, Palestine became well known for its fine flax.\n I think it is wrong to get woollen clothes and linen cloths, including those made for burials, mixed up as if the weaving of one could be compared to the weaving of another. As the insistence on fine linen for the priests shows, different fabrics were used in different  contexts and different styles and patterns followed. As I remember it the Masada stitching was largely for repairs of worn clothing so I was surprised to hear that it was something special -one reason for my original question. Yet as much of the Masada textile collection has never been published, F-L may have seen something that was not reported in the excavation report from a private inspection.\n\n","date":"July 26, 2013 at 6:06 am","url":"https://shroudstory.com/2013/07/25/what-did-wilson-andor-flury-lemberg-actually-observe-about-stitching/","cat":"history","id":"comment-39769","author":"Charles Freeman","site":"shroudstory"},{"title":"What did Wilson and/or Flury-Lemberg actually observe about stitching?","post":"CF: “I do think, however, that Fulbright needed to make it clearer which of her examples were wool and which linen or silk.”\nCharles, I really cannot see that the criticism is valid. Dare I say it looks a little like carping. I have just reread the paper, and Fulbright identifies the majority of the various fabrics she mentions, linen, cotton, wool, leather, goat hair etc. The various materials in most of the graphics is identified. The thrust of her argument seems to me to be twofold: 1) Against the popular press argument that the TS was proved to be non-authentic by the single sample Akeldama discovery of a plain weave shroud present in the tomb of a leprous and tubercular family, which had been sealed, presumably to prevent public infection; 2) Against the argument that elaborate weaves were beyond the competence of 1st century weavers when there were any number of counter-examples, not only from the 1st century, but was widely and extensively prevalent for several centuries beforehand. \nI feel it is a little like archaeologists from a future age having discovered a single pine coffin from the 20th or 21st century asserting that oak, walnut, or cardboard coffins cannot possibly be from our present era. \nFulbright’s paper can be found at:\nhttp://www.acheiropoietos.info/proceedings/FulbrightAkeldamaWeb.pdf\nUnfortunately for purposes of general discussion, the PDF is ‘secured’ so that extracts cannot be copied, nor I suspect even printed, without resorting to some tricky electronic deviousness.\n\n","date":"July 26, 2013 at 7:37 am","url":"https://shroudstory.com/2013/07/25/what-did-wilson-andor-flury-lemberg-actually-observe-about-stitching/","cat":"history","id":"comment-39776","author":"daveb of wellington nz","site":"shroudstory"},{"title":"What did Wilson and/or Flury-Lemberg actually observe about stitching?","post":"Fulbright provides very few examples and those that she does come from very different time periods, fabrics and places that had very different cultural traditions. It is very difficult to generalise from them. You must not assume that there was something called ancient weaving that was similar throughout  the Mediterranean over two thousand years.\n No one doubts that ancient weaving could be highly sophisticated- look at the Rameses girdle of 1200 BC in Liverpool Museum- it has been almost impossible to recreate the weave today even with programming the weave into a computer. Again look at the third and fourth century AD damask silks, of which only a few fragments survive. They needed up to twenty heddle rods on the loom to achieve them. The Shroud is way way below this sophistication, of course. But what Fulbright does not show is that there is a single example of a linen herringbone 3/1 weave known. This does not mean that they did not exist because so little survives (outside Egyptian sources) that we cannot be sure but if the Shroud is first century it is the only one with this combination of linen, herringbone, 3/1.\n  I take the point that the Akeldama ‘shroud’ as a textile does not help us either way and I would support Fulbright on this.\n\n","date":"July 26, 2013 at 1:31 pm","url":"https://shroudstory.com/2013/07/25/what-did-wilson-andor-flury-lemberg-actually-observe-about-stitching/","cat":"history","id":"comment-39790","author":"Charles Freeman","site":"shroudstory"},{"title":"What did Wilson and/or Flury-Lemberg actually observe about stitching?","post":"Wilson’s reference to “invisible (?) seam” is too vague for ulterior conclusions. If I’m not wrong Frau Flury-Lemberg has investigated anything about Masada textiles. Only a few references in her book about Turin Shroud, and haven’t always been correct. \nThe side band in the Shroud was well known before the restoration of 2002. If I don’t remember badly it wasreported by Raes and  STURP. Nobody has said it was “invisible” in any sense. The recourse to word “invisible” seems to me a verbal fetishism.\nFulbright has succeeded in rebutting some claims in the popular press that asserted that such a larger cloth as the Shroud was impossible before modern times. But nothing more.  And this is to use a sledgehammer to crack nuts. The examples she provide are well known by experts in Middle East history. No surprise. Some experts had said the Shroud fabric is not possible in the Palestine of the 1rst Century for different reasons. There is universal consensus between sindonists and no sindonists: to weave the herringbone of Turin Shroud a loom of four pedals is needed (Virginio Timossi, 1942 et al.). And the problem is that such a loom is known in Mediterranean area just after the 4th Century when it came from China. About this Fulbright says nothing.\n\n","date":"July 27, 2013 at 3:08 am","url":"https://shroudstory.com/2013/07/25/what-did-wilson-andor-flury-lemberg-actually-observe-about-stitching/","cat":"history","id":"comment-39829","author":"David Mo","site":"shroudstory"}]
