[{"title":"When is a Sindon Not a Sindon?","post":"It was just a few days ago now that Dan was complaining about the length of my postings and having to scroll to the end to find updates.\nNow he’s complaining about the new diary format (which allows me to keep the same generic title for each post, stressing sceptical approach, not specific content) in which new additions are added at the top (what Dan refers to as upside-down).\nWhat could be simpler than going to another site and looking to see what’s at the top, having to do little or no scrolling. Here is what the visitor sees first, a listing of the 6 topics covered in the current week (No.32):\n6th topic.  Spotlight on scientist Barrie.M.Schwortz\n5th topic: Whose book in the early 1980s might be said to have undermined the “tradition” of regarding the Shroud simply as an “imprint” formed on the linen used to receive a body from the cross, of manufacturing cherry jam?\n4th topic: an altogther different explanation for why the man on the Shroud has fingers but no thumbs. No pathology needed in the medieval modelling narrative.\n3rd topic: The mysterious Gematria. How does it work?\n2nd topic: Why does this blogger write “Shroud” instead of Shroud?\n1st topic: Why did obscure little Lirey  near Troyes, France, come to host the first undisputed appearance of the “Shroud” double-image in European history?\nGoogle rankings? I gave up fretting about those a long time ago. What matters in the final analysis is what folk will be saying in 5 or 10 years time.  For now, I’d rather be anonymously right than famously wrong. \nThe top priority is to identify and archive the media outpouring of “Shroud”-related cherry jam, past and present, that masquerades as science (real science that is).\n\n","date":"August 5, 2015 at 2:59 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207455","author":"Colin Berry","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"I do blog searches.  Many people do. This is how I look for new material. This morning I am told that the last thing you posted was August 3. Guess what, you get special treatment. You and Stephen Jones, the only other person I’ve ever seen posting this way, get special treatment. You wondered why I hadn’t covered something you wrote.  Guess why. Because sometimes you don’t get as much special treatment as you expect. Right now, it is a slow news summer.  Others, if they posted as you do would go unnoticed. Up to you. \nYes, it is easy enough to go awandering through your postings.  But for the most part I use tools from Google, Yahoo, Blog Search, News Crawler, etc.\n\n","date":"August 5, 2015 at 6:09 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207465","author":"Dan","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"“You wondered why I hadn’t covered something you wrote.”\nWithout knowing which posting or part thereof you are referring to, Dan, it’s hard to comment. I suspect it was less a complaint, more a statement, flagging up the fact that there was material on my site that a fellow commenter could not expect to know about, unless they had visited.\nSpeaking of which –  looking in on other folks’ sites – I’ve tended perhaps to assume that your site is a blog (of sorts) and that you have other blogs ”within the family circle’ bookmarked. You say that’s not the case, that you rely on search engines. Fair enough. It’s not my place to tell you how to run your site. By the same token, it’s for me to run mine, to find a style that I’m comfortable with, which may or may not be Google or shroudstory-friendly.  My chief beef is not pro- or anti-auhenticity. It is pseudoscience, sindonology being perceived as a major offender.\nPolite suggestion. Don’t bother with my site. Ignore it completely. However, I shan’t ignore yours. If I see a posting or comment that makes a good talking point, I will add a new entry to my daily log. If I consider it needs wider exposure, I’ll let you know by posting a comment to your site when a suitable opportunity arises, inserting a link to mine. Inevitably there will be some who will claim, as they have done previously, that I’m “using your site to promote my own”, to which the answer is: “that’s how the blogosphere works” and “that’s how one gets search engine visibility, through linking to other sites”. As stated previously, Google rankings don’t in fact bother me much these days, though I note my new-format  site is now showing under (Shroud of Turin) if one restricts the search to “last week” or earlier to “last 24 hours”, which bodes well for the future.\n\n","date":"August 5, 2015 at 3:08 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207500","author":"Colin Berry","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Diana Fulbright’s paper is masterly, and fairly convincingly demonstrates that the Greeks, at any rate, had no specific word which meant exclusively ‘cloth for wrapping dead bodies with,’ and that both sindon and othonia were fairly generic words for pieces of cloth, whose form and purpose were defined by their context. I am interested in her reference to Lazarus, who had no sindon or othonia, but was tied in keiria, which were definitely long and thin, like bandages (or tapeworms, suggest Liddell and Scott). Fulbright suggests Lazarus was trussed like an Egyptian mummy, which I should like someone to comment on – it does not seem to have been standard practice, judging from the few other burials we know about. Kim Dreisbach seems to think that the keiria were used to secure a sindon to the body, which leads to some interesting speculation about the contortions the risen Lazarus went through to free himself of his shroud without untying the keiria.\nIn an astonishing piece of synchronism, I was just reading Fulbright’s section on byssus when a chapter all about it was read on the radio. It came from ‘Spirals in Time: The Secret Life and Curious Afterlife of Seashells,’ by Helen Scales. She does not think that the word byssus referred specifically to sea-silk much before the 15th century. Nor, she finds, is sea-silk byssus particularly diaphanous, describing the numerous samples she handled as ‘fluffy’ and ‘woolly,’ and not at all silky. A glove looks ‘thick and itchy,’ and a lady’s purse is a ‘furry’ object ‘that looks rather like a Scotsman’s sporran.’ The fibres are very light, though, such that if you hold out your hand and close your eyes you can’t tell when a clump of threads is placed on your palm.\n\n","date":"August 5, 2015 at 5:20 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207463","author":"Hugh Farey","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"For essential information about sea-silk, you may see the website by Felicitas Maeder (Basel, Switzerland):\nhttp://www.muschelseide.ch/en/projekt.html\n\n","date":"August 5, 2015 at 6:58 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207469","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"“Is that what the Pray Manuscript shows?  Hmmm? \nThe  question as to what sindonologists, or at any rate some of them, see as the “Shroud” is far too important to be relegated to a hmmm. I would say that the semantics are one of the most questionable aspect of all. Get that wrong, and pretty well everything else is guaranteed to be wrong. The crucial question is whether it was Joseph of Arimathea’s linen (sindon) that was present at the time of imprinting, or some entirely different linen, described as othonia If it was the first, then the appropriate model is that of contact imprinting, maybe en route from cross to tomb, maybe a little later. But if it’s the second, and used different linen, whether as narrow winding strips or not, then the door is opened to any number of imagined imprinting mechanisms, real or speculative, that are not mere contact prints.\nI say the illustrator of the Pray Codex recognized the existence of TWO different ttpes of linen, one shown under the body, ie.Joseph of Arimathea’s (labelled red JA)  and the second in readiness, being reeled out in the background, linking the figures of Joseph, A.N.Other and Nicodemus,  probably supplied by the last of that trio, along with his 100lbs of aloes and myrrh (see John) and thus lablled blue N for convenience..\n\nWould it be an imposition to suggest that those who have doubts about or reject this interpretation try to summon up a little more than a hmmm?\nI say the TS should never have been called the “Shroud”, given most folk read that as burial shroud, for which there’s no biblical authority. It should have been called the Deposition or Retrieval or Transport Linen. I’m fairly certain the illustrator of the Pray Manuscript would have concurred.\n\n","date":"August 5, 2015 at 11:25 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207487","author":"Colin Berry","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Methinks Colin Berry cannot correctly even read a cartoonlike drawing. A shame.\n\n","date":"August 5, 2015 at 7:26 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207515","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Fulbright’s translation: And the napkin, which had been on his head, not lying with the linen cloths, but rolled up in a place by itself. \nMine: And the all enveloping wrap (Aram. sudara, Heb. mitpahat), that was over his head, not lying (on the ground) with the smaller linen cloths, but rolled up onto itself (and left) in the sole (vaulted) loculus (Heb kokha).\n\n","date":"August 6, 2015 at 10:46 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207584","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Fulbright’s translation: And the napkin, which had been on his head, not lying with the linen cloths, but rolled up in a place by itself. \nMine: And the all enveloping wrap (Aram. sudara, Heb. mitpahat), that had been over his head, not lying (on the ground) with the smaller linen cloths, but rolled up onto itself (and left) in the sole (vaulted) loculus (Heb kokha).\n\n","date":"August 6, 2015 at 10:47 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207585","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"I agree Colin that the Shroud was a temporary tool, to transport and then keep the body till the proper burial occurred. That’s consistent with the gospels\n\n","date":"August 6, 2015 at 2:30 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207538","author":"Thomas","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Glad to see that you too have deduced the blindingly obvious Thomas. So why Dan and others line up Fulbright and Dreisbach as if somehow contradicting one’s chronology of sindon first, othonia second (whether or not the latter were narrow strips  or maybe another single sheet) is baffling to say the least. And to anyone who considers Diana Fulbright to be above reproach, I suggest they take a look at her caption to Fig 1 (the shrouded corpse at the top of Dan’s posting). \nFig 1: Body wrapped “according to the custom of the Jews” (Based on forensic analysis of the image on the Turin Shroud”. \nTalk about a circular argument, begging the question etc etc. And one’s supposed to genuflect to that kind of insult to the intelligence?\n\n","date":"August 6, 2015 at 2:39 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207540","author":"Colin Berry","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Jews in the first century were buried in a single burial cloth. Things like Egyptian mummy bandages were not used.\n\n","date":"August 5, 2015 at 6:18 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207508","author":"Louis","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Judeans prior to 50CE were buried in a set of clothing used as shrouds (layers of clothing used as shrouds were found).\n\n","date":"August 5, 2015 at 6:44 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207510","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"The ABSOLUTE requirement to bury in a single shroud (in an all envelopping wrap along with a variety of garments, (the takhrikhim) that include a hat, jacket, belt and linen shoes dates back to Gamaliel II who was born about 50 CE and died in 110 CE). Yeshua was dressed in a set of clothing (all envelopping wrap known as the Kornelimînster Sudarium + skull cap known as the Cahors Headdress + face veil known as the Manoppello Veil (now reduced to about half its size and touched up) + linen strip/belt (?) + a himation (known as the Turin Shroud) + a large sindon (cut into two halves, one half being known as the Kornelimûnster Sindon Munda).\n\n","date":"August 5, 2015 at 7:01 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207513","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"In order words, Yeshua was dressed in a set of wrappings used as shrouds not just a single burial cloth as LdF misleadingly wants us to believe against the very fact a set of genuine/substitute wrappings used as shrouds on Yeshua’s burial have survived.\n\n","date":"August 5, 2015 at 7:45 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207519","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Typo: Yeshua was dressed in a set of clothing (an all envelopping wrap or cloak known as the Kornelimînster Sudarium –Aramaic Sudara/Greek soudarion— 6×3.5m)\n\n","date":"August 5, 2015 at 7:05 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207514","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"More typo: face veil or burial SCARF known as the Manoppello Veil (now reduced to about half its size and touched up) + linen strip/SASH (resewn to the TS?)\n\n","date":"August 5, 2015 at 8:16 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207520","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"The “large shining wrap”  (Gr. phelonen/phailonen) Paul mentions (2Th 4: 13) could be the immense Byssus linen cloth honeycomb, composed out of threads as fine as cobweb, large 6.15 x 3.52 meters known as the Sudarium Domini and now kept in the Kornelimünster abbey.\n\n","date":"August 5, 2015 at 8:35 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207522","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"I would say Dreisbach & Fulbright are far more qualified on this issue than is Berry.  Yep, that’s my opinion.  Sorry Colin, I just find some of your statements to be beyond the pale of reasonable.\n\n","date":"August 5, 2015 at 7:29 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207516","author":"Dcn Andy","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Perhaps you, Dcn Andy, and Dan for that matter, would care to state precisely where you think my interpretation of ‘sindon’ and ‘othoni’ differs significantly from that of Dreisbach and Fulbright. This could be interesting – analysis is depth as distinct from mere skimming the surface. Be warned: I found two glaring instances of “begging the question” yesterday, one from each of the authorities you name, showing that TS celebrities are not above creating cherry jam for the masses. Indeed, it’s the celebrities who are responsible for most of it. Dan Porter’s attempts to snuff this blogger out with his wet blanket techniques will not succeed. The bit is between the proverbial teeth – and yes, I do have teeth. I despise pseudoscience in all its forms and its agenda-driven practitioners. I do not need this site and its lazy, partisan “my expert is more authoritative than thou” rhetoric to get my message across (though it may take time – years rather than months), In the meantime: here’s some advice. If you don’t like my line of reasoning, then state why. Stop lining up your so-called experts, stop the cut-and-paste of their words- imagining that to be some kind of rebuttal. It ain’t. In fact, it sums up this site beautifully: an unwillingness to address issues in DEPTH anf in DETAIL (with a handful of exceptions but for whom I would not be here).\n\n","date":"August 6, 2015 at 12:14 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207532","author":"Colin Berry","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"I am not competent in ancient Greek to discuss the analysis of Mrs. Fulbright, although I had read two or three articles that are not in line with the meanings that she attributes to some words. But this is not my point. I want comment two pictures of her article. \nFigure 1: This is not the way of wrapping “according to the custom of the Jews” in Palestine at the first century. See articles by Orit Shamir: http://antiquities.academia.edu/OritShamir . The sheet of linen as a shroud was a custom introduced by Gamaiel II (post fall of Jerusalem).  The picture is relatively similar to the Jewish shroud from this date (70 CE). Notwithstanding, some typical elements are lost in the image: the bandages used to wrap the shroud. For example, the sheet position under the back of the knees is impossible without them. But this position of the shroud is absolutely incompatible with the 3D theory of the image and any other natural process of produce an imprint. The image would have plenty of wrinkle marks. This is not the case. I am wondering what have to do this picture with the customs of the Jews or the Shroud of Turin. \nPicture two: the location of this tomb is incorrect (“Givat ha-Mivtar, Jerusalem”). See Zangenberg (https://openaccess.leidenuniv.nl/bitstream/handle/1887/13022/oratie%20zangenberg.pdf?sequence=1, 2007: 8) or Konstantinos D. Politis: “The Discovery and Excavation of the Khirbet Qazone Cemetery”, fig. 10.4, p. 216). The correct location is in Khirbet Qaazone in West Bank. The correct dating is second or third centuries and it is not a Jewish tomb, but a Nabatean one. I am wondering what have to do this image with the Shroud of Turin.\nPS: I am a little surprised also because the word “Σινδών“ appears several times without the sign of accent over the omega. \n¿Masterly?\n\n","date":"August 6, 2015 at 2:16 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207536","author":"David Mo","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"“Judeans prior to 50CE were buried in a set of clothing used as shrouds (layers of clothing used as shrouds were found).” Not necessarily. Any evidence? I thought not.\n“Yeshua was dressed in a set of clothing …” [et seq.] I don’t believe any of that, and Max has not provided any evidence to suggest that it might be true.\nI agree that Diana Fulbright’s article is better in its philology than in its archaeology. Figure 1 is a piece of circular reasoning, to the effect that the Shroud is from a 1st century burial, so this must be the way 1st century burials were carried out, which is why the Shroud was wrapped around the body like this. David Mo is perfectly correct that the image on the Shroud of Turin does not match such a wrapping in any way.\nI think the point about Figure 2 is that the Egyptian mummy-style wrapping does not seem to have emerged from Egypt at all, and that big sheets or one kind or another were typical. However David Mo is correct (again) in implying that the Khirbet Qaazone burials cannot be considered in any way indicative of normal Jewish burial practice and it is true that Fulbright misidentified the site. In my comment above I made a mistake in saying that she thought Lazarus was trussed mummy-style – I misread her reference to the correct Figure for comparison.\n\n","date":"August 6, 2015 at 4:59 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207549","author":"Hugh Farey","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Unfortunately unsubstantiated claims are made, with no evidence at all.\n\n","date":"August 6, 2015 at 5:33 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207551","author":"Louis","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Reminder for the science of the earth expert and the free lance journalist who are definitely NOT Second Temple period specialists in terms of koine Greek and Semitic Philology, Archeaeology and History): \nMy archeological thought experiment is based on a couple of ACTUAL attempts (in 1994 and 1997; each time with the same volunteer) at reconstructing Yeshua’s dressing/wrapping up in a set of clothing used as shrouds in light of extant Christic contact relics (whether genuine relics and/or  substitutes/faithful replicas), Hebrew, Aramaic and Greek Philology (especilally Hebrew time markers and koine Greek verbs to describe the dressing in a large shroud and smaller shrouds), Second Temple period burial, practices, customs and rites and the Halakha (just to name the main fields of investigation here involved).\nMethinks neither HF nor LdeF (who keep criticiszing the archaeological thought experiment) and connot even substantiate their negative aprioristic opinion,  are totally unable to really separate good archaeology from pseudoarchaeology. When was it last time HF or LdeF have atempted to dress in a set of clothing used as shrouds a real human body? Do they real think the TS shroud was still in the empty tomb and the Johannine soudarion can only refer to a PRE-burial napkin? Methinks they are enslaved to exegetical presuppositions and \nAre HF and LdeF even aware that the Johannine word “soudarion” is not derived from the Latin sudarium but from the Aramaic sudara (the latter is used several times in the Palestinian Targums of the Hebrew Bible or Tanakh and refers to an all enveloping wrap or cloak (used to sleep in too). It is a phonetic NOT a semantic equivalent! The Kornelimünster “Sudarium” (whether a genuine relic or a substitute replica of the sudara that  was used as an all envelopping shroud (6.15×3.52m) and was the one left rolled up onto itself on the stonebench of  cave-tomb sole burial vaulted? \nRegarding Lazarus’s “soudarion” (John 11:44), are HF & FdeL even aware , that the Greek ê opsis does not refer at all to the face but to Lazarus’s  “external appearance, form, or shape\nBecause of their philological and Chrsitolipsological blind spots, just focus on the Oviedo Sudarium and Turin Shroud and keep overlooking other Christic contact relics (whether genuine ones or replicas) such as the Cahors Headdress (a bloodstained skull\ncap), the Kornelimüsnter Sindon Munda (half of a larger sindon), the Kornelimünster Sudarium Domini etc. A REAL SHAME indeed! They cannot even discriminate between a\nnapkin used as a PRE-burial shroud (Oviedo Sudarium) and clean white\nburial clothings used as shrouds (Turin Shroud, Cahors Headdress, Kornelimünster\nSindon Munda and Sudarium Domini)! When was it last time the alleged “specialists” attempted to dress a real body in shouds the same size and\nshape as the still extant Christic contact relics to reconstruct Yeshua’s\ndressing in shrouds on his burial? Are they authorities/”High Priests” in\nSecond Temple period archaeology or history? whatis their real authorities? They are just recycling exegetical presuppostions done by others and just cannot mistake contradictory exegesese for archeaological truth. A real shame! \nMethinks the Science of the Earth high school teacher and the free lance journalist should take more seriously extant relics and/or replicas of Yeshua’s set of clothing used as shrouds. Indeed a new field of expertise (“Christolipsology” in terms of research and studies of Christic relics and/or replicas) should shake a good many scholarly or pseudo-scholarly presuppositions based on contradictory hermeneutics. Each of HF and LdeF “pet conservative exegesis” is not the absolute truth, far from it. Mething both are wrong as far as my research and studies in Christolipsology are concerned (my two attempts at reconstruction Yeshua’s dressing in shrouds included. Neither HF nor LdeF took the trouble to delve into the real thing as I did and still do as far as Yeshua’s burila is concerned.\nTo parphrase Father Dubarle, I would say say: “J’attache plus d’importance aux constatations objectives faites faites sur les reliques de contact dde Yeshou’a qqu’aux discussions des exégètes. Ceux-ci, comme il arrive souvent avex l’archéologie, auront à s’arranger des faits concrets, s’ils sont beien assurés”. \nRe cloth used as shrouds, besides sindon and soudarion/sudarium and have HF & LdeF ever heard of mindil, pathil and mishpahat, I very mch doubt so (BTW neither Diane Fulbright seem to have!).\n\n","date":"August 6, 2015 at 8:39 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207567","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Typo: mindil, pathil and mitpahat\n\n","date":"August 6, 2015 at 9:04 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207574","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"midil = burial scarf or veil, pathil = a burial skull cap or kippa, mitpahat is the Hebrew for Armaic sudara = an all enveloping wrap or cloak used as shroud.\n\n","date":"August 6, 2015 at 9:07 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207575","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Typo: Methinks  HF nor LdeF (who keep criticiszing the archaeological thought experiment) and connot even substantiate their negative aprioristic opinion, are totally unable to really separate good archaeology from pseudoarchaeology.\n\n","date":"August 6, 2015 at 8:41 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207568","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"More typo: Are theyeven aware the Kornelimünster “Sudarium” (whether a genuine relic or a substitute replica of the sudara)  was/could have been used as an all envelopping shroud (6.15×3.52m) and be the Johannine soudarion left rolled up onto itself on the stonebench of the cave-tomb sole burial vault?\n\n","date":"August 6, 2015 at 8:44 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207570","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"More typo (sorry): They are just recycling exegetical presuppostions done by others and just  mistake contradictory exegesese for archeaological truth. A real shame!\n\n","date":"August 6, 2015 at 8:47 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207572","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Dian Fulbright wrote re the Johannine “soudarion” (two NT ocurrences): “Far from referring to a cloth that covered the entire body, it (“the siudarion”) was a smaller cloth\nwhich covered the face and in some instances, was wrapped around the head.\nThese texts, considered carefully, do in fact support the validity of the cloth\nknown as the Sudarium of Oviedo.” Totally wrong.  See my above comment.\n\n","date":"August 6, 2015 at 9:00 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207573","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Re the use of an all enveloping wrap (Aramaic “sudara”, Heb. mitpahat see the pseudo-Johnathan Targum of Exodus 34:29-35, Biblia sacra polyglotta byraina Walton, Vol. 4 (Ms Add 27031, British Museum + Codex Neofiti 1, Vatican Library).\nRe John 11:44 “ê opsis” used in conjunction with “soudarion”, the former to be translated: “the external appearance, form or shape (of Lazarus)” NOT “the face (of Lazarus)”, see John: 7:24 and Rev. 1:16.\n\n","date":"August 6, 2015 at 10:09 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207581","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"“Latin sudarium is a phonetic coincidence with our word (sudarion), from which it differs i meaning.” (Jastrow, Dictionary of th tagumim, the talmud Babli and yerushalmi, and the midrashic literature,New York, 1950, vol. 2, p. 962)\n\n","date":"August 6, 2015 at 1:20 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207596","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Fulbright’s translation: “And the napkin, which had been on his head, not lying with the linen cloths, but rolled up in a place by itself.”\n(John 20:7)\nMine: “And the all enveloping wrap that had been over his head, not lying (on the ground) with the linen cloths, but rolled up onto itself (and left) in the sole (vaulted) loculus.”\n(John 20:7)\n\n","date":"August 6, 2015 at 1:38 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207600","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Typo: not lying (on the ground) with the smaller linen cloths\n\n","date":"August 6, 2015 at 1:39 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207601","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"¡Muy interesante, Max!\nCarlos\n\n","date":"August 6, 2015 at 1:41 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207602","author":"Carlos","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"All this philological gallimauphry is off the point, Max, even if it is true, for which you provide no evidence (what a surprise). I was asking for evidence that Jesus was wearing a set of clothing. Telling us that the Kornelimünster “Sudarium” is a big sheet is not evidence that it, or anything like it, was used for Jesus’s burial. Nor is all your dressing up, nor are any of your so called thought experiments. Methinks you should attempt to distinguish between a thought experiment and a flight of fancy. “A thought experiment is a device with which one performs an intentional, structured process of intellectual deliberation in order to speculate, within a specifiable problem domain, about potential consequents (or antecedents) for a designated antecedent (or consequent).” This does not describe anything you have mentioned here so far.\n\n","date":"August 6, 2015 at 2:09 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207604","author":"Hugh Farey","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"What is your real expertise? Can you really discriminate between archaeological thought experiment, attempts at reconstructing a Second Temple period dressing in shrouds, archeaological findings in the Holy Lands (e.g. multiple burial garments used as “shrouds” and found in the shape of fragments or a bundle made of several layers of garments used as shrouds; use of an all envelopping wrap etc). Methinks YOU are off the mark as far as Second Temple period dresssing in shrouds is concerned and archaeological pieces of evidence. What do you make of the Christlisological pieces of evidence such as the Cahors Headddress, Kornelimünster burial Sudarium Domini and Sindon Munda, the (touched-up and reduced to half its size)Manoppello Veil etc)? NOTHING. \nMost curiously, my alleged “lack of evidence” is even stronger than you unsubstansiated denial or any forgery hypothesis you can ever think of!\n\n","date":"August 6, 2015 at 2:26 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207610","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"My real expertise, Max, is in identifying flim-flam…\n\n","date":"August 6, 2015 at 2:33 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207611","author":"Hugh Farey","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Too bad your expertise does not allow you to REALLY discriminate between good archaeology, pseudo exegesis and pseudo archeaology!\n\n","date":"August 6, 2015 at 2:43 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207615","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Typo: Hugh, what do you make of the Christolipsological pieces of evidence such as the Cahors Headddress, Kornelimünster burial Sudarium Domini and Sindon Munda, the (touched-up and reduced to half its size)Manoppello Veil etc)? NOTHING. They are the pieces of a jigsaw puzzle that are just to be put in place. They are the pieces of evidence Yeshua was tightly wrapped up, fastened and wound in a set of clothing used as shrouds. \nNow if you mean state-of-the art experimental archaeology, I need in turn time, funding and volunteers.\n\n","date":"August 6, 2015 at 2:36 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207614","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"On another thread, I wrote:\nTo paraphrase Mouraviev, I would say re “the only valid assumption we are entitled to as scientists and/or archeaeologists and/or professional cryptologists is that the double bloodied body image could be a natural accidental/providential byproduct of the pre-Gamalielian II Second temple period Judean main burial procedures themself, not of the mysterious disappearance of the body, or a forgery (but, as stated, the hypotheses based on the latter assumption must cope with new problems and reject an important part of the available evidence).”\n\n","date":"August 6, 2015 at 2:10 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207605","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Goodness me! I think I agree with most of that!\n\n","date":"August 6, 2015 at 2:23 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207609","author":"Hugh Farey","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Max:\nEn las traducciones de Juan: 20 basadas en la Vulgata Latina aparece 3 veces la palabra “VIÓ”.\nPero el original griego utiliza 3 verbos distintos:\nbéplei, theórein, eíden\nJuan 20:5   béplei\nJuan 20:6   theórein\nJuan 20:8   eíden\n¿Cual es su opinión?\nCarlos\n\n","date":"August 6, 2015 at 2:36 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207613","author":"Carlos","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Hola Carlos! Pienso que la entropía y la subversion de traduccion (from Aramaic/Hebrew into koine Greek and from koine Greek into Latin) is something that goes most if not all the time unnoticed to the sole exception of very few shroud researchers and scholars.\n\n","date":"August 6, 2015 at 3:15 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207619","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"John 20:5 To glance\nJohn 20:6 To look questioningly\nJohn 20:8 To see\n\n","date":"August 6, 2015 at 4:06 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207620","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Hugh, can you demostrate my translation of John 20:7 \n(“And the all enveloping wrap that had been over his head, not lying (on the ground) with the smaller linen cloths, but (left) rolled up onto itself in the sole (vaulted) loculus.”)\nis just flimflam? I challenge you.\nCan you demonstrate  the Cahors, Kornelimunster, and Manoppello relics are fakes? I challenge you.\nMethinks to do is hard; to judge is easy. Do first THEN judge if you have the expertise/knowledge. Waiting for your own reconstruction of Yeshua’s burial.\n\n","date":"August 6, 2015 at 3:03 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207616","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Yes, Max. You explained earlier that in John 11:44, which is about Lazarus, the word “σουδαρίῳ” (soudarion) could have referred to a large sheet which could enwrap a whole body, and justified this by saying that the “ὄψις” (opsis), which was covered by the soudarion, can mean any form or shape, and was not restricted to the head. So far so good. However the soudarion of John 20:7 is specifically said to be around the “κεφαλῆς”, which can only mean the head. This calls into question your derivation of soudarion from the Arabic soudara. Your suggestion “the Johannine word “soudarion” is not derived from the Latin sudarium but from the Aramaic sudara (the latter is used several times in the Palestinian Targums of the Hebrew Bible or Tanakh and refers to an all enveloping wrap or cloak (used to sleep in too)” is ingenious, but not, as far as I know, supported by anybody else. The Jewish Annotated New Testament (ed. Amy-Jill Levine, Marc Z. Brettler) thins that sudara means a male head covering, and wikipedia (yes, I know…) on Sudra thinks that “Aramaic: סודרא; Sudara, is a traditional ancient Jewish headdress” which is surely less than a full body cloth.\nSo, Max, I think you are completely wrong about the soudarion being a large cloth, and what’s more, everybody reading this comment agrees with me. But how can this be, when you’ve spent thirty years researching this very point, and I’ve spent ten minutes on Google? It’s all about evidence, Max, which I’ve given, and you won’t. The fact is, Max, that all your posturing about archeocryptology and Christolipsology and all the other made-up words you keep trying to impress us with mean absolutely nothing without evidence. Your experiments with dressing up, your thought experiments, your mountain of unpublished papers, nothing. Just guesswork, idle fancies born of familiarity with Middle Eastern linguistics, and an overweening confidence in your own authority. Flim-flam, in fact.\nWell, maybe you’re right. Maybe soudarion does mean a large cloth. Maybe the Kornelimunster relic is evidence of your hypothesis. But without evidence, Max, we’ll never know…\n\n","date":"August 6, 2015 at 4:37 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207624","author":"Hugh Farey","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Hugh, you wrote: “However the soudarion of John 20:7 is specifically said to be AROUND (upper cases mine) the “κεφαλῆς”, which can only mean the head.”\nYou’re wrong.  In John 20:7, we read the sudarion “o è EPI tès kephalès autou” (“the soudarion “that (was/had been) over/on his head”. Your comment is just flimflam. It only calls into question your knowledge of koiné Greek NOT my derivation of soudarion from the ARAMAIC sudara!\nIn the Ruth Targum, the Hebrew mitpaHat is translated by the Aramaic sudara. the mitpaHat could be folded, turbaned around the head, yet was a large piece of cloth per se, a large cloak that could wrap both the whole head and body e.g. to sleep in (see Targum Ruth 3:15). \nYou also wrote: “everybody reading this comment agrees with me”, which means they are ALL totally wrong as they are enslaved in exegetical presuppositions and are totally unaware of translation entropy and subversion!  \nYes indeed, you/they cannot read what’s written in John 20:7, the soudarion was/had been NOT around but ON/OVER Yeshua’s head. YOUR whole comment is just FLIFLAM! Period.\n\n","date":"August 6, 2015 at 5:42 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207635","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Typo: In John 20:7, we read the sudarion “o è EPI tès kephalès autou” (“the soudarion “that (was/had been) over/on his head”. Your comment is just flim-flam. It doesn’t call into question my derivation of soudarion from the ARAMAIC sudara, it only NULLIFY your knowledge of koiné Greek! My expertise is identifying both blatant and non blatant flim-flam such as YOURS!\n\n","date":"August 6, 2015 at 5:48 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207636","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Hugh, you also misleadingly wrote: “Your suggestion “the Johannine word “soudarion” is not derived from the Latin sudarium but from the Aramaic sudara (the latter is used several times in the Palestinian Targums of the Hebrew Bible or Tanakh and refers to an all enveloping wrap or cloak (used to sleep in too)” is ingenious, but not, as far as I know, supported by anybody else.”\nWRONG again! Brother Bonnet-Eymard thinks and Father Levesque and  Barbet thought the Turin Shoud was the Johannine soudarion that is a large wrap too.\n\n","date":"August 6, 2015 at 6:11 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207642","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Methinks the soudarion/sudara is the Kornelimünster Sudarium Domini (6.15×3.52m) and you just failed to demosstrate it just could not be!\n\n","date":"August 6, 2015 at 6:14 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207643","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"you also wrote: “The fact is, Max, that all your posturing about archeocryptology and Christolipsology and all the other made-up words you keep trying to impress us with mean absolutely nothing without evidence.”\nI am not useing made-up words to impress anybody, I’m just developping new approaches. Were you ever impressed by the made-up sindonology? Tday, it is currently accepted.\n\n","date":"August 6, 2015 at 6:21 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207644","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"No, Max. The Hebrew Ruth 3:15 contains the word mitpaHat, which occurs only twice in the Old Testament and is variously translated veil, mantle, shawl, cloak, etc. Its size in that context is is largely a matter of guesswork. It now refers exclusively to a headdress. If it is interpreted as a headdress, then it may be translated into aramaic as sudara, but that does not mean that sudara can refer to one of the wider interpretations. \nAnd no, Max. The fact that various people thought that the soudarion was the Shroud does not mean that they thought the word was derived from the aramaic sudara.\nAnd no, Max. I never denied that the Kornelimunster cloth could be the sudarium. Quite the reverse. I said that you may be correct. However, I don’t think you are correct, and none of your evidence to suggest that it might be is the slightest bit persuasive.\nAnd no, Max. “I am not using made-up words to impress anybody.” Really? Come on…\n\n","date":"August 7, 2015 at 2:23 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207659","author":"Hugh Farey","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Hugh, You No, Max-mantra is not substantiated at all, just flim-flam AGAIN!\nRe Heb. mitpaHat (a word you ignored before I first told you about!), you now wrote (as if the word was very familiar to you!): “Its size in that context is is largely a matter of guesswork.” \nOh, really? Actually it is just a matter of common sense (NOT guesswork!). In Ruth 3:15, Boaz gives her six measures  (a biblical measure of dry goods) of barley in her “covering, –all envelopping shawl,cloak” Heb. mitpaHat, Aram. sudara). \n“And (Boaz) told Ruth, “Bring the shawl/covering you’re wearing and hold it out.” When she held it out, he shoveled six measures of barley into her shawl/covering;”\nGiven one se’ah is 6.959 quart or 7.7 liters\nCould you tell me how six she’arim/measures of barley (= nearly 50 liters of barley given as a gift to Ruth) can fit in a kerchief or a napkin the size of the Oviedo Sudarium? \nComme disait Babet : “on ne met pas six mesures d’orges dans un mouchoir !” \nYOU are WRONG AGAIN. NO WAY!\nReminder: “Latin sudarium is a phonetic coincidence with our word (sudarion), from which it differs in meaning.” (Jastrow, Dictionary of the targumim, the talmud Babli and Yerushalmi, and the midrashic literature,New York, 1950, vol. 2, p. 962)\nYour alleged “hermeneutics” is nothing but that of a flim-flaming conjurer’s trick (or put in other words just a HughFreyan flim-flamming “sleight of hands”).\nBesides methinks you have not the foggiest notion about Ancient and/or Second Temple period Judean clothing! \nYou misleadingly wrote too: “And no, Max. The fact that various people thought that the soudarion was the Shroud does not mean that they thought the word was derived from the aramaic sudara.”\nNo, Hugh, YOU are WRONG AGAIN (see for instance Bonnet-Eymard research paper “Le “Soudarion” Johannique Négatif de la Glore Divine” (oral presentation, Congresso di Bologna, 1981\nYou then wrote: “And no, Max. I never denied that the Kornelimunster cloth could be the sudarium. Quite the reverse. I said that you may be correct. However, I don’t think you are correct, and none of your evidence to suggest that it might be is the slightest bit persuasive.”\nYOU are far from being persuasive, all the more so since you’re TOTALLY wrong from the start! Besides a SD tradition dates back, at least, to Charles the Great and this type of clothing is consistent with ancient Judean burials! (see archaeological findinds in the Holy Lands as far as shrouds are concerned).\nYu finally wrote: “And no, Max. “I am not using made-up words to impress anybody.” Really? Come on…”\nYou are wrong again. Coining new words is in keeping with my original ideas and aproaches as far as cryptology s concerned. Come on, quit YOUR cheap flim-flam, give me a break!\n\n","date":"August 7, 2015 at 6:56 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207665","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Methinks I shall leave the British science of the earth high scholl teacher Hugh Farey (along with the Brazilian free lance journalits Louis de Fegueiredo who keeps claiming my reconstruction of the dressing in shrouds was imaginary and I would be laughed out of court) with their imaginary exegesis/exegetical presuppositions in denial of philological, christolipsological, metrological, historical and archaeological facts and the like.\n\n","date":"August 7, 2015 at 7:14 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207666","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Dan,\nI think it is high time that you cut Max down to size since he continues to hurl adjectives and insults at well-known biblical scholars, Shroud scholars and commenters on this blog. This is the only place where he can do it since he does not have a website.\n\n","date":"August 7, 2015 at 8:49 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207677","author":"Louis","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"LdeF, \nThe true fact is when I started re-exposing my reconstruction of Yeshua’s dressing in shrouds (a few weeks ago) you claimed it was just an “imaginary reconstruction” and “I would be laughed out of court” just because you think you knew better though never substantiated your claim. YOU thought you knew everything better than me because of “one” unquoted and unamed infallible mysterious authority. You hit me (twice) under the belly. Soon I had to cut YOU and your alleged “Biblical authorty” down to size. You are all too prone to ad homs at me while not substantiationg your claim. I stroke back at your ad homs while subtantiating my claim. Had you in no wise deserved it…\n\n","date":"August 7, 2015 at 9:53 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207679","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"The message was directed to Dan, requesting him to take appropriate action. The ball is in the other side of the court.\n\n","date":"August 7, 2015 at 10:11 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207680","author":"Louis","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Typo: Comme disait BaRbet : “on ne met pas six mesures d’orges dans un mouchoir !”\n\n","date":"August 7, 2015 at 7:21 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207667","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Typo: Comme disait Barbet : “on ne met pas six mesures d’orge dans un mouchoir !”\n\n","date":"August 7, 2015 at 7:22 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207668","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Methinks the science of the earth high scool teacher and the free lance journalist are real expert in NON idenfying their own exgetical flim-flam.\n\n","date":"August 7, 2015 at 7:42 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207672","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Max. You are getting close to being kicked out. \n\n","date":"August 7, 2015 at 10:38 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207682","author":"Dan","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Dan, you have now seen that he does not learn from mistakes and and posts on the blog insults and personal attacks, things he would never do on a blog or website that belonged to him. Turin as well as Shroud enthusiasts wanting to know more about the relic read the comments.\nWhy should “Shroudies” engaging in fruitful discussion here pay the price for the damage done by those who do not know how to comment?\n\n","date":"August 7, 2015 at 12:43 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207685","author":"Louis","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Methinks Dan do not need a denouncer in his blog!\n\n","date":"August 7, 2015 at 1:01 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207688","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Those who monopolize and/or disrupt other people’s blogs should be judged entirely on their manners and modus operandi – not their perceived vulnerabilities. Ordinary uncomplicated folk have rights too.\n\n","date":"August 7, 2015 at 1:09 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207689","author":"Colin Berry","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"What about your own manners and modus oprerandi?JUST look who’s talking!\n\n","date":"August 7, 2015 at 7:59 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207713","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"While this is not exactly a Christian blog there are believing Christians posting comments here, as well as those who believe in “g-od”. But what we often see here gets us closer to Nietzsche, Freud, Sam Harris and RD.\nOn the other hand, there are well-known atheists who believe in the people cited above and have blogs where we do not see insults and personal attacks and where fruitful discussion takes place.\n\n","date":"August 7, 2015 at 7:09 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207707","author":"Louis","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Dan, I am waiting for your response to the above attack.\n\n","date":"August 7, 2015 at 7:44 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207712","author":"Louis","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Reminder: the Kornelimûnster Sudarium Domini (that was first kept in the core of the Aachen Catheral of which construction begun in 786 CE) is described as “the shroud of Christ, which covered the head of the corpse of Jesus in the tomb”.\nThis is inkeeping with my translation of John 20:7:\n“And the all enveloping wrap/shawl that had been over/covered his head, not lying (on the ground) with the linen cloths, but rolled up onto itself (and left) in the sole (vaulted) loculus.”\n(John 20:7)\n\n","date":"August 7, 2015 at 8:01 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207673","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Typo: “And the all enveloping wrap/shawl that had been over/covered his head, not lying (on the ground) with the SMALLER linen cloths, but rolled up onto itself (and left) in the sole (vaulted) loculus.”\n(John 20:7)\n\n","date":"August 7, 2015 at 8:03 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207674","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Besides if Lazarus was only wrapped in a kerchief around his face (and not an all enveloping shawl or wrap, wrapped around his whole head and body/shape), indeed for his alleged “napkin/kerchief”,  his handband and feetband,\nhe would not have not been much dressed on his burial!\n\n","date":"August 7, 2015 at 8:14 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207675","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"At last! I’ll have you eating out of my hand yet, Max. What, readers must ask themselves, has been the point of all this incessant needling? Do I really think that Max is nothing but a fantasist? DoI I care nothing for his scholarship and ability to pop out linguistic prestidigitations at the drop of a hat? Of course not – and I’ve said so above. All I’ve been trying to do is to wheedle out of him just a teeny-weeny smidgin of evidence, and guess what, I think I’ve partially succeeded. \nIs your etymology for soudarium just a fancy? No, of course not, and look, now there’s some evidence to back up your idea. Now we can assess it.\nJastrow’s ‘Dictionary of the Targumim, the Talmud Babli and Yerushalmi, and the Midrashic literature.’ The entry from which you quote has the headword ‘סודר’, which Jastrow defines as “a scarf wrapped around the head and hanging down over the neck, a turban.” After various examples, a note at the end says: “[Latin sudarium is a phonetic coincidence with our word, from which it differs in meaning.]” The next headword is ‘סודרא’, as in Ruth 3:15, which is defined as the same, and several more instances of its occurrence are given, particularly referring to being strangled with one, and to its being wound around the head to form a turban. In this case, then, Max, you have muddled things up. For a start Jastrow does not think that soudarium has anything to do with sudara, and for a second, Jastrow does not think a sudara means a full-body sheet anyway.\nAnd does Bonnet-Eymard agree? I can’t find his paper, but note that Domingo Muñoz León’s book, ‘Salvacion en la Palabra’ has a footnote mentioning ‘une étude de Bruno Bonnet-Eymard […] qui voit dans le grec σουδάριον un décalque de l’araméen סודרא, au sens de “linceul” et non simplement de “mentonnière.” So it looks as if you’re correct there, although it must be said that Muñoz León doesn’t agree with Bonnet-Eymard.\nI think you and Bonnet-Eymard are out on a limb, frankly. The connection of sudarium to sudara is not established by Jastrow, and even if it were, sudara does not refer to a full-body cloth. The hope that it might is derived from the huge quantity of corn that gets dumped in it while Ruth holds it out, but the amount “six measures” is not given an actual unit. If it corresponds to a seah or an ephah it amounts to more than anybody could reasonably carry, and is probably a deliberate exaggeration as a sign of Boaz’s generosity. Other, non-biblical, references to sudara clearly deny its whole-body proportions.\nBack to Kornelimunster, and its three holy cloths. The linteum (described as the towel with which Jesus wiped the feet of the disciples) and the sindon are about the same size, about 180 cm long and nearly as wide, while the sudarium (prominently embroidered with the word Sudarium) measures 39 x 22 cm. You appear to have muddled these up.\nBut we did get some sources out of you, so well done; we’ll make a scholar of you yet, Max!\n\n","date":"August 7, 2015 at 10:17 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207681","author":"Hugh Farey","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Hugh, I am not writing up a research paper, are you kidding! I am just posting short comments in haste, on the spur of the moment and in snatches! This does make a world of a difference re “scholarly orthodoxy and traditional Academic etiquette”! \nYou wrote something that shows you how unfamiliar you are with the Kornelimünster Sudarium Domini. You wrote:  “Back to Kornelimünster, and (…) the sudarium (prominently embroidered with the word Sudarium). (It) measures 39 x 22 cm. You appear to have muddled these up. But we did get some sources out of you, so well done; we’ll make a scholar of you yet, Max!” and claimed, “Now we can assess it (i.e. my etymology for “soudarion”). Actually methinks you mistake misrepresentation for assessment  (as usual when it comes to me, how odd!)\nThe true fact is YOU muddled things up regarding the KSD NOT me!\nInfo for the HF, may be a scholar to be (re Christolipsology and Semitic philology): The relic, which is exhibited to the faithful each seven years, is 16 times FOLDED. It actually measures 615 x 352 cm (not 39 x 22 cm as you most wrongly claim! Cannot you read me? I gave at least twice or thrice its real size once displayed!). It is an all-enveloping veil or shawl (Heb. mitpaHat, Aram. sudara) made of byssum and proceeding from Antioch, Syria; a city that was one of the centres that were producing byssum fabrics in Antiquity. The Patriarch of Jerusalem presented it as a gift to Charles-The-Great and from 812 CE onward the Sudarium Domini was kept in the core of the Aachen Cathedral until Louis the Pious, one of Charles’s sons, gave it to Abbot Benedict of Anian of the Kornelimünster Abbey and since about 1829, it is kept in the parish church. \nrRe the Hebrew mitpaHat and its Aramaic translation sudara, in the Tanakh (Hebrew Bible), it is rendered by the French word, “châle” (in English, “shawl”) not “scarf” (Aramaic/Syrac = mindil). Besides Barbet (see La Passsion du Christ selon le chirurgien, 7èeme édition, 1965, p.222), both Frs Levesque and Bonnet-Eymard linked it to to both mispaHat and sudara. See Levesque, Le Saint Suaire de Turin et L’Evangile, Nouvelle Revue apologétiqu, 1939, p. 228-237.\nHere again, I haven’t muddle at all. YOU have! \nWas it “scholarly enough” of me and do I have to thank you for you not knowing about that at all?\n\n","date":"August 7, 2015 at 12:54 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207686","author":"Max patrick Hamon","site":"shroudstory"},{"title":"When is a Sindon Not a Sindon?","post":"Aw, don’t lose it just as we were making progress. Evidence, Max, evidence. What on earth makes you think that the Kornelimunster sudarium is folded 16 times? Clearly you have never attempted it. I have. Actually, of course, to turn a 615cm x 352cm cloth into a 39cm x 22cm area takes 8 folds, not 16, but that still results in 256 layers of cloth. I challenge anybody to try it, and see if the result looks as if it could contained in the reliquary held by the priest in http://www.abtei-kornelimuenster.de. For those of you who don’t have that size of cloth lying about, use four bedsheets lying on top of one another to represent the first two folds, and try folding them in half six more times. And I don’t believe it’s made of sea-silk either, for that matter. Who thinks it might be, and on what evidence?\n\n","date":"August 8, 2015 at 2:07 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","id":"comment-207729","author":"Hugh Farey","site":"shroudstory"}]
