[{"title":"A reply to Dan Porter and his Shroud of Turin associates re the significance of the Lirey Pilgrim’s Badge","post":"I have been following an incredibly talented experimental film scientist an amateur who has discovered in 2011 the second Shroud or the first, a decoded photograph of an alive Jesus Christ in the St Peters Veronica Veil resembling the face of the Shroud of Turin. He also has been rediculed by this group of so called Shroudies. His discovery is of immense importance as he has given evidence to both cloths coming from the same man and the St Peters Veronica has far greater time history recorded. He has solved the mystery without carbon dating by his discovery and several of these Shroud groups who have vested interests in conitueing the circus are terrified of his discovery. He even revealed three toes ripped off the mysterious left foot which scientists have said was crossing over but was not visible , his name is Vincenzo Giovanni Ruello\n","date":"August 12, 2012 at 1:44 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/23/a-reply-to-dan-porter-and-his-shroud-of-turin-associates-re-the-significance-of-the-lirey-pilgrims-badge/","cat":"badge_lirey","id":"comment-465","author":"Peter Ford","site":"colinberry"},{"title":"A reply to Dan Porter and his Shroud of Turin associates re the significance of the Lirey Pilgrim’s Badge","post":"It’s not an article – it’s a response to a response…\n","date":"May 31, 2012 at 7:15 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/23/a-reply-to-dan-porter-and-his-shroud-of-turin-associates-re-the-significance-of-the-lirey-pilgrims-badge/","cat":"badge_lirey","id":"comment-282","author":"colinsberry","site":"colinberry"},{"title":"A reply to Dan Porter and his Shroud of Turin associates re the significance of the Lirey Pilgrim’s Badge","post":"Have you considered adding some differing opinions to your article? I think it might enhance everyones understanding.\n","date":"May 30, 2012 at 6:44 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/23/a-reply-to-dan-porter-and-his-shroud-of-turin-associates-re-the-significance-of-the-lirey-pilgrims-badge/","cat":"badge_lirey","id":"comment-281","author":"click here","site":"colinberry"},{"title":"A reply to Dan Porter and his Shroud of Turin associates re the significance of the Lirey Pilgrim’s Badge","post":"Here are just two of the responses on Dan Porter’s site today. Both are intrigued by the Lirey badge, scarcely aware it would seem of its existence, far less its significance, until today. Yet the site owner wastes no time in posting that sour put-down response of his, not just in one but two quick-fire postings. Make of that what you will, folks, sceptics especially…\nComment 1 (from a site regular)\nThis is the first time I have seen this badge in the public arena, or even heard mention of it, although evidently the cognoscenti have been aware of it. Doubtless they can provide more detailed information about it if so inclined. Its dimensions, identity of the coats of arms, its material and other aspects would be of considerable interest. Its provenance and dating are obviously critical to its identity. Max includes the note that a similar impression of the figures is apparently on the Coudray tower.\nIan Wilson includes a colour plate of Templars Molay and Charnay being burned at the stake taken from a British Library ms (plate 28c in “The Shroud” 2010), If the colour plate is a moderately realistic representation, then both men appear beardless and also tonsured.\nIf the badge can definitely be connected to the Templars, it would seem to add some little weight to Wilson’s theory that the Templars were at least aware of the Shroud image.\nTo me, the left-hand image appears to have a face and is therefore intended as a frontal image; I cannot discern a face on the right-hand image, and presume it may be intended as a dorsal view as represented on the Shroud. An alternative explanation might be that if they indeed are connected to the Templars, they might represent the two Templar victims, although I tend to favour a Shroud-like image representation.\nIf the figures are indeed frontal and dorsal views, then it seems highly unlikely that they can be seen as anything else but a representation of some intended connection with the Shroud image, There is nothing else like it which it could otherwise represent,\nAny potential the badge might have for creating a rubbing or any other kind of copy is an irrelevant distraction from whatever else its true significance might be, assuming that it’s a genuine article.\n……………………………………………………………………………………\nComment 2 (another site regular)\nJust an interesting note about this medal : Did anyone noticed the herringbone weave on the cloth ? This is the best confirmation that the artist who have done this medal during the 14th century was looking at the Shroud of Turin.\n","date":"April 23, 2012 at 4:41 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/23/a-reply-to-dan-porter-and-his-shroud-of-turin-associates-re-the-significance-of-the-lirey-pilgrims-badge/","cat":"badge_lirey","id":"comment-182","author":"colinsberry","site":"colinberry"}]
