[{"title":"Who was wrong? Ray Rogers or Pliny the Elder?","post":"Interesting Dan.  The link to http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Pliny_the_Elder/ does not open.\n\n","date":"August 19, 2012 at 8:00 am","url":"https://shroudstory.com/2012/08/19/who-was-wrong-ray-rogers-or-pliny-the-elder/","cat":"history","id":"comment-15204","author":"Andy Weiss","site":"shroudstory"},{"title":"Who was wrong? Ray Rogers or Pliny the Elder?","post":"Interesting information, especially when you consider that Saponaria was NEVER found on the Shroud !!!  Ray Rogers only supposed his presence from the mild fluorescence of the cloth.  In the light of this new information, I think the hypothesis of Stéphane Mottin in France should be considered as much more probable to explain this mild fluorescence, i.e. because of the confirmed presence of deposits of pectines at the surface of the fibers.  \nHere, it’s important to note 4 things :  \n1- Dan made a huge mistake in his comment.  Saponaria was NOT used to bleach linen !  It was used instead as a detergent for the final cloth, once it was woven.  Here’s a quote from Rogers book that leaves no doubt about that : “The final cloth was washed with “struthium”, Saponaria Officinalis, to MAKE IT MORE SUPPLE.”  Not to bleach it !!!!  \n2- This coating of pectine on the fibers fits very well with Rogers hypothesis (even if Rogers bizarrely never spoke about that in his writings) and could well be a major component of the thin layer of impurities that was colored during the image formation process.  This finding by Adler was very bizarrely HIGHLY AND BADLY NEGLECTED in Shroud research concerning the chromophore of the image…  I really don’t understand why a HUGE FINDING like that always seem to have stayed in the darkness !!!  More researches SHOULD be make concerning this finding of Adler…\n3- Even if one day, it is proven with 100% certainty that there is no Saponaria on the cloth and that this detergent was never used on the final cloth, that wouldn’t really put the chromophore and the image formation hypotheses of Rogers in great danger, simply because in the mind of Rogers, Saponaria is NOT the principal element that probably composed the thin layer of impurities on the cloth; Starch fractions are.  You can find a quote from Rogers stating this in page 17 of the recent paper published by Thibault.  Here’s the quote from Rogers : “The evidence indicates that SEVERAL different impurities could have had an effect in image formation, but I suspect that STARCH was the MOST IMPORTANT as a color-producing reactant.”  And personally, I would dare to say that it is truly possible that along with starch deposits, the other main element composing the coating can well be the pectine supposed by Mottin in 1997 and found by Adler around 1998 !  \n4- Also, concerning the chromophore and the image formation hypotheses of Rogers, it’s important to understand that the use of Sapanaria was supposed by him as the principal active agent during the evaporation-concentration process that would have concentrate the impurities at the top-surface of the cloth (on both sides), rather than being a principal component of the thin layer of impurities.  In that context, the washing of the final cloth with another detergent (like heraclion or heraklion soap) would have had pretty much the same result of concentrating all the impurities inside the cloth on the top-surface of the cloth (on both sides).\nConcerning the question of where Rogers got his information about the frequent use of Saponaria in the making of ancient linen, I’m pretty sure he got it from Anna Maria Donadoni, who was a conservator at the Turin Museum of Egyptology.  As Dan said, it is highly probable that an expert like her was correct about this information, BUT that doesn’t mean this was the case for the Shroud !  And I should also say that I’m not sure if it was her who told Rogers about Pliny the Elder.  In fact, I doubt that it was her.  Instead, I think Rogers found this info by himself while doing documentary researches about Saponaria.  I remember that Thibault once told me that Rogers have found this in an old Encyclopedia.\n\n","date":"August 19, 2012 at 7:23 pm","url":"https://shroudstory.com/2012/08/19/who-was-wrong-ray-rogers-or-pliny-the-elder/","cat":"history","id":"comment-15229","author":"Yannick Clément","site":"shroudstory"},{"title":"Who was wrong? Ray Rogers or Pliny the Elder?","post":"I would like to make one more comment in order to make sure people understand my point of view perfectly well :\nRogers thought saponaria would be a logical choice of detergent for the final washing of the cloth because he thought Pliny the Elder mentioned it (which appear to be false) and also, because this saponaria would have probably produced a weak florescence pretty much like we see on the non-image areas of the Shroud.  Nevertheless, it’s important to note that it’s not because Pliny never mentioned the use of saponaria for washing ancient cloths that this product was never used at the time !  It’s important to make this difference.  Since the use of Saponaria was confirmed to Rogers by an expert in this field (Anna Maria Donadoni, who was a conservator at the Turin Museum of Egyptology), I don’t think there’s good reason to doubt this idea.  But the question remind open :  Was it really saponaria that was used to wash the Shroud or another detergent ?  Until now, nobody can answer this question for sure.  It’s also important to note that other reasons could explain the weak fluorescence of the non-image areas of the Shroud and that’s where Stéphane Mottin’s hypothesis gets all his strength!  Effectively, for him, it is the presence of a deposit of pectine on the top-surface of the Shroud that have caused this weak fluorescence and not the use of a particular detergent during the final washing of the cloth.  It’s a very interesting hypothesis because 1- Adler has already found the presence of pectines deposits on the Shroud and 2- This kind of deposits could well be a major part of the thin layer of impurities proposed by Rogers.  \nIt would be great in a near future if more researches could be done versus this confirmed presence of pectine deposits on the fibers of the Shroud versus the question of the weak fluorescence of the non-image areas of the Shroud and also versus the 2 major hypotheses of Rogers concerning the image chromophore and the body image formation.\nQuestion for all of you :  Would that be possible that Stéphane Mottin (a somewhat obscure Shroud researcher from France) would have found the KEY to unlock the mystery of the Shroud of Turin???  I think this question deserve some serious thoughts.  When you put his hypothesis together with the works of Rogers and Adler (in particular), it’s VERY INTERESTING !\n\n","date":"August 20, 2012 at 10:54 am","url":"https://shroudstory.com/2012/08/19/who-was-wrong-ray-rogers-or-pliny-the-elder/","cat":"history","id":"comment-15262","author":"Yannick Clément","site":"shroudstory"},{"title":"Who was wrong? Ray Rogers or Pliny the Elder?","post":"At least linen was bleached.\nIn the article “Microscopic and Macroscopic Characteristics of the Shroud of Turin Image Superficiality”, Journal of Imaging Science and Technology® 54(4): 040201–040201-8, 2010, one can read :\nNo references to the use of starch in antiquity have been found.\n\n","date":"August 20, 2012 at 4:26 pm","url":"https://shroudstory.com/2012/08/19/who-was-wrong-ray-rogers-or-pliny-the-elder/","cat":"history","id":"comment-15293","author":"anoxie","site":"shroudstory"},{"title":"Who was wrong? Ray Rogers or Pliny the Elder?","post":"This is pure Anti-Rogers bull**** from Fanti and his clique.  And nevermind what Fanti’s dream, starch was effectively found on the fibers from the Shroud on more than one occasion…  \nWhat you need to understand is that Rogers didn’t invent the use of starch during Antiquity to make linen cloths !  This information, like the other information that Saponaria was often used to wash the final cloth, was given to him by an expert in this field, who’s name is Anna Maria Donadoni, who was a conservator at the Turin Museum of Egyptology.  I don’t see any good reason to doubt these 2 facts, i.e. that starch and saponaria was often used in Antiquity to make linen cloths…  I don’t see any good reason to doubt these facts except if you really want to destroy Rogers credibility at all cost !  This is how Fanti and other anti-Rogers persons in the Shroud world acts and it’s disgusting.\n\n","date":"August 20, 2012 at 4:58 pm","url":"https://shroudstory.com/2012/08/19/who-was-wrong-ray-rogers-or-pliny-the-elder/","cat":"history","id":"comment-15297","author":"Yannick Clément","site":"shroudstory"},{"title":"Who was wrong? Ray Rogers or Pliny the Elder?","post":"A very rapid internet search was enough to find this reference from a website specialized in herbs (link : http://www.herbs2000.com/h_menu/starch.htm) : “The wheat starch was initially prepared and used by the ancient Egyptians to stiffen cloth as well as while weaving linen and also probably to paste papyrus.”\nTHAT’S EXACTLY WHAT RAY ROGERS WAS SAYING ABOUT THE USE OF STARCH REGARDING THE SHROUD.  Here’s the quote you can find in his book : “The warp yarn was protected with starch during the weaving process, making the cloth stiff.”  Rogers add this : “There is no question but that traces of starch components would be left on the cloth after washing.”\nSo, seriously folks, you can forget this incorrect statement from Fanti et al about starch…  It’s just that M. Fanti knows very well the problem with this finding versus his beloved hypothesis of the corona discharge…  That’s why he don’t want a starch coating on the top-most fibers of the Shroud !  If there is starch and this would be the chromophore, Fanti knows very well that this fact would NOT fit well with the idea that a corona discharge really was the real image formation process that was going on inside the Shroud !!! \nIt’s very important to READ BETWEEN THE LINES WITH FANTI…\n\n","date":"August 20, 2012 at 5:12 pm","url":"https://shroudstory.com/2012/08/19/who-was-wrong-ray-rogers-or-pliny-the-elder/","cat":"history","id":"comment-15299","author":"Yannick Clément","site":"shroudstory"},{"title":"Who was wrong? Ray Rogers or Pliny the Elder?","post":"Don’t worry, I can read, and this [postulate of unlikely forms of energy] is what Rogers called “goal-directed pseudoscience”. Result is damage to the credibility of studies on the Shroud.\n\n","date":"August 29, 2012 at 4:26 am","url":"https://shroudstory.com/2012/08/19/who-was-wrong-ray-rogers-or-pliny-the-elder/","cat":"history","id":"comment-15553","author":"anoxie","site":"shroudstory"}]
