[{"title":"Why was the Shroud hidden in a monastery during WWII?","post":"I always thought this story would make a fantastic book.  Think Indiana Jones beating the Nazis to the Ark of the Covenant.  I read an article that told how Hitler’s storm troopers came to this monastery looking for the Shroud…no doubt after applying some enhanced interrogation techniques on authorities in Turin.  The story goes that the Shroud was kept in a special space hidden inside the altar.  When the troops arrived, all the monks gathered around the altar to pray.  The troops ransacked the monestary but decided not to bother the monks praying around the altar…the exact place where the Shroud was hiding covered by the altar and the prayers of the monks.  Somebody please turn this into a book!\n\n","date":"July 30, 2012 at 9:34 am","url":"https://shroudstory.com/2012/07/30/why-was-the-shroud-hidden-in-a-monastery-during-wwii/","cat":"history","id":"comment-14324","author":"Shroud Encounter","site":"shroudstory"},{"title":"Why was the Shroud hidden in a monastery during WWII?","post":"Haha yes! maybe into a movie also; “Indiana Jones and the quest for the Shroud”, lol….\nAnyways, I have seen a documentary on the History channel on the Spear of Destiny. The Nazis actually confiscated it from the museum in Vienna during the war and because so, the Shroud had been moved and hidden for that specific reason mostly, and most likely also for protection from bombing. I wish I could remember the name of the documentary as it was very interesting and went pretty deep into scientific studies on the spear, which apparently has a nail (presumably from the cross) incorporated into it. But more intriquing; they found at the base of the lance the Christian fish symbol etched into it. Unfortunately no c14 dating was allowed and the museum unbelievably had cleaned the lance in the early 70’s basically making it impossible to actually study it in more depth.\n\n","date":"July 30, 2012 at 10:00 am","url":"https://shroudstory.com/2012/07/30/why-was-the-shroud-hidden-in-a-monastery-during-wwii/","cat":"history","id":"comment-14325","author":"Ron","site":"shroudstory"},{"title":"Why was the Shroud hidden in a monastery during WWII?","post":"The Shroud was sent south to the monastery of Montevergine at Avellino on the outbreak of hostilities as early as September 1939.  Only four of the monks at the monastery knew the identity of the artifact they were hiding.  \nThe Allied landing on mainland Italy occurred in September 1943.  The American forces went up the main highways 6-7 on the west coast from Napoli to Rome; Freyberg’s British forces went up on the Adriatic coast, but soon came to a halt because of the difficult terrain.  The Americans came to a halt at the Gustav line, the Axis winter defence position.  The Germans had announced that they would not occupy the monastery at Monte Cassino, despite its excellent strategic position.  However from Allied aerial reconnaissance reports, it seemed that there was some German occupation of the Cassino monastery.  On the basis of these reports, the American air force bombarded and destroyed. this monastery which had been founded by St Benedict in the 6th c,  The destruction of this historic monastery became hotly debated in the aftermath of the war, but was said to have been justified because of the potential German threat that the monastery posed.  As it was, the Germans were able to take advantage of better cover in the ruins than they had before the bombardment.  \nI recall discussing the issue many years ago with a NZ war veteran who had been at the Cassino engagement.  He was insistent that new tyre marks would appear overnight connecting the monastery with the known German positions, and he obviously considered the action justified. \nIt is most fortuitous that the decision was made to send the Shroud much further south to Avellino, than the fortress-like monastery of Cassino.\n\n","date":"July 30, 2012 at 6:03 pm","url":"https://shroudstory.com/2012/07/30/why-was-the-shroud-hidden-in-a-monastery-during-wwii/","cat":"history","id":"comment-14340","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Why was the Shroud hidden in a monastery during WWII?","post":"Dave,  Thanks for that bit of history and perspective.  I found the original articles online but would love to read the entire interview given to Diva e Donna magazine by Rev. Andrea Davide Cardin, the librarian at the Abbey. He was also interviewed by Le Stompa newspaper around that same time.  The online articles are all published around April 8, 2010.\n\n","date":"July 30, 2012 at 6:36 pm","url":"https://shroudstory.com/2012/07/30/why-was-the-shroud-hidden-in-a-monastery-during-wwii/","cat":"history","id":"comment-14341","author":"Shroud Encounter","site":"shroudstory"},{"title":"Why was the Shroud hidden in a monastery during WWII?","post":"It wouldn’t be a surprise that Hitler wanted it.  He was an embarrassment to Germans everywhere, and my family is half German and had a truly sick obsession with these things to try to increase his power and rule.  Thanks daveb for the short history lesson.\n\n","date":"July 30, 2012 at 7:22 pm","url":"https://shroudstory.com/2012/07/30/why-was-the-shroud-hidden-in-a-monastery-during-wwii/","cat":"history","id":"comment-14344","author":"Andy Weiss","site":"shroudstory"}]
