[{"title":"EWTN Series on the Shroud of Turin","post":"Wayne Philips in Part 2 of “Carbon dating….” says that NATURE is not peer-review and is “a regular magazine”. Certainly, he could not be more wrong…….\n\n","date":"September 12, 2012 at 5:32 pm","url":"https://shroudstory.com/2012/09/12/ewtn-series-on-the-shroud-of-turin/","cat":"history","id":"comment-16203","author":"Gabriel","site":"shroudstory"},{"title":"EWTN Series on the Shroud of Turin","post":"Wayne Philips in Part 3 “New discoveries…”:«2012 science says that some type of reaction formed the image». I think that he should make a clear distinction between his points of view and those of “2012 science”.\n\n","date":"September 12, 2012 at 6:04 pm","url":"https://shroudstory.com/2012/09/12/ewtn-series-on-the-shroud-of-turin/","cat":"history","id":"comment-16204","author":"Gabriel","site":"shroudstory"},{"title":"EWTN Series on the Shroud of Turin","post":"Wayne Phlips in “Dynamic duo…” announces some inminent contacts by Joe Marino and Barrie Schwprtz with the Archbishop of Turin with the aim to discuss new tests. Is this true? Can anyone provide any information?\nBTW,Wayne, Oviedo is far away from the Pyrenees.\n\n","date":"September 12, 2012 at 6:52 pm","url":"https://shroudstory.com/2012/09/12/ewtn-series-on-the-shroud-of-turin/","cat":"history","id":"comment-16206","author":"Gabriel","site":"shroudstory"},{"title":"EWTN Series on the Shroud of Turin","post":"What I told Dr. Phillips is that Barrie was going to try and schedule a meeting with the archbishop on one of Barrie’s overseas trips.\n\n","date":"September 12, 2012 at 8:43 pm","url":"https://shroudstory.com/2012/09/12/ewtn-series-on-the-shroud-of-turin/","cat":"history","id":"comment-16207","author":"Joe Marino","site":"shroudstory"},{"title":"EWTN Series on the Shroud of Turin","post":"It appears that because of new information over the last 10 years that we now have brought the shroud into a more believable arena for many folks and while we cannot say without a shadow of a doubt we can not say with any certainty that is is not the shroud of Jesus either.  So yes to me a takes a small leap of faith and when other religions try to challenge me on the passage about having Icons of any kind in our churches it is much easier to say we do have more historical information to say these are not merely images made to reverence but that they can be factual since we now can put a face of God of the second person of the trinity.  Where as the Gods in ancient times had never truly existed and were images created and given authority often from the rulers of their tribes or Kingdoms.  I continue to pray that many learned people continue to probe not because my faith is weak and needs this information to worship; bit rather because it is neat to see the worlds reactions as we grow in knowledge that this can be for some evidence of Jesus Christ’s existence and give more credit in an unbelievable un encountering world.\n\n","date":"September 21, 2013 at 10:21 am","url":"https://shroudstory.com/2012/09/12/ewtn-series-on-the-shroud-of-turin/","cat":"history","id":"comment-44965","author":"Midget","site":"shroudstory"}]
