[{"title":"Fascinating Account of a 2800 Year-old Cloth","post":"In this post, what we see is that C14 is used in combination with other isotopic/trace elements techniques to jointly address the issue of age and origin.\nHowever, in the case of the Shroud, at some point in mid 80’s it was decided to analyze the Shroud using EXCLUSIVELY C14 while ruling out a combined approach with other techniques aiming at elucidating its geographical origin.\nSome solid and rigorous scientific proposals in this line  were completely ruled out and forgotten.\nFurthermore, since late 80’s the scientific developments in this field have clearly shown the shortcomes and limitations of the radiocarbone methodology when applied to a cloth like the Shroud.\nOn the other hand, since the 80’s research on other isotopes and trace elements or more generally, geographical origin, has experimented very important developments.\nAfter the years, we can only speculate where we could be if in parallel, both research lines had been adopted and research on the Shroud could have benefited of all the advances about geographical origin.\nAlso, we can only speculate on the reasons why in mid 80’s, the C14 technique was chosen as the main way to conduct research on the Shroud.\n\n","date":"September 30, 2012 at 11:57 am","url":"https://shroudstory.com/2012/09/30/fascinating-account-of-a-2800-year-old-cloth/","cat":"history","id":"comment-17083","author":"Gabriel","site":"shroudstory"},{"title":"Fascinating Account of a 2800 Year-old Cloth","post":"A perceptive comment from Gabriel.  A leading question has to be who benefited most from the decision – the answer is quite clear – it was the C14 laboratories promoting their new technique.  To some small extent it has back-fired on them, with the credibilty and limits of the new method being seriously questioned, more particularly by sindonologists, possibly not as much as it should be by others. \nUntil such time as a thorough analysis of what went wrong with ignoring the testing protocols in the mid-80s is carried out, it seems unlikely that the Vatican and Turin are unlikely to agree to any further testing for quite some considerable time.  Even the 1978 STURP exercise had to be hastily managed with various set-backs as is evident from the Barrie Schwortz recent posting.  In the meantime, I rather feel that Shroud science is going nowhere!  We will remain in our present state of ignorance concerning the Shroud for very many years to come.  Whether there’s anything else in the Ray Rogers’ archive legacy that can be pursued in the meantime, is about the only other scientific resource that can now be explored.\n\n","date":"September 30, 2012 at 3:43 pm","url":"https://shroudstory.com/2012/09/30/fascinating-account-of-a-2800-year-old-cloth/","cat":"history","id":"comment-17086","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Fascinating Account of a 2800 Year-old Cloth","post":"I also think it is quite clear who would ‘benefit’ from the decision to eliminate any alternative testing… The AMS labs ofcourse; New to the scene, in desperate need of funding, and already established as not as precise a method as other methods of testing, (presently existing in their time). Substantial pre-testing of the AMS system was performed in the early to mid 80’s and many ‘shortcomings’ from these preliminary tests arose…Especially hugely erroneous and widespread datings and with no conclusions as to thier cause!!…yet the decision was made to scrap all other relevant testing and go exclusively with the AMS testing system…(?)\nI have heard it expressed many, many times by scientists, archaeologists, scholars etc; etc; “If one has results of 99 tests which are in favour of authenticity, and only one which is not, one would not throw out the 99 and accept the one, but examine the one which is not in favour, to determine the possibility of error.” …Does this not describe the situation ‘precisely’ in the case of the Shroud? Ten years of extensive scientific study was thrown out in favour of a single unproven, erroneous carbon dating testing method! …I find myself slightly amazed that the Vatican and/or the Turin Archdiocese could have fallen into this trap, they are not idiots, yet they agreed to eliminate any STURP proposed testing (which I believe would have found almost unanimously the c14 dating at question), but futhermore, eliminated all pre-set protocols for the actual c14 procedure. Leaving us in the present position of limbo when it comes to the authenticity of this Shroud….Unbelievable!\nUnfortunatley Daveb, I must disagree that it has back-fired on them, as 24 years later, many people still believe that c14 is infallible and has proven the Shroud a fake, and this ‘unbelievably’ includes some of the upper scientific community.\nR\n\n","date":"September 30, 2012 at 8:55 pm","url":"https://shroudstory.com/2012/09/30/fascinating-account-of-a-2800-year-old-cloth/","cat":"history","id":"comment-17094","author":"Ron","site":"shroudstory"},{"title":"Fascinating Account of a 2800 Year-old Cloth","post":"I agree with you, Ron. I would also add that many members of the Shroud community are in 2012 still asking for a new C14 test!\n\n","date":"October 1, 2012 at 2:33 am","url":"https://shroudstory.com/2012/09/30/fascinating-account-of-a-2800-year-old-cloth/","cat":"history","id":"comment-17106","author":"Gabriel","site":"shroudstory"},{"title":"Fascinating Account of a 2800 Year-old Cloth","post":"Gabriel thats true, and they are completely wrong in their thinking. What they should be asking, is for the ‘proposed testing’ made by STURP in 1988, or the so called STRPII, basically non-destructive testing. But of course updated to more modern procedures and newly available testing methods. Until the problem of ‘contamination’ can be solved, a new radiocarbon dating should be placed on the back-burner. Hopefully within our lifetime, a much better method of dating will be found.\nI cannot for the life of me understand the Vatican’s reluctance in allowing further testing in this manner, excluding c14 of course. What could possibly be the reasoning? Unless of course they like the fact millions still believe the Shroud is a fake and millions more do not even know it exists.\nR\n\n","date":"October 1, 2012 at 3:59 am","url":"https://shroudstory.com/2012/09/30/fascinating-account-of-a-2800-year-old-cloth/","cat":"history","id":"comment-17109","author":"Ron","site":"shroudstory"},{"title":"Fascinating Account of a 2800 Year-old Cloth","post":"My comment above – daveb: “Until such time as a thorough analysis of what went wrong with ignoring the testing protocols in the mid-80s is carried out, it seems unlikely that the Vatican and Turin are unlikely to agree to any further testing for quite some considerable time.”\nRon comment:  “I cannot for the life of me understand the Vatican’s reluctance in allowing further testing in this manner, [excluding c14 of course]” \nIt is quite plain why the Vatican and other authorities involved would be reluctant to permit any further testing in the foreseeable future.  The present time is clearly inappropriate. With few exceptions, anyone involved in the testing and sampling does not come out of it at all well.  Poor decisions were made throughout, and each seem to have had their own agenda.  With this experience, it is only too plain that the objectivity of a proper scientific approach was abandoned, and it suggests that personal egos had too significant a role.  The Shroud needs to be approached with a humility that is only too rare in the present climate, and that certainly seems to apply to the present scientific climate, if the 1988 experience is any indication. \nAnyone wishing to comment on any scientific testing of the Shroud should first read the 30 page paper “The setting for the radiocarbon dating of the Shroud” by Emanuela Marinelli, Valencia, April 2012.  http://www.shroud.com/pdfs/marinelliv.pdf  \nSample extracts:\n[synopsis] “The method of radiocarbon dating, performed in 1988, placed the origin of the Shroud between 1260 and 1390 A.D.; but the reconstruction of the events that led to that analysis, and the controversy following its course, throw heavy shadows on the validity of the result. Not all the procedures followed for the completion of the radiocarbon test were regular. The history of the events and of the traumas suffered by the relic make it a difficult object, whose radiocarbon dating cannot provide reliable data. The analyzed sample, because of its peculiar characteristics, was not representative of the whole sheet. Consequently, according to the radiocarbon dating it cannot be definitely stated that the manufacture of the Shroud should be placed in the middle of the fourteenth century.” \n[Comments by Gove] ” … who emphasized seven points of difference from the original protocol of 1986: 1. The laboratories are reduced from seven to three. This eliminates the possibility of detecting a mistake made in the measurement by one or more of the three laboratories. Such mistakes are not unusual. 2. The use of the two dating methods has\nbeen reduced to one. 3. The amount of cloth that each laboratory will receive has been\ndoubled. With this further material other laboratories could be included. 4. Representatives of the laboratories will not be allowed to observe the sampling. 5. The samples will not be\nunravelled, and thus that of the Shroud will be more easily identifiable. 6. The Pontifical\nAcademy of Sciences was unaccountably excluded. 7. The acknowledged textile expert\nselected to remove the sample was replaced by an unnamed person.”\n[Gove continues] “… All these unnecessary and unexplained changes unilaterally dictated by the Archbishop of Turin will produce an age for the Turin Shroud which will be vastly less credible than that which could have been obtained if the original Turin Workshop protocol had been followed. Perhaps that is just what the Turin authorities intend.”  \nAnd there’s much more in Marinelli’s paper!\n\n","date":"October 2, 2012 at 4:12 pm","url":"https://shroudstory.com/2012/09/30/fascinating-account-of-a-2800-year-old-cloth/","cat":"history","id":"comment-17167","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Fascinating Account of a 2800 Year-old Cloth","post":"Dave, I’m not speaking of c14 testing, I can clearly understand the reluctance to issue another radiocarbon test, and for several reasons. Mind you I find the Turin Archdiocese or whomever was reponsible for handling the whole thing back in 1988, equally at fault, they had the final decision in the matter! Am I not correct in this statement?…But, I am speaking of the proposed STRPII tests, which were never done in 1988 but dropped and which should have accompanied or precluded the c14 testing. There is no reason these tests cannot go forward, but ofcourse with much better control and tracking of any evidence or material. I have stated my belief that it is not the time for another c14 as yet, but many other non-destructive testing can and should be done, the Vatican’s reluctance to do these is to me the mystery.\nBTW Merinelli’s paper brings really nothing new to the story, most all issues mentioned in this paper have been researched from many other papers and books written. But still a good paper for those who have not studied the issues before.\nR\n\n","date":"October 2, 2012 at 5:37 pm","url":"https://shroudstory.com/2012/09/30/fascinating-account-of-a-2800-year-old-cloth/","cat":"history","id":"comment-17170","author":"Ron","site":"shroudstory"},{"title":"Fascinating Account of a 2800 Year-old Cloth","post":"I feel that with the background of the 1988 C14 tests, there would be concerns that any further testing of whatever kind, whether it be STURP II, C14, or anything else would make the controlling authorities reluctant to be involved in exposing the Shroud to any further acrimony.  Despite all our scientific advances, there appears to be a deficit in the maturity required to come to an objective consensus on what should be done.  The apparent egoism then evident was not merely because it was C14 to be tested, but arose from personal agendas which might well be true of any kind of proprietal testing from whatever quarter.\n\n","date":"October 2, 2012 at 9:39 pm","url":"https://shroudstory.com/2012/09/30/fascinating-account-of-a-2800-year-old-cloth/","cat":"history","id":"comment-17175","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Fascinating Account of a 2800 Year-old Cloth","post":"You may be right Dave, but here’s the thing; From thier ‘restoration’ of the Shroud in 2002, they have basically everything that is needed to run a series of tests! As apparently, they vacuumed the complete Shroud, removed all charred areas (and most likely abit of uncharred threads most likely) and they have allowed ‘certain’ people minimal access to the Shroud for their own study purposes. Now with that in mind and them knowing quite well there was no scrupulous dealings from the actual STURP crew, and also they are very aware that refined scientific tests are available now, where the Shroud does not even have to be touched to get an extreme amount of information from it..Also, they should be aware, that they themselfs were partly at fault and had made some very seriously bad decisions back then, which led to all the issues. Have they not learned from their mistakes? Do they not have the means to put together a team of scientists and protocols to finally put an end to some questions here? Questions such as to the pollen or the arogonite dirt, or to the chromophore etc; I think it’s time these questions were answered. \nBut thats just me ;-)\nR\n\n","date":"October 3, 2012 at 6:24 am","url":"https://shroudstory.com/2012/09/30/fascinating-account-of-a-2800-year-old-cloth/","cat":"history","id":"comment-17182","author":"Ron","site":"shroudstory"},{"title":"Fascinating Account of a 2800 Year-old Cloth","post":"Sorry: “Ron, put yourself on the Church’s shoes” not “feet”:-)\n\n","date":"October 3, 2012 at 7:44 am","url":"https://shroudstory.com/2012/09/30/fascinating-account-of-a-2800-year-old-cloth/","cat":"history","id":"comment-17186","author":"Gabriel","site":"shroudstory"},{"title":"Fascinating Account of a 2800 Year-old Cloth","post":"Ron, put yourself on the Church’s feet: If you had all the material vailable, as you correctly state, and a large amount of of Catholic universities, research institutions and experts you can trust 100%, what would you do?\nI wouldn’t be surprised at all if the Vatican had carried out a whole set of experiments at not made results public. For the Catholic church, her most important error was that she lost control of the tests and the way they were made public. Now they have the chance of conducting tests without the pressure of public opinion and release little by little all the information, at their own rythm and for their own religious purposes (not for example to promote C14 labs).\nThe design of the (unexpected)  2010 exhibition in Turin and the current exhibition in Malaga are clearly pro-authenticity and use this not as a stand-alone scientific fact, but in the frame of the Church’s evangelization purposes.\nThat is exactly the management I would expect, if the Church had carried out additional tests on her own devices.\nAdditionally, they must have noticed the never ending stream of books, ENEA reports and long etc and in my view, this is more than enough for them not allowing any additional test.\n\n","date":"October 3, 2012 at 7:24 am","url":"https://shroudstory.com/2012/09/30/fascinating-account-of-a-2800-year-old-cloth/","cat":"history","id":"comment-17185","author":"Gabriel","site":"shroudstory"}]
