[{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"Surely the important point is that any serious study of the texts describing or failing to describe the variety of cloths with or without images, purporting to be the living face of Christ or not, can only be done by someone with a in-depth knowledge of the Greek original texts. What surprises me about Wilson is that although he has been apparently working in the field since 1978, e.g. 34 years, there is not a hint in any of his works that he has bothered to learn Greek in all this time. i may be wrong but if he does know Byzantine Greek he conceals his learning carefully.\nAs the Byzantine scholars who have bothered to work on the Shroud texts have also shown there are also spectacular misinterpretations or distortions of the original texts by members of the Shroud community.The response seems to be to rubbish the academics, partly ,of course, because few from the Shroud community have the academic skills to challenge them. So sadly the debates which might be productive end in angry stalemate .\n\n","date":"June 30, 2012 at 5:32 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13202","author":"Menedemus","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"You forget Menedemus that even most all of the Byzantine scholars, themselfs are at odds with much of the interpretations…So your point is mute. Wilson on the other hand, doesn’t need to understand Byzantine Greek as he uses Byzantine scholars to do this work, …again your point is mute. One does not have to be an historian or a scholar to understand simple things like why the Shroud of Christ ‘IMAGE’ was not mentioned in scriptures or by early church fathers, atleast not openly mentioned. One also does not need much of a brain to understand why the Image of Odessa showed an ‘alive’ eyes-open Jesus; Have you looked at the Shroud face image in natural form lately? It could easily be misinterpreted that the eyes are open or the blood traces NOT recognized as blood at all. The article above claims, in so many words, that the science put forth by many of the STURP scientists is “pseudoscience”, funny how peer-reviewed papers are so easily dismissed as pseudoscience in this case. What about the pseudoscience of the c14 dating? It wasn’t even properly peer-reviewed, yet the anti-shroud crowd will use it as if it was carved in stone, plus I know of no scientists or peer-reviewed papers written that oppose the so call pseudoscience peer-reviewed papers, put forth by STURP….It appears to me, the “anti-Shroud crowd” seem to be edging ever so close too hypocrisy.\nR\n\n","date":"June 30, 2012 at 1:07 pm","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13223","author":"Ron","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"Ron. ‘Wilson on the other hand, doesn’t need to understand Byzantine Greek as he uses Byzantine scholars to do this work, …’\nWell ,so long as no one takes him seriously as an original scholar and he does not distort or misrepresent what the scholars actually say that is fine. But  I have yet to hear of any Byzantine scholar who endorses his view that the Shroud of Turin is the same as the Image of Edessa. The problem is that be seems to go far beyond the cautious findings of Byzantine scholarship and develops theories largely on his own initiative.\nRon : “One does not have to be an historian or a scholar to understand simple things like why the Shroud of Christ ‘IMAGE’ was not mentioned in scriptures or by early church fathers, atleast not openly mentioned.”\n I beg to differ, Ron. These seem to be to be very complex scholarly issues- the world of early images, as no doubt you will know from your close reading of the work of Hans Belting- is a  very difficult area.\nI don’t think the ‘antiShroud community’ as you persist in calling them, insist that the Carbon14 dating is carved in stone. Most of them are independent scholars and have the natural caution of scholars. A typical position might be be that a medieval dating (perhaps some decades earlier than 1250 if there was genuine contamination that affected the date)  is the most likely possibility but needs further work on it.  As  I understand Christopher Ramsey from Oxford  ,et, al, it is that there is enough debate to justify a re-resting but Ramsey still, as I understand  it, thinks a medieval date will be the result again. The issue rather is that no one has come up with any evidence that a renewed Carbon -14 dating is likely to come up with a first century dating.Until they do, a preferred date somewhere in the Middle Ages is likely to have most of the scholarly consensus, not because these scholars are rabid atheists but because they are scholars working on the balance of probabilities from the evidence they have.\n\n","date":"July 1, 2012 at 4:25 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13256","author":"Menedemus","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"The second and the last part of what I have to say on the matter:\nhttp://deumvidere.blogspot.co.uk/2012/06/more-on-heresies-and-why-they-persist.html\nAll the best to everyone!\n\n","date":"June 30, 2012 at 8:22 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13207","author":"Davor Aslanovski","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"Dag, I had to look it up…Exoheretic\nA person who dreams up hypotheses that markedly differ from the theories of a particular discipline in science and who works outside of the discipline\n\n","date":"June 30, 2012 at 10:46 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13214","author":"Andy Weiss","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"Perhaps he would like to take a stab at explaining the knowns about the Shroud (like in the Valencia list or others)?  There have been many experts who have worked within there fields of expertise to explicate much about the Shroud.  Knowing this, it sounds like whining.\n\n","date":"June 30, 2012 at 10:51 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13215","author":"Andy Weiss","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"” He is often aware that experts have refuted some of his claims, but refuses to change his mind – because these experts are generally not very inspiring to him.”\n¿Qué expertos?.\n\n","date":"June 30, 2012 at 12:44 pm","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13220","author":"corneliotel","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"I think the correct description of Wilson is this one :  A guy who suffered the Dan Brown syndrome before Dan Brown himself !!! ;-)  And the most incredible thing about Wilson is exactly what Aslanovski have written :  That a bunch of Shroud scholars have given full credit to his hypotheses that are almost only based on (in many cases, very bad) speculations, extrapolations and special assumptions !  That’s the most incredible thing in my mind.\n\n","date":"June 30, 2012 at 3:45 pm","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13232","author":"Yannick Clément","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"“Their skepticism, rationalism, and agnosticism, mentioned above, is in fact repulsive to him, and, to a great degree in deliberate opposition to them, he chooses to believe.” —I wasn’t aware that believing was something one could choose to do.\n\n","date":"June 30, 2012 at 5:06 pm","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13238","author":"JB in CA","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"Choosing rationally to believe (just based on so-called “evidences” that one can claim to be the testimony of the apostles or, for some, even the Shroud of Turin) is one level of faith.  But I don’t think it’s the highest…  But what is great is this : When someone’s faith come only on rational thinking, sometimes the Holy Spirit come and push this person’s faith to a next level.  Sometimes also, it is simply the events of his life who’ll do this job.  All this is mysterious and hard to judge.\n\n","date":"June 30, 2012 at 5:18 pm","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13239","author":"Yannick Clément","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"Error.  You must read : “When someone’s faith rest only on rational thinking…”  Sorry…\n\n","date":"June 30, 2012 at 5:19 pm","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13240","author":"Yannick Clément","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"I trust that DA has had “the last part he has to say on the matter”, as despite his extensive verbiage he has contributed nothing to our understanding of the Shroud.  He may return to his ivory tower where no doubt a trail of sycophants may admire his further efforts on Byzantine scholarship, and other such related topics. \nHis tirade contains gross errors, subjective judgements presented as fact, and contradictions.  The one true scientist he mentions in his catalogue of scholars, Galileo, had nothing to say on the Shroud that is recorded.  Furthermore his treatment of the Galileo case is superficial;  the matter was much more complex than his invented categories of exoheretics and endoheretics allows.  Galileo’s error was essentially an error of political judgement.  He had won acclaim from fellow scientists, church, popes and cardinals for his discoveries.  His casting of Simplicio as the protagonist of the Ptolemaic system was widely seen as an ungrateful lampooning of his former patron Pope Urban VIII.  The Dominican inquisitors with their commitment to Thomistic philosophy had a vested interest in presenting newly discovered works of Aristotle, which were contradicted by the new physics.  The critical document that condemned Galileo is now widely seen as fraudulent, or the best that might be said for it was that it may have been some clerk’s draft that Bellarmine had in fact rejected. \nThe catalogue of “experts” listed by DA are essentially all historians of one type or another, and they are the ones who must deal with it.  There are no physicists, chemists nor botanists, no Max Frei, no David Willis, no Pierre Barbet, no Jackson, no Fanti, no Ray Rogers, no etc.  He gives no indication that he is aware of the disciplina arcani prevalent in the pre-Constantine early church that constrained specific mention of the sacred. \nHe claims that the relic has no known history prior to the 14th century.  He overlooks the Hungarian Pray manuscript of ~1192, he ignores the complaints made by the Patriarch of Constantinople to the Pope on the Crusaders’ theft of the burial cloth, nor does he mention Robert de Clari comments ~1203.  Lamentation scenes depicting the burial of Christ became prevalent and predate the 14th century.  \nThe appearance of the Vignon markings on early iconography and coinage could have had only one origin, the marks that we now see on the Shroud.  Any attempt to dismiss Wilson’s hypothesis must deal with this objection, and so far none have been successful, not even those by Yannick Clement, despite his strenuous efforts.    \nI might continue, but unlike cloistered academics, I have better things to do with the time  allotted to me.\n\n","date":"June 30, 2012 at 5:24 pm","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13241","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"DaveB. The single description we have from Robert of Clari of the Shroud on the Blachernae Chapel is not precise or accurate enough to day that it is the Turin Shroud, rather than one of the many other burial cloths of the period.  (There  was even another in Constantinople itself- the cloths in the Pharos Chapel!) The most we can say is that ‘ there is a possibility that this was the Shroud but we would need to know more’- a reference to a double image would be a help, of course.\nThe real problem is that we have no references to this Shroud from Constantinople sources itself when we do have a lot of documentation about many other prestigious relics of the city. The implication is that this was not considered by the hierarchy of Constantinople itself a very important relic. IT could possibly be that that it is the Shroud of Turin but was simply not given much importance. The elevation of the Shroud of Turin  as a major relic is a twentieth/ twenty-first century phenomenon,of course. Burial shrouds ranked pretty low down in the hierarchy of relics of the Passion in the medieval period.\n\n","date":"July 1, 2012 at 4:40 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13258","author":"Menedemus","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"On the contrary Menedemus, deClari’s description is very telling whereas “the Sindon is raised showing the “figure” fo our lord. Figure being an interpretation argued but in all likeliness correct, meaning it was a full body image. Fold marks found using raked light by Dr Jackson et al, have basically shown to little opposition that the Shroud had been raised on a ‘platform’ showing most probably from the waist up. I don’t recall anyother burial cloths being mentioned in Constantinople at the time or specifically in the Pharos Chapel. But if there was, a figure was not mentioned, except possibly the face image on the Mandylion, which by the way no one had mentioned seeing, only the box in which encased it.I won’t argue there may have been several other cloths pertaining to the lord, but what were they? No mention is clear.\nR\n\n","date":"July 1, 2012 at 8:33 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13271","author":"Ron","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"\nMenedemus :Ron. ‘Wilson on the other hand, doesn’t need to understand Byzantine Greek as he uses Byzantine scholars to do this work, …’Well ,so long as no one takes him seriously as an original scholar and he does not distort or misrepresent what the scholars actually say that is fine. But I have yet to hear of any Byzantine scholar who endorses his view that the Shroud of Turin is the same as the Image of Edessa. The problem is that be seems to go far beyond the cautious findings of Byzantine scholarship and develops theories largely on his own initiative.\nRon : “One does not have to be an historian or a scholar to understand simple things like why the Shroud of Christ ‘IMAGE’ was not mentioned in scriptures or by early church fathers, atleast not openly mentioned.”I beg to differ, Ron. These seem to be to be very complex scholarly issues- the world of early images, as no doubt you will know from your close reading of the work of Hans Belting- is a very difficult area.\nI don’t think the ‘antiShroud community’ as you persist in calling them, insist that the Carbon14 dating is carved in stone. Most of them are independent scholars and have the natural caution of scholars. A typical position might be be that a medieval dating (perhaps some decades earlier than 1250 if there was genuine contamination that affected the date) is the most likely possibility but needs further work on it. As I understand Christopher Ramsey from Oxford ,et, al, it is that there is enough debate to justify a re-resting but Ramsey still, as I understand it, thinks a medieval date will be the result again. The issue rather is that no one has come up with any evidence that a renewed Carbon -14 dating is likely to come up with a first century dating.Until they do, a preferred date somewhere in the Middle Ages is likely to have most of the scholarly consensus, not because these scholars are rabid atheists but because they are scholars working on the balance of probabilities from the evidence they have.\nThe ‘Wilson’ hypothesis is one thing, but don’t go talking crap with the c14 dating. YES the anti-shroud crowd take the c14 results as if they were FACT or written in stone, otherwise there would be very few arguments over the Shroud. I could care less what Prof Ramsey has to say has he was part of the original c14 fiasco, why would anyone take his word for anything? You should study radiocarbon dating and the method followed during the 1988 testing in depth, especially if you re-iterate comments as in; “but Ramsey still, as I understand it, thinks a medieval date will be the result again” and “Balance of probabilities from evidence they have” ..What evidence? A screwed up C14 dating? Sorry but the balance of evidence from all reputable studies points this Shroud in the early period of the first mellenium, not Medieval…This ‘other evidence’ is a factor C14 bandwagon folk have dismissed blindly and any scientist or archaeologist in particular would agree is not proper science.\nR\n\n","date":"July 1, 2012 at 8:54 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13272","author":"Ron","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"\nRon :\nOn the contrary Menedemus, deClari’s description …\nR\n\nClari makes no description of the “figure” that he saw. Nothing of the hair, hand positions, nudity, the double figure, the marks of the passion, etc. Talk of a description is pure fantasy.\nWithout a description there is no way of knowing whether what he saw looked like the Shroud of Turin. To draw conclusions to nothing is pure wishful thinking.\n\n","date":"July 1, 2012 at 11:01 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13279","author":"David Mo","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"H but the description that it was ‘raised’ and the term ‘figure’ implys a full body image, not just a face…these were my points. If you had understood that with the mention of the raking light evidence  then you would understand the point I was making. Basically deClari was looking at a full body image period.\nR\n\n","date":"July 1, 2012 at 9:11 pm","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13295","author":"Ron","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"Ron: ‘The balance of evidence from all reputable studies points this Shroud in the early period of the first mellenium, not Medieval.’\n I,for one ,would  love to know where to find this evidence, please give me some clues.\n‘ The early period of the first mellenium [sic] ‘doesn’t get us very far, of course, because the only date that counts is  AD 30 give or take a year or two .\n\n","date":"July 1, 2012 at 12:41 pm","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13285","author":"Menedemus","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"If one accepts the reality of all scientific evidence showing that a actual body was enfolded in the Shroud, and this is quite evident and deduced by many forensic experts and other scientists, I will assume you’ve done your reading and know of whom I speak here. With that in mind; The fact that the victim of the Shroud was crucified in the Roman style, places the victim and Shroud before 340 AD when crucifixion was abolished. (Unless you want to believe some artist first tortured, then murdered a victim and showing absolute forensic knowledge of Roman crucifixion and a method of tranference to the cloth, still not understood by some of our best scientists).\n The stitching on the seam of the Shroud matches almost exactly to stitching found in Masada 70AD and a rare form of stitching to boot. The weave or better stated the style in which the Shroud was weaved is from pre-medieval period loom manufacturing, definatley not medieval. Cloth fibrels found by one of the c14 labs whilst doing their preliminarys, specific to very early first mellenium Syrain/Egyptian cloth…There is other evidence found on the Shroud but is controversial amongst the experts, but which can place the dating much more accurately and also place (pin-point) it’s origin, but I’ll sit tight for now.\nR\n\n","date":"July 1, 2012 at 9:40 pm","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13296","author":"Ron","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"The problem remains that you have to get it to AD 30 give or take a year or two in an age when crucifixion was all too common. Those less convinced about the authenticity can propose any other date since then. \nNo one seems to talk much about the problems of conservation.Is this because very few people working on these blogs know anything about ancient textiles? (This was one of the major criticisms of the STURP team and why  the Shroud should only have been ever examined in a conservation laboratory.) If you do talk to someone who works with textiles  that is pretty well the first thing they raise because once a cloth gets damp or subject to molestation by insects ,etc. it is gone. The Shroud of Turin would be absolutely unique as a survival – it would have beaten all the odds many times over. You don’t get surviving  pieces of cloth this size ( outside the very special case of Egypt) until the Fatimid workshops/looms of the tenth /eleventh centuries.\nAny discussion of where the Shroud might have been and when must tackle this as a major issue- a couple of years in the wrong place and the damage is done.For textile experts, especially those who work in museums, it would be the strongest piece of evidence against the authenticity of the Shroud-  the chances of being kept intact over so many centuries are virtually minimal. Don’t ignore the problem.\n\n","date":"July 2, 2012 at 7:22 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13308","author":"Menedemus","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"There is no problem here. As I mentioned; other evidence (although argued evidence) can place this Shroud in Jerusalem, in tombs surrounding Jerusalem, in particular, basically dating it definately before 69-70 AD, the fall of Jerusalem to the Romans and apparently the end to Jewish tomb burials in Jerusalem till centuries after. There is also evidence which can place this Shroud tentively between 28-36AD. But one must except this evidence. It is obvious more needs to be researched and studied at this point, and there may still be much to be discovered.\nYour “problems” with the conservation of the Shroud for millenia is in total error, obviously from a total ignorance of linen, as in it’s known endurance and longevity. You should really study on this wondrous material called linen and it’s attributes. If any garment material is too last 2 mellenia it is linen! Especially if encased and cared for, for the most part. Linen “completely unprotected” from the elements has been found in caves dating 15,000 years old, fibrels still intact! Linen will not suffer from insect infestations, linen actually becomes stronger when damp, linen can dispell water and comdensation readily…and on and on…There is a reason linen is the oldest of processed materials ever found, it is simply because it is one material of extreme endurance. Now consider this Shroud being encased for most, if not all of, it’s duration in hardwood caskets…it is not a mystery how it could last till today and in prestine condition.\nR\n\n","date":"July 2, 2012 at 4:16 pm","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13336","author":"Ron","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"Ron, well I just did a very brief search on the exposure of linen and cotton in one scientific report and the summary ran as follows:\n‘Flax and cotton, for example, are very susceptible to attack by bacteria under humid conditions and seldom survive in archaeological environments. All textiles are deteriorated by light, insects, microorganisms, and air pollution which, alone or together, cause considerable loss of tensile strength and pliability. The oxygen in the atmosphere affects all organic substances to varying degrees. Prolonged exposure to normal atmospheric conditions will cause textiles to weaken and disintegrate. The speed of the deterioration varies according to environment and the nature of the fibres’\nI think we would have more examples of ancient linen , outside the very special conditions of Egypt, if it was quite as enduring as you suggest. The Shroud if authentic would be  a real rarity, certainly no similar example is known from the thousand tombs excavated in and around Jerusalem from this date.\n\n","date":"July 2, 2012 at 4:54 pm","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13339","author":"Menedemus","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"Well whomever did that study is in contrast to most known attributes of linen, ‘flax’ fibrels, and does not offer a reasoning for linen found outside of Egyptian tombs dating 8000BC and 13000BC still intact, amongst others. But also proves suspicious as in it is well know ‘scientifically’ that linen is very well NOT suseptible to bacteria, on the contrary it is very well known to fight off bacteria, microorganisms repell insects…So I find that report suspiciously ignorant of known facts. Also it does not deal with well preserved samples, as in encased…..plus the big zinger, yes the Shroud is here and tangible, and atleast 700 years old, how can that be argued….That report is nonsense, period.\nR\n\n","date":"July 2, 2012 at 5:46 pm","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13343","author":"Ron","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"Ron: ‘So I find that report [see the statement from the Laboratory in no.22 above] suspiciously ignorant of known facts.’\nProbably easier, Ron, for you to take up the issue direct with them-they have more experience in these matters than I have. And please don’t argue that because they primarily deal with shipwrecks they are not qualified to comment on flax/linen. it won’t wash. If the Shroud of Turin is authentic, it is the only surviving linen cloth of that size and date from outside very specifically arid conditions such as Egypt or Peru and it is of a weave of which no other first century examples are known.\nHere are the details of the Laboratory that made the report:\n‘The Conservation Research Laboratory (CRL), directed by Dr. Donny L. Hamilton, is one of the oldest continuously operated conservation laboratories that deals primarily with archaeological material from shipwrecks and other underwater sites.  Operating under the Center for Maritime Archaeology and Conservation, CRL plays an important role in the Nautical Archaeology Program at Texas A&M University (TAMU), and works closely with all of the excavation projects of the TAMU-affiliated Institute of Nautical Archaeology.  In fact, students are a big part of the work done at CRL.  It is a great place to gain practical experience in conservation science.\nCRL deals with archaeological projects year-round and consists of two laboratories: one is used primarily to teach conservation classes to students at TAMU; it is also equipped to conduct conservation of small inorganic and organic artifacts.  The second laboratory has recently been enlarged to accommodate bigger projects.  In 1995, we established the Archaeological Preservation Research Laboratory, which is devoted to developing new conservation technologies.\nAll kinds of artifacts are treated at CRL, from those made of iron, copper, brass, or pewter to those of wood, leather, glass, or ceramic.’\n\n","date":"July 3, 2012 at 5:54 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13370","author":"Menedemus","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"“Don’t argue because they primarily deal with underwater finds” ??? LOL. What a preposterous statement. How can you or anyone compare finding ANY element underwater to elements found on or in earth? LOL. Solid oak timbers, most metals etc; will dissolve under water after two thousand years, and we are talking linen here. Please lets keep this reasonable. Again if linen is so susceptable to the elements how does one explain the Shroud, even if one accepts the erroneous C14 dating, taking it back 752 years? Again maybe YOU should study up on flax/ linen and not depend on studies by underwater reasearchers. Did you know the Ancient Greeks used linen as body armour and several samples have been found buried in earth and still intact!.\nR\n\n","date":"July 3, 2012 at 7:06 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13380","author":"Ron","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"Relics woven of linen in the Middle Ages have been reasonably well preserved because they were treated with respect within churches,etc. Before then they are very rare, usually only in fragments that have got caught in very specific dry places (or occasionally waterlogged). It is up to you to provide examples from before 1000 AD if survival is so good  -give me the link please to any one museum, such as the V and A, which has a linen collection from before 1000 AD (other than Egypt, Peru,where the dry preserved it).Even better if you can provide anything the size of the Turin Shroud- the nearest equivalents are the Fatimid workshop textiles of the eleventh century which are similar in size to the Turin Shroud- and even then we only have two good examples.\n I try not to let these discussions become personal but I have worked in similar areas myself for many years and do not need to be treated as if i was some sort of ignoramus. I assume from the way that you speak with such assurance that you are a specialist in these areas but I won’t be convinced until you can actually provide some evidence of your expertise.\n\n","date":"July 3, 2012 at 7:40 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13382","author":"Menedemus","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"Sorry I didn’t get back earlier, I am very busy as late. Furthermore, I don’t have the time to be linking much at the moment but a serious search on your part, yes on the internet, and you will find most if not all of what I mentioned. Quit easily I would add.\nThank-you\nR\n\n","date":"July 12, 2012 at 2:28 pm","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13783","author":"Ron","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"Davor Aslanovky the Ultratoxicorthodox? What? Yes, Ultratoxicorthodox.\nWhat should you call his pseudo-academical, deliberate and self-serving ignorance and omissions?  \nAslanoskism. \nYes.\n\n","date":"July 4, 2012 at 7:03 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13435","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"Sorry Aslanovskism…\n\n","date":"July 4, 2012 at 7:17 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13438","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"Or even better Aslanovskipticism…\n\n","date":"July 4, 2012 at 7:18 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13439","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"DA, an aslanovkipticademics from Deadendland.\n\n","date":"July 4, 2012 at 7:23 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13442","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Wilson the Exoheretic. What? Yes, Exoheretic.","post":"Typo error: “DA, THE aslanovskipticademics from Deadendland”\n\n","date":"July 4, 2012 at 7:53 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","id":"comment-13443","author":"Max Patrick Hamon","site":"shroudstory"}]
