[{"title":"First Reaction: History Channel’s Shroud of Turin: The Real Face of Jesus","post":"I saw the History channel show.  Very interesting to say the least.  I admit I am a fence-sitter on it being the actual burial shroud of Jesus, but I do lean towards the side of it being authentic with everything I have read/seen/heard.\nI wonder if a similar STURP type investigation done today would turn up any additional evidence that may not have been uncovered in the previous examination.\n\n","date":"March 30, 2010 at 11:40 pm","url":"https://shroudstory.com/2010/03/30/abc-good-morning-america-on-tonights-history-channel-shroud-of-turin-special-2/","cat":"history","id":"comment-1201","author":"Todd Jeffreys","site":"shroudstory"},{"title":"First Reaction: History Channel’s Shroud of Turin: The Real Face of Jesus","post":"I was riveted to the t.v. and the unfolding of what very well may have been what Jesus looked like. What transcended that was when the computer screen showed multiple beads of blood pooling on the shroud, which let the viewer witness up-close, the results of the vicious, brutal scouraging/ beatings of his captors. I too grimaced and was saddened at that part but became lighthearted and happy with the final portrait of Jesus.\nThe special was very well done and informative, bravo!\n\n","date":"March 31, 2010 at 1:34 am","url":"https://shroudstory.com/2010/03/30/abc-good-morning-america-on-tonights-history-channel-shroud-of-turin-special-2/","cat":"history","id":"comment-1203","author":"PATRICIA DELACE","site":"shroudstory"},{"title":"First Reaction: History Channel’s Shroud of Turin: The Real Face of Jesus","post":"I noticed something while watching this program and was wondering why it wasn’t touched upon in the special. There are other faces that can only be seen in the negatives. Even then, it takes a keen eye to spot. I’m not talking about the second face on the back of the shroud that has already been explained. This is totally different. It depicts a totally different angle, as if capturing the “spirit” if you will, exiting the body. I have a similar picture taken at a park of someone and it showed 3 images of the same person at different angles, only because the camera moved. I found this EXACT type of image in the negative of the shroud. The image of the face would have to had been traveling in order to create this anomoly. This is no joke, hoax, nor prank. Please contact me.\n\n","date":"March 31, 2010 at 2:24 am","url":"https://shroudstory.com/2010/03/30/abc-good-morning-america-on-tonights-history-channel-shroud-of-turin-special-2/","cat":"history","id":"comment-1207","author":"benjamin","site":"shroudstory"},{"title":"First Reaction: History Channel’s Shroud of Turin: The Real Face of Jesus","post":"Are you a believer?\n\n","date":"April 3, 2010 at 7:39 pm","url":"https://shroudstory.com/2010/03/30/abc-good-morning-america-on-tonights-history-channel-shroud-of-turin-special-2/","cat":"history","id":"comment-1225","author":"Keith","site":"shroudstory"},{"title":"First Reaction: History Channel’s Shroud of Turin: The Real Face of Jesus","post":"I have been a believer of The Shroud for a long time. I liked how the History Channel touched on upon the fact that the carbon14 dating could be wrong (and I truly believe this), because in the 1200’s they had rewoven cloth onto that corner. Also the fact that The Shroud had been handled since the 1400’s by people touching it on that corner from where they took the samples could have contaminated it. That is my belief that The Shroud was either contaminated from people touching it on the corner where they took the carbon14 samples, or new fabric had been rewoven on that corner where they took the samples. Either way, there is pretty compelling evidence that the samples that they did the testing on in 1978 were either contaminated or rewoven fabric. But you don’t hear too much about that. I saw a whole show on the Science Channel how they had rewoven new fabric into The Shroud in certain places in the 1200’s because the weave was different. These scientists need to wake up and take a good hard look at that.\n\n","date":"May 10, 2010 at 12:09 pm","url":"https://shroudstory.com/2010/03/30/abc-good-morning-america-on-tonights-history-channel-shroud-of-turin-special-2/","cat":"history","id":"comment-1285","author":"Greg","site":"shroudstory"},{"title":"First Reaction: History Channel’s Shroud of Turin: The Real Face of Jesus","post":"good day everyone…. im trying to look for the title of History Channels episode regarding the shroud of turin and da vinci… can anyone tell me the title of that documentary…??? or does anyone have any idea where to dl that video….. tnx…!!!\n\n","date":"September 19, 2010 at 11:18 pm","url":"https://shroudstory.com/2010/03/30/abc-good-morning-america-on-tonights-history-channel-shroud-of-turin-special-2/","cat":"history","id":"comment-1440","author":"Ferdinand","site":"shroudstory"},{"title":"First Reaction: History Channel’s Shroud of Turin: The Real Face of Jesus","post":"I first learned of the shroud when I was little (watching a TV show aired in Greater Boston in black and white) and even back then was moved by the sweet face and intense suffering so visible to all. I was most impressed that the man’s face held no anger, no fury against anyone or anything despite all the brutality he had so obviously endured. The recent History Channel documentary, The Real Face of Jesus From the Shroud of Turin, also moved me but in different ways: for one, I was struck by the impact the shroud has had on scientists, especially Ray Downing who developed the full-color image for us with modern equipment. Injuries to the the body were as extensive as those suffered by people who die in car wrecks: “He was murdered many times over.” ~ Earlier photographs of the face in the shroud always gave me the impression of an older man with a gray beard, an infinitely kind and caring grandfather, perhaps, not the young vibrant man with the handsome face we now see thanks to modern technology. After giving the History Channel face further thought, and being Roman Catholic, I cried to think, Dear Jesus, What have I done? What have I failed to do? For me the Shroud is unique evidence of man’s inhumanity to man, man’s inhumanity to God – but God raised Him from the dead.\n\n","date":"August 17, 2011 at 9:32 am","url":"https://shroudstory.com/2010/03/30/abc-good-morning-america-on-tonights-history-channel-shroud-of-turin-special-2/","cat":"history","id":"comment-3619","author":"Chris Drake","site":"shroudstory"}]
