[{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"For people who don’t want to read all my long comment, here’s a brief summary of the argumentation I’ve developed in it :\nFor all the time the Mandylion was publicly showed in Edessa and Constantinople (from maybe the 6th century until 1204), there’s absolutely no traces in Christian art from that period (especially Byzantine art) of a change in the depiction of the Passion of the Christ (in fact, we have to wait until the 13th century to remark a drastic change) and there’s absolutely no copies of the Mandylion from that period (6th century to 1204) that show any kind of signs of the Passion (no blood traces, no injuries, etc.).  To me, the verdict from the history of Christian art is clear :  The image of Edessa (AKA the Holy Mandylion) had nothing to do with the Passion of the Christ and, starting from there, had nothing to do also with the Shroud of Turin (at least, not directly).  And that is totally consistent with the FACT that there is absolutely no ancient list of relics related to the Passion of the Christ that include the Mandylion (and we have many of those lists, starting with the one written by Saint John Damascus at the beginning of the 8th century, along with the one written by the Byzantine emperor Constantine VII in 958 and many more in the 11th, 12th and 13th century).  The FACT is this :  All those lists of the Passion ALWAYS exclude the Mandylion !!!  This is a fact.  There’s no speculation needed here.  \nAll this doesn’t ring a bell in your head ?  To me, this can only lead to one conclusion :  Wilson’s hypothesis is NOT the answer !  We have to search elsewhere.  And you cannot condemn me for having a judgment full of bias, because I’m exactly like you :  I believe the Shroud is authentic and the fact that I reject the hypothesis of Wilson is not at all something to comfort my belief since I have, for the moment, no answer to explain the dead silence of ancient sources (documentary and artistic sources alike) about the presence of a shroud of Christ that bears a full body image of Jesus on it !!!  Think about it, if I had a judgment full of bias regarding the historical evidence, I would be a proud supporter of Wilson’s hypothesis !  But since I only seek the truth, I can’t do that.\nP.S. :  The sign say :  I’m not listening.  On the contrary, I hope you will !!!  In fact, you should… :-)\n\n","date":"April 16, 2012 at 9:10 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10441","author":"Yannick Clément","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"“And that is totally consistent with the FACT that there is absolutely no ancient list of relics related to the Passion of the Christ that include the Mandylion ”\nThere are manuscripts which clearly link the Mandylion to the Passion (cf Mark Guscin, here is a link -French-  http://www.suaire-turin.com/Resources/guscin.pdf)\n\n","date":"April 16, 2012 at 9:57 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10445","author":"anoxie","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"I totally disagree with Guscin here.  The part of the Synaxarion that Guscin talk about (where we can find the word “sindon” linked with the Mandylion) cannot be understand as “shroud” in the context of the text, simply because the next line say : “In death, you were placed in the final linen shroud.”  Since the next line link the word “sindon” and “death”, we know that the author was referring to a burial shroud there.  But the first cannot talk also about a burial shroud since the word “sindon” is linked there with the word “in life”.  It exactly the same thing than the expression “sindon tetradiplon” that we found in the book “The acts of Thaddeus”.  In the particular context of the text (where Jesus is alive and well), the word “sindon” cannot be understand as “burial shroud”.\nI’ve said it before :  In greek, the word “sindon” doesn’t necessarily mean a burial shroud !  It can mean anything from a cloth to a long cloth to a tunic, etc.  The context is so important to understand the meaning and in the particular context of the Synaxarion, the word “sindon” applied to the Mandylion cannot be understand as a burial shroud.  And Guscin also cite a poetic part of a liturgical book called the Menaion.  But when I read that part, I found no clear references to the presence of blood stains on the image of the Mandylion.  In fact, this part of the text seem much more to refer to the Eucharist and the Incarnation of Christ.  The focus is not at all on the Mandylion, but on the flesh and blood of Christ…  \nWhat his the most funny part is that I’ve read his book “The Image of Edessa” and he don’t mention the argument anywhere concerning the Synaxarion !  So, I’ve exchange personal emails with him recently about that and here’s what he wrote to me (I think there was some confusion between what he said at the conference in France and what the frenchmen who wrote the article understood) :\nDear Yannick,\nThere is some confusion here. The Menaion is a collection of liturgical hymns (usually quite different from one manuscript to another), with no story of the saint or icon or relic in question – just hymns. The Orthodox book of saints with the relevant stories is the Synaxarion.\nJust about all versions of the Synaxarion say that King Abgar ordered his messenger to paint a picture of Christ’s “whole bodily appearance”.\nThe Menaion manuscripts that I discovered are obviously more poetical (they are hymns). They say that when King Abgar looked on the image on the cloth he realised that Christ had come in body and blood – this COULD be a poetical reference to the image containing body and blood. This is what I say in the book – unfortuntately the MNTV lecture was me trying to speak in French and Pierre then listening to the recording and writing the text, and either I said it wrong in my limited French or he understood it wrong. But the text does not directly state that there was a whole body image, which is why you cannot find this in my book – because I never said it.     \nI hope this answers your question,\nBest wishes\nMark\nSo you see ?  I’m not even sure that Guscin really thought that the word “sindon” we found in the Synaxarion can be understand as “burial shroud” !  I think this french article should be re-write !\nAnd I would conclude my answer to you by saying this :  The few ancient texts that Guscin cites cannot contradict my argumentation about the FACT that there is absolutely no ancient list of relics related to the Passion of the Christ that include the Mandylion.  He mention the Synaxarion and the Menaion which are 2 liturgical books of the Byzantine Church, and cannot, by any means, be considered as offical lists of relics related to the Passion of the Christ.  In reality, those 2 citations of Guscin are highly speculative and can very well be understood completely differently. \nIt is a FACT :  there is absolutely no ancient list of relics related to the Passion of the Christ that include the Mandylion.\n\n","date":"April 16, 2012 at 11:00 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10447","author":"Yannick Clément","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"I see, actually he didn’t find an ancient list of relics.\nBut his point was clearly that the Mandylion was not manmade, could have had boodstains, could have been a full-body image, could have been wraped (“tetradiplon”) and… could be the shroud.\nBut obviously you should email him directly to have his viewpoint.\n\n","date":"April 16, 2012 at 12:51 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10452","author":"anoxie","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Reply to the last comment of Anoxie :  You’re right !  Guscin didn’t found a list of relic related to the Passion of Christ with the words “Mandylion” or “Image of Edessa” in it.  And it’s normal because there’s none !  All Guscin found is a minority of legendary, theological and/or poetic text that can be interpreted as if the Mandylion was showing a full-length body image of Jesus or if there was blood stains on it.  But the thing is :  those few divergent texts (very few in fact versus the whole corpus) can be interpreted differently, depending on the historian.  Those will always need some speculation or extrapolation in order to be view as evidence for Wilson’s hypothesis.  Lists of relics are very different in the sense that their authors had just one goal :  to report what he saw !  They are not like those legendary, theological of poetic stuffs that are evidently much harder to interpret.  In the case of a list of relic, normally, there’s no need to extrapolate or speculate…  When a writer include a shroud of Christ for example, there’s no good argument to think he meant something else than a burial shroud !  You understand ?\nFor the view point of Guscin on the question, I know it since, firstly, I’ve read his book “The Image of Edessa” and also, last year, I ask him more about it in another email.  I said that, for him, the hypothesis of Wilson is really attractive but, as he said, like any other hypothesis on the subject, it is far from being proven !  Personally, I would have said :  very far, but that’s his opinion and I respect it.\nI would also say that Mark Guscin is somewhere in-between in this debate, in the sense that he love the ideas of Wilson but, at the same time, he’s enough prudent not to proclaim his ideas as undeniable truth !  I respect him very much for that kind of prudence.  In fact, it’s pretty much the same kind of prudence we see expressed by Maurus Green in his own article.  The only thing found dangerous in their approach is the fact that I really think they have left the door too much wide open for Wilson versus the global portrait of the situation…  I think they should have been more critics versus the ideas of Wilson, but that’s only my personal view, after all the research I’ve done and still do.\nLast comment :  Did you notice how many time you used the word “could be” in your comment ?  That’s the reality of those who want to defend Wilson’s hypothesis until they die :  they will always need those “could be” sentences in order to defend their idea !!!  We are here in what I call “the speculative territory” and anybody knows that, with some speculations, anyone can make say anything to any ancient text, especially to the ones who fits into the category of legendary, theological, spiritual and/or poetic texts…  When you base an hypothesis on speculations like that, it’s very weak.\nIn fact, it’s pretty much like the Bible !  Anyone can interpret this book as he want !  Some only view a God of Talion in there and others, like me, are able to see the God of Love !  And all this, starting with the same book !!!   I repeat it :  You don’t have to use any kind of speculations to interpret a list of relics…  It’s completely different and should be analyzed while taking care of this important difference.   That’s the reason why I give much more importance and credit to a list of relics when I do my research than I do to a legendary or theological related text.  Unfortunately, in the historical research for the Shroud, it’s not always the case and you often see all kinds of speculations coming from those kind of texts, some of them being total nonsense…\n\n","date":"April 16, 2012 at 4:35 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10469","author":"Yannick Clément","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Yannick, you will be glad to hear that, in a 36 page paper intitled  “Les sources de l’histoire du linceul de Turin, Revue critique”, Revue d’Histoire Ecclésiastique,Vol. 104 (2009), N° 3-4, pp.747-782, the late French medievist, archivist and palaeographer,  Emmanuel Poulle, established that the Turin Shroud could not possiby be assimilated to the Mandylion.  Although his opinion is much in your line, it shall be received with caution as Poulle was not a pure byzantinist.\nRésumé/Abstract\nL’enquête conduite sur les sources de l’histoire des reliques christiques avait pour premier objet de repérer celles d’entre elles qui pouvaient concerner le linceul de Turin, de façon notamment à fixer le vocabulaire employé. Il a ainsi pu être établi que l’assimilation souvent faite du linceul de Turin avec le mandylion venu d’Édesse à Constantinople en 944 était impossible, les deux reliques étant conservées simultanément à Constantinople à partir d’une date inconnue, peut-être dès le 11e s. Les témoignages (tardifs) faisant état de l’image sur le mandylion d’un corps, et non du seul visage reposent sur une interprétation erronée d’un texte latin maintes fois repris à la fin du Moyen Âge. Les textes (en latin et en grec) sont cités avec un contexte suffisamment large pour en éclairer le sens, et ils sont traduits. Ils attestent la présence du linceul à Constantinople avant 1204.\n\n","date":"April 16, 2012 at 11:44 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10449","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Hello Patrick.  Don’t worry, I know this article very well !!!  Even if I disagree with Poulle on one or two things that he wrote in this great article, I have to say that it is the best one I’ve read while doing my research, along with the one from Maurus Green.  By the way, Poulle, just like me, was a defender of the Paris hypothesis that pretend the Mandylion left Constantinople around 1241 (he was probably saved from the looting of Constantinople in 1204, along with all the Christ related relics that were kept inside the Pharos chapel, except for the Shroud who had been relocated in the Blachernes church) in a very big deal involving many relics (by the way, most of them are present in the testimony of Robert de Clari) between the latin emperor of Constantinople Beaudouin II and Saint Louis, king of France.  If this is correct, then, the Mandylion was most probably destroyed by the  French revolutionnaries around 1792.  Very sad because if it was still in Paris (like the crown of thorns), it would be easier to know if this Paris hypothesis is correct or not.  But I really think it is.  And I’ve read that many other historians (many of which are true byzantine specialists) are also defenders of this very interesting hypothesis…\n\n","date":"April 16, 2012 at 11:57 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10450","author":"Yannick Clément","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Very glad to hear of the Emmanuel Poulle article which I did not know. This seems very much on the right lines- and certainly a better documented explanation than  that de Wesselow’s  (in his new book The Sign) and others’ claims that the Mandylion is the Turin Shroud.  The Pharos relics seem to have survived the sack of 1204 as they were in the imperial palace and were then distributed ,sold or used as surety for loans ( the Crown of Thorns) by the Latin emperors who ruled in Constantinople until the restoration of the Byzantine Greek emperors in 1261. Most of them went to Louis IX’s Sainte-Chapelle. In the official guidebook to the Sainte-Chapelle there is an engraving of 1790 showing the Chasse, or main display altar, in the chapel, and seventeen listed relics from the Passion and Cruxifixion including a Holy Shroud, most of which can be linked back to the relics list of the Pharos chapel. However, there is no definite mention of a Mandylion there and it is assumed that the Shroud are the ‘sheets’ mentioned in the Pharos chapel as being of cheap cloth (listed as separate from the Mandylion in the Pharos list of 1201) .So one must be cautious in being sure that the Mandylion was among those transferred to Paris but it may well have been.\nThe closest shroud in description  to the Turin Shroud is, as you say, the one in the Blachernae Chapel (which does not mean, of course, that is is the Turin Shroud because there is no record of what happened to it after 1204 and  and of course there were many shrouds, face cloths, images ,etc, around in medieval Europe – Oviedo, the Vera Iconica in Rome,etc,). De Wesselow claims that the Mandylion and the two shrouds from the Pharos and Blachernae chapel are one and the same! -I am afraid he completely lost me there!\n\n","date":"April 18, 2012 at 6:12 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10527","author":"Charles Freeman","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"For the Mandylion of the package deal between Saint Louis and the latin emperor of Constantinople, I think the chances that it was really the authentic Mandylion are pretty good when you consider that the list of relics that were bought by Saint Louis are almost the same as the list of relics presents in the Pharos chapel reported by Robert de Clari just before the sack of Constantinople.  In the list made for the deal of Saint Louis, the possible “mandylion” is said to be a “Sacred cloth inserted in a table”.  And in many official lists of the relics of the Sainte-Chapelle published in 1534 and after, it is said : “A cloth inserted in a table where there’s the face of our lord Jesus-Christ”.  I think those description are pretty clear that this relic looked very much like the Mandylion.  And since almost all the other relics bought by Saint Louis can be found in the testimony of Robert de Clari, I don’t know how can this cloth can be something else that the Mandylion, since de Clari’s description of the Pharos chapel is pretty clear that the Mandylion was kept there, along with the Keramion (the tile bearing the same face of Christ).  And this is also true regarding the testimony of Nicolas Mesarites (written firstly in 1200 or 1201 and written again in 1207), the gardian of the relics at the Pharos chapel.  His testimony is almost the same as the one from de Clari and in it, we also found a clear confirmation that the Mandylion, along with the Keramion was really kept inside the Pharos chapel.  All those lists of relics are pretty consistent.  That’s why I don’t have any problem at all to believe that the “sacred cloth” mentionned in the deal of Saint Louis was really the Mandylion.  If it was not, then what it was ?  A copy of the Mandylion ???  Remember that Saint Louis was probably the most important allied of Beaudouin II, the latin emperor of Constantinople.  I really don’t see this latin emperor (who was a frenchman by the way) willing to sell a false Mandylion to the king of France at high price !!!  Don’t make any sense to me.  In that regard, I don’t see too many other options in this case than to think that it was really the authentic Mandylion that was include in the deal…\n\n","date":"April 19, 2012 at 10:50 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10597","author":"Yannick Clément","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Yannick you wrote: “the Mandylion was most probably destroyed by the French revolutionnaries around 1792. Very sad because if it was still in Paris (like the crown of thorns), it would be easier to know if this Paris hypothesis is correct or not.”\nActually, the Sainte Chapelle 16-17 missing relics were not destroyed by the French revolutionnaries around 1792. On 12th November 1793, they were buried south of Paris (my archivistic research has even led me to accurately locate them). Let’s hope they were buried in a  laden box. As for the “toelle” or “tuile” identified as “Le Mandylion”, nothing much should be left of it even if recovered as Louis IX, Saint Louis, kept distributing  fragments of it all over the western world.\n\n","date":"April 18, 2012 at 7:58 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10529","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Max Patrick Hamon. Very interesting information -good to know that research is going on in this area.\n I don’t know if you know the 1790 engraving I refer to- I expect you do. What do think is the relic referred to as number 17, the Saint Suaire? I had assumed,perhaps wrongly that these might be the ‘sheets’ referred to in the Pharos list of 1201.\nNotre Dame claim that they have the Crown of Thorns from the Sainte-Chapelle- given to them after 1815 and now in a nineteenth century reliquary – do you have any take on this?\nI researched all this for my book Holy Bones, Holy Dust, Yale 2011 but decided not to deal with the Shroud as there were just too many conflicting accounts and there were so many more important relics issues in the Middle Ages which was the focus of my book.\n\n","date":"April 18, 2012 at 10:21 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10536","author":"Charles Freeman","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Thanks to Yannick for this. The argument , put forward by Wilson and adopted by de Wesselow in his  The Sign, that the Edessa image was the Turin Shroud was never plausible and this provides a far better route for its later existence.\n\n","date":"April 19, 2012 at 11:07 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10598","author":"Charles Freeman","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Thank you for your thank !  This is the very FIRST time someone on this blog give me thanks for my long research !  :-)  Another thing to note :  There are not any sign of a change in the Byzantine theology regarding the Passion of the Christ before the sack of Constantinople (and this can be confirm by the fact that there wasn’t any noticeable changes in the art of the Passion), even if the Mandylion was known of the population very well.  If the Mandylion was really the Shroud folded in 8, I really think this cloth would have had a drastic influence on both the theology and the art regarding the Passion of Jesus long before he left Constantinople sometime during the 13th century.  But that’s not the case…\n\n","date":"April 19, 2012 at 1:04 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10605","author":"Yannick Clément","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Charles Freeman. But aren’t you the same Charles Freeman that wrote a review of Thomas de Wesselow’s book “The Sign”? If so, according to your answers to comments about your review, you do not think that the Shroud of Turin is from the first century. More precisely, you believe that the Shroud of Turin would not be genuine but a copy of the Shroud that was in Constantinople in 1204. That nobody has been able so far to copy the Shroud of Turin, I find your arguments to be very speculative and having no historical foundation. Otherwise, how do you support your claim that the Shroud of Turin is a copy made by human hands from the Shroud in Constantinople?\n\n","date":"April 22, 2012 at 1:43 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10696","author":"latendre","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Thanks for yours, latendre. 1) No, I don’t think the Shroud is first century on the present evidence. i don’t think that the presumption that the Carbon-14 dating is right has been overthrown. There is now the blood evidence- if the blood on the Shroud is AB ,then this blood type only originated a thousand years ago. So I am keeping to a medieval date for the Shroud until someone comes up with something better – which may or may not happen. One day we may understand how the image was made- science is always making progress about such things.\n2) The copy. I only said that this was a SUGGESTION that had been put forward. As I have not read the original article in which this suggestion was put forward i cannot say more. So it is not ‘my ‘ claim that it is a copy.\n3) You are right about historical speculation. The attempts to find a route to take the Shroud back from the fourteenth century to the first century AD are enormously speculative and I think Yannick here has shown up  some of the problems. If you read de Wesselow, he is full of bizarre suggestions , see my original review on Amazon about just ONE link in the chain , back to Constantinople.\nThe real problem about doing scientific research on the Shroud is that the Vatican should have put it in a conservation department where trained conservationists could have worked on it in laboratory conditions and kept any pigments selected on site. Allowing a team from the States free access in the 1970s meant that even the original pigments were taken off the cloth and distributed all over and then many were examined in home laboratories. As a means of doing scientific work this was disastrous, it is not clear how many of those working on the pigments they took were qualified in either conservation or analysis. No wonder much of the work done on the Shroud never passed peer review. if it had been done in a single top laboratory, such as in the UK the Victoria and Albert Museum or the British Museum (but many excellent ones also in Italy) , there would not have been the problem.\n\n","date":"April 22, 2012 at 4:08 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10700","author":"Charles Freeman","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"We mustn’t jump to conclusion though as the byzantine vocable “mandylion” could as well be referable to the napkin with which Christ washed the Apostles’ feet… The fact is we still can find 2 portions of the napkin or towel with which the Apostles’ feet were dried after Footwashing  (Church of Joannes Lateranensis in Rome; Church of Cornelius in Acqs, Germany [this one has the mark of Judas’ foot on it?!]) not to mention 7 portions of it that can possibly have been mistaken with the napkin on which Jesus’ head was laid in the tomb (Augustin monastery at Carcassone; Nice; Acps in Germany; Macstricht; Bensancon; Vindon in Limoges; Lorraine on the border of Alsace; Church of St Salvator’s in Spain; Ausgustin monestary in Vivarais; a nunnery in Rome)… This is not as simple as one can think…\n\n","date":"April 19, 2012 at 12:24 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10600","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Further research is most needed…\n\n","date":"April 19, 2012 at 12:43 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10603","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"I think your hypothesis is highly unlikely Max since we know from some lists of relics in Constantinople from the 11th and 12th century that there was a Mandylion AND a towel with which Jesus washed the feet of his apostles.  So, I don’t think the Mandylion can be assimilated in any way to this kind of towel.  And, in the list of Saint Louis from 1247, we learn that he bought this towel, along a “sacred cloth insert in a table” (which is probably the Mandylion).  So, that’s why I don’t really think that there was any confusion in Constantinople and after between those 2 towels…\n\n","date":"April 19, 2012 at 12:59 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10604","author":"Yannick Clément","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Mandylion in Byzantine Greek means “towel”. Any inventory must be received with caution. The number and namiing and description of the same relic can defer from one inventory to the other.\n\n","date":"April 19, 2012 at 1:25 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10606","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Not to mention the “tile”. In French “tuile” sounds nearly like “toelle” too…. Confusion cannot totally/100% be ruled out…\n\n","date":"April 19, 2012 at 1:36 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10608","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Note: List of Relics derived from John Calvin’s “Inventory of Relics”\n\n","date":"April 19, 2012 at 12:33 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10601","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"I agree nothing is simple,especially as there was no precise way to describe particular relics and too many duplicates! – as John Calvin says. I particularly enjoy Erasmus’ Pilgrimage for Religion’s Sake on Walsingham and Canterbury.\n\n","date":"April 19, 2012 at 12:42 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10602","author":"Charles Freeman","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Yannick. Thanks.  I am sure you are one the right lines and that if one wants to take the Shroud back in time one has to find an alternative route. As a practical man myself, who used to work on digs in the Mediterranean of the classical period, we were constantly brought up with how little,especially of cloth, survives from these centuries unless the conditions are very special. Edessa is very damp in winter!\n\n","date":"April 19, 2012 at 1:26 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10607","author":"Charles Freeman","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"One shall also be reminded that, historically speaking, there may not be a single direct/crystal clear link between the Holy Face of the Holy Mandylion and the burial shroud. However, there are many more or less indirect/cryptic ones. Moreover, archaeologically speaking, they are, at least, two direct links between the Holy Face of the Holy Mandylion and the burial shroud: a set of fold line creases consistent with the burial shroud having been doubled over and then folded four times (and thus reduced to the size of a mandylion or towel) so that the face alone of Yeshua was exposed to view and a circular lighter-coloured halo like shaped all around the head. These are factual/empirical evidence no one can deny.\n\n","date":"April 19, 2012 at 3:39 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10611","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"If there’s such links Max, I think it has much more to do with the probable fact that the Mandylion image of the face of Christ was based, directly or indirectly, on the Shroud image.  I don’t deny this probable link myself…  But, as I said before, it’s one thing to believe there is such a link between those 2 relics and believing that they are one and the same !!!  My researches prove to me one thing :  It would be a big mistake to cross that line !!!\n\n","date":"April 20, 2012 at 8:29 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10635","author":"Yannick Clément","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"It would also be a mistake TO ASSERT (as if a proven fact) that the (genuine) Holy Face of the Holy Mandylion and the Burial Sheet/Cloth are two different objects…\n\n","date":"April 20, 2012 at 9:33 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10636","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Read again my comments and if you you’ll understand why the hypothesis of Wilson doesn’t fit at all with the history of Christian art (especially Byzantine art).  You will make me believe that the face on the Shroud (that is evidently a throwback to the Passion of Jesus) could have been known publicly by the faithful for centuries (both in Edessa and in Constantinople) without having any influences at all regarding the artistic depictions of the Passion and you will make me believe that all the signs of the Passion that we would have seen easily on the cloth would not have been reproduced at all in copies dating from the time the relic was still in Constantinople ?  Even the Epitaphios from the Byzantine Church don’t show any signs of injuries or blood on them.  The history of Christian Art is quite clear :  The Mandylion had absolutely no influence at all on any depiction of the Passion of the Christ, starting with the crucifixes and any other representations related to this event.  And because it is the reality, I say that this doesn’t fit at all with Wilson’s hypothesis.  But, on the other hand, that fits completely with all the ancient lists of relics related to the Passion of the Christ that NEVER include the Mandylion.  I think all those evidences make a pretty good case against Wilson.  In fact, for me, this is quite clear :  We have search elsewhere to find an explanation for the great silence regarding the ancient history of the Shroud, simply because the Mandylion was just what it was reported to be :  an image of the only the face of the living Christ !  Why is it so hard to understand and believe ?  The vast majority of the documentary sources and 100% of the artistic copies of the Mandylion are in total agreement with this conclusion.\n\n","date":"April 20, 2012 at 10:48 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10643","author":"Yannick Clément","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Yannick, \nYou’d better check the medieval Armenian iconography of Christ’s pallium (see e.g. Stephen’s blog). You could see it showing the same Mandilyon Parthean pattern and even bloodstains on it… There is a direct iconographic link between The Holy Face of the Holy Mandylion and Christ’s Pallium (= symbolic featuring of his Burial Sheet & full body).\nAs for the Pray codex naked Christ most obviously copied from the Turin Shroud frontal image, it doesn’t show any signs of the Passion (bloodstains/wounds) as such… Doesn’t that ring a bell? Is the way you think and see Christ Byzantine iconography the same way Medieval Byzantine Greeks did? I very much doubt it.\n\n","date":"April 20, 2012 at 12:56 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10647","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"The fact is I side with Dan Scavone and Ian Wilson’s pioneering work as their independant theories are the most likely in the light of the archeaological evidence detected on the Shroud itself.\n\n","date":"April 20, 2012 at 9:37 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10637","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Always remember the problem of damp! and even more so the long gap before 550 AD that Wesselow refuses to discuss at all.\n I saw one documentary on the Shroud where the Shroud was moved so that the BBC could film it. It had to be placed in a room where the humidity was controlled! The point about the difficulties of survival of linen in the long term was beautifully made – even if no one in the documentary seem to have realised what a major issue this is for the Shroud ( I am speaking here from my archaeological experience of working in the Mediterranean.)\nIncidentally in that film, they claimed, from a sideways photo image, that the folds were ACROSS the cloth and the idea was put forward that the bottom end was in a container or chest and the rest piled on fold by fold. This was used to support the idea that it was the Shroud that was raised up, from the container, each Friday in the Blachernae chapel in Constantinople.\nI can’t see how a burial shroud with a naked dead man on it could morph into the Edessa image which is always attached to legends that it was of Christ while alive. I am on Yannick’s side over this.\n\n","date":"April 20, 2012 at 9:51 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10638","author":"Charles Freeman","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"I noticed Charles you have raised this point atleast twice now i.e.; “the problem of damp” and “longevity” of linen cloth. Let me enlighten you to some facts about linen…\nIt is widely known that; Linen is stronger wet then dry. Flax fibers and yarns increase about 20% in strength on wetting, resulting in greater longevity compared to most all other fabrics.\nSilica, present in linen flax fibrels protects linen from rotting. Linen is highly hydroscopic, meaning it is capable of absorbing moisture as well as dispelling moisture quite quickly. Linen is naturally insect repellant. Finally linen is ‘known’ for it’s “spectacular” durability.\nLinen samples are of the oldest of material fabrics ever found; 6000 year old Egyptian samples in almost prestine condition have been found. 8000 yr old samples in Peru. Linen fibrels found in a ‘cave’ in what is today Georgia dated “36,000 years old” still intact! …and many more examples. The Shroud we know, most definately, spent much of it’s time encased and very well cared for. So to think it could not survive 2000 years is simply unstudied conjecture to say the least.\nThe ‘raking’ light photos of the Shroud and subsequent fold marks found and studied by Dr Jackson et al. along with a working model of a lift built by Jackson et al, and most likely the same used in Constatinople to raise the Shroud each Friday, is near indisputable. As the ‘evidence’ points exactly to this, along with the equal folds found which show at one time the Shroud was folded in eight where the face alone would show and in a ‘landscape’ style, reminiscent of many artist depictions of the Mandylion or Image of Edessa….This is very strong evidence, which cannot be easily dispelled.\nFrom your last statement, it dawns on me that you may have never actually read Wilson’s books or better yet his most recent book on the Shroud, as it will cut your last statement to ribbons.\nRon\n\n","date":"April 23, 2012 at 2:57 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10731","author":"Ron","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Ron- perhaps you will read my Holy Bone, Holy Dust, How Relics Shaped the History of Medieval Europe. Yale UP ,2011. You, and others, can go to the Yale UP US website to check out the reviews.\nI used to own some linen of 2,500 years old from an Egyptian tomb- unfortunately I sold it. Yes, it was in perfect condition because linen is preserved in Egypt, if not in many other places.  But Edessa is very damp! Can you please tell me how many pieces there are, from OUTSIDE Egypt, of linen carbon-14 dated to the period 300 BC to 300 AD?\nToday Protestants don’t revere relics. At the Reformation they actually burned them up. So too in early Christianity, relics were not revered. The documentary evidence for relics first becoming seen as important dates from the 380s, 350 years after the Crucifixion.  We do have good records of many images ‘not made from human hands’ appearing in the sixth century onwards. Linking any one of these to a later medieval relic is extraordinarily difficult because the terminology is never precise and the number of people who have the necessary experience in Byzantine Greek is, of course, very limited. I have never come across any trained Byzantine scholar who would support Wilson’s thesis,\nIn my researches for Holy Bones, I found examples of the bodies of martyrs being preserved and honoured but never anything from the first century.  I am particularly interested in information about relics from before 550 because this is a long period, no less than 500 years, and  one has to find specific documentary evidence where a relic was, why before 380, it may have been venerated , against the trend. .  de Wesselow in his book The Sign refusers even to discuss the question.\nThere was another trend, not to show any images that showed the suffering of Christ – you can’t find any such in early Christian art . It would have extraordinary for a Jew to have kept a blood-stained burial cloth as it would have gone against every traditional taboo.\n I doubt whether Wilson has found the evidence that no one else has for this period before 550. Hans Belting covers the issue well.\nHans Belting,  Likeness and Presence, p. 213.\n‘Although an alleged letter of Christ that had healed the king [Agbar] was venerated as a relic, no image was mentioned [in Edessa] before the sixth century, when miraculous images became popular elsewhere as well. [CF –it is often forgotten that there were lots of them around!]  As late as 544, Procopius still attributed the recovery of the town from the Persians to the letter, whereas by 593, the chronicler Evagrius gave the credit to the ‘God-made image, which had not been touched by human hands.’\nBelting expresses the common opinion of scholars that there is no mention of an image in Edessa before c.600. You can choose not to believe the report that it was the custom to sprinkle the (open) eyes of the Mandlion with water but then you runn the risk of being accused of only accepting the documents that support you and rejecting those that don’t! Alas, all too common in this field as I know from my own work. That is why i decided not to go anywhere near the Shroud in my book- there are far more interesting relics in the Middle Ages as you might discover if you read Holy Bones!\nI must really try and withdraw from the discussion here!\n.\n\n","date":"April 23, 2012 at 3:28 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10734","author":"Charles Freeman","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"I do understand you Charles. Till we recover a portion of the cloth that was inserted into a board and “identified” as “the mandylion”, the question stil remains open for one to side either with Poulle or with Scavone/Wilson.\n\n","date":"April 20, 2012 at 10:15 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10640","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"However can we take legends on face value?\n\n","date":"April 20, 2012 at 10:20 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10641","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Legends- no we certainly can’t. It was all too common in medieval Europe for relics to be given legendary histories for which there was no evidence at all. Without a legend that explained how a relic came to be where it was, why should anyone believe in it? I was doing some work on Guibert of Nogent -you may know his twelfth century critique of relics- and his monastery had relics from the first century that a king of Britain had collected from the apostles in Jerusalem and had buried on the site of the monastery!\nIncidentally Hans Belting, Image and Presence, p. 211, tells the story, recorded by a Byzantine court theologian, that when the Mandylion  was exposed for veneration it was the custom for people  to sprinkle its eyes with water- should we believe this or not?\n\n","date":"April 20, 2012 at 10:35 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10642","author":"Charles Freeman","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Charles, I agree completely with your last comment.  And I also answer a definitive “no” to the question that Max ask.  When you analyse properly the hypothesis of Wilson and when you read what was written by Scavone, Guscin, Dubarle and others, in order to defend his idea, you easily notice that all their so-called pieces of evidence rest on speculations, extrapolations and assumptions that often rest of legendary stuff !!!  Those people seem to put the same degree of confidence and value in a legendary text than they did with a simple list of relics written to inform people about the religious objects present in a city !!!  Historically speaking, I found this kind of thinking completely off-track.  And those people also put a high level of confidence and value in some ancien texts full of poetic lines and/or theological images !  I just can believe that they can think that those kind of texts offer the same high level of physical and historic truth than what we can find in a simple list of relics written by some pilgrim…  Is it due to some bias ???  I ask the question because it look pretty much that way.  I repeat it again :  There is absolutely NO ancient list of relic that include the Mandylion in it.  From this single FACT, it is easy to understand that the Mandylion had nothing to do with a burial cloth showing bloodstains on it and this single FACT also tell us, indirectly, that this cloth was most probably looking pretty much like all the artistic representations that has survived to this day, i.e. a small cloth showing only the face of the living Christ on it.\n\n","date":"April 21, 2012 at 7:03 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10687","author":"Yannick Clément","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"History cannot have the “no”  final word and speak on behalf of any other discipline. What about Shroud archaeology and Christ’s pallium Late Antique  & Miedieval iconography?\n\n","date":"April 22, 2012 at 5:02 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10722","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"+ Christ nakedness in conjunction with his Second Coming iconography?\n\n","date":"April 22, 2012 at 5:07 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10723","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"I think you are right.  IF a definitive first century Carbon-14 dating did ever come up then we would have to assume that the Shroud survived somewhere all those centuries.  But it seems pretty clear that there is no proper historical evidence that it came through the Edessa route.\n\n","date":"April 22, 2012 at 3:52 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10698","author":"Charles Freeman","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"In reality, there is absolutely NO reference in any ancient text that specified that the burial shroud of Christ ever spend one single day in Edessa.  All we have from ancient source is the fact that there was an image of Jesus face there.  And, if we believe the first account of the Abgar legend where we find a reference to an image of Christ, i.e. The Doctrine of Addaï (a syriac manuscrit written around the year 400), we can think that this image was not miraculous at all but was painted by the official artist of the king named Hanan.  There are some other ancient text (like the manuscript of Moses of Chorene who visited Edessa during the fifth century) that help to confirm the fact that there was such a painting of Christ in Edessa during the fifth century…  NOT GOOD FOR WILSON’S HYPOTHESIS, DON’T YOU THINK ?!?  \nMy feeling about all the informations we can take from ancient sources lead me to believe that the Mandylion was first considered as a manmade portrait of Christ (from the beginning of the fifth century) and then, later on, this concept changed (probably during the second half of the 6th century) and people started to think this portrait was miraculous (not made by human hands).  \nWhat lead to this drastic change ?  In the same line of thinking than Paul Vignon, I have the feeling that this could have been caused by some religious fights between the orthodox church and some heretic movements like the Monophysitism philosophy who proclaim that Christ was not really human and that he was only divine in nature.  And the fact that this movement was really popular in the region surrounding Edessa is a good clue that this could well be the case.  In other words, the fight against Monophysitism could have caused this change of consideration from a manmade portrait of Christ to a miraculous image of Christ, so that the orthodox church can have a good “tool” to fight this heresy by saying : Look !  We have a miraculous portrait of the living Christ that is a proof of his human nature !  You can forget your heretic philosophy, we proved it wrong !  \nI think that can explain pretty well the development of the Abgar legend regarding the Image of Edessa from a painted portrait at first to a miraculous image of Christ.  Of course, that’s just my opinion, but it is based on a long research of all the ancient sources regarding this Image.\n\n","date":"April 22, 2012 at 9:24 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10726","author":"Yannick Clément","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Yannick, I wonder from much of the mis-information you are babbling; Have you even actually read and more importantly ‘read carefully’ Wilson’s recent book The Shroud-A 2000 year old mystery solved??? As many questions you ask here are answered quite satisfactory in his book.\nR\n\n","date":"April 23, 2012 at 2:21 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10730","author":"Ron","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Ron, have you read all my good arguments against Wilson’s hypothesis ?  I still wait for you to challenge them !!! :-)\n\n","date":"April 23, 2012 at 8:33 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10742","author":"Yannick Clément","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Charles Freeman, You write\n“Allowing a team from the States free access in the 1970s meant that even the original pigments were taken off the cloth and distributed all over and then many were examined in home laboratories. As a means of doing scientific work this was disastrous, it is not clear how many of those working on the pigments they took were qualified in either conservation or analysis. No wonder much of the work done on the Shroud never passed peer review.”\nSorry, but writing such statements shows that you know very little about what the STURP (that you refer to as a “team from the States”)  did. Pigments? What pigments? “home laboratories”? Are you talking about McCrone? Ray Rogers? John Jackson? Plenty of papers were published by the STURP members in peer-review journals. Are you talking about the Shroud of Turin?\n\n","date":"April 22, 2012 at 1:43 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10710","author":"latendre","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Latendre.\nThe 1978 team were all from the United States so to us in Europe it was a team from the United States – just as if a team from Europe came to analyse a native American relic, it would be a team from Europe. Was it, however, a ‘team’ , see below.\n‘Home laboratories’  I was only using Ray Roger’s own words. It is often very difficult to know with STURP researchers where their researches took place, whether in the public laboratories of which they were members or elsewhere. McCrone, of course, had his own business. I looked up Joseph Marino and, please correct me here, did find a long and interesting testimony of how God had brought him to the study of the Turin Shroud but no evidence that he done any laboratory work on the Shroud itself.\n‘Even the original pigments were taken off the cloth’, Pigments were on the Shroud, of course, no one denies that. I should have said ‘original pigments and other substances’. Even if you drum out McCrone  you have to accept that he found some pigments, Ray Rogers relies heavily on the pigment vermilion for his attempted refutation of the Carbon-14, and haemoglobin is a pigment of blood- all on the Shroud.\nThe problem is as follows. You have an ancient piece of linen, date unknown with an image the nature of which is unknown.  Naturally people are interested in it including a number of individuals from the United States. Looking at where the 1978 STURP members came from, I don’t see any working in laboratories that specialized in ancient cloth. Had a single member of the 1978 team specific expertise in ancient textiles, had any even seen one before they saw the Shroud of Turin in 1978?  I am happy to be given the evidence if you have it.\nThen there is the rush of events due to the short timescale given to the team for examination. They are not working ,of course, in laboratory conditions and photos show a mass of  individuals crowded around the Shroud. But the sellotape is applied, the Shroud is unstitched.  Who knows what damage may have been done? This is not normally the way professional examinations of ancient paintings is done- it often takes years- there are cases in the British Museum at the moment when the full report is not expected for years!\nSo the team make off back home after five days of frenzied work. Well, they have their 32 samples from all over the cloth, so what next? There is no evidence that they then teamed up with a museum conservation laboratory with experience in dealing with such material although there must have several in the US with the expertise to help them (again I am open to correction here). They seem to have kept the material among themselves. Then one of their members, Walter McCrone who has his own laboratory, is allowed to have access to all the 32 samples and comes up with a report that the samples are largely pigment. Consternation and eventually McCrone is forced out. This shows the weakness of the whole STURP approach of sending out the samples  to members of the team instead of people with specific expertise, this kind of result is bound to happen. I don’t know whether McCrone was right, broadly right but exaggerated the extent of the pigment, or totally wrong but the STURP procedures were bound to lead to fiascos such as these.\nA major part of the problem is that STURP increasingly became associated with the view that the Shroud was genuinely the first century burial cloth of Jesus and so its scientific credibility went down (whether it was/is right is not the question, it is the impression it gives of having decided the matter beyond all doubt, which is the antithesis of true scientific work. Compare the attitude of the Oxford radio-carbon-14 laboratory which says it will re-examine its 1988 results if evidence comes up to challenge them). When the  idea of professional carbon-14 dating came up, the Vatican started afresh by calling in people with the right professional experience in radio carbon-14 dating and textiles. This is ,of course, what they should have done all along. They should have handed over the Shroud in 1978 to a professional laboratory whose members had specific expertise in dealing with ancient textiles. I am sure that such a laboratory would have refused to allow any material from the Shroud out of their sight – there would have been none of this passing around of bits and pieces as seen in the Ray Rogers case below. Then outsiders who had particular expertise could have been asked in to see or work on the Shroud under proper laboratory conditions. Surely you have to admit that this would have been a better way of proceeding than the rushed 1978 examination.\nCompare these two accounts.\n1) From the Nature Report, February 1989 – a report signed by 21 individuals including six who were recorded as being at the selection.\n‘The sampling of the shroud took place in the Sacristy at Turin Cathedral on the morning of 21 April 1988.  Among those present when the sample as cut from the shroud were Cardinal Anastasio Ballestrero (Archbishop of Turin), Professor L. Gonella (Department of Physics, Turin Polytechnic and the Archbishop’s scientific adviser), two textile experts (Professor F. Testore of Department of Materials Science, Turin Polytechnic and G. Vial of Musée des Tissues and Centre International d’Étude des Textiles Anciens in Lyon), Dr M. S. Tite of the British Museum, representatives of the three radiocarbon-dating laboratories (Professor P. E. Damon, Professor D. J. Donahue, Professor E. T. Hall, Dr R. E. M. Hedges and Professor W. Woelfli) and G. Riggi, who removed the sample from the shroud.\nThe strip came from a single site on the main body of the shroud away from any patches or charred areas.  Three samples, each ~50 mg in weight, were prepared from this strip….. All these operations, except for the wrapping of the samples in foil and their placing in containers, were fully documented by video film and photography.’\nIn view of the numbers present and their professional qualifications in textiles and radio-carbon dating, this selection would seem to be a valid process. Note that Luigi Gonella was present but there is no record that he was involved in cutting the Shroud. \n2) And this from Raymond Rogers’ report in Thermochimica Acta (2005).  I have no evidence that Raymond Rogers had any particular expertise in radio-carbon-14 procedures.\n‘On 12 December 2003, I received samples of both warp and weft threads that Prof. Luigi Gonella had taken from the radiocarbon sample before it was distributed for dating. Gonella reported that he excised the threads from the center of the radiocarbon sample.’\nNote that the date he received these samples, the removal of which is not recorded in the original selection process, is over fifteen years later. When did Gonella take them from the sample? Did anyone see him doing so?  Where had the fibres been since then, held under what conditions?\nSo let’s not cast aspersion on anyone, let’s just say that the procedures by which the fibres arrived at the radio-carbon laboratories and Raymond Rogers’ laboratory fifteen years later were significantly different! The qualifications of each to assess radio-carbon-14 dating are also very different. Roger’s vague assertions about his fibres do not, of course, and he never claimed they did, provide an alternative date, nor do they provide any reason why a test on another part of the cloth should produce anything earlier than the medieval period. There is no reason to privilege Ray Rogers’ report above that of the Nature report although this is frequently done.\nI keep to the presumption that the ‘official’ radio-carbon14  report must take precedence until an equivalent  means of dating comes up with something different , possibly 6th-7th century when these images were first reported ( N.B. carbon-14 dating of Oviedo shroud at 7th century) or earlier.\nI think I have made my points clearly enough to withdraw here. Wearing my historian’s hat, the evidence that the Turin Shroud can be taken back the Edessa route seems non-existent. I haven’t seen any acknowledged Byzantine scholar (and it is a pretty specialized world needing years of study of ancient texts) who would support it.\n\n","date":"April 23, 2012 at 3:01 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10732","author":"Charles Freeman","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"For Ron (and also for any other fan of Wilson), I want to explain my « artistic » argumentation against Wilson more deeply by focusing on one very particular FACT :\nThe FACT (not a speculation) that there is absolutely no artistic copy of the Mandylion that render some features related to the Passion of the Christ that we can easily see on the region of the face on the Shroud (I refer here mainly to the bloodstains), is well enough to put a GREAT doubt on his hypothesis.  I don’t understand why people here don’t take that argument more seriously because it is one of the most difficult to deny !  For me, when I first heard this hypothesis of Wilson, I was already doubting it simply on the base of this single FACT !  And personally, I’m not aware that Wilson has ever brought some solid argument to explain this FACT.  I seriously doubt that he will ever be able to do so.  Some might argue that, in Constantinople, when the authorities discovered that the Mandylion was a burial shroud of more than 4 meters folded in 8, they decided to make a copy of the Mandylion in order to preserve the Abgar legend for the faithful.  And it is that “official” copy of the Mandylion that would have been reproduced over and over again.  I’ve heard this argument before and I wonder if that doesn’t come directly from Wilson.  Anyway, this seems to me so off-track that I can’t believe someone put any faith in an argument like that.  Effectively, how in the world the authorities of Constantinople would have done an inexact copy of the Mandylion by removing all the bloodstains ?  That idea is ludicrous.  If this scenario of an official copy would be true, then it is evident that this copy would have shown all the bloodstains that we easily see on the cloth in the region of the face !  And that very particular feature would have been reproduced by artists.  There’s no doubt about that.\nSo, to me, the FACT that all the surviving copies of the Mandylion (some of which have been made during the time the relic was in Constantinople and was probably publicly showed once a year) shows a face of the living Christ without any injuries or bloodstains is well enough to put very seriously the hypothesis of Wilson in jeopardy !  For me, this is in fact well enough to simply reject it.  And I’m not even talking about the FACT that the Mandylion (even if it was publicly known since the 6th, maybe the 5th century) had absolutely NO effect on the artistic depictions of anything related to the Passion of the Christ during all the time the relic was in Edessa and Constantinople (that represent a period of time of over 600 years) !!!  As I said, it is well known that the first depictions of the Passion that were showing bloodstains or blood flows only appeared during the 13th century in Europe and just during the 14th century in the Byzantine art (best example of this drastic change : the icons of the Man of Sorrows who came to be very popular in Europe during the 13th century).  This other FACT (not a speculation) is one more nail into the coffin of Wilson’s hypothesis and I’ve never seen him or anyone else being able to propose a logical explanation for this absence of influence of the Mandylion on any artistic work related to the Passion.  It is completely absurd to think that a relic that would have showed, for centuries,  the kind of “Passion” face we see on the Shroud (where any faithful could have recognize easily the crown of thorns) would have left absolutely no traces in Christian art, and particularly no traces in Byzantine art !!!  \nWhen we put the 2 arguments I just describe together, I think it is evident that the hypothesis of Wilson CANNOT give a proper answer to explain the problem of the absence of reference to a shroud of Christ with a body image on it.  There’s only one conclusion we can draw from what the history of Christian art have to tell :  WE HAVE TO SEARCH ELSEWHERE !!!\n\n","date":"April 23, 2012 at 10:56 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10743","author":"Yannick Clément","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Only Shroud Archeao(crypto)logy  and Shroud icono(crypto)graphy can shed the RIGHT light to correctly interpret the Byzantine and Latin texts.\n\n","date":"April 23, 2012 at 1:25 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10749","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"together with Syriac and Arabic texts\n\n","date":"April 23, 2012 at 2:41 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10755","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"\nYannick Clément :Ron, have you read all my good arguments against Wilson’s hypothesis ? I still wait for you to challenge them !!! :-)\nWhy should I bother? I have many times in the past you just ignore them…Read Wilson’s book thats all I say.\nRon\n\n","date":"April 23, 2012 at 2:07 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10753","author":"Ron","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"I had planned to opt out of this discussion but looked up a library copy of Wilson’s latest (2011) Shroud and his account of the birth of the Edessa image is complete and utter nonsense. On p. 162, he quotes from the Doctrine of Addai, which is a later fourth/ early fifth century legendary account which includes STORIES about King Agbar. Wilson’s quote comes from an account of Addai coming before King Agbar and his face shining , although no one else other than Agbar can see this. A page later Wilson says that this is the Turin Shroud aka the Edessa image. Well ,why should this legend of Addai’s actual living face have anything to do with any shroud image of Christ – why should it relate to any cloth/painted image at all?. There is absolutely no hint that this is about an image at all- its one of the miracles of Addai, of which there are many others.\nI think we should stick with serious scholarship and just acknowledge that there is nothing that can be seen as an image  in Edessa until the late sixth century when in other regions,  several of these images are recorded for the first time.The image is, how often does one have to repeat this, always said to be Christ while alive and this is why copies of the Mandylion always show Christ with his eyes open without any marks of suffering. As Belting says, this was a time when there was some conflict over whether there should be images of Christ and the invention of a legend (one version of the Edessa origin) that Christ had sent an image of himself was used by those who argued that he could be shown.\nI had not expected Wilson to lay himself open quite so easily to derision but, as we have seen, there are people who do continue to believe him. I wonder, how many support his ingenious idea that the Carbon-14 dating was contaminated because that is where hands held up the Shroud. But how often was it exposed, how was it held up so that the whole image could be seen , do we know that the hands were consistently in the same place, is there any sign of wear and tear that one would expect from continual handling, was there really enough sweat to contaminate it (without causing decay) and how did this come to the amount to make a first century piece of linen come exactly to the radio-carbon -14 date 1260-1390. A miracle, I would have said.\n\n","date":"April 23, 2012 at 3:03 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10757","author":"Charles Freeman","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"You sure your reading the right book? The 2010 edition. Wilson definately does not base his hypothesis on the appearance of the Edessa cloth in the King Abgar story but more so on eye-witness testimonies given whilst the Mandylion was present in Edessa.\nOr maybe your just reading what you want to read.\nRon\n\n","date":"April 23, 2012 at 3:19 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10761","author":"Ron","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Let’s forget Wilson’s ideas about the C14 dating he is not a scientist but a historian, whom has done extensive study over the past 40 years on the Shroud. Pretty funny how people can read a few books and feel they have enough knowledge too totally dismiss Wilson’s hypothesis out of hand….what a joke, really.\nCharles if you are truly a scholar in any field of arhcaeology how can you accept, as easily has the so called scientists/historians the SINGLE sample test done in 1988 which by the way went against all other known evidence at the time?\nTo me those in ’88 which claimed a 95% conclusion to the results should be dishonoured for their misleading results….period.\nEven anovice should understand their errors.\nRon\n\n","date":"April 23, 2012 at 3:31 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10763","author":"Ron","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"My colleague has read him and it’s full of bias like you can’t believe !!!  The guy think that the Abgar legend offer real historic informations !!! INCREDIBLE !!!  I want to shout this :  HEY WILSON !  THE FIRST VERSION OF THE ABGAR LEGEND DIDN’T EVEN MENTIONNED AN IMAGE AT ALL AND JUST MENTIONNED AN EXCHANGE OF LETTERS BETWEEN JESUS AND ABGAR !!!  SO IF YOU THINK THIS LEGEND OFFER SOME TRUE HISTORIC INFOS, THEN WE HAVE TO BELIEVE THAT JESUS REALLY WROTE A LETTER TO THE KING.  ALL THIS WHILE YOU KNOW REAL WELL THAT THE CHURCH HAS DECLARED THOSE LETTER TO BE APOCRYPHAL DURING THE FIFTH CENTURY !  I’LL SAY IT AGAIN :  THIS MANDYLION HYPOTHESIS IS THE BIGGEST CRAP EVER THROWN INTO THE FACE OF THE SHROUD WORLD !!!\n\n","date":"April 23, 2012 at 3:42 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10766","author":"Yannick Clément","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"And here’s another message to Ron :  You’re not correct about Wilson pedigree !  He’s not at all an historian.  He’s a journalist and a writer and he makes money on your back… :-)\n\n","date":"April 23, 2012 at 3:44 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10767","author":"Yannick Clément","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"And while Ron and others just can offer some bla bla, I still wait for someone to really challenge my arguments against Wilson taken from the history of Christian art and also, from the fact that there is absolutely no ancient list of relics related to the Passion that have include the Mandylion…  I think all those FACTS are well enough to completely reject this weak hypothesis.  Wilson looks like someone who know he’s wrong but because he has so much written about that subject, he’s stuck with his idea and cannot retract.  I’m sure he’s smarth enough to know that his hypothesis is no good.  But, of course, he will never admit that he’s wrong…\n\n","date":"April 23, 2012 at 3:49 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10769","author":"Yannick Clément","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"OK Yannick just keep making History your interprative AlMighty God and just keep overlooking any Shroud archeaological and icono(crypto)graphic evidence and even facts that points to the contrary. You are even free to be wrong…\n\n","date":"April 23, 2012 at 4:10 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10771","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"…relatively wrong or right or… right.\n\n","date":"April 23, 2012 at 4:12 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10772","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Take it easy…\n\n","date":"April 23, 2012 at 4:15 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10773","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"I just defend what I think his the truth, i.e. that Wilson’s hypothesis is NOT the answer.  That’s all I say and my arguments to contradict him are solid.  We have to look elsewhere !  That doesn’t mean the Shroud is not authentic at all !  That simply mean that the Mandylion was not the Shroud, even if I’m convince, just like Paul Vignon, that the Mandylion was an artistic relic base, directly or indirectly, on the Shroud.  If that’s true, then that mean the Shroud was around and known of some persons around the fifth or the sixth century, when the Mandylion first shown up in Edessa…  That’s positive, don’t you think ?  And we can do the same link with the Pantocrator icon who first appeared around 590 in the Ste Catherine monastary in the Sinai…  That icon was also considered by Vignon as being based, directly or indirectly, on the Shroud itself.\n\n","date":"April 23, 2012 at 4:54 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10776","author":"Yannick Clément","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Ron: Just to put the record straight, I am a historian (although I worked on archaeological digs in Italy, Turkey and the Sudan before noting how my trenches always fell in !)  and you can find the books I have written on the internet. As I have done a lot of work, for university presses, Oxford and Yale, on early Christianity, relics, etc,I think I have some right to state where Wilson has gone wrong. He has a habit of completely misreading medieval sources  to suit his strange thesis that the Edessa image/Mandylion is the Turin Shroud.\nBut I shall leave you to draw up your formal indictment of the men of 1988! Having seen how Wilson rubbished the ‘reweaving’ theory  I wonder which of the many competing hypotheses is your favourite.\n\n","date":"April 24, 2012 at 3:26 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10800","author":"Charles Freeman","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Charles I was never questioning whether you were a scholar or not, to be fair you only mentioned writing some books and that you had some archaeological experience in the past. So on that information and knowing you should have enough knowledge, I asked you; How can you accept the 1988 radiocarbon dating conclusion without question? Forget Wilson, forget deWesselow, How can you or anyone in their RIGHT MIND accept a c14 dating from a SINGLE sample, from a SINGLE section of a cloth, where the actual provenance of the sample is NOT known, where several BASIC c14 testing protocols were not met and the results contradicted most all scientific evidence already known?….That was/is my question…..So far no one can answer this and to me it is a mystery, if one follows scientific protocol why they would accept this dating,…simply, if one does, I say they are ignorant of the c14 process and it’s limitations.\nR\n\n","date":"April 24, 2012 at 9:23 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10810","author":"Ron","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"P.S. No, Ron , i was reading the latest ( 2011) edition of Wilson , and if you can follow his thesis on pages 162-3 as to why an extract from the legendary Doctrine of Addai written probably in the early fifth century refers to an image of Christ of the first century, then you have a more imaginative mind than i have. He completely fails to give any evidence for the existence of an image in Edessa before Evragius ‘ report in the 590s.\nIf you read Hans Belting’s Likeness and Presence : A History of the Image before the Era of Art, University of Chicago, 1994, you will find a truly scholarly account of all these references to images and icons – that is the book that the mainstream historians of relic images use.\n\n","date":"April 24, 2012 at 3:33 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10801","author":"Charles Freeman","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Charles, if the book you are reading is a 2011 edition, unfortunately I don’t have that one, my edition is dated 2010, and I can’t refer to it at present as I lent it to my sibling. Anyways if your looking for evidence of the Image of Edessa prior the mid to late 6th century…good luck. Before the mysterious appearance of the relic in 540, I don’t think there is any mention of it anywhere as it is speculated it was hidden/missing. One must look at it simply; A relic appears in Edessa after the flood of I believe 540 or so, proported to have an image of Christ and ‘not made by human hands’..okay simple enough, just decades or years later all depictions of Christ change to a bearded mustached, long haired Jesus, copies are made and sent all over the empire. These images ‘copied’ from this Edessa image match with dozens of points of congruenty to the Shroud we have today. How much clearer can the evidence be, that this Image of Edessa was the Shroud?\nI strongly believe one does not have to be an Art historian to understand this and silly questions like do you see any suffering on these images, are just rediculous childish, nonsensicle questions as most all renditions of Christ never showed suffering or blood…one must must be blind or stupid not to see this. I will attempt to check the reference you made above as soon as possible but my recollection of Wilson’s writings includes eye-witness discriptions of the Image of Edessa having blood secretions from the head and side.\nR\n\n","date":"April 24, 2012 at 9:45 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10811","author":"Ron","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Ron- on Wilson. If you get the 2011 edition look at page 240. Here he quotes a source, I think from 1090, which says that the Mandylion was kept locked up and that only the emperor could see it.  It was ,of course, in the Pharos Chapel, the private chapel of the emperors . So unless the emperors reversed their decision about this, it was not on view to ordinary mortals . This just confirms that it is unlikely to be the ‘sheets’ in the Pharos chapel, which are listed separately in 1201 anyway , and certainly not the same as the exposed shroud with an image in the Blachernae chapel at the other end of town. Most commentators who want to take the Turin Shroud back beyond the Middle Ages, say that the only shroud that corresponds to the Turin Shroud is the Blachernae one. Wilson goes against this ,of course- he sticks with the locked up Mandylion.\nBut I had limited time and did not read further to see how he resolved the question. The problem remains ,of course, that we know that the relics in the Pharos chapel were not touched in 1204 and that many of them went on in the years afterwards to Louis IX’s Sainte-Chapelle, where the Crown of Thorns that he got from the Pharos Chapel ( via some Venetian bankers!) was the star attraction. There is some evidence that the Blachernae shroud may have gone into Europe via Athens. So perhaps the real question should be, forget about the Edessa image, and try and trace the Blachernae Shroud back. We know that many of the relics in this chapel were placed there in the first half of the FIFTH century by Pulcheria , the sister of the emperor Theodosius II ( ruled 408-450). So this might get the Blachernae Shroud back this early, 150 years earlier than the first mention of the Edessa image. it seems a much more likely route than Edessa. The Blachernae Shroud was said  to be a burial shroud of Jesus, there is no evidence that the Edessa Shroud EVER was, whatever Wilson might say.\nSo Shroud sceptic though I am, I am putting forward a far more plausible ‘history’ of the Turin Shroud than Wilson is!\n\n","date":"April 24, 2012 at 10:49 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10815","author":"Charles Freeman","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Ron. The provenance of the sample is well known and recorded on film, unless you subscribe to the conspiracy theory of Tite and the Cardinal later swapping a sample over. I don’t as it is seems simply ludicrous. I was surprised that de Wesselow appeared to entertain it.\n The sample has a far better provenance than the fibres obtained by Rogers for instance which cannot ,in any way, meet scientific criteria- we don’t even know how they were stored or transported to Rogers or whether they were what they purported to be.\nI accept the 1988  finding until a clear alternative is put forward as to why the testing was not accurate. For this there must be a consensus.  We do not have any agreement over whether the problem is contaminants or reweaving.  You cannot convince a old sceptic like myself so long as those challenging the Carbon-14 cannot even agree among themselves what went wrong with the work of three professional laboratories. It is not good enough to put forward a series of vague possibilities as to why the testing might not be accurate.  \nSo I stick to my original position that for me the presumption  is that the testing must stand and if there is a retest, my hunch is that,  while they may be some readjustments with a different sample, the date will emerge again as medieval . I stress PRESUMPTION.   I have no reason to prefer any one date over another – after all there was ONCE a burial shroud or burial cloths of Jesus, just as  there was a cross and nails, and probably a Crown of Thorns and a stone that was rolled away from the tomb and goodness knows how many other  relics. No one is suggesting that these relics never existed at one point in the first century.  The question to me as an archaeologist/historian (stress, this largely an archaeology problem- I have worked on first century AD digs and I know how little survives) is did these particular items survive or not?  The probability , overwhelmingly, is not, as a bloodied sheet would have been unlikely to have been kept by Jews ( I stand to be corrected by Jews on that one), relics were not collected as such before c. 380( just as they are not collected by Protestants today) and damp would almost certainly have destroyed the cloth. This is common sense and this is where I always find it easier to start when working on a historical problem. That is where I started with the Shroud case when I was working on my history of relics – there has never been any other relic from the first century that has been proved to be such – so this one would really have had to have a most unusual history, one that certainly has NOT been tracked by Ian Wilson.\n The best way out of this is to do another C-14 testing. At present there is not a shred of carbon-14  evidence for a first century date. There is not even a calibrated set of results for vermilion deterioration so even if samples were gathered, or failed to be gathered, from across the Shroud , there would be nothing to test them against. (Rogers appears to have been a loner here and no one has followed him up.)\nOf course, the way that the Shroud has been mauled about by various parties with no experience of working with ancient textiles has made the Vatican suspicious about passing it out again. But I suspect that if any carbon-14 dating laboratory with an international reputation could put forward a coherent case for retesting, they might give in. Perhaps you and your supporters could work on this. If your case is as clear as you say it is,then surely a  professional laboratory somewhere would back you.  Certainly Oxford are quite open to it as they showed with their testing of John Jackson’s theory of carbon monoxide contamination (and they have made it quite clear that they are open to new evidence- what more can you ask?- they are certainly one of the world’s top r-c labs).\nSo let’s see how we go. I appreciate that your interest in the issue is many times stronger than mine for whom the Shroud is only one of hundreds and thousands of relics, authentic or otherwise, that still exist. As I say above, all these relics recorded in the gospels did exist at some point , but did they survive? That seems to me to be the question to focus on. I can see that I approach this question in a very different way from the way you do, but why not? There are many paths to the truth!\n\n","date":"April 24, 2012 at 10:28 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10813","author":"Charles Freeman","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"It’s funny how people will SHIRK the question I raise by trying to twist the words into this being a conspiracy theory! By the way don’t you find it atleast ‘odd’ that they did not video-tape the 30 or so minutes they spent in the ‘other’ room? LOL. There is alot more too it then you are aware. I’ll point you to some reading later…\nFurthermore, your answer or non-answer to my question forces me to believe, no, I am 100% sure you understand very little to nothing about radiocarbon dating itself and it’s prerequisites in the scientific sense, or what transpired during the 1988 c14 fiasco and LIE!….When I mentioned provenance of the sample, I simply meant that they know very little of what conditions the sample or Shroud has been kept over it’s life, where and how it was stored etc;. A technician carbon dating a strip of linen from say an Egyptian mummy knows this sample has been in this spot since it’s use, this information is vital too c14 and it was/is definately unknown when we speak of the Shroud. Basically many of the ‘BASIC’ protocols or procedures to proper testing were not adhered too and even many of the actual scientists involved back then contested the decision to using only one single area/sample from the Shroud. Which would not be ‘representative’ of the complete Shroud….even Prof Gove!, co-inventor of the AMS system.\nI strongly suggest you research radiocarbon dating in depth. To understand why I ask my question and why I am dumpfounded that people with much more standing then I, do not come forward and raise this same question.\nSuggested reading;\nEvidence is not Proof: A response to Prof Timothy Jull by Mark Oxley 2011*.\nRadiocarbon Dating the Shroud of Turn: The ‘Nature’ Report by Remi Van Haelst.\nChronological History of the evidence for the anomolous nature of the C14 sample area of the Turin Shroud by Joseph Marino and Edwin Prior…There is also an addendom paper to this.\nThese can all be retrieved from http://www.shroud.com if you like.\nRon\n\n","date":"April 24, 2012 at 11:57 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10816","author":"Ron","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Fine, Ron. Why don’t you get in touch with Oxford -or some other lab. as I suggest to see if you can get all this restarted. It obviously worries you a lot more than it does me.  If the Shroud is first century , well ,we know a shroud or burial cloths existed then ( see John’s gospel) so , extremely unlikely though it might be , it is just possible that it survived. We may also find the Crown of Thorns, and some of those phials of blood may really have been taken from Jesus on the cross (just check that they are AB), and the stone that closed up the Tomb would not have suffered the problem of damp, so presumably it is still around somewhere. Then what?  Most Christians broadly accept the historical evidence of the gospels,so  not that much would change if some of the recorded backing evidence ever turned up. As one clergy friend of mine said when we were discussing this, it matters nothing to me whether the Shroud is genuine or not- I will still believe in the Resurrection. Still, if I was you, I would work really hard on getting  a new testing to set your mind at rest.\nNow the other issue. Here is an extract from Holgar Klein’s article on relics in Constantinople. If you google the author you will find it on his website. If I was looking for a way in which the Shroud or any other relic came to Constantinople from Jerusalem I would start here. There are many more documentary sources than Wilson can ever find in support of his theory ( as listed below) and they are much earlier – but,of course, he is so obsessed by the Edessa route, he won’t consider much more likely routes for the transfer of relics from Jerusalem to Constantinople. We are talking here of the 330s!! As I do quite a lot of work on Constantinople, and have been there recently setting up a study tour I am leading in October, I can tell you that the column of Constantine still stands although it is very battered.We even have a wonderful ivory relief from about 420 showing the arm of the martyr Stephen coming into Constantinople.\nKeep with Wilson if you must but there are far,far better historians around- Klein is one of them, and here he provides a much more plausible possible route for  the Shroud than Wilson ever does. If it came into the city from Jerusalem in the fourth century, was included among the relics that Pulcheria placed in the Blachernae chapel in the 420s, kept away from the damp (unlike the Edessa image in the city gate), then this would explain why Robert de Clari saw a burial shroud with an image of Christ on it  in this very same chapel eight hundred years later. You also have a far shorter time between the crucifixion and the transfer of the relic to account for.\n‘It is a common belief – based by and large on Ambrose’s funerary oration for Theodosius the Great, some passages in the church histories of Sokrates, Sozomenos, and Theodoret, and much later patriographic records – that Constantinople’s rise as a cult center for the relics of Christ’s Passion has its origins in the time of the city’s foundation under Constan- tine the Great. According to these sources, Constantine himself received part of the relic of the True Cross and the Holy Nails from his mother Helena, who allegedly discovered them on Mount Golgotha during her pilgrimage to Jerusalem. In the capital, Constantine is said to have enclosed these relics – together with holy chrism, the crosses of the two thieves, and the palladion of Athena – inside the honorific column and statue that adorned the emperor’s Forum.’\nWhy not the burial shroud as well?\n\n","date":"April 24, 2012 at 12:27 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10817","author":"Charles Freeman","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"What worries me is the total idiotic statements like “Well the carbon14 tests proves it is only 700 years old, and why should I question the results” or ” Until someone can refute these tests, I have no reason to question the labs results” It is this total ignorance to the science that bugs me. Skeptics will question where Rogers got his samples and question his ‘PEER-REVIEWED’ paper, twice reviewed! and there is really no question to the provenance of his samples if one to were to investigate further, atleast not less then the ’88 samples, but then in the same breath take the ‘Nature’ paper at it’s word…it’s so sadly wrong, it is almost laughable…get my point? If people understood RCD and all it entails they would not BLINDLY accept these tests….simple.\nI will read Klien’s article as you suggest and get back to you.\nThanks,\nRon\n\n","date":"April 24, 2012 at 12:52 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10818","author":"Ron","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Forgot to mention; If the Shroud came to Constantinople in the 3rd or 4th century, how do you explain no mention of it then? None whatsoever! Don’t you think the actual burial Shroud of Christ would warrant huge fan fare? There is absolutely nothing in historical writings or art to make any Historian think the Shroud was in Constantinople before 944. But we know almost for sure something with the impression of Christ on a linen sheet was brought to that city from Edessa in 944, as the king sent a whole army to get it…Oh and just so you know; the climate in Constantinople is a much damper local then Edessa, you should really check your facts before stating them.\nR\n\n","date":"April 25, 2012 at 2:58 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10827","author":"Ron","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Ron, as I know, there’s only one reference about the burial cloths of Jesus being in Constantinople as soon as the 5th century and that came from a manuscript written in the first half of the 14th century.  The author made a link between the Blachernes church construction under Pulchery and the presence of those relics of the Passion.  I think he could have made an understandable mistake by thinking that the burial cloths of Christ were there at the beginning of that church, because he wrote his manuscript AFTER the public showing of the Shroud at the Blachernes church in 1203-1204.  Personally, I’m VERY careful with this source, because I’ve never seen another reference like that elsewhere.  So, for the moment, as I know, this source CANNOT be confirmed.\n\n","date":"April 25, 2012 at 8:32 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10833","author":"Yannick Clément","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"I wouldn’t call that even a ‘reference’ at all. It is just too far departed from the time in question. So basically it is not worth even mentioning. Fact is there is ZERO evidence the Shroud was tranported to Constantinople before 944 , period.\nR\n\n","date":"April 25, 2012 at 3:35 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10841","author":"Ron","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"The fact that there is zero reference just contributed to support the idea that it was a “religiously incorrect” relic not to be showed publicly because of his horrible and crude aspects for the time.  I said it before, this kind of burial cloth with lots of bloodstains on it and showing a dead and nude Christ was surely not a winner during those days.  This, in itself, can be enough to explain why there is no reference of his arrival in Constantinople.  At that time (prior to 958, the first date we can trace it in Constantinople with some level of certainty), it’s probable that the clergy didn’t want to make a big noise with this kind of “problematic” relic…  To me, this can well be the most important thing that can explain the absence of any reference about his arrival in Constantinople.  Remember also that there’s some chances that the relic arrived in that city between 726 and 84, at the heart of the iconoclast period, where any religious item with an image was in great danger.  If this is when the relic arrived in Constantinople (who was the capital of the iconoclasts), then you can understand easily why the cloth arrived without fanfare, without any public display and without a big parade !!!  This scenario is quite possible…  Ever think of it Ron ???\n\n","date":"April 25, 2012 at 3:46 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10842","author":"Yannick Clément","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Thanks, Ron, I think the idea that the image of Edessa is the Shroud of Turin is so bizarre that it is not worth considering. I always thought that and when I read Wilson on it, it was clear that he had failed to tackle the basic questions and used the sources in a totally misleading way. Believe him if you must. He has no background in the history of the period and I would prefer to rely on trained Byzantine scholars such as Klein and Belting.\nWe know a shroud with a full length body image on it  that was claimed to be the burial shroud of Christ was in the Blachernae Chapel in the early thirteenth century ( Robert de Clari) and was exposed. So it must have got there somehow. The question is how. If I was doing further research on this, which I am not, I would follow up all the early sources, and there are many,which deal with the links between the imperial family and Jerusalem from 330s onwards during which we know that a lot of early relics linked to the Crucifixion were brought from Jerusalem into Constantinople. As I have not been through these original sources, I would not know whether there was a shroud or any form of cloth mentioned.It would be a chance whether any document mentioning it survived or not as we only have a tiny proportion of the original documents,  I would be particularly interested in Pulcheria because she had her own links with Jerusalem and imported a number of relics from there- see the relief of her welcoming the arm of Stephen in c.420 which came, of course, from Jerusalem. You can find some preliminary details in my book Holy Bones, pages 40-41. So it is possible that a Shroud was among them- this seems the most likely time for it to come but you are free to suggest any other period when it arrived. You have to explain its presence somehow!\nYou say the Shroud would have great fanfare but I don’t think it would have rated as high as the Cross (this was the most treasured relic of the Pharos Chapel as you will see from reading Klein) or the Crown of Thorns. Nor would a burial cloth have had the same resonance as an image of the LIVING Christ given by him to king Agbar,  Remember the imperial family had many relics of the Passion and Crucifixion including the actual blood of Christ and the shroud would probably have been quite low in the pecking order. Note too that another image of the face of Christ while alive, the Veil of Veronica , was rated even more highly than the Mandylion. It is always a mistake to assume that, among the hundreds of relics of the Passion and the crucifixion, that the Shroud would have had any special status.\nThe Blachernae Shroud cannot have been the Mandylion as, and here Wilson actually provides the evidence , on p. 240 of his 2011 edition, that the  Mandylion was in 1090 locked in a chest and only the emperor  was allowed to see it.In 1201 it is listed as still being in the Pharos Chapel. So it is certainly not the same  as the purported burial shroud of Christ in the Blachernae Chapel which was the other side of town.\nOnce on Constantinople, the Shroud would, of course, have been stored under cover in the church sacristy, so protecting it even from the damp of Constantinople, along with the other cloth relics we know were in the Blachernae chapel, notably the robe worn by the Virgin Mary. It would have been much more likely to have survived there than in the gate at Edessa!\nAs I have said, this is where I would direct my research because there is clearly a much more plausible ‘story line’ here. Like any good historian , if I did not find the documentary evidence to support the case, i would not twist the documents to make a case and would probably end up saying that one can only speculate from the limited sources!\nMost commentators who have tried to find the link between the Turin Shroud and an earlier history in Constantinople have elected the Blachernae Shroud as the ONLY shroud that seems to have any relevance to the debate. The Pharos sheets are said to have been of poor cloth and there is no record of an image on them, the Mandylion was locked away and was, anyway, ALWAYS said to have been an image of Christ while alive. I don’t know whoever first  put forward the idea that the Mandylion was the Shroud- it makes no sense to me at all.\nI hope I have shown you and any other readers that there is more to this than Wilson ever suggests and, for those who do believe that the Shroud is genuine and came down through Constantinople, some much more promising avenues to explore than the watery Edessa route! But you do need to know your Byzantine Greek because not all the relevant documents have been translated and you would not want to miss a vital reference to the Shroud because you did not know Greek!\n.\n\n","date":"April 25, 2012 at 3:54 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10828","author":"Charles Freeman","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"I would disagree with you on some aspects; One; NO fanfare! Ridiculous! This would undoubtably be the most revered icon as it has the ‘imprint’ of the Lord Christ himself along with his blood! If it had been opened and they viewed the whole body, the image would be miraculous in their thoughts, easily far out weighting anything else they had, as there would be to them no question of it’s provenance, unlike the blood or the pieces of the cross whatever. Nevertheless one would think it would have been atleast mentioned somewhere. The Edessa route although not fullproof still has the most potential for being the more plausible route, remember the army sent to them and returned with what supposedly was the “face image only” of the Image of Edessa, but the same night of it’s presence in Constantinople it was described with blood on the face and on the side, in a sermon…a bit more tangible don’t you think?\nI also managed to skim thru alot of Klien’s writings and it gives me no incentive to believe the Shroud could have been one of the many supposed relics which Constantine collected. Furthermore, I see no reason to accept Klien as a better source then Wilson as they both seem to get their info from the same sources; writings and such are identicle!. Remember Wilson does not work alone, he uses many people ‘specialized’ in areas of study to confirm his writings, in most cases. Also I think Wilson has Klein beat by about 30 years in experience.\nRon\n\n","date":"April 25, 2012 at 3:53 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10843","author":"Ron","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"The most revered ?  You just see this with your eyes of a 21st century man.  THAT’S WHERE YOU’RE COMPLETELY OFF-TRACK.  \nYou say that the shroud images would have been considered by them to be miraculous.  This phrase applied to you instead of them !!!  ;-) \nAnd one important thing you don’t seem to get is the FACT that there are many other important relics related to the Passion of Christ that don’t have any more reference about their arrival in Constantinople…  The Crown of Thorns is a perfect example of that.  What do you think ?  That there was internet and CNN back then ?  A journalist hide behind every wall ???  Ricidulous !  \nFor the Sermon, it’s a pure joke to understand it as being a real physical description of the relic.  A pure joke.  Did you read Guscin thoughts about that sermon ?  You should !  He said it all !!!  Here it is :  http://www.shroud.com/pdfs/guscin3a.pdf\nBy the way, Emmanuel Poulle (a real historian, unlike Wilson who is a wannabe) was like Guscin : he didn’t understand this sermon as being a physical description of the Mandylion.  And if would have been a real physical description, then explain to me why the depictions of the relic hadn’t changed after that ???  There’s no explanation, since the relic was just what it is report to be : a face only image of Jesus on a small cloth.\nKlein is a specialist in his field.  Wilson is a wannabe who his completely full of bias.  My friend in France who wrote the article on the Mandylion with me give me some parts of Wilson’s book and you can’t believe how much he his dishonest intellectually !  INCREDIBLE !  He mention the Doctrine of Addaï but without mentionning the FACT that the author state that the image of Edessa was a painting of Jesus done by the artist of the king !  If this is not dishonest, I don’t know what it is !  You really think a REAL historian work like that ?  Meaning that he take what seem to be good for him (i.e. about 2% of all the existing sources) and forgetting all the rest because it goes against his hypothesis (i.e. about 98% of all the sources !).  You really believe that’s the way an historian (or any credible scientist) work ?\nThe fact is this :  Outside the Shroud clique, real historians (those who have nothing to gain from proclaiming the Mandylion was the Shroud folded in 8) are laughing out loud when they heard about Ian Wilson and his ideas !  He’s a joke.  And a very bad one. \nAnd one other thing :  You never even give me one fact that can challenge my argument concerning the history of Christian art related to the Passion.  How can you explain with logic that no copies of the Mandylion are looking like the Shroud face and how can you explain with logic that the Mandylion had no influence at all regarding the art of the Passion before the 13th century, even if this relic was known and shown publicly for centuries ?  It is absolutely impossible that if this was the Shroud face, that there would not have created some major changes in byzantine art !  But the fact is this :  Those changes are non-existent.  The History of Christian art is clear about that…  Also, you never give me one logical explanation for the absence of any noticeable difference in the physical and chemical composition between the face region on the Shroud and the rest of the cloth !  If Wilson was right, the Shroud face alone would have been exposed directly to air and dust for centuries.  How in the world this setting would not have leave some traces that the STURP team and the restoration team would have easily noted ?  This is another argument that is well enough to completely reject Wilson idea.  Sorry to break up your dream my friend. ;-)  This last part is a joke of course, since I know perfectly that you will never change your mind about anything related to the Shroud.\n\n","date":"April 25, 2012 at 5:04 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10847","author":"Yannick Clément","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Yannick, please take note of the image at the top of this page.\nThank-you.\nR\n\n","date":"April 25, 2012 at 5:24 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10848","author":"Ron","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"That’s precisely why I wrote that whatever I’ll say to you, you won’t change your mind !!!  You see that I’m not dumb…  It’s sad to see that you’re not open to consider other possibilities than the one proposed by Wilson.  I think shroud research in historic field would gain to start to look for other hypothesis.  It’s about time.\n\n","date":"April 26, 2012 at 8:32 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10859","author":"Yannick Clément","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Oh Charles to your comment that the Mandylion was always described or ‘thought to have’ been an image of Christ while alive, is actually pretty weak, as it could simply have been misinterpretted that way. As also several eye-witness decriptions talked of it being ‘not made by human hands’ and like the secreation of sweat or bodily fluids, ….sound similar to anything we know of today? ;-)\nR\n\n","date":"April 25, 2012 at 4:27 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10844","author":"Ron","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Ron. No , the idea that it was Christ while alive  is not weak. It was the absolute essence of understanding the Mandylion and there has never been any other legend attached to it. There is no way that the image of the Turin Shroud , especially if shown at full length , could be interpreted to be that of Christ while alive . Yet the Mandylion is said, in several different documents ,to have been an image of Christ taken during his lifetime ,either as a gift to Agbar or from his face in the Garden of Gethsemene ( ‘sweat ‘ comes when you are alive, not dead!) .But if you can’t see that ,there is little more that I can do for you. I can only endorse Yannick that Wilson is seen as a joke as a historian in circles outside those of the pro-Shroud community. Where is his basic training in the history of Byzantine images and sacred literature associated with them?\nWhy not concentrate on the Shroud in the Blachernae Chapel? It must have got there somehow and it fits the description of the Turin Shroud . So long as you don’t test my patience further by saying that it had been transferred there from the Pharos Chapel which was the private chapel of the emperors within the imperial palace.  Now that would have caused headiness: ‘Emperor allows his private collection  of precious relics of the Passion and Crucifixion to be transferred to the other end of town!” As we know that they were still in the chapel after 1204 and most were sold to Louis IX where they are recorded in the Sainte-Chapelle, that is truly a non-starter.\n\n","date":"April 26, 2012 at 3:32 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10852","author":"Charles Freeman","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"I see you have been sworted by the same rediculousness known as Yannick…” (sweat comes from when you are alive, not dead)” I guess you didn’t understand. Look at the Shroud, many would say the image looks as if it could have been made by sweat, and without all the knowledge we have today of the actual image details that is quite a reasonable assessment. It is not too far fetched to believe that that is exactly what they “supposed” back then, hense thier ‘impression’ the image was made while Jesus was still alive. Get it? \nAlso very few would have had access to the Shroud/Mandylion as it was mostly kept locked away and taken out very rarely. It is quite reasonable to state only the very highest in standing would ever view it close up and even fewer on the occasion when they opened the cloth completely to view it’s full image. We also do not know for sure the Mandylion was in the list of relics in 1204, this has been covered before and I won’t bother going thru it again. Infact most of the crap Yannick has been repeating here has been covered before and delt with by many here. He and now you his sidekick seem to just ignore alot of points made by others…been there, done that….ciao.\nR\n\n","date":"April 27, 2012 at 1:38 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10877","author":"Ron","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Ron. Nicholas Meserites lists the Mandylion as being in the Pharos Chapel in 1201. The fact that only those of highest standing would have seen it, puts paid to the theory that it was seen ,close  enough up for the herringbone weave to be detected, to be reproduced on the Pray Codex of c.1192. A Catholic,as we assume the illustrator of the Pray Codex to have been,  would never have been allowed within the Greek Orthodox Imperial Chapel as the two churches were in schism.\n I am trying to help you here by diverting you towards the burial shroud in the Blachernae Chapel. It fits the description of the Turin Shroud better and was exposed to the public. It was also in a chapel founded by a fifth century princess who is known to have received relics from Jerusalem.So do please accept that there are other ways to explore the history of the Shroud. No one, but no one, in the real world of scholarship has any respect for Wilson’s theory.\n\n","date":"April 27, 2012 at 3:09 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10878","author":"Charles Freeman","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"Charles Freeman’s comment is right on the target my dear Ron !\nWhen you put the testimony of Mesarites and Robert de Clari (2 eyewitnesses) together, there no other way to conclude that the Shroud was one relic, probably the same as the Shroud kept in Turin today, and the Mandylion (along with the Keramion) was another relic, DIFFERENT from the Shroud showed in the Blachernes church in 1203-1204.\nAny reasonnable person (without any preconception about the Mandylion hypothesis of Wilson) would conclude this…  Don’t forget that Mesarites was the keeper of the relics in the Pharos chapel and he knew real well all those relics.  If he separate the Shroud with the Mandylion in his testimony (in fact, I should say testomonies, since he repeat it in 1207), why searching for another explanation than to think that those were 2 different cloths and that the Mandylion (and the Keramion) had nothing to do directly with the Shroud of Christ (conclusion : they were most probably not relics related to the Passion) ?\n\n","date":"April 27, 2012 at 10:56 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10883","author":"Yannick Clément","site":"shroudstory"},{"title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong","post":"One more comment for Ron and those like him who believe blindly in Wilson’s ideas :  Don’t forget also that Mesarites and de Clari’s testimonies have nothing to do with legendary stuff.  They were really eye-witness accounts.  This is one major aspect of the historic research about the Shroud and the Mandylion that Wilson and his followers always seem to forget (or to underestimate) :  A list of relics like the one of Mesarites or the one of Robert de Clari is much more reliable, historically speaking, than any legendary story, whether it’s the Narratio de Imagine Edessena, The acts of Thaddeus or the Doctrine of Addaï…  And despite this most evident truth, we still see Wilson and his followers relying mostly on speculations, extrapolations and special assumptions taken from legendary, theological and/or poetic stuff !  If you prefer to go with those guys who doesn’t work with any kind of proper and honest scientific method, that’s your freedom.  Personally, I won’t !\n\n","date":"April 27, 2012 at 1:00 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","id":"comment-10884","author":"Yannick Clément","site":"shroudstory"}]
