[{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"In an age when provenance was vital for getting a relic accepted, it would be extraordinary if Lirey did not advertise where they had got their relic from when this would have given it enormous prestige and a chance to get it accepted as authentic. But perhaps this crucial point will be covered in Part Two.\nRemember too that in 1389  the French king Charles VI issued an order to have the ‘handmade and artificially depicted’ cloth seized and transferred to another church where it would not be the subject of ‘idolatry’. No doubt this can all be fitted into the story too.\n\n","date":"August 4, 2015 at 6:30 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207387","author":"Charles Freeman","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Mario has done his best to forge a link in the chain of the Shroud’s history, taking us to Sainte-Chapelle. This apparently is also due to the fact that the Templar hypothesis has gaps to be filled.\nDaniel Raffard de Brienne dismissed the hypothesis because he judged the Templar head to have been a sculpture, probably based on some of the depositions during their trial:\n  https://www.academia.edu/9156258/Shroud_Studies_in_France\nOn the other hand, other depositions did not mention sculptures and Dr. Barbara Frale felt that the topic was not part of de Brienne’s expertise:\n https://www.academia.edu/7447446/Was_there_a_link_between_the_Knights_Templar_and_the_Turin_Shroud_An_interview_with_Dr._Barbara_Frale\nThen we have the respected historian Malcolm Barber saying that “unless it can be shown that the Templar idol was the Shroud, there is no reason to assume that the painting was intended to represent Christ in the first place.” He was referring to the Templecombe image.\nWe know that the head was not “Baphomet” and also that Jacques de Molay was summoned from Athens to France by Clement V to discuss plans for a new crusade. It would also be in the interest of the Grand Master to boost the morale of the knights after the fall of Acre. Philip the Fair arrested Jacques de Molay because his treasury was empty and forced Clement to suppress the crusader order. He was not one to respect the papacy, and Boniface VIII also had problems with him.\nChrist was so important to the Templars that their “successors”, the “Ordem de Cristo” (Order of Christ) in Portugal continued the tradition. It was the cross and the sword that made knights of this order such as Vasco da Gama and Pedro Álvares Cabral go in search of new lands, taking monks along with them.\nIn about two months time some research I have made will be available.\n\n","date":"August 4, 2015 at 9:46 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207400","author":"Louis","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Vasco da Gama, knight of the Order of Christ, and navigator. Note the importance of the cross:\nhttp://vignette3.wikia.nocookie.net/club-de-regatas-vasco-da-gama/images/2/23/Vasco-da-gama-logo.png/revision/latest?cb=20140606020115\nhttp://www.marasinews.com/en/portfolio/the-most-famous-european-navigator-vasco-da-gama/\n\n","date":"August 4, 2015 at 11:04 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207406","author":"Louis","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Lack of documentation is one of the reasons that we have been unable to fill the 1204-1353 gap with a big amount of certainty.\nIraqi Archbishop Gewargis Sliwa of the Assyrian Church of the East was able to do some research in his native country that led to the seventh century:\nhttp://www.shroud.com/late03.htm#archbishop\nMany of the documents are now in danger of being destroyed by ISIS and an Iraqi dominican friar is doing his best to save as much as possible. We may still find clues in these ancient documents:\n http://news.yahoo.com/iraqi-friar-saved-ancient-christian-manuscripts-174458216.html;_ylt=A0LEVyh2CcFVLykAdwdXNyoA;_ylu=X3oDMTEyN2VlbDE0BGNvbG8DYmYxBHBvcwMyBHZ0aWQDQjA1MjVfMQRzZWMDc3I\n\n","date":"August 4, 2015 at 2:05 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207430","author":"Louis","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"It is well known that the Mandylion that reached Paris with all the other relics of St Louis stayed there until the French revolution when it probably get destroyed as a false relic.  Many lists of relics of the Sainte Chapelle are there to prove the cloth that was probably the Mandylion stayed there a very long time and probably ended-up being destroyed during the French revolution.  This trail is no good.  Emmanuel Poule, a real historian (unlike Latendresse) studied carefully this particular hypothesis and came up convinced of what I just said: 1- this particular relic of the Sainte Chapelle was the authentic Mandylion of Edessa. 2- this relic was not the Shroud.  3- this relic stayed there until it was probably destroyed during the French revolution like many other relics of the Sainte Chapelle.\nI don’t believe in the scenario proposed by Latendresse for one second and I know the vast majority of the unbiased historians think the same…  Of course, people are free to believe this, but the historians have a different perspective.\n\n","date":"August 4, 2015 at 7:39 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207394","author":"Yannick Clément","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"You do not say what exactly is wrong with Latendresse’s paper. Which particular bits do you disagree with?\n\n","date":"August 4, 2015 at 8:32 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207397","author":"Hugh Farey","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"The greatest error of Latendresse is not having taken into account the FACT that the Mandylion is NOT the Shroud.  He still keep on and on and on with his set-up mind about that and never took into account all the solid arguments of credible historians that has set aside such a ludicrous idea (which is only defended by some pro-Shroud researchers).  Another thing: he never took into account all the solid arguments against this idea that I regrouped into one paper (https://shroudofturin.files.wordpress.com/2012/06/clc3a9ment_questions-about-the-mandylion-hypothesis-of-wilson_2012-06-28.pdf)\nThe Mandylion was most probably a false relic created by the Edessa Church in a will to fight against other Christian sects in that city.  Nevertheless, it is truly possible that the painting of Jesus face that was on it was influenced by the image on the Shroud, which would indicates that the Shroud was present in the Middle East (and known from some people Inside the Church) around the 6th or 7th Century and maybe before…\n\n","date":"August 4, 2015 at 9:54 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207401","author":"Yannick Clément","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Seriously, I don’t think Latendresse’s hypothesis will stand in front of the unbiased historians who are experts in this subject.\n\n","date":"August 4, 2015 at 9:55 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207402","author":"Yannick Clément","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Dan. I’m not clear why links to my site are cluttering up your “Recent comments”. It’s certainly not intentional on my part. It’s maybe something to do with the WordPress pingback feature, which has been an enormous non-switch-offable irritant. It kicks in whenever one makes a link to one’s own previous postings – and now to (courtesy) links it would seem to those I make from mine back to yours.  Maybe you know of a way to deal with it. As a temporary expedient I shall stop linking back to specific postings here, and simply refer to “something that has recently appeared”.\n\n","date":"August 4, 2015 at 9:35 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207398","author":"Colin Berry","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"I see what is happening. Here I was getting rid of a troll and turned this on by mistake. \n\n","date":"August 4, 2015 at 10:56 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207405","author":"Dan","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"One thing I have a great difficulty to understand when it comes to Shroud research is why there are so many researchers who are stepping out of their field of expertise to analyze some issues that they are not at all expert at.  Latendresse (who is an expert in mathematics) doing history is just the last example among a ton of other examples and I don’t think it’s good for the credibility of sindonology.  I would definately prefer seeing Mr. Latendresse doing some long-awaited analyses concerning the kind of 3D properties present in the dorsal image, which could also lead to a comparative analysis of both imagee (remembering that STURP only analyzed the 3D properties of the frontal image).\n\n","date":"August 4, 2015 at 10:11 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207403","author":"Yannick Clément","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"And your field is what?\n\n","date":"August 4, 2015 at 11:42 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207413","author":"Dan","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"One thing’s for certain. It’s not haematology (US: hematology)  judging by the recent reference of his to Alan D. Adler as a “blood expert”. If he thinks otherwise, he maybe needs to consult John Heller’s “Report on the Shroud of Turin”, published 1983, and read how Adler came to be co-opted to STURP (post the Turin expedition!).\nPutting favoured resarchers, living or sadly no longer so, on pedestals out of reach of informed criticism, claiming them to be “experts” (a largely meaningless term) has no place in science. But then the individual in question is not a scientist He simply has no clue as to the ethos of science as a series of progressive approximations.\n\n","date":"August 4, 2015 at 11:59 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207417","author":"Colin Berry","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Every time there will be question about the blood, I will take account of what people like Barbet, Baima and especially Adler had to say.  When it comes to chemistry, I listen to Rogers.  When it comes to history, I listen to guys like Poule, etc.\n\n","date":"August 4, 2015 at 12:02 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207419","author":"Yannick Clément","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Thanks for demonstraing so clearly why you are not to be relied upon as a source of up-to-date scientific knowledge and insight.  Apart from the fact that you have no scientific qualifications that I’m aware of, you are the epitomy of the internet know-all, proving the old adage that “a little knowledge is dangerous”. If the truth be told, you don’t know the half of it, or indeed a tenth.\nIs there a single issue regarding Shroud science you are willing to discuss in depth? If so, say so. If not, then start listening to what others have to say, including  those of us who have worked on blood, bilirubin, starch etc (while not claiming to be “experts”) instead of trying to close down debate with your impassioned and soulful rhetoric (which incidentally ain’t science).\n\n","date":"August 4, 2015 at 12:43 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207421","author":"Colin Berry","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"So Yannick, it is to each his own without rhyme or reason.  Your mind is made up so we should not bother you with new ideas from other people. Is that how it should be with you? Okay, for the rest of us, back to the subject at hand. \n\n","date":"August 4, 2015 at 1:26 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207426","author":"Dan","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Cheap shot.  Read again my post.  I talk about those who are real scientists in one particular field and who are doing official researches in other fields.\n\n","date":"August 4, 2015 at 12:00 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207418","author":"Yannick Clément","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":" “I talk about those who are real scientists in one particular field and who are doing official researches in other fields.” \nKindly cease the pigeon-holing. Science is not about collecting Boy Scout proficiency badges. Science is a mindset. Science is a process. I seem to recall there are some 13 recognized process skills in science – hypothesising, designing experiments. analyzing data etc etc).\nThe first step in science is to set aside preconceptions. Not everyone is able or willing to do that, as you yourself demonstrate so clearly, while claiming to be “scientifically superior than thou”.\n\n","date":"August 4, 2015 at 12:26 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207420","author":"Colin Berry","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"“Here I was getting rid of a troll…”   Music to my ears, oh site-controller, and just what shroudstory has needed for long time: internet snacks for those S.Carolina alligators of yours. ;-)\n\n","date":"August 4, 2015 at 11:35 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207411","author":"Colin Berry","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Yannick’s paper, containing 22 reasons why the Shroud is not the Mandylion, makes some valid points. Perhaps Mario would like to respond to the more obvious ones, particularly the fact that representations of the Mandylion invariably show an uninjured face with open eyes, while the Shroud shows a blood-dribbled face with closed eyes.\nHowever, there is nothing in any of Mario’s sources that mentions Mandylion by name. Is it possible that it could have been transferred from Baudouin II to Louis IX without being identified by name? I think not. I do think it possible that everything Mario has deduced about the European history of the “sanctam toellam” is correct, but that the sanctam toellam was never the Mandylion in the first place. There were plenty of other possible candidates, after all.\n\n","date":"August 4, 2015 at 1:51 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207429","author":"Hugh Farey","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"These I-spy-with-my-little eye hints of a Shroud-like image being known but not recorded pre-1355, failing to flag up its iconic double-image uniqueness are useless. Some of us prefer hard facts to this never-ending stream of maybe this-maybe that flummery – an instantly forgettable substitute for sound scholarship, far less hard science.\n\n","date":"August 4, 2015 at 2:17 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207432","author":"Colin Berry","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Even in many lists of relics made during the time the Mandylion was kept in Constantinople, you don’t see any direct mention of the Mandylion associate with the cloth or any direct link with the Abgar legend…  Many lists of relics from Constantinople just mention “sacred cloth” or “cloth that was used by Jesus to wash his face” or things like that.  Taking this into account, it’s not unusual to see the mention “sanctam toellam” in the official list of relics that St Louis bought from Baudouin II.  Most historians agrees that this “sanctam toellam” was most probably the Mandylion of Edessa and most historians also agrees that this relic was NOT the Shroud showed in Lirey by Geoffroy de Charny.\n\n","date":"August 4, 2015 at 3:42 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207434","author":"Yannick Clément","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"“Most historians agrees that this “sanctam toellam” was most probably the Mandylion of Edessa.” That may well be the case, but it need not be true. the Mandylion was so well known as the Mandylion that it does not seem likely that its name would get lost as the object itself was transferred from one royal relic connection to another. Constantinople had plenty of possible cloths identified as shrouds, sudarions or towels without the Mandylion necessarily being one of the transferred relics.\n\n","date":"August 5, 2015 at 2:20 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207453","author":"Hugh Farey","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"I think the reason why most historians seem pretty sure that this particular relic was the authentic Mandylion is the fact that the expression used to describe it is looking very similar to what has been found in other lists of relics from Constantinople, along with the fact that there was no other relic like that in Constantinople (i.e. a cloth showing the face of Jesus).  \nLast thing: A very important piece of evidence to conclude the Mandylion was not the Shroud is the fact that ALL the lists of relics that mention the Mandylion NEVER consider it as a relic of the Passion of Christ, unlike many other relics that were also kept in Constantinople like the crown of thorns, the nails of the Passion and, most probably, the Shroud itself.  In fact, some lists of relics from Constantinople mention both the Mandylion AND the Shroud, while never placing the Mandylion among the relics of the Passion.  I think this is a very solid piece of evidence to understand that both relics were very different and that the Mandylion was just what the depictions are showing: a small cloth showing the face of the living Christ and nothing else.\n\n","date":"August 5, 2015 at 12:00 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207488","author":"Yannick Clément","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Yannick’s insistence that the Shroud and Mandylion were in fact two different objects would seem to be supported by most modern historical scholarship.  Adherence to the Wilson theory still seems to be maintained by Daniel Scavone, and now more recently it seems by Mario Latendresse.  \nJack Markwardt had some years ago proposed that the burial cloths were taken to Antioch by St Peter, and had been kept there.  He had proposed that Bishop Avercius had been given temporary custody around ~200 AD, that he had used it as some kind of visual aid for the conversion of the court of Abgar VIII at the king’s request, that this had led to the compilation of the tale of the Doctrine of Addai as an allegory by implicating his predecessor Abgar V Ukkama to conceal the conversion from the imperial court, and also the composition of the contemporary Bardesanic Hymn of the Pearl, and that Avercius had then returned the Shroud to Antioch.   Until recently, it had also been Markwardt’s belief that when Persian King Chosroes besieged Antioch in 544 AD, the recently discovered Shroud was then taken to Edessa, and he had accepted the Wilson hypothesis of it becoming the Mandylion.  \nMarkwardt has since radically revised this scenario by abandoning the Wilson hypothesis and asserting that Bishop Ephraimius took the Shroud to the safety of Cappadocia in Anatolia.  Ephraimius died in 545 before he could recover the Shroud but only some nine years later a group of orthodox priests was parading an Image of Christ around Anatolia and it was the very first image to be called “acheiropoeitos”.  He considers that this image was in fact the Shroud.  It was soon taken to Constantinople and was variously referred to as the Image of Camuliana or the Image of God Incarnate. \nMarkwardt presented his latest paper at a two hour special session at the St Louis conference in October 2014.  “MODERN SCHOLARSHIP AND THE HISTORY OF THE TURIN SHROUD”  http://www.shroud.com/pdfs/stlmarkwardtpaper.pdf  \nHe provides very detailed arguments as to why the Mandylion theory should be rejected, as there seem to be too many inconsistencies with it, and he cites several historical authorities supporting such rejection.  Pages 5 to 15 are dedicated to an evaluation of the Mandylion theory and give the objections which its proponents must deal with and answer before advancing their cause further.  Apparently there was an exchange at the St Louis conference with Daniel Scavone who is one of the very few academic historians still prepared to accept it.  Whether or not Scavone will eventually come around to a similar point of view as the majority of other academicians interested in the problem, time will tell. \nThe whereabouts of the Shroud during its obscure years of 1204 to 1355 remain enigmatic, and of course various hypotheses have been proposed.  Back in 2000, when Markwardt had been still prepared to accept the Mandylion theory, he had proposed that the unique Cathar crucifix with its Shroud-like features suggested that the Albigensians in southern France, specifically Languedoc, had come into possession of it through contact with their Balkan coreligionists the Bogomil heretical sect.  It was during this time that there was a general dramatic shift in the representations of crucifixes.  \nPope Innocent III had declared a crusade against the Albigensians, which threw the north of France against the south, destroying the Provencal civilisation, culminating in the Treaty of Paris 1229, and destroying the power of the southern princes, but not in exterminating the heresy.  Many fled to Italy and their hierarchy faded out in the 1270s.  It lingered on through the 14th century and finally disappeared in the 15th.  If the Albigensians had the Shroud, then it was surely taken by the French crown and eventually awarded to the Charnay family “for services rendered” as later given out. \nThis is only one of several hypotheses for the location of the Shroud during this period, but absent the Mandylion theory, and it may well be as true as any other such hypothesis.\n\n","date":"August 4, 2015 at 10:03 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207446","author":"daveb of wellington nz","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"I think there are some compelling links between Mandylion and Shroud. Daveb in addition to Latendresse and Scavone you should add the name Thomas de Wesselow, well credentialed art historian. Have you read his book? I think he makes quite a compelling case. In particular, several historic references to the Mandylion being a large sheet, and having a body image (ie. not just a face image).\n\n","date":"August 5, 2015 at 3:27 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207458","author":"Thomas","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Thomas,\nde Wesselow’s book is good on the whole, his only mistake being that he equates burial cloth with event:\nhttps://www.academia.edu/10819998/Book_Review_The_Sign_by_Thomas_de_Wesselow\nOther than this we have to be very careful with what we “see” on the Shroud:\nhttps://www.academia.edu/12813935/Does_the_Shroud_show_a_Mandaean_burial\n\n","date":"August 5, 2015 at 9:23 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207479","author":"Louis","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"A link Thomas doesn’t mean both were the same!  I think it’s important to mention that…  Effectively, when we look at the ancient artistic copies of the Mandylion that were made, the face of Christ look very similar to what is on the Shroud.  To me, this indicates that the Mandylion was probably forged with the image on the Shroud in the back of the artist mind.\nThere are compelling evidence to believe the Mandylion was a false relic done by the Edessa Church (the Church is not always honest my friends!) in his fight against some “heretic” movement that were present in that city around the 5th and 6th centuries.\n\n","date":"August 5, 2015 at 12:03 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207489","author":"Yannick Clément","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Personally, I don’t find the argument that goes as follows particularly compelling :\n“the Shroud can’t be the Mandylion because the Mandylion has Christ’s face with eyes open and no blood stains” \nWe know now that the eyes appear closed with the advantage of the negative image, but without the benefits of modern photography ancients could have just as easily concluded that the eyes were open. After all, it’s rather hard to the naked eye to make out any eyes within those eye sockets. \nIt’s also a fallacy to consider that the Mandylion can’t be the Shroud because it didn’t show blood on the face image. There is always the potential for artistic licence, and then a tradition to build upon that artistic licence! And the cultural climate through the 800s, 900s and 1000s was ripe for a depiction that showed a non-blooded face. As we all know, the depictions of Jesus from this period were typically non-bloodied – Christ was glorified and all powerful, not the “suffering servant”!\nSome here who attack the Mandylion / Shroud connection believe that the Pray Manuscript is a representation of the Shroud. Yet the PM displays almost none of the bloodied Christ as we see on the Shroud. \nLook at some of the Shroud depictions. They didn’t always show blood on the face.They didn’t always show the scourge wounds. They often (but not always) showed a loin cloth (when that does not exist on the Shroud). They usually don’t show the “blood belt” . They sometimes do not show the “poker holes”. Does that mean they aren’t depictions of the Shroud? No!!! They shows differences because they: worked from memory and/or exhibited artistic license and /or responded to cultural sensitivities.\n\n","date":"August 5, 2015 at 3:49 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207460","author":"Thomas","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Possibly, although I find it difficult to accept that not a single copy of the Mandylion resembles the face of the Shroud (negative, blood, eyes) at all, artistic convention notwithstanding, if the face of the Mandylion was in fact the face of the Shroud. I could understand that depictions of Christ based on such an image could be very different, but actual depictions of the cloth itself should at least pay some homage to verisimilitude.\n\n","date":"August 5, 2015 at 4:21 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207461","author":"Hugh Farey","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"HF:  ” … actual depictions of the cloth itself should at least pay some homage to verisimilitude.”  \nAs recently as the Valencia Conference 2012, Ian Wilson was still advocating his Mandylion theory.  His paper is available on Barrie’s shroud.com site.  It comprises a marvelous slide show with possibly the most comprehensive collection of representations of the Mandylion available.  It also happens to include a number of 16th & 17th century painted copies of the Shroud.  Wilson thereby demonstrates that artists painting direct from the Shroud believed that the eyes were open, and this would dispose of any objection that the Mandylion eyes were always shown as open.  Certainly it would seem that the artists have not attempted to represent the herring bone weave on their copies of the Shroud, they merely painted their perception of the Shroud image on the particular cloth they used, in most cases probably just a plain weave. \nWhen we come to his collection of depictions of the Mandylion, all of which are clearly intended as deliberate art works according to the various contemporary styles, not one of them seemed to make any attempt whatsoever at representing the distinctive weave of the Shroud cloth.  \n“Discovering more of the Shroud’s Early History”, Ian Wilson, Valencia 2012:\nhttp://www.shroud.com/pdfs/wilsonvppt.pdf  \nThere are in particular two striking Shroud-like facial images of Jesus dating from about the 7th century.  The first of these is on a hammered silver vase, found among church ruins in the Syrian city of Homs, formerly Emesa, a late 6th century centre of Byzantine Christianity, this vase now being in the Louvre.   The second Shroud-like facial image is on a coin issued by Justinian II in 692, featuring a non-suffering Pantocrator-type image of Jesus with wide peering eyes, forked beard and uneven hair lengths.  In 695, Justinian was deposed, his enemies cutting off his nose and sending him into exile.  Upon his victorious return to Constantinople at the head of a foreign army some 10 years later, he apparently interpreted his earlier defeat on issuing coins in the Image of God Incarnate as a mark of divine disapproval, and henceforth the images of Christ on his coins displayed only non-Pantocrator type images.  \nIt would therefore seem that a Shroud-like image of Christ was known in Constantinople as early as 692, some 250 years before the Mandylion arrived there from Edessa, but very soon after the arrival of the acheiropoetios Image from Anatolia.      \nDoubtless as an acknowledged art historian, De Wesselow was probably able to make his own particular contributions, but in many respects he seems mainly to be echoing Wilson.  The objections to the Mandylion theory, such as those summarised in Markwardt’s paper, need to be dealt with by those advocating the theory.  I very much doubt that De Wesselow was able to do this or attempted to do so.\n\n","date":"August 5, 2015 at 6:18 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207467","author":"daveb of wellington nz","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Daveb says:\n“There are in particular two striking Shroud-like facial images of Jesus dating from about the 7th century. The first of these is on a hammered silver vase, found among church ruins in the Syrian city of Homs, formerly Emesa, a late 6th century centre of Byzantine Christianity, this vase now being in the Louvre. The second Shroud-like facial image is on a coin issued by Justinian II in 692,”\n***Angel says:  Exactly!\nDaveb, you are such a wise man.\nAnd the third is the Chandra B1509 telescope image.\nPlease note, the Chandra telescope hand and facial image B1509) align perfectly with the and Shroud of Turin image (face and hands).\nLink:\nThe Ultimate Proof ! This is the Face of Our Lord Jezus Christ on the Shroud.\nCloud Formation “the Hand”\nShroud Hand and Cloud Hand Enhanced\nPelvis_Spine UV Fluorescence photo \nThe Sudarium of Ovida Notice the Same Red Spot on Nose and Swollen Eye\n The Hand Of God\n(enhanced and flipped vertical – neutron star known as PSR B1509-58 )\nThe Shroud face is also found on the\nhttp://home.kpn.nl/britso531/\n\n","date":"August 5, 2015 at 3:58 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207502","author":"Angel","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"In fact, there is a much older image of Jesus’ face that look very much like the face saw in ancient depictions of the Mandylion and ultimately, that look quite similar to the Shroud’s facial image too.  I’m talking of the image of Jesus known as the Christ Pantocrator.  And the first known image of that kind of artistic depiction of Jesus is found in Ravenna, Italy and is dated before 526 A.D.!  I’m pretty sure this form of artistic depiction of the living Christ was greatly influenced by the Shroud itself and I don’t see any good reason to doubt that it is also the same for the Mandylion…\n\n","date":"August 5, 2015 at 7:44 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207518","author":"Yannick Clément","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Important note: the coins minted by Justinian DID NOT DEPICT the Shroud image or the Mandylion, but the Christ Pantocrator!  It’s important to set the record straight about that…  The influence for those coins was the Christ Pantocrator icons, period.  The Shroud or the Mandylion had nothing to do directly about those coins.  But as I said, it’s truly possible that the first Christ Pantocrator icon had been done by an artist who saw the Shroud and who got his inspiration from the facial image we see on the cloth.  Truly possible.\n\n","date":"August 6, 2015 at 7:31 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207559","author":"Yannick Clément","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"But how do you know this, Yannick?\n\n","date":"August 6, 2015 at 7:36 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207562","author":"Dan","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"I’ve read a book written by a specialist of this question of the ancient Byzantine coins and, for him, there’s absolutely no doubt that these coins are depictions of the Christ Pantocrator, which was a very popular icon in that region at that time in history.  Also, you got some coins of that era that represent the Christ in Glory icon, which is another depiction of Christ that’s very similar to the Christ Pantocrator and, therefore, it is truly possible that it was also influenced by the Shroud’s facial image.\n\n","date":"August 6, 2015 at 9:31 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207578","author":"Yannick Clément","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Here’s the book in question, available online in PDF format: http://www.doaks.org/resources/publications/doaks-online-publications/byzantine-coinage/byzcoins.pdf\nNowhere in that book it is question of possible depictions of the Shroud or the Mandylion associated with these ancient Byzantine coins…  This is very telling.\n\n","date":"August 6, 2015 at 9:46 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207580","author":"Yannick Clément","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Yanick, do you have a link to the Christ Pantocrator icon?\n\n","date":"August 6, 2015 at 11:21 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207587","author":"Angel","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"You get plenty on Google image: https://www.google.ca/search?hl=fr&site=imghp&tbm=isch&source=hp&biw=1344&bih=746&q=Christ+pantocrator+icon&oq=Christ+pantocrator+icon&gs_l=img.3..0i30i19.814.5262.0.5517.23.10.0.13.13.0.97.807.10.10.0….0…1ac.1.64.img..0.23.958.4ObX626cgEY\nLook how these ancient Byzantine icons are looking similar to the Shroud’s facial image…  To me, there’s no coincidence!\n\n","date":"August 6, 2015 at 12:01 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207588","author":"Yannick Clément","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Look at that one, which put the image of the Shroud side by side with one of the oldest Pantocrator icon: https://s-media-cache-ak0.pinimg.com/736x/52/02/84/52028437dfdf5e6f23bcb6dff316b760.jpg\nVignon was one of the first to alert people about that striking similarity.  Even the proportions are quite similar, which lead me to think that the artist who did the first ever Pantocrator icon had the Shroud in mind or, also possible, the Shroud beside him, when he did his artwork.\n\n","date":"August 6, 2015 at 12:04 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207589","author":"Yannick Clément","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Extract from website, St Catherine’s Pantocrator: \nThe exceptionally high quality of the painted icon suggests that it must have been the product of a Constantinopolitan atelier in Justinian’s age. This may be further confirmed by the fact that the iconographical type it represents was created at the time when Justinian was emperor, although we cannot be absolutely certain about that. It should be remembered at this point that the Monastery of St. Catherine had been founded by Justinian and that the emperor had presumably sent various gifts to the Monastery, including perhaps this very icon.\nRead more: http://www.touregypt.net/featurestories/catherines2-.htm#ixzz3i6Gdtg4t\nI should therefore think that it cannot be stated quite as categorically as Yannick imagines, that the Justinian coin was based on the Christ Pantocrator, as both were produced during the age of Justinian, and both are quite likely to have a common origin.  It also seems that the Homs Vase Christ impression apparently from the sixth century might well predate both the coin and the icon.  The coin image in my view, together with the Homs, has more of a Shroud likeness than even the Pantocrator.  This is all some 250 years before the Mandylion arrived in Constantinople, but post-dates 540 AD, the year that Chosroes destroyed Antioch, when some 20 or so years later, the Image of Camuliana arrived at the imperial capital.\n\n","date":"August 6, 2015 at 11:39 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207653","author":"daveb of wellington nz","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Read this and you’ll see that experts do not see those coins as representing the Shroud or the Mandylion, but truly the Christ Pantocrator (this is a sure fact and an evident one): http://www.doaks.org/resources/publications/doaks-online-publications/byzantine-coinage/byzcoins.pdf\nSpecialist who knows the popularity of that Pantocrator icon in Constantinople will tell you better than me…\n\n","date":"August 7, 2015 at 7:30 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207669","author":"Yannick Clément","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Yannick, my sincere thanks for the link to the Grierson paper on Byzantine coinage.  I shall find it invaluable as a general resource.  However I note that Grierson considers that the image of Christ on the 692 Justinian II solidus derives ultimately from the bust of the Phidian Zeus.  His reference to the Pantocrator is a much later version in the dome of a cathedral ~1100 than that of St Catherine’s monastery.  Possibly he considers that the Pantocrator is also based on the Zeus.  I rather suspect that the historians are quite reluctant to recognise the possibility of the Shroud’s image being known at this time, and consequently are unlikely to attribute it as a source for iconic or numismatic imagery.       \nSt Catherine’s monastery was founded at the direction of Justinian I (527-565).  The St C. Pantocrator had been previously believed to have been 13th c. until the newer paint had been removed, and is now assigned to the 6th – 7th century.  Whether it was sponsored by Justinian I or Justinian II therefore seems to me uncertain.  \nWhether the Pantocrator was based on the Phidian Zeus or a known facial image of the Shroud might be debatable.  To me the image of the 692 AD solidus looks much more like the Shroud image than it does to the Pantocrator.  The features on the solidus seem to me to reflect the bruised distorted face of the Shroud than the triumphal aspect of Pantocrator. \nHowever the Homs vase Christ image would seem to be much earlier.  I read (possibly from Markwardt) that Emesa was a thriving Byzantine Christian centre in the 6th century.  On looking into references on Emesa, I discover that it was notably Christian even in the 4th century.  So possibly the Homs vase might even be as early as this.  The images on the vase and the 692 solidus are quite similar.\n\n","date":"August 7, 2015 at 4:39 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207701","author":"daveb of wellington nz","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"daveb says:  “So possibly the Homs vase might even be as early as this. The images on the vase and the 692 solidus are quite similar.”\n***Angel says:  Indeed they are and it is apparent both artists (vase and gold solidus coin) must have seen the Shroud up close.\nThe images of the “Pantocrator” icon Yannick referenced appear to be from a later point in time and although there are similarities to the Shroud, they are not as striking as those depicted on the vase and gold solidus.\n\n","date":"August 7, 2015 at 7:37 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207710","author":"Angel","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"That’s your opinion Dave and I respect it.  However, to me, I don’t have any serious reason to doubt Grierson’s conclusion that these coins are representing the Christ Pantocrator icon (some coins also seems to represent the Christ in Glory icon, if I remember well).  \nBut nevertheless, the idea of an influence of the Shroud on this particular kind of religious icon is not dumb at all and, therefore, we can think that around the time when the first Pantocrator icon was made, the Shroud image (at least the face) was known of some people inside the Eastern Church, which would means the Shroud was present in the East and known of some people around 500 A.D.\nOf course, it’s impossible to be sure about that, but I think Vignon was correct with his positive conclusion concerning a possible link between these particular icons of Christ and the Shroud facial image.\nBy the way Dave, I encourage you to read carefully the serious challenge I wrote this morning concerning Latendresse’s hypothesis of a Mandylion that would have been the Shroud and which would have been bought by St Louis and placed inside the Sainte-Chapelle of Paris and, later on, would have end up in the hands of Geoffroy de Charni.\nYou’ll find this solid critic of mine at the bottom of this page…  It stats with: “I would like to share with anyone interested by the topic one of the greatest argument that can go against the scenario proposed by Latendresse…”\nI think you’ll find this reflection of mine interesting… Have a nice reading!\n\n","date":"August 7, 2015 at 8:32 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207718","author":"Yannick Clément","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Daveb, can you provide an image of the Cathar crucifix?\n\n","date":"August 5, 2015 at 9:24 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207480","author":"Louis","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Hello Louis, Re Cathar Crucifix: \nPaper “THE CATHAR CRUCIFIX: NEW EVIDENCE OF THE SHROUD’S MISSING HISTORY” By Jack Markwardt,  2000, can be found at:\nhttp://www.shroud.com/pdfs/markwar3.pdf   \nThe paper does not provide an image of the crucifix, nor could my Google search discover an image that conforms to its description, and I’m unaware of any artefacts held.  The principle source, possibly the only one known, is the description provided by a Catholic prelate, Lucas of Tuy, who confronted the Cathars in Leon after some who were seeking refuge settled there in 1218.  He is also known as Lucas Tudense, Lucae Tudensis, and El Tudense.  He authored the Chronicon Mundi, an update of St Isodore’s great chronicle, and was subsequently appointed bishop of Tuy in 1239. \nQuoting Markwardt: “Between 1229 and 1234, Lucas wrote “De Altera Vita, Adversus Albigensium Errores” (The Other Life, Against the Errors of the Albigensians) which detailed various Cathar tenets and religious practices and betrayed his own pathological hatred of heretics and Jews.”  Markwardt acknowledges the “efforts of Paul C. Maloney, Vice President and General Projects Director of the ASSIST Investigations Group, in locating and reproducing this relatively forgotten work and the fine translation of its medieval Latin text by Mark Guscin.” \nIn De Altera Vita, Lucas reports that the Cathars manufactured a most unusual crucifix.  Briefly, Markwardt interprets Lucas’ description of it as comprising a vertical stake (but without patibulum), an inscription, and a footrest; that Christ was attached to it with only three nails with but a single nail through his crossed feet; that Christ was pierced in his left side by a Roman lance; and that He was hung from a crux simplex with his arms extended above his head, and hands or wrists nailed to the upright stipes. \nThis is most peculiar.  First, the Cathars denied the reality of the Incarnation, repudiating Christ’s human nature, and claimed that neither his death nor resurrection had been a physical reality;  Second, they held relics and religious images in low esteem;  Third, having manufactured a crucifix they departed from ancient crucifixion traditions dictating the shape of the cross, the number of nails, and the location of the lance wound.  \nFurthermore, given their rejection of the Eucharist and the Mass, the Cathars should not have claimed to possess Christ’s transubstantiated body, and yet they did invite the leader of the Albigensian Crusade to see the body of Christ that had become flesh and blood in the hands of their priest.  \nMarkwardt endeavours to resolve these anomalies by proposing a set of Sindonic Solutions, that, following the disappearance of the Shroud from Constantinople, it came into the hands of the Cathars through their coreligionists the Bogomils, creating a crisis forcing the Cathars to face the reality of the crucifixion.  Barbet of course interpreted the blood-stained feet of the Shroud as having been crossed and fastened with but a single nail, but the Cathars failed to recognise that the Shroud imprint was a mirror image and hence claimed the lance wound as being in the left side, and furthermore they were persuaded that his hands were nailed above his head.  \nIf in fact the Cathars had been in possession of the Shroud and had held it in the region of Languedoc (the main area of their population), after being forfeited to the Crown, it would then be properly assigned to the Charny family.  In a footnote, Markwardt observes: \n“In the Spring of 1349, Charny’s royal annuity was modified to include the first forfeitures that might occur in the Languedoc senechaussees of Toulouse, Beaucaire, and Carcassonne. This grant is preserved in the Archives Nationales JJ77 #395, folio 245 and is hand-copied in the Wuenschel Collection. See Crispino, Dorothy, Geoffroy de Charny in Paris, Shroud Spectrum International, No. 24, p. 13 (September, 1987).”\n\n","date":"August 5, 2015 at 6:38 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207509","author":"daveb of wellington nz","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Thanks for the information, Daveb. It is a pity that no image is available.\nAccording to Dr. Barbara Frale the Knights Templar got hold of the Shroud before it could fall into the hands of the Cathars. The problem is the usual lack of documentation and speculation is inevitable.\n\n","date":"August 5, 2015 at 6:54 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207511","author":"Louis","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Louis, Reading through Markwardt’s full paper, including the various extracts in the footnotes, one might easily form the impression that Lucas of Tuy was something of a pathological case.  His arguments sometimes seem to grasp at straws (citing St Francis stigmata as firm evidence of the manner of the crucifixion) and has some outrageous ideas, even advocating the killing of children or family members who might so much as be vulnerable to heretical ideas.  Was he a victim of his own self-deception?  It seems remarkable that the Cathars should manufacture any holy object, even a crucifix, given their particular neo-Manichean dualistic beliefs.  Are Lucas’ description of it having three nails only, and a left-side side wound sufficiently circumstantial to be indicative of Cathar possession of the Shroud?  Whence could Lucas get such an idea if it wasn’t so in fact? The Shroud blood-flows on the arms, might suggest to the medically uninformed that the arms were fastened above the head.  \nBut it is interesting that the Charny family were assigned first forfeitures from Languedoc as of 1349.  Given the Templar situation 1314-49, would you know if it still might have been recently in Templar possession in the region of Languedoc, and the Charnys therefore came into possession as a result?\n\n","date":"August 6, 2015 at 2:30 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207537","author":"daveb of wellington nz","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"It is possible, David. I am working on the Templar hypothesis, but information is scarce. Another problem is that the knights themselves were accused of holding anti-Christian belefs. Was this true only when it came to certain preceptories?This is what Robert Babinet proposed, although he also held the view that they possessed the relic.\n\n","date":"August 6, 2015 at 5:18 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207550","author":"Louis","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"I must congratulate Mario his excellent work. He certainly put much effort to that document, containing a lot of priceless information. This must be carefully studied.\nHowever I still hold that the Shroud did not find its way into Sainte-Chapelle. Rather it came into possesion of Otto de la Roche, while the precious Mandylion casket it was once hold within, was sold to Louis IX.\nThis will be discussed further in the future, when I have more time -and digest this very informative dish Mario has served us.\n\n","date":"August 5, 2015 at 2:50 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207498","author":"O.K.","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"The Mandylion was not the Shroud.  Ask any unbiased historian who is specialist in syriac studies.  The only ones who maintain such a ridiculous idea (which goes against all the data available on this subject) are ALL pro-shroudies.  This speaks very loud and is an evident sign of bias.  This is simply not serious at all.\nThere are a lot of lists of relics who mention BOTH relics in the same list (a shroud of Christ AND a facecloth showing the face of Christ)…  This isn’t enough for you?  There is not one single lists of relics from Constantinople that put the Mandylion into the category of relics of the Passion, while they put a bunch of other relics into that “Passion” category…  This isn’t enough for you?  There’s not one single ancient depiction of the Mandylion that show signs of blood and/or bruises in the face…  I can keep on and on and on and on.  The list of “problematic data” for the “Shroud was the Mandylion” hypothesis is astronomic.\nThe ancient past of the Shroud will never be resolved through the Mandylion hypothesis first proposed by Wilson.  This hypothesis has not pass what I call “the test of experts”.  Sorry but no unbiased expert has backed-up Wilson’s view…  I repeat UNBIASED expert, which means someone who is not an “anti” or a “pro” Shroudie.\n\n","date":"August 5, 2015 at 3:41 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207501","author":"Yannick Clément","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"You are a very arrogant man. There are still plenty of suggestive links to suggest that the Mandylion / Shroud connection cannot be ruled out.\nI would suggest that there aren’t many “unbiased” researchers, living or dead, working around the shroud!\n\n","date":"August 5, 2015 at 10:52 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207529","author":"Thomas","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"If it was so, you would see the majority of the historian accepting this hypothesis.  It’s all the contrary in fact.  Beside some pro-Shroud historians, no one believe this weak hypothesis.  You’re free to believe this, but frankly, you should search elsewhere.\n\n","date":"August 6, 2015 at 7:29 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207558","author":"Yannick Clément","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"De Wesselow:\nRe: Wilson’s theory:\n“Wilson’s theory is patently better than the current orthodoxy. Although much remains to be clarified, I conclude, therefore, that the Mandylion was indeed the Shroud”\nI don’t have time to go into the details of the case De Wesselow makes, but in brief:\n-Account from 944 suggestive of final Shroud -like face image, references to it being a sweat-like secretion.\n– from same time, account of Emperor’s sons unable to see eyes and ears of the face\n– 4 written sources dating from 7th to 10th centuries refer to Mandylion as a ‘sindon’\n– Referred to as a ‘himation’ (cloak or mantle) in 730\n– The tetradiplon reference\n– Oldest Latin Abgar Text, from 10th / 11th century: “I am sending you this linen cloth, on which you will be able to see not only the form of my face but the divinely transformed state of my whole body”  \nThat last one seems very interesting.\n\n","date":"August 5, 2015 at 11:10 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207530","author":"Thomas","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Thomas, I suggest that until such time as you have read and studied Markwardt’s 2014 St Louis paper, you are not really in a strong position to argue the Mandylion case.  The arguments you cite from De Wesselow have been known for years, there are several counter-arguments not mentioned, and the general consensus is that the Mandylion theory has not been found convincing.  Certainly there is a lot of Shroudie emotional investment in the Mandylion theory, and you will continue to find support for it, wrongly so I believe.  The commitment to the Mandylion theory has unhappily obscured more fruitful lines of enquiry, even without necessarily accepting Markwardt’s Cappadocia Image of Camuliana / Image of God Incarnate theory. \n“MODERN SCHOLARSHIP AND THE HISTORY OF THE TURIN SHROUD” by Jack Markwardt, St Louis 2014  http://www.shroud.com/pdfs/stlmarkwardtpaper.pdf   \nCheck pp 5-15 for an appraisal of the Mandylion theory.  Jack’s PowerPoint presentation has even more detail.  I have a copy of it, but could not find it located on the web.\n\n","date":"August 6, 2015 at 3:10 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207541","author":"daveb of wellington nz","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"OK Daveb, I’ll keep an open mind, and try and read that paper when I have some spare time.\n\n","date":"August 6, 2015 at 4:01 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207543","author":"Thomas","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"A quick thought on a quick skim of the paper  – there are a lot of historical references to the Mandylion / Image of Edessa, and complexities in accounts, I don’t believe the theory can be dismissed quite yet. There might have been several “Mandylion”, just like there have been several “Shrouds”. I still think the potential exists that some references to the “Mandylion” are to a Mandylion that is the Shroud, and others are to a Mandylion that wasn’t the Shroud…if you follow my drift. History is not necessarily simple or linear, it can be complex, non-linear\n\n","date":"August 6, 2015 at 4:09 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207544","author":"Thomas","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Thomas, the situation is I think much more complex than Wilson, De Wesselow, and Scavone have proposed.  The story behind the Mandylion is based on the Abgar legend, which was modified several times in the course of history.  It requires some skill to unravel the various threads and modifications.  The story is first mentioned in the 4th century Ecclesiastical History by Eusebius of Caesarea who discovered it in the archives of Edessa, which by then had become a major centre of Syriac Christian scholarship.  Briefly, Eusebius describes it as an exchange of letters between Jesus and Abgar V Ukkama, but makes no mention of a towel bearing an image of Jesus.  Eusebius did not like icons and so it is possible his omission may have been deliberate, or else it was not part of the original story.  \nThe story itself is quite improbable if interpreted literally, however there must have been some reason for composing the story and entering it into the archives.  The most likely explanation seems to be that it was composed as an allegory to conceal a secret, and that secret was the conversion of the court of King Abgar VIII the Great around 200 AD.  The reason for keeping it secret was that the tolerant emperor Commodus had been deposed and was succeeded by a despotic emperor Septimus Severus and persecution of Christianity had resumed.  Abgar VIII had previously displeased Rome, had been sent into exile, but had recently been reinstated.  He would not want to upset the emperor again.  The story of the conversion was then composed as a coded allegory involving his predecessor Abgar V and Jesus, rather than himself and Pope Eleutherius. \nSt Peter had probably taken the burial cloths to Antioch.  It is possible that they were used to assist the conversion of the Edessan court, and then returned again to Antioch.  This may have provided the opportunity to compose the Mandylion “in choice colours”, and at some time a story of the imprint of Jesus was included in the legend.  Also at this time, the Edessan poet Bardesan composed the Hymn of the Pearl, which suggests that he had very likely seen the full Shroud image.  \nBoth the Shroud and Mandylion were concealed at various times depending on the political climate of Christian persecution, Persian invasion, or confiscation of church treasures to be rediscovered in subsequent years.  Possibly copies were made.  At various times Byzantine iconoclasm played a part, some icons being destroyed unless they were hidden,   \nAround 540 AD the Persian king Chosroes I, attacked and destroyed Antioch.  If the Shroud was in Antioch at this time, it was taken away for safety, either to Edessa, or more likely to Cappadocia.  The religious situation was also complex at this time, including such heretics as Gnostics, Arians, Docetists, Nestorians and others.  At various time some of these seemed to have had possession of the Mandylion or the Shroud.  \nI recommend the following two papers by Markwardt, which cover this period: \n“Antioch and the Shroud”, Markwardt 1998, Dallas Conference,\n http://www.shroud.com/pdfs/markward.pdf\n“Ancient Edessa And The Shroud: History Concealed By The Discipline Of The Secret” Markwardt 2008, Ohio Conference,\nhttp://ohioshroudconference.com/papers/p02.pdf  \nThese two papers should be read in conjunction with his 2014 St Louis paper. \nNote that at the time of the 1998 and 2008 papers, Markwardt had supported the Mandylion theory, and this is reflected in these papers.  However he has now abandoned it as set out in his more recent “Modern Scholarship” paper.\n\n","date":"August 6, 2015 at 6:56 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207556","author":"daveb of wellington nz","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"OK, thank you Daveb. But any thoughts on this quote:\nOldest Latin Abgar Text, from 10th / 11th century: “I am sending you this linen cloth, on which you will be able to see not only the form of my face but the divinely transformed state of my whole body”\nIs there anything dubious about it? De Wesselow quotes it, and it seems more than suggestive of the Mandylion comprising a body image….\n\n","date":"August 8, 2015 at 6:47 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207779","author":"Thomas","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Thomas, in reply to your query on the Latin Abgar text, see my full comment below at August 9, 4:54 am. Daveb.\n\n","date":"August 9, 2015 at 4:57 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207793","author":"daveb of wellington nz","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Not the oldest Abgar text, a very late one ,in fact.. ‘The divinely transformed state of my whole body’ is certainly not a description of the Shroud, which shows the body before any ‘divine transformation’ but would appear to refer  to a representation of the body of Christ AFTER the Resurrection. These representations, on painted cloths hung up in Easter Week, are mentioned frequently in medieval inventories but I don’t think there are any survivors.\n\n","date":"August 9, 2015 at 12:33 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207806","author":"Charles Freeman","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Professor Heinrich Pfeiffer, SJ had something to say about Abgar and the liturgy in the Eastern Church:\n https://www.academia.edu/14795646/An_interview_with_Professor_Heinrich_Pfeiffer_SJ\n\n","date":"August 9, 2015 at 2:03 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207809","author":"Louis","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Charles, see my full comment below on Markwardt’s paper.  I think Thomas is saying it is the oldest LATIN text, but there is as you say an older one.  The extract comes from the Codex “Treatise translated into Latin from a book of the Syrians”.  JM. quotes Dobschutz, “The Latin version of the Abgar Legend, translated perhaps as late as the eleventh or early twelfth century, reflects a much earlier stage of the legend.” Dobschütz, Ernst von, Christusbilder.  JM. suggests it might be as early as ca 800. \nJM. also refers to a sermon delivered by Pope Stephen III in 769, making a similar claim, some 28 years after Constantine V had sealed away the Image of God Incarnate in its golden case.  \nBoth reflect a memory of a full-length body image now erroneously ascribed to the Mandylion.  Take away the literary pietism of ‘divinely transformed body’, and we are still left with a full-length body image.\n\n","date":"August 9, 2015 at 3:58 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207812","author":"daveb of wellington nz","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"I would like to share with anyone interested by the topic one of the greatest argument that can go against the scenario proposed by Latendresse and it’s the historical context during which the set of relics bought by St Louis, King of France, from Baudouin II (who was a relative of Louis by the way), were brought to the new Sainte-Chapelle of Paris.\nAny good historian will tell you that whenever you have a hypothesis to analyze, the historical context is crucial…  At the time these relics were placed inside the Sainte-Chapelle (around the middle of the 13th Century), this was a time where everything related to the Passion of Christ was becoming very popular in Europe.  In that context, it’s not surprising to understand why the relic of the whole set that was considered as being the most important item by St Louis and all the French faithful was the crown of thorns (much more than the Mandylion, which really seem to have been considered by the French King as just one relic among many other with less popular value than the relics directly related to the Passion, like the crown of thorns for example)!\nConsidering this historical FACT, we can now understand the very big problem associated with the scenario proposed by Latendresse! Effectively, if the Mandylion would really have been the Shroud with the facial region visible for anyone to see, it is EVIDENT that St Louis and all the French faithful would have found that this particular relic was directly related to Jesus’ Passion and, therefore, this discovery would have make a lot of noise and probably even more than the acquisition of the crown of thorns!  The fact that this never happened at the time indicate with great certainty that this particular relic was NOT AT ALL related to the Passion of Christ…  This is pure logic, considering the historical context, which is something that Latendresse seems to have neglected.  Effectively, anyone with a brain that works all right can easily see a direct connection between the facial region of the Shroud and the Passion of Jesus-Christ!  Even a Christian kid could make the link!  \nBecause of this, you can be sure that if the Mandylion that had been bought by Louis was in reality the Shroud folded in 8, anyone who saw the relic (starting with Louis himself and the man he sent to Constantinople to check the authenticity of the set of relics) would have make the link between all the bloodstains present in the facial region of the Shroud and the Passion of Christ and would have considered it as being a relic directly associated with the Passion (maybe by considering it as the authentic Veronica vail or, after an unfolding of the cloth, by considering it as the real burial cloth of Jesus).  One way or the other, you can bet your house that such a bloodstained relic of the face of Christ would have been presented with lot of noise by Louis to the French faithful once the relic would have been placed inside the Sainte-Chapelle…  But because none of this happened and because that was the crown of thorns instead that made this great noise, we are practically certain that the Mandylion that was bought by Louis was NOT AT ALL related to the Passion of Christ and, therefore, could not in any possible and logical way have been the Shroud of Turin folded in 8, while showing only the facial region.  Also, because of this, there is a good probability that this Mandylion was looking pretty much like the ancient depiction of the Mandylion of Edessa, i.e. a small cloth showing the face of the living Christ without any signs of injuries or blood.\nIn summary, the scenario proposed by Latendresse do not fit at all with the historical context during which the Mandylion and all the other relics arrived at the Sainte-Chapelle in Paris, which was a time (middle of the 13 century) and a place (Europe) where the spirituality of people was greatly focused on the Passion of Christ and everything that was related to it was very popular (like, for example, a relic of the Passion like the crown of thorns or gruesome crucifixes or new icons like the Man of Sorrow).  It’s evident that, in such a context, if the Mandylion that has been bought by St Louis had been the Shroud, the arrival of this particular relic in Paris (a relic that would have clearly showed Jesus face with lots of bloodstains) would have made a big noise and probably even more than the crown of thorns.  The fact that this is not at all what happened clearly indicates that this particular relic had nothing to do with the Passion of Christ, which is exactly what we can already find in all the lists of relics of Constantinople, where this particular relic was never associated with the Passion.  In fact, the one that made a lot of noise was, no surprisingly, the crown of thorns…\nThat’s all people!  Meditate on this and maybe you’ll end up understanding how illogical and weak Latendresse hypothesis really is, especially in regard of the historical context during which the set of relics bought by St Louis arrived in the Sainte-Chapelle of Paris…\n\n","date":"August 7, 2015 at 7:30 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207670","author":"Yannick Clément","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"I’ve looked at the Mandylion numerous times, comparing it to the negative Shroud image.\nAnd just to be unbiased in my analysis, I’ve even stood on one foot and turned my head 45 degrees, while squinting my right eye for a more detailed view.   :) \nIn truth, I fail to see the same resemblance that I do, when comparing the Shroud to both the Justinian II gold solidus Pantocrator coin and the silver vase.\nYet, I haven’t made the comparison of the Mandylion to the positive image on the Shroud.\n\n","date":"August 7, 2015 at 8:13 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207715","author":"Angel","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"It is curious that the relic known as the “Crown of Thorns” held in Paris is only a simple circlet.  It may at one time have had thorns on it, but they have long disappeared having been dispersed around various destinations as a donated relic from the “true crown of thorns”.  It accounts for the circlet type of crown seen on various western art works of Christ wearing such a crown.  The type of crown worn by various eastern monarchs was more like a type of helmet, such as seen on coins issued under Abgar VIII the Great of Edessa for instance.  The head wounds evident on the Shroud image, would indicate that the actual crown worn by the TSM matches the helmet type of crown.  It is one small argument for the Shroud’s authenticity, as a western origin for the image would be more likely to reflect a circlet in the pattern of the head wounds.  If the Paris relic is at all genuine, then it may have been used to keep a helmet style of thorned crown in place.\n\n","date":"August 7, 2015 at 9:36 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207723","author":"daveb of wellington nz","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"About two weeks ago when I saw the shadow of that “Crown of Thorns” in Paris, I wondered why it is circlet. Thank you Daveb for your imagination and clarification.\n\n","date":"August 8, 2015 at 3:18 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207733","author":"Sampath Fernando","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Quote from Dave: ” If the Paris relic is at all genuine, then it may have been used to keep a helmet style of thorned crown in place.”\nI agree that this is the most rational explanation for this kind of simple circlet without thorns and, because we know the Shroud man was wearing a helmet of thorns and not a crown like we used to see in religious art, there’s still a possibility that this circlet could be as genuine as the Shroud and could have really been tight-up around the Shroud man’s head.\n\n","date":"August 10, 2015 at 8:46 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207868","author":"Yannick Clément","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"“The type of crown worn by various eastern monarchs was more like a type of helmet.”\nNo it wasn’t. The type of helmet worn by eastern monarchs looked like a helmet, the crown was a circlet, sometimes like a child’s drawing with rays pointing up, often as a wreath of leaves, torque or twisted band. Searching for images of 1st or 2nd century coins gives us no images of cap-like crowns, and paintings of king Abgar in state, rather than as a military leader on his coins, give him an ordinary circlet crown like any other king. (There is, to be fair, a 3rd century image of a king wearing a kind of fretwork cap, but it is very much the exception) I think the myth of the cap-like crown may have been invented by Vignon simply to account for a few bloodstains on the top of the head, which was surely unnecessary in view of the other injuries Christ endured.\n\n","date":"August 8, 2015 at 5:25 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207743","author":"Hugh Farey","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Hugh, I believe you are mistaken.  It is not merely an invention by Vignon.  Coins issued by Abgar VIII clearly show him wearing a helmet as a crown.  Under benign emperor Commodus, his helmet style crown has a cross.  Under despotic emperor Septimus Severus, the crown no longer has a cross but is replaced with stars.  You can find these images in Markwardt’s 2008 Ohio paper that I mentioned above.  When you have a different opinion from others, I should prefer a more courteous response than downright contradiction.\n\n","date":"August 8, 2015 at 6:55 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207745","author":"daveb of wellington nz","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"In 1978, Ian Wilson ascribed the “inspiration of copies of the likeness of Christ in art” to the Image of Edessa (The Shroud of Turin, Doubleday, p. 120) and he cited, among his examples, the Justinian II solidus coin of 692 AD (p. 122).  The coin is of course Byzantine and not Syrian nor Edessan.  It bears a striking resemblance to the Shroud facial image. \nIn 1998, Wilson first mentioned the Homs vase (The Blood and the Shroud, Free Press, 1998, p. 141) in support of his Mandylion theory.  He stated that it was “a silver vase discovered at Homs, the ancient Emesa, in Syria”.  He failed to mention that, in the 6th century, Emesa was a Byzantine, rather than a Syrian city.  This omission therefore creates an impression of unjustifiably identifying the vase with the Image of Edessa.  \nEmesa is well to the south of both Antioch and Edessa, and perhaps because of this a misperception can easily be made.  Christians were slow to settle in Emesa because of the strength of the sun-god cult there.  A Semi-Arian, Eusebius of Emesa, a friend of Constantius II was appointed bishop in 339, but because of his unorthodoxy the Emesan inhabitants expelled him.  An orthodox bishop Silvanus was executed by Julian the Apostate in about 361 and the Christian basilica was for a short time made a shrine to Bacchus.  Another 4th century bishop Nemesius is the author of an extremely important work “On the Nature of Man, the first known compendium of theological anthropology with a Christian orientation. The treatise considerably influenced later Byzantine and medieval Latin philosophical theology.  By the 5th century Byzantine Christianity was well-established and it became an important Byzantine centre for Eastern Christianity.  The emperor Heraclius was obliged to abandon the city to Rashidun Muslims following the decisive Battle of Yarmouk in 636.     \nSo for some 300 years then, Emesa was a centre of Byzantine Christianity.  The Homs vase must date from within this window, and it is therefore definitely Byzantine.  \nIn his 1998 book, Wilson first mentioned the St. Catherine Pantocrator icon (p. 159), dating it to the 6th century, but, here again, he failed to mention that this Sinai monastery was founded by Justinian I and that, therefore, the icon is undoubtedly Byzantine, and not Edessan, in origin.  \nHistorians, unfamiliar with the Shroud likeness or unwilling to ascribe it as a source of the imagery, are prone to attribute the images of the Pantocrator and the Justinian II 692 solidus to the Phidias Zeus, an impressive 13 m high statue.  Images of the statue are easily found on the web, and those more familiar with the Shroud image will be unimpressed by such a claim.\nIn 2010, Wilson noted how Justinian II, after 705, issued coins bearing a non-Pantocrator Christ face, but he then boldly asserted, with no historical support, that these later coins were “almost certainly” based upon the Image of Camuliana, while the earlier coins were based upon the image of the Shroud that could be found upon the Image of Edessa (The Shroud, Bantam Press, pp. 151-152). He also again mentioned both the St. Catherine Pantocrator icon and “the silver vase that was found in Homs in Syria” (p. 135).  \nThere is no basis whatsoever for attributing the 705 solidus to the Image of Camuliana, in fact it is more likely to have been based on a Syrian origin (Grierson).  A likely explanation is that the superstitious Justinian II, having faced a series of earlier defeats, had decided that representations of the Image of God Incarnate on his coinage had met with divine disapproval, and hence changed the image of Christ to one that more closely reflected his human nature. \nThe Image of Edessa probably first came to imperial notice in 787 when iconophiles at the Second Council of Nicea raised it to celebrity status by claiming it as a proven palladium that could save a city from conquest.  Imperial desires to expropriate the relic were realised in 943 when John Curcuas succeeded in negotiating an agreement with the Islamic authorities.  Until the arrival of the Mandylion at Constantinople on 15 August 944, and its inspection by Constantine VII Porphyrogennetos, there seems to be no reason why the Byzantines should have had any prior knowledge of the likeness of the icon.  \nNevertheless there are at least three primary Byzantine images of Christ of the 6th and 7th centuries which may be seen as close likenesses to the Shroud image and which predate the arrival of the Mandylion in Constantinople:  the St Catherine’s Pantocrator, the 692 solidus, and the Homs vase.  \nWilson’s perplexing association of these artefacts with the Image of Edessa, effectively drew attention away from both the Byzantine capital of Constantinople, where the Image of God Incarnate had been present from at least 574, and also from the Byzantine province of Cappadocia where this same image had been present from at least 554.  \nI hope that this brief summary may dispose of any doubts concerning the weaknesses in the Mandylion theory proposed by Wilson and subsequently by De Wesselow.\n\n","date":"August 8, 2015 at 7:00 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207746","author":"daveb of wellington nz","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"“Coins issued by Abgar VIII clearly show him wearing a helmet as a crown.” He is wearing a helmet, true, which, by virtue of his being a king, I suppose can be interpreted as a crown. This style of regal headgear is wholly unusual, as a trawl through all the other contemporary depiction of monarchs will easily demonstrate.\nHowever, I’m sorry if my bald rejection of your original comment was too abrupt.\n““The type of crown worn by various eastern monarchs was more like a type of helmet.”\nI believe you are mistaken, as the evidence supporting this statement is so disproportionately small compared to the evidence contradicting it.\n\n","date":"August 8, 2015 at 7:04 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207747","author":"Hugh Farey","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Following your suggestion, I have “trawled” through a series of images for ancient crowns.  I conclude that a helmet type is not as disproportionately small as you assert.  There is considerable variation in the styles.  They were quite often modeled on the pileus.  Searches on ancient types of Assyrian, Egyptian, Persian and Indian crowns quite often show this type.  In some cases it comprises a circlet but surmounted by 4 to 8 overarching arms to the specific regal symbol atop, usually with some type of fitted satin cap.  Ancient Greek crowns seem to have been of the circlet type; Roman types were usually worked in the form of a laurel wreath circlet. \nOf the crown of thorns, St Vincent of Lerins (d. 445) states (Sermo in Parasceve): “They placed on his head a crown of thorns; it was, in fact, in the shape of a pileus, so that it touched and covered His head in every part.” (cited by Barbet) . \nBarbet also comments that the Notre-Dame “crown of thorns” that St Louis obtained from the Venetians in pledge for a loan, is actually a circlet made from plaited rushes, and that ancient authors from the time of Gregory of Tours have said that the crown was made of sea-rushes, which in the immediate environment of Jerusalem would seem a little peculiar.  However if this circlet crown is at all genuine, then it was clearly intended to hold the thorns on the head. \nThe wounds and blood-stains on the head of the TSM are highly significant and are not as incidental as suggested in your previous comment.  They are a significant pointer to the identity of the TSM, as Jesus of Nazareth is the only crucifixion victim recorded as having been inflicted with the gratuitous and unusual punishment of a crown of thorns.\n\n","date":"August 8, 2015 at 4:59 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207773","author":"daveb of wellington nz","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Daveb, you are right. I at least can easily see a thorn from the plant “Zisyphus spina christi” that Professor A. Danin identified on the Shroud. I have a branch with thorns from the plant, plucked on the outskirts of Jerusalem.\nLady Ethel Drower wrote that people never cut down “Christ’s thorn jujube” in Iraq.\nHave a look at:\nhttp://www.flowersinisrael.com/ziziphusspina-christi_page.htm\n\n","date":"August 8, 2015 at 5:32 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207774","author":"Louis","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"India:\nIllustrated copies of the “Ramayana” and “Mahabharata” show the figures wearing helmet-like crowns. The maharaja usually belonged to the “kshatriya”(warrior) caste.\nThe crown used by the last Maharaja of Mysore:\nhttp://www.theguardian.com/world/2015/may/27/intrigue-royal-house-kanthraj-urs-of-mysore#img-1\n\n","date":"August 8, 2015 at 5:51 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207776","author":"Louis","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"http://jesuitjoe.blogspot.com.br/2015/05/back-to-new-orleans.html\nScroll down to see the crown of thorns that Pope Pius IX is said to have sent to Jefferson Davis.\n\n","date":"August 8, 2015 at 9:08 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207752","author":"Louis","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Thank you Louis, this crown is of course the traditional circlet.  I note a suggestion that Jefferson’s wife Varina may actually have woven it, which under the circumstances might not seem unlikely.  Pio Nono did send a personally signed picture of himself during the Confederate President’s post-war imprisonment.\n\n","date":"August 8, 2015 at 3:34 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207767","author":"daveb of wellington nz","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"So, daveb, which of the two is it, crown or helmet?\nWhat I have found is the New Testament writers used the word στέφανος (stephanos) to describe Jesus’ crown of thorns or more precisely a plaited or braided wreath.  Yet, I have seen some in the Shroud community refer to it as a “cap” of thorns.\nOrigin of the Word στέφανος (stephanos\nfrom stephó (to encircle)\nDefinition -that which surrounds, i.e. a crown\nhttp://bibleapps.com/greek/4735.htm\nhttp://www.spiritandtruth.org/teaching/Book_of_Revelation/commentary/htm/topics/crowns.html\n\n","date":"August 9, 2015 at 4:12 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207815","author":"Angel","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Hello Angel,  Yes I’ve checked out several versions of the Greek NT, and Mt, Mk & Jn all give it as stephanon .  Perseus dictionary has several related words, and all convey the idea of encircling like a wreath.  \nIs this in accord with the wounds seen on the head of the TSM?  Barbet thinks not, and evidently believes it was more like a pileus, and quotes St Vincent of Lerins in support.  He also considers that the relic at Notre-Dame in the shape if a circlet cannot be the crown of thorns, as it is made of rushes, and if it’s at all authentic, then it’s only use could have been to hold the thorns on the head.  Or did those naughty Venetians weave it themselves making up a story to get their loan from St Louis.  Would they do that? Who knows? \nBoth Matthew and John are building on Mark’s narrative for their own particular story of the Passion.  If Mark chose the wrong word, then it would be carried through to Mt & Jn.  I believe the helmet style of crown was prevalent enough in the Middle East for the crown of thorns to have been of this type.\n\n","date":"August 10, 2015 at 12:39 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207838","author":"daveb of wellington nz","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"You’re welcome, daveb.\nIt could be, but then what would she stand to gain? Two top US Civil War generals, Sheridan and Sherman, were Catholics — fighting the Confederates.\nGeneral Robert Lee is also said to have kept a portrait of the Pope at home. Well, both Davis and Lee belonged to the Episcopal Church.\n\n","date":"August 8, 2015 at 4:03 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207770","author":"Louis","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Thoughts for the day….\nIf a medieval faker was trying to mimic an imprint of Christ on the Shroud then wouldn’t he most likely have shown the full back of rhe legs imprinted on the cloth? Don’t think it makes sense that he would have executed the image as we see it with distance between much of the back of legs and cloth.\n\n","date":"August 9, 2015 at 2:49 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207788","author":"Thomas","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Maybe our medieval relics-U-like artisan was attempting to model what you see in this and similar artwork, Thomas, with the so-called “Shroud” being J of A’s transport linen.\nhttps://shroudofturinwithoutallthehype.files.wordpress.com/2014/12/deposition-removal-of-transport-linen.jpg?w=640&h=510\n\n","date":"August 9, 2015 at 2:58 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207789","author":"Colin Berry","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Re Latin Abgar Legend in Vatican Codex:\n“The codex relates that Jesus, having informed Abgar that “… if you wish to see my face in the flesh, behold I send to you a linen, on which you will discover not only the features of my face, but a divinely copied configuration of my entire body”, ”  \nThis 11th or 12th century Latin translation from a Syrian text reflects a late stage of the legend, but possibly dating from as early as 800 AD.  Note that Wilson claimed that the full length image that he supposes was on the Mandylion only came to light sometime after the Mandylion’s arrival at Constantinople in 944 AD.  A somewhat similar reference is found in a text by Pope Stephen III ca 769 AD.  Both references reflect an earlier memory of a full length image, already in Constantinople, but which had been hidden away, and which had now been erroneously attributed to the Edessa image.    \nBoth Wilson and De Wesselow seemed to accept these texts at face value without penetrating any further.  This confusion is addressd in Markwardt’s 2014 St Louis paper: “Modern Scholarship And The History Of The Turin Shroud”:\nhttp://www.shroud.com/pdfs/stlmarkwardtpaper.pdf   See Chapter ‘The Blurring Of Image Texts’  p.53 at seq.  \nMarkwardt addresses the reason why the full-length image in Constantinople had been hidden away in his chapter ‘The Imperial Covenant With God’ pp.48-52.  \nThe source is contained in a document known as the Tarragon manuscript, and refers to an imaged linen cloth which was always kept in a golden case and very carefully locked up.  The ms describes how a series of continuous earthquakes threatened the city, and how a heavenly vision revealed that the city would not be freed from the quakes until the sacred linen was locked away far from human eyes.  And so it was done and the earthquakes stopped.  “From that time on nobody has dared to open the case or to see what might be inside it, as everyone believes and fears that if anyone tries to open it the whole city will be struck by another earthquake.” \nThis cloth cannot have been the Mandylion, which was often displayed to many persons on several occasions, both in Edessa and in Constantinople.  There was only one other known such cloth in Constantinople, the ‘Image of God Incarnate’ and it follows that this was the cloth that had been locked away. \nThis series of continuous quakes must be identified with those commencing on Oct 26, 740 and they continued for the next 12 months.  The emperor Constantine V interpreted the quakes as a divine sign that the Image of God Incarnate should not be viewed nor used for any imperial purpose, sealed it away in a golden case, and coincidentally the quakes ceased.  This Covenant with God effectively consigned the Shroud to four and a half centuries of complete obscurity.  \nThere remained the memory of the full length body image, but it became erroneously associated with the Mandylion.  \nOnly the emperor was permitted to open the golden case and view the image.  In his youth, King Bela III of Hungary was educated at the Byzantine court and for a time was betrothed to the emperor’s daughter.  As heir-designate he would have been permitted to view the image, and this may have enabled the Shroud-like illustrations in the Pray manuscript, following his being crowned king of Hungary in 1173.  \nThe Imperial Covenant with God was eventually broken by Alexios III Angelos (1195-1203) probably in 1201.  This is evident in a statement by Nicholas Mesarites referring to reenactments of the resurrection at the Pharos chapel involving the sindon that had wrapped the mysterious naked body after the Passion.  Robert de Clari of course refers to a similar reenactment at the Blachernae church in 1204. \nFor the full story you need to refer to the Markwardt paper.  The Mandylion theory espoused by Wilson, and more latterly by De Wesselow has found many objections from historians aware of its defects, and they rightly complain that it has obscured more fruitful lines of enquiry.  However there has been a considerable authenticist intellectual investment in the theory, and many are still reluctant to abandon it.  \nI consider that Markwardt’s research has made a major contribution towards getting closer to the real truth of the history of the Shroud as the real burial cloth of Christ.\n\n","date":"August 9, 2015 at 4:54 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207792","author":"daveb of wellington nz","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Thanks daveb. Regardless of mandylin connection or not I believe the reference to the full body image is suggestive of the shroud.\n\n","date":"August 9, 2015 at 3:32 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207811","author":"Thomas","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"For a superbly detailed exploration of the Image of Edessa, try Mark Gucin’s “The Tradition of the Image of Edessa” which was published a few months ago at https://pure.royalholloway.ac.uk/portal/files/24278014/MARK_GUSCIN_PhD_THESIS_05.03.15.pdf.\n\n","date":"August 9, 2015 at 4:15 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207816","author":"Hugh Farey","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Hugh, what a magnificent Grand Opus, It will be a major reference source for everyone interested in the Mandylion for many years to come.  Congratulations on discovering it. But there’s no pictures, pity.\n\n","date":"August 9, 2015 at 6:58 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207823","author":"daveb of wellington nz","site":"shroudstory"},{"title":"From Constantinople to Lirey through the Sainte-Chapelle","post":"Mark Guscin notes the destruction of Constantinople in 1204 and lists some of the relics taken back to Europe. On p.97 he states ‘No mention is made of the Image of Edessa in any of the lists of relics and treasures taken back to Europe. It seems to have quite simply vanished.’ The reason it was not taken back, at least in 1204, is that it was in the Pharos Chapel in the imperial palace that was not looted in 1204. So we can assume it remained there and its subsequent history needs to be charted from then on with this in mind. ( I favour the sources that say it did go to the Saint-Chapelle.)\n\n","date":"August 10, 2015 at 3:16 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","id":"comment-207845","author":"Charles Freeman","site":"shroudstory"}]
