[{"title":"Happy Easter from Discovery","post":"There are four accounts that generally concur in describing the crucifixion of Jesus. And they are written. They were not written contemporaneously but were based upon oral traditions that were contemporaneous. Paul wrote his epistles circa 50 CE which was only three decades after the crucifixion.\nAnd the there is Roman historian Tacitus who wrote later than St. Paul but described the persecutions of Christians by Nero and the reasons for it. Essentially he despised Christians and Christianity as any self respecting Roman noble would:\nFrom Chapter Two of my manuscript:\n“Writing nearly 80 years after the death of Jesus Christ, he [Tacitus]  leaves little doubt, that from the pagan Roman perspective, there was in fact a Christ, he was in fact executed, and the cult that surrounded him did not end with his death but survived and flourished. \n“The occasion for Tacitus’ reference to Christ and Christians was the aftermath of a fire during the regime of Nero that destroyed much of Rome. To counteract rumors that Nero, himself, was responsible for the fire, he blamed the burgeoning Christian sect in Rome and commenced a pervasive, sadistic persecution of the Christians: \n“’Consequently, to get rid of the report, Nero fastened the guilt and inflicted the most exquisite tortures on a class hated for their abominations, called Christians by the populace. Christus, from whom the name had its origin, suffered the extreme penalty during the reign of Tiberius at the hands of one of our procurators, Pontius Pilatus, and a most mischievous superstition, thus checked for the moment, again broke out not only in Judaea, the first source of the evil, but even in Rome, where all things hideous and shameful from every part of the world find their centre and become popular.’ \n“John Meier finds that the Tacitus report in Annals is authentic and not a Christian forgery.”\nOstrich-like agnostics and atheists can stick their head in the sand is they prefer. But as to the physical reality of Christ and his death, one simple message: deal with it.\n\n","date":"April 19, 2014 at 11:12 am","url":"https://shroudstory.com/2014/04/19/happy-easter-from-discovery/","cat":"history","id":"comment-101275","author":"John Klotz","site":"shroudstory"},{"title":"Happy Easter from Discovery","post":"Typo alert : “sand is they prefer” should be “sand if they prefer.”\n\n","date":"April 19, 2014 at 11:21 am","url":"https://shroudstory.com/2014/04/19/happy-easter-from-discovery/","cat":"history","id":"comment-101282","author":"John Klotz","site":"shroudstory"},{"title":"Happy Easter from Discovery","post":"Unlike you, Dan, I am upset by the rest of it. Whether the Discovery channel claims on the Old Testament are true or not(I tend to doubt a lot of it, since in 10 years some new discovery could be made that thoroughly discredits the “latest findings”), this program’s only purpose is to try to demolish the faith of people. I find it sickening that every year, the Judeo-Christian tradition is artificially “debunked” by people with an anti-religious, secular agenda. If people want to know why Fundamentalism is so popular, it’s because of crap like this. Maybe people too often seek easy answers, but they also want to believe. So they seek solace in Churches where faith in God is strong and every little event in the Bible isn’t somehow trivialized or made light of. I have family members who believe all of these shows, and they come away from them believing that faith in God is stupid. I hate to get all sanctimonious, but in the words of the likely Man of the Shroud, “It would be better for them to be thrown into the sea with a millstone tied around their neck than to cause one of these little ones to stumble”.\nRant over. Happy Easter to one and all.\n\n","date":"April 19, 2014 at 11:28 am","url":"https://shroudstory.com/2014/04/19/happy-easter-from-discovery/","cat":"history","id":"comment-101285","author":"Chesterbelloc","site":"shroudstory"},{"title":"Happy Easter from Discovery","post":"They forget to say that Christianity started as a Resurrection movement.\n\n","date":"April 19, 2014 at 11:28 am","url":"https://shroudstory.com/2014/04/19/happy-easter-from-discovery/","cat":"history","id":"comment-101286","author":"Louis","site":"shroudstory"},{"title":"Happy Easter from Discovery","post":"For camels in Israel, don’t generalize. Many scholars think that camel domestication in Genesis is not an anachronism. \nhttp://www.christianitytoday.com/ct/2014/february-web-only/latest-challenge-bible-accuracy-abraham-anachronistic-camel.html\n\n","date":"April 19, 2014 at 12:33 pm","url":"https://shroudstory.com/2014/04/19/happy-easter-from-discovery/","cat":"history","id":"comment-101311","author":"Tristan Casabianca","site":"shroudstory"},{"title":"Happy Easter from Discovery","post":"The problem is not camels, or animals in general, it is the question: were the authors of Genesis aware of bacteria and virus?\n\n","date":"April 19, 2014 at 12:55 pm","url":"https://shroudstory.com/2014/04/19/happy-easter-from-discovery/","cat":"history","id":"comment-101326","author":"Louis","site":"shroudstory"},{"title":"Happy Easter from Discovery","post":"I see such skepticism as the natural and normal human reaction to the biblical literalism of the evangelical church movement, who failed to understand what the Bible really is. It is responsible for the falling away from true religion by its excessive claims of biblical literalism which go beyond the bounds of acceptable credibility. It is no accident that the most aggressive agnostics and atheists have often had a youthful background of such literalism, which in their more reflective mature years they quite rightly reject. Unfortunate but inevitable. But there is a better way!\n\n","date":"April 19, 2014 at 4:54 pm","url":"https://shroudstory.com/2014/04/19/happy-easter-from-discovery/","cat":"history","id":"comment-101402","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Happy Easter from Discovery","post":"Well stated as usual Dave.\n\n","date":"April 19, 2014 at 4:59 pm","url":"https://shroudstory.com/2014/04/19/happy-easter-from-discovery/","cat":"history","id":"comment-101403","author":"John Klotz","site":"shroudstory"},{"title":"Happy Easter from Discovery","post":"” the Shroud of Turin, the piece of linen that that some believe to have been wrapped around Jesus’ body after the crucifixion and others debunk as a medieval fake following radiocarbon tests. The Vatican itself remains neutral on the issue.\nSince we know a lot about the shroud. I think this weak argument against it, that runs away with the C14 dating and fails to mentions any of its unique characteristics sums up the typical Neo-Atheist bias here. We all know there is a lot more than what the author mentioned here and that her assessment was truncated. The same can be said about the camels, Adam and Eve and the flood. There is a lot more than what she mentions here…..a lot more. Here is what the smithsonian institute department of archeology had to say about the historicity of the biblical accounts\n“…..In short, it is impossible to verify the actual events recorded in the Biblical account of the flood. On the other hand, much of the Bible, in particular the historical books of the old testament, are as accurate historical documents as any that we have from antiquity and are in fact more accurate than many of the Egyptian, Mesopotamian, or Greek histories. These Biblical records can be and are used as are other ancient documents in archeological work. For the most part, historical events described took place and the peoples cited really existed. This is not to say that names of all peoples and places mentioned can be identified today, or that every event as reported in the historical books happened exactly as stated. There are conflicts between present archeological evidence and historical reports that may result from a lack of information on our part or from misunderstandings or mistakes by the ancient writers.”\n\n","date":"April 19, 2014 at 9:44 pm","url":"https://shroudstory.com/2014/04/19/happy-easter-from-discovery/","cat":"history","id":"comment-101493","author":"Mike M","site":"shroudstory"},{"title":"Happy Easter from Discovery","post":"Correction….Department of “anthropology”\n\n","date":"April 19, 2014 at 9:46 pm","url":"https://shroudstory.com/2014/04/19/happy-easter-from-discovery/","cat":"history","id":"comment-101496","author":"Mike M","site":"shroudstory"}]
