[{"title":"Have a think about it. Of linen strips and the Shroud of Turin.","post":"Oh, there are soooo many possibilities that I don’t think we can draw firm conclusions from the little bits of info that are in the Bible. \nFor one thing, we know that Mary Magdalene was there at the tomb BEFORE Peter and John looked into it. She might have taken the large shroud with her!! When the man in the garden asked why she was weeping, she asked the man if he knew where Jesus body was. Perhaps she had the shroud in her hands, looking for the body to wrap it with. That fabric was valuable (all fabric was valuable in those times) and so she was hanging onto it because she needed it – and could not afford to go buy another. \nAnd perhaps it is Mary Magdalene who ended up keeping that Shroud as a memento and memorial – which somehow was saved and preserved through the centuries. \nBecause she is so prominently mentioned in the gospel accounts of the resurrection morning, I would not be surprised if she did indeed have something to do with the Shroud. I can see how it would have happened very naturally.\n\n","date":"January 13, 2012 at 5:23 am","url":"https://shroudstory.com/2012/01/13/have-a-think-about-it-of-linen-strips-and-the-shroud-of-turin/","cat":"history","id":"comment-6897","author":"AnnieCee","site":"shroudstory"},{"title":"Have a think about it. Of linen strips and the Shroud of Turin.","post":"A fragment of the Gospel of the Hebrew (a first century lost gospel) does read: “Now the Lord, when he had given the linen cloth to the servant (= auxiliary of justice = Joseph) of the (high) priest […]”. Therefore (according to the early Judeo-Christians) Rabbi Yeshua either had worn or taken with him the Shroud after coming back to life.\n\n","date":"January 13, 2012 at 4:23 pm","url":"https://shroudstory.com/2012/01/13/have-a-think-about-it-of-linen-strips-and-the-shroud-of-turin/","cat":"history","id":"comment-6943","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Have a think about it. Of linen strips and the Shroud of Turin.","post":"Most likely, Rabbi Yeshua had worn the Shroud. So it would explain the reason why he was mistaken for the gardener of  Joseph’s garden-tomb by Mary Magdalene.\n\n","date":"January 13, 2012 at 4:28 pm","url":"https://shroudstory.com/2012/01/13/have-a-think-about-it-of-linen-strips-and-the-shroud-of-turin/","cat":"history","id":"comment-6944","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Have a think about it. Of linen strips and the Shroud of Turin.","post":"Typo error: “the Gospel of the Hebrews”\n\n","date":"January 14, 2012 at 9:01 am","url":"https://shroudstory.com/2012/01/13/have-a-think-about-it-of-linen-strips-and-the-shroud-of-turin/","cat":"history","id":"comment-6966","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Have a think about it. Of linen strips and the Shroud of Turin.","post":">John 20:5-7 says “He bent over and looked in at the strips of linen lying there but did not go in. Then Simon Peter came along behind him and went straight into the tomb. He saw the strips of linen lying there, as well as the cloth that had been wrapped around Jesus’ head. The cloth was still lying in its place, separate from the linen.”\nJohn 20:5-7 does not say that. An ENGLISH TRANSLATION (NIV) of the Greek of John 20:5-7 says that.\nThe old joke: “if the King James Version” was good enough for St Paul, it is good enough for me” applies. The point is that the New Testament is in Greek and if one wants to make an argument that is based on key words, as this one is (“strips of linen”), then one must find out what the original Greek means.\nMy Interlinear Greek New Testament, renders it more literally:\n“5 and stooping sees lying the sheets [Gk. othonia], not however he entered. 6 Comes therefore also Simon Peter following him, and entered into the tomb; and he beholds the sheets [othonia] lying, 7 and the kerchief [sudarion], which was on the head of  him, not with the sheets [othonia] lying but apart having been wrapped up in.one place\nIn this case the key word is othonia which is translated “strips of linen” in one English translations, e.g. NIV.\nBut the word othonia is just the plural of othone] “linen cloth.” So the KJV is more accurate than the NIV, as it renders the word othonia as “linen clothes”:\n5And he stooping down, and looking in, saw the linen clothes lying; yet went he not in. 6Then cometh Simon Peter following him, and went into the sepulchre, and seeth the linen clothes lie, 7And the napkin, that was about his head, not lying with the linen clothes, but wrapped together in a place by itself. \nThe English Standard Version (ESV), which is regarded as one of the more accurate modern translations, renders othonia as “linen clothes”:\n5And he stooping down, and looking in, saw the linen clothes lying; yet went he not in. 6Then cometh Simon Peter following him, and went into the sepulchre, and seeth the linen clothes lie, 7And the napkin, that was about his head, not lying with the linen clothes, but wrapped together in a place by itself. \nAlso Lk 23:53 (NIV) refers to Jesus’ body being “wrapped … in linen cloth” (Gk. sindon (singular) a linen sheet:\n53 Then he took it down, wrapped it in linen cloth and placed it in a tomb cut in the rock, one in which no one had yet been laid. \nand\nLk 24:12 (NIV) refers to the linen cloths [othonia] (plural), again wrongly translated “strips”:\n12 Peter, however, got up and ran to the tomb. Bending over, he saw the strips of linen lying by themselves, and he went away, wondering to himself what had happened. \nSo Luke sees no inconsistency between Jesus body being wrapped or enfolded in a large linen sheet [sindon] (singular) and Peter and John finding in Jesus’ empty tomb, “linen cloths” [othonia] (plural).   \nTherefore, in Jn 20:5-7, John, like Luke, by othonia is referrring to the linen cloths (plural), which included the large linen sheet sindon, and the smaller bandages keiria (Jn 11:44) which in Jewish burials bound the hands, feet and jaw, fr example, in the case of the raising of Lazarus, which the NIV inconsistently translates this different Greek work also as “strips of linen”:\nJn 11:44 The dead man came out, his hands and feet wrapped with strips of linen [keiria], and a cloth around his face [soudarion].  Jesus said to them, “Take off the grave clothes [keiria] and let him go.\nPutting it all together, what Peter and John saw in Jesus’ empty tomb, as described by John 20:5-7, was:\n1. The linen cloths collectively: the Shroud [sindon] and bandages [keiria]; and \n2. The “cloth that had been wrapped around Jesus’ head” [soudarion] in a separate place.\nThis is fully consistent with the Shroud of Turin being included in the [othonia] “linen clothes” (KJV & ESV), “linen cloths” (RSV & NKJV), or “linen wrappings” (NASB & NLT), and the Sudarium of Oviedo being the “cloth [soudarion] around his face” (NIV) or “napkin, that was about his head” (ESV).\n\n","date":"January 13, 2012 at 9:05 am","url":"https://shroudstory.com/2012/01/13/have-a-think-about-it-of-linen-strips-and-the-shroud-of-turin/","cat":"history","id":"comment-6920","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Have a think about it. Of linen strips and the Shroud of Turin.","post":"Stephen, in spite of the deep respect I have for you & the good job your doing with your blog, I cannot help thinking it is just too bad you are not aware you may be just replacing one misinterpretation of John 20: 5-7 by another.\nIn the hypothesis the Shroud is Rabbi Yeshua’s & the shroud image formed during the burial (a possibility that SHALL NOT be completely ruled out),  Ricci’s reconstruction of the Shroud Man’s (see ill.) does look quite naive.  .\n\n","date":"January 13, 2012 at 3:56 pm","url":"https://shroudstory.com/2012/01/13/have-a-think-about-it-of-linen-strips-and-the-shroud-of-turin/","cat":"history","id":"comment-6940","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Have a think about it. Of linen strips and the Shroud of Turin.","post":"…and misleading.\n\n","date":"January 14, 2012 at 8:59 am","url":"https://shroudstory.com/2012/01/13/have-a-think-about-it-of-linen-strips-and-the-shroud-of-turin/","cat":"history","id":"comment-6965","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Have a think about it. Of linen strips and the Shroud of Turin.","post":"Typo error: “the Shroud Man’s wrapping up” (instead of “the Shroud Man’s”)\n\n","date":"January 13, 2012 at 4:06 pm","url":"https://shroudstory.com/2012/01/13/have-a-think-about-it-of-linen-strips-and-the-shroud-of-turin/","cat":"history","id":"comment-6942","author":"Max Patrick Hamon","site":"shroudstory"}]
