[{"title":"A Response by Dan Scavone to a Commenter in this Blog","post":"Dan, I can only applaud your answer. I think the tone of your answer was a thousand time more polite than the tone of the “Angry” commentator. Your answer is worth reading a couple of times by anyone who could have started to believe his arguments.\n\n","date":"March 25, 2012 at 3:02 pm","url":"https://shroudstory.com/2012/03/25/a-response-by-dan-scavone-to-a-commenter-in-this-blog/","cat":"history","id":"comment-9628","author":"latendre","site":"shroudstory"},{"title":"A Response by Dan Scavone to a Commenter in this Blog","post":"Dan, I can only applaud your answer. I think the tone of your answer was a thousand time more polite than the tone of the “Angry” commentator. Your answer is worth reading multiple times by anyone who could have started to believe his posts.\n\n","date":"March 25, 2012 at 3:05 pm","url":"https://shroudstory.com/2012/03/25/a-response-by-dan-scavone-to-a-commenter-in-this-blog/","cat":"history","id":"comment-9629","author":"latendre","site":"shroudstory"},{"title":"A Response by Dan Scavone to a Commenter in this Blog","post":"First of all, for those who don’t know, I want to say that this letter of M. Scavone is adressed to me personally.  I also want to say that the fact that M. Scavone is a “well respected” historian in the Shroud world doesn’t mean that much to me.  I seek the truth, I don’t seek to make friends and I’m not impress by the fact that someone can be well-known in the Shroud world…  That doesn’t mean this person is unbias.  On the other hand, I agree that sometimes, I can use some “angry tone” in my messages, but it is simply because I am who I am : a passionate guy who take this subject seriously (too much ? maybe !) and who seek the truth.\nM. Scavone, it is incredible how some of your arguments seem to be full of bias.  One thing’s for sure :  they are based on speculations and extrapolations and cannot be taken as solid facts that can prove Wilson’s hypothesis !  With your answer, I understand more why you (and M. Latendresse and many other “shroudies”) follow Wilson so blindly…  This is normal because, in order to be able to be able to make a direct link between the Mandylion (that mean a towel by the way) and a burial Shroud, IT IS IMPERATIVE TO USE A BUNCH OF SPECULATIONS AND EXTRAPOLATIONS. \nAnd the best example of that is always the “tetradiplon” thing.  M. Scavone, can you be honnest here and tell anyone that the word “sindon” in greek doesn’t mean necessarily a burial shroud ???  The reality is this :  it depend on the context !!!!  It can mean simply “cloth” in a more general sense or a tunic !  Here’s what Mark Guscin (a linguist) say about that in his book “The Image of Edessa” : “The cloth that Jesus wiped his face with is called both “tetradiplon” and “sindon”, bringing into the story for the first time the idea the IDEA THAT THE IMAGE WAS ON CLOTH.”  You can see here that Guscin doesn’t understand the word “sindon” like you do !  For him (and for me), the best way to understand this word, in the context of this particular manuscript, is “cloth”, not “burial shroud”.\nCan I give you an advice ?  Go back to the part of the text where the words “tetradiplon” and “sindon” are used and try for a second to think the author was meaning a burial shroud while using those words !  IT IS COMPLETELY OUT OF CONTEXT !!!!!!!!  In fact, it is purely speculative to understand that he was really meaning a burial shroud !   Here’s that critical part of the manuscript :  “And Ananias, having gone and given the letter, was carefully looking at Christ, but was unable to fix Him in his mind.  And He knew as knowing the heart, and asked to wash Himself; and a cloth [sindon tetradiplon] was given Him; and when He had washed Himself, He wiped His face with it.\nFirst of all, this story take place BEFORE Jesus Passion and death, during his ministry, while he was alive and well, without any injuries or blood stains !  And also, the author is specific about the FACT that Jesus ONLY wiped his FACE (not his whole body) with the cloth !!!  In this particular context, HOW IN THE WORLD THIS AUTHOR WAS TALKING ABOUT A LONG BURIAL SHROUD OF MORE THAN 4 METERS ??????  THIS IS COMPLETELY LUDICROUS.  That’s a perfect “full of bias” interpretation of an ancient text in order to defend “at all cost” Wilson’s hypothesis !!!!\nI have a question for you on the “sindon tetradiplon” topic that can easily show the inconsistency of your way of seeing things.  Here we go :  Since when a Jew (especially a Jew from Jesus time) would want to wipe his face with a burial shroud ???  I think the answer is obvious : THAT MAKE ABSOLUTELY NO SENSE AT ALL !!!!!!  Instead, have you ever consider the possibility that the author may simply want to refer to a long linen towel pretty much of the dimension of a beach towel or a long bath towel (maybe some kind of linen cloth that some Jews were wearing) ???  The fact is this :  there’s absolutely NOTHING in the text that can tells us the real dimension of the “tetradiplon”, not even the word “sindon”, which, in the context of the text, surely not refer to a burial shroud !\nNow, for the other text you mentionned, I guess you talk about the “Narratio de Imagine Edessena” right ?  Read that text again !!!!  The author (the Byzantine emperor Constantine VII) have put 2 different versions of the story of Abgar in the same manuscript !!!!  If he really intend to physically describe the image (like you seem to think), can you explain why he kept the “classical” version where the story take place during Jesus ministry (no blood traces on the cloth is possible here) ?  If he really saw the face that is on the Shroud of Turin, it seem completely illogical to act this way !  And if he really saw the face that is on the Shroud of Turin, why he place the action of the second version of the legend of Abgar during the agony in Gethsemane in not during the crucifixion or after the death of Christ ?  I ask this important question because for any Christian, the face that is on the Shroud refers directly to those event (the evidence of the crowning of thorns being the best clue for that) and NOT to the agony in Gethsemane !!!!  Come on !!!  Be honnest with me here !  Look at the Shroud face and tell me you automatically think about the agony of Christ in Gethsemane and not about is crucifixion and death !!!  Tell me this and I will add one more “full of bias” note in my mind !  In my mind, if the image that was seen by Constantine VII in 944 was really the face we see on the Shroud, there’s NO DOUBT at all that he would have locate his story after the crowning of thorns, since the blood stains on the forehead and in the hair on the Shroud refers directly to that very particular injury (that is so easy to notice on the Shroud). \nAnd on the so-called “physical description” supposedly contained in this legendary text, M. Scavone make a pretty bad direct link with the Shroud !  He talked about “the faint moist image on the face of the Shroud man”.  Even if the image seen by Constantine was really faint, how in the world can that be taken as some kind of “proof” that it was the SAME image as the one on the Shroud ?  Sorry but I’m not as dumb as you can think !  If the Mandylion image was really a copy made from the Shroud (like I think), don’t you think it would have been natural for the artist to make a faint image of the face of Christ ?  I think so !  You see, for every speculative argument you bring forward, I can show you easily one speculative argument of mine that goes directly in the opposite direction !  And you think I’m as dumb to believe you when you talk about FACTS or PROOFS ?  Sorry but what you bring to me are just speculative arguments, not facts or proofs.  In a legendary text like the “Narratio” that is full of theological reference, how can you be so sure that any description present there is a real authentic physical description of a relic (you consider the “faint” description as a fact !) and not just some kind of litterary creation made by the author ?  In reality, you can’t !  This so-called “physical description” can well be some kind of an image created by the author and used by him possibly because he was reffering to the sweat of agony of Christ.  In fact, this “description” could well be very far from the physical reality of the relic !  There’s no way to be sure because of the \nHave you ever thought that this second version that we found in the manuscript of Constantine VII (just like the sermon of Gregory Referendarius by the way) could have been more a “theological and spiritual way of teaching” than a real “physical description” ?  Read again the “Narratio” and note (like I did) all the theological references that is present in this book !!!!  If you’re honnest, you’ll see (like I saw) that it is FULL of theological and spiritual references !  And remember that this manuscript is a legendary kind of text and we cannot consider it on the same level than, let’s say some description of relics that exist (dating from the 11th and 12th century) and that came mostly from pilgrims visiting the Pharos chapel in Constantinople.  Without any doubt, those are really eyewitness account.  And what those account tells us ?  That, during those days, in Constantinople, the was a shroud of Christ (often describe with other linen cloths) AND a smaller linen cloth bearing the image of only the face of Christ (some descriptions mention also the Keramion, which was a tile that was bearing the same exact image of the face).  \nYou prefer to build your case on a legendary text like the “Narratio”, and make speculations and extrapolations from this text, instead of considering with more value the many descriptions of relics that exists from the 11th and 12th century and that NEVER make one single direct link between the Mandylion and a burial shroud ?  This is your liberty but, since you’re a professional historian (unlike me), I hope you will give me the right to question this choice !  \nAnd I could go on and on and on with more examples of specualtions and extrapolations but, for the moment, I will stop here.\nI will leave you with some FACTS and not with some extrapolations :\n1- There’s absolutely NO surviving copy of the Mandylion that show the cloth as any kind of a burial cloth.  In fact, the cloth is always a small towel (often much more long than high) showing only the face of a living Jesus without any injuries or blood stains.\n2- There’s 8 different ancient manuscripts (one of them, written by St John Damascus, a doctor of the Church, had been written well before the arrival of the Mandylion in Constantinople) that make a clear distinction between a burial shroud of Christ (or burial cloths of Christ in the plural) and the Mandylion (2 of them make also a distinction with the Keramion).  Among those texts, the vast majority have been written by eyewitnesses and have not a legendary style, on the contrary to the vast majority of the so-called “evidences” bring on by Wilson.  Not making a distinction between a legendary text and an eyewitness account is unworthy of any good historic research and/or conclusion.  Sad to say but that’s exactly how Wilson and his followers (M. Scavone being one of them) are acting and it’s pretty pathetic to see…  And the most important thing to note about those eyewitness accounts is this :  For those eyewitnesses, it was EVIDENT that the Mandylion had absolutely nothing to do with any kind of burial cloth or a relic of the Passion of Christ !  They never make any kind of link in that direction when they talk about the Mandylion !!!  Here, I want to quote a crucial part of the Synaxarion.  This is an official liturgical book that was used by the Byzantine Church (that was pretty much like the Catholic martyrdom).  The particular version I’m about to quote dates from the 11th or 12th century, while the Mandylion was in Constantinople since a long time.  This was a time when, according to Wilson and M. Scavone, many people from the Byzantine Clergy should have known that the Mandylion was really a burial Shroud of Christ and not just a face cloth.  If this context is correct, then can you explain me why we read this in the introduction of the text where it talks about the legend of Abgar :  “In life, you wiped your form onto a linen cloth. In death, you were placed in the final linen shroud. A manmade tile bears your form, not made by human hands, my Christ, creator of all.”  Here, you don’t have to use much speculations to understand that the book make a very clear distinction between the Mandylion (image made during Christ’s life), the Shroud of Christ and the Keramion (which was a tile that beared the same image of only the face of Christ than we could have seen on the Mandylion).  I would like to see how M. Scavone can do some kind of a magic trick here in order to save the hypothesis of Ian Wilson !!!\n3- There’s a bunch of well-respected researchers and historians that doesn’t agree one second with Wilson’s hypothesis.  On this field, I’m not alone to say the least.  Here’s a list of researchers that didn’t agree with Wilson’s point of view :  Emmanuel Poulle, Antoine Legrand, Pierre Barbet, Paul Vignon, Paul Riant, Alain Desreumaux, André Grabar, César Barta, Joseph Tixeront, Ernst Von Dobschütz, Steven Runciman, H.J.W. Drijvers, Averil Cameron, Paul Hetherington, Gerhard Wolf, Edward A. Wuenschel et Anthony Green Sr. (the father of Maurus Green).  So, anyone can easily see that we are very far from having a concensus on this question !  And I want to point out the fact that many of those researchers are (or were) defenders of the Paris hypothesis, just like me.  I’m not alone in this case !  And, in fact, outside the pro-Shroud clique, I’ve never seen one single historian that really support Wilson’s hypothesis !  And if I’m wrong here, then just show me some names !\n4- Historically, the most probable period of time that the Mandylion came out in Edessa is the second part of the sixth century (and not 544, like it is so often reported).  There’s absolutely no real historic record of his arrival in this city (you can forget the Abgar legend if you seek historical truth since it is evident that the Mandylion was a later addition to the legend).  In this particular context, the probability that this cloth was a false relic (directly or inderectly based on the Shroud image) is very good.\nI will conclude this long reply by saying that I understand why M. Scavone is mad at me because of what I said about him and his article, but I don’t care.  I would say the same things again and again because I’m convinced that his judgement on this topic is full of bias in favor of Wilson’s ideas.  Here’s a personal message to M. Scavone :  When you go on the public place and say bad speculative arguments in order to defend Wilson’s ideas, I just hope you are prepared to receive some critics from the crowd !!!!  When someone read your article with some critical sense, sorry but this is as obvious as the nose in anyone’s face that your judgement on this topic is completely biased.  I didn’t had the feeling that you were seeking truth in this article, but on the contrary, I had the feeling that you just wanted to defend Wilson’s hypothesis at all cost.  In comparison, M. Mark Guscin’s book on the same topic is much more prudent than you regarding the possibility that this image of Edessa could really have been the Shroud…  \nI don’t have a book to sell.  I don’t do any conference on the Shroud.  I don’t have any “prestige”.  In other words, on the contrary to the majority of the well-known “shroudies”, I have nothing to lose !  I just seek the truth.  And the truth is this : There’s absolutely no ancient text that make a CLEAR AND DIRECT LINK between the Mandylion and a burial Shroud of Christ.  Period.  And, on the contrary, there’s a bunch of ancient texts that make a clear and direct distinction between a shroud of Christ and the Mandylion and all those text NEVER put the Mandylion among the relics of the Passion of Christ !!!  Sorry, but this is the reality.  Pretend otherwise is to use bias and making very bad history.  Here, I would be mad at me if I forget to talk about one more aspect of M. Scavone’s paper.  First, let’s remember that the “Narratio” that we talked earlier was written by Constantine VII.  Then in 958, 14 years after the arrival of the Mandylion in Constantinople, the same Constantine wrote a letter to his troops in which he make an exhaustive list of the relics of the Passion of Christ that were already present in Constantinople.  In this list, the emperor mentionned the wood of the cross, the titulus of the cross, the lance, the reed, the blood of Christ, the tunic, the sacred linens (probably the other linen cloth associated with the Shroud of Christ that are present in many list of relics from the 11th and 12th century) and finally, Constantine mention “the shroud that bear God”.   And what is absolutely incredible is the fact that, in his analysis of this letter, it seems that M. Scavone want us to believe that the emperor did a real reference to the Mandylion!  INCREDIBLE !!!!  How in the world can someone see any mention of the Mandylion in that list ????  That’s what I mean when I talk about this article being full of bias in favor of Wilson’s hypothesis !  PRETTY PATHETIC !  In fact, if you analyse this list carefully, it’s pretty much the same list than the one written by Robert de Clari, some 250 years later !!!  There’s a very good probability that those relics are the same and what is the most important thing to note is this :  whether the letter of Constantine or the list of relics compiled by Robert de Clari, in both cases, the authors have not the slightest hint that the Mandylion could be associated with a relic of the Passion and, in the particular case of de Clari, he made a clear distinction between the Shroud of Christ (that was, in 1203 and 1204, in the Blachernes church) and both the Mandylion and the Keramion (that were conserved in the Pharos chapel).\nYannick “I’m not a member of the Shroud clique and I’m glad I’m not” Clément :-)\nP.S. 1 :  I don’t have a master degree in history but I can use my brain and my logical sense nevertheless !!!\nP.S. 2 :  Even if Maurus Green could have been blinded by Wilson (because of his friendship with him), what he wrote about Wilson’s hypothesis in 1969 is still true since Wilson had never been able to show us one real solid FACT (I’m not talking about a poor speculative argument like the tetradiplon here) that can make A CLEAR AND DIRECT LINK BETWEEN THE MANDYLION AND A BURIAL SHROUD OF CHRIST.  Sorry, I’ve looked everywhere (that include your article) and I never found one single proof (in the real sense of what a proof is supposed to be).  As I said, on the contrary, I’ve found plenty of ancient texts that makes precisely the opposite, i.e. a clear separation between the Shroud of Christ and the Mandylion (in fact, no ancient text make even one direct link between the Mandylion and a relic of the Passion of Christ).  Here’s the conclusion of Green again :  “Until Wilson can PROVE his case, it seems PRUDENT to think of the Edessan Image and the Shroud as TWO DISTINCT THINGS, while noting the close connection between them.”  Sorry, but since 1969, Wilson HAS NOT BEEN ABLE TO PROVE HIS CASE !!!  I SAID PROVE HIS CASE, NOT DEFEND HIS CASE.  There’s a BIG difference between the two.  And until Wilson can really prove his case, the professional way to see the hypothesis of Wilson is to see the Edessan Image and the Shroud as two distinct things, like Green said.\n\n","date":"March 25, 2012 at 7:43 pm","url":"https://shroudstory.com/2012/03/25/a-response-by-dan-scavone-to-a-commenter-in-this-blog/","cat":"history","id":"comment-9644","author":"Yannick Clément","site":"shroudstory"},{"title":"A Response by Dan Scavone to a Commenter in this Blog","post":"I’ve note one incomplete phrase.  Sorry.  Here’s the complete phrase : “There’s no way to be sure because of the nature of the text (which is clearly legendary).”\n\n","date":"March 25, 2012 at 7:57 pm","url":"https://shroudstory.com/2012/03/25/a-response-by-dan-scavone-to-a-commenter-in-this-blog/","cat":"history","id":"comment-9645","author":"Yannick Clément","site":"shroudstory"}]
