[{"title":"History vs. Science:  The Freeman Beat Goes On","post":"“Had the order been reversed, the painting hypothesis — suggested by history — could have been specifically tested.”\nHad you done your homework you would’ve known that the painting Hypothesis was specifically tested during STURP expedition. Why are people so ignorant?\n\n","date":"November 1, 2014 at 12:05 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167660","author":"Mike M","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Having read manuals such as the fifteenth century Cennino Cennini’s on preparing linen for painting and learning that you seal the cloth on the outer fibrils only with a knife, a highly skilled operation and then reading the STURP report that the images on the Shroud were on the outer fibrils only, I knew I had my evidence for painting. STURP did not have any expert on medieval painting on their team nor did they consult any so one can hardly take their report seriously. However, my main evidence for painting comes from the early descriptions an depictions of the Shroud- it may be that the endless handling and exposing of the Shroud ended up with all or almost all of the pigments falling off leaving only the faded images we have today.\nThe ignorance comes from those who have not studied how linen was painted on in the medieval period.\n\n","date":"November 1, 2014 at 1:50 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167694","author":"Charles Freeman","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"“I knew I had my evidence for painting.”\nYou  may recall, Charles, that some 2 years ago, nearer 3, I offered you my services as a co-writer, handling the scientific side, which you were probably wise to decline at the time.\nMethinks in retrospect, with the wisdom of hindsight, you should maybe have taken up the offer.\nThe notion that the TS image was painted is frankly a non-starter, on a whole number of grounds. \nIts exquisite response to 3D-enhancement is just one of them.\n\n","date":"November 1, 2014 at 2:24 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167706","author":"Colin Berry","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Thank you Colin. It’s good to have a “Non-authenticist” put to bed Freeman’s silly ideas. The man, in all his arrogance, is unlikely to listen, though.\n\n","date":"November 1, 2014 at 9:14 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167778","author":"Thomas","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"If it was created in the 13 hundreds I think a painting would be a best fit, but I have a lot of problems with this. \nOK, the paint falls off, and I may buy that it lease an outline, but how in the world could it leave a detailed image? If the paint falls off it would take any paint that was used to paint the details with it, assume the base somehow stayed. I don’t get it.\nAnyway have you tested this idea? Are you a painter? If you are you could paint a detailed image, age it and flex it for the paint to fall off and see what you get.\n\n","date":"November 1, 2014 at 3:57 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167724","author":"John Green","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"“Are you a painter”.. offcourse not\nhere is what a real painter thinks about the shroud\nhttp://www.shroud.com/piczek.htm\n\n","date":"November 1, 2014 at 4:39 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167733","author":"Mike M","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"“FOR A CONTINUOUS IMAGE TO EXIST ON A PAINTING, WHILE THE PAINT MEDIUM HAS RETURNED TO DUST OR JUST TINY GLOMERATES, LEAVING THE MILIMICRON PIGMENT PARTICLES WITHOUT TIGHT ADHESION TO THE GROUND OR TO THE SUPPORT WOULD BE TOTALLY AGAINST THE LAWS OF NATURE, SCIENTIFICALLY INACCEPTABLE AND A TECHNICAL IMPOSSIBILITY REGARDING THE PRACTICE OF ART. This would be harder to explain than the Turin Shroud itself.”(Isabel Piczek,\nupper caps in original document)\n\n","date":"November 1, 2014 at 11:05 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167797","author":"Mike M","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"MikeM – The problem is Freeman is putting forward himself almost as a Shroud authority when many on this website know all these things, having read widely and deeply on the topic for several years.\n\n","date":"November 2, 2014 at 2:04 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167828","author":"Thomas","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Piczek claims “The professional arts cannot find any such discrepancies and distortions in the anatomy of the Shroud Man”. This is plainly wrong. The image on the shroud is a common ‘gothic/byzantine’ art style with the limbs and head elongated. The head is particularly peculiar. This picture compares the shroud head with a head of more normal proportions (it’s an image used as an artist’s guide).\n\nThere is something very, very wrong. The eyes are too high and the skull is too narrow. Getting these basics wrong (deliberately or inadvertently) was common in pre-renaissance art. Bear in mind that almost all of the brain must fit in the region of the skull above the eyes.\nThere simply isn’t enough room for a human brain that is within normal limits..\n\n","date":"November 2, 2014 at 8:39 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167996","author":"aljones909","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Aljones,\nYou should consider that the cloth was draped over a real 3D face with tenting around the nose that would make it appear longer. As Ray Downing said in his award winning documentary “The Real Face of Jesus”..\n“What you see on the shroud is not a picture of a face, it’s a database of information”\nStart at 1:19:00\nhttps://m.youtube.com/watch?v=WNJPJ4JwHeE\nBesides, I don’t really see a big differences when compared to a real human face\n\nOn a separate note, the shroud anatomical proportions are consistent with a human figure, even to the extent of the chest muscles being raised as in a person who died with his hands raised above his head.\nSee\nhttps://shroudstory.com/2014/02/10/anatomical-accuracy-chart/\nNo wonder the agnostic professor of Comparative anatomy, Yves Delage, declared the Shroud “anatomically flawless”\n\n","date":"November 2, 2014 at 11:57 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168058","author":"Mike M","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Also,\nIf you really want to see the anatomical proportions of Medival art (even when copying from an anatomically accurate image) see the Tibio-femoral index in page 14 of this paper\nhttp://www.shroud.com/pdfs/marineli.pdf\n\n","date":"November 3, 2014 at 12:07 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168062","author":"Mike M","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Mike M. I think your picture shows the problem almost as much as mine. The important consideration is the amount of cranial capacity above the eye line. This is the space where the bulk of the brain HAS to fit. Other facial features can vary but any normal human must have the space to fit a brain. I’ve taken your image and aligned the mid point of the eyes. The problem is now more obvious.","date":"November 3, 2014 at 8:33 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168203","author":"aljones909","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Further on the dimensions of the shroud head image. It’s simple to show it’s a deliberate fabrication with an obvious mistake ‘encoded’ in the image.\nTake a tape, or a piece of string, and hold it between your eyes, level with your pupils, then take the tape over the top of your head to the corresponding point at the back of your skull. i.e. the string measures from your eye line at the front, over the top of your head, to the corresponding ‘eye line’ at the back. I’m reasonably normal and get a length of 35.5 cm.\nThe corresponding mesurement on the shroud is around 20cm.\nThis is a totally impossible result if a continuous cloth covered the front and back of the head. It must be an artifice. See http://tinyurl.com/nkn8naf if you want to verify the shroud measurement\n\n","date":"November 6, 2014 at 5:53 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-169163","author":"aljones909","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"A neat clear exposition but…\nWhile the level of the pupil is easily recognisable on both Shroud and ones own face, the place you mark as B is not. If I measure 35cm from my own eye over the top of my head, 35cm reaches the bony prominence at the turn of the skull called the inion. A well defined point on my skull. But I am not at all sure why you think the inion of the Shroud man is only 20cm away from his pupil level. If it were, then the distance between the inion and the blood drops at the back of the head is also about 20cm. On my head, 20cm from the inion is well between the shoulderblades.\nIt is a very imprecise science, this body measuring lark, but I do not think you have demonstrated that the two ‘heads’ on the shroud are too close together at all.\n\n","date":"November 6, 2014 at 5:24 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-169171","author":"Hugh Farey","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Would you believe me if I told you that I had a vision of Christ and his mother Mary both immersed in white light  similar to the white light described in the account given by :\n(Matthew 17 The Transfiguration )\n…After six days Jesus took with him Peter, James and John the brother of James, and led them up a high mountain by themselves. There he was transfigured before them. His face shone like the sun, and his clothes became as white as the light….) \nNo I’m not lying – This happened in 1981 when I was 19 years of age working as a construction winch operator in Florida. I’m not a scientist nor am I a historian and obviously am not an apostle of Jesus. All I can say is that  I literally saw each totally immersed in white light – first Jesus and immediately thereafter Mary his mother. No words were exchanged just a vision.  The whole experience lasted less than 1 minute. Immediately thereafter I felt warmth and joy – an indescribable  kind of joy.  All I desired at that specific moment was to help others.   \n I recently began studying the shroud and have come to the conclusion  that the same light in the bible account and the light I saw with my own eyes emanating from Jesus and Mary’s  silhouette  is the light that radiated from Jesus’s body  and left his image on the shroud during his resurrection. Don’t ask me what is that divine light composed of  – all I know the light I saw was white and extremely bright like the sun. I wish you could experience it for your self/s – then you would understand.\nFurthermore – Jesus’  transfiguration in white light appearing to  Peter James and John holds a deeper meaning than just a mere vision. The mystery involves the Past, Present and Future. Jesus was in fact revealing to his apostles what his body was going to look like and more importantly represent  after resurrection ( totally glorified ) the past had to do with Moses and Elijah talking amongst themselves ( The Law )   and the present was non other than what the disciples were witnessing at that distinct moment. \nThe transfiguration/miracle involved the suspension of the laws of time. Literally past – present and future were happening all at once!\nSome days pass after this mysterious event and Jesus is crucified by the romans.  On the third ( 3rd ) day after the crucifixion  Jesus’ resurrection takes place just as he had promised. But here is the important point that links the white light to the shroud – When visiting the tomb on the third day John 20:4-8 says .. John saw and believed ……  What did he see you ask me?   ANSWER: He approached the linen shroud and saw it gleaming with white light just as he had seen it days before during MATHEW 17. account.  John’s jaw probably dropped as his mind wandered back when he witnessed Jesus’ clothes radiating bright light.\nI hope this makes sense to all of you scholars and laymen. I hope I have not offended  anyone as all Im trying to do is to tell my story as it happened and make some sense of the mystery of the image of the shroud.  \nAll be well.\n\n","date":"November 3, 2014 at 1:08 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168083","author":"Solomon Golden","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"“STURP did not have any expert on medieval painting on their team nor did they consult any so one can hardly take their report seriously”\nIf STURP work cannot be taken seriously because they didn’t have an expert on medieval painting then your work cannot be taken seriously because it was not co-written by a scientist. Colin is right, you should’ve taken his advise. I won’t go on educating you on what STURP did, you can try to put aside your bias and read it again yourself.\n\n","date":"November 1, 2014 at 3:44 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167722","author":"Mike M","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"MikeM you can be assured that Freeman won’t do the necessary reading and research, he has proven time and time again that he consistently ignores other valid and often stronger viewpoints.\nTime will tell whether we hear from his expert mates. They better do their homework, or their positions will be torn apart, as many of his have legitimately been here.\n\n","date":"November 2, 2014 at 2:08 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167829","author":"Thomas","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"“he has proven time and time again that he consistently ignores other valid and often stronger viewpoints”\nThomas, I completely agree, this thread clearly demonstrates that claim.\n\n","date":"November 2, 2014 at 3:01 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167939","author":"Mike M","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Colin: Its exquisite response to 3D-enhancement is just one of them.\nGood on you Colin. Why Historian did not consider this fact.\n\n","date":"November 1, 2014 at 4:43 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167735","author":"Sampath Fernando","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"I think all of you just need to read the articles before you comment on them. How do you explain the all-over flagellation marks on the Shroud when we know that they first appear in medieval iconography of other paintings only in 1300? How do you explain the fact that the ‘bloodstains’ on the Shroud have an almost identical pattern to the Holkham Bible of 1330.  An artist was copying them from similar works of art of his time. You also need to look at the examples of tHe faded cloths that I provided in my article to show that painted linens can fade as the Shroud has. Provide an alternative explanation of how a fourteenth century iconography was created by a first century body.\n\n","date":"November 1, 2014 at 7:13 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167762","author":"Charles Freeman","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Good evening Charles. I look forward to reading your article. But unless it’s a treatise in science as well as history, I  for one see no need to suspend judgement on matters to do with the image, certainly not your claim that it’s a painting of its time.\nCould not the ‘over-flagellation’ be explained in a non-authenticity model simply by supposing that the body image was so indistinct from a early stage that liberal addition of scourge marks was needed to give it “body”?\nBeyond that one doesn’t need to be pro-authenticity to feel there is something exceptionally unusual about the TS image that frankly sets it apart from all others. Dismissing it as ‘just a painting’ is to close one’s eyes to a century or more of accumulated evidence that the image is unique, and could not possibly have been produced free-hand. \nThe Italian artist Irene Corgiat once produced a tolerable look-alike with her electric pyro-tool, but does it pass the 3D test? She didn’t say, but anyone can upload it into ImageJ as I once did, and the result is sure to leave one underwhelmed.\nI’m not saying that none of the peculiar TS image characteristics are non-reproducible. Some of the ghostly character of the Secondo Pia ‘negative’ plate is the result of light/dark reversal (as can be seen by tone-inversion of a charcoal sketch). But the 3D response is at best nominal  probably because it’s simply not possible to achieve the same mathematically-precise gradation of tone and image intensity.\n\n","date":"November 1, 2014 at 7:46 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167766","author":"Colin Berry","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Q. How do you explain the all-over flagellation marks on the Shroud when we know that they first appear in medieval iconography of other paintings only in 1300? \nA. If the Shroud was authentic – an option you seem to rule out – then that would explain the flagellation marks.\nAn alternative options is the image was created by bas relief and the marks were stamped on. This would be consistent with a 14th century iconography.\nQ. How do you explain the fact that the ‘bloodstains’ on the Shroud have an almost identical pattern to the Holkham Bible of 1330. \nA. Really? They are generically similar but this means very little. \nQ. An artist was copying them from similar works of art of his time. You also need to look at the examples of tHe faded cloths that I provided in my article to show that painted linens can fade as the Shroud has. Provide an alternative explanation of how a fourteenth century iconography was created by a first century body.\nA. That the Shroud is actually Christ’s authentic burial cloth! Or the Shroud was created in the 14th century via bas relief etc. Although I believe in authenticity I am not so close minded as to acknowledge a possible 14th century origin via some form of bas-relief approach. But the painting hypothesis is fatally flawed for several reasons.\n\n","date":"November 1, 2014 at 9:31 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167785","author":"Thomas","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"I believe that the earliest known art work showing Shroud-like flagellation marks is likely the illustration in the Carolingian Stuttgart Psalter 800-814 AD, showing a naked dorsal view, two executioners using flagra tipped with pellets, Christ bound to post with arms crossed over groin as on Shroud, notwithstanding flagellation was normally done with hands bound above head.  E.g: There are no flagellation marks on the arms of the Shroud image.  There was known contact between courts of Charlemagne and Constantinople.\n\n","date":"November 1, 2014 at 10:35 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167791","author":"daveb of wellington nz","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Still no evidence that my article has yet been read, Dan even posted up the wrong article altogether, find time Colin! . No point in discussing further unless it is discussion of what I have actually written. The art historian Bendor Grosvenor is certainly  happy with it and this is where I am circulating it- among the experts who may or may not agree with me- give it a year to get round and we will see.\n\n","date":"November 2, 2014 at 3:22 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167842","author":"Charles Freeman","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"I have posted the link a few times.  It is The Origins of the Shroud of Turin.  (http://tinyurl.com/mlgfq8e )\n\n","date":"November 2, 2014 at 4:31 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167852","author":"Dan","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Thanks for the publicity, Dan. It does not mean, of course, than anyone actually reads my article but every posting of yours helps it get around to people who  may not have seen it.\n\n","date":"November 2, 2014 at 4:44 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167857","author":"Charles Freeman","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Pilate’s executioners were artists! They managed to make more than one hundred marks of the almost the same size and hardlyever intersected. Furthermore, without a single tear of the skin. With a flagrum!\nI insist: what a great artists they were.\n\n","date":"November 2, 2014 at 3:34 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167843","author":"David Mo","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Quite right, David, but one need to look for an ancient artist. There is no ancient record of a flagellation that covered the whole body.and, as you note,  it would have been a much messier business than what is seen in the neat crisscross sing on the Shroud.  It was only, as the art historian James Marrow argues, that inspired by Isaiah 1. 6 , which they took to be a premonition of what Christ would suffer, did they begin to depict the flagellation as covering the whole body. Marrow dates the change to 1300- there is another possible example in the Church of San Domenico in Orvieto that another scholar has dated to 1290. By 1330 it is part of conventional iconography of the flagellation and the Shroud is right in there as typical of the iconography of that period.\n\n","date":"November 2, 2014 at 4:37 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167854","author":"Charles Freeman","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Pilate’s executioners were artists! They managed to make more than one hundred marks of the almost the same size and hardlyever intersected. Furthermore, without a single tear of the skin. With a flagrum!\nI insist: what a great artists they were.\nThe skin of adult man covers approximately 1.5-2 m^2 area, that is about 15 000 -20 000 cm^2. The area covered by flagrum marks is ~ 2 cm^2. So even with a hundred, or a couple hundreds wounds, the total area they cover is maybe 1 % of the total skin area.\n\n","date":"November 2, 2014 at 5:50 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167871","author":"O.K.","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Barbara Faccini’s interesting analysis of the scourging marks ( available on Shroud.com) stresses how three different instruments were used. If there had indeed been three different instruments they would not have been as distinct from each other as Faccini suggests- they would have merged into each other – but Faccini is able even to distinguish them from each other so easily as to list the percentage of each.  This suggest an artist placing them deliberately as a pattern and, as I suggest in my article, this echoes Marrow’s point that three different Old Testament sources were used to provide different instruments that the artist felt that he had to reproduce.\nIs anyone really saying that a cruel Roman flagellation would really have ended up with the neat crisscrossing we see on the Shroud today?\n\n","date":"November 2, 2014 at 6:23 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167876","author":"Charles Freeman","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"“Faccini is able even to distinguish them from each other so easily”\nFalse,\nAgain.\nHere is what Faccini wrote in her own paper, if you have really read it.\n“Image processing and contrast enhancement of the 2000 Gian Durante photos allowed distinction of three different types of scourge marks.”\n“they would have merged into each other”\nThey did.. Read the paper\n“Not all scourge marks are well featured, they are faint and OFTEN OVERLAPPING and have a colour so similar to that of the body imprint, that it is very DIFFICULT to achieve an OBJECTIVE DISCRIMINATION between scourging traces and what can be considered as “blank” noise”(emphasis mine this time because, as Thomas indicated, no one is listening  on the other side)\nSee\nhttp://www.ohioshroudconference.com/papers/p19.pdf\n\n","date":"November 2, 2014 at 9:50 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167900","author":"Mike M","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Wait, MikeM…. you’re asking Freeman to actually READ the evidence?  You cad…\nThe guy is an embarrassment….even CB reprimands him….\n\n","date":"November 2, 2014 at 10:13 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167905","author":"Nabber","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Of course they are faint! They were painted seven hundred years ago so they do need imaging to make the distinctions between them which were much clearer when they were painted. Remember  that,despite the fading,  Faccini did get so far as being able to give percentages to each of the three instruments but she shows no sign of knowing about the Old Testament texts that inspired each of the three,\nOf, course , there is some overlapping but if you google Faccini ‘s article  that she wrote with Fanti and look at the images of the scourge marks you can see that they cannot be the result of an actual flagrum tearing into flesh. Any Roman flagellation would have torn deeply  into parts of the body, not left superficial marks as we see here. The overall patterning fits with the iconography of the fourteenth century for reasons I have given in my article.\nOriginally I would never have mentioned my article on this site as my target is professionals in the fields I deal with but,  taking in mind that all publicity is good publicity, I am grateful to Dan by continuing making posts about it.\n\n","date":"November 2, 2014 at 1:18 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167925","author":"Charles Freeman","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"“if you google Faccini ‘s article that she wrote with Fanti and look at the images of the scourge marks you can see that they cannot be the result of an actual flagrum tearing into flesh”\nI can’t take your claim seriously because you are not a forensic specialist and you haven’t consulted one.\n“all publicity is good publicity”\nCompletely agree, which is why I think your article will ultimately increase interest in the shroud. Those who already reject the shroud will be further mislead, while those who are willing to look further and do their own research will find out the absurdity of the painting hypothesis.\n\n","date":"November 2, 2014 at 2:57 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167938","author":"Mike M","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Google Fanti and Faccini’s paper. Look at the illustration of 372 flagellation marks, note that not a single one of them seems to break the skin. As evidence of an actual physical flagellation this could not be possible, a few of the blows must have broken the skin, especially when the flagrum was designed to torture rather than just be a rod for beating.\nAs evidence of a painted surface, no problem the artist simply daubed on the marks, inspired probably by the Old Testament texts that suggested the three different types of instruments that Faccini was able to distinguish (see my article).\nNow you have a choice, the marks of a real flagellation or a painted flagellation. I just happen to think a real flagellation is so improbable on the evidence on the Shroud that I go for a flagellation that has been painted on.  When, as here, the flagellation covers the whole body back and front, I side with the art  historian and expert on Passion iconography James Marrow who says this is a development of the fourteenth century.\nI will happily consider any alternative ways of producing the scourge marks that are offered by the ‘experts’ on this blog.\nIn so far as some of these postings appear on the web in a Google search, I have little alternative but to put my case as strongly as possible in the hope that, even if not for readers here, others will access the November issue of History Today, even if they only access the text version freely available which lacks the crucial illustrations of the print version ( that show how typical the flow of blood is of other fourteenth century depictions of the body of Christ). So I am happy for Dan to keep the story going with new postings!\n\n","date":"November 2, 2014 at 3:51 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167949","author":"Charles Freeman","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Sorry Charles, you are not an authority on this subject, I can’t take your work seriously.\nI advise any interested reader to look further into the works of \n-Dr. Piere Barbet ( chief surgeon at Saint Joseph’s Hospital in Paris.)\nhttp://en.m.wikipedia.org/wiki/Pierre_Barbet_(physician)\n-Dr. Robert bucklin (M.D., J.D. Las Vegas, Nevada)\nhttps://www.shroud.com/bucklin.htm\n-Dr. Frederick T. Zugibe (M.D., Ph.D.Adjunct Associate Professor of Pathology, Columbia University, College of Physicians & Surgeons, N.Y. Chief Medical Examiner, Rockland County, N.Y.)\nhttps://www.shroud.com/zugibe2.htm\n-Dr. Gilbert R.Lavoie (M.D.)\nhttp://shroudofjesus.com/page8.html\n-Dr. William D. Edwards M.D. et al.\nhttp://www.godonthe.net/evidence/on-the-physical-death-of-jesus-JAMA.pdf\n-Dr. Pierluigi Baima Bollone, (a professor of forensic medicine in Turin)\nhttps://shroudofturin.files.wordpress.com/2013/12/bbk-7.pdf\nDr. Niels Svensson (M.D.)\nhttp://www.catholic.com/profiles/dr-niels-svensson\nGod Bless,\n\n","date":"November 2, 2014 at 4:59 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167958","author":"Mike M","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"The dumb-bell shaped pellets that one sees in illustrations of the Roman flagrum are said to have caused the welts seen on the image. They are said to be very clear in close-ups in David Crute’s high-definition filming of the Shroud.\nThe whip is very different from what we see in Mel Gibson’s film.\n\n","date":"November 2, 2014 at 5:01 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167959","author":"Louis","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Mr Freeman –please read these links – and once in for all convince yourself.  By the way thank MR Mike M for them. \nNovember 2, 2014 at 4:59 pm\nSorry Charles, you are not an authority on this subject, I can’t take your work seriously.\nI advise any interested reader to look further into the works of\n-Dr. Piere Barbet ( chief surgeon at Saint Joseph’s Hospital in Paris.)\nhttp://en.m.wikipedia.org/wiki/Pierre_Barbet_(physician)\n-Dr. Robert bucklin (M.D., J.D. Las Vegas, Nevada)\nhttps://www.shroud.com/bucklin.htm\n-Dr. Frederick T. Zugibe (M.D., Ph.D.Adjunct Associate Professor of Pathology, Columbia University, College of Physicians & Surgeons, N.Y. Chief Medical Examiner, Rockland County, N.Y.)\nhttps://www.shroud.com/zugibe2.htm\n-Dr. Gilbert R.Lavoie (M.D.)\nhttp://shroudofjesus.com/page8.html\n-Dr. William D. Edwards M.D. et al.\nhttp://www.godonthe.net/evidence/on-the-physical-death-of-jesus-JAMA.pdf\n-Dr. Pierluigi Baima Bollone, (a professor of forensic medicine in Turin)\nhttps://shroudofturin.files.wordpress.com/2013/12/bbk-7.pdf\nDr. Niels Svensson (M.D.)\nhttp://www.catholic.com/profiles/dr-niels-svensson\nGod Bless,\n\n","date":"November 2, 2014 at 11:18 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168040","author":"Solomon Golden","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"It is good for us to have both a professional historian and a professional scientist to act as “devil’s advocates” when it comes to the Shroud. We must remember that even RD served as one when called by the Vatican and Pope John Paul II invited his atheist friend Sandro Pertini to go skiing with him at least once.\nIf anyone picks up a stone to throw at me I will ask, “Are you a Christian? Prove it to me.” No one will be led to faith in Christ in the minefield that is the realm of Shroud studies. Converts to the Christian faith have come into the fold for other reasons, many of them not even having heard about the Turin Shroud.\nGiven what has transpired, maybe the historian should start with the scientist’s hypothesis, beginning at the stake to which Jacques de Molay was led. That will lead to a very interesting discussion.\n\n","date":"November 2, 2014 at 10:38 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167907","author":"Louis","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Mike M’s refs, particularly to Barbet, gives the lie to Charles’ assertion that the scourging did not break the skin.  It was Barbet’s assertion that only the welts from the flagra that broke the skin left a mark, and that contusions (= bruises) did not.  The Fanti and Faccini paper extended this to other punishment including lictor type fasces, possibly on the journey to execution, which probably only resulted in bruising.  I am coming to the opinion that the Freeman paper is utterly bereft of any useful scientific corroboration, whether STURP or any other studies.  This has to be a major criticism of the value of the paper.\n\n","date":"November 2, 2014 at 6:58 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-167981","author":"daveb of wellington nz","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"When an argument is put is a nonsense to invoke supportive literature by confessional adepts. Barbet, Zugibe, Fanti et al. are not experts in history of medicine and their main sources are the gospels. I had worked in a Human Rights NGO for fifteen years. I had to see some photographs of victims of the punishment flagellation and not one had the least similarity of the scourge marks of the Shroud. They were much more destructive although I never saw more of twenty or thirty marks together. The flagrum as described by contemporary testimonies was an awful weapon. Its blows tore the skin and the flesh till reaching the bones. Furthermore, the image of an executioner carefully selecting his blows in order to do a regular design is simply ridiculous.\n\n","date":"November 3, 2014 at 3:55 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168131","author":"David Mo","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Yes, David is right. This is a symbolic representation of a flagellation that is designed to fit in with the Old Testament texts that became an inspiration to theologians and then artists in the late thirteenth and early fourteenth centuries- see my article for the relevant texts. Lots of supporting evidence – see the Holkham Bible flagellations of c.1330 and the Roettgen Pieta also fourteenth century. They are easily available online.\nThis is the world of the top art historians such as James Marrow (whose work put me in the right directIon) and p it is with them that the future of my article lies as they are in a position to confirm or deny it and have the authority  to do so. If contributors to this site really want to challenge me they need to get their evidence together and submit it to one of those journals where it will be taken seriously.\n\n","date":"November 3, 2014 at 4:09 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168136","author":"Charles Freeman","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Can you be absolutely clear about one thing, please Charles, namely the chemical composition of the artists’ pigments allegedly used for:\n(a) the body image \nb) the blood (or “blood”)?\nWould you say your views are the same or different from those of Walter McCrone’s?\nIf as I suspect you agree with McCrone that the body image is red ochre (a type of iron oxide, Fe2O3) then how do you account for Adler and Heller’s observation that it is bleached by diimide? The latter bleaches organic compounds by hydrogenating chemical double bonds.There is no obvious way that it could bleach an iron oxide.\nWould you agree that the question of “blood”, real or simulated, is far too problematical to be dealt with in a historical treatise? Yet so much hangs on the detailed chemistry as well chronology and art history if wishing to dismiss the TS image as merely “paint” of one kind or another.\n\n","date":"November 3, 2014 at 5:24 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168152","author":"Colin Berry","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Colin,Have you read my article yet? \nWhat we do have is fifteenth and sixteenth century descriptions of the blood images that show that they were much more vivid than they are now, enough to really shock the observer.  We have a description of 1449 by a Benedictine monk to say that they were painted. I quote them in my article for those (?Thomas) who would like to know what they say.\nThe shock effect of the blood images  is typical of the blood cults of the fourteenth century. What is really important is to compare the patterns of blood flow on the Shroud( see the Shroudscope depictions) with those,say, on the Holkham Bible of 1330 and you will see that they are virtually identical. The illustrations in the print version of the History Today article make the point perfectly. You will also find other similar blood flows in the Roettgen Pieta and Man of Sorrows depictions of the fourteenth century. The Shroud is spot on ,so much so, that i wonder whether there was not some kind of template the artist worked from.\nThe Tempesta engraving (1613) shows that the Crown of Thorns was on the Shroud, now vanished but as the Crown is also mentioned in independent fifteenth century descriptions of the Shroud  we have confirmation that it was originally on the Shroud, and this again is typical of the fourteenth century where they show the Crown in place AFTER Christ has been taken down from the Cross..\n So read the descriptions in my article and explain what you think accounts for the very vivid ‘bloodstains’.  The number one explanation I have been given so far is paint, probably, if the vividness of the colour is taken into account, vermilion, but perhaps you have an alternative explanation, Colin?\nWhat remains on the Shroud today after so many centuries of expositions is anybody’s guess. There is circumstantial evidence that with the images being on the outer fibrils only and calcium carbonate  being found by STURP in ‘large’ quantities that this is the remnant of the gesso painted just as the medieval manuals such as the one by Cennino Cennini, advise. A professor of physiology who has read the STURP reports on the ‘blood’ has told me that what STURP thought were bloodstains are more likely  animal collagen, used to cement the calcium as a selant. But we will need an expert microscopic examination to see what the accidents of time have left of the original surface. I am not qualified to assess what McCrone found and other than quoting it in my article I leave it at that. My argument does not depend on what may or may not be left on the Shroud, it would be a matter of chance what has survived, but I shall certainly be interested in more up-to-date testing is ever done.\n\n","date":"November 3, 2014 at 6:23 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168170","author":"Charles Freeman","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"“So read the descriptions in my article and explain what you think accounts for the very vivid ‘bloodstains’. The number one explanation I have been given so far is paint, probably, if the vividness of the colour is taken into account, vermilion, but perhaps you have an alternative explanation, Colin?”\nYes, I’ve been through your article several times now Charles, and find it thought provoking and (in places) provocative too. That’s why I was interested to hear your opinion re the chemical nature of the body image and bloodstains if, as you suggest,  they were both applied freehand as artists’ pigments . (My own views on the nature of the body image and blood have been the subject of numerous postings, and are probably best kept to one side for now to avoid cluttering up the discourse).\nCan be confine ourselves first to the body image (blood being hugely more problematical)?\n The body image is bleached by a reducing agent (diimide), Susceptibility to one type of simple chemical invariably means it’s susceptible to others too, like oxygen in the air, maybe activated by light. (There are well known model chemical systems in which photooxidation results in  bleaching of dyes and other organic chomophores occurs due to self-sensitized production of singlet oxygen).\nSo while the original image may have been a lot easy to see at a distance than today’s TS, one has to consider a whole range of physical and chemical options and scenarios, instead of assuming it was simply paint that had flaked off. The latter would not explain why the resistant faint ‘signature’  has the physical and chemical properties of chemically-dehydrated linen carbohydrates, i.e essentially “scorch-like” (even if that term was not used  by STURP). Nor would it explain why a highly degraded image comes to have so spectacular a response to 3D-rendering software. Thousands of oil and water colour portraits must have flaked away over the centuries. How many have left a faint and intriguing quasi-photograph?\nOnce you take on board that the image we see today is the primary image, albeit now somewhat faded,  and reject any paint-flaking hypothesis that is unsupported by chemical evidence of trace contamination, then one is back where we started. Despite your historical analysis, the TS remains an unsolved scientific enigma – and that cannot be casually dismissed with  scientifically-flaky explanations that depend on even flakier paint.\n\n","date":"November 3, 2014 at 7:07 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168183","author":"Colin Berry","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Thanks, Colin, I look forward to hearing of the scientists who support your interpretation. \nI assume we are agreed that this is a fourteenth century creation of some sort. That is a good starting point. \nWhat we have to establish,is,  however the images were created in the first place, how the artist or creator managed to match the iconography of the fourteenth century, blood flows, all -over scourging, Crown of Thorns left in place, so  completely. If we have the Holkham Bible, there to see online and in the British Library, we have what is almost a  a template of the flagellation and blood flows seen on the Shroud. Would you suggest that the creator of the Shroud used a similar depiction as an inspiration?\nBut what I don’t understand is why, when painting on linen was very common – thousands of examples are recorded in monastic and church inventories, why your ‘artist’ would need to resort to such an arcane procedure as you suggest. Surely he would have stayed with the recommended procedure, apply gesso to the outer fibrils of the cloth and paint on top that may well have become detached from the Shroud as time passed.\nYou will see from my article two examples of faded linens very similar to the Shroud although we would have to look more closely at them to make sure. As you will see I have put out the call for conservationists who work with medieval linens to see if we can dig up some more comparative examples. The trouble is that most faded linens are not put on display  and the only reason why I know about the two I mention is that parts of the original images remain intact.\n\n","date":"November 3, 2014 at 8:56 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168210","author":"Charles Freeman","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Aren’t we making an assumption, Charles, namely that the image that is now in Turin was created in a single step – body and blood together – or as some might prefer to say blood (first) then body image. How do we now it happened like that. Who’s to say that a body image was not created first using hitherto unknown technology for a purpose of which we are totally ignorant and can only speculate. \nBeing body image only it would have been totally free of blood including scourge marks. So who’s to say who the image represented if there were no signs to indicate the cause of death (crucifixion included). Who’s to say the image was not later ‘re-invented’ so to speak, with applications of blood and scourge marks in all the biblically-correct places?\nThere’s an obvious objection to this, namely the blood-first/image second mantra. That finding, based on the Adler/Heller protease digestion on a microscope slide has always intrigued me. Is it a sound conclusion, or might it have arisen as the result of a hitherto unrecognized artefact? We biochemists always have to be on our guard against methodological artefacts, especially when there is lots of extraneous biological material in the system under study (1st clue – see below)\nOne hour ago, this discourse suddenly led to me to think of an explanation for why a mistaken blood-first conclusion could have arisen, based on the failure to see a yellow image after digesting off the blood.\nI feel another posting coming on, though it might take a little time to research and write. \nHere’s a second clue for the chemical cognoscenti: porphyrins have a well known ‘photodynamic action’ when illuminated, either with uv or long wave visible light, generating … singlet oxygen!\n\n","date":"November 3, 2014 at 9:28 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168218","author":"Colin Berry","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Glad you are still working on it,Colin.\nIt is a bit like the Pyramids. There are those who believe the pyramids were built in 12,000 BC, there are those who find the mass of evidence correlates to the middle of the third millennium BC and this has long since been accepted by academic scholarship.The latter still have lots to argue about, there has only recently been a detailed survey of the whole Gizeh plateau that has brought up lots of new evidence, and there is still, as I repeatedly say in My article, so much of the basic research on the Shroud that has not yet started. We need a proper data base of all the depictions of the Shroud from expositions for a start – it amazes me that this has never been done. There is some evidence even that the Shroud may have been repainted but until we have the long sequence of perhaps fifty or sixty artists depictions we are limited in what we can say about how the Shroud originally looked. The evidence of the prominence of the bloodstains is certainly unquestioned as it is what everyone who saw the Shroud was overwhelmed by in a way that is not true today.\n\n","date":"November 3, 2014 at 10:10 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168226","author":"Charles Freeman","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"We should know what has changed in the bloodstains.\n\n","date":"November 3, 2014 at 10:46 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168238","author":"Louis","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Louis – who don’t you read my article-it is all there! There were virtually no bloodstains on burial scene of Christ  in say 1200- as the body of Christ on the Pray Codex shows. By 1330, they are very obvious, even overflowing ,even after Christ is supposedly dead -see Shroud of Turin and the Roettgen Pieta, etc. etc.. \nBTW Colin. Are you assuming that the images on the Shroud today are as they were in 1350?\n\n","date":"November 3, 2014 at 10:58 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168243","author":"Charles Freeman","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Hello again Charles.\nI try not to assume anything – preferring to hypothesize and then see if there’s other data that fits with the new possibilities or not.\nHaving said that, I’m not entirely clear as to the meaning of your question, or why you are asking it. When you ask if the images are as they were in 1350, which images, and based on what kinds of alteration, natural or man-made? Fading? Additions? Subtractions? With or without blood?\nLet’s assume you mean just the basal frontal and dorsal body images. Here’s a graphic I did early last year to indicate what the present (faded) image looks like with the blood taken away – simply an image of an unclothed man without obvious wounds or scourge marks, not open bleeding ones at any rate, though bruises are not excluded.\n\nSure, I would expect those images to have been a lot more intense 600+ years ago, on the (hypothetical) assumption that the image represents discolored intrinsic linen carbohydrates (not McCrone’s and possibly your flaking inorganic pigment).\nWhat I cannot conceive of is a doctoring of the post-production image to add or subtract any BODY image. What could have been used as bleach? They did not have diimide. What could have been added that would have been indistinguishable from the original in every respect? Problematical to say the least.\nBlood is an entirely different matter, and it’s hard to imagine that some over-zealous clerics have not been doing some touching up or even making serial imaginative additions over a passage of time.\nSo my answer would be that the TS image, without its blood, including scourge marks, would have looked much the same as today’s – only more so!\n\n","date":"November 3, 2014 at 11:43 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168253","author":"Colin Berry","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Colin & Charles,\nONLY SNAG (among many others) with your “hypothesis”, cryptologically (or if you prefer) forensically speaking,  I can CONCLUSIVELY identify the HP Ms Christ’s face ‘red smudge’ as part of the Shroud man’s forehead tailed-Epsilon-like shaped blood mark \n(see the first 3-4 pages of my research paper entitled: \nThe Hungarian Pray Ms-Turin Shroud connection:\nMORE THAN MEET THE NON-INITIATED EYE…\nOr An Iconosteganalysis\nI emailed them to Dan on October 30, 2014. Hope Dan will FINALLY publish them)\n…\n\n","date":"November 3, 2014 at 12:13 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168260","author":"Max patrick Hamon","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"This is strong forensics/’iconosteganics’\n\n","date":"November 3, 2014 at 1:19 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168286","author":"Max patrick Hamon","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Colin, well there we would disagree as I believe that the Shroud, while having the same framework, would have been drenched in blood stains, as the descriptions in my articles suggest, and have features such as the Crown of Thorns that are have now disappeared.  The first task is to get a database of all the descriptions and all the depictions of expositions and see how far one can come to a reconstruction of the Shroud as it once was. I am am amazed that this has not been done as it is fairly standard practice in cases of artefacts that give every appearance of significant ageing as the Shroud certainly does.\nBut one aim of my articles is to get someone to work on it- constructing the database would make a good Master’s dissertation for a budding art historian.\n\n","date":"November 3, 2014 at 1:45 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168294","author":"Charles Freeman","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"You appear to be saying that a crown of thorns was needed to match the artistic conventions of a particular era of history, so ipso facto must have been there at one time, so  has somehow been deliberately removed without your saying how.\nThat may be possible in your narrative, one that sees the image as painted, with general flaking off with age, and maybe amenable to selective chiselling off.\nBut there’s no hard evidence for a painted image, Charles, and if I’m not mistaken there’s an element of circularity in your argument. (“The TS image must have been more prominent originally in 1350  to allow display to spectators viewing at a considerable distance, and since that’s not possible now, it must be due to flaking off of artists’ pigments). \nBut there’s an alternative narrative, one that does not see the image as painted, but imprinted, whether from a 14th century template or less probably a 1st century corpse.. That image may fade with time, and indeed almost certainly does on chemical grounds  (on the assumption that all things must pass, thermally or radiation-induced chromophores included). But it does NOT flake off, such that it leaves no trace.One does not have to believe in the “scorch hypothesis” its widest sense to see that it provides a model for a image resistant to flaking off physically(though fading by chemical bleaching is probably inevitable). \nI hesitate to say this, Charles, but there’s a pre-1978 whiff about your entire thesis, You have simply failed to take on board the STURP evidence that the image is on the carbohydrate, and NOT applied with a paint brush. You seem to have bought in 100% to the McCrone pigment  narrative, but genius though he was with microscopy and forensic spot tests etc, he could not bring to bear the range of physical and chemical techniques that  STURP had at its disposal. (OK, so I’m on record as knocking STURP, but most of my criticism was directed  at the pro-authenticty slant of some of the findings, notably those of Adler’s (bilirubin) and Rogers’ (starch impurity coating)  but NOT the central proposition that the image was due to a subtle and superficial  chemical modification of linen fibres or something almost indistinguishable form those chemically (like a starch coating). \nYour revisionist scholarship re art history frankly fails to dovetail with the mainstream science, Charles. One of them is wrong. I know which of the two I prefer.\n\n","date":"November 3, 2014 at 2:13 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168314","author":"Colin Berry","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Colin, what you refer to as a “pre-1978” is exactly what I meant when I told Charles earlier today to forget about relying too much on artistic renditions and read the STURP reports.\n\n","date":"November 3, 2014 at 2:46 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168322","author":"Louis","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"I agree with you on that score, Louis, even if I don’t accept your earlier description of Alan D. Adler as a  ‘bilirubin expert.’ He was a porphyrin specialist. There’s world of difference between cyclic and linear tetrapyrroles. But don’t  tell anyone I told you so.\n\n","date":"November 3, 2014 at 2:53 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168323","author":"Colin Berry","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Colin, at least we know Dr. Alan Adler’s qualifications and can take the findings he obtained together with Dr. John Heller seriously.\nMore DNA studies have been suggested and I expect that those under way will soon be published in peer-reviewed journals. The topic was discussed in the interview with Professor Giulio Fanti:\n https://www.academia.edu/8841978/Professor_Giulio_Fanti_discusses_the_controversies_in_the_realm_of_Shroud_studies\n\n","date":"November 3, 2014 at 3:05 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168328","author":"Louis","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Sorry to disagree, Louis, but it’s a cardinal principle of science that if a scientist is seen to be departing from strict objectivity (for whatever reason, well-intentioned or otherwise), then his or her findings can no longer be taken seriously. \nObjectivity is a highly fragile commodity. As a general observation, the older and more prominent the scientist, the more likely it is that strict objectivity has been de-prioritized.\nThat’s maybe why universities depend on a steady infusion of ‘new blood’ research students. They tend to be less respectful towards certain ‘overriding concerns’.\n.\n\n","date":"November 3, 2014 at 3:28 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168339","author":"Colin Berry","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"No problem at all, Colin. The professor himself stated that to answer the last question in the interview  he was leaving the field of science to enter into the realm of religious belief. I may be wrong, but I thought I detected a bias in favour of positivism in R. Rogers, as stated in the interview, and he belonged to the older and more prominent group of scientists.\nJust yesterday I read a short essay by the Italian philosopher Paolo Flores d’Arcais and found his bias against religion unbelievable. The bias was so strong, the man seemed to be so filled with hatred, that some of his arguments were simply unconvincing, he dodged important questions. \nIt is not hard to understand why universities maybe depending on ‘new blood’ research students, as you say. That is welcome, we have to face hard facts, whether we like it or not. The big problem is scientism, and concentrating on existential issues as I am, I find it difficult to believe that objective science is synonymous with existential knowledge.   \nWe have to go beyond the universe as we find it. May I say even beyond the universe as the best discoveries and scientific theories say it is? It is a challenge to bring evidence that reality is not exclusively physical.\n\n","date":"November 3, 2014 at 4:34 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168356","author":"Louis","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Charles, I did read your article and feel the need to point out that one cannot depend only on artists’ depictions of the body of Christ to judge the Shroud. Artists during the period did not necessarily think like each other.\nIf you go through what is written about the bloodstains in Shroud literature you will notice that serum rings were identified around the major blood flows. The stains were reddish brown, similar to crusty dried blood, different from the body image, seen just on discolored fibres and extremely superficial. The bloodstains flouresced under the STURP team’s UV light.\nDrs. Heller and Adler were serious scientists, the latter was Jewish-born, with no axe to grind, and was a world authority in bilirubin. Both of them conducted nothing less than eleven tests in order to enable them to make sure that what they saw were real bloodstains. Among the constituents identified were protein, albumin and bile pigment bilirubin.\nWhat need new confirmation is the serum that was identified on the bloodstains under the body image.\n\n","date":"November 3, 2014 at 12:04 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168258","author":"Louis","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"‘Artists did not necessarily think like each other’. A crucial point because if we have the same feature e.g. The Crown of Thorns’ shown similarly  by a number of different artists making depictions  at different times, we can be more secure that it was really there, even if faded today. What  we don’t want is artists copying each other.\nAgain vital to build up a data base.\n\n","date":"November 3, 2014 at 4:54 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168359","author":"Charles Freeman","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"But the TS is not to be seen as a work of art (even if one has no clue as to its original role).\nHad it been a work of art, the artist would not have been content merely to add blood. There would have been representations of wounds as well , i.e. apertures in the skin,  like nail holes in hand and feet, lance wounds in the side etc. But the body image is completely free of skin lacerations etc,  and the ‘blood-painters’ knew better than to rectify that omission. Why? Because it would have compromised credibility as the “real” burial shroud.\nThe TS was NOT intended to be seen as a painting.  Apart from the secondary blood additions, nothing would have been done to spoil that carefully contrived illusion. \nThe basal body image was NOT a free-hand painting. It was an imprint off a 3D template. \nSorry to have to spell it out so forcibly, but all this talk of art history is leading us seriously astray.\n\n","date":"November 3, 2014 at 5:16 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168367","author":"Colin Berry","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Have you read the STURP reports, Charles? If you haven’t then it is better for you to read them first, even Colin told you that soon after I did. I am sure you have read some bloggers telling you that you have been biased from the start. How can you defend yourself?\n\n","date":"November 3, 2014 at 5:11 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168366","author":"Louis","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Something useful from a skeptic! Please advise of the ‘contemporary testimonies’\n\n","date":"November 3, 2014 at 5:41 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168157","author":"Thomas","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"“There is an engraving of one such exposition of 1613 by Antonio Tempesta. He was celebrated for his panoramic view of Rome (1593), which shows the individual buildings of the city in meticulous detail, and he was brought to Turin to work for Duke Carlo Emanuele I (1580-1630). It is an exposition from the height of the Counter-Reformation, when the concentration was on drama, with fusillades and the singing of choirs as the Shroud was unfurled before an enthusiastic crowd. My research began with this engraving, as it demonstrated that the original images of the Shroud were much more prominent than they are now. The Shroud would not have made an impact on such large crowds if they had not been. There are features – the Crown of Thorns, the long hair on Christ’s neck, the space between the elbows and the body, the loincloth – that can no longer be seen today. The marks from the fire of 1532 are also clearly evident. Texts describing the Shroud confirm the accuracy of the Tempesta engraving. Two features that are less obvious are the extent of the blood on the body images and the marks of Christ’s scourging or flagellation. We have evidence that these were once prominent. ” Charles Freeman.\n1.-The engraved “INSPIRATOR” of Antonio Tempesta demonstrates his great ignorance of the Shroud and of the proportions:\n– the arms cross in the FOREARMS in Tempesta’s engraving. (In the Shroud the arms cross to level of the HANDS).\n– the legs are separated and the feet DIVERGE in Tempesta’s engraving. (In the Shroud the legs come closer and the feet CONVERGE).\n– Antonio Tempesta’s “Shroud” that “inspires” Charles Freeman is a very bad copy of the Shroud. \nAntonio Tempesta made a very bad sense of the proportions:\n– he was a giant the Man of the Shroud who proves to be Tempesta ó there were dwarf 7 clergymen who were doing the Ostensión?.\n– all the figures of the first plane are ” anatomical disproportionate “.\n2.- 2 magnificent copies of Noalejo (1527, Spain) they demonstrate the ” phantasmagoric character “, similar to the current one, of the image of the Shroud. \n3.-Charles Freeman did not understand Cennini.\n-Cennini’s “gesso” is is a calcium sulfate mineral (CaSO4·2H2O).(Cennini’s “gesso” is not a carbonate of calcium).\n(en español)\n \n1.-El “INSPIRADOR” grabado de Antonio Tempesta demuestra su gran desconocimiento de la Sábanay de las proporciones:\n-Los brazos se cruzan en los ANTEBRAZOS en el grabado de Tempesta. (En la Sábana los brazos se cruzan a nivel de las MANOS).\n-Las piernas están separadas y los pies DIVERGEN en el grabado de Tempesta. (En la Sábana las piernas se aproximan y los pies CONVERGEN).\n-La “Shroud” de Antonio Tempesta que “inspira” a Charles Freeman es una muy mala copia de la Shroud.\nAntonio Tempesta tenía un sentido de las proporciones muy malo:\n-¿ Era un GIGANTE el Hombre de la Sábana que muestra Tempesta ó eran ENANOS los 7 clérigos que hacían la Ostensión? .\n-TODAS las figuras del primer plano son “anatómicamente desproporcionadas”.\n2.- Las 2 magníficas copias de Noalejo (1527, España) demuestran el “carácter fantasmagórico”, similar al actual, de la imagen de la Sábana.\n3.- Charles Freeman no entendió a Cennini.\nEl “gesso” de Cennini es sulfato de calcio (CaSO4·2H2O).(El “gesso” de Cennini no es carbonato de calcio ).\nCarlos\n\n","date":"November 3, 2014 at 9:57 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168223","author":"Carlos","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Calcium carbonate and calcium sulphate. See Susie Nash’ book on the Northern Renaissance – she says that calcium carbonate was used in gesso north of the Alps, calcium sulphate south of the Alps, an interesting pointer to where the Shroud may have been painted.\n\n","date":"November 3, 2014 at 10:01 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168225","author":"Charles Freeman","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Re “Crown of Thorns”:  See Enrie negatives of head, ventral, more particularly dorsal.  Blood flows on hair are more consistent with a “helmet of thorns” rather than a circlet.  The headgear of Middle East potentates around NT times was conventionally a helmet, see various coinage examples.  E.g: two separate coins of Abgar VIII both show a helmet, the first under Emperor Commodus with a cross, the second under Emperor Severus reverted to stars.  A circlet crown was the convention with medieval European potentates.  All European medieval depictions of the Crown of Thorns show a circlet .  Why would a European medieval artist paint the blood flows on the Shroud’s image of the head as if it had been a helmet, when the conventions of the crown were in most known cases of a circlet?\n\n","date":"November 3, 2014 at 2:57 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168324","author":"daveb of wellington nz","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"The St. Clares’s nuns saw that ‘the crown’ on the dorsal image was ‘ like a hat ‘ and indeed a ‘.’hat’ can be seen clearly on tHe Tempesta engraving . De Beatis says in1517 that  the ‘crown on the head’ could also be seen distinctly and again you can see it in the Tempesta engraving a hundred years later. This is the way by putting together the independent descriptions that agree with each other ( and ,of course, there are many other depictions with the Crown in place on the head) that we can slowly build a reconstruction of how the images on the Shroud looked originally.\nThe key point ,of course, is that depictions of the crown left on after Christ was taken down from the Cross only appear in the fourteenth century possibly earlier but only rarely.\nSo how was the Crown of thorns put onto the Shroud? Embroidered on? I think painted on is much more likely as painting on linen was very common. It is just that most have been lost – the survivors tend to be those that were pasted onto wooden panels.\nUnless the Shroudies think the descriptions of the Crown of Thorns are fabricated in medieval times, you have to accept that Christ was indeed buried with the Crown of Thorns still in place. But as depictions of the burial of Christ with the Crown are common in later medieval iconography  but not before would put them as one more piece of the medieval jigsaw.\n\n","date":"November 3, 2014 at 3:14 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168330","author":"Charles Freeman","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Reminder for both Charles and Colin: re the physical development of marks on a fabric, the Alkaline-water fumigation is the simplest technique for the development of latent coinprints and bodyprints on textile substrates.\n\n","date":"November 3, 2014 at 3:23 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168331","author":"Max patrick Hamon","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Note: I mean coins originally smeared with blood\n\n","date":"November 3, 2014 at 3:24 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168333","author":"Max patrick Hamon","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"No need of painting or paint flaking off!\n\n","date":"November 3, 2014 at 3:26 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168335","author":"Max patrick Hamon","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"I also mean moistened bodyprints\n\n","date":"November 3, 2014 at 3:30 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168340","author":"Max patrick Hamon","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"“Blood flows on hair are more consistent with a “helmet of thorns” rather than a circlet.” I’ve never understood this. The top of the head is quite absent, and has no blood flows on it at all. Blood seems to be oozing from just above the hair line in front, and mostly along the lower edge of the skull at the back, although there are a couple of stains which seem to originate a little closer to the top of the head. Did the originator of the ‘helmet’ hypothesis think the two ‘heads’ were indeed not touching at all, I wonder. If we decide that by measurement that the cloth was wrapped quite closely all around the head, then there is a distinct absence of evidence for piercings all over the top of it.\n\n","date":"November 3, 2014 at 4:10 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168348","author":"Hugh Farey","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Evidence for the cap is actually clearer on a plate in Wilson (1978) than it is on the Shroudscope images.  I’ll try to remember to send you a ppt slide I put together. It also shows the pigtail, which I’ve heard you also don’t believe in.  Regards, daveb.\n\n","date":"November 3, 2014 at 6:59 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168396","author":"daveb of wellington nz","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Wilson (1978) Plates pp 50-51 seems to show the top of the head, but a moment’s reflection tells you that it actually shows the back of the head, and that there is quite an expanse of unmarked shroud (not shown in Wilson’s photo) with no marks at all.\nAs for the pigtail, I’m ambivalent about it really. Was it oiled or plaited? If not, how did it stay together and not spill about around the head? Like the hair, it looks as if it belongs to an upright body rather than one lying down, but I wouldn’t go to the stake for it.\n\n","date":"November 3, 2014 at 7:43 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168410","author":"Hugh Farey","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"David, it would be great if you could make that pigtail image available to all of us.\nHugh, Ian Wilson wrote that he saw a stain, possibly hair oil used to “bind” the pigtail, on the Shroud in 1973 and that he had wanted Scotland Yard to examine it in 1978. I don’t know whether he made a formal request, and it seems to have been forgotten. It is said that the pigtail was a symbol of Jewish resistance to Roman rule and was left unbound only on feast days.\n\n","date":"November 3, 2014 at 8:09 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168414","author":"Louis","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Charles, thanks for a tremendous article. I think you’ve opened up a new line of inquiry and you make a very good case for a ‘painted’ shroud. Is it possible the original shroud was created as a more muted forgery. This was then re-touched on numerous occasions for public display?\nI’m sure you’re not dismayed by the negativity you’ve received here. I’d take it as a good sign.\n\n","date":"November 4, 2014 at 3:29 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-168687","author":"jay","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"aljones909:\nFurther on the dimensions of the shroud head image. It’s simple to show it’s a deliberate fabrication with an obvious mistake ‘encoded’ in the image.\nTake a tape, or a piece of string, and hold it between your eyes, level with your pupils, then take the tape over the top of your head to the corresponding point at the back of your skull. i.e. the string measures from your eye line at the front, over the top of your head, to the corresponding ‘eye line’ at the back. I’m reasonably normal and get a length of 35.5 cm.\nThe corresponding mesurement on the shroud is around 20cm.\nThis is a totally impossible result if a continuous cloth covered the front and back of the head. It must be an artifice. \n\nEnd of discussion.\n\n","date":"November 6, 2014 at 6:04 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-169167","author":"O.K.","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"That was just what I was going to say ok. Yet another pathetic skeptic attempt\n\n","date":"November 6, 2014 at 5:11 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-169168","author":"Thomas","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"No need to be rude. But see my ‘November 6, 2014 at 5:24 am’ above.\n\n","date":"November 6, 2014 at 5:31 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-169173","author":"Hugh Farey","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Tut tut.\nBeing a direct person I for one won-t hold back on telling it like it is\n\n","date":"November 6, 2014 at 5:35 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-169174","author":"Thomas","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Thomas. Be as rude as you want. I’ll tell it like it is as well.\nNo serious case has been put forward to suggest the radiocarbon dating of the shroud is wrong.\nThe contra ideas range from the crazy (invisible patch) to the outlandish (unexplained neutron emissions).\nThen, because of a conviction that the date is wrong, we have new dating methods for ancient artefacts invented by an explosives expert (Rogers) and a Mechanical Engineer (Fanti).\nSee Colin Berry’s article here:- http://tinyurl.com/nqgp6su to get a glimpse of how threadbare the Rogers paper was. It reveals his partner in this paper was Kosiewicz. His speciality was nuclear waste disposal. This ‘miles out of area’ is typical for ‘shroud scientists’.\nThe Fanti idea is beyond ridiculous.\nAmazingly, these new dating methods gain no converts among the wider scientific community. No one takes them seriously as a way to date, or confirm the dating, of ancient artefacts.  They have no use beyond the bizarre world of ‘shroud science’.\n\n","date":"November 7, 2014 at 12:37 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-169621","author":"aljones909","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"It seems like aljones909 has confused the watermark with the image of the back of the head\n\n","date":"November 6, 2014 at 6:01 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-169182","author":"Henrik","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"This is a current mistake some anti-authenticists and authenticists as well will make.\n\n","date":"November 6, 2014 at 6:59 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-169198","author":"Max patrick Hamon","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Henrik, correct. The ‘back’ image is very faint. I was looking at an ‘unenhanced’ version. Happy(sort of) to accept a correction. It still leaves 2 big problems with the head image.\n1. My previous posting  shows (with diagrams) there is not nearly enough skull above the eyeline. There has been a deafening silence in response to this.\n2. There is no image from the top of the head. Why not? What are the theories?\n\n","date":"November 7, 2014 at 11:19 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-169604","author":"aljones909","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Hugh and Mike both responded to your skull/eyeline angle. Those responses pointed out flaws in your thinking. The deafening silence may represent agreement with those replies.\nIf you search through this blog site you will find a few postings about the lack of top of head image and theories about this.\n\n","date":"November 7, 2014 at 11:52 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-169615","author":"David Goulet","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"David, the response to my post about ‘not enough skull above the eyeline’ was an alternative picture comparing a real head with the shroud head image. I re-aligned this, matching the eyeline, to clearly show the problem remained with this alternative image. \nI’ve now looked at the posts on the second problem – the missing ‘top of the head’ image. The reasonable explanation is that the artist did not consider it or decided it would not be aesthetically pleasing. \nThis image from Charles Freeman’s article is strong evidence that there always was a ‘void’ between the images of the front of the head and the back of the head. Vivid depictions of blood but absolutely nothing in the head gap (Charles has indicated that other images can be seen in the print version).\nThe full article here:\n http://www.historytoday.com/charles-freeman/origins-shroud-turin\nAn image of the shroud from 1608 here (from the article):\n \nThe accompanying podcast is well worth a listen:\n http://www.historytoday.com/the-podcast\n\n","date":"November 7, 2014 at 4:08 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-169652","author":"aljones909","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Aljones, the deafening silence was because I thought I answered your question. Beside artists guidelines for do you have any scientific rigor behind the ratios you claim? I gave you the Tibiofemoral index as an example to show how medival art falls short in matching the anatomy of the shroud? I also referred you to a nice video clip that explains why the dimensions of the face may be distorted. Did you see the video? The defeaning silence was more at your part not mine.\nAnother problem with measuring the top of the head is that you can’t really pinpoint the top of the head, there is a waterstain and a blood stain in the same spot and the Shroud image is orthogonal in nature fasing the further away from the body and we don’t know for sure if there was a head band tied around the head to keep the chin closed or not (There was a lot of discussion on this blog before about this issue) if there was one then that cloth could’ve prevented imaging of the top of the head. There are lots of loopholes in your claim that your observation proves the shroud a forgery. It doesn’t prove anything.\n\n","date":"November 7, 2014 at 6:55 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-169674","author":"Mike M","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Fasing=fading\n\n","date":"November 7, 2014 at 7:06 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-169677","author":"Mike M","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"“The reasonable explanation is that the artist did not consider it or decided it would not be aesthetically pleasing.”\nYou should detail the method of the artist first, then what may have been his aesthetics vision, you’re jumping to a speculative conclusion.\nAnyway, i don’t think there is a specific “top of the head” issue, but see my previous comments on this blog.\n\n","date":"November 8, 2014 at 1:46 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-169742","author":"anoxie","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Mike,I watched part of the video. The morphing stuff is quite convincing. See https://www.youtube.com/watch?v=pJBS5SEmlMc.\n\n","date":"November 8, 2014 at 5:34 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-169937","author":"aljones909","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Aljones, I am glad I could be of help in your serious pursuit of the truth.\n\n","date":"November 8, 2014 at 8:18 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-169963","author":"Mike M","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Mike M, science is not about having a conclusion then finding numerous (often contradictory) ways to arrive at that conclusion. It’s not the truth shroudologists seek – it’s the TRUTH. The most miraculous thing in that video is the hair of the CGI guy (Downing I think). It truly defies all known laws of physics\nMaybe you can point me to the peer reviewed papers where he explains how he extracted all this ‘encoded 3d information’. That would be real science. Detailed descriptions of assumptions, algorithms and methods.\n\n","date":"November 9, 2014 at 6:36 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-170066","author":"aljones909","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"“It’s not the truth shroudologists seek – it’s the TRUTH”\nSorry Aljones, you are wrong again. Science does not equal truth because it changes all the time, based on the current knowledge. How many drugs were pulled off the market after being declared safe with many peer reviewd science only to discover later that it causes more damage than good? It does not even claim to equal truth. It provides a method to reach the truth but it is only a method not an endpoint.\nAnd since you are so eager for scientific truth I was hoping for the TRUTH behind the ratios you purport discredits the shroud? Are you still looking for them? if you don’t find them will you admit you were wrong? With regards to the video of the real face of Jesus, I never claimed it to be science. I was trying to demonstrate something for you. However the 3D information embedded in the shroud image is well known and acknowledged by believers and skeptics alike. In fact you can see it for yourself by downloading any image processing software (e.g.ImageJ being one of them).\nHere are some papers for you which I know you wont even bother but here we go;\nhttp://www.shroud.com/pdfs/schumchr.pdf\nhttp://www.dii.unipd.it/-giulio.fanti/research/Sindone/Art.%203D%20Dig.%20Imaging%2012.pdf\n\n","date":"November 9, 2014 at 9:26 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-170092","author":"Mike M","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Mike M, Fanti? Really? Single handed inventor of 3 new dating techniques! I notice from comments on this site that he even embarrasses many shroudies. \nPeter Schumacher is more academic. There’s a few caveats there.\nI find the ‘encoded 3d information’ idea very overblown.\nHere’s one of the images Fanti has in the article:\n\nIt’s not terribly impressive. Certainly not miraculous.\nThe point is that the hard science by real scientists puts it firmly in the 14th century.\nHow the image was created doesn’t really interest me.\n\n","date":"November 10, 2014 at 2:57 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-170452","author":"aljones909","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Aljones, sorry this may be my last posting on this thread because its going no where. You present yourself as an advocate for science, “science is TRUTH” you say. However, you have failed so far to present any scientific rigor behind the ratios that started the whole discussion. Furthermore, to prove your point you resort to Ad Hominemns “Fanti….really”, single handed inventor of 3 dating method” Since when was the number of inventions someone makes considered derogatory?\nI also find your posts very subjective, which is not very scientific if you think about it.” I find the idea…overblown…not terribly impressive” and why?…nothing, just because you said so. Did you compare the shroud’s 3D relief to the 3D relief of a real painting? offcourse not.\nYou consider that C14 test hard science. Since when was using a single sample from a contaminated corner that has been proven heterogenous considered “hard” science.\nIt was nice talking to you, hope one day you think objectively about the subject, may be then we can have another discussion, Ciao!\n\n","date":"November 10, 2014 at 7:11 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-170486","author":"Mike M","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Mike M, “Since when was the number of inventions someone makes considered derogatory?” I think you are not taking into account thath his newly invented dating methods are not supported by a peer reviewed paper and are inherently inaccurate. Probably to the point of being completely useless. To suggest this trumps the relentless random decay of carbon molecules is ridiculous.\n“Did you compare the shroud’s 3D relief to the 3D relief of a real painting?”. No. Did you compare it to the 3D relief of images produced by applying pressure to a cloth over an object?\n\n","date":"November 11, 2014 at 5:25 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-170581","author":"aljones909","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"http://www.researchgate.net/publication/257346138_Non-destructive_dating_of_ancient_flax_textiles_by_means_of_vibrational_spectroscopy\n&\nhttps://www.shroud.com/pdfs/thibault-lg.pdf\n\n","date":"November 11, 2014 at 8:00 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-170603","author":"Mike M","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Mike M, Regarding Fanti and his new dating methods. It’s a host of assumptions, uncertainties and plucking numbers out of the air somehow, miraculously you might say, he gets it to average out at 33AD. The idea seems to be that 3 piles of crap will combine to form one jewell. As Fanti said:- “From a religious point of view, I am sure that the Holy Shroud is authentic and it is the most important Relic of Christianity. This because, following a precise question of mine, I had a personal answer in 1998 in front of the Relic.”.  He has the “answer”. he just needs to make the data fit.\nThese revolutionary dating techniques will never be heard of again (just like Rogers’ vanillin method). It’s “shroud science” but has no existence outside this domain.\nRegarding Thibault Heimburger, M.D and his critique of Garlaschelli’s demonstration. I agree with his general thrust that the 3D aspects Garlaschelli acheived are pretty crude. The techniques Garlaschelli used (baking in an oven to simulate 600 years of aging etc) are unlikely to produce the same result as 600 years of actual aging. Garlaschelli was demonstrating a principle – that a relief template produces 3d effects.\nBear in mind that the most impressive 3d images of the shroud head are reconstructions. They owe more to the skill of the reconstructer than they do to “3d encoded data”.\nDan has also done a post on processed photos that can show 3d effects. https://shroudstory.com/2014/06/05/good-3d-from-a-conventional-photograph/\n\n","date":"November 12, 2014 at 2:59 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-170883","author":"aljones909","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"Aljones, do you have any specifics re-assumptions, uncertainties, plucking numbers? So far you have given me nothing scientific.\n “3 piles of crap” what’s your evidence for that beside your subjective opinion?\nYou say Fanti believe in the shroud because of a personal experience, however this doesn’t prove a fault in his science.\nAgain, what do you have scientifically speaking against his scientific paper beside your personal opinion?\nHow does your personal belief in Jesus (or as I am quiet sure lack thereof) affect your opinion on the authenticity of the  shroud? Don’t answer that question just think about it yourself.\nHow do you know that Luigi’s experiment was faulty because of the baking step?\nYou say Dan has given examples of photographs with 3D info do you believe the shroud was a 13th century evenly lit photograph?\nSo far Aljones all I get from you is a personal opinion I was hoping for more because unfortunately I don’t have time for personal opinions. So again, Ciao!\n\n","date":"November 12, 2014 at 7:26 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-170922","author":"Mike M","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"You are not the first one to do that mistake:\nhttps://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/\nYour point 2 was further discussed here:\nhttps://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/\nI think your point one depends on where the cloth loose contact with the head or some other factors depending on what image mecanism you prefer\n\n","date":"November 7, 2014 at 12:36 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-169620","author":"Henrik","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"If an artist created the TS, why would he have left the top of the head ‘unfinished’? The fact that there are so many irregularities with this image is a good reason this could not have been a painting. Who paints like that? Stick around here long enough and you’ll come to appreciate just how vexing this icon is…especially to those who think they’ve got it all figured out (either pro or con authenticity).\n\n","date":"November 7, 2014 at 4:19 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-169655","author":"David Goulet","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"David- you are falling into the trap of imagining that the Shroud as it is today Is as it was first created.\n\n","date":"November 11, 2014 at 1:56 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-170546","author":"Charles Freeman","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"I am waiting for a single piece of evidence that dates the Shroud to before AD33. Please don’t give me the Fanti conjuring tricks with numbers- he is one reason why the Shroudies are not taken seriously in the wider academic world. As said above, he is embarrassing and this is why it is hard to find his numbers even on pro- authenticity websites.\nIf you can provide the evidence not only for this date but for the theory they the Shroud has remained chemically unchanged for two thousand years so that what we have now in Turin is exactly the same as what was found in the tomb , well yes this would indeed be a miracle, an object that had defied time and, yes, I would believe in miracles.\nIf you can’t date the Shroud this early then we have to look at other ways of explaining the images. For me the most likely is a painted image , made as the medieval manuals suggest on the outer fibrils of the cloth (and I am delighted that STURP support this interpretation that the image is on the outer fibrils only – and yes, they have not come with any sort of date  either). If you don’t think the images were originally painted, then please AGREE among yourselves on an alternative  method, not just fantasise.\n\n","date":"November 11, 2014 at 3:15 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-170559","author":"Charles Freeman","site":"shroudstory"},{"title":"History vs. Science:  The Freeman Beat Goes On","post":"And if Ian Wilson, Mark Guscin and Dan Scavone are right, the Shroud was not lying undisturbed in a dry Egyptian tomb but out and about all over, rain and shine for well over a thousand years. Even all those insects that left Max Frei’s pollen on the cloth must have done something to change it. And that was before the fully documented  accounts of its handling after 1355. Even more of a miracle that  it experienced no chemical change.\nI am not saying that there are not many issues about the Shroud still to be resolved. We still don’t know how they organised the thousands  of stones of the pyramids to be carved so precisely that they created a perfect pyramid but that does not mean that the pyramids  were built in 12,000 BC. You get on with working out how it was done within the time period that lots of other evidence makes conclusive.. Similarly with the Shroud  until there is firm evidence for an early date for the Shroud and an explanation of how it remained unchanged for so long, I am staying medieval and into an original painted surface, whether much remains of that or not today. Lots of interesting questions there still to resolve, notably why, in contrast  to most accounts of images of  Christ on a cloth that describe a single image , here it is a double image. Possible roots in Byzantine or Visigothic art is one suggestion. But as so often I have to rely on expert opinion here.\n\n","date":"November 11, 2014 at 4:04 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","id":"comment-170569","author":"Charles Freeman","site":"shroudstory"}]
