[{"title":"Holy Face of Laon:  Continuing Jones’  Four Proofs that the AD 1260-1390 Radiocarbon date for the Shroud has to be Wrong!","post":"This is a perfect example of a copy of the Mandylion that was probably done by an artist who was an eye-witness of the relic !!!  Did you see blood somewhere folks ??? \nOh, I’m sure Wilson would be willing to pretend that the red dots are blood marks…  :-)\nAnd I’ll repeat it for those who never read my comment about the Vignon markings :  For Paul Vignon, the fact that the copies of the Mandylion show a great degree of ressemblance with the Shroud face was a very compelling evidence that this relic was a manmade creation of the Church of Edessa (probably a painting) based, directly or indirectly, on the Shroud.  Vignon never thought for a second that this relic could have been the Shroud folded in 8 like Wilson pretend.  For Vignon, there was a close connexion between the 2 relics, but at the same time, they were different relics in his mind !  And a very big bunch of historians, experts in byzantine art, etc. also conclude that those relics were really 2 different relics.  The sad part of the story is this :  In all my researches about the Mandylion, I only noticed some “shroudies” who believe WIlson is right.   I never saw a single historian (a real one, not a journalist) that come from OUTSIDE the Shroud world and who his a defender of Wilson’s hypothesis.  Not a single one !\nI will conclude by saying this :  Look closely at this Holy face of Laon that was probably made by an artist who knew very well the real Mandylion.  Seriously, do you really think it represent the face we see on the Shroud of Turin ?  You really think this artist would have done a copy of the relic and, at the same time, transform some of the most evident properties of the image :  He would have taken the image of a dead Christ and turn it into an image of a living Christ.  Also, he would have taken the image of a bloody Christ and turn it into an image of an alive and well Christ !  YOU SERIOUSLY BELIEVE THAT ???  That’s your liberty !!!\n\n","date":"April 23, 2012 at 4:47 pm","url":"https://shroudstory.com/2012/04/23/holy-face-of-laon-continuing-jones-four-proofs-that-the-ad-1260-1390-radiocarbon-date-for-the-shroud-has-to-be-wrong/","cat":"history","id":"comment-10775","author":"Yannick Clément","site":"shroudstory"},{"title":"Holy Face of Laon:  Continuing Jones’  Four Proofs that the AD 1260-1390 Radiocarbon date for the Shroud has to be Wrong!","post":"Yannick, Yannick,\nLook (if you dare) at the Prax Codex naked Christ. His body is both woundless and bloodstainless. CANNOT YOU SEE WITH YOU OWN EYES? How do you then account for such an absence? Do you REALLY think the Pray Codex naked Christ was not copied after the Shroud man’s wounded  body covered in blood or will you start from now on to infer there was A THIRD IMAGE (one of the face only, one of the front image only and one of both the back and front images? Your logic is definitely NOT that of the Shroud image copists and miniaturists in Byzantine time so long ago… WETHER YOU LIKE IT OR NOT!\n\n","date":"April 23, 2012 at 6:10 pm","url":"https://shroudstory.com/2012/04/23/holy-face-of-laon-continuing-jones-four-proofs-that-the-ad-1260-1390-radiocarbon-date-for-the-shroud-has-to-be-wrong/","cat":"history","id":"comment-10787","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holy Face of Laon:  Continuing Jones’  Four Proofs that the AD 1260-1390 Radiocarbon date for the Shroud has to be Wrong!","post":"Byzantine copists and miniaturists were to paint according to a +/- codified vision… which definitively had nothing to see with yours…\n\n","date":"April 23, 2012 at 6:15 pm","url":"https://shroudstory.com/2012/04/23/holy-face-of-laon-continuing-jones-four-proofs-that-the-ad-1260-1390-radiocarbon-date-for-the-shroud-has-to-be-wrong/","cat":"history","id":"comment-10788","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holy Face of Laon:  Continuing Jones’  Four Proofs that the AD 1260-1390 Radiocarbon date for the Shroud has to be Wrong!","post":"Sorry to disagree with you, Stephen. However, stricto sensu, hyperthinness/bubble soap thinness just cannot be a proof in se of the Shroud image authenticity.\n\n","date":"April 23, 2012 at 5:03 pm","url":"https://shroudstory.com/2012/04/23/holy-face-of-laon-continuing-jones-four-proofs-that-the-ad-1260-1390-radiocarbon-date-for-the-shroud-has-to-be-wrong/","cat":"history","id":"comment-10779","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Holy Face of Laon:  Continuing Jones’  Four Proofs that the AD 1260-1390 Radiocarbon date for the Shroud has to be Wrong!","post":"Very good point Max.  The Pray codex is a good example that show that before the 13th century, it was not “in the air” to represent a bloody Christ.  And then, someone can extrapolate and think that this reasoning can be also applied to the copies of the Mandylion.  But, at the same time, ancient sources (like the Narratio de Imagine Edessena) is pretty clear about the fact that the Mandylion had been showed publicly at some points during his history.  And the “Narratio” informs us also about the precious fact that there were already 2 copies of the Mandylion in Edessa at the time of the deal (in 944) between the byzantine emperor Romanus Lecapenus and the Arab ruler of Edessa that enable the emperor to get the Mandylion and take him back to Constantinople.  And, also from the “Narratio”, we learn that those 2 copies were so good that the Byzantines had to make a careful check of the relic they were about the get, in order to be 100% sure that it was the authentic Mandylion.\nFrom those information, we can deduce 2 important things :\n1-The Mandylion must have looked very much like a painting, since it appear that paint copies of the relic were so similar that it needed a careful check to differentiate them with the authentic relic.\n2-During the time the Mandylion was still in Edessa (before 944), there was already copies of the relic that were made and since it’s evident that they were very good copies that look very like the original (see my previous explanation), if Wilson was right, then that would mean the artists who made those copies DID SHOW THE BLOODSTAINS on their copies !!!\nIn this context, you will make me believe that those 2 Edessenian copies were the only 2 in history to be almost exact copies showing the bloodstains (so exact that they could easily have been confused with the original) and then, after the transfer to Constantinople, no artist would have dared to make another exact copy showing the bloodstains like the 2 exact copies in Edessa ?  I think a scenario like that is highly unlikely.  I don’t see why those exact copies from Edessa would have been very different than the subsequent copies done in Constantinople (like this Holy Face of Laon).  To me, the fact that there was already some copies made during the time the relic was still in Edessa strengthen the idea that the relic was really an image of the living Christ showing no bloodstain at all.  I really think that if there would have been copies in Edessa showing the bloodstains, there would also have been those kind of exact copies made later on when the Image was in Constantinople.  I’m sure you understand my argument !!!\nAnd if we analyse the Pray codex, then it is pretty evident that the artist who did the work had seen the Shroud with his own eyes.  But he did not show the bloodstains (or maybe just a little bit in one particular place, but that’s not guarantee).  Since this artwork was done during the 12th century by an artist who was most probably one of the few to have been able to see the inside part of the Shroud at that time (before the public showing of the Shroud in Constantinople during the years 1203-1204), I think it is enough to understand why he didn’t draw the bloodstains (or just a few).  In fact, it wasn’t “in the air” of the time to show a suffering Christ and this artist didn’t dare to show those bloodstains in every details.  It is understandable that he acted like that because of the artistic context of the time were there was absolutely no image of a suffering Christ with bloodstains anywhere in Christian art.  It took the most probable first ever public showing of the inside part of the Shroud with the images to see things changed in Christian art related to the Passion.  I’m pretty sure this particular public showing was the starting point of the changes we saw later on during the 13th century…\n\n","date":"April 24, 2012 at 3:50 pm","url":"https://shroudstory.com/2012/04/23/holy-face-of-laon-continuing-jones-four-proofs-that-the-ad-1260-1390-radiocarbon-date-for-the-shroud-has-to-be-wrong/","cat":"history","id":"comment-10820","author":"Yannick Clément","site":"shroudstory"},{"title":"Holy Face of Laon:  Continuing Jones’  Four Proofs that the AD 1260-1390 Radiocarbon date for the Shroud has to be Wrong!","post":"I want to emphasize the first deduction that you find in my comment above.  Here is again the deduction : 1- The Mandylion must have looked very much like a painting, since it appear that paint copies of the relic were so similar that it needed a careful check to differentiate them with the authentic relic.  \nStarting from this deduction, I want to remember you that the first ancient manuscript that ever introduced the idea of an image of Christ in the Abgar legend is called “The Doctrine of Addaï” (the syriac version date from + or – 400 and the greek version date from the third decade of the 5th century) and that it wasn’t at all a miraculous image then.  No…  In fact, it was simply a portrait of the living Christ painted by the artist of the king !!!  And some other manuscripts that tells the Abgar legend, dating from the 5th century and even from the beginning of the 6th century, have also mentionned a portrait of Christ that was painted by the artist of the king and even 2 of those manuscript report that this portrait was still present in Edessa.  I think that all those evidence make a pretty good case to support the idea that the Image of Edessa was most probably a portrait of the living Christ that was painted by an artist (no miraculous image here and no shroud of Christ folded in 8) and that, during the second part of the 6th century, the church of Edessa started to make believe people that this was, in reality, an image not made by human hands.  I think this change from a manmade to a miraculous image could have taken many decades to be completed and was propagated by text like The Acts of Thaddeus and others like that.  \nThat’s where I stand right now in my research on the subject.  I think the idea that the image was not made by human hands is simply a late literary development that was done to serve the Church interest against the heretics they were fighting.\n\n","date":"April 24, 2012 at 4:47 pm","url":"https://shroudstory.com/2012/04/23/holy-face-of-laon-continuing-jones-four-proofs-that-the-ad-1260-1390-radiocarbon-date-for-the-shroud-has-to-be-wrong/","cat":"history","id":"comment-10821","author":"Yannick Clément","site":"shroudstory"},{"title":"Holy Face of Laon:  Continuing Jones’  Four Proofs that the AD 1260-1390 Radiocarbon date for the Shroud has to be Wrong!","post":"Just one specification about what I said at the end of my comment : The most probable first public showing of the Shroud that I refer too is the one that Robert de Clari saw in 1203 in Constantinople.  From ancient sources, this is the first reference to a public showing of a Shroud of Christ that bears a body image on it.  That’s why I consider this public showing to be the very first one in history where the Church dared to show the entire Shroud, including the interior part where we can see the body image.  The public showing was done each friday during part of the years 1203 and 1204, until the sack of Constantinople in april 1204.  And I estimate that this first public showing had a direct impact on the drastic change we see in Christian art regarding the depictions of the Passion of the Christ, where we saw realistic and bloody depictions suddenly appeared in Europe after the return of the crusaders.  I don’t think it is an hazard versus this public showing of the Shroud reported by de Clari…\n\n","date":"April 25, 2012 at 11:07 am","url":"https://shroudstory.com/2012/04/23/holy-face-of-laon-continuing-jones-four-proofs-that-the-ad-1260-1390-radiocarbon-date-for-the-shroud-has-to-be-wrong/","cat":"history","id":"comment-10836","author":"Yannick Clément","site":"shroudstory"}]
