[{"title":"Hot New Topic: The Wife of Jesus","post":"And that woman is Mary Magdalene, right?  This kind of nonsense has been debunked in other centuries, but I see it persists.\n\n","date":"September 19, 2012 at 8:09 am","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","id":"comment-16502","author":"Andy Weiss","site":"shroudstory"},{"title":"Hot New Topic: The Wife of Jesus","post":"It is very strange, but no surprise, that Karen King does not mention the provenance and context and she certainly does know that good archaeology demands such a procedure. At first sight the papyrus is a fake.\n\n","date":"September 19, 2012 at 8:15 am","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","id":"comment-16503","author":"Louis","site":"shroudstory"},{"title":"Hot New Topic: The Wife of Jesus","post":"i am a christian and thats part of the gnostic gospels thats a bunch of bunk my savior came to save whoever would believe on him he came with a mission he healed the sick and rose the dead and raised himself and is on the right hand side of his father\n\n","date":"September 19, 2012 at 11:23 am","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","id":"comment-16509","author":"darla mann","site":"shroudstory"},{"title":"Hot New Topic: The Wife of Jesus","post":"As Andy mentioned this is old news. It will be celebrated by those who look for anything to cast doubt on the Christ Story. Even if the papyrus was genuine it still means nothing as it is an issue that’s been debunked a long time ago.\n\n","date":"September 19, 2012 at 12:40 pm","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","id":"comment-16510","author":"Chris","site":"shroudstory"},{"title":"Hot New Topic: The Wife of Jesus","post":"In the end folks, does it really matter if Jesus had a wife or not ?  Seriously ?  Don’t get me wrong, I don’t take anything that comes from Gnostic gospels as historical facts, but seriously…  If Jesus had a wife…  So what ?\n\n","date":"September 19, 2012 at 3:46 pm","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","id":"comment-16523","author":"Yannick Clément","site":"shroudstory"},{"title":"Hot New Topic: The Wife of Jesus","post":"Some scholars believe the papyrus fragment is a forgery.\nhttp://www.dailymail.co.uk/news/article-2205673/Jesus-Wife-papyrus-Proof-Jesus-married-declared-forgery-unconvincing-experts.html?ITO=1490\n\n","date":"September 19, 2012 at 6:51 pm","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","id":"comment-16535","author":"Angel","site":"shroudstory"},{"title":"Hot New Topic: The Wife of Jesus","post":"I wouldn’t be surprise at all if this was effectively a forgery…\n\n","date":"September 20, 2012 at 8:53 am","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","id":"comment-16573","author":"Yannick Clément","site":"shroudstory"},{"title":"Hot New Topic: The Wife of Jesus","post":"It is by no means settled as to whether the fragment is or is not a forgery.  But it is relatively easy for modern forgers to acquire ancient papyrus, and then use it to manufacture evidence of “startling new ancient texts”.  The present owner is said to wish to remain anonymous but it is interesting that there are also reports that he wishes to sell it.  In the meantime he seems to have granted permission for Harvard to hold the fragment so it can be tested and examined by scholars.  Non-destructive tests are proceeding on the ink to see if it can be identified as authentic or not.  There are comments from some experts who claim that it appears to be genuine while others are not so sure. \nKaren King is Hollis Professor of Divinity at Harvard, a highly pretigious posting;  She is not an archaeologist, but a BA & PhD in Religious Studies, and was asked to examine the fragment by the owner.  She seems to have been associated with some feminist trends in Religious Studies, and I also note that she has also worked with Elaine Pagels who wrote controversially on Gnostic Studies a few decades ago.  \nShe has submitted a draft report for initial publication: “Jesus said to them, ‘My wife…’” A New Coptic Gospel Papyrus, by Karen L. King with contributions by AnneMarie Luijendijk.\nFor those who wish to follow it up for more information, PDF can be found at:\nhttp://news.hds.harvard.edu/files/King_JesusSaidToThem_draft_0917.pdf\nThere is considerable information in the paper about the fragment, what is known of its provenance, a translation and an extensive commentary with footnotes and citations. \nThe fragment is said to have been written in the fourth century, the scribal work is inferior, is suggested that it is a copy of an earlier Greek work from mid-2nd C, and appears to have connections with both the Gnostic Gospels of Thomas and of Phillip.  King has used the appelation “gospel” only to identify the fragment as a means of describing it. \nIf the fragment is proved to be authentic, that is 4th C, then it might be interpreted as reflecting a possible conflict within a particular gnostic sect as to the merits of celibacy versus marriage.  This conflict was also apparent within early Christian orthodoxy, because of the early expectation of the Parousia.  Paul himself although allowing marriage, seems to have considered celibacy a better life option.  By asserting that Jesus himself was married, the original author whoever it might have been, would be attempting to make a claim to validate marriage within his sect. \nThe general consensus among scholars is that Jesus did remain celibate, the lack of any reference to a wife itself being strong negative evidence of this. \nBy following the various links in the original posting above, you can come across some rather cute witticisms about Jesus being married, sample comments: “I can’t take you anywhere; we go to the temple and you topple the tables”; “So you’re a carpenter; then fix up the kitchen cupboards!” Etc.\n\n","date":"September 20, 2012 at 2:15 am","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","id":"comment-16551","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Hot New Topic: The Wife of Jesus","post":"Does it matter? I suppose not if you don’t believe the church is his bride. How could he be a perfect sacrifice after he had become “as one” through marriage with a woman?\n\n","date":"September 20, 2012 at 7:30 am","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","id":"comment-16569","author":"ChrisB","site":"shroudstory"},{"title":"Hot New Topic: The Wife of Jesus","post":"Because I truly believe Jesus was a real human being, I would be offended at all if he really had a wife and that wouldn’t change a thing concerning my belief that he was the Messiah and the one who revealed the true God (i.e. Love).\n\n","date":"September 20, 2012 at 8:53 am","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","id":"comment-16572","author":"Yannick Clément","site":"shroudstory"},{"title":"Hot New Topic: The Wife of Jesus","post":"He is fully God and man. If he had a wife, then what need was there for him to be born of a virgin, whom we are told was free from original sin? It is heresy and attempts to deny the Son of God his rightful place. It shouldn’t be overlooked but condemned.\n\n","date":"September 20, 2012 at 5:46 pm","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","id":"comment-16623","author":"ChrisB","site":"shroudstory"},{"title":"Hot New Topic: The Wife of Jesus","post":"If it proves to be a forgery then it’s not a religious issue but possibly a matter for fraud police if the owner was hoping to sell it. \nIf it’s not a forgery, then you have to understand a few things about pseudo-epigrapha in order to comment on them.  In the first and second centuries, any Christian or heretic could write what they wanted, as there were no ecclesiastical controls before a movement towards canonicity became established.  The Gnostic movement under Marcion and Valentinus was particularly active in this, and was roundly condemned by Iraeneus.  Other Christian apocrypha sought to resolve certain conflicts, or were highly inventive to express certain theological points.  For example, one notorious writing has two mid-wives at Jesus’ birth expressing amazement that Mary was still a technical virgin (presumably intact hymen) in order to confirm the doctrine of the virginal birth, and reflecting the cultural context of the time.  One mid-wife puts her hand in and it withers as a punishment for this impertinence. \nIf the fragment is genuine, I would see it in the context of an internal conflict within a gnostic sect as an attempt to settle a dispute about whether its members shoud marry or not.  By saying that Jesus was married it would seek to establish marriage as a valid life option for them.  \nThe vast majority of exegetes affirm that Jesus was not in fact married.\n\n","date":"September 20, 2012 at 3:59 pm","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","id":"comment-16604","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Hot New Topic: The Wife of Jesus","post":"Although not acceptable doctrine, “The Gospel of Philip” (Gnostic scripture) states Mary Magdalene was the companion of Jesus and that He would often “kiss her on the lips.”\nWithin the pages of the Gnostic text, “Pistis Sophia” (G.R.S. Mead translation),\nMary Magdalene was exalted above all the disciples of Jesus and He recognized her as being completely in tune with His thought process.\nIn Canonical scripture Jesus appeared to Mary Magdalene first, and we all know she wasn’t a prostitute, but rather Pope Gregory was responsible for this slander.\nWhether Mary Magdalene was wife or companion, Jesus considered her to be more special than any of the others.\n\n","date":"September 22, 2012 at 3:05 pm","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","id":"comment-16755","author":"Angel","site":"shroudstory"},{"title":"Hot New Topic: The Wife of Jesus","post":"Quote fron Angel : “we all know she wasn’t a prostitute”.  I’m not sure anyone can pretend having a definitive answer on that question.  In the Gospel, it’s not clear at all and it would be a very bad mistake to take anything that comes from all the Gnostic Gospels as being historical (in the pure sense of the word).  So, my point of view on that question is :  We can’t be sure !  Don’t forget that the Gospel of St Luke clearly states that Jesus had chase 7 demons out of her !  And we all know that this number 7 is truly symbolic in the bible and often means an infitine quantity…  This could well be an hidden reference about the fact that she was really a prostitute or some kind of nymphomaniac.  Or this could be taken at first degree and interpreted literally, i.e. that she was really possessed by 7 demons.  The bottom line is this :  We can’t be certain if she was or not a prostitutes.  There’s no clear ancient sources that can be very helpful concerning this question, except maybe for some possible interpretation that we can make of the mention of her we found in the Gospel of St Luke.\n\n","date":"September 22, 2012 at 6:00 pm","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","id":"comment-16763","author":"Yannick Clément","site":"shroudstory"},{"title":"Hot New Topic: The Wife of Jesus","post":"\nChrisB :He is fully God and man. If he had a wife, then what need was there for him to be born of a virgin, whom we are told was free from original sin? It is heresy and attempts to deny the Son of God his rightful place. It shouldn’t be overlooked but condemned.\nAgreed!\nR\n\n","date":"September 22, 2012 at 3:22 pm","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","id":"comment-16756","author":"Ron","site":"shroudstory"},{"title":"Hot New Topic: The Wife of Jesus","post":"Here’s my reply to ChrisB somewhat very dogmatic comment (#11) that he wrote in reply to one of my previous comment :\nI am a liberal Christian who don’t believe in the virginal nativity of Christ.  For me, this has badly contributed to false the perception of many Christians over the years versus the FACT that Jesus of Nazareth (even if he was truly divine in nature) was also TRULY HUMAN in nature (meaning that he shared within himself both natures).  For me, the Shroud is a very good piece of evidence to understand this most important belief :  Jesus was a real human being with a real human corpse who react like anyone else and WHO DIED LIKE ANYONE ELSE.  And because of this, I don’t see any good reason to look elsewhere than in the direction of a natural cause for the body image that would have come from some kind of interaction between his tortured corpse and his linen Shroud.  \nThis story about the virginal nativity has been showed by most theologians and bible scholars as being influenced greatly by many ancient legendary tales of ancient people that present also a virginal nativity of the heroic character of the story (that could be considered, in some legend, as being a demi-God).  I completely agree with this point of view that has been described brightly by Raymond E. Brown and other scholars.  In fact, I don’t trust in all the supernatural dogmas associated with Mary, the mother of Christ.  I have a great sense that this was all made up to elevate her on the single base that her son was the Messiah.  Don’t get me wrong, I don’t doubt that Mary was a very good spiritual person and all this, but this thing that the Catholic Church has done of her (to elevate her almost as the same level than a Greek Goddess) is something that I just can’t stand.\nAnd believe me, here in Quebec (and probably also in many more liberal countries in Europe), there are a lot of Catholics who share the same view as me.  The base of my faith is the resurrection of Christ and the revelation he made of the true God (i.e. Love and Mercy) by all his actions and sayings and ultimately, by the free gift of his life (not as a sacrificial thing but as the greatest statement ever made that God is Love and Mercy and nothing else).  \nThat’s my belief and I’m sure you don’t share it with me.  In the end, who cares ???  Anyone’s free to belief what he want, right ???\nAll I say is if it would be proven someday that Jesus was born like any other men and if he really had a wife, that wouldn’t change one iota of the personal belief I just describe to you.\n\n","date":"September 22, 2012 at 5:52 pm","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","id":"comment-16762","author":"Yannick Clément","site":"shroudstory"},{"title":"Hot New Topic: The Wife of Jesus","post":"Interesting Yannick. It strikes me that you tend to go for more naturalistic explanations which leads me to think why you would accept the accounts of the resurrection as opposed to the body being stolen?\n\n","date":"September 22, 2012 at 6:43 pm","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","id":"comment-16768","author":"ChrisB","site":"shroudstory"},{"title":"Hot New Topic: The Wife of Jesus","post":"Simply because I believe in it.  I don’t have any problem to believe in an afterlife for me, so why should I have any problem to believe in Jesus resurrection ???\nIt’s not because I’m a rational Catholic that it makes me a “materialist” like most of the modern pagans are.  I think you can be rational while being also spiritual.  I don’t see any contradiction with these 2 terms.  In fact, I think God wants us to use our brain as much as our hearts and I just want to stay grounded in my faith because I saw too many persons being caught by the “illuminati” syndrom !  And this is true particularly here, in the Shroud world.\nIn the end, I would say that I believe in miracles but not blindly and not everytime.  Look, the Catholic Church is as prudent as me regarding this aspect of the question !!!!  I don’t think I’m so off-track being a rational and liberal Christian who don’t take anything for granted blindly just because IT IS WRITTEN !!!! \nHistorically speaking, for any ancient book (the bible is no different), we must always take good note of the CONTEXT.  That’s the key for a better understanding…  And when it comes to all the dogmas concerning Mary (especially when it comes to the virginal nativity), what I see is great external influence on this story that we found in Luke and Matthew that tells me that it was probably “made up” in order to comfort the truth that Jesus was truly the Messiah.  In other word, a “lie” (I use this term with prudence here) was probably used to comfort an higher truth.  That’s how I see it.  \nAnd note that the most probable manmade Mandylion and other so-called miraculous imprints of the face of Jesus that were most probably other false relics made around the 6th century by the Orthodox Church were used in the same exact way !  This “lie” (pretending that they were real miraculous imprint of Christ) served the Church to comfort an higher truth (that Jesus really had 2 natures in himself, a divine and a human nature as well).  Don’t forget what was the historical context of the time in Middle East :  There was a bunch of heretical groups (like the Monophysits who, by the way, were truly present in Edessa) who did not want to admit the 2 natures of Christ and who were only believing in his divine nature (the Gnostics were another groups who shared similar beliefs).  In that context, the probability that the official Church used a lie (the so-called miraculous images of the face of Christ) to comfort his doctrine about the Incarnation and the 2 natures of Christ has to be estimate as VERY HIGH and that’s exactly how Paul Vignon and others saw the situation.\n\n","date":"September 22, 2012 at 7:04 pm","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","id":"comment-16770","author":"Yannick Clément","site":"shroudstory"},{"title":"Hot New Topic: The Wife of Jesus","post":"Quote from Yannick Clement: “This could well be an hidden reference about the fact that she was really a prostitute or some kind of nymphomaniac. Or this could be taken at first degree and interpreted literally, i.e. that she was really possessed by 7 demons. The bottom line is this : We can’t be certain if she was or not a prostitute.” \n****Obviously there was Biblical evidence that Mary Magdalene was not a prostitute or the church would not have removed the label.\nAn excerpt from the link below states the following:\n“As a follower, Mary was one of many women that accompanied Jesus during his travels, most of whom are believed to have been wealthy. During his journey, he was visited by two women, the unnamed sinner in Luke 7 and Mary of Bethany, both of whom anoint his feet and dry them with their hair, similar to the way Magdalene anointed him shortly after his death.. In 591, Pope Gregory the Great stated that all three were in fact one woman, Mary Magdalene, and this is how she became labeled as a prostitute, or the unnamed sinner. However the Second Vatican Council removed the prostitute label in 1969 after much debate and Biblical evidence that there was more than one Mary and that Mary of Magdalene and the unnamed sinner were two different figures.” \nhttp://departments.kings.edu/womens_history/marymagda.html\n\n","date":"September 23, 2012 at 12:03 am","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","id":"comment-16786","author":"Angel","site":"shroudstory"},{"title":"Hot New Topic: The Wife of Jesus","post":"I failed to further mention women with the same first name were distinguished from each other by the town from which they originated. \nWith this in mind, how are Mary of Magdala and Mary of Bethany the same woman?\n\n","date":"September 23, 2012 at 5:08 pm","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","id":"comment-16808","author":"Angel","site":"shroudstory"},{"title":"Hot New Topic: The Wife of Jesus","post":"I agree that this conclusion seem unlikely.  But the connection between Mary Magdalen and the anonymous sinful woman in the Gospel of Luke is not at all impossible…  I don’t say that it’s true, I just say that it is possible.\n\n","date":"September 23, 2012 at 6:43 pm","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","id":"comment-16817","author":"Yannick Clément","site":"shroudstory"},{"title":"Hot New Topic: The Wife of Jesus","post":"All we can state for sure about Mary Magdalen is the very probable fact that she experiment a very intense grace of conversion when she met Christ.  That’s all we can say with a very high degree of insurance and from my perspective, THAT’S ALL THAT REALLY MATTER !  What she was doing in her life before that conversion (and even after) is not at all what’s matter in regard of this women !  What truly matter is the fact that his life and view of the world CHANGED DRASTICALLY when she met Jesus and this event in her life was so intense that she decided to follow him until the end (his crucifixion) and after (the Resurrection).  And the fact that Christ appeared to her first is a sign that she was probably one of his disciple that was the most open heart versus the profound message of Christ, which is : God is Love and Mercy and nothing else !!!\n\n","date":"September 23, 2012 at 6:31 pm","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","id":"comment-16816","author":"Yannick Clément","site":"shroudstory"},{"title":"Hot New Topic: The Wife of Jesus","post":"Yannick, I will agree with you when Mary confronted Jesus, concerning sin, her life was changed.  \nThis would be the case with any of us, considering Jesus’ remark, “Let he who is without sin cast the first stone.”\nI was reading a Greek Orthodox blog on this subject and I saw these two comments by Mr. Niko T (Greek Orthodox USA) on the subject of Magdalene with demons.\nhttp://www.monachos.net/forum/showthread.php?6721-Mary-Magdalene-and-the-seven-demons\nThe following life of St. Mary Magdalene in Greek (http://www.impantokratoros.gr/C92EE7A9.el.aspx) includes a whole section on the misconception that she was the sinful woman in the Gospel. Here is a pertinent quote from there by St. Modestus of Jerusalem (from a work of his: “On the Myrrhbearers”) and my translation:\n“Και στον άγιο Μόδεστο, Πατριάρχη Ιεροσολύμων (α’ ήμισυ ζ’ αιώνος) διαβάζομε: «Τον συμβολικό αριθμό επτά και όταν πρόκειται περί της αρετής και όταν πρόκειται περί της κακίας, βλέπομε να χρησιμοποιή η Αγία Γραφή. Ευλόγως, λοιπόν, διαλέγει ο Σωτήρας την Μαρία την Μαγδαληνή, από την οποία εξέβαλε επτά δαιμόνια, για να εκδίωξη μέσω αυτής, τον άρχοντα της κακίας (διάβολο) από την ανθρώπινη φύση. Διότι οι ιστορίες διδάσκουν την Μαγδαληνή αυτήν δια βίου παρθένον. Και αναφέρεται μαρτύριον της Μαρίας Μαγδαληνής, όπου γράφεται ότι για την άκραν παρθενίαν και καθαρότητά της, φαινόταν στους βασανιστές της, σαν καθαρό κρύσταλλο».”\n“And according to St. Modestus, Patriarch of Jerusalem (1st half of the 7th Century), we read: “The symbolic number seven we see used in the Holy Scriptures indicating virtue and indicating evil. Most likely [Ευλόγως], therefore, it is said that Mary Magdalene, from whom [Christ] cast out seven demons, that the Savior drove out from her the prince of evil (the devil) from the human nature. For the stories teach that this Magdalene was a virgin through her life. And it is mentioned that [at] the martyrdom of Mary Magdalene, as is written, that on account of her utter virginity and purity, she appeared to her torturers, as a pure crystal.” \nAnd Niko’s second comment on the subject\n“The same view is presented on the seven demons by Theophylactos of Bulgaria in his Ermenia on the Gospel according to St. Luke: “As there are seven spirits of virtue thus there are against them seven spirits of evil. As there is a Spirit of fear of God, thus there is against it a Spirit of a lack of fear of God. There is a Spirit understanding, there is against it a Spirit of a lack of understanding, and the same with the rest of them. Unless, therefore these seven spirits of evil leave from the soul, it’s not possible for one to follow Christ. For first Satan must be removed from him, and then Christ will inhabit him.” \n***It was mentioned that Mary Magdalene was a virgin.  If God has 7 spirits (indicating goodness), then He would necessarily have to cast out 7 demons (indicating evil) on any mortal He may have chosen to be His follower or carry His message. \nBlinding Paul, on the road to Damascus, might also have been a way of casting out demons or a refining process.\n\n","date":"September 24, 2012 at 4:06 pm","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","id":"comment-16876","author":"Angel","site":"shroudstory"}]
