[{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"According to Wikipedia, “rigor mortis is one of the recognizable signs of death, caused by chemical changes in the muscles after death, causing the limbs of the corpse to become stiff and difficult to move or manipulate.[1] In humans, it commences after about three to four hours, reaches maximum stiffness after 12 hours, and gradually dissipates from approximately 24 hours after death.”  So one could say that the TSM was in a state of rigor mortis when taken down from the cross but when laid in the tomb after burial preparation, his arms and hands became conveniently relaxed to extend in modesty.  Who moved those hands in that moment may present another question.\n\n","date":"February 7, 2014 at 7:05 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77222","author":"Annette Cloutier","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Annette,\nHis arms did not become “conveniently relaxed.” The rigor mortis was forcibly broken when he was taken down from the cross so that he cold be buried. The was no “convenience” about it. As a matter of fact, displacement in his shoulders may have indicated the deliberate forcing of the arms into the position seen on the Shroud.\nThere is an enormous amount of literature on the subject and one book that’ available on Kindle is the last one by forensic pathologist, the lat Fred Zugibe.\nThe interesting ting is that Zugibe differs from Bucklin and other pathologists on the way the mechanism of crucifixion cause death. However, here seems to be a consensus that the image shows a state of rigor mortis and that as  Zugibe explains, the movement of the arms to the position demonstrates the “breaking of the rigor mortis.\nAs to Baden, he is the forensic pathologists of choice for elites dealing with uncomfortable questions.\nFor example, he testified in favor of the “lone gunman theory” of the JFK assassination. There is significant evidence testified to by other pathologists that the wounds to JFK’s head were not caused by a single billet from the back of JFK. Among those who held that opinion was(is) Cyril Wecht. \nThe issue with Baden is how much time did Baden actually spend on examining the Shroud and where did he publish? I would like to know. Is he a member of Scientific Investigation of Claims of the Paranormal (CSICOP) which has been dedicated to disproving claims of paranormal events. Among their targets has been the Shroud of Turin and they have written much nonsense about the Shroud and they believe in the discredited carbon dating as much as some believe that Christ didn’t die on the Shroud but traveled to India after the Crucifixion. Kind of a “Cook’s Tour” I guess.\nIn any event, some excerpts from Zugibe’s final book.\n“If a person is in complete rigor mortis, the only way to change the position of a limb at a joint is to break the rigor, a term referring to the forcible bending of a limb at any joint. For example, if an elbow is in rigor mortis and bent to an angle of 45 degrees, straightening the arm is possible by forcibly straightening it. The greater the muscular development, the greater the force required to break the rigor.”\n       *  *  *\n“This fact has medico-legal significance to determine if a body has been moved after rigor mortis set in. For example, if a body was found lying flat with the legs suspended in the air, it would be immediately obvious that the body was moved from a position where the legs were resting on something.”\nFrederick T. Zugibe. The Crucifixion of Jesus, Completely Revised and Expanded: A Forensic Inquiry (Kindle Locations 2311-2313). Kindle Edition.\n\n","date":"February 7, 2014 at 8:26 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77234","author":"John Klotz","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Annette, \nI have this vague feeling that you are native French speaker. Could you let me know what your E-Mail address is. I may have something on the Shroud where I could use some advice on French. I can not share it with he blog for another few months or so.\n\n","date":"February 10, 2014 at 7:57 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78020","author":"John Klotz","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Sure John:  CLublu2@comcast.net.  My French is rusty… at Harvard I passed the exam (1978) but after my father died (1982), I never used it again.  But, I’m sure I can translate this for you.\n\n","date":"February 10, 2014 at 10:08 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78048","author":"Annette Cloutier","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"John, You correctly pointed out the Dr.Baden- JFK lone assassin link and rightfully stressed the reports by Drs. Bucklin and Zugibe.\nAs for Jesus in India, this rubbish gained worldwide attention due to the agenda-driven work of Holger Kersten, his book cover showing the Shroud face with eyes wide open. Actually Kersten became a Buddhist and wanted to put Jesus as no. 2, however he based most of his work on spurious and unfounded reports.\nFor the debunking, see:\n http://holyshroudguild.org/uploads/2/7/1/7/2717873/the_quest_for_jesus_in_shroud_research.pdf.pdf\n\n","date":"February 7, 2014 at 8:52 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77237","author":"Louis","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Louis,\nMany thanks for the link debunking Jesus in India nonsense. I find it very valuable.\n\n","date":"February 7, 2014 at 9:51 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77244","author":"John Klotz","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"How does the rigor/not rigor arguement affect the bas relief scorch theory – if at all?\n\n","date":"February 7, 2014 at 10:24 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77253","author":"David Goulet","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"You’re welcome, John.Thanks for the kind remarks. The trouble in this field is that ideology —    based on distorted history, where facts are cunningly twisted — is imposed on findings.\n\n","date":"February 7, 2014 at 10:28 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77254","author":"Louis","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"David,\nThe bas relief scorch theory is intellectual junk and its principal proponent on this  blog is also the principal proponent of the deMolay theory which is also intellectual junk. Your and he are of course entitled to your own opinion, but as they say, you are not entitled to  your own facts.\n\n","date":"February 7, 2014 at 10:41 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77261","author":"John Klotz","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Brilliant!\n\n","date":"February 7, 2014 at 10:55 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77264","author":"Annette Cloutier","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Thanks for the gracious answer, John. I was asking because the answer may actually be problematic for the scorch theory.\n\n","date":"February 7, 2014 at 11:57 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77277","author":"David Goulet","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"What is much more problematic for the scorch “theory” David is the evidence coming from the blood and serum stains, as well as the ultra-superficiality of the image everywhere, no matter if it’s a dark zone or a lighter one…  Much more problematic…\n\n","date":"February 7, 2014 at 4:36 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77329","author":"Anonymous","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"David,\nI apologize if I was a little short in my response to last posting.  I have been working on this controversy over the shroud for more than two years.  I know there are a lot of people who’ve spent much more time on this and I have.  What I don’t have time are  issues that are clearly leading up blind alleys and may in fact be planted as deliberate distractions.\nI believe that Jacques  De Molay and Leonardo da Vinci when it comes to the shroud are distractions.  It is time for them when it comes to the shroud to be assigned to the dustbin of history.  I also have a feeling that the propagators of these theories may be distracting us on purpose.\nDe Molay and Leonardo and become “usual suspects of mystery.” That’s a paraphrase of one of the widely quoted lines from the movie Casablanca.  Inspector Renault (Claud Rains) having just witnessed Rick (Humphrey Bogart) shoot SS Major Strasser, says to a car full of his policemen that pulls-up: “Major Strasser has been shot, round-up the usual suspects.” It today’s parlance, one might say that line has become viral.\nFor someone to gain attention, it’s always great to say the Templars, or Jacques de Molay and Leondardo did it. It’s always good for some attention and some book sales.\nBut it is a distraction. Leonardo did not photograph the Shroud and DeMolay who was roasted on a spit and then burned at the stake is not the man in the Shroud.\nMy concern is that the proponents of these theories have their own agenda besides just making a few bucks or pound sterling. They want to distract us from the fundamental   truth that Jesus Christ existed and that he suffered a horrible death. His crime was to preach love and, to many, his Resurrection gives courage to persevere in love no matter what the cost. \nNow I have to get back to the real story.\n\n","date":"February 7, 2014 at 6:22 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77343","author":"John Klotz","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"When one says he could not tell and other equally or better qualified folks say there is evidence, we’d obviously go with the majority of experts in that field.  For Annette, it’s not that difficult for the people burying him to break the rigor mortis.\n\n","date":"February 7, 2014 at 4:20 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77325","author":"Andy","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Assuming the TS Man is Jesus, how do we know at what time exactly the Resurrection took place? Is it being assumed that it was timed to be some minutes before the disciples arrived at the tomb on early Sunday morning? We have “Holy Saturday”, which is based on the discovery of the empty tomb on Sunday, but how do we know that the Resurrection did not take place on Friday night or on Saturday? Who knows, God may have wanted to reveal the good news in sequence, first the discovery of the empty tomb, then the appearances, not the other way round, perhaps to reduce the shock for us humans.\n\n","date":"February 8, 2014 at 8:54 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77471","author":"Louis","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Jesus dies: 3:00 pm Friday\nBurial completed before: 7:00 pm Friday (sunset)\nEmpty tomb discovered: 5:00 am Sunday (early morning)\nResurrection window: 7:00 pm Friday – 5:00 am Sunday. 34 hours.\nRoigor mortis can begin set in quite rapidly after violent death in hot conditions, but I cannot find out how rapidly it achieves completion. It is often (Google/wikipedia) said to take 12 hours to develop, beginning with the facial muscles and ending with the legs. How likely is it that the legs were in a state of rigor when the body was removed from the cross?\nAny patholgosts out there?\n\n","date":"February 8, 2014 at 10:43 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77490","author":"Hugh Farey","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"“patholgosts” ?? Sorry, “pathologists,” of course.\n\n","date":"February 8, 2014 at 10:44 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77491","author":"Hugh Farey","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Good question. I would think that rigor would not have set in until the body had been laid in the tomb. But could it be something other than rigor that accounts for rigidity when the body is taken down from the cross? Did crucifixion cause the muscles to go taut (advanced dehydration and over exertion causing severe cramping/tautness)?\n\n","date":"February 8, 2014 at 1:33 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77515","author":"David Goulet","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Hugh, Polish Wikipedia claims that rigor may start immediately after death, if victim was performing intense physical effort immediately before death (or had convulsions and temperature) -fighting for life while being hanged on the cross qualifies, I think.\n\n","date":"February 8, 2014 at 3:59 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77537","author":"O.K.","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Yes rigor mortis takes usually 12 hours to develop.\nBut “after violent death, rigor mortis begins quite rapidly (usually within 1 to 2 hours after death” (Zugibe, the crucifixion of Jesus, 2005).\nThis is called “cadaveric spasm”.\n“Likewise, the legs, which were in slightly bent position, would maintain the same type of cadaveric spasm and subsequent rigor mortis prior to being taken down from the cross” (idem).\nAccording to Zugibe, there is no problem at all.\nTherefore, the scenario is:\nJesus died: 3 pm\nRigor mortis (cadaveric spasm) began between 4 and 5 pm and achieves completion quickly (including the legs). Jesus was still on the cross: “likewise, the legs, which were in slightly bent position, would maintain the same type of cadaveric spasm and subsequent rigor mortis prior to being taken down from the cross” (idem)\nProbably between 6 and 7 pm, Jesus’ body was taken down from the cross. The rigor mortis was complete.\nBurial completed before 7 pm: just before burial, rigor mortis was broken. ” When the man of the Shroud was taken down from the cross, the rigor mortis was broken in the arms and legs in an attempt to flatten out the body prior to placing it in the Shroud” (idem).\nInterestingly (my own point of view), the fact that on the Shroud there are some blood stains in the area of the back of the knees and no image suggests that the breaking of the legs failed. They tried (explaining the blood stains) but they failed (explaining the bent legs).\nDavid:  “How does the rigor/not rigor argument affect the bas relief scorch theory – if at all?”     \nI can’t see how any kind of bas relief scorch theory could explain the bent position of the legs. It seems to me impossible.\n\n","date":"February 8, 2014 at 5:27 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77552","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"There’s something called cadaveric spasm, which is very rare anyway and almost unheard of in the legs. It seems to be mostly associated with smaller groups of muscles such as the wrist or jaw.\n\n","date":"February 8, 2014 at 3:47 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77535","author":"Hugh Farey","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"An entertaining volume on Google Books called “Textbook of Forensic Medicine and Toxicology” by by Nagesh Kumar Rao, gives a table of rigor mortis onset:\nEyelids: 3-4 hours\nFace: 4-5 hours\nNeck and trunk: 5-7 hours\nUpper extremities: 7-9 hours\nLegs: 9-11 hours\nFingers and toes: 11-12\nSay everything took half as long in extreme trauma? Or one third as long? You’d still be pushing your luck to claim that rigor mortis in the legs had set in by the time Jesus was lifted down from the cross. It’s a shame that Bucklin and Zugibe are no longer around to comment.\n\n","date":"February 8, 2014 at 4:06 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77539","author":"Hugh Farey","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"It’s a shame that Bucklin and Zugibe are no longer around to comment.\nBut neither of them had any problems with the questions discussed here.\n\n","date":"February 8, 2014 at 4:08 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77540","author":"O.K.","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Hugh: It’s not a matter of half as long or one third the time. It’s how much ATP was in the muscles at the time of death. No ATP…no muscle contraction/relaxation. The muscle tissue stores carbohydrates (for energy) as Glycogen. In cases of extreme physical exertion there is no glycogen left in the muscle tissue because it has all been consumed. Glucogen is needed for ATP production.. i.e. extreme physical stress=no glycogen left= no ATP production= rapid Rigor Mortis. Dr. Zugibe mentioned a situation in which a victim was running for his life and was shot while running. he claims ( and I have no reason to doubt this)  that when he was called to the scene the victim was stiff in the running position. That means stiffness kicked in almost instantaneously. The timings listed above probably reflects average amounts of ATP in a normal situation, it’s a whole different story when the body has been through physical exertion before death, and it cannot be estimated by fractionation.\n\n","date":"February 8, 2014 at 4:46 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77545","author":"Mike M","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Well, that’s what I’d like to discuss with a pathologist. Although Jesus had been subjected to a lot of violence, he had not necessarily “used up” a lot of ATP. Carrying a patibulum may have been muscularly exhausting, but being pinned to a cross, however painful, may not have been, in the way that the viigorous struggles of a drowning man or someone running for his life may be. From my ignorance, I cannot deny that instantaneous paralysis of the legs may be possible, or even likely, but I’d like to know more.\n\n","date":"February 8, 2014 at 5:37 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77556","author":"Hugh Farey","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Hugh: I am not a pathologist, but I am a health care professional (pharmacist). This is not my speciality and I agree, a pathologist would help by weighing in here, but this is just my 2 cents. As Kelly indicated i believe it is a cumulative effect. One thing comes to mind that may help is with diabetics who are on insulin and suffer a hypoglycaemic coma. The treatment for this in ambulatory setting is a glucagon injection which can be administered by relatives or friends and it works by releasing glucose from glycogen stored in the liver. This is not the case with people who are suffering malnutrition. In that case a glucagon injection cannot be used because there is no glucagon stored in the liver. The bible doesn’t mention Jesus eating since the last supper and he was under extreme physical and emotional stress all night. He walked to gesthemani and  was up all night in prayer (for comparison, all his disciples couldn’t stay up with him because they were too tired)., sweating blood ( which happens under extreme stress) then they had to walk to Annas, then to caiaphas, back to pilate, Then to Herod and finally back to pilate, all this walking at the end of the day, instead of sleeping (I don’t know exactly how long but I am sure from the map it looks like a minimum 1.5 km each trip (just an estimate). He was being beaten and mocked all through this. Then he was scourged severely,  Scourging is enough to reduce a person into a pile of flesh. Mocking & beating  at the praetorium by a roman batallion (480-600 men heavy infantry) then he had to carry the cross to Golgotha. He couldn’t do it without the help of Simon, proving that he was completely consumed by then. I believe all this contributed to rapid rigor Mortis.\n\n","date":"February 8, 2014 at 8:51 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77601","author":"Mike M","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Correction: “there is no Glucagon stored in the liver” should be “there is no Glycogen stored in the liver”\n\n","date":"February 9, 2014 at 9:22 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77749","author":"Mike M","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"\nHugh Farey :\nWell, that’s what I’d like to discuss with a pathologist. Although Jesus had been subjected to a lot of violence, he had not necessarily “used up” a lot of ATP. Carrying a patibulum may have been muscularly exhausting, but being pinned to a cross, however painful, may not have been, in the way that the viigorous struggles of a drowning man or someone running for his life may be. From my ignorance, I cannot deny that instantaneous paralysis of the legs may be possible, or even likely, but I’d like to know more.\n\nI’m not an “expert”, only my opinion, but much went on pre-patibulum carrying: sweating blood in the Garden, beating, scourging, assumed lack of/poor sleep & feeding, dehydration, etc.  Then crucifixion.  The cumulative affect should be considered here.\n\n","date":"February 8, 2014 at 6:15 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77570","author":"Kelly Kearse","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"All the opinions above may be true, for all I know, but, as regular readers will understand, I would like to know how true they may be. Forensically, there is much much literature about the upper body, particularly the arms and hands, which can be diagnostic about the position and cause of death, but there is little about the legs, although the hips are the last to go rigid, and the last to relax. There is an account, in ‘Legal Medicine and Toxicology,’ by R.L. Emerson, of a railway worker who was crushed by a wagon. “Rigor mortis began in twenty minutes after the accident; it was present in the head and trunk at that time, not having reached the lower portions of the body, but six hours later the whole system was in a state of strong muscular contraction.” Any documented advance on six hours?\n\n","date":"February 9, 2014 at 4:56 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77692","author":"Hugh Farey","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"to get an idea of stress on the thighs put a ladder vertical (not leaning at all ) , then get on it and turn facing away from the ladder. The pain in the thighs becomes unbearable after a while because you can not straighten your legs. try it I have.\n\n","date":"February 9, 2014 at 1:56 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77814","author":"paul","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Hugh,\nYou are a classic pseudo-skeptic. You have a pre-existing determination rejecting authenticity and you then refuse to accept any contrary opinion on an important issue such as rigor mortis. Dan began this thread with a citation of several individuals who are well qualified and some of whom have spent decades dealing with the medical evidence that exists on the Shroud of a horribly beaten, tortured man who died by crucifixion. \nNeither you nor I possess their medical qualifications. We do possess a library card or access to the web. The does not make us expert in this SPECIFIC case. I believe based upon your posts that there is no evidence you will accept supporting authenticity of the Shroud. One thing your pseudo-skepticism has done is produce some interesting and relevant posts from individuals with experience in the medical field. That’s a plus.\nThe only support you have is a statement from Michael Baden who was fired as NYC Medical examiner by Ed Koch. I did 10 seconds of research on this for this post because I came across an entry, which for people on this side of the Pond says it all: “He is also the Forensic Science Contributor for Fox News Channel.” There have been surveys that have found Fox News viewers to be the most ill-informed class of Americans.\nOthers have pointed out the inconclusive nature of his opinion. Against the weight of authority cited by Dan Porter and the very informative posts in this thread from individuals trained in medicine and one with hands on EMT experienced dealing with trauma victims, you can only cite “I read a book” and the books you cite have nothing to do with the crucifixion of the Man in the Shroud as far as I can tell.\nThere are exciting things happening in the world of the Shroud in the next two years and we may be able to influence them. Take the concept of multispectral digital imaging for example. Now there is something worthy of discussion.\n\n","date":"February 9, 2014 at 5:42 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77702","author":"John Klotz","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"John: one thing that really speaks volumes about Baden’s assessment is that he completely dismissed the side wound as being “an area of darkening” in the cloth and not an injury. If he missed that much of a blood stain, it makes me doubt one of two things. His Judgment or the quality of the images which he examined.\n\n","date":"February 9, 2014 at 9:39 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77752","author":"Mike M","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Mike M.\nThanks for the comment. One of the weakness of he blogosphere is that someone can make a comment that can be refuted with relative ease – if you take the time. Baden is a rich, controversial dish. To do a thorough debunking of him would take time. Then the issue is whether it’s worth the time?\nBy chipping in with a bit of truth here and I bit of truth there, we can often get it done. I am impressed by the fact that with this particular issue, there have been so many insightful contributions. Maybe not just impressed but humbled, too.\n\n","date":"February 9, 2014 at 10:30 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77762","author":"John Klotz","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"As usual John Klotz is so wide of the mark that it is remarkable he ever hits the wall the target is pinned on, let alone the target itself. As usual he invokes the term “pseudo-skeptic,” and has claimed to adhere to Marcello Truzzi’s definition thereof. Truzzi says that scientific skepticism is the demand that ideas satisfy a burden of proof before being granted validity, whereas pseudo-skepticism is a simple assertion that a belief is factually wrong without providing any proof thereof.\nA more easily understood definition of a pseudo-skeptic, provided here by Charles Freeman, is the someone who claims that they are sceptical about something when in fact they believe it to be true.\nNeither of these, of course, describes my position at all. Like all good scientists, my exploration of any idea is rooted in an attempt to disprove it, so that by rejection of the null hypothesis, it can be demonstrated valid.\nIn the case of rigor mortis, I cannot say that I can reject the null hypothesis. I have no pre-existing determination rejecting authenticity (quite the reverse), and I do not refuse to accept the findings of those pathologists who say that if the image on the shroud is that of a dead body, then it looks as if it is in a state of rigor mortis. So it does.\nBut note the conditional. The pathologists quoted above had two considerations. Firstly, could the image on the shroud have been produced in any other way than by being wrapped around a dead body, and secondly, what does the image tell us. Of their expertise as to the second I have no doubt, and neither should anybody else (even though they disagree quite markedly about things like the Space of Destot and the cause of death, which alone should make impartial observers aware that authority and experience alone are not infallible). As to their expertise on the first, of course they have none. The statement: “the shroud must be genuine because we don’t know how it could be faked” is no more valid than the statement: “the shroud must be fake because we don’t know how it was caused naturally.”\nProof is a very strong word in the scientific world. So much so that scientists seldom claim anything as proved. The nearest they get is a Law, such as the Law of Gravity, but even a Law is only a consensus of opinion about a description of the natural world that seems to hold true within a sphere of investigation. Where, or when, it is found wanting, it is amended or rejected.\nIn the Mathematical world, proof is irrefutable, provided that certain axioms are accepted. The only way to disprove a mathematical proof is to reject the axioms. If that can be done (and it often is) then the proof disintegrates.\nIn the legal world, proof is an everyday occurrence resulting in a conviction. Whether X killed Y is not a matter of global scientific consent, but simply persuading twelve people that the evidence of guilt is beyond reasonable doubt. In borderline cases this doubt may depend as much on the emotions of the jury and the persuasiveness of the lawyers as it does on the evidence. I have said before that I think the main difference between my approach to the shroud and John Koch’s is that our ideas of what is proved and what is not are based on different methodologies.\nAs for my “only support,” I knew nothing of Michael M Baden before this post. I do not know whether his appointment as CME, his subsequent dismissal, his successful claim for wrongful dismissal and the subsequent overturning of his claim on appeal had anything to do with his ability to decide whether a picture of a body shows rigor mortis or not. I believe John Koch is simply trying to blacken his name, in an attempt to discredit his scientific judgement. As it happens this seems unnecessary as he does not seem particularlty committed either way.\n\n","date":"February 9, 2014 at 8:06 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77736","author":"Hugh Farey","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Hugh,\nPersonal insults aside, I do find that you have a very narrow perspective. Charles Freeman is one person with a definition. His limited definition is how the term  first came into parlance. However, on this side of the Atlantic we have a great deal of back and forth about the nature of skepticism and one the prime philosophers of skepticism is Marcelo Truzzi. You can read an essay of his on skepticism at http://www.anomalist.com/commentaries/pseudo.html\nTruzzi is deceased so i assume everybody so minded can pile on him in safety. However, there is one statement that appears to have originated with him that is communally attributed to Carl Sagan who uttered it on TV some years after Trunzi first wrote it: “Exceptional claims demand exceptional evidence.” Someone told me that the statement sprang f=rom the work of the English philosopher Hume although I have not investigated it further than the Truzzi quote.\nI think when it comes to the Shroud the issue is, given the evidence, what is the exceptional claim? Authenticity or in-authenticity. Once you understand the facts that defeat the carbon dating, you might very well argue, that based on all the facts, the exceptional claim is in-authenticity.\nBy the way, I have found some Charles Freeman posts to be enlightening even when I  disagree with him. But when it comes to his rather limited definition of pseudo-skeptic, at least on his side of the Atlantic he is wrong.\n\n","date":"February 9, 2014 at 9:09 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77745","author":"John Klotz","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"“Exceptional claims demand exceptional evidence.”\nWell, I agree with you there.\nHere is a sheet with an image on it.\nA thinks it is a medieval painting. B thinks it is the burial cloth of the Son of God.\nShall we have a vote on the exceptional claim?\n\n","date":"February 9, 2014 at 9:21 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77748","author":"Hugh Farey","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Too simplistic, Hugh. And you know it. Can I see it before I decide? Can I think about it?  Can I look for other evidence?\n\n","date":"February 9, 2014 at 9:26 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77750","author":"Dan","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Yes I do. Just a sneaky one!\n\n","date":"February 9, 2014 at 12:47 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77794","author":"Hugh Farey","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Hugh,\nI believe that the claim that Shroud is of medieval original is not only exceptional but false. Can I prove the Resurrection at this point? Probably not although there some who have a reasoned proof. The point of Truzzi is that if I can’t “prove” the Shroud is authentic, that does not mean the Shroud has been proven to be inauthentic. It means that the claim of authenticity is unproved. There’s an important distinction there.\nOutside of the disputed, and in my belief flawed,carbon dating, what proof do you have that the Shroud is inauthentic?.\n\n","date":"February 9, 2014 at 10:04 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77757","author":"John Klotz","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"To be honest, I’m not half as convinced that the shroud is medieval as you are that it is genuine. I hope it’s been obvious for a long time that although I currently feel that the evidence aginst the radiocarbon dating is insufficient to discredit it, and that the historical, and more especially the pollen evidence is not firm enough to substantiate a 1st century origin, I am certainly open to all ideas, from the literally biblical to the Gnostic painting and even the homage to Jacques de Molay. I am not open to them all as equally strong, of course, and the biblical is a close runner – it’s just not quite there yet, in my opinion. I do not begrudge anybody his (or her, with Paulette and Annette on board) beliefs, I am not a fanatic anti-authenticist out to discredit Chrisitanity by debunking the shroud, nor any of the other things some of us are accused of, just not yet convinced that the carbon dating is wrong. That doesn’t mean it isn’t, just that I have not found sufficient evidence to say so.\nAnd, of course, my hypotheses ought to be challenged and disproved just as much as anybody else’s. My current one is that there was insufficient time between death and being taken down from the cross for rigor mortis to have a significant effect on the layout of the feet on the shroud. I have attempted to disprove it myself, but the best I can manage so far is the railway engineer whose total paralysis set in after six hours. Yes, I have read a book. I wish I could discuss the matter with a pathologist. I am interested in the suggestion that a running man could freeze solid in his running position instantly after being shot and would like to know more. Can anybody supply a reference to it?\n\n","date":"February 9, 2014 at 1:04 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77799","author":"Hugh Farey","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Hugh, thanks for including me on the side of authenticity… However, I do believe the Shroud is 1st century AD. (ca. AD 30ish) but I also believe the Gospels and Paul’s Epistles were written because of the Shroud, albeit the mention of the Shroud itself may have proven too much for anyone in the first centuries of Christianity to write about directly when it was the information and the energy that produced the Shroud which proved more culturally profound to write about (unlike today’s scientific culture).  Perhaps that’s where your issue of authenticity resides?\n\n","date":"February 9, 2014 at 1:41 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77809","author":"Annette Cloutier","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Annette, surely you don’t believe that a burial cloth led to the birth of Christianity? The apostles, including Paul, would have to taken it around while they were preaching, particularly about the Resurrection, but they didn’t do so.\n\n","date":"February 9, 2014 at 7:55 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77899","author":"Louis","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Hugh: it’s mentioned in Zugibe’s book ” the crucifixion of Jesus- A forensic inquiry” chapter 14, page 212, under the title “Rigor Mortis”.\n\n","date":"February 9, 2014 at 3:47 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77839","author":"Mike M","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Thanks Mike. I found it on Google Books. Given the specific nature of my inquiry it’s a pity Zugibe didn’t say more about it, such as how long it took to reach the legs, but its certainly indicative, if not quite your: “when he was called to the scene the victim was stiff in the running position. That means stiffness kicked in almost instantaneously.”\nThere’s another interesting case at http://link.springer.com/article/10.1007/s00414-013-0881-0. The abstract begins: “The question of whether instantaneous rigor mortis (IR), the hypothetic sudden occurrence of stiffening of the muscles upon death, actually exists has been controversially debated over the last 150 years.”\n\n","date":"February 9, 2014 at 4:16 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77846","author":"Hugh Farey","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Hugh, I am pretty sure I heard Zugibe phrase it differently in an audio interview. When you asked for reference I went to his book, not sure if I will find it there or not. I do realise he says “immediately” rather than my “instantaneously” but I think from the context it can be understood that he found him in the running/jumping over a fence position. If I find that audio I will let you know.\n\n","date":"February 9, 2014 at 4:37 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77853","author":"Mike M","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"The physiological variables comparing an individual running, drowning, or other instances and Jesus’s experience according to the gospel narratives are numerous and unknown.  Related in general, yes, but a direct comparison is difficult, to say the least (not that any of the above discussion, isn’t important & valuable-it is an interesting topic).   \nBut go upward as it were, is it likely that a a forger creating a statue or bas-relief would think to include specifics such as the bilateral expansion of the chest and distension of the lower abdomen-how evident would such details be in the normal (non-negative) image on the cloth?\n\n","date":"February 9, 2014 at 4:42 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77855","author":"Kelly Kearse","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Highly unlikely that someone would go to such details in an artwork (statue or painting), let alone demonstrate it in reverse. Who would appreciate these features Ina negative image?. I hope someone of the scorch camp would be able to mention an example from the Middle Ages that rise to that exactitude. I have other reasons to doubt the scorch hypothesis. The lack of fluorescence in UV light(while scorches did), the image invisibility in transmitted light(while scorches did) the mismatch of the colour of the lightly scorched fibres under the microscope with that of the image fibres(as demonstrated in Mario’s Shroudscope photomicroscope images). The lack of lumen discolouration in image fibres ( unlike scorched fibres, as demonstrated by Rogers) . The impossibility of having a full body scorch without over-burning/under-burning fibres. I also really enjoyed Thibault’s paper on scorching linen which demonstrated the fallacy of this claim.\n\n","date":"February 9, 2014 at 6:17 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77879","author":"Mike M","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Mike M,\nWhat a terrific post. To borrow a phrase from Annette, You’ve earned a “standing O.”\n\n","date":"February 9, 2014 at 7:17 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77888","author":"John Klotz","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Thanks John\n\n","date":"February 9, 2014 at 7:52 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77897","author":"Mike M","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"I agree that a medieval artist would be most unlikely to have faithfully copied a body in traumatic rigor mortis. However there was certainly a Byzantine artistic tradition showing quite a distorted body, with pronounced features such as a high chest and distended abdomen. Of course, if the shroud is authentic, it could be said that their features derive from the shroud, but those art historians who think it medieval think it fits in well with that artisitic tradition. It’s a moot point, I think.\n\n","date":"February 9, 2014 at 7:30 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77892","author":"Hugh Farey","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"\nHugh Farey :\nI agree that a medieval artist would be most unlikely to have faithfully copied a body in traumatic rigor mortis. However there was certainly a Byzantine artistic tradition showing\nquite a distorted body, with pronounced features such as a high chest and distended abdomen. Of course, if the shroud is authentic, it could be said that their features derive from the shroud, but those art historians who think it medieval think it fits in well with that artisitic tradition. It’s a moot point, I think.\n\nIn such depictions are the distortions specific for Jesus, or are other figures similarly morphed-Was the artist’s intent to single out those details or is it in keeping with the overall style-are these features really that discernible in the light-version of the image?  Is the abdomen depicted as distended or more akin to showing a six-pack of abs?\nFor myself, I’m not sure it can be objectively dismissed as a moot point, but I respect your opinion.\n\n","date":"February 9, 2014 at 7:51 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77896","author":"Kelly Kearse","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Compare also with depictions of Adam & Eve-alive & kicking, with chest, abdomen visible; also John the Baptist, done during this time period-more a hallmark of artistic style, or intentional depiction of rigor?  Points, questions are rhetorical, a type of PostScript to comment #49-seems a big stretch, IMO, but to each his own.  \nGot to go-the Beatles are coming!!!  The Beatles are coming!!  50 years ago-what a game changer…\n\n","date":"February 9, 2014 at 8:35 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77905","author":"Kelly kearse","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Adam and Eve! I wish I’d thought of that. I was trying to find Byzantine bodies of people other than Jesus, but they all tend to be clothed. A quick flick through Google shows some more or less naturalistic versions of Adam and Eve, but many which are more stylised, with unnaturally high pectorals and either a well defined six-pack, or a distinct gap (often showing the ribs) between pecs and abdomen, which is more distended. http://classicalchristianity.com/wp-content/uploads/2012/04/the-creation-of-adam-monreale.jpg shows it well.\nHas anyone written a thesis on muscular depiction in early Byzantine Art, I wonder!\n\n","date":"February 10, 2014 at 4:31 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-77993","author":"Hugh Farey","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Michael Baden, deputy chief medical examiner of New York for Suffolk County) only said : «Blood never oozes in nice neat rivulets, it gets clotted in the hair. The anatomic accuracy is more what Michelangelo would have done in a painting than what actually happens to a body».” (Cfr: Marvin M. Mueller, reply to William Meacham “The Authentication of the Turin Shroud: An Issue in Archaeological Epistemology”, http://www.shroud.com/meacham2.htm ). \nThis is a very simple proof that the image is not a copy or imprint of a corpse on a sheet. You sindonists dislike to be reminded this. I cannot blame you. \nIt is impossible to make a comprehensive autopsy on a more or less vague image. One of the signers of the works cited above did it once with a photograph in a court. He did a big mistake.\nFinally: the supposed rigor mortis is irrelevant. It is a theory that tries to explain why there is not crushing in the parts of the body that would rest on the slab. Dr. Lavoie clearly dismissed this assumption: no rigor mortis prevents to be crushed the body parts that are resting on the slab. Because neither hair, nor fat, and nor skin are affected by rigor mortis. \nSo the discussion of rigor mortis seems irrelevant.\n\n","date":"February 10, 2014 at 7:17 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78018","author":"David Mo","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Your assuming the body was resting on the slab itself and not on something between the body and the slab. And that the slab was flat.\n\n","date":"February 10, 2014 at 11:29 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78065","author":"David Goulet","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Hugh,\nHave you conducted a search for naked portraits of Christ? That would seem to be a relevant inquiry for a skeptic. It this case of the Shroud we see his naked buttocks and his hands cover the front genitalia. No modest loin cloth.\nAs a matter of fact, David Rolfe when he was preparing the final cut for release of Silent Witness lost the support of his major backer when he refused to pull illustrations of a naked Christ hanging on the Cross from the film. I believe they call the issue verisimilitude.\n\n","date":"February 10, 2014 at 8:04 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78023","author":"John Klotz","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Good point. There are dozens of images showing Christ naked, but nearly always there is something, even if just a wisp of material, to cover the genitalia. The shroud is not alone in preserving Jesus’s modesty by crossing his hands, but it is certainly less common. Baptism images usually cover Jesus with wavy lines (of water), and the genitalia are simply omitted, although the Ravenna mosaic is an exception even to this. Buttocks, at least before the 13th century, are even more exceptional.\n\n","date":"February 10, 2014 at 9:12 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78038","author":"Hugh Farey","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"David Mo, first quoting Michael Baden, wrote: “«Blood never oozes in nice neat rivulets, it gets clotted in the hair […]». This is a very simple proof that the image is not a copy or imprint of a corpse on a sheet. You sindonists dislike to be reminded this.” \nNow when will David Mo ever consider the likeliness of the shroud had been in-soaked with a watery solution for the sake of purifying the shed innocent blood within a Judean funerary context? What does Michael Baden or David Mo know about Second Temple period/1st c. CE Judean burial rite and customs? Nothing.\n\n","date":"February 10, 2014 at 8:16 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78029","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"BTW the oozing just appears to be in the hair (see Lavoie).\n\n","date":"February 10, 2014 at 8:24 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78030","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Max:\nWe may discuss whether the Lavoie’s theory of double printing gets removed all blood trickles over the hair of facial image. But we can not discuss the same with the back of the neck. Here the trails run hopelessly over the hair. See here please: http://shroudofturinwithoutallthehype.files.wordpress.com/2012/12/frontal-and-dorsal-blood-on-hair-cropped.png?w=768&h=411\n\n","date":"February 10, 2014 at 10:56 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78059","author":"David Mo","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"“This is very simple proof…”  I agree. That’s the problem.  Too often, issues such as these are made out to be as simple as a + b = c- particularly as dictated from a “scientific standpoint”.  While a + b may equal c, a may equal a1 + a2 + a3…., etc.  The truth is there are many unknown variables.  Some we may recognize, some we may not even realize they exist.  No one knows, when/how the body was taken down, if the body was carried to the tomb while attached to the patibulum, or not, when the nails, crown of thorns was removed, if, how the body was washed, etc.  It’s not simple “proof” of anything.  The unknowns are significant.  “Hoplesslessly over the hair”, this pattern is an impossibility, under any circumstance-how do you know it’s only “over the hair”, that there’s not a contrail of blood underneath?  A body with scalp wounds could never, under any circumstances result in that type of pattern?  How do you know? Was the hair wet or dry?  Evenly moist throughout?  The only thing that’s hopeless is when “experts” pretend they know exactly how everything works and that it’s so open and shut.  Take such arguments into a scientific arena and you will be asked to show how you know, what evidence do you have to support this?  I am not convinced that it looks contrived, sorry.  It could be, but I think there are too many unknowns to make a firm conclusion, but to each his own.\n   Regarding the issue of rigor being irrelevant, it’s also a matter of perspective, but Hugh introduced the issue that rigor had not yet set in regarding the lower extremities (this could include the buttocks, or not).  I, in turn, raised the issue, okay, moving on from the geet, what about the upper body (chest, abdomen).  Would one making a sculpture include such a detail on the cloth, and is it that discernible to the naked eye?  Irrelevant?  If you want it to be, it can be, sure.\n\n","date":"February 10, 2014 at 12:08 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78071","author":"Kelly Kearse","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"David, \nBaden was not talking about the back of the head but the front “nice neat rivulets”.\nThe blood decal on the back is quite different. There are no rivulets at all. The blood decal implies the presence at some moment of a circlet of rushes at the back of the head and result from tightly moulding/pressing the relief of the corresponding area  with the linen cloth in-soaked most likely with a watery solution.\n\n","date":"February 10, 2014 at 12:12 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78072","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"#61, “geet” equal feet, sorry-as is evident, I would have made a lousy forger\n\n","date":"February 10, 2014 at 12:15 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78074","author":"Kelly Kearse","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Guys, David Mo is merely another upset troll, and provoking Shroud-hater. To such, there is one message I think: FO. Do not feed the trolls.\n\n","date":"February 10, 2014 at 12:21 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78076","author":"O.K.","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"I don’t think David Mo is a troll at all, I doubt if he is very upset, and I know he does not hate the Shroud. He points out that a body in rigor mortis lying on a flat slab would not look as trim as the dorsal image on the shroud looks, as the fat of the buttocks would squash out whether there was rigor or not. He also points out that the blood trickles on the sides and back of the hair are anomalous. Some people have accounted for these anomalies to their satisfaction, by suggesting the body was not laid on a flat slab, that the shroud moved its position between bloodstains and image, and that (if I understand Max correctly), the bloodstains on the back of the head are contact prints from a circlet of rushes. If David Mo does not find these convincing, that doesn’t make him either a troll or a shroud-hater.\n\n","date":"February 10, 2014 at 2:52 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78097","author":"Hugh Farey","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"I agree. He’s made some fair observations. Hardly the kind of stuff one finds coming from under a bridge.\n\n","date":"February 10, 2014 at 2:56 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78100","author":"David Goulet","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Guys, in three polemical articles I had to deal with three atheist idiots, who were like parrots repeating uncritically Baden’s opinion on blood rivulets, From this, and my previous discussions with David Mo, I really think that dealing with such trolls is really nothing but a waste of time. Hugh, you may like him because you are constantly looking for a hole in the whole, but really discussing the things over and over, with guys who are not interested in seeking the truth but the non-existent problem just to attack the credibility of the Shroud, doesn’t make sense according to me.\nNo arguments will ever convince David Mo and a few similar guys (who I won’t mention but you all know them), so there is nothing to talk about with him.\nBTW: if you are interested in blood marks from the crown of thorns, see http://www.shroud.com/pdfs/ssi01part5.pdf\n\n","date":"February 10, 2014 at 3:21 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78107","author":"O.K.","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Hugh wrote: “(if I understand Max correctly), the bloodstains on the back of the head are contact prints from a circlet of rushes.”\nThey are mainly the decals left by oozing blood “held up” via a circlet (of rushes?). They are not “nice neat rivulets” at all.\n\n","date":"February 10, 2014 at 3:45 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78112","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"They are blood clots.\n\n","date":"February 10, 2014 at 4:19 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78115","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Remoistened dry blood clots…\n\n","date":"February 10, 2014 at 4:22 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78116","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Consider a corpse in rigor mortis which the back feet and back upper torso first touches the ground. In that case, most of the weight of the corpse is not on the buttocks, neither the calves, and therefore they do not appear flattened. The crucifixion would likely generate such a posture.\n\n","date":"February 10, 2014 at 4:32 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78119","author":"Mario Latendresse","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Mario, I think you’re right.  And such a crucifixion position that was maintained because of the rigor mortis can well be the most important (if not the single) cause of the apparent lack of scourge marks at the base of the buttocks area.  Instead of putting forward special assumptions to explain this particularity of the scourge marks (like Thierry Castex’s idea of a smaller cloth lying under the buttocks area), I think the hypothesis of a crucifixion position that was maintained because of the rigor mortis, which would have elevated this part of the buttocks area away from the underlying shroud (thus preventing the transfer of many scourge marks) is much more plausible and rational in the context of the Shroud.  I’m sure my friend Occam would agree with me on this one because such a conclusion doesn’t rely on special assumptions like it is in the case of Castex hypothesis.\n\n","date":"February 10, 2014 at 4:44 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78124","author":"Anonymous","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Fair enough. I find by experiment that I can hold my buttocks off the ground very easily. So the picture at the top of this post is wrong.\n\n","date":"February 10, 2014 at 4:59 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78132","author":"Hugh Farey","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"The natural position of crucifixion described by Barbet is consistent with a elevation of the lowest part of the buttocks (or the upper thighs if you prefer) from a cloth lying on a flat surface IF the rigor mortis came soon enough that it would have kept the body in this position while he was still nailed to the cross after the death of the Shroud man.  I don’t think we need more explanation than this rational one…\n\n","date":"February 10, 2014 at 5:35 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78140","author":"Anonymous","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Mario, this is a good point. \nHowever neither would the weight of the corpse be on the buttocks, nor the calves, and therefore the former and latter would not appear flattened if the body image had been recorded on the long inner burial cloth as the body was resting in extra height on his right side on two stones. \nReminder once I wrote re “the Turin Shroud configuration one”: “Most likely,  two canes were inserted widthwise through the double-tubed S-like shaped fold purposefully made midway in the part of the cloth held taut to account for the lack of image at buttock level (see Thierry Castex’s figure 4 – 3D Dorsal View of the Front Side). \nThe horizontal S-fold was an ease fold to help correctly handle, wrap and bind the stiff rigid body placed in extra height to be subjected to a (myrrhic-)aloetic fumigation thus creating sort of a tight protective seal (much akin to shrink-wrap back and front) over the stiff rigid corpse tightly wrapped up in shroudS. \nMost likely, once the corpse was tightly wrapped up, the pair of canes tranversally inserted through the S-fold at buttock level (in the bottom half of the long inner burial cloth) could also have helped carry the wrapped-up body down to the tomb chamber and place it on the tomb bench on granulized myrrh and then the canes were removed.”\n\n","date":"February 10, 2014 at 6:03 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78150","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Or to put it in other words/if you prefer they are “held-down rivulets” via a circlet at the back of the head.\n\n","date":"February 10, 2014 at 12:23 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78077","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Typo: “held-on rivulets”\n\n","date":"February 10, 2014 at 4:32 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78120","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"I’ll leave it to others to decide who is a troll and who isn’t-trolls come and go with the cyberspace territory, but for every troll that may or may not lurk in the overgrowth, it is also possible that there are others who read a posted comment and either learn something new or think about something they knew in a different light.  Everyone has to decide if it’s a waste of time for them or not.  Time permitting, I post here when the topic interests me. \nI believe you can learn from everyone-even if you think they are completely full of it or full of themselves.  I also believe it is relatively boring to discuss things over & over with people that completely agree with you.  Of course, no amount of arguments will convince “those types”–I would never imagine as such-it’s not my intention-everyone’s free to think what they want to-to be an “expert”,or to wax and wane about how “real science” works, etc.,This is a blog-it is not a scientific department meeting or branch seminar-it’s important to keep that in mind, at least I think it is-it’s helps to put things in perspective.  Thx for the crown of thorns link\n\n","date":"February 10, 2014 at 4:50 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78128","author":"Kelly Kearse","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Someone is missing: a forensic pathologist with many years of experience in a morgue.\n\n","date":"February 10, 2014 at 5:05 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78133","author":"Louis","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Finally: the supposed rigor mortis is irrelevant. It is a theory that tries to explain why there is not crushing in the parts of the body that would rest on the slab. Dr. Lavoie clearly dismissed this assumption: no rigor mortis prevents to be crushed the body parts that are resting on the slab. Because neither hair, nor fat, and nor skin are affected by rigor mortis.\nThe Lavoie’s paper, to which the troll David Mo is referring, can be found here http://www.acheiropoietos.info/proceedings/LavoieWeb.pdf  \nIn advance I say that I do not agree with conclusions presented there.\n\n","date":"February 10, 2014 at 5:33 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78137","author":"O.K.","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Personally, I do for the explanation concerning the bloodstain off the right elbow and the bloodstains that are looking to be in the hair, while they were probably in the cheeks area.  This highly suggest that some form of manual compression happened during the burial procedure, which placed many parts of the Shroud for a short time in direct contact with the bloodstained body, thus causing a discrepancy between the apparent location of some bloodstains on the cloth versus the body image and their real location on the corpse.  The same explanation is also very good to explain the presence of some scourge marks under the knees while there is absolutely no body image there…  And to me, this form of manual compression probably happened when they transferred the enshrouded body from a central place inside the tomb (where the corpse was first placed Inside the Shroud) to a final resting place (probably a stone bench carved out in one of the tomb’s wall).  All this sound highly logical and rational to me and suggest a real first century Jewish burial…\n\n","date":"February 10, 2014 at 5:42 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78144","author":"Anonymous","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"O.K. how do you read Lavoie’s impression that the Shroud’s Image is standing upright?\n\n","date":"February 10, 2014 at 11:10 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78215","author":"Annette Cloutier","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Annette, see http://www.youtube.com/watch?v=bbl4EmoH_jg between 1:39 and 3:43\nThat’s the upright position as imagined by Lavoie, Piczek and a few others -with whom I disagree, though ( I prefer Mario Latendresse results). Obviously it seems that Lavoie had agenda to support miraculous explanation of the body position on the Shroud. They want to convince us that this position of the body is impossible by natural means -paradoxically the same thing what the sceptics (like David Mo) desire to do.\n\n","date":"February 11, 2014 at 11:08 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78327","author":"O.K.","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Hi O.K… I’ve seen the Fabric of Time video and the noetic-scientific mind behind it.  I can’t help but to be impressed with the explanation given here… especially with Isabel Piczek’s explanation of a taught shroud with a levitated body, an event horizon and the birth of a new universe.  Love it!  It may be hard to prove but it gives us a rationale that surpasses most so far.\n\n","date":"February 11, 2014 at 3:40 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78384","author":"Annette Cloutier","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"#74 Anonymous: That is the best explanation position we seem to have right now.\n\n","date":"February 10, 2014 at 5:41 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78143","author":"Louis","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"All you need is love…  Sorry…  All you need is rational thinking. ;-)\n\n","date":"February 10, 2014 at 5:43 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78145","author":"Anonymous","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Louis you wrote: “That is the best explanation position we seem to have right now.”\nOnly IF the burial cloth was just loosely draped/wrapped over the body, which is far from proven yet. All the less so as the Turin Shroud bloodied body image calls for two different cloth-to-body configurations not just one: first a tight moulding of the bloodied body relief and then a pressure release front and back with the long inner shroud somewhat getting taut again through shrinking.\n\n","date":"February 10, 2014 at 6:26 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78152","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Max, both conclusions can be correct in the sense that it could well have been a change of configuration (from a compressed one to a looser configuration at the end of the burial procedure) but without any compression being applied to the lowest part of the buttocks area (or the upper thighs area if you prefer).  This total absence of a strong compression there would explain why there are much less scourge marks in this area, while it would not discard the hypothesis proposed by Lavoie and others that there were a strong compression of the cloth on other areas of the body (like, for example, the right elbow and the face) for a short time during the burial procedure.  Personally, I think the body was first placed inside the shroud in a loose way and then, during a short transfer of the enshrouded body from a central place inside the tomb to a final resting place (i.e. stone bench carved inside a wall of the tomb), there were many parts of the body that became strongly compressed with the cloth (thus causing many bloodstains and scourge marks on the cloth) and then, finally, after the enshrouded body was laid on his final resting place, the shroud could have been replaced in the same looser configuration it was right after the body was placed in it.\n\n","date":"February 11, 2014 at 11:32 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78331","author":"Anonymous","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"The very fact the small of the back is recorded (despite lordosis) while the image at buttock level is not is not consistent yet with Mario’s explanation.\n\n","date":"February 10, 2014 at 6:42 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78155","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Hi Max, I based myself on the images, illustrations, replicas etc. produced by CES. It is possible that a talit was used, but why should there have been two of them?\n\n","date":"February 10, 2014 at 6:49 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78157","author":"Louis","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Hi Louis, actually most likely the stiff rigid body was tightly encircled widthwise in a much  larger “all-enveloping” shroud or sovev in Hebrew (the Korneilmünster Shroud?) along with flowers, plants and even objects. Reminder: all parts of the body should be wrapped-up (Naḥmanides, Torat ha-Adam; Inyan ha-hoẓa’ah) as far as a Judean/Jewish burial is concerned..\n\n","date":"February 11, 2014 at 8:45 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78298","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Hi Max, since you refer to two cloths, as well as to flowers, plants and even objects, do you agree with Professor Danin and, if yes, in which cloth would the images be?\n\n","date":"February 11, 2014 at 9:33 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78311","author":"Louis","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"The Kornelimünster shroud is a sovev made of byssum. As such It was all-envelopping widthwise the man already enshrouded lengthwise with flower heads, plants and objects in the in-soaked inner long burial cloth. The KS was neither  in-soaked nor encircled right  to the TS man’s skin. It didn’t record any body images.\n\n","date":"February 12, 2014 at 8:10 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78828","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"\nLouis :\nAnnette, surely you don’t believe that a burial cloth led to the birth of Christianity? The apostles, including Paul, would have to taken it around while they were preaching, particularly about the Resurrection, but they didn’t do so.\n\nLouis, so sorry… I didn’t see your Quote ’til now.  Well yes I do believe that the Shroud instigated Paul to writing about his Platonic Jesus then mystically becoming Christ and Mark to writing in order to bring Jesus back down to earth while leaving Paul’s mysticism intact.   John Loken first wrote in his book (2010): The Shroud was the Resurrection, after which a few years later (2012) Thomas de Wesselow also concurred.  The NT Biblical scholarship in both books was only a preliminary one: Loken’s out of his own logic and reasoning… de Wesselow from an art historian point of view.  The Gospels are stories written decades after the time of Jesus.  I am quite certain that a certain few first century devotees were allowed to see the Shroud in all its glory:  a long snow white sheet with a young crucified golden man staring with bright red blood crying out in supplication…  It was the Shroud that gave rise to Christianity not the Gospels itself.  Like anything too sacred the Shroud had to be kept hidden… but the stories of this unique Man needed to be told.\n\n","date":"February 10, 2014 at 7:23 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78165","author":"Annette Cloutier","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"So Paul was blinded by a piece of cloth. Peter was crucified upside down because of a piece of cloth. A piece of cloth was eating with the disciples by the lake and advised Peter to take care of his followers. Mass halluscinations take place because 500 people thought they saw Jesus while really they were looking at a piece of cloth with a strange image. Sorry Annette, there is nothing to back this hypothesis and everything to back the life changing experience the disciples had by encountering the risen Christ. A first century burial cloth would be a defilement to the early Christians (who were really Jews who found their Messiah) far from an evangelizing tool, it would elicit severe rejection from Jews. If there was an image at that time (and not a latent process as some suggest) it would be regarded as a “sweat imprint” of a corpse rather than the “resurrected christ”. The good thing from this hypothesis is that it shows how powerful the mystery of the shroud is, to the extent that agnostics/atheists like De Wessellow would go so far to reconcile his lack of faith with the fact that is shroud.\n\n","date":"February 10, 2014 at 10:02 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78192","author":"Mike M","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Hi Mike… I’m not an agnostic or an atheist… and I believe in the powerful act of Resurrection.  But I know the difference between story/imagination and reality.  I know, too, that nothing corrupt can enter into the state of Paradise.\n\n","date":"February 10, 2014 at 10:33 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78204","author":"Annette Cloutier","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Hi Annette, I didn’t say you were. I was just refuting De Wessellow’s hypothesis, nothing personal.\n\n","date":"February 10, 2014 at 10:53 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78208","author":"Mike M","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Thanks Mike.  Spent many undergraduate and graduate years studying the NT… source criticism, hermeneutics, etc..  Only real source for the tremendous inspiration to write above and beyond stories of one exceptional god-man to surpass all others of the time and culture and to have those stories survive and thrive unto the age of ages would be the one empirical source–the Turin Shroud.\n\n","date":"February 10, 2014 at 11:08 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78213","author":"Annette Cloutier","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"“Only real source for the tremendous inspiration to write above and beyond stories of one exceptional god-man to surpass all others of the time and culture and to have those stories survive and thrive unto the age of ages would be the one empirical source–the Turin Shroud.” Or the resurrected Christ and the power of the Holy Spirit after Pentecost.\n\n","date":"February 10, 2014 at 11:34 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78220","author":"Mike M","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Hi Annette, Sorry I can’t agree with you and I’ll tell you why: Paul was a Pharisee who studied with Gamaliel, not a Sadducee easily susceptible to Greek and Roman influence. He “saw” Jesus on the road to Damascus, actually saw a very bright light and heard a voice,and that episode left him blind for a while, so he had no need for any burial cloth. Notice that if you read the Gospels, the burial shroud is only given passing mention, it was just the ignition, and the Jesus movement went forward with the appearances.\nI used to think that Msgr. John P. Meier was a sort of liberal, but he proved to be conservative at times, and Father Joseph Fitzmyer was more liberal in interpretation but conservative in certain topics, and considered to have “impeccable critical credentials.” Father Jean Carmignac detected expressions in the Gospels that could make more sense in hebrew, so there may have been gospel manuscripts in this language that may have been destroyed during the persecution (remember, Paul was even flogged) and so only the oral tradition was maintained.\nMsgr.Meier is of the opinion that Jesus’ divinity was recognised before the Easter event, but that is not what Fr. Fitzmyer thinks. He stresses that the Resurrection is the central belief of Christianity and it was this event that led to the change in name, that is, from Jesus of Nazareth to Jesus Christ…. and he was of course not referring to the Shroud.:   \n https://www.academia.edu/4700001/What_do_we_know_about_the_Bible_An_interview_with_Joseph_A._Fitzmyer_SJ\n\n","date":"February 11, 2014 at 9:25 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78308","author":"Louis","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Louis, you are so well read in traditional academic biblical exegesis… I in admiration and respect your perspective wholeheartedly for this.  However, in order to make serious sense of the phenomenon of the overpowering of Christianity something other than stories of a god-man’s overcoming death with resurrection as in Osirus, Aesclepius, Mithras, et al…which were strong cults at the time… something had to energize the movement and give concrete foundation to it other than Story… Hence the Not Made With Human Hands phenomenon of the Shroud…\nAs far as Paul being a Pharisee and not given to Plato and other burgeoning Neo-Platonists of Paul’s time and culture… Pharisees were highly educated to the influx of Greco-Roman ideas but clung to the belief of Resurrection, Angels, and Spiritual beings more than the Sadducees who had no appreciation for such matters… The Sadducees were this world legalists….they were also radically conservative not wanting to deal with Roman rule but rather an autonomous and self-governing Jewish state.  So Paul being a Pharisee would have digested the teachings of the Greek and Roman philosophers but have relegated them to the Stoichea of the Universe… on the Dark-Side of Life… while unwittingly incorporating them into the Light of his Mystical Body of Christ.\n\n","date":"February 11, 2014 at 2:05 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78364","author":"Annette Cloutier","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"\nAnnette Cloutier :\nHi Mike… I’m not an agnostic or an atheist… and I believe in the powerful act of Resurrection.  But I know the difference between story/imagination and reality.  I know, too, that nothing corrupt can enter into the state of Paradise.\n\nOh by the way Mike, I doubt that anyone then or now could ever view the Image as a “sweat process.”\n\n","date":"February 10, 2014 at 10:49 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78207","author":"Annette Cloutier","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Actually many did, refer to Gregory’s sermon, Yves Delages, Paul Vignon & Ray Rogers. BTW I don’t believe it is a sweat imprint, but the first impression would be an imprint that came from contact with the skin and left a wet look on a piece of cloth. I can definitely understand where they are coming from.\n\n","date":"February 10, 2014 at 11:04 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78211","author":"Mike M","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"If you look at the picture I provided above you clearly see some trickles of blood in a very similar way to the front one. They are spiral shaped and apparently run horizontally. If you don’t want to see them I can not force you to do so. They are trickles and not shapeless stains as we can expect with normal blood stains in a normal hair.\nGiven the position in the back of the neck, no shift in the cloth can explain them. The hypothesis of Dr. Lavoie is a cloth that rests on the body first and then become more flat. First the blood and then the image were printed. So the actual position of the blood stains has to be moved one or two cm. The trickles actually run on the face and not on the hair. This is impossible to apply to the back of the neck, where there is only the hair surface where the trickles can emerge and run.\nI regret not having time now to devote to the problem of the absence of crushing surfaces in contact with the slab. In my opinion this totally excludes the hypothesis of a lying body and creates compatibility problems with other parts of the image, the theory of Dr. Zugibe and others. If I find a moment I shall go back on the subject.\n\n","date":"February 11, 2014 at 4:42 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78261","author":"David Mo","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"This thread has gotten quite long and maybe this has been covered before, but it seems to me that David Mo and perhaps others are not factoring in one obvious fact, and I do mean fact whatever your theory of image creation:\nThe blood stains and the image were created at different times. First came the blood stains and then as much as 48 hours latter, likely no more than, 40 hours, the image came into existence by a yet unknown process. \nTrying to create a unified picture of blood and the image can only go so far. Yes there are blood stains in positions consistent with the image. That doesn’t mean they were created simultaneously..\nIf the image was created an instant when the body and the Shroud “parted company” then it is clear the blood stains were, to borrow a phrase from our fundamentalist brothers and sisters, “Left behind.”\nBecause of writing I have been dealing with multispectral digital imaging (MSDI) for a couple of weeks. of weeks. I think it may very well be that with MSDI we can strip away layers of accretions from the Shroud and get a definitive picture of the Shroud even before there were any markings on it.; the markings at the time Christ was first wrapped in the Shroud and the markings when the image was created. OMG\n\n","date":"February 11, 2014 at 5:51 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78276","author":"John Klotz","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"To David, there are no “nice neat rivulets” stricto sensu at the back of the TS man’s head as you want us to believe (misquoting Baden). They are “redried remoistened freshly dried  THICK blood smudges and clots resulting  from blood oozing and pooling against and inside a circlet (of rushes?) in the hair.\n\n","date":"February 11, 2014 at 9:29 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78310","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"+ typo: originally having oozed and pooled against and inside out a circlet (of ruches?) in the hair.\n\n","date":"February 11, 2014 at 9:52 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78316","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Typo: inside out a circlet\n\n","date":"February 11, 2014 at 9:46 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78313","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"\nMike M :\n“Only real source for the tremendous inspiration to write above and beyond stories of one exceptional god-man to surpass all others of the time and culture and to have those stories survive and thrive unto the age of ages would be the one empirical source–the Turin Shroud.” Or the resurrected Christ and the power of the Holy Spirit after Pentecost.","date":"February 11, 2014 at 1:45 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78357","author":"Annette Cloutier","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Rght, Mike… but where’s the “empirical” evidence of the Holy Spirit after Pentecost… I believe it; but I believe it as a Story… a past Story seen through prisms of light of other minds.\n\n","date":"February 11, 2014 at 1:47 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78359","author":"Annette Cloutier","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Annette, I left a response for you in # 98, however these Quotes and Replies are not working as they should and you may not have noticed it.\n\n","date":"February 11, 2014 at 1:51 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78360","author":"Louis","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Annette, re.#99. Thanks for the remarks. I am posting this here as the Reply/Quote mode is still not working. There are diferences between what is said about the deities in Greek mythology and the Resurrection of Christ, as given in the NT. Your remarks about Paul are mostly correct, however I don’t believe he was a Hellenized Jew to the extent that Philo was. The early Christians faced lions, could heal and cure (admitted even by their enemies), lived a community life admired by non-Christians and so on, but surely not because of a burial cloth. You can bet on it: If it was a burial cloth, that would be clearly stated in the gospels, where as I said, it receives a little more than a passing mention.\nThere is another problem.The Western world is becoming increasingly sceptical, but it is not the Shroud that will take them back to church, the Shroud will not provide solutions to all their doubts, much more is needed.\n\n","date":"February 11, 2014 at 2:56 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78380","author":"Louis","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Louis, for sure it wasn’t a burial cloth that stirred the masses of Christian believers…however, it was the origination and catalyst that convinced the leaders and those with money and power to keep the masses inspired.  Stories will only carry so much weight with rulers who wont be convinced; even King Herod Marcus Agrippa thought Paul was mad (according to Luke’s story in Acts 26.1-29.  But probably had enough money to investigate Paul’s claims further, saw the Shroud and had the first Gospel written about Jesus bearing the name of Mark…  Who knows, it’s not in story form all the mysteries of the early Shroud.  But there is no reason that early Christianity could have survived on story alone if it had not received plenty of financial support.  The same with the idea of Resurrection today… it would be mere story if we didn’t have the Shroud to ponder.\n\n","date":"February 11, 2014 at 7:16 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78442","author":"Annette Cloutier","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Hi Annette, Paul was thought to be mad because ” too much learning had made him mad.” It seems that his learning enabled him to distinguish Greek myth from Christian faith, and of course his very Jewish unconscious helped.\n Can we date early Christianity till around AD 300? If yes, then there was no financial support, meaning that there were no external resources. With Constantine on the scene things changed. It could be that there are many people who ponder on the Shroud and think it bolsters faith in the Resurrection. I stick to the Church’s point of view, it can be a prop, and it is certainly not a foundation for faith. \nJesus said, “When the Son of Man returns, will he find faith?”… You see? He knew about it 2000 years ago….. and it is just the beginning.\n\n","date":"February 11, 2014 at 7:50 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78452","author":"Louis","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Louis, I admire your adherence to Story… however, I’m more in adherence to Shroud phenomenon (non-Story) and how it will move this next generation scientifically and spiritually.\n\n","date":"February 11, 2014 at 7:59 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78455","author":"Annette Cloutier","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"In the hypothesis the TS man is Yeshua, in the Second Temple period any corpse should be purified, dried out, dressed up/wrapped up and buried. Those were the core procedures. \nYeshua was  no mere am eretz ie “Judean ordinary citizen” through his 5-6 buriers’ eyes but a prophet (and even the Messiah) whose freshly dried innocent blood had been shed and should be kept with his body. Hence most likely his long inner burial cloth was in-soaked with a watery solution (living or rainwater + ashes and/or limestone dust) and his bloodied body subjected to a (myrrhic?) aloetic fumigation rite. In the Bible burning aromatic woods/spices are currently used to honour dead kings (see 2 Chronicles 16:14 – 21:19 Targum). Bear in mind too Yeshua was buried in the memorial tomb of Joseph, a rich man, and not just thrown into a pit as a criminal.\n\n","date":"February 12, 2014 at 5:21 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78782","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"\nJohn Klotz :\nThis thread has gotten quite long and maybe this has been covered before, but it seems to me that David Mo and perhaps others are not factoring in one obvious fact, and I do mean fact whatever your theory of image creation:\nThe blood stains and the image were created at different times. First came the blood stains and then as much as 48 hours latter, likely no more than, 40 hours, the image came into existence by a yet unknown process.\nTrying to create a unified picture of blood and the image can only go so far. Yes there are blood stains in positions consistent with the image. That doesn’t mean they were created simultaneously..\nIf the image was created an instant when the body and the Shroud “parted company” then it is clear the blood stains were, to borrow a phrase from our fundamentalist brothers and sisters, “Left behind.”\nBecause of writing I have been dealing with multispectral digital imaging (MSDI) for a couple of weeks. of weeks. I think it may very well be that with MSDI we can strip away layers of accretions from the Shroud and get a definitive picture of the Shroud even before there were any markings on it.; the markings at the time Christ was first wrapped in the Shroud and the markings when the image was created. OMG\n\nAll theories I know assume that there is a match between the blood stains and specific body parts that would be their origin. The discussion is particularly sensitive in the case of the exact position of the marks in the hand. There may be variations about two cm (Lavoie), but no more. I do not understand why the streaks of blood on the neck must obey a different law. I do not understand what part of the human body could they proceed without causing significant distortions of the fabric. (The neck is more than ten cm from the other parts of the body and the cloth of the shroud is a continuum that shows no important deformation). \nI think the only reason to suppose that the trails of blood in the back of the neck may have another origin is that the evidence a contrario sensu becomes too uncomfortable for your convictions. Sorry for the frankness.\n\n","date":"February 11, 2014 at 4:29 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78396","author":"David Mo","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"It must say: “The back of the neck”. Sorry.\n\n","date":"February 11, 2014 at 5:08 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78409","author":"David Mo","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"\nMario Latendresse :\nConsider a corpse in rigor mortis which the back feet and back upper torso first touches the ground. In that case, most of the weight of the corpse is not on the buttocks, neither the calves, and therefore they do not appear flattened. The crucifixion would likely generate such a posture.\n\nMy English must have deteriorated sharply in the last few hours, because I do not understand the answer or it does not have basis. \nIf the body laid on her back, some circular or elliptical crushed shapes would be visible. And they are not. This applies to the back upper torso or any point of the body resting on a slab, with or without rigor mortis. The only difference would be that the flattening areas would be greater if there was not rigor mortis.\n\n","date":"February 11, 2014 at 5:03 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78407","author":"David Mo","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"In my opinion, the TS man’s stiff rigid body was not recorded on his long inner burial cloth as he was still laying on his back but when actually it was placed in extra height, resting on its right side on two raised stones (used for body tight wrapping-up + purifying + drying, which implies the presence of 5-6 buriers).\n\n","date":"February 12, 2014 at 6:58 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78617","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Mark, I wish someone could draw a picture of this burial procedure.. It seems bizarre.  Was this type of burial customary in 1st century Jewish funerary practices?\n\n","date":"February 12, 2014 at 12:42 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78717","author":"Annette Cloutier","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Reposting my reply\n(February 12, 2014 at 5:21 pm | #115)\nso that you could not miss it:\nIn the hypothesis the TS man is Yeshua, in the Second Temple period any corpse should be purified, dried out, dressed up/wrapped up and buried. Those were the core procedures.\nYeshua was no mere am eretz ie “Judean ordinary citizen” through his 5-6 buriers’ eyes but a prophet (and even the Messiah) whose freshly dried innocent blood had been shed and should be kept with his body. Hence most likely his long inner burial cloth was in-soaked with a watery solution (living or rainwater + ashes and/or limestone dust) and his bloodied body subjected to a (myrrhic?) aloetic fumigation rite. In the Bible burning aromatic woods/spices are currently used to honour dead kings (see 2 Chronicles 16:14 – 21:19 Targum). \nBear in mind too Yeshua was buried in the memorial/commemorative tomb of Joseph, a rich man, and not just thrown into a pit as a criminal.\n\n","date":"February 12, 2014 at 5:27 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78786","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"I completely agree with Mario.\nWhat does mean: “some circular or elliptical crushed shapes would be visible”?\nHow can it be visible ?\nOnly by the 3D rendering of the dorsal TSM image.\nIt is well known that the dorsal image shows few 3D properties ( withe regard to the frontal image). This fact alone is significant.\nLook at:\nhttp://thierrycastex.blogspot.fr/2012_09_01_archive.html\nParticularly at Fig.4 and 4bis\nLavoie’s paper is fully irrelevant because he did not even consider rigor mortis (and it is obviously agenda-driven)..\n\n","date":"February 14, 2014 at 5:46 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-79439","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Annette, re. 114\n“Louis, I admire your adherence to Story… however, I’m more in adherence to Shroud phenomenon (non-Story) and how it will move this next generation scientifically and spiritually.”\nI can understand what you are saying, in fact that is what at least some Shroudies feel. I beg to differ, thinking that Jesus’ message also was “take it or leave it”, it is evident in the gospel and he was instructing his disciples. That, to me at least, is another of Jesus’ timeless sayings, it applied in AD 1, it applies in AD 2014.\nScience? It can help, but only to an extent. It can answer the How questions, but never the Why questions. Stephen Hawking tries, and has failed, but he’s a great fellow, knows the limits of science, and is is a member of the Pontifical Academy of Sciences.\n\n","date":"February 11, 2014 at 8:09 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78459","author":"Louis","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Louis, will you be at the St, Louis Shroud Convention in October 2014… or the next SBL (Society of Biblical Literature) Convention?\n\n","date":"February 11, 2014 at 8:23 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78462","author":"Annette Cloutier","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Annette, I don’t think so, also because I prefer my own independent line of research, while keeping an eye on what is being said out there, some of it useful, some of it not. Are you planning to be there and are you a member of SBL?\nMay I ask: what makes you sceptical about the NT?\n\n","date":"February 11, 2014 at 8:37 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78463","author":"Louis","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Hi Louis, I asked the question tongue and cheek because I would think it of greater value to be on the cutting edge of insights on the Shroud rather than the stale and tired insights of the New Testament.  I am “skeptical” about the testimony in the NT because the Stories are “contrived” they are an announcement and EVANGALION of the New Universal Lord written nearly a half century after the life of Our Lord.  I think the NT served its purpose in creating a great energy for life in the economic efficiency of equality of SPIRIT… with Good Information told in Story of the Father delegating the work to the Son and the Son delegating the work to the Holy Spirit and the Holy Spirit delegating the work to everyone of us equally as kings and queens who know how love can grow.  So far I’ve seen very little of this obvious work that needs to be undertaken with the greatest passion in raising the dignity of one another by sincerely caring for one another–for enabling one another to be royal in love.  I think the NT is a gold mine for all of us to claim a stake in the nobility of Christ… but I see that for many of us the gold mine has been used in making trinkets of jewelry. Going beyond the NT there are waves and more waves of information that could provide the Economy of Spirit  via the work of equality so that no one need ever be Crucified again for the sake of Resurrection.\n\n","date":"February 12, 2014 at 1:20 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78546","author":"Annette Cloutier","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Hi Annette, here’s a hurried comment as we could go on and on. No offence is intended when I say that you have been influenced by Harvard theology, or should I say, Talpiot? I think much of what Bultmann said is no longer valid as he was influenced by Heidegger. In the end, he continued to be a liberal Lutheran and Heidegger, the ex-Jesuit seminarian who fought with the Jesuits, called a priest to his home and asked for a Catholic burial. His faith was revived by history, not by philosophy or Bultmann’s theology.\nI think one has to read in between the lines to get to the core of Jesus’ message, but it involves head and heart.\n\n","date":"February 12, 2014 at 6:27 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78605","author":"Louis","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Louis you’re right… Like Hugh with the Shroud’s authenticity, I straddle the fence with the authenticity of the NT, especially the 4 Gospels.  I see them as a beautiful albeit 1st century Gnostic interpretation of Jesus. (I would never adhere to the phrase: “Jesus of Nazareth.”  I believe the first Gospel writer, Mark, invented the word from Jesus the Nazorite.  It’s obvious to me that the first Gospel hagiographer also created other characters such as Mary Magdalene from Mary the Majestic Tower–the tower of Herod’s first Queen Mariamne e Maria, also Mark created the name Joseph of Arimathea which he explained carefully in Koine Greek in 15:43 means:  Joseph an Aristocratic Ruler waiting for the Kingdom of God.  Mark needed to put a foundation under Paul’s castle in the sky.  I love the way the Stories have evolved in every culture… I love the belief in creating and recreating (resurrecting if you will) Christ in every generation towards an Ultimate Good.  And I respect you for being swallowed up in your love for Christ.  I’m with you there, Louis,… just on a different page, same book of life.  Yet sometimes, I too, love rereading the page your on.\n\n","date":"February 12, 2014 at 12:24 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78715","author":"Annette Cloutier","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Hi Annette, I wouldn’t say that the 4 gospels are gnostic,because if they were the decisions taken at Nicaea would be different. Like Father Rudolf Schnackenburg I believe Jesus is hovering above the gospels, in fact it was something that even Albert Schweitzer felt, therefore the existence of the mysterium Christi till today. One has to read between the lines.\nNicknames were common in the first century, the names during the Second Temple were different, but to judge everything as allegory? Have you written anything on this topic? Some of the things I wrote are on the HSG website.\n\n","date":"February 12, 2014 at 6:08 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78795","author":"Louis","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Max re. 121, The Sanhedrin had two tombs reserved for Jews who had been executed as criminals. Why was Jesus not buried in one of them? It could be that Joseph also had clout and convinced the religious authorities that he would look after the burial arrangements.\n\n","date":"February 12, 2014 at 6:24 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78803","author":"Louis","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"They were not so much “tombs” as pits.\n\n","date":"February 12, 2014 at 7:39 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78823","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"My guess is Joseph  had not so much “clout and convinced the religious authorities that he would look after the burial arrangements”, as just did it as Yeshua’s secret disciple while abiding by the Halakha.\n\n","date":"February 12, 2014 at 7:27 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78819","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"I do think he, Joseph, and the other 4-5 buriers (most likely Yeshua’s secret disciples too) got into real trouble with the authorities after “the event”….\n\n","date":"February 12, 2014 at 7:32 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78820","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"or in the year that follows.\n\n","date":"February 12, 2014 at 7:36 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78821","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"A common law judean  criminal was allowed to be buried in family garden-tomb  providing it was new and nobody else had been already buried in it.\n\n","date":"February 12, 2014 at 7:56 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-78827","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"For a Jew killed legaly by the Romans around Jesus time Max, I don’t think we have any proof that this was really the case…  And even if some form of burial was allowed by the Romans for such a criminal in Judea, it’s not sure at all that he could have been buried elsewhere than inside a common tomb instead of a family tomb.  I would like you to give us some references to back-up your claim…\n\n","date":"February 13, 2014 at 2:02 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-79048","author":"Anonymous","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Max, please reply the fastest possible.\n\n","date":"February 13, 2014 at 2:12 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-79053","author":"Louis","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Max, it is not difficult to concede that Joseph took matters into his own hand knowing that the family owned no tomb. What may have happened is that the religious authorities kept an eye and took him to task after that. They had to know what was going on as the body could not be left on the cross and if no one came to claim it the procedure would have been to arrange for the burial in one of tombs(dug in the soil) reserved for criminals. Can you give me the source for #135?\n\n","date":"February 13, 2014 at 1:29 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-79045","author":"Louis","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Louis, you are referring to the Mishnah (see Babylonian Talmud, Sanhedrin VI, 46a) : “And they did not bury him [the executed person] in his ancestral tomb, but two burial places [pits dug in the soil] ] were prepared by the Beth Din, one for those who were decapitated or strangled, and the other for those who were stoned [and afterwards hanged on a tree] or burned.” \nWhence it can be deduced it was allowed for Joseph to bury Yeshua in his own newly-hewn rock garden-tomb and still abide by the Halakha since the tomb had never been used as an ancestral tomb and Yeshua was neither decapitated, strangled, stoned or burned.\n\n","date":"February 13, 2014 at 3:21 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-79074","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"This was written many centuries after the time of Jesus and this apply to Jews who killed other Jews.  There is no ancient reference (to my knowledge) that clearly mention that the Roman authorities in Judea were allowing the family of someone they executed legally to buried him in a family tomb.  Would like to see such a mention somewhere in a manuscript dated before the end of the second temple…\n\n","date":"February 13, 2014 at 5:36 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-79108","author":"Anonymous","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Again, to my knowledge (if my memory is correct), I think there is still a debate among expert on that question and I think it is simply because we don’t have any clear texts about the way the Romans were allowing the Jews to buried someone they just crucified…\n\n","date":"February 13, 2014 at 5:39 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-79110","author":"Anonymous","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Typo: have YOU lost your Occam razor?\n\n","date":"February 14, 2014 at 10:51 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-79357","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Yannick, have for lost you Okham rasor when it comes to NT relation of Yeshua’s burial by Joseph, a rich man and a Sanhedrin member) and the Mishnah text?\n\n","date":"February 14, 2014 at 10:50 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-79356","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"It’s not evident to be sure how those who were legally killed by the Romans in Palestine during Jesus time were buried (if they were at all).  I think it’s wise to remain very prudent about that and not making sure claims.\nBy the way, I’m not Yannick, I’m his phantom.\n\n","date":"February 14, 2014 at 4:38 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-79432","author":"Anonymous","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Max, very many thanks. I needed this in the context of a paper I am writing, which,God willing, should be ready and posted next month.\n\n","date":"February 13, 2014 at 3:26 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-79075","author":"Louis","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Anonymous alias Yannick, since you butted in let me explain the following: For some reason or the other between 63 BC and around AD 30 the Romans did not allow the Sanhedrin to carry out any death punishment, they had to be the executioners, and the Jews could handle the remains of executed Jews as they wished.  \nJesus was not buried in a tomb that had been used, it was probably one that Joseph had kept ready for himself and his descendants. Being unused, it it was in keeping with Jewish law to bury Jesus, crucified as a criminal, there. That is what Max meant by Halakhah.\n\n","date":"February 13, 2014 at 7:01 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-79132","author":"Louis","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Anonymous is correct in saying that early 1st century references to Middle Eastern Roman punishment regulations, Jewish burial regulations, the relationship between the two and the precision with which they were carried out are all sadly lacking, and must be inferred from later data. Even Josephus is not as informative as we would like. However, I don’t see any a priori reason why Jesus should not have buried according to the biblical description.\n\n","date":"February 13, 2014 at 8:35 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-79161","author":"Hugh Farey","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Reminder re a crucifixion Judean victim (secondary) burial during Roman occupation: \nIn 1968, in the northeast of Jerusalem in an area called Giv’at ha-Mivtar, in a hewn soft limestone cave tomb consisting of two chambers, each with burial niche, was found the ossuary of Yehohanan ben Hagkol, a Judean resident of Jerusalem of a good family, between 24 and 28 years old. \nIt was one of the tombs of a huge Judean cemetery of the Second Temple period (second century BCE. to 70 CE.), extending from Mt. Scopus in the east to the Sanhedriya tombs in the northwest. One of the ossuaries contained one three- or four-year-old child and a crucified man-an iron nail held Yehohanan’s heel bones together. The latter may have been convicted of a political crime shortly after the turn of the era and sometime before the Roman destruction of Jerusalem in 70 CE).\n\n","date":"February 14, 2014 at 12:01 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-79371","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Max, stop spoonfeeding.\n\n","date":"February 14, 2014 at 3:04 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-79406","author":"Louis","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"What can be inferred from this contemporray data (Yehohanan ben Hagkol’s secondary burial within an ancestral tomb)?\nYehohanan could have been regarded not so much as a criminal as both a political victim of Roman occupation and a rigtheous (young) man. Tha same could be said of Yeshoua. In both cases the corpse was asked to Roman authoritioes not to be buried in the place reserved for executed persons.\n\n","date":"February 16, 2014 at 2:03 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-79832","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Louis:\nYou can see about archaeology, crucifixion and Yehohanan : \nVassilios Tzaferis : “Crucifixion. The Archaeological Evidence”, BAR 11:01, Jan/Feb 1985, http://members.bib-arch.org/publication.asp?PubID=BSBA&Volume=11&Issue=1&ArticleID=6,\n:\nZias, Joe : “Crucifixion in Antiquity . The Evidence” : http://www.mercaba.org/FICHAS/upsa/crucifixion.htm\n\n","date":"February 17, 2014 at 4:17 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-79975","author":"David Mo","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"It is also useful: \nDavid W. Chapman: Ancient Jewish and Christian Perceptions of Crucifixion ,\nBaker Publishing Group, 2010.\nYou can consult p. 88ss about “The Crucified Man from Giv’at ha-Mivtar” in Google Books.\n\n","date":"February 17, 2014 at 4:52 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-79982","author":"David Mo","site":"shroudstory"},{"title":"How certain are we that the man on the shroud is in rigor mortis?","post":"Hi David Mo:\nI have written about biblical archaeology and studies for years and Yohanan is nothing new to me, however do send a lead whenever you find something else that could be useful.\n\n","date":"February 17, 2014 at 7:30 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","id":"comment-79999","author":"Louis","site":"shroudstory"}]
