[{"title":"How many more purported pieces are out there?","post":"How much is it for sale Dan, is it real, where do you buy it\n\n","date":"January 10, 2014 at 7:05 am","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","id":"comment-72867","author":"Vincenzo Giovanni Ruello","site":"shroudstory"},{"title":"How many more purported pieces are out there?","post":"You buy it at the Russian Store, I imagine, since they are advertising it. How much? What is the old saying, “If you have to ask you can’t afford it.” Is it real? Who knows.\n\n","date":"January 10, 2014 at 7:14 am","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","id":"comment-72869","author":"Dan","site":"shroudstory"},{"title":"How many more purported pieces are out there?","post":"Is it real? Who knows.\nOne can always check. And if it is real -then I think it is worth the purchase, and bringing it into responsible hands.\n\n","date":"January 10, 2014 at 7:46 am","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","id":"comment-72873","author":"O.K.","site":"shroudstory"},{"title":"How many more purported pieces are out there?","post":"\nJudging by this relatively low-resolution photo, it is likely to be genuine.\n\n","date":"January 10, 2014 at 8:02 am","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","id":"comment-72878","author":"O.K.","site":"shroudstory"},{"title":"How many more purported pieces are out there?","post":"If this relic truly belongs to a monsignor in Rome then what is he doing selling it online? That’s simony. He should be handing it over to the Vatican. This smells very fishy.\n\n","date":"January 10, 2014 at 8:39 am","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","id":"comment-72883","author":"David Goulet","site":"shroudstory"},{"title":"How many more purported pieces are out there?","post":"Monsignor died in 2008.\n\n","date":"January 10, 2014 at 8:39 am","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","id":"comment-72884","author":"O.K.","site":"shroudstory"},{"title":"How many more purported pieces are out there?","post":"Why was it not bequethed to the Church then? Unless it was and the Church recognized it was a fake and refused it. As I said, fishy as fishy gets. I’d take my chances with a vial of Elvis sweat on Ebay over this one.\n\n","date":"January 10, 2014 at 11:52 am","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","id":"comment-72903","author":"David Goulet","site":"shroudstory"},{"title":"How many more purported pieces are out there?","post":"The Vatican does not own the relic.  If the Monsignor owned it, it would go to whomever he bequeathed it.  Relics can only be given away and it is the owner who decides what to do with it, not he Vatican.\n\n","date":"January 12, 2014 at 11:13 pm","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","id":"comment-73193","author":"Andy Weiss","site":"shroudstory"},{"title":"How many more purported pieces are out there?","post":"Hee hee! One of my favourite stores, as I have often mentioned before. A bit of Our Lady’s mantle? $3500. Or the Manger? $3750 (comes with assorted bits of stone from Calvary, the Sepulchre of the BVM, etc.) The True Cross? $9500 (quite a big splinter).\nHowever, this post has stimulated a thought. Given that almost every relic known to history has been chopped into innumerable fragments for dissemination among the faithful, including the crown of thorns, the nails, the cross and even the sepulchre, is it not surprising that the Shroud is so intact? The table of the last supper, everything the Holy Family ever wore – it’s all in shreds around the world. Only the Shroud remains substantially as it ever was, if it ever was, with only those two corners and a few stray threads missing.\n\n","date":"January 10, 2014 at 8:48 am","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","id":"comment-72885","author":"Hugh Farey","site":"shroudstory"},{"title":"How many more purported pieces are out there?","post":"Exactly Hugh. Which supports my belief that the Shroud was kept hidden, protected, for centuries for that very reason. It is one of the few relics where it only really holds its spiritual value if it is kept intact. This is the mother of all Christian relics, I would expect it was treated with the mother of all cautions.\n\n","date":"January 10, 2014 at 11:56 am","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","id":"comment-72904","author":"David Goulet","site":"shroudstory"},{"title":"How many more purported pieces are out there?","post":"Sadly, a close scrutiny of the relic OK judges to be genuine clearly shows a simple over-under weave, nothing like the 3-1 twill of the shroud. Also, I think this is an archive entry and no longer for sale. For current offers go to http://www.russianstore.com/relics.htm.\nEnjoy!\n\n","date":"January 10, 2014 at 9:02 am","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","id":"comment-72887","author":"Hugh Farey","site":"shroudstory"},{"title":"How many more purported pieces are out there?","post":"Complete and total fraud, the true cross was destroyed by Saladin during the Crusades\n\n","date":"January 10, 2014 at 9:11 am","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","id":"comment-72888","author":"Vincenzo Giovanni Ruello","site":"shroudstory"},{"title":"How many more purported pieces are out there?","post":"Hugh: \nSadly, a close scrutiny of the relic OK judges to be genuine clearly shows a simple over-under weave, nothing like the 3-1 twill of the shroud.,/I>\nMaybe, I must truly admit that my first impression was perhaps over-optimistic, but I don’t say anything definetly.\nAlso, I think this is an archive entry and no longer for sale. For current offers go to http://www.russianstore.com/relics.htm.\nEnjoy!\nHee hee! One of my favourite stores, as I have often mentioned before. A bit of Our Lady’s mantle? $3500. Or the Manger? $3750 (comes with assorted bits of stone from Calvary, the Sepulchre of the BVM, etc.) The True Cross? $9500 (quite a big splinter).\nHugh, I am not an expert in that field, but looking at those gold-silver reliquaries, the prices seem to be relatively modest. I don’t think it pays off for the forgers to produce such reliquaries and sell them relatively cheap. And if they are original, and sealed -then what? Not everything \nRemember, numerous wars ravaged Europe through the centuries. Looting was very common. It is hard to imagine how innumerable number of treasures circulate the black market -outside any control of authorities. That’s why, instead of mockery, one should monitor that trade, to bring priceless items back under proper control.\nNot everything sold on flea market is a crappy forgery!\nHowever, this post has stimulated a thought. Given that almost every relic known to history has been chopped into innumerable fragments for dissemination among the faithful, including the crown of thorns, the nails, the cross and even the sepulchre, is it not surprising that the Shroud is so intact? The table of the last supper, everything the Holy Family ever wore – it’s all in shreds around the world. Only the Shroud remains substantially as it ever was, if it ever was, with only those two corners and a few stray threads missing.\nBecause it has the image on it. That’s why it cannot be fragmented so easily.\nVincenzo:\nComplete and total fraud, the true cross was destroyed by Saladin during the Crusades\nIt is only partiallly true. The True cross was already fragmented in Sain Helena times. The Saladin’s booty was only small fragment of it. \nThe total volume of True Cross is estimated to be between 36 000 cm^3, up to 178 000 cm^3, while the total amount of the alleged relics of True Cross is less than 4 000 cm^3.\nSome of the rest of it is perhaps being traded on russianstore.com, and similar places.\n\n","date":"January 10, 2014 at 3:29 pm","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","id":"comment-72923","author":"O.K.","site":"shroudstory"},{"title":"How many more purported pieces are out there?","post":"For some interesting background on some authentic Shroud relics I saw in Portugal that came from the Savoy family, read the article by Portuguese relic expert Carlos Evaristo at http://www.shroud.com/pdfs/fatima2011.pdf \nHere is a brief quote:\n“Maria Pia, who was the daughter of the first King of unified Italy, Vittorio Emanuele II, at 15 years of age wed Portugal’s King Luis I in 1862 bringing with her to Portugal a series of Holy Relics from the Shroud of Turin.”\n\n","date":"January 10, 2014 at 8:58 pm","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","id":"comment-72969","author":"Barrie Schwortz","site":"shroudstory"},{"title":"How many more purported pieces are out there?","post":"Relics are not permitted to be sold.\n\n","date":"January 12, 2014 at 11:09 pm","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","id":"comment-73192","author":"Andy Weiss","site":"shroudstory"},{"title":"How many more purported pieces are out there?","post":"Selling relics? Perish the thought. Sacrilege. However, relics these days usually come in reliquaries, elaborately decorated and jewelled monstrances of unique artistic and cultural value. That’s what you pay for at sites like RussianStore.com. Then there’s provenance, postage, packing, insurance…\nBut the relics themselves? Completely free and gratis, of course…\n\n","date":"January 13, 2014 at 4:13 am","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","id":"comment-73205","author":"Hugh Farey","site":"shroudstory"},{"title":"How many more purported pieces are out there?","post":"Any Monsignor who believed he had apiece of the Shroud in his possession and did not provide for it being given to the Church for all the faithful to enjoy upon his demise…well, that’s an interesting Monsignor\n\n","date":"January 13, 2014 at 8:26 am","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","id":"comment-73221","author":"David Goulet","site":"shroudstory"},{"title":"How many more purported pieces are out there?","post":"“The total volume of True Cross is estimated to be between 36 000 cm^3, up to 178 000 cm^3, while the total amount of the alleged relics of True Cross is less than 4 000 cm^3.”\nI think this is based on the researches of Charles de Fleury. First he estimated the volume of the cross based on the weight he guessed Jesus could carry and the average density of pinewood, which seems a curious way of making a wild guess, and came up with a volume of about 179 000 cm3. This would make a cross 4m high, 3m across, of planks 25 cm wide and 10cm thick, which is absurd. He then added up a handful of relics whose dimensions he also largely guessed at, and arrived at about 4 000 cm3, which seemed to him far too few, so he arbitrarily multiplied this by ten, arriving at about 40 000 cm3. To consider any of this serious archaeology is risible. (Information from http://www.catholiceducation.org/articles/facts/fm0150.htm)\nBut undeterred, we will do the same! I’m going for a cross 3m high (including the bit in the ground) and 2m wide, of planks 20cm across and 5cm thick. That’s 50 000 cm3, which fits with the smaller volume above sufficiently well. Wikipedia gives the dimensions of six pieces, and mentions two other sites claiming to have entire ‘wings’ each. The six pieces add up to about 3000 cm3, and the two wings cannot be less than another 10000 cm3. That gives us 37 000 cm3 to account for. On ebay as I write, there are about 70 pieces for sale. They are mostly in the form of crosses made of two splinters, say 10mm and 7mm long, and cross section 1mm – say 0.01cm3, or 100 to the cubic centimetre. How can we estimate the total number of these purported relics around the world? I’m guessing 1 for every ten thousand Catholics – so a total of about 100000 relics, say another 1000 cm3’s worth. \nI’ve now accounted for 14 000 cm3 of my original 50 000. It seems that de Fleury was correct.\nBut wait… Grzegorz Górny’s new book “Witnesses to Mystery” says that “the True Cross was made of Black Pine – pinus negra,” and claims that one of the ‘wings’ of the True Cross (in Spain) was found to be made of Cupressus sempervirens (Mediterranean cypress), while Wikipedia says that four of the “ten particles with surviving documentary provenances by Byzantine emperors” in Europe are made of Olive. What’s more, Black Pine does not grown in Israel.\nThe message is that just because there aren’t, in fact, enough fragments of the True Cross to build a battleship doesn’t of itself mean that any of them are genuine.\n\n","date":"January 13, 2014 at 3:30 pm","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","id":"comment-73240","author":"Hugh Farey","site":"shroudstory"},{"title":"How many more purported pieces are out there?","post":"Hugh, here you have the total account for major parts of the True Cross, from Hesemann’s book:\n\nI wrote in post: https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/#comment-59534\nAs to the weight of the cross, we know with a high probability its original dimensions. The cross was slotted into a hole -a stone ring (11.5 cm in diameter) serving for that purpose was found in the Church of the Holy Sepulchre in 1986, see Witnesses of Mystery pg. 310-313. It is estimated the cross was no higher than say, 250 cm. The Good Theft Patibulum, currently in Rome’s Santa Croce in Gerusalemme (see Thiede&Ancona The Quest for The True Cross and Pierluigi Baima-Bollone Sindone, 101 domande e risposte) is 178 (but originally it was probably longer, say 200 cm) x13 x 13cm.\nThis gives us estimated cross volume of 59767 cm^3. Giving estimated wood density of 0.5 g/cm^3 this would give us about 30 kg. Contrary to widespread myth, it was entirely possible for a man to carry the whole cross. \nA small correction, if we assume density of 0.75 g/cm^3 this would give us about 45 kg\nAs to the spiecies, the reports are hardly reliable. I have seen claims of oak, olive, pine, and cypress. Allowing for some misidentification, Hesemann claims that no more than 3 spiecies (for vertical and transverse beams, as well for Titulus -which probably was made from walnut) could have been used.\nDe Fleury’s book is here: https://archive.org/details/mmoiresurlesin00rohauoft\n\n","date":"January 13, 2014 at 4:17 pm","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","id":"comment-73242","author":"O.K.","site":"shroudstory"},{"title":"How many more purported pieces are out there?","post":"Fantastic OK, your depth of sources never ceases to amaze me!\n\n","date":"January 13, 2014 at 4:42 pm","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","id":"comment-73245","author":"Hugh Farey","site":"shroudstory"}]
