[{"title":"A revised flow-chart model for why the Turin Shroud was first documented in 14th century France.","post":"Hello again Hugh (congrats btw on your BSTS appointment)\nEnter (St.Lawrence martyrdom ) into Google, click on Images, and that picture of the naked TS-like depiction of St.Lawrence is in the third row of images. So far I’ve been unable to find who painted it, and when, though it looks quite early (pre-16th century?). \nAny thoughts about the reverse side of the Lirey badge? Why show that peculiar trellis-like pattern strung between posts if not intended to represent a horizontal grill, like say a grill for roasting Templars en masse?\n","date":"February 11, 2014 at 11:22 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2014/02/11/a-revised-flow-chart-model-for-why-the-turin-shroud-was-first-documented-in-14th-century-france/","cat":"2000_year_old_earthquake","id":"comment-2984","author":"colinsberry","site":"colinberry"},{"title":"A revised flow-chart model for why the Turin Shroud was first documented in 14th century France.","post":"This is getting quite exciting! Also see http://blogs.getty.edu/iris/meet-the-artist-who-helped-launch-the-renaissance-in-florence/ for some scourge marks as well. Where is your Lawrence from, and more importantly when? I can’t find it elsewhere.\n","date":"February 11, 2014 at 11:00 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2014/02/11/a-revised-flow-chart-model-for-why-the-turin-shroud-was-first-documented-in-14th-century-france/","cat":"2000_year_old_earthquake","id":"comment-2983","author":"Hugh Farey","site":"colinberry"},{"title":"A revised flow-chart model for why the Turin Shroud was first documented in 14th century France.","post":"PS. I see that image of the naked saint with those “scourge marks” is right in the middle of the period of interest,see caption below, i.e. between the Templar roastings and the Lirey badge.  Yet we’re constantly told that the TS image couldn’t possibly be of medieval artistic provenance on account of the nudity. Strange that there hasn’t been mention of the huge Lawrence-related canon of art  Across The Way, given that so many of its contributors, yourself included, are keen students of that sort of thing.\nCaption: “The Martyrdom of Saint Lawrence from the Laudario of Sant’Agnese, about 1340, Pacino di Bonaguida. Tempera and gold leaf on parchment, 7 1/2 x 8 3/16 in.”\nScourge marks? I have not come across any reference to a preliminary scourging, have you? Might not those marks represent where those nasty sharp-looking pitchfork or trident ends were used to press the victim down, or generally restrained? He’s shown unrestrained in that image. Others show the feet secured to the grid with what appears to be cord or similar (even if a fire-proof chain would seem more appropriate).\n","date":"February 12, 2014 at 8:27 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2014/02/11/a-revised-flow-chart-model-for-why-the-turin-shroud-was-first-documented-in-14th-century-france/","cat":"2000_year_old_earthquake","id":"comment-2987","author":"colinsberry","site":"colinberry"}]
