[{"title":"I think HE sees?","post":"Dan, stop kidding yourself. CB is preaching full blown conspiracy theory as wild and wooly as the Leonardo da Vinci silliness.\n\n","date":"November 19, 2014 at 7:21 am","url":"https://shroudstory.com/2014/11/19/i-think-he-sees/","cat":"history","id":"comment-172046","author":"Paulette","site":"shroudstory"},{"title":"I think HE sees?","post":"Thank you for this healthy comment. \nColin is going around in circle. He is in trouble, believing in and reinforcing his own conspiracy theory, posts after posts, months after months.\n\n","date":"November 19, 2014 at 9:39 am","url":"https://shroudstory.com/2014/11/19/i-think-he-sees/","cat":"history","id":"comment-172063","author":"anoxie","site":"shroudstory"},{"title":"I think HE sees?","post":"Has there ever been a conspiracy theory up till now that showed so glacial a rate of progress?\nFull blown? Wild? Wooly. Give me time. Maybe I’ll be able to finger a Pope as prime instigator. Film rights?\n\n","date":"November 19, 2014 at 8:14 am","url":"https://shroudstory.com/2014/11/19/i-think-he-sees/","cat":"history","id":"comment-172052","author":"Colin Berry","site":"shroudstory"},{"title":"I think HE sees?","post":"Hello Colin\nYou are sounding like errrr… Ian Paisley now, one step before beginning to vomit. You know he lost to Martin McGuinness.\nWe need your comments as a published scientist. Are you working on Rogers versus Fanti?\n\n","date":"November 19, 2014 at 9:50 am","url":"https://shroudstory.com/2014/11/19/i-think-he-sees/","cat":"history","id":"comment-172065","author":"Louis","site":"shroudstory"},{"title":"I think HE sees?","post":"Every crime requires a motive and the opportunity. Colin is using a detective’s approach to his theory. In this case the opportunity is the technological ability — which means he must demonstrate that the medieval crafter of the TS had that opportunity. Thus far I’d say the evidence is not conclusive to proving this. But neither is there conclusive evidence that the crafter did not have the opportunity. \nAs establishing opportunity is difficult with this case, the detective naturally considers if there is a strong motive. Here the challenge is that, on the surface, it is very difficult to establish and prove there was a motive to create the TS — in the form and detail that we see. However, sometimes a detective must take what clues he has to try and build a narrative that fits those clues, in an effort to piece together a motive.\nI don’t find Colin’s narrative irrational. But neither would I expect a jury to convict based on what evidence we’ve been presented thus far. The investigation is ongoing, however.\n\n","date":"November 19, 2014 at 10:44 am","url":"https://shroudstory.com/2014/11/19/i-think-he-sees/","cat":"history","id":"comment-172072","author":"David Goulet","site":"shroudstory"},{"title":"I think HE sees?","post":"“Here the challenge is that, on the surface, it is very difficult to establish and prove there was a motive to create the TS — in the form and detail that we see. However, sometimes a detective must take what clues he has to try and build a narrative that fits those clues, in an effort to piece together a motive.”\nNice fair-minded comment DavidG, as ever.\nMight this short extract provide a clue as to motive?  It’s from:\nhttp://shroud2000.com/FastFacts.html\nThe Historical Trail\nFast forward to France in the Middle Ages for now because that is where the fully documented and continuous history of the Shroud begins. But there is more to the story on the Shroud’s probable history. We’ll get to that later. \n1353: The Shroud’s fully documented history began in Western Europe when it was revealed by Geoffrey DeCharney (sic) in Lirey, France. \n1452: DeCharney’s granddaughter sold the cloth to the Duke of Savoy in exchange for two castles. It remained in the Savoy family until 1982 when it was officially willed to the Catholic church although it had custodial care of the Shroud for centuries. \nOr am I building castles in the air? (Well, two for starters, which isn’t bad as family heirlooms go. Beats silverware any day – tarnishes).\n\n","date":"November 19, 2014 at 11:00 am","url":"https://shroudstory.com/2014/11/19/i-think-he-sees/","cat":"history","id":"comment-172074","author":"Colin Berry","site":"shroudstory"},{"title":"I think HE sees?","post":"Just don’t build a moat for those castles, as it might rain on someone’s parade. ;)\nWhat we must be mindful of is that we humans tend to presume narratives when none exist. We’re hardwired for narrative and that’s a good thing — but it does often take us down some paths that weren’t truly paths at all. Other times what we didn’t think was a path turns out to be the way home. Unfortunately the only way to discover which is which is to step into the unknown. Pack a torch and some lunch and see where you end up.\n\n","date":"November 19, 2014 at 11:21 am","url":"https://shroudstory.com/2014/11/19/i-think-he-sees/","cat":"history","id":"comment-172079","author":"David Goulet","site":"shroudstory"},{"title":"I think HE sees?","post":"Personally I prefer waterways to paths – more sedate progress. \nAm exploring a certain creek at the moment. Now then, where did I put that paddle?\n\n","date":"November 19, 2014 at 11:35 am","url":"https://shroudstory.com/2014/11/19/i-think-he-sees/","cat":"history","id":"comment-172080","author":"Colin Berry","site":"shroudstory"},{"title":"I think HE sees?","post":"CB: “1452: DeCharney’s granddaughter sold the cloth to the Duke of Savoy in exchange for two castles. It remained in the Savoy family until 1982 when it was officially willed to the Catholic church although it had custodial care of the Shroud for centuries.” \nI doubt that it was merely a pecuniary purpose that prompted Margaret de Charnay to dispose of the Shroud to the Savoys.  It was removed from the Lirey Church by Margaret and her second husband Humbert for safe-keeping in 1418 and duly receipted, as it was plain that in this small village church, it was a vulnerable target from the English, marauding Jacquerie, and various acquisitive clergy jealous of its pilgrim attractiveness, and various French officials.  \nFrom 1418 Margaret and Humbert held annual expositions on the banks of the Doubs River and additional displays elsewhere, Liege 1449, Macon 1452.  It seems that the Savoys had expressed an interest in purchasing it, and political conditions in France remained uneasy.  Despite two marriages Margaret remained childless and with increasing age likely felt the weight of responsibility in ensuring an ultimate secure home for her precious relic.  \nIn 1452 she finally decided that the safest haven for it was with the House of Savoy who compensated her with the castle and estates.  The canons of Lirey continued to agitate for its return, and in 1457 Margaret was threatened with excommunication if she did not return it as previously agreed by Humbert.  Duke Louis of Savoy negotiated compensation to the Lirey canons.  Margaret died soon afterwards in 1460.  \nWhat might have become of the Shroud if she had decided otherwise and it had stayed in France?  Few such relics survived the excesses of the 18th century French Revolution.  Margaret’s decision to secure the Shroud in Savoy was clearly providential.\n\n","date":"November 19, 2014 at 2:47 pm","url":"https://shroudstory.com/2014/11/19/i-think-he-sees/","cat":"history","id":"comment-172098","author":"daveb of wellington nz","site":"shroudstory"},{"title":"I think HE sees?","post":"I’m minded to make a “gift” of my childhood stamp collection to the nation, daveb. That’s to keep it safe from predators (dog, grandchildren, taxman). All that’s needed to bring me closure is a small token of appreciation, say a manor house in the west country and the latest Range Rover and it’s a done deal. \nLife is devoid of meaning without these selfless gestures of Christian charity, wouldn’t you agree?.\n\n","date":"November 20, 2014 at 12:23 am","url":"https://shroudstory.com/2014/11/19/i-think-he-sees/","cat":"history","id":"comment-172155","author":"Colin Berry","site":"shroudstory"},{"title":"I think HE sees?","post":"Cape of Good Hope, triangular 1853 goes for US$40,000;  Perot round stamp US$115,000;  May 2 Penny blacks can fetch a good price.  How many have you got?  It all adds up, you could still get your manor house and SUV.  Or you could leave them to the grand-children, passage of time increases their value.  But Margaret de Charnay had none, and what was another castle or two to the House of Savoy, if they wanted it badly enough?  I wonder who she left the castle to?  She only had it for eight years.\n\n","date":"November 20, 2014 at 3:25 am","url":"https://shroudstory.com/2014/11/19/i-think-he-sees/","cat":"history","id":"comment-172179","author":"daveb of wellington nz","site":"shroudstory"}]
