[{"title":"Intellectual Dishonesty in Shroud of Turin Research","post":"What constitutes intellectual dishonesty, as opposed to plain dishonesty? I’m not sure I get the nuance and how you can prove ‘intellectual dishonesty’. I think you should set out some parameters so a poster knows what kind of proof is acceptable.\nThat being said I agree completely with your decision to protect the integrity of the blog.\n\n","date":"September 14, 2013 at 9:21 am","url":"https://shroudstory.com/2013/09/14/intellectual-dishonesty-in-shroud-of-turin-research/","cat":"history","id":"comment-44195","author":"David Goulet","site":"shroudstory"},{"title":"Intellectual Dishonesty in Shroud of Turin Research","post":"This is a good approach and will help to improve the blog, but it should go hand in hand with the prohibition of personal attacks and mean insinuations. As for intellectual honesty, Rogers may have changed his mind about invisible mending, which did not make him less sceptical about the supernatural it seems. Apparently it did not clash with his worldview, for he had other means to express his views about a natural process in image formation. So far so good, but then it does not seem to have been the case when he co-authored a paper which involved evolution. In this paper the process was automatic, and nothing was said about the rationality. In other words, the question about where the rationality came from was conveniently avoided. No one expects a scientist to become a philosopher overnight, but it was something that would require just a few minutes of thinking. Was it bias or intellectual dishonesty? One must remember that when a scientist quietly embeds a worldview into his science he ceases to be a scientist because he is then indulging in scientism.\n\n","date":"September 14, 2013 at 10:31 am","url":"https://shroudstory.com/2013/09/14/intellectual-dishonesty-in-shroud-of-turin-research/","cat":"history","id":"comment-44201","author":"Louis","site":"shroudstory"},{"title":"Intellectual Dishonesty in Shroud of Turin Research","post":"All I’ll say is; ‘It’s about time, Dan’, and I second Louis’s first comment; “This is a good approach and will help to improve the blog, but it should go hand in hand with the prohibition of personal attacks and mean insinuations.” -(Although I am not myself completely innocent of doing the same, I try to keep it lite, and it is done usually in feeble attempts at humour.)\nR\n\n","date":"September 14, 2013 at 3:41 pm","url":"https://shroudstory.com/2013/09/14/intellectual-dishonesty-in-shroud-of-turin-research/","cat":"history","id":"comment-44221","author":"Ron","site":"shroudstory"},{"title":"Intellectual Dishonesty in Shroud of Turin Research","post":"Thanks Ron, some sense of humour is also needed, it is “in”, what should also be “out” is the use of four-letter words – which makes it necessary to delete comments.\n\n","date":"September 14, 2013 at 3:55 pm","url":"https://shroudstory.com/2013/09/14/intellectual-dishonesty-in-shroud-of-turin-research/","cat":"history","id":"comment-44223","author":"Louis","site":"shroudstory"},{"title":"Intellectual Dishonesty in Shroud of Turin Research","post":"I see it as one of the worst forms of ‘ad hominem’ argument. However even the milder forms are too lazy an option in my view. Controversy should focus on issues, not the advocates of whatever it is we disagree with. In fact AH is merely a distractive ploy away from the issue. For example, I agree with Louis that there are better NT scholars than John Dominic Crossan, but when I find something worthwhile in Crossan, to then deride the man is a distraction from the issue. Certainly, kings have shot the messenger from time immemorial, (see Antony and Cleopatra), but that is not to affect the message. Shoot the pianist if you will, but don’t then expect to hear any more music!\n\n","date":"September 15, 2013 at 3:25 am","url":"https://shroudstory.com/2013/09/14/intellectual-dishonesty-in-shroud-of-turin-research/","cat":"history","id":"comment-44276","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Intellectual Dishonesty in Shroud of Turin Research","post":"After having interviewed more than one of the world’s topmost biblical scholars  — far superior to J.D. Crossan — and confronted them with forthright questions, and spoken to  one of the most respected epigraphers in the field of Biblical Archaeology in Israel a very clear picture was obtained of the controversy surrounding Jesus.\nThere were attempts to dodge questions by one scholar but these required answers because sensationalists were hurling all sorts of accusations against respected scholars and institutions. They were therefore duly answered but that was not the case when it came to Jesus. One reply was not at all convincing, it was simply no reply.  \nWhen it comes to Biblical studies, we, in the 21st century, have no pipeline to Jesus apart from the New Testament and the christologies, which are normative of Christian faith. The bodily resurrection of Jesus is a basic part of the NT kerygmatic proclamation and a fundamental affirmation of Christian faith. \nWhen J.D.Crossan rejects this, there is no reason why he should be included among Catholic biblical scholars, even though he is said to have “faith”. His point of view is something like what the Unitarians believe.\n\n","date":"September 15, 2013 at 10:30 am","url":"https://shroudstory.com/2013/09/14/intellectual-dishonesty-in-shroud-of-turin-research/","cat":"history","id":"comment-44298","author":"Louis","site":"shroudstory"},{"title":"Intellectual Dishonesty in Shroud of Turin Research","post":"Further to the above, there is an interesting study by the historian and Talmudic scholar Daniel Boyarin entitled “The Jewish Gospels: The story of the Jewish Christ”, which goes beyond what we can learn from the Dead Sea Scrolls.\n\n","date":"September 15, 2013 at 11:18 am","url":"https://shroudstory.com/2013/09/14/intellectual-dishonesty-in-shroud-of-turin-research/","cat":"history","id":"comment-44301","author":"Louis","site":"shroudstory"},{"title":"Intellectual Dishonesty in Shroud of Turin Research","post":"My point is that the WHO ought to be irrelevant, and it is the WHAT that should be addressed.  WHAT can be addressed and argued, whereas the WHO tends to be too much a matter of subjective judgment and opinion.  I’d have to agree that “By their fruits, you shall know them.” Thank you for the reference to Daniel Boyarin.\n\n","date":"September 15, 2013 at 4:05 pm","url":"https://shroudstory.com/2013/09/14/intellectual-dishonesty-in-shroud-of-turin-research/","cat":"history","id":"comment-44340","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Intellectual Dishonesty in Shroud of Turin Research","post":"This comment was posted in the wrong thread. Here it is:\nSeptember 15, 2013 at 5:59 pm | #5\nReply | Quote\nFather Joseph A. Fitzmyer’s book, mentioned in a previous comment, was not written from the point of view of faith and is a must read for Catholic, Protestant, Orthodox and Jewish scholars. In his review, Father Daniel Harrington, another famous American Jesuit scholar, explains how the book is a thorough study of the concept of “Messiah”.\nBut it seems that many in the world are involved in soul-searching, unwilling to read scholarly books about the Bible, and go beyond what Boteach and Boyarin or even Fitzmyer have said. That was the case with Laura Schlessinger, criticised by Boteach. Go to the link\nhttp://forward.com/articles/7887/dr-laura-loses-her-religion/\n\n","date":"September 15, 2013 at 6:16 pm","url":"https://shroudstory.com/2013/09/14/intellectual-dishonesty-in-shroud-of-turin-research/","cat":"history","id":"comment-44348","author":"Louis","site":"shroudstory"},{"title":"Intellectual Dishonesty in Shroud of Turin Research","post":"I read the link re Laura Schlessinger with some interest.  She has no profile in New Zealand of which I’m aware, whereas other US celebrity entertainers, Oprah Winfrey and Ellen have had regular TV programmes here, and have their own following. It prompted me to check out a few demographic comparisons.  \nAustralia is somewhat similar to USA, although Baptists do not figure so prominently. Catholics are about 25% of the Australian population, as with USA. Part of this may be due to a heritage of England trasnportation of Irish convicts and the discriminatory laws during the early colonial era. In USA it has been sustained by Mexican/Spanish immigration. Judaism in USA is about 1.7% of the total population, with the largest Jewish population outside of Israel. In Australia the 2006 census reported Judaism as only 0.3% of the population. \nThe situation in NZ is quite different. A now nominally secular society, Catholicism was stable at about 14% of the total population for several decades.  It had about the third or fourth largest following of the Christian denominations, after Anglican (= Episcopalian) and Presbyterianism (Scottish immigration). Methodism (= Wesleyanism / Welsh) also featured. The latest censuses quote Catholicism in NZ at about 12.3% of the total population, but it now has the second largest following after the Anglicans. Some of this is due to immigration from the Philippines and other SE Asia or Pacific countries. \nJudaism in NZ is minuscule compared to Australia and USA. About 3,800 claimed to be of the Jewish faith in the latest census, in a population of about 4,000,000, i.e. less than 0.1%. Some writers have claimed that up to about 10,000 NZers may be Jewish. As elsewhere, both Jews and Catholics are more prominent and influential in public affairs than their numbers would indicate – they both pull beyond their weight. There have been about two or three Jewish Prime Ministers of NZ, one of whom converted to Christianity. The present Prime Minister, John Key had a Jewish mother, but he claims to be agnostic. There have been at least four Catholic premiers or prime ministers of NZ, and the present Minister of Finance Bill English is a prominent Catholic.\n\n","date":"September 16, 2013 at 12:29 am","url":"https://shroudstory.com/2013/09/14/intellectual-dishonesty-in-shroud-of-turin-research/","cat":"history","id":"comment-44377","author":"daveb of wellington nz","site":"shroudstory"}]
