[{"title":"It Continues:  James, son of Joseph, brother of Jesus","post":"In what language?\n\n","date":"December 28, 2013 at 1:19 pm","url":"https://shroudstory.com/2013/12/28/it-continues-james-son-of-joseph-brother-of-jesus/","cat":"history","id":"comment-69575","author":"Andy Weiss","site":"shroudstory"},{"title":"It Continues:  James, son of Joseph, brother of Jesus","post":"The whole business of Talpiot has in my opinion been terribly muddied by the adoption of a variety of agenda by the various stake-holders. 1) By the IAA in defending the incompetent way in which a potentially important Christian site had been investigated; 2) By the blindness of the far Christian right in their false assumption of a non-existent claim that the Jesus ossuary had contained the bones of Jesus (it only contained a carpal bone and fragments of cloth) 3) By the outrageous and spurious sensationalist claims of Simcha Jacobovici 4) By the IAA’s false application of statistical theory in the remarkable combination of names found in the tomb 5) By assumptions that the legitimacy of the burial site at the Church of the Holy Sepulchre was somehow threatened by any claim for Talpiot 6) That it challenged claims of other burial sites for other family members. \nIt will now never be known whether the Talpiot tomb was in fact the Jesus family burial tomb or not, as all key evidence has been disposed of, bones into an unknown common grave, and the ossuaries thoroughly cleaned.  Only the 2002 “restoration” of the Turin Shroud compares in the exercise of such incompetence.\n\n","date":"December 28, 2013 at 3:38 pm","url":"https://shroudstory.com/2013/12/28/it-continues-james-son-of-joseph-brother-of-jesus/","cat":"history","id":"comment-69616","author":"daveb of wellington nz","site":"shroudstory"},{"title":"It Continues:  James, son of Joseph, brother of Jesus","post":"It continues because people with biases, in this case anti-Christian or even anti-Catholic, just do not want to give up and some of them have not-so-hidden agendas like Simcha Jacobovici.\nExactly three months before, repeat, before, the Israel Antiquities Authority stated that the inscription was a partial forgery I published (in print, not posted on the internet) an article saying the same thing. It was then run on a Shroudie e-mail list from Ohio, also before, repeat, before, the IAA declaration. \nYears after that a Protestant publisher kindly sent me the book on the topic by Shanks/Witherington to read and comment. I thanked them and sent them a copy of my article and they just kept quiet because they had to. Ben Witherington III, of Asbury Theological Seminary, had said that the Catholic Church had to “revisit” the Virgin Birth in the book on the James ossuary he co-authored. Later, as soon as the Talpiot sensationalism reached the front pages of newspapers across the world he quickly changed his mind and declared, “No, James is buried elsewhere”.\nThe ossuary cracked when it was flown to Toronto. Where was the crack? Exactly between “Jesus son of Joseph” and “brother of James”. It was as though Jesus sent a message telling those who swallowed the whole story hook, line and sinker upto where the inscription was authentic and where the forgery began!\nThe full Talpiot story is on the Holy Shroud Guild website.\n\n","date":"December 28, 2013 at 5:02 pm","url":"https://shroudstory.com/2013/12/28/it-continues-james-son-of-joseph-brother-of-jesus/","cat":"history","id":"comment-69641","author":"Louis","site":"shroudstory"},{"title":"It Continues:  James, son of Joseph, brother of Jesus","post":"Louis, did you mean there was a crack between James son of Joseph  … brother of Jesus?\n\n","date":"January 24, 2014 at 3:18 pm","url":"https://shroudstory.com/2013/12/28/it-continues-james-son-of-joseph-brother-of-jesus/","cat":"history","id":"comment-74426","author":"Annette Cloutier","site":"shroudstory"},{"title":"It Continues:  James, son of Joseph, brother of Jesus","post":"That’s right, Annette. You might find the pdf article on Talpiot interesting:\nhttp://www.holyshroudguild.org/uploads/2/7/1/7/2717873/jesus__was__not__buried__in__talpiot_parts_i_and_ii_pdf.pdf\nMore on the topic in about two months time.\n\n","date":"January 24, 2014 at 4:13 pm","url":"https://shroudstory.com/2013/12/28/it-continues-james-son-of-joseph-brother-of-jesus/","cat":"history","id":"comment-74447","author":"Louis","site":"shroudstory"},{"title":"It Continues:  James, son of Joseph, brother of Jesus","post":"Louis, thank you for the reference to your paper, which I have now down-loaded, read, and found most informative. It seems apparent from the inspection of Golan’s workshop that he was definitely involved in the manufacturing of forged artifacts. To what extent this involved the “James ossuary” was unable to be proven. \nHowever I think that the status of the Talpiot tomb still remains ambiguous, because of the way the whole business was mishandled. It seems strange that the ultra-orthodox interference of archaeological investigations is tolerated by those in authority, and security at such sites seem unduly lax. Consequently we remain seldom the wiser as to what such sites might have actually revealed, and entrenched positions persist as the accepted wisdom without amendment. \nBased on the observed frequency of names on ossuaries, I ran a number of Monte Carlo simulations of 1000 runs each. Even based on variations of the same names, the best I could achieve was six runs in a 1000 of four qualifying names (Mary, Joseph, Jesus, & [Jude or Matthew]). I was unsuccessful at obtaining any runs of five or more complying names. This persuades me that there may be much more to the statistical analysis of the names than others seem prepared to acknowledge.\n\n","date":"December 28, 2013 at 9:41 pm","url":"https://shroudstory.com/2013/12/28/it-continues-james-son-of-joseph-brother-of-jesus/","cat":"history","id":"comment-69713","author":"daveb of wellington nz","site":"shroudstory"},{"title":"It Continues:  James, son of Joseph, brother of Jesus","post":"David, it is important to stress that the government returned the James ossuary to Oded Golan but continues to officially maintain that the second part of the inscription, “akhui d’Yeshua”, “brother of Jesus” is a forgery, exactly as I wrote in my article that was published before the IAA report came out. When the police raided Golan’s apartment they found dental drills and it is known that he was in contact with a Coptic Christian antiquarian in Egypt, who did not appear at the trial. Now that is not to say that Golan himself forged the second part of the inscription, it is still not known who did the job.   \n“Akhui” can mean “brother”, “half brother”, “step brother”, “cousin”, “relative”, even “partner”, in Aramaic, just as “adelphos” “plural “adelphoi”, in Greek, can also be understood as “relative” or “kinsman”, as anyone who reads the Gospel according to Mark will understand. Above all, Jesus, nailed to the cross and sensing that death was approaching, was worried about who would look after his mother. What was “brother” James doing and why was he not around? Why did Jesus have to ask a disciple to look after his mother? Moreover, Mary herself must have thought about her future, making Jesus tell her where to look for help.\nThe Orthodox Jewish community, particularly the ultra-orthodox branch known as the “haredim”, are very strict about burial sites and the government has to obey them. They were the ones who threw stones on Jerusalem District Archaeologist Amos Kloner. Do I need to say that the orthodox norms have to be respected, even though it complicates matters for those in the field of biblical archaeology? Other belief communities like the Shintos in Japan or the Native American Indians, for example, are also careful when it comes to burial sites. It is not so among the Hindus, because of the belief in reincarnation, also involving metempsychosis, and whose dead are cremated and the ashes scattered on large water bodies like rivers or seas.\nStatistics do help but it is not advisable to place much importance on them. What we can with certainty is that the names on the ossuaries are:\nJesus? Son of Joseph\n( the more respected paleographers and archaeologists agree that the name “Jesus” is by no means certain, therefore the question mark. It is worth noting that this question mark appeared in the original report, decades before the controversy began)\nMary\nMariam (or Mariame) and Mara\n(it is certainly not “Mary Magdalene”, as written in the two-part article “Jesus was not buried in Talpiot” on the Holy Shroud Guild website, which you found informative). As mentioned in my article, even Professor François Bovon of Harvard distanced himself from the allegations made by Jacobovici, realising that he had been led into a trap. He made it clear that, in his view, Jesus was buried in the Church of the Holy Sepulchre area, as also maintained by Dan Bahat and Amos Kloner, both of them former Jerusalem District Archaeologists.  \nJoses  \nJudas, son of Jesus\nThere is more to come shortly and I cannot release any information in advance. As you know, the advances in science make Bible interpretation even more difficult, with both fundamentalists and liberals saying things that are not at all convincing. \nYou may find some more useful information about this in the interview article “What do we know about the Bible? An interview with Joseph A. Fitzmyer, SJ” on the academia. edu website.\n\n","date":"December 29, 2013 at 11:51 am","url":"https://shroudstory.com/2013/12/28/it-continues-james-son-of-joseph-brother-of-jesus/","cat":"history","id":"comment-69843","author":"Louis","site":"shroudstory"},{"title":"It Continues:  James, son of Joseph, brother of Jesus","post":"Louis,\nThank you for persevering with your present commentary about Talpiot.  My preferred position is essentially one of neutrality, in that I continue to be open to the possibility that Talpiot may have been the last repository of the Jesus family ossuaries. Certainly, no-one can be in a position to assert it as such. \nThe allegation that the Mariamne/Mara ossuary is that of Mary Magdalen, seems mainly to rest on the 3rd century Valentinian Gnostic gospel of Philip, where she is named a favoured companion of Jesus, hardly a persuasive source. I would suspect that the author’s purpose might simply be to ratify marriage as a legitimate lifestyle, unless he had a more lurid intent. I understand that this ossuary is unusually ornate and the inscription, unlike the others, is in Greek, clearly setting it apart from the others. \nCharles Pellegrino has adopted a much more cautious approach in his assertions than has Jacobovice. He considers that any ossuaries at the Holy Sepulchre site would have been moved from there in about 40AD, when the city walls were extended, so that any claim for Talpiot does not compromise Holy Sepulchre as the original burial site. He also believes that no skeleton was ever placed in the Jesus ossuary, which he claims only contained a small carpal bone and cloth fragments. The name “Jesus(?) son of Joseph” is apparently preceded by a cross-mark.    \nPellegrino’s response to critics is: “If nothing else but an ossuary inscribed with the words ‘Jesus, son of Joseph’ were found in a tomb, bearing fibre evidence indicative of a missing body and two apparently sacred cloths, if these are indeed the two cloths described in John’s gospel, with a cross-mark attached to Jesus’ name, and a star on the lid – and if the antechamber bore a symbol known to the Jesuit order to this day as a glyph, translated as ‘Jesus Saviour of man’ – – if nothing else had been found, we would all be crazy not to look on with a sense of mystery and wonder.” We may interpret this how we may. \nOther acceptable explanations for the oddities in the chamber are easily found. For example the “Judah son of Jesus” might be explained by adoption, but passed off as a brother for his own protection.  Conceivably he may have been the disciple described in John’s gospel as the disciple whom Jesus loved. The various names are listed in Mark 6:3 “Is he not the carpenter, the son of Mary, and the brother of James and Joses and Judas and Simon? And are not his sisters here with us?”  \nThe statistics I used for my Monte Carlo simulation were the Rahmani statistics of 286 names appearing on 231 ossuaries in a population of 917, some 686 being uninscribed. Witherington also gives a fairly similar proportion of names in the Jewish population of the time.    \nFollowing Meier’s lead, I would have no problem with the brothers and sisters being directly related, although adoption would protect the doctrine of perpetual virginity, if that were an objection. \nI find the unusual combination of names a little too significant to ignore. Sadly the matter has now been too badly handled, for any satisfactory conclusion ever to be made.\n\n","date":"December 29, 2013 at 4:24 pm","url":"https://shroudstory.com/2013/12/28/it-continues-james-son-of-joseph-brother-of-jesus/","cat":"history","id":"comment-69875","author":"daveb of wellington nz","site":"shroudstory"},{"title":"It Continues:  James, son of Joseph, brother of Jesus","post":"Dave, I’m in total agreement with you here… I’ve often wondered if the first Gospel writer “Mark”, walked into the Jesus Family Tomb and got his characters:  Mariamne e Mara Mary the Queen after the tower overshadowing the tomb, the Majestic Tower of Mary gilded with gold and ivory (before the Romans ravaged it in 68)…Herod’s Hasmonean Queen… Mariamne?  Mark made her his Gnostic Gospel Queen:  Mary Magdalene.\n\n","date":"January 24, 2014 at 3:39 pm","url":"https://shroudstory.com/2013/12/28/it-continues-james-son-of-joseph-brother-of-jesus/","cat":"history","id":"comment-74438","author":"Annette Cloutier","site":"shroudstory"},{"title":"It Continues:  James, son of Joseph, brother of Jesus","post":"David,\nMany thanks for the comments.\nYes, there is no evidence that the Mariamene/Mara on one ossuary is Mary Magdalene. Professor François Bovon was totally unaware of the premise of the programme when he was interviewed, and distanced himself from the Talpiot sensationalism by saying that his interest was not historical but on the level of literary traditions. Father Joseph A. Fitzmyer went further, and although he found Professor Bovon’s paper “Le privilege pascal de Marie-Madeleine” good he also pointed out that in Part III, “Acta Philipi”, “no evidence was given that the Mariamne in that writing was the name of Mary of Magdala.” It is a problem when you use fourth-century literature to claim something about what went on in the first century in Jerusalem.\nCharles Pellegrino was more cautious than Simcha Jacobovici,but did not seem to have dedicated more time to homework. He consulted Father Mervyn Fernando of Sri Lanka about the Resurrection when this priest is not known for biblical studies, more for theology one could say, having been drawn into this area by the half-Indian, half-Spanish priest Raimundo Panikkar whom he met in the ashram of another priest, the Englishman Dom Bede Griffiths, in the south of India. Why didn’t he consult biblical scholars in the US when there are so  many good ones there?  \nYou are quite right when you say that Jacobovici has not been cautious in his assertions, and that he because he is desperate, even given to clutching at straws, going beyond Jerusalem by providing a link to the Kashmir tomb! So, if Jesus’ remains are not in Jerusalem they are in Kashmir, is it? It seems he had done even less homework than Pellegrino, as you will see in the article:\nhttp://holyshroudguild.org/uploads/2/7/1/7/2717873/the_quest_for_jesus_in_shroud_research.pdf.pdf \nUnfortunately the myth is being used for political purposes.\nJ.P. Meier, now a monsignor, is a good scholar, but has been challenged by two other well-known Catholic scholars, Luke Timothy Johnson in the US and Father Anthony Kelly in Australia. The Virgin Birth is not part of the earliest tradition, it was part of the developing Christology, but in New Testament times. Father Fitzmyer also sees a problem, which you can see in the interview-article\n“What do we know about the Bible? An Interview with Joseph A. Fitzmyer, SJ” on the academia.edu website.\nBut we can can go further because while he does point to the fact that the only ones who touch upon it are Matthew and Luke, he also draws attention to another fact: Paul knows of Jesus’ Davidic descent and stresses Jesus’ birth “from a woman”. He also knows of Jesus’ divine sonship and implies his pre-existence and neither of these details are considered by him to be in conflict with the two other preceding facts.\nIf there were adopted brothers and sisters around Jesus as he hung, nailed to the cross, there would be no worry about who would look after his mother.\nThere should be some news for you about the combination of names after I work on this and other material in March. All I can say now is that people who found this significant at the time of the publication of the Pellegrino/Jacobovici book are now more cautious, distancing themselves from what was claimed by the duo.\n\n","date":"December 29, 2013 at 6:35 pm","url":"https://shroudstory.com/2013/12/28/it-continues-james-son-of-joseph-brother-of-jesus/","cat":"history","id":"comment-69890","author":"Louis","site":"shroudstory"},{"title":"It Continues:  James, son of Joseph, brother of Jesus","post":"Where were the brothers at the crucifixion? With the other apostles? Mark 14:27: “I shall strike the shepherd and the sheep will be scattered” Likewise Zech 13:7, Matt 26:31. \nThe general consensus about the identity of the “disciple whom Jesus loved” is that it was the proto-author of the fourth gospel, merely on the grounds that the disciple John is not mentioned there at all. Maybe a slight chance it could have been another. I’ll go out on a limb and offer maybe it just could have been Judah, I agree it’s a long shot!\n\n","date":"December 29, 2013 at 8:25 pm","url":"https://shroudstory.com/2013/12/28/it-continues-james-son-of-joseph-brother-of-jesus/","cat":"history","id":"comment-69908","author":"daveb of wellington nz","site":"shroudstory"},{"title":"It Continues:  James, son of Joseph, brother of Jesus","post":"Addendum “Where were the brothers?” I’ve just come across Matt 27:55-56:\n“55There were many women there, looking on from a distance, who had followed Jesus from Galilee, ministering to him. 56z Among them were Mary Magdalene and Mary the mother of James and Joseph, and the mother of the sons of Zebedee.” \nUSCCB text includes the following annotation:\n“…A James and Joseph are referred to in Mt 13:55 as brothers of Jesus.” Matthew seems to get this text from Mark 15:40 “…Mary the mother of the younger James and of Joses, and Salome.” [No ‘of’ before ‘Salome’]\nNote that Mary is identified as their mother! This would seem to clarify the position re brothers and relationships clearly enough.\n\n","date":"December 30, 2013 at 4:27 am","url":"https://shroudstory.com/2013/12/28/it-continues-james-son-of-joseph-brother-of-jesus/","cat":"history","id":"comment-70015","author":"daveb of wellington nz","site":"shroudstory"},{"title":"It Continues:  James, son of Joseph, brother of Jesus","post":"David, your quotation is incorrect, this verse from Matthew is not used to justify the claim about real brothers and sisters, there are others. However, to continue the argument, let us take Mark 15:40, “Mary the mother of James the younger and Joses, and Salome”, where he refers to the mother of the person hanging on the cross. Why didn’t he say “his mother” or “the mother of Jesus”? We can go on and on, but in circles, if only NT data is cited. As Father Raymond E. Brown wisely noted, “the scientifically controllable biblical evidence leaves the question of the historicity of the virginal conception an unresolved problem”, but also acknowledged that the long-standing (RC) tradition about the perpetual virginity supplies an answer to that part of the question.\nThe “Lexicon für Theologie und Kirche” – H.Denzinger and A. Schonmetzer, used in the Catholic Church, says (in DS 44,46) that interpreters recall the long tradition about Mary as “Aeiparthenos” or “semper virgo” and prefer to understand the “brothers and sisters” in the broader sense. That is also the argument used by Dr. Matthew Levering. What he said was that the early Church Fathers, after analysing the entiretry of the biblical witness, concluded both that the NT offered no proof that Mary was the mother of the brothers and sisters of Jesus and that the living Mary discovered through ecclesial contemplation of the biblical texts had no child other than Jesus.\nIt was a response to the “burden of proof” that many demand. One of those who demanded such a thing was Ben Witherington, who leaped with joy when the discovery of the James ossuary (provenance unknown) was announced to the world because for him it was an occasion for the Catholic Church to “revisit” the Virgin Birth. The ossuary was returned to its owner, with the government’s verdict intact, that is, the second part of the inscription “akhui d’Yeshua”, “brother of Jesus” is a forgery. That did not deter Witherington. The occasion for him to revisit his claim only arose when the James ossuary was said to have been in the Talpiot tomb, a totally unfounded claim according to the official reports. But it prompted him to say that James was buried elsewhere!\nIt is a problem when scholars coming from a background that has no apostolic tradition, and therefore loaded with bias, ignore even the early Church fathers.\nBut, above all, you seem to have forgotten (or do not know?) that even Jesus’ enemies did not believe that Joseph was his human father….\n\n","date":"December 31, 2013 at 2:37 pm","url":"https://shroudstory.com/2013/12/28/it-continues-james-son-of-joseph-brother-of-jesus/","cat":"history","id":"comment-70620","author":"Louis","site":"shroudstory"}]
