[{"title":"Jesus’ Long Hair Again and Again and Again","post":"Hello, Dan I have sent a new guest-posting. Have you received it? The later, today’s e-mail.\n\n","date":"May 14, 2014 at 9:04 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-119198","author":"O.K.","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Do you have the link for this other post? What leads them to think Jesus had short hair?\n\n","date":"May 14, 2014 at 3:36 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-119378","author":"J.W. Wartick","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Literal interpretation of 1st Cor 11:14: \nDoes not nature itself teach you that if a man wears long hair, it is degrading to him (New American Standard Version)\n\n","date":"May 14, 2014 at 3:49 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-119387","author":"O.K.","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"I sent Dan a graphic I recently used in a presentation.  I hope it’s suitable for pasting here.  You’ll get the idea if you just Google on “Jewish Rabbis – Images”.  There’s pages and pages of them.  Most of them have long hair and beards unless they’re liberal, bald or female.  It is unlikely that Rabbi Yeshua was clean-shaven with short back-and-sides.  Paul didn’t want his Greek converts to be unnecessarily provocative by defying resonable cultural norms of the local Greek fashion.\n\n","date":"May 14, 2014 at 4:00 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-119394","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"I can clear this up.  The ancient Greek word (κόμη) that Paul of Tarsus wrote in Corinthians 11:13 means “decorated hair”. It was mistranslated as “long hair”   This is a classic example of a vague and incomplete translation of a word used by Paul of Tarsus.  (There is another where he makes reference To The Mandylion that I will not get into in this post)\nThe word κόμη,  DOES NOT MEAN LONG HAIR,   “Decorated hair”  would be the simplest translation.\n I have seen it used in other literature and it is never used to describe long hair.  In fact it is NOT defined as long hair in any ancient Greek  dictionary.  It is such a obscure seldom used word that the translation varies from one dictionary to another.\n In one it is defined as “hair of the head”   Another “hair with decorum”  Another “tresses of hair”   “Hair with comeliness/decorated”\nBut never was the word Paul wrote, κόμη, translated as long hair in any ancient literature with the exception of the Bible. (If they knew the trouble it was going to cause I am sure they would have spent more time to accurately translate the word)\nAncient Greek is a very sophisticated language, with many dual nouns and multiple adjectives and altered spelling of those nouns so as to know which adjective is being used.  \nMillions of people to this day think Paul of Tarsus said it is a shame for man to have long hair WHEN THAT IS NOT WHAT HE SAID.\nHE SAID IT IS A SHAME FOR A MAN TO HAVE  “TRESSES OF HAIR, ORNAMENTALLY DECORATED”   As in how a woman dresses up her hair with flowers and/or jewels, for a public event or just for show.\nThe word Paul used was translated as “long hair”  but should have been translated as “tresses of hair, ornamentally decorated”  or just “decorated hair”\nWhen you read the passage this way, it makes sense.\n Stop and look at the whole letter, this is more about the covering of women’s heads,  not about men with long hair.\nThe 1st clue that Paul of Tarsus is not saying it is a shame for a man to have long hair is in the 1st part of the passage.\nDoes not nature itself teach you it is a shame for a man to have long hair?\nWhat example in nature teaches us that?\nNONE.   There is no example in nature that teaches us it is a shame for a man to have long hair, NONE. \nLets take a male lion for example with a long mane of hair,  is that a shame to the lion?   NO   \nOr long branches on a tree,  is that a shame to the tree?\nABSOLUTELY NOT.\nBut what does Paul mean?\nI will explain it further.\nTake a male lion and decorate it’s hair with flowers and jewels and dress up that male lion’s hair like a female, as in how a woman prepares her hair for a wedding or public event.\nWould that look like a shame to the male lion and dishonor him?\nA male lion with little decorated pink flowers in his hair, would that be a SHAME?\nYES it would.   It would look ridiculous  \nLets read the whole passage the way Paul meant it so we can all understand.\nDoes not nature itself teach you that it is a shame for a man to have tresses of hair, ornamentally decorated, but if a woman has tresses of hair ornamentally decorated it is a glory to her.\nSEE HOW THAT MAKES SENSE.    \nFor a woman to have tresses of hair ornamentally decorated looks good.\nFor a man to come to the Church in Corinth with tresses of hair ornamentally decorated, in the opinion of Paul of Tarsus would be inappropriate/ shameful/ a dishonor\nThat is all that he said.   He went on to say at the end of the letter,\n But if any man seem to be contentious/argumentative we have no such custom, (or law against it) neither the churches of God.\nSaying this,\nIf you want to come to the Church in Corinth with your hair ornamentally decorated we have no law against it.\nWe suggest that you do not do it.\nThat is all he said.\nNow what does this passage have to do with the Man in The Shroud/Jesus?\nABSOLUTELY NOTHING.   \nPaul of Tarsus took the Nazarite vow, meaning he himself had long hair.\nSo why would Paul tell people not to have long hair, when he himself is speaking with LONG HAIR?!\n Because Paul of Tarsus did not say it was a shame for man to have long hair, but DECORATED HAIR.\nThis is how it is spelled in ancient Greek,  κόμη\nIt is a very obscure, seldom used word that is difficult to translate because it has more than 1 meaning and can even mean “unkempt hair”\n It is understandable how this was mistranslated. \nBOTTOM LINE;  The Man In The Shroud has long hair (look at the pony tail in the back)\nthat means Jesus had long hair.   The Man In The Shroud is Jesus.  (His image captured on the linen anyway)   \nThanks for allowing me to post on this blog.  I really enjoy reading the comments.\n\n","date":"May 15, 2014 at 2:35 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-119719","author":"Dave Hines","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Dave Hines; Thank you for very informative post!\n\n","date":"May 15, 2014 at 2:57 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-119731","author":"O.K.","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Hi OK,\nThe best comparison analogy I can think of that describes the word Paul of Tarsus used κόμη would be this.\nImagine if Barrie Schwortz, who has long hair, (which in my opinion is not shameful in any way) wore his hair ornamentally decorated while doing a presentation on The Shroud of Turin.\nInstead of neatly tied back it was free flowing and dyed a blond color with jewels and ornaments/flowers hanging from it.\nWould people consider that inappropriate or shameful?\nWould it be out of place/ hurt his presentation?  \nThat is what κόμη is, ornamentally deocorated hair and Paul of Tarsus suggested for the men not to come to the Church in Corinth in such a way, then closed the subject by saying there was no law against doing it if one did it anyway. \nNote that the Man In The Shroud and Barrie Schwortz have about the same length of hair.\nIt is not a shame in any way.\n\n","date":"May 15, 2014 at 11:51 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-120268","author":"Dave Hines","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Ye..es. Good idea, but is there a shred of evidence for it? One little reference is worth twenty lines of capital letters.\n\n","date":"May 15, 2014 at 3:49 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-120078","author":"Hugh Farey","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Jesus of Nazareth may have had long hair but took no Nazirite vow, he drank wine. Unless, of course, that is interpreted as having been produced by non-alcoholic grapes, but that takes us to the Seventh Day Adventists, not the NT.\n\n","date":"May 15, 2014 at 3:59 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-120082","author":"Louis","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"I think the answer is simpler still. Ordinary length hair (for men) was to the shoulder, while long hair (typical of women) was to the waist. ‘Long’ is a cultural relative.\n\n","date":"May 15, 2014 at 6:07 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-120135","author":"Hugh Farey","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"That is likely. Mel Gibson’ “The Passion of Christ” has Jesus with almost shoulder-length hair while the disciples look as though they went for haircuts quite regularly by first century standards.\n\n","date":"May 15, 2014 at 6:13 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-120138","author":"Louis","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Good Evening Hugh     Your right in that long hair is a cultural relative I am not in disagreement with that.  I am in disagreement in how the word  (κόμη)   Paul wrote as being translated as long hair.   I am correcting a error that was made in translation. That is all. \n:http://www.perseus.tufts.edu/hopper/definitionlookup?page=3&type=begin&target=greek&q=hair\nκόμη  hair of the head               \nThis is one of the definitions that I studied and then I looked into other literature where the same word was used.  Never was it used to describe long hair,\nκόμη is a dual noun which can have more than 1 meaning depending upon the sentence it is used in, it can even mean “unkempt hair”  as it is used in later literature.\n This is a very obscure, seldom used word in connection with hair.\nThis was another definition I copied and saved in which I cannot find the link to where it was found.  (But I will find it)\nκόμη  Fine hair,   hair with comeliness\nWith decorum,  Ornament or splendor — beauty.\nAgain, like I said the 1st clue Paul of Tarsus is not talking about long hair is in the 1st part of the passage\nDoes not nature itself teach us that it is a shame for a man to have “long hair”   κόμη \nWhat example in nature teaches us that?\nNONE.  \n1. A male lion with a long mane of hair,  is that a shame?   NO\n2. A male horse with a long mane of hair, is that a shame?  NO\n3. A long flowing river,  is that a shame?   NO\n4. Long branches on a tree, is that a shame?  NO\nHowever if you decorate a lions hair with ornaments or a male horse it starts looking stupid.\nThat is why Paul of Tarsus makes the connection with nature and artificial decoration as not belonging together.   \nIf Paul wanted to write long hair he would have used one of these words in ancient Greek that does mean long hair.     \nβαθυχαίτης      Thick long hair\nἐπικομάω     To wear long hair\nκαρηκομόωντες     With  hair on head, long haired\nκομάω     To let the hair grow long\nκομήτης     Wearing long hair\nμάλιον     Long hair\nμάλιον     Long hair, pig tail\nμακροκομέω     Have long hair\nτανυέθειρα   long haired\nτανύθριξ     long haired, shaggy,\nὑψιχαίτης      long haired\nBut he did not use those words, he used this, κόμη  \n  κόμη = Decorated/Ornamented Hair, This fits in the passage, long hair does not fit. \nThe word is used twice in the passage.\nDoes not nature itself teach you that if a man has  (κόμη)  ornamentally decorated hair it is a shame to him, but if a woman has (κόμη)  ornamentally decorated hair it is a glory to her. \nSee, how that fits.\nPaul of Tarsus is suggesting to the men not to come to the Church with hair that is ornamentally decorated.    In his opinion it would not be appropriate/shameful.\nThe only reason I am spending this much time on this subject is because it is brought up on my channel, over and over again.   I am sick and tired of it. \nI get up to 1000 views a day on my Shroud videos.     This is being used to plant seeds of doubt in the minds of people who are not yet decided in the authenticity of the Shroud.\nIt is a small seed planted but it eventually grows into fear. \nDoubt + Uncertainty = Fear.        That is what the other side is doing.  \nThis kind of misinformation spreads fear.      \nIf you are not convinced I have correctly translated this passage, launch your own personal investigation.    That is what I tell people to do.  The decision one makes in regards to the authenticity of The Shroud, could have eternal ramifications.   That needs to be taken seriously.  \nSorry for such a long post.   I want this cleared up once and for all.  \nPeace and good luck to you,  I am not posting to start a negative argument.\n\n","date":"May 15, 2014 at 10:17 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-120234","author":"Dave Hines","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"I cannot find, after some searching, that κόμη means decorated hair. Normally it just means hair, and far from being a rare word, it occurs frequently, meaning the material of the hair itself rather than as a description of the top of the head generally. It found a Latin equivalent in ‘coma,’ which also just means hair, not long or decorated.\nIn a literal translation, St Paul says that for men to have hair is a shame, while for women it is  glory. As this is, as it stands, absurd, an adjective has been assumed, normally ‘long,’ but not illogically ‘decorated.’ Possibly an original adjective has been lost in copying. So although I shy away from your dogmatism, there is sense in your suggestion.\nInterestingly, the Latin Vulgate amends the meaning slightly. For a man: “si comam nutriat ignominia est illi”, and for a woman: “si comam nutriat gloria est illi.” ‘Comam’ here, as anywhere else in Latin, just means hair; it is the ‘nutriat’ which gives the passage sense. If a man nourishes his hair it is an ignominy, but if a woman nourishes hers it is a glory. That makes a certain sense, and could indeed apply to ‘attending’ to hair in a decorative sense, as well as applying some sort of lotion to try to make it grow.\nOn the whole, then, I think I agree with you! But it does not pay to be too dogmatic: that plays into the hands of your critics. The reference to unkempt hair in Plutarch’s Cicero comes not from the ‘κόμης’ but from the qualifying ‘ἀνάπλεως,’ for example.\n\n","date":"May 16, 2014 at 8:56 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-120411","author":"Hugh Farey","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"I am guessing that David Hines might be better qualified to comment on Greek literary subtleties than is Hugh Farey.  ‘O’ levels in Classical Greek, anyone?\n\n","date":"May 16, 2014 at 4:02 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-120538","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"He might. But then again he might not. Evidence… evidence… evidence…\n\n","date":"May 16, 2014 at 5:11 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-120557","author":"Hugh Farey","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Dear Mr. Hugh Farey:  Thanks for replying to my comment.  I am looking for the link that defined the word κόμη as “Hair with comeliness/decorum”   It was an old Greek/English dictionary. I am going through my entire file on the subject.   I am by no means any expert in Ancient Greek, nor qualified to translate the majority of the language in any depth,  The only words I know in ancient Greek are things that pertain or have to do with The Shroud of Turin.  There is another translation in the Gospel of John where another Greek word was translated as “clothes” that also could have been “cloth”  It was a dual feminine noun.   But I will not get into that in this post.  I super appreciate the time you took to look up the word Paul of Tarsus wrote.  When people work together in a positive way is when things get accomplished.  Thanks for doing that. I will look for more links.   Physical evidence.\n\n","date":"May 16, 2014 at 5:36 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-120563","author":"Dave Hines","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Both Jerusalem Bible and USCCB translate I Cor 11:13 as “long hair”;  JB has no clarifying note;  USCCB has the following note: ” [11:13–16] The argument for conformity to common church practice is summed up and pressed home. 1 Cor 11:14–15 contain a final appeal to the sense of propriety that contemporary Greek society would consider “natural” “;  neither particularly enlightening to the present debate on translation.\n\n","date":"May 16, 2014 at 5:56 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-120568","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"The correct reference is I Cor 11:14 (not v.13).\nCheck Greek New Testament web-site; Four versions of Greek text (identical here); Latin Vulgate; 9 English translations:\nhttp://www.greeknewtestament.com/B46C011.htm\nOnly Latin Vulgate & Douay-Rheims come close to it; L.V. – “si comam nutriat ignominia est illi”  D.R. – “if he nourish his hair, it is a shame unto him”  All other Eng trans “if a man have long hair” (or similar). Not much help!\n\n","date":"May 16, 2014 at 6:11 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-120570","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"St. Paul would probably reject using shampoo if he were here with us today. This discussion is interesting and valid because it relates to Shroud studies and the length of Jesus’ hair. But even more important are the words of Jesus and the peacemakers who take them very seriously. American Cardinal Theodore McCarrick and US bishops have done what no politician has ever shown:\nhttp://www.catholicherald.co.uk/news/2014/05/15/us-bishops-and-iranian-ayatollahs-hold-talks-on-nuclear-arms/\n\n","date":"May 16, 2014 at 7:49 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-120596","author":"Louis","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"To intrude a frivolous element: I’ve given the matter some thought and quite frankly I’ve come to the conclusion that St Paul didn’t know what he was talking about on this matter of decorative hair. One doesn’t need a Masters in Zoology to know very well that it is frequently the male of whatever species that is the gaudier of the two genders. Peacocks are a prime example; the peahen in comparison is unremarkable in appearance having no more and no less than she should.  Bower birds, Birds of Paradise, even drakes appear more striking than the dowdy female duck.  Who has the better looking set of antlers, the glorious stag, or the doe with her remnant stumps?  Who has the better mane, the lion or lioness, no question! The females in the animal kingdom are content to rely on their pheromones to attract a mate.  It is solely in the human species where the females appear more decorative, exceptional and singular, while the best that men can do is to look like a flock of penguins in their uniform dickies and dinner jackets.  It is only too evident that St Paul was too busy bent over his needle and thread sewing his tents to be a reliable or acute observer of the actualities in nature!\n\n","date":"May 16, 2014 at 11:24 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-120651","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"I really enjoy your reading comments.  Some of your past posts are extremely informative. I copied and pasted many of them and used them in my closing argument to help prove the authenticity of The Shroud.  Especially some of the posts made in regards to the blood evidence.  Thanks for making those posts.  Anyways back to hair again \nAt this point we can conclude beyond any reasonable doubt, Paul of Tarsus is not referring to just long hair.   This is one of those deals where you have to start going through the process of elimination and cross off  what is not possible and see what is left.\n(Whatever remains must be the answer)\nAnyways, These are some links and other commentary I found on the subject.\n1. http://perseus.uchicago.edu/cgi-bin/philologic/getobject.pl?c.9:1:558.Autenrieth\nGeorg Autenrieth [1891], A Homeric Dictionary for Schools and Colleges \nκόμη: hair of the head, with reference to comeliness\n2. Book from Project Gutenberg: Döderlein’s Hand-book of Latin Synonymes\n(κόμη) is especially applicable to the hair of females; +cæsaries+, to that of males, like ἔθειρα.           This word ἔθειρ is defined as ἡ, hair, poet. Noun, Hom. only in Il. , and always in pl., either of a horse’s mane, 8.42; or of the horsehair crest on helmets,\nThis is more commentary I  found on the subject\n3. Paul also tells us it is not right for men to wear their hair in tresses. The word for decorate is mistranslated in the NKJV, where it is rendered as “long.”\nThe word “long’ in verses 14 and 15 is the Greek word koma (κομᾷ).\nThis word does not refer to long hair, but to “tresses of hair.” (Strong’s merely notes that the KJV renders this word as “long hair.” They do not give that definition themselves.)\nNT:2863 koma/komao (kom-ah’-o); from NT:2864; to wear tresses of hair: KJV – have long hair.\nWhen we look up the reference at NT:2864 we see that it again speaks of tresses, and of ornamentally dressing (or plaiting) the hair.\nNT:2864 kome (kom’-ay); apparently from the same as NT:2865; the hair of the head (locks, as ornamental, and thus differing from NT:2359; which properly denotes merely the scalp):\nIn other words, Paul told the Corinthian men that Hebrew men do not plait their hair, or wear them in locks, or trellises. He cannot have told them not to have long hair, because as we show in many other places, Paul took at least two Nazirite vows, which call for the hair of the head to grow long. Paul would not have told the Corinthians to avoid having long hair, when he himself probably had long hair at that time. What makes more sense, then, is to think that Paul was simply telling the Corinthian men to dress like men, and the women to dress like women.\nFinally, if we read this passage carefully, verse 16 tells us that the assemblies have no custom that sisters can pray or prophesy with their hair uncovered, simply because it is long, or trellised. To the contrary, the prettier it is, the more it needs to be covered; and if a sister does not wish to cover her hair wholly then she should be shaven or shorn, for to display her beauty openly in the assembly only serves to distract the men from focusing on the Spirit.\n14 Does not even nature itself teach you that if a man has decorated hair, it is a dishonor to him?\n15 But if a woman has decorated hair, it is a glory to her; for her hair is given to her for a covering.\n16 But if anyone seems to be contentious, we have no such custom, nor do the assemblies of Elohim.\nI think of Paul of Tarsus is getting a good laugh out of all of this, perhaps providing some needed comic relief in the Kingdom of Heaven.\n\n","date":"May 17, 2014 at 12:28 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-120663","author":"Dave Hines","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"I think that’s excellent.\n\n","date":"May 17, 2014 at 2:23 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-120686","author":"Hugh Farey","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Good Evening Mr. Hugh Farey:  I found a few of the links we talked about and posted them.  I sent them in a reply to Daveb of Wellington who always makes thought provoking, intelligent commentary (with a touch of humor added)   I was looking at some 1st Century Roman Centurion helmets with the horse hair dyed red on top.  I wonder if Paul of Tarsus may have also been referring to dyed hair.  I also wonder if the word “nourish” could possibly be referring to coloring the hair.   “If he colors/decorates his hair it is a shame unto him”  Just thinking out loud.\n I have had to address this at least a few dozen times from people leaving comments on my videos, saying, “Paul of Tarsus said it is a shame for a man to have long hair so the Shroud can’t be Jesus”   If not for that, I would not even be talking about this.  I would like to be able to put this down quickly and then move on to the more important aspects and forensic evidence that supports the authenticity of the Shroud and not get hung up on a trivial issue.\n\n","date":"May 18, 2014 at 11:04 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121300","author":"Dave Hines","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Thanks, Dave Hines, I appreciate your reply. I too find find daveb’s comments invariably pertinent and valuable, although I don’t always agree with him. However I hope people occasionally find my own comments worthwhile, although they may appear trivial. The shroud world is full of assertions which together lead to overwhelming conclusions, but if the assertions are unsubstantiated, then the whole edifice comes tumbling down. Now you have backed up your first bold comment (“The ancient Greek word (κόμη) that Paul of Tarsus wrote in Corinthians 11:13 means “decorated hair”. It was mistranslated as “long hair.”) with reasonable, if not conclusive, evidence, and I’ll go along with that until (unless) somebody else provides counter evidence.\nIncidentally, I don’t think I’m familiar with your videos. Can they be found online?\n\n","date":"May 19, 2014 at 3:06 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121358","author":"Hugh Farey","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Good afternoon Mr. Hugh Farey:  Your comments are certainly not trivial.  There are more than worthwhile, had it not been for your reminding me of how important physical evidence is I would not have gone yet even deeper into the study of the word Paul of Tarsus used.  It inspired me. As a result we all have a more clear understanding. Thanks for doing that.  Without physical evidence then all we have is here say testimony and speculation. That is not convincing. People need to see to believe, that is just the way it is.\n I have to let you know upfront the videos I made were done over a year ago and I was a bit unrestrained and impatient in my narration.  I was full of passion and fire and stepped across the line more than a few times in my closing argument.  Some of it is speculation without physical evidence. If I could re edit and change them I would.  I made a glaring error in my opening statement regarding the blood evidence not knowing that the rh factor of the blood was to degraded to know if it was AB pos or AB neg.   There are some moments where I feel I  misrepresented The Shroud.   I am sure Barrie Schwortz would agree with that.\nI am working on correcting the errors I made in my presentation.  Some of the evidence I presented is not scientifically peer reviewed. As a result I lose some credibility. I am aware of it.  The videos get a lot of views.  Over 100.000 views in the last year, reaching people in 194 countries. There are some highlight moments.  I stopped promoting my book because I did not want it mixed in with The Shroud of Turin.  So my channel is devoted to The Shroud.\nThere is one video that translates a word that Paul of Tarsus used that I am convinced is referring to The Mandylion.  I believe he was in possession of the Shroud  and that it was moved to Rome into the callistus catacombs before 70AD.\n I am reluctant to give you the link but since you asked I have to give it to you.  Bear in mind I made some howling errors during some of the presentations.  Be merciful.  I am one of those kind of people who fails their way to success.\n \n \n\n","date":"May 19, 2014 at 5:05 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121562","author":"Dave Hines","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"DH: “There is one video that translates a word that Paul of Tarsus used that I am convinced is referring to The Mandylion. I believe he was in possession of the Shroud and that it was moved to Rome into the Callistus catacombs before 70AD.” \nI am guessing that this refers to II Timothy 4:13 “When you come, bring the cloak I left with Carpus in Troas, the papyrus rolls, and especially the parchments.” \nThis was discussed here, maybe about a year ago.  The particular verse has been a little contentious.  Why would Paul be concerned about a cloak for himself when he could easily obtain one for himself in Rome?  Or is he concerned that Timothy have a cloak for his journey?  How come Paul has been in possession of the Shroud, if that is what is claimed, when it is far more likely to have been in Peter’s possession; And why would he leave it behind with a mate in Troy of all places; even it was at all credible that he was using it as a visual aid for his missionary work? It would seem most unlikely that the other apostles would permit him to do this?  [It has been asserted that Bishop Marcellus Avercius of Hieropolis was permitted to use it for this purpose for the conversion of King Abgar VIII’s (the Great) court in Edessa around 185AD, before returning it to Antioch where it was kept.] \nThe authenticity of II Timothy is uncertain.  My JB Introduction to the Pauline epistles acknowledges that some assert it as pseudonymous.  Encyc Brit says it is likely pseudonymous thus:  “The studies, utilizing computer technology, point toward non-Pauline authorship with affinities to language and style of a later, possibly 2nd-century, date. More refined and complex analyses, however, are still needed.\nLinguistic facts-such as short connectives, particles, and other syntactical peculiarities; use of different words for the same things; and repeated unusual phrases otherwise not used in Paul-offer fairly conclusive evidence against Pauline authorship and authenticity.” \nIf based on II Timothy, then the argument that Paul had the Shroud would seem fairly weak.\n\n","date":"May 19, 2014 at 6:20 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121593","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"According to the Ency Brit: “The studies, utilizing computer technology, point toward non-Pauline authorship with affinities to language and style of a later, possibly 2nd-century, date. More refined and complex analyses, however, are still needed.\nLinguistic facts-such as short connectives, particles, and other syntactical peculiarities; use of different words for the same things; and repeated unusual phrases otherwise not used in Paul-offer fairly conclusive evidence against Pauline authorship and authenticity.”\nThe fact remains though Paulus used both Greek and Hebrew.  Paulus’  interpreter could have translated II Timothy from Paulus’ Hebrew into his own Greek. Hence a noteworthy departure from Paulus’ idiolect.\n\n","date":"May 19, 2014 at 6:50 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121606","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Most likely the Second Letter to Timothy was not written in Rome but in Asia. Gr alla genomenos en Rômè (i.e. He was in Rome but he’s no longer; after having been in Rome…).\n\n","date":"May 19, 2014 at 7:31 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121630","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"The Greek here is ambiguous.\n\n","date":"May 19, 2014 at 7:46 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121638","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"This is translation Greek.\n\n","date":"May 19, 2014 at 7:47 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121639","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"II Timothy 1:17\n\n","date":"May 19, 2014 at 7:34 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121632","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Dave you wrote: “The authenticity of II Timothy is uncertain.” Such a judgment is based on a syllogism (by Renan as according to him prophecy is impossible since spinozist monism is true)\n\n","date":"May 19, 2014 at 7:52 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121643","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"ON June 11, 2013 at 6:56 pm I wrote:\n“Reminder: The Greek word phelonen/phailonen, “large shining wrap” (2Th 4: 13) is to read in the light of the TS body image as the latter when seen under a certain angle and light, looks like translucid straw yellow impression. This is consistent with the use of flashing gold mosaic tiles to feature the Christ’s pallium in the Pudenziana apse mosaic.”\n\n","date":"May 19, 2014 at 8:01 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121648","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Typo: translucent straw yellow impression\n\n","date":"May 19, 2014 at 8:01 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121650","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Reminder: the pallium is the Roman evolved form of the Greek himation, a word used in conjunction with the Image of Edessa.\n\n","date":"May 19, 2014 at 8:06 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121652","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"A pallium/mantle was also referred to as a “mort cloth”   It was not only a outer garment to wear, but also a burial shroud, or in some cases draped over the casket during the funeral.\nIt had dual purpose, outer garment and burial shroud. \nA Mantle also called a “Mandya” was typically used by someone in high position, as in a high priest, Jesus is the New High Priest and is a “Lion from the tribe of Judah”  that is why they called it “The Mandylion”   (Mandya, Lion) \nA Mantle by definition is a long, wide band of cloth, it cannot be just a face cloth. \nElijah wore a mantle, coincidentally this was the only thing left behind after he ascended into heaven, then they sent the army out to search for him for 3 days, but did not find him.  Only his “Shroud/Mantle” left behind.  I believe it is a preceding event to what happens with Jesus. \nBut like Daveb made clear it would be fairly easy to cast reasonable doubt into this passage (Timothy 2: 4:13)as being written in regards The Shroud.\nWithout more physical evidence it is speculation. \nI like to speculate sometimes and combine a few facts to help shed more light into the subject,  so here goes.  \n It is clear The word, φαιλόνην  is given a very vague and incomplete translation of “cloak” in 2 Timothy 4:13.  \n  We have to determine what the word cannot mean and see what is left. Cloak is eliminated as being possible.The spelling is completely wrong .   Also eliminate traveling case, book case or chest.   \nThe word φαιλόνην is a dual feminine noun that means CLOAK and LIGHT. Derived from the Greek Word PHOS which means TO SHINE or make manifest, especially by rays.\nPHOS is also defined as being A HEAVENLY LIGHT such as surrounds angels when they appear on Earth.\nSo the word φαιλόνην is combining HEAVENLY LIGHT WITH A CLOAK/SHROUD……….Why?\nIt is noteworthy the word Paul wrote (or someone) “φαιλόνην” never appears again in the Bible or in any ancient scripture.  It is a one of a kind word used to describe a one of kind thing.  What could that one of a kind thing be……….?\nWhat could it not be.\nI believe The Shroud was brought to Rome with Peters  permission.   There is historical record he was there in the same time after the letter was written to Timothy. \nHighly valued relics were often hidden in catacombs to keep them from being destroyed by enemies of Christ in that time.  The Turin Shroud/Burial Shroud Of Jesus would have been #1 on that list of things.  The catacombs of Rome is a place no one would expect The Shroud to be kept hidden. \nThe frescoes in the catacombs used the shroud face as a role model.    At some point it had to be there. \nI often think Paul is writing anticipating the possibility that his letters could be intercepted by one of his many enemies and uses code words and is very careful and cunning in the words he chooses.  In the case his letter is intercepted he is not disclosing any important names or locations    Especially in regards to where the Shroud is kept. \nI think when he uses the name Carpus and names the location of Troas, it is a ruse,yet written in a way that Timothy will know what Paul really wants done, who to see and where.  \nCoincidentally , Paul’s home town of Tarsus is extremely close to Edessa, Appx, 10 or 20 miles away.  \nOf all the people that would have wanted to display The Shroud and prove his case, it would have been Paul. \nThe word in question is , φαιλόνην,   what is it?\nBecause it is not just some ordinary cloak.\nThe best and most simple translation of the word he used would be  “A Illuminated Mantle/Shroud”\nAnother mystery.   Someday we will all know the answer.   Thanks for allowing to me post.\n\n","date":"May 19, 2014 at 10:43 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121734","author":"Dave Hines","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"To Dave Nines: Very interesting. Still the Greek word phelonen/phailonen most “naturally” stands for “large shining wrap” (2Th 4: 13), which actually is very close to “Illuminated Mantle/Shroud”.\n\n","date":"May 20, 2014 at 3:39 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121849","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"To Dave Hines: Part of your comment reminds me of what I myself wrote on June 11, 2013 at 11:27 am…\n\n","date":"May 20, 2014 at 7:24 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121937","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Max:\nAuthorship of II Timothy:  Paul, brought up in Tarsus, possibly studied under Stoics there, admittedly Jewish parentage (forebears had served in Roman army, granted Roman citizenship), Greek possibly more natural to him than Hebrew, granted he had joined the Pharisee party;  Timothy, born Lystra, Lycaonia;  Paul had circumcised him out of respect for his Jewish mother and to enable him to preach among Jewish communities.  Timothy would seem to be of Hellenists.  Why would Paul write in Hebrew to him  when both were familiar with Greek, or why would Paul need an amenuensis to translate for him?  There is much personal detail in II Tim 4;  It can not only argue for authentic Paul, but can also argue as being planted for pseudonomist to create impression of authenticism. \nPhailonen / Himation;  II Tim 4:13 uses “phailonen”;  Rev 19:11-16, Rider “Faithful and True” wears blood-soaked himation.  I can see where you’re coming from with “large shining wrap”;  I wasn’t able to find the word immediately, it would seem an unusual one(?), and is therefore probably the origin of the debate.  Paul having the Shroud doesn’t make sense to me.\n\n","date":"May 19, 2014 at 11:18 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121746","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Actually BOTH Greek and Hebrew (the latter as his mother tongue) could have been natural to Shaul/Paulus.  Paulus had Mark as his amenuensis so he could have used him. \nShall I repeat the apocrypha theory as far as the Second letter to Timothy is concerned, is mainly based on the fact the Fall of Jerusalem could not have  been alluded to in the letter as “prophecy is impossible” (and allegedly Spinozist monism is true), which is a most aprioristic premise based theory as far as Christianity is concerned.\nBTW Phailonen as “large shining warp” (my personal translation) can refer to a large very fine byssus wrap/Heb sovev as well (e.g. todays’ Kornelimünster Sudarium Domini) and  Yeshua’s large burial cloth that can be used both as himation and achiton.\n\n","date":"May 20, 2014 at 3:58 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121856","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"In the Second letter of Timothy there are many words and phrases that do exist in natural Greek. They are plain Jewish Greek and/or translation Greek. The II Timothy Greek is anything BUT natural as Dave of Wellington wrongly implies.\n\n","date":"May 20, 2014 at 4:20 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121861","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"The very non natural Greek word “phailonen” is definitely one of them.\n\n","date":"May 20, 2014 at 4:22 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121863","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"In Hebrew sovev mawr = “large shining wrap”\n\n","date":"May 20, 2014 at 4:32 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121866","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Typo + (sorry still typing in haste): “In the Second letter of Timothy there are many words and phrases that do NOT exist in natural Greek.\n\n","date":"May 20, 2014 at 5:05 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121883","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"The non natural Greek word phailonen “naturally” translates Hebrew sovev mawr.\n\n","date":"May 20, 2014 at 4:35 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121867","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"In MPHO. (MPH)\n\n","date":"May 20, 2014 at 4:40 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121870","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Reminder: the old French word Graal plays on/can be derived from the Hebrew phrase Gar El, “G.od dwells/shines (in it)”.\n\n","date":"May 20, 2014 at 4:43 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121871","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Typo: sovev mwar\n\n","date":"May 20, 2014 at 4:46 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121872","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"dave of Wellington wrote: “Paul having the Shroud doesn’t make sense to me.” Oh really?\n\n","date":"May 20, 2014 at 4:49 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121875","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"In Hebrew it does to me.\n\n","date":"May 20, 2014 at 5:02 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121881","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"On June 11, 2013 at 11:27 am, I wrote:\n “Most curiously, in 2 Timothy 4:13, Paul of Tarsus altered the spelling of the ancient Greek  phenoles or phainoles a large, sleeveless outer garment made of a single piece of heavy material with a hole in the middle through which the head was passed) by adding a “ν/n” to the end and coin the Greek word φαιλόνην (phailonen) by metathesis. \nThe doubt in regard to what is here really meant is as old as Chrysostom. The latter says, (Horn. x. on this epistle) “that the word (phailonen) denotes a garment (to himation = a very large rectangle of fabric that can be draped as a shawl, a cloak, or a head covering)”.\nThe philological fact is the word can read as a reference to a very large wrap, wrapping fabric or wrapper. Now the Greek Word φαιλόνην (phailonen) is derived from the ancient Greek word phao, “to shine”, “give light” (e.g. a heavenly light such as surrounds angels when they appear on earth) or “make manifest”.\nThus philologically speaking, the word phailonen most accurately denotes “a very large wrap that shines and/or makes manifest (through a porthole in the middle?)” and can refer to the TS shroud as a 4.44m long and 1.13m wide sindon/himation in which shines (in full daylight or natural transmitted light) the crucifixion victim’s bloody body (or just face?) image as visual epitome of the Gospels. \nReminder: the phailonen Paul asked is mentioned along with books (2 Th 4 13: The large wrap that I (Paul) left at Troas, with Carpus, when you come, bring with you: and the books, especially the parchments).”\n.\n\n","date":"May 20, 2014 at 6:01 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121900","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Max, I often find your linguistic theories a bit like playing Six Degrees of Separation. I’m certain you personally could take any passage of the New Testament and find a link to the Shroud. However I think this idea that the ‘light wrap’ could be the Shroud is compelling. Your reasoning about the need for Paul to code his words makes sense and your breakdown on the word itself points to a deeper mystery. Where there is smoke there’s fire. If the light wrap is not referring to the Shroud, what else might it be?\n\n","date":"May 20, 2014 at 6:32 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121914","author":"David Goulet","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Hi Max,  I am in agreement with your translation,  “A shining wrap”  and I will add some scripture that goes with it. “No one lights a lamp and puts it in a place where it will be hidden, or under a bowl. Instead they put it on its stand, so that those who come in may see the light”   I do not believe The Shroud was kept hidden away in some dark chamber & not displayed because the disciples were so afraid of having it stolen or destroyed.  That would prove they had spirits of fear and not of joy.  The Lord would want The Shroud displayed.\n I am convinced Paul of Tarsus on various occasions displayed The Shroud in Rome and many other places. It was not his entire presentation, but part of it. I think Peter offered it to him.  I don’t think he even needed to ask for it.   He was the one out there more bold and fearless than anyone.  Baptized in The Holy Spirit,  a very convincing public speaker.   \nWithout physical evidence that directly links Jesus to the resurrection he would not have been successful in his ministry.  Even if he could recite scripture from memory,  heal the sick and perform miracles in front of people that does not prove Jesus rose from the dead. That proves he has special powers of God or that he was some kind sorcerer, doing things by the power of the Devil, that is how people would perceive that.\nHe needs hardcore physical evidence such as The Shroud, to think otherwise is not logical nor practical thinking.  To come to the conclusion Paul had the Shroud based only on that passage is also not logical.  It is  weak, I agree on that.  We can conclude that the Shroud was in the open air in southern Turkey at some point in it’s history. It’s in the pollen evidence. It is a weak link but also supports the passage.    The frescoes in the catacombs, that supports it.\nBut we need a lot more.  A writing by Paul in more detail, describing it.\nIt is more important to believe The Shroud is physical evidence of the resurrection, not whether Paul displayed it or not.   Either we are convinced or not convinced, .there is no in between,  to harbor any kind of doubt means a person remains unconvinced . I suggest that if we truly believe The Shroud is physical evidence of the resurrection of Jesus to go directly and ask The Spirit of God personally if Paul of Tarsus was referring The Shroud in that passage.  That would be my challenge to anyone that feels they must have the answer to that question.  Its says “ask and you shall receive” in the Bible.  I suggest to anyone in doubt to do just that. Anyways, I have really enjoyed reading your commentary on the Paul of Tarsus passage.   We need more evidence before it starts looking convincing.   Spirit of God will provide that evidence in his own time.  PEACE\n\n","date":"May 21, 2014 at 2:16 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-122747","author":"Dave Hines","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Shalom, Dave.\n\n","date":"May 21, 2014 at 2:55 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-122765","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"In Greek too it does make sense to me.\n\n","date":"May 20, 2014 at 6:06 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121904","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Correction :Paul of Tarsus altered the spelling of the ancient Greek phenoles or phainoles or mark as his amenuensis did when it translated his oral letter into written Greek.\n\n","date":"May 20, 2014 at 6:12 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121907","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Typo: or MARK as his scribe-interpreter did when he translated his oral letter into written Greek.\n\n","date":"May 20, 2014 at 6:13 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121908","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"I meant SILAS not Mark. Typing too fast.\n\n","date":"May 20, 2014 at 6:21 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121909","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Reminder fro dave of Wellington : Timothy’s father was Greek while his mother was a Jew (Ac 16:1).\n\n","date":"May 20, 2014 at 6:28 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121912","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Max: You assert I wrongly imply that II Timothy Greek is natural Greek.  I have no opinion on the matter, and so your accusation is false.  On May 19, 6:50 pm I provided authoritative opinion noting non-Pauline and other peculiarities in the style.  It seems you may be of the view that Paul did have possession of the Shroud, but this seems entirely based on your own particular translation of the unusual word “phailonen” and a presumption that II Tim is indeed Pauline.  I think it more likely that the original Jewish apostles would guard the secret of the burial cloths closely, even from Paul who in their eyes was probably suspect, and there is no other evidence to show that either Paul or Timothy would even be aware of the secret of the burial cloths.  I note David Hines comment May 19, 10:43 pm implying that Paul may have been exercising a type of ‘disciplina arcana’ (“…with Carpus at Troas”).  Barely conceivable that Troas could be Babylon-like code for some-place else, but Timothy is in Ephesus, not Rome, nor Judea, nor Anatolia.  Interesting that Carpus is Latin for “wrist” (= wrist-wound on shroud image??).  Both Paul & Timothy seem to be semi-hellenised;  Why does Paul write originally in Hebrew, and then have someone translate it into peculiar (cryptic?) Greek? Merely because this facilitates ‘disciplina arcana’ ?  If Paul wanted to send cryptic messages to Timothy, he would be capable of doing so in his own natural Greek.\n\n","date":"May 20, 2014 at 6:33 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121916","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Dave of Wellington wrote: “Why would Paul write in Hebrew to him (Timothy) when both were familiar with Greek”. \nActually both were also familiar with Hebrew and Paul/Shaul could well have dictated his letter in Hebrew and an amenuensis translated it in non natural Greek.\n\n","date":"May 20, 2014 at 6:34 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121917","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Or else the Greek version is a second century CE translation from a Hebrew original.\n\n","date":"May 20, 2014 at 6:37 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121919","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"The single-mindedness of purpose/the cornerstone of the ministry of Paul of Tarsus is that he first and foremost must prove beyond all reasonable doubt that Jesus of Nazareth rose from the dead. The success of his ministry is dependent on it. A lot of pressure is on him.   I believe is it useful to gain the deepest possible empathy with Paul of Tarsus and imagine ourselves having to give multiple presentations in front of several hundred people with the goal of proving Jesus of Nazareth rose from the dead.  Imagine how difficult that would be.  Imagine having to do it without a shred of physical evidence and trying to convince people based on here say testimony.  In a way Paul of Tarsus is appointed defense attorney for Jesus,  Imagine that being ourselves.\nWould we want to have The Shroud/The Mandylion  to show to those people?\nAs a defense attorney, would we want the cloth to show?\nIt would be #1 on my list of things I would want for my presentation.\nI would to go to Peter and demand it. Otherwise I am going to be standing in front of thousands of people with nothing to show.  Here say testimony.  It would be a laughing disaster of a presentation.  Not one person is going to be convinced.  When I tell people I was baptized on the road to Damascus and I saw Jesus in a great white light I am going to be laughed off the podium.  But when I bring out The Mandylion with over 400 blood stains on it and image of Jesus on it, the crowd goes silent.    I can picture it.  It’s convincing.\nI really like Max Patrick’s translation of the word Paul used “large shining wrap”\nI think it’s right.  I think he was allowed to present it under Peters authority and permission.\nMy theory is that it was kept in the catacombs of Rome throughout the early centuries and eventually moved back to Edessa after most of Rome was converted.  Mission Accomplished.   Without The Shroud being displayed, I don’t believe Paul could have proved his case beyond all reasonable doubt.  He’s gotta  have it,  I cannot imagine Peter objecting to The Shroud being displayed or refusing Paul of Tarsus access to it.\n\n","date":"May 20, 2014 at 7:46 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121950","author":"Dave Hines","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Philologically speaking, my own particular translation of the unusual word “phailonen” as “large shining wrap” is correct. Just ask any Biblical Greek-Hebrew-Aramaic specialist worth his/her salt.\n\n","date":"May 20, 2014 at 6:45 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121922","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Max, your translation is correct\nφαιλόνην =  large shining wrap,\nThe spelling of this noun, φαιλόνην  implies these adjectives\n1. Wide/Long\n2. Upper  (As in upper position such as a high priest)\n3. LIght bringing and light giving  (something that shines)\nI made a video presentation about this","date":"May 20, 2014 at 8:33 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121980","author":"Dave Hines","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"It can/does translate Hebrew “sovev mwar”.\n\n","date":"May 20, 2014 at 6:47 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-121923","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"To Dave re I & II Timothy authorship:\nBoth 1 and 2 Timothy begin with clear statements that Paul was the author (1Ti 1:1-2 and 2Ti 1:1-2). “There are few New Testament writings which have stronger attestation, for these Epistles were widely used from the time of Polycarp, and there are possible traces in the earlier works of Clement of Rome and Ignatius…. Objections to authenticity must therefore be regarded as modern innovations contrary to the strong evidence from the early Church” (The New Bible Dictionary, InterVarsity Press, p. 1282).\n\n","date":"May 20, 2014 at 9:39 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-122010","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Max, There are clearly issues of language with II Timothy identified by the authors of the Ency Brit article “Biblical Literature” of some 270 pages in Chapter 17 ‘The Pastoral Letters to Timothy and Titus’.  Author of this section may have included the following:  The Rev. Krister Stendahl: Bishop of Stockholm, 1984-88. Andrew W. Mellon Professor of Divinity, Harvard University, 1981-84; Dean, Divinity School, 1968-79. Author of Paul Among Jews and Gentiles and others. … ; …Emilie T. Sander: Associate Professor of New Testament, Yale University, 1973-75. Coeditor and translator of The Bible and the Role of Women.” \nI can agree that you may very well be correct in your assessment that the original was written in Hebrew and translated into Greek,  and this may  possibly have been as late as the 2nd century, which is when the article asserts the date of the idiom,  This may explain the problems that the authors have in attributing it to Paul. \nI consider that the evidence that Paul was ever in possession of the Shroud is extremely slender and speculative, notwithstanding the claims made by David Hines.  Paul’s first preaching was in Damascus [Acts ch 9]; Barnabas appears to have been an intermediary between Paul and the Church in Jerusalem [Acts ch 11]; Paul’s first mission is to Pisidia and his preaching there (first to the Jews) is set out in Ch 13.  A summary of his subsequent preaching elsewhere follows in the relevant chapters in Acts.  Nowhere in Acts, nor in Paul’s general epistles is there any hint that the Shroud played any kind of role in his missionary work.  \nYour interpretation of the word “phailonen” is intriguing, but I don’t see that it alone is sufficient to assert that Paul was ever in possession of the Shroud.   I would doubt that Paul was ever made aware of it.  For David Hines to say that Paul would have demanded it from the apostles to aid his missionary work verges on the absurd.  It is to credit Paul with a greater strength of charisma that the apostles would have been prepared then to acknowledge.  Some of them had their own missionary objectives to attend to. \nTo David Hines: For an alternative and more credible theory on the whereabouts of the Shroud I recommend two papers by Jack Markwardt:\n“Antioch and the Shroud”, Dallas conference 1998, and “ANCIENT EDESSA AND THE SHROUD: HISTORY CONCEALED BY THE DISCIPLINE OF THE SECRET”, Ohio conference 2008;\nhttp://www.shroud.com/pdfs/markward.pdf\nhttp://ohioshroudconference.com/papers/p02.pdf\n\n","date":"May 20, 2014 at 4:53 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-122230","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Good Evening Daveb of Wellington.  Like I said before, I really enjoy reading your commentary. Some of your past posts helped me to gain a deeper insight into The Shroud of Turin and increased my level of knowledge & understanding in many different ways.   Thank you for those posts. I have read a lot of your commentary and in most cases I find myself in agreement with you.  Thanks for the link you suggested I look at, I will read it.  On this Paul of Tarsus passage we will have to agree to disagree.  I am convinced Paul is referring to the Shroud, If explain in full detail why I am so convinced my mental health will be in question.  So there is no point in discussing it. God willing I will open up the file on this again at a later date only if I have hardcore convincing evidence that supports it.\n It does not matter what I believe, it only matters what I can prove and I cannot prove beyond a reasonable doubt that the word Paul wrote is in reference to The Shroud.\nI am glad I did not include it in my closing argument.  Now I know why.\nI can clearly see there are several different ways in which the display would be attacked and I have no doubt in my mind that no significant number of people would ever be convinced on the present evidence. I would not waste their valuable time and mine presenting it again.\nI am very glad I got to hear the argument on the other side of this.  LIke Hugh Farey would say, evidence, evidence,  I’m working on it!  Thanks for replying to my post. PEACE\n\n","date":"May 20, 2014 at 7:33 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-122314","author":"Dave Hines","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Dave you wrote: “I can agree that you may very well be correct in your assessment that the original was written in Hebrew and translated into Greek, and this may possibly have been as late as the 2nd century, which is when the article asserts the date of the idiom, This may explain the problems that the authors have in attributing it to Paul.” \nI couldn’t have put my second hypothesis better. Thank you.\nYou also wrote: “Nowhere in Acts, nor in Paul’s general epistles is there any hint that the Shroud played any kind of role in his missionary work.”\nNeither in the Gospels or Acts is there any hint that the Shroud bore an image of Yeshua as genuine epitome of “The Event”.\n\n","date":"May 22, 2014 at 5:11 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-123046","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Paul needed no shroud for his missionary work, his zeal came with the experience on the road to Damascus.\n\n","date":"May 20, 2014 at 5:03 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-122237","author":"Louis","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"The Catholic Truth Society in London, England has just published a booklet by Dr. Pravin Thevathasan,psychiatrist and editor of the “Catholic Medical Quarterly” in that country and a convert to Catholicism. It has something to do with the difference between psychiatric problems and visions and apparitions. There are two links::\n  http://www.catholicherald.co.uk/commentandblogs/2014/05/19/we-need-both-medicine-and-catholicism-to-understand-mental-illness/\nhttp://www.dioceseofshrewsbury.org/news/attachment/dr-pravin-thevathasan\n\n","date":"May 20, 2014 at 5:56 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-122264","author":"Louis","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"De Wesselow thinks the Shroud was the Resurrection — and remains agnostic.\n\n","date":"May 20, 2014 at 7:55 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-122322","author":"Louis","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"My very first two posts on this blog touched on the subject of canonization of the NT in apostolic times by the apostles themselves and hinted at the problem of the translation of phelonen (https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/#comments). As the late Ernest L. Martin showed in the volume I referenced in that thread, the canonization process was started by Peter and Paul as various clues reveal in the NT itself, including a big one when the word in question is rightly understood in context in 2Tim 4.13.\nEven the Catholic Church’s highest saint, Augustine of Hippo, who was instrumental in canonizing the NT as accepted in the Catholic church understood the NT canon to have existed in the time of the apostles:\n“Distinguished from the books of later authors is the excellence of the canonical authority of the Old and New Testaments; which, having been established in the time of the apostles, hath through the succession of overseers and propagators of churches been set as it were in a lofty tribunal, demanding the obedience of every faithful and pious understanding.”\n-Contra Faustum Man\nThe original Aramaic NT in the Peshitta has the word for “bookcase” not cloak. This is important to consider because it provides a clue Paul was in the process of collecting texts for a new canon and needed the materials he requested to do so.\nHere are some relevant paragraphs from Martin’s book that summarize this issue:\n***\nThe Cloak, the Scrolls, and the Parchments\nTimothy and John Mark were asked by Paul to fetch three important items and bring them to Rome. “When you come, bring the cloak [Greek: phelonen] I left with Carpus, and the scrolls, especially the parchments” (2 Timothy 4:13). It is interesting that the phelonen, usually considered to be a heavy outer garment, would be mentioned alongside the paper scrolls (actually scrolls made from the papyrus plant) and the parchments (these were animal skins on which permanent documents were normally written).\nIt seems odd that a heavy coat would be in the same context with literary documents. Most scholars, however, point out that Paul wanted Timothy and Mark to hurry to Rome before winter (verse 21) and that he probably wanted the phelonen which he left with Carpus in order to keep himself warm when the cold would set in. This may be the case, but there are some difficulties with this interpretation. The truth is, the word phelonen had another meaning in the Greek world at the time, one that was intimately connected with scrolls and parchments.\nVincent, in his Word Studies in the New Testament, has this to say about the word phelonen.\n   “Hesychius explains it as originally a case for keeping the mouthpieces of wind-instruments; thence, generally, a box. Phrynicus, a Greek sophist of the second half of the third century, defines it as `a receptacle for books, clothes, silver, or anything else.’ Phelonen was a wrapper of parchments, and was translated figuratively in Latin by toga or paenula `a cloak,’ sometimes of leather; also the wrapping which a shopkeeper put round fish or olives; also the parchment cover for papyrus rolls. Accordingly it is claimed that Timothy in 4:13 is bidden to bring, not a cloak, but a roll-case. So the Syriac Version.” 1\nThe fact is, the word phelonen can mean either a cloak (and it is commonly used that way in Greek literature) or it could mean a receptacle for the placement of scrolls and parchments. It is the context which must determine what the apostle Paul meant by the use of phelonen in 2 Timothy 4:13. Since the word is found right next to scrolls and parchments, the immediate context would suggest a “book cover,” a “book case,” or “book slip” into which scrolls or pages of books were placed. As Vincent stated, the Syriac Version of the New Testament understood it in that manner. Chrysostom, in the 4th century, commented on this very reference of Paul’s and stated that some thought Paul meant a “book case” — a receptacle for books. 2 Even Jerome mentioned this point. 3\nhttp://www.askelm.com/restoring/res031.htm\nPeter talks of leaving behind the testimonies for people to recall them when they needed to, and how was that done? By leaving a written record.\nIn short, it was the apostles themselves who saw the need for a New Testament canon of scriptures and it was they who produced it. When the 1st century Christians finally came to the realization that Christ was not returning to earth in their generation, they began to write accounts of Christ’s life and documents about his teachings for posterity, and they were doing it in the manner they thought best. Luke referred to this and said that “many” were composing such Gospels (Luke 1:1). While this might appear a good thing at first sight, it must be remembered that these written Gospels were being produced within an environment of religious and political insurrection.\nHow could one be certain the various accounts were presenting an accurate narration? It is because of this that Peter and John began to show concern about the matter. If any people were fully aware of what Christ did and taught, and if any people were able to sanction the accuracy of any written history of Christ’s life, it was the apostles. Something had to be done to provide a shining light of truth to those of the future. It was within this background that Peter wrote what we call today his Second Epistle. Let us see what Peter did to secure for those of the succeeding centuries the purity of Christian teaching.\nThe principal subject of Peter’s Second Epistle was “the precious and exceeding great promises” of Christ (2 Peter 1:12). To preserve these for posterity he explained what he was about to do.\n   “Wherefore, I shall be ready, always, to remind you of these things [the promises of Christ], though you know and are firmly fixed in the present truth [the truth that Peter was presently giving them]. And I think it right, as long as I am in this tabernacle [this mortal body], to stir you up by reminder, knowing that the putting off of my tabernacle comes swiftly, even as our Lord Jesus Christ showed me. But I will also give diligence that at each time [notice this phrase ‘at each time’] you may be able after my death to recall these things to remembrance. For not by following cunningly devised fables, made we known to you the power and presence of our Lord Jesus Christ, but we were eyewitnesses of his majesty.\nhttp://www.askelm.com/restoring/res023.htm\n***\nThe irony is that Martin understood Western politics influenced the modern bible layout (OT and NT) and has corrupted academia, yet he still trusted in the party line that the original texts were in Greek even while turning to the Aramaic (“Syriac Version”) to clinch the argument over the intended meaning of the Greek “phelonen” in support of his larger thesis — the Apostles canonized the NT. Martin was brilliant, but not infallible. To his credit he was known to change his mind on important subjects in light of new information — to what degree if any he studied the arguments for Aramaic primacy is unknown to me.\nHis book also shows how the canon would have been finalized by St John in accordance with Torah law (being a priest like Ezra who finalized the OT canon — yes the biblical evidence shows John was from a priest family as was Judas) and creates a symmetry of 49 books (7×7) with 7 divisions mirroring the 7-branched menorah. \nThe fact that the Peshitta NT does not include 2 Peter, 2 John, 3 John, Jude and Revelation may actually help date it prior to these letters being written and finalized by St John who lived to be almost 100 according to early tradition. The church of the East have always maintained that one of the 70 disciples, Addai (Thaddeus), sent by St Thomas, introduced the nascent NT to King Abgar in Edessa, the same who is said to have brought the image of Christ (Mandylion) to King Abgar to heal him. Western NT scholars would typically disregard the validity of this information as they would the validity of the shroud thanks in no small part to the 1988 C14 “tests”.\nNow to put the original NT language in historical context, Josephus makes abundantly clear that writings by Jews during this time would most definitely have been in Aramaic not Greek. Anything Greek was shunned especially after the Maccabean revolt with subsequent recognized Jewish autonomy and was rarely used by Jews (like Paul) with the exception of “Hellenized-Jews” — as it’s said, the exception establishes the rule. The highly educated Josephus himself wrote his works in Aramaic and admits it was tough to learn and translate into the foreign and unaccustomed language (Greek). This would not be the case if Greek really was the lingua franca of Jewish communities that we are always assured it was in NT time by Western NT scholars, why else would the Roman commander posted in Jerusalem be surprised when Paul was able to address him in Greek, then proceeded to address the Jews in “the Hebrew tongue” (ie, Aramaic) in Acts 21.37-22.2?\n“Antiquity of the Jews” 1:7 but because this work surrounded a great deal… in process of time, as usually happens to such as undertake great things, I grew weary and went on slowly, it being a large subject, and a difficult thing to translate our history into a foreign, and to us unaccustomed, language.\n1:129 for such names are pronounced here after the manner of the Greeks, to please my readers; for our own country language does not so pronounce them;\n20:262 And I am so bold as to say, now I have so completely perfected the work I proposed to myself to do, that no other person, whether he were a Jew or foreigner, had he ever so great an inclination to it, could so accurately deliver these accounts to the Greeks as is done in these books.\n20:263 For those of my own nation freely acknowledge that I far exceed them in the learning belonging to Jews: I have also taken a great deal of pains to obtain the learning of the Greeks, and understand the elements of the Greek language, although I have so long accustomed myself to speak our own tongue, that I cannot pronounce Greek with sufficient exactness;\n20:264 for our nation does not encourage those who learn the languages of many nations,\nIn Against Apion, Josephus also shows that “Antiquity” was originally written in his own national tongue and only subsequently translated into Greek (with great effort as stated above):\n1:1 My books of the “Antiquity of the Jews” … Those Antiquities contain the history of five thousand years, and are taken out of our sacred books; but are translated by me into the Greek tongue.\n1:50 Afterward I got leisure at Rome; and when all my materials were prepared for that work, I made use of some persons to assist me in learning the Greek tongue.\nJewish War preface:\n“I have proposed to myself, for the sake of such as live under the government of the Romans, to translate those books into the Greek tongue, which I formerly composed in the language of our country”\nAfter the exile to Babylon, the lingua franca among the Jews who returned to the land (and stayed in Babylon) was Aramaic. This is why they always used the Aramaic Targumim, Talmuds, Mishna, and Midrash. Even the Hebrew bible relies on Aramaic (Syriac) after the exile and tells how Ezra translated the Hebrew bible for the Jews during readings, where the Targum tradition begins.\nRelated:\nJewish Talmud Confirms an Early Gospel of Matthew\nhttp://www.southcoasttoday.com/apps/pbcs.dll/article?AID=/20030419/OPINION/304199940&cid=sitesearch\nThe Aramaic Solution to Jesus’ Conflicting Genealogies\nhttp://thelivingtorah.com/wp-content/uploads/2012/02/Aramaic-Genealogy.pdf\nDoes the Peshitta stem from the Old Syriac?\nhttp://www.aramaicpeshitta.com/Peshitta%20FAQs/peshitta_old_syriac.htm\n\n","date":"May 20, 2014 at 9:16 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-122355","author":"EGM","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Try #2:\nMay 20, 2014 at 9:16 pm\nReply\nYour comment is awaiting moderation.\nMy very first two posts on this blog touched on the subject of canonization of the NT in apostolic times by the apostles themselves and hinted at the problem of the translation of phelonen (https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/#comments). As the late Ernest L. Martin showed in the volume I referenced in that thread, the canonization process was started by Peter and Paul as various clues reveal in the NT itself, including a big one when the word in question is rightly understood in context in 2Tim 4.13.\nEven the Catholic Church’s highest saint, Augustine of Hippo, who was instrumental in canonizing the NT as accepted in the Catholic church understood the NT canon to have existed in the time of the apostles:\n“Distinguished from the books of later authors is the excellence of the canonical authority of the Old and New Testaments; which, having been established in the time of the apostles, hath through﻿ the succession of overseers and propagators of churches been set as it were in a lofty tribunal, demanding the obedience of every faithful and pious understanding.”\n-Contra Faustum Man\nThe original Aramaic NT in the Peshitta has the word for “bookcase” not cloak. This is important to consider because it provides a clue Paul was in the process of collecting texts for a new canon and needed the materials he requested to do so.\nHere are some relevant paragraphs from Martin’s book that summarize this issue:\n***\nThe Cloak, the Scrolls, and the Parchments\nTimothy and John Mark were asked by Paul to fetch three important items and bring them to Rome. “When you come, bring the cloak [Greek: phelonen] I left with Carpus, and the scrolls, especially the parchments” (2 Timothy 4:13). It is interesting that the phelonen, usually considered to be a heavy outer garment, would be mentioned alongside the paper scrolls (actually scrolls made from the papyrus plant) and the parchments (these were animal skins on which permanent documents were normally written).\nIt seems odd that a heavy coat would be in the same context with literary documents. Most scholars, however, point out that Paul wanted Timothy and Mark to hurry to Rome before winter (verse 21) and that he probably wanted the phelonen which he left with Carpus in order to keep himself warm when the cold would set in. This may be the case, but there are some difficulties with this interpretation. The truth is, the word phelonen had another meaning in the Greek world at the time, one that was intimately connected with scrolls and parchments.\nVincent, in his Word Studies in the New Testament, has this to say about the word phelonen.\n“Hesychius explains it as originally a case for keeping the mouthpieces of wind-instruments; thence, generally, a box. Phrynicus, a Greek sophist of the second half of the third century, defines it as `a receptacle for books, clothes, silver, or anything else.’ Phelonen was a wrapper of parchments, and was translated figuratively in Latin by toga or paenula `a cloak,’ sometimes of leather; also the wrapping which a shopkeeper put round fish or olives; also the parchment cover for papyrus rolls. Accordingly it is claimed that Timothy in 4:13 is bidden to bring, not a cloak, but a roll-case. So the Syriac Version.” 1\nThe fact is, the word phelonen can mean either a cloak (and it is commonly used that way in Greek literature) or it could mean a receptacle for the placement of scrolls and parchments. It is the context which must determine what the apostle Paul meant by the use of phelonen in 2 Timothy 4:13. Since the word is found right next to scrolls and parchments, the immediate context would suggest a “book cover,” a “book case,” or “book slip” into which scrolls or pages of books were placed. As Vincent stated, the Syriac Version of the New Testament understood it in that manner. Chrysostom, in the 4th century, commented on this very reference of Paul’s and stated that some thought Paul meant a “book case” — a receptacle for books. 2 Even Jerome mentioned this point. 3\nhttp://www.askelm.com/restoring/res031.htm\nPeter talks of leaving behind the testimonies for people to recall them when they needed to, and how was that done? By leaving a written record.\nIn short, it was the apostles themselves who saw the need for a New Testament canon of scriptures and it was they who produced it. When the 1st century Christians finally came to the realization that Christ was not returning to earth in their generation, they began to write accounts of Christ’s life and documents about his teachings for posterity, and they were doing it in the manner they thought best. Luke referred to this and said that “many” were composing such Gospels (Luke 1:1). While this might appear a good thing at first sight, it must be remembered that these written Gospels were being produced within an environment of religious and political insurrection.\nHow could one be certain the various accounts were presenting an accurate narration? It is because of this that Peter and John began to show concern about the matter. If any people were fully aware of what Christ did and taught, and if any people were able to sanction the accuracy of any written history of Christ’s life, it was the apostles. Something had to be done to provide a shining light of truth to those of the future. It was within this background that Peter wrote what we call today his Second Epistle. Let us see what Peter did to secure for those of the succeeding centuries the purity of Christian teaching.\nThe principal subject of Peter’s Second Epistle was “the precious and exceeding great promises” of Christ (2 Peter 1:12). To preserve these for posterity he explained what he was about to do.\n“Wherefore, I shall be ready, always, to remind you of these things [the promises of Christ], though you know and are firmly fixed in the present truth [the truth that Peter was presently giving them]. And I think it right, as long as I am in this tabernacle [this mortal body], to stir you up by reminder, knowing that the putting off of my tabernacle comes swiftly, even as our Lord Jesus Christ showed me. But I will also give diligence that at each time [notice this phrase ‘at each time’] you may be able after my death to recall these things to remembrance. For not by following cunningly devised fables, made we known to you the power and presence of our Lord Jesus Christ, but we were eyewitnesses of his majesty.\nhttp://www.askelm.com/restoring/res023.htm\n***\nThe irony is that Martin understood Western politics influenced the modern bible layout (OT and NT) and has corrupted academia, yet he still trusted in the party line that the original texts were in Greek even while turning to the Aramaic (“Syriac Version”) to clinch the argument over the intended meaning of the Greek “phelonen” in support of his larger thesis — the Apostles canonized the NT. Martin was brilliant, but not infallible. To his credit he was known to change his mind on important subjects in light of new information — to what degree if any he studied the arguments for Aramaic primacy is unknown to me.\nHis book also shows how the canon would have been finalized by St John in accordance with Torah law (being a priest like Ezra who finalized the OT canon — yes the biblical evidence shows John was from a priest family as was Judas) and creates a symmetry of 49 books (7×7) with 7 divisions mirroring the 7-branched menorah.\nThe fact that the Peshitta NT does not include 2 Peter, 2 John, 3 John, Jude and Revelation may actually help date it prior to these letters being written and finalized by St John who lived to be almost 100 according to early tradition. The church of the East have always maintained that one of the 70 disciples, Addai (Thaddeus), sent by St Thomas, introduced the nascent NT to King Abgar in Edessa, the same who is said to have brought the image of Christ (Mandylion) to King Abgar to heal him. Western NT scholars would typically disregard the validity of this information as they would the validity of the shroud thanks in no small part to the 1988 C14 “tests”.\nNow to put the original NT language in historical context, Josephus makes abundantly clear that writings by Jews during this time would most definitely have been in Aramaic not Greek. Anything Greek was shunned especially after the Maccabean revolt with subsequent recognized Jewish autonomy and was rarely used by Jews (like Paul) with the exception of “Hellenized-Jews” — as it’s said, the exception establishes the rule. The highly educated Josephus himself wrote his works in Aramaic and admits it was tough to learn and translate into the foreign and unaccustomed language (Greek). This would not be the case if Greek really was the lingua franca of Jewish communities that we are always assured it was in NT time by Western NT scholars, why else would the Roman commander posted in Jerusalem be surprised when Paul was able to address him in Greek, then proceeded to address the Jews in “the Hebrew tongue” (ie, Aramaic) in Acts 21.37-22.2?\n“Antiquity of the Jews” 1:7 but because this work surrounded a great deal… in process of time, as usually happens to such as undertake great things, I grew weary and went on slowly, it being a large subject, and a difficult thing to translate our history into a foreign, and to us unaccustomed, language.\n1:129 for such names are pronounced here after the manner of the Greeks, to please my readers; for our own country language does not so pronounce them;\n20:262 And I am so bold as to say, now I have so completely perfected the work I proposed to myself to do, that no other person, whether he were a Jew or foreigner, had he ever so great an inclination to it, could so accurately deliver these accounts to the Greeks as is done in these books.\n20:263 For those of my own nation freely acknowledge that I far exceed them in the learning belonging to Jews: I have also taken a great deal of pains to obtain the learning of the Greeks, and understand the elements of the Greek language, although I have so long accustomed myself to speak our own tongue, that I cannot pronounce Greek with sufficient exactness;\n20:264 for our nation does not encourage those who learn the languages of many nations,\nIn Against Apion, Josephus also shows that “Antiquity” was originally written in his own national tongue and only subsequently translated into Greek (with great effort as stated above):\n1:1 My books of the “Antiquity of the Jews” … Those Antiquities contain the history of five thousand years, and are taken out of our sacred books; but are translated by me into the Greek tongue.\n1:50 Afterward I got leisure at Rome; and when all my materials were prepared for that work, I made use of some persons to assist me in learning the Greek tongue.\nJewish War preface:\n“I have proposed to myself, for the sake of such as live under the government of the Romans, to translate those books into the Greek tongue, which I formerly composed in the language of our country”\nAfter the exile to Babylon, the lingua franca among the Jews who returned to the land (and stayed in Babylon) was Aramaic. This is why they always used the Aramaic Targumim, Talmuds, Mishna, and Midrash. Even the Hebrew bible relies on Aramaic (Syriac) after the exile and tells how Ezra translated the Hebrew bible for the Jews during readings, where the Targum tradition begins.\nRelated:\nJewish Talmud Confirms an Early Gospel of Matthew\nhttp://www.southcoasttoday.com/apps/pbcs.dll/article?AID=/20030419/OPINION/304199940&cid=sitesearch\nThe Aramaic Solution to Jesus’ Conflicting Genealogies\nhttp://thelivingtorah.com/wp-content/uploads/2012/02/Aramaic-Genealogy.pdf\nDoes the Peshitta stem from the Old Syriac?\nhttp://www.aramaicpeshitta.com/Peshitta%20FAQs/peshitta_old_syriac.htm\n\n","date":"May 21, 2014 at 9:24 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-122603","author":"EGM","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"EMG very interesting yet you wrote: \n“Timothy and John Mark were asked by Paul to fetch three important items and bring them to Rome. “When you come, bring the cloak [Greek: phelonen] I left with Carpus, and the scrolls, especially the parchments” (2 Timothy 4:13).”\n(…)\n“Hesychius explains it as originally a case for keeping the mouthpieces of wind-instruments; thence, generally, a box. Phrynicus, a Greek sophist of the second half of the third century, defines it as `a receptacle for books, clothes, silver, or anything else.’ Phelonen was a wrapper of parchments, and was translated figuratively in Latin by toga or paenula `a cloak,’ sometimes of leather; also the wrapping which a shopkeeper put round fish or olives; also the parchment cover for papyrus rolls. Accordingly it is claimed that Timothy in 4:13 is bidden to bring, not a cloak, but a roll-case. So the Syriac Version.” 1\nThis is ok BUT the last word doesn’t automatically rest on the Syriac Peshitta version. Besides in Horn. X. on this epistle, Chrysostome says, I repeat, “that the word (phailonen) denotes a garment (to himation = a very large rectangle of fabric that can be draped as a shawl, a cloak, or a head covering)”. And last but not least the word to translate/interpret here is spelled ph-AI-lonen NOT ph-E-lonen! How do you account for this unusual spelling?\nEnd note: By transposition it can be a derivative either of phaino (as showing outside the other garments) or phao (to shine, give light, make manifest). \nHence my translation/interpretation “large (shining) wrap”.\n\n","date":"May 22, 2014 at 6:26 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-123064","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Could the ‘roll case’ have held the Shroud? Perhaps the Shroud was rolled like a scroll for easier keeping and held inside a  scroll cloak. Thus Paul’s unusual word use, a slight play on words that ensured the reader that he was inferring the Shroud’s scroll cloak.\n\n","date":"May 22, 2014 at 7:34 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-123095","author":"David Goulet","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"If Paul was flogged and stoned for preaching his new message, trampling on part of the old, it could be worse for him walking about displaying a burial shroud, an unclean object. It would have been ripped from his hands and destroyed.\n\n","date":"May 21, 2014 at 3:34 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-122775","author":"Louis","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Hi Louis, I think that is a valid point.  A good argument for why Paul of Tarsus would not risk displaying The Shroud & more reason Peter would be reluctant to let Paul be in possession of it let alone display it, (knowing Paul had to deal with daily threats and people seeking out to have him killed) ,Rome would be a risky place to display it in that time.\nI believe Paul of Tarsus is the kind of person that would do it anyway, the kind of person who walked that fine line between genuine courage and foolishness but not step across over the latter.  I believe it was done under Peters authority and  supervision.  It may have even been the cause of his own demise, being crucified upside down.  He was in Rome with Paul of Tarsus according to historical record. (Unless I am mistaken on that)\n I believe Paul had possession of it on at least one of his missionary journeys.\n He would have to choose his moment wisely under the guidance and counsel of The Holy Spirit in choosing a place, time or location to display it.  I believe there were many occasions, if not most of the time he did not have it on his person, or display it.  I believe the success of his ministry was more reliant on his charismatic, bold and fearless manner in which he gave testimony, his knowledge of scripture and how Jesus fulfilled them.\nA genuine leader who led by example more than just words.  A real powerful speaker.\nConvincing & with the power of Holy Spirit with him to protect him &The Shroud if need be.\nOf course all of this is just speculation.  I am not a authority or expert on the ministry of Paul of Tarsus.   I am writing what I feel The Spirit of God wants written. PEACE\n\n","date":"May 21, 2014 at 4:10 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-122786","author":"Dave Hines","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Hi Dave (Hines, there are many Davids but not a single Goliath here):\nNo one can disagree with you when you write about Paul, he is still a strong force to reckon with. If you are studying the apostle perhaps you could read — that is, if you have not already read them — two books by Joseph A. Fitzmyer, SJ, not only a world-renowned NT scholar but also the foremost Pauline scholar of the 2Oth century:\n“According to Paul: Studies in the Theology of the Apostle” (Paulist Press)\n“Spiritual Exercises based on Paul’s Epistle to the Romans” (Eerdmans).\nAn interview with Father Fitzmyer is in the link if you are interested in reading it, however there is nothing about Paul there.\nhttps://www.academia.edu/4700001/What_do_we_know_about_the_Bible_An_interview_with_Joseph_A._Fitzmyer_SJ\nI think it was the experience of the risen Christ that was the impetus for the Jesus movement, the primitive Church, the reason for a complete change in the attitude of the apostles. If a Shroud played an important role, it would, in my view, have been mentioned several times and by several people in what we call Scripture.\nWhatever you may think about that stated above, I appreciate your work, it is needed a lot today.\nBest.\n\n","date":"May 21, 2014 at 5:22 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-122816","author":"Louis","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"“I think it was the experience of the risen Christ that was the impetus for the Jesus movement, the primitive Church, the reason for a complete change in the attitude of the apostles.”. ….Well said\n\n","date":"May 21, 2014 at 5:42 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-122826","author":"Mike M","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Hi Louis, thanks for replying and I will definitely check out the links you posted. One thing about Shroud research is that it forces a person to go out of their normal comfort zone and actually have to start using that thing between our ears called the human brain.\n If one was to actually be in a courtroom style setting and this Paul of Tarsus passage was used as a display to authenticate The Shroud it would likely backfire, and actually even work in reverse. It could end up making the defense look desperate & lose credibility with a jury.   I learned that from being on this Blog Site.  I certainly did not foresee all the different angles from which the “evidence” would be attacked & how fairly easy reasonable doubt was cast into it. A good learning lesson.  I am certainly not in disagreement with experience of the risen Lord being the force for character transformation of the apostles.   From a spirit of fear, to fearless and bold. Amongst many other positive character traits of genuine humility.\nIt is unfortunate in regards to the absence of historical record of The Shroud in written scripture and throughout the early centuries. Puzzling & thought provoking, another mystery to solve.  One thing we could all agree on, “for the time being leave the Paul of Tarsus passage out of the defense display”   It does not matter what we believe, it only matters what we can prove.   Perhaps the good Lord will have a surprise discovery of some ancient scripture that will help further prove the authenticity of The Shroud beyond a reasonable doubt. Until then, we’ll have to leave the Paul of Tarsus passage in the evidence vault to be opened at a later date.  PEACE TO YOU\n\n","date":"May 22, 2014 at 12:46 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-122959","author":"Dave Hines","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Hi Dave, it is good to see that you are one who analyses issues carefully. There is much to study and I trust that excavations in Turkey may bring more things to light. I think the absence of a historical record in scripture is due to the fact the Jesus movement was a Resurrection movement, not an Empty tomb movement, the references to the empty tomb  were only to explain how a supernatural event got that way. Peace.\n\n","date":"May 22, 2014 at 8:33 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-123349","author":"Louis","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Good Evening Louis: I really like This Shroud Blog Site. This is a bit of sidetrack type question but I was listening to Russ Breault;s theory has to how the image was formed on The Shroud and it sounded right.\nHypothetically, if The Shroud image was formed by living cells in a body being electrified and each one emitted a micro thin laser beam, (short wave, high frequency) and the distance each one traveled was encoded into the linen, how many individual laser beams would be needed to form the entire Shroud image, front and dorsal?    A ballpark estimate.  \n100,000?   1,000,000?   Is there a way to get a semi- accurate count by looking at a square inch of the image under magnification and then do the rest of the math based on that count?\nThe reason I ask is because I would like to make a video dramatization demonstrating The Shroud image being formed in this manner.    \nI have some pretty high tech video editing software equipment, (Sony Vegas) I want to make a video that demonstrates the image formation using Russ Breault’s theory. \nLouis, can you answer that question?\nI want to see how it looks on film using Barrie’s photos of The Shroud in the Garden Tomb.\nI have a version I did last year but I want to upgrade it.\n\n","date":"May 23, 2014 at 12:31 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-123422","author":"Dave Hines","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"I could have a go. Mark Evans’s microphotographs show that adjacent individual fibres can be either stained or not, so the resolution of the “printer” cannot be poorer than the width of a fibre, say 50um. That’s 20 000 “dots per cm.” As the shroud is roughly 400 x 100 cm, the number of laser beams to discolour the entire shroud would be 800 000 000. I do not know how much of the Shroud is actually taken up by the body images, but if, for convenience, we said one-eighth, then 100 million individual beams would be enough to produce the images.\nI hope that helps.\n\n","date":"May 23, 2014 at 3:10 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-123457","author":"Hugh Farey","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"Good Morning Mr. Hugh Farey:   You just made my day!  This has been on my mind for weeks. Thanks for doing this research and math work!   That helps immensely.  20,000 dots per centimeter.  That is absolutely amazing.  You know on Sony Vegas Video Editing Software, I can capture 100  different photos of a one second frame, separate each one, then put them back together and then elongate the one second time shot.   So we could see in a period of say, 30 seconds, what happened in one second.  Meaning to elongate each 1/100th of a second shot so the human eye can see what is happening.   I think that is the only way to illustrate the resurrection, because it was a short wave high frequency light source involved in Shroud image.   Play it out in slow motion, and then a few shots at regular speed. The flash of lightening type shot, then the slow motion shot of a living cell firing off a laser beam.  I want to make some kind of educational film using simple words and displays to talk about Shroud image formation.  Real up close and graphic displays.\nHopefully be able to finish before Christmas.  Thanks for responding.\n\n","date":"May 23, 2014 at 10:55 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-123593","author":"Davie HInes","site":"shroudstory"},{"title":"Jesus’ Long Hair Again and Again and Again","post":"I knew you would agree, Mike. This was the oral tradition in the primitive communities, that was later put down in writing.\n\n","date":"May 21, 2014 at 5:58 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","id":"comment-122831","author":"Louis","site":"shroudstory"}]
