[{"title":"Jack Markwardt’s Antioch Theory","post":"Real problem in assuming that the ‘icon’ is the Shroud but let’s see if he presents anything stronger in St. Louis. I hope he does not just repeat what he said in 2008- too many unexplained gaps.\n\n","date":"August 15, 2014 at 1:14 pm","url":"https://shroudstory.com/2014/08/15/jack-markwardts-antioch-theory/","cat":"history","id":"comment-144061","author":"Charles Freeman","site":"shroudstory"},{"title":"Jack Markwardt’s Antioch Theory","post":"Markwardt was able to make a case for the Shroud being taken to Antioch before the Jewish War.  The sources he quotes and uses are necessarily sparse.  It is pointless to demand further evidence which no longer exists, and one must make the best of whatever sources are in fact available, even if sometimes questionable, or open to other interpretations.  The track is further compromised by the early Christians need for secrecy, and their systematic use of obscurity  for protection against persecution, particularly of such items they deemed important or valuable. \nHe gives a credible explanation for the concoction of the Abgar legend, believing it to be an allegory to record the conversion of the court of Abgar VIII the Great, but so written to conceal the true facts from imperial authority.  He suggests that Bishop Avercius Marcellus was given temporary custody of the Shroud to assist in this conversion, and that the contemporaneous Bardesanic Hymn of the Pearl composed in Edessa, together with the epitaph inscription of Avercius reflect this occasion.  Other evidence is also mustered to support his argument.  When Antioch was about to be destroyed by Chosroes’ Persian invasion ~540 AD, the relics were taken to Edessa, which had by then become a major centre of Syriac Christianity of diverse beliefs and practices.  The contemporary legend of the image’s discovery in a wall at Edessa would seem to be an adaptation of an event that actually occurred in Antioch, merely to explain its emergence in Edessa.      \nWhether or not the hypothesis that the Mandylion and the Shroud were one and the same object, can be sustained or not, is a matter that needs further exploration.  There are clearly difficulties in sustaining such a hypothesis.\n\n","date":"August 16, 2014 at 5:13 pm","url":"https://shroudstory.com/2014/08/15/jack-markwardts-antioch-theory/","cat":"history","id":"comment-144248","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Jack Markwardt’s Antioch Theory","post":"One can do an enormous amount of research in six years- two PhDs if you work at it, so one would hope for much more to support his theory if it has legs on it.\nAs ‘icon, can mean any likeness, from paintIng on a catacomb wall, to a wooden panel to a statue, then I just hope he does not go on assuming that a mention of an icon of Christ means  the Shroud! It is just worth remembering how many icons of Christ still exist in the catacombs.\n\n","date":"August 17, 2014 at 2:49 am","url":"https://shroudstory.com/2014/08/15/jack-markwardts-antioch-theory/","cat":"history","id":"comment-144313","author":"Charles Freeman","site":"shroudstory"},{"title":"Jack Markwardt’s Antioch Theory","post":"Charles, I note your repeated reference to “icon” in Markwardt’s 2008 paper.  I am surmising that this may refer to an early quote in the paper, where he quotes Athanasius of Alexandria, ca 328-373, who affirmed that a sacred Christ-icon, traceable to Jerusalem and the year 68, was then present in Syria.  His source for the Athanasius quote is the original Latin as given in Dobschutz.  \n“…but two years before Titus and Vespasian sacked the city, the faithful and disciples of Christ were warned by the Holy Spirit to depart from the city and go to the kingdom of King Agrippa, because at that time Agrippa was a Roman ally. Leaving the city, they went to his regions and carried everything relating to our faith. At that time even the icon with certain other ecclesiastical objects were moved and they today still remain in Syria. I possess this information as handed down to me from my migrating parents and by hereditary right. It is plain and certain why the icon of our holy Lord and Savior came from Judaea to Syria.” \nThe Latin referring to the icon as given by Dobschutz is:\n“Quo tempore etiam icona com ceteris rebus ecclesiasticis deportata usque hodie in Syria permansit.”  and “haec certa et manifesta ratio est de icona sancta domini salvatoris, qualiter de Judea in Syria partes devenit.” \nAllowing that there is no definite article in Latin, and that the cult of icons had yet to develop to any great extent, and that Old Testament prohibition on images was probably still influential in that region in 68 AD, I am wondering what specific object you might suppose was in Athanasius’ mind as the references to “etiam icona” and “icona sancta domini salvatoris” ?  It might also suggest that Athanasius being in Alexandria was not aware of any other object in Egypt having an image that might be any more significant!\n\n","date":"August 17, 2014 at 5:57 am","url":"https://shroudstory.com/2014/08/15/jack-markwardts-antioch-theory/","cat":"history","id":"comment-144344","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Jack Markwardt’s Antioch Theory","post":"I have no idea what icon he might have been referring to, the evidence is simply not there.I see absolutely no reason why it should be the Shroud when the Greco- roman world was awash with images of all sorts. Athanasius was writing in an age when there is a myriad of legends about early Christianity. Many cities created an early Christian past to gain status. So don’t take any of this too seriously- no professional historian does.\n\n","date":"August 17, 2014 at 6:07 am","url":"https://shroudstory.com/2014/08/15/jack-markwardts-antioch-theory/","cat":"history","id":"comment-144347","author":"Charles Freeman","site":"shroudstory"},{"title":"Jack Markwardt’s Antioch Theory","post":"I find that remarkable.  Athanasius was born and died in Alexandria (293-373).  It would seem perhaps from his quote that his parents had migrated there.  He succeeded Bishop Alexander in 328.  He is not making the case for some significant icon in Alexandria, or even elsewhere in Egypt.  He is referring to an icon taken by the apostles to Syria from Jerusalem in the year 68, to the kingdom of Agrippa II.  It is apparently a very special icon considering that it is described as “etiam icona” and “icona sancta domini salvatoris”.  Why would he want to make a special case for just any old icon in Syria?  Perhaps then it is not so surprising that “professional historians” seem to have made little headway in penetrating these matters if they do not take such sources seriously.  Or is it the case that “professional historians” do not examine the “why” and “how” but only the “when” and “what”?\n\n","date":"August 17, 2014 at 7:09 am","url":"https://shroudstory.com/2014/08/15/jack-markwardts-antioch-theory/","cat":"history","id":"comment-144353","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Jack Markwardt’s Antioch Theory","post":"The reason why professional Christian historians don’t take these stories of the first century seriously is that they are reports from three hundred years later (as here) and it is clear that many of them emerged as legends in the fourth century to give status to Christian cities when Christianity was able to operate openly.  Virtually every Christian city from the later Roman empire that i take tours to has a back story of its first bishop and legends surrounding him but no one can find any independent evidence,except in a few case, to back them.\nIf the icon existed I agree that it might not be’ just any old icon’. It would be an icon venerated for some reason but I cannot understand why it should be the Shroud. The mass of early icons we have are of Christ alive or after the Resurrection. The earliest one we have of him shown actually dead is eighth century ( from St, Catherine’s Sinai), so we would normally say that an early icon is of Christ alive or after the Resurrection as the catacomb  icons ) wall paintings ) show.. You need to scour the works of Athanasius to see if he he held a Shroud in any veneration so far as I know he did not (but there is a lot to read!).\nWhat we can’t say is that the mention of an icon from the first century means the Shroud and if Markwardt rests his case on that he is going nowhere fast.\n\n","date":"August 17, 2014 at 12:57 pm","url":"https://shroudstory.com/2014/08/15/jack-markwardts-antioch-theory/","cat":"history","id":"comment-144380","author":"Charles Freeman","site":"shroudstory"},{"title":"Jack Markwardt’s Antioch Theory","post":"Thank you Charles for your more considered reply.\n\n","date":"August 17, 2014 at 3:49 pm","url":"https://shroudstory.com/2014/08/15/jack-markwardts-antioch-theory/","cat":"history","id":"comment-144389","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Jack Markwardt’s Antioch Theory","post":"I rather doubt the early Christian community used the Shroud as an icon of worship, or even evangelization – for the very reason you point out. The Shroud depicts Jesus defeated, not victorious. I would think that the burial linens must have been a source of confusion for the apostles as in what to do with them. They had seen the risen Christ, so what need of ‘unclean’ burial linens. But neither could they destroy the linens for they were marked with the Lord’s blood and image. The Shroud, for those that had seen a resurrected Jesus, would have been more like a memento or a keepsake. Too precious to lose, but not significant (to them) to promote or venerate. But as the first witnesses eventually die off, the Shroud and other relics become critical in proving the corporality of Jesus. At that point these relics become pearls of great price, venerated and priceless. Now they must be kept secret and shown only to the select.\nIt may seem an odd comparison but I recall watching an episode of Hanna Montana with my daughter (when Miley was still a likeable young celeb). In the episode, Miley’s best friend finally discovers the truth that Miley is Hanna. The friend, who had until then obsessed over a scarf she had received from the pop star, gives the item to another girl (also a Hannah fan but oblivious that it’s Miley). The friend had no use for the Hanna relic for she had something better, her friend is a pop star and she now shares this great secret with her.\nI imagine Peter and Mary M felt much the same.\n\n","date":"August 17, 2014 at 8:13 pm","url":"https://shroudstory.com/2014/08/15/jack-markwardts-antioch-theory/","cat":"history","id":"comment-144433","author":"David Goulet","site":"shroudstory"},{"title":"Jack Markwardt’s Antioch Theory","post":"This sounds very interesting.  I’ll have to download and read the paper when I have a couple hours (ha! – been very busy).\n\n","date":"August 17, 2014 at 7:48 pm","url":"https://shroudstory.com/2014/08/15/jack-markwardts-antioch-theory/","cat":"history","id":"comment-144427","author":"Andy","site":"shroudstory"},{"title":"Jack Markwardt’s Antioch Theory","post":"It occurred to me that you have not considered Phil Dayvault.\nWe have already seen that he is a “good player”.\nI have not forgotten this name because I saw him in Argenteuil,\nFrance (several years ago …) …\n— —\nI remember that Diana Fullbright (= “Were sixth-century natural catastrophes\nfactors in the transfer of relics from Palestine ?” IWSAI 2010) agreed\nabout the lack of historical truth about the legend of Abgar.\nBut, there is another argument to consider…\nHere the question :\nWhat is your opinion about the Tile/Keramion indicated by Phil Dayvault ?\nIs that repert (= a mosaic depicting the Face of Christ) compatible with\nthe Antioch’s scenario indicated us by Jack Markwardt ?\n— —\nThe Shroud scholar Phil Dayvault and the Face on a strange mosaic\nwere already discussed in this blog.\nSee :\n– Heaven is for Real, the Akiane Prince of Peace, the ISA Mosaic and\nthe Shroud of Turin, April 21, 2014\n– More on the ISA Tile and the “Prince of Peace”, April 22, 2014  \nand there is also to take into account what\ndaveb (April 23, 2014 at 4:31 am) wrote :\n> … the evidence is circumstantial and must be considered.\nIt was unearthed in Edessa, the centre of the cult of the mandylion\nand its home from 540AD to 944AD. Syriac monks carried copies\nof the mandylion throughout the Christian Middle East. I would have\nto agree with Louis, that it has quite a striking resemblance to\nthe icon now at Kiev formerly at St Cathenine’s, Sinai. Both Wilson\nand Guscin are expert art critics and have extensive experience in\nsurveying very many representations of the mandylion. They assign\nthe mosaic to 550-650AD; as such it would have been among some\nof the earliest copies. \nHave your the time to look (another time) into the paper by Phil (the\nformer FBI Special Agent) ?\nLook at the “ancient blackborad” (= the tile) …\nPerhaps both patways are compatible : Antioch and Edessa…\n— —\nI would be grateful if you would send an early reply.\n\n","date":"August 18, 2014 at 9:30 am","url":"https://shroudstory.com/2014/08/15/jack-markwardts-antioch-theory/","cat":"history","id":"comment-144551","author":"piero","site":"shroudstory"},{"title":"Jack Markwardt’s Antioch Theory","post":"Errata corrige:\n“both pathways are compatible”\ninstead of\n“both patways are compatible”\nI beg your pardon…\n— — —\nH i s t o r y .\n>Peter (“Rocky”) operated out of Antioch from AD 47-54 and was the first bishop of that city, and it was there that the disciples were first called “Christians.”\n>The gentile Christians took refuge there until things cooled down in Jerusalem.  (And there were disputes between them and the Jewish Christians who had remained in Jerusalem.)  Things never did cool down, and Jerusalem was destroyed by Titus in AD 70 and the Jewish Christians were scattered.\n>Titus took some figures of cherubim from the Temple and mounted them on the South Gate of Antioch.  The gate therefore became known as the Gate of the Cherubim, and the adjoining district, called “the Cherubim,” encompassing the old Jewish Quarter (the Kerateion), was likely the place where the refugees from Jerusalem had settled.  …\nlink:\nhttp://www.freerepublic.com/focus/chat/3054879/posts\n— —\nHere another link:\nhttp://antioch-on-the-orontes.blogspot.it/2012/09/the-cherubim-gate-and-carob-trees.htm\nAntioch – The Queen of the East …\nhttp://libaniusredux.blogspot.it/2008/12/cherubim-gate.html\n\n","date":"August 18, 2014 at 10:47 am","url":"https://shroudstory.com/2014/08/15/jack-markwardts-antioch-theory/","cat":"history","id":"comment-144562","author":"piero","site":"shroudstory"}]
