[{"title":"Jesus:  Fiction Created by Roman Aristocrats?","post":"Yet another Jesus myth conspiracy. Spare us!  Roman aristocrats wrote the gospels??!!  From the time of Romulus to Constantine, there wouldn’t have been one single Roman writer with a smidgeon of the intimate knowledge of the Hebrew scriptures evident in the gospels or for that matter in Paul. Tell it to Nero or Caligula! \nOf course it’s much easier writing a ‘novel’ when you can draw on ready-made characters.  Less hard work.  All you need is an angle, a gullible public, and the publishing houses laugh all the way to the bank!\n\n","date":"October 15, 2013 at 6:49 am","url":"https://shroudstory.com/2013/10/15/jesus-fiction-created-by-roman-aristocrats/","cat":"history","id":"comment-47540","author":"daveb of wellingon nz","site":"shroudstory"},{"title":"Jesus:  Fiction Created by Roman Aristocrats?","post":"Dave, you know of at least one Roman writer( he of course wrote in Greek) with “an intimate knowledge of the Hebrew scriptures,” that would be Paul.  While not culturally a Roman, he was a Roman citizen.  Ptolomy (Philadelphius, I think, not sure) had the Hebrew scriptures translated into the Septuagint. I am not saying it was on their ‘best sellers of all time’ list but was certainly available to the Roman reader if desired.  Flavius Josephus, another Jew, wrote for the Roman audience in his “Antiquities.” Tacitus mentions Jesus, and Suetonius in his “Lives of the Caesars” tells of “Chrestus” and his followers.  It was believed that “Chrestus” was a god of the slaves, Chrestus being a popular name for a male slave, meaning pleasant, or cheerful. Julius Africanus quotes Thallus and others who indeed confirm that on the afternoon of the crucifixion, an earthquake and darkness (possibly an eclipse) followed the crucifixion.   Pliny the younger also mentions Christians.  I am not sure if you are including early Christianity in the context of Hebrew thought.  It is possible to include Christianity as an extension of Judaism at it’s inception, certainly this was bone of contention between Peter and Paul.  You no doubt know all this stuff, just adding this for reference.\n\n","date":"October 15, 2013 at 10:50 am","url":"https://shroudstory.com/2013/10/15/jesus-fiction-created-by-roman-aristocrats/","cat":"history","id":"comment-47568","author":"Josie L. Tyner","site":"shroudstory"},{"title":"Jesus:  Fiction Created by Roman Aristocrats?","post":"Joseph Atwill knows next to nothing. Can he answer the question why this is not in the Mishnah? Is he trying to be funny or is this just another attempt to fill the coffers of publishing houses, a complaint often voiced by serious biblical scholars?\n\n","date":"October 15, 2013 at 9:19 am","url":"https://shroudstory.com/2013/10/15/jesus-fiction-created-by-roman-aristocrats/","cat":"history","id":"comment-47557","author":"Louis","site":"shroudstory"},{"title":"Jesus:  Fiction Created by Roman Aristocrats?","post":"What’s interesting, although there are no evidence that the Gospels were fiction created by Roman authorities, there are claims that Roman intellectual aristocracy at the times of Nero was inspired byt he Gospel account, and used some motives in their own works, either as inspiration, or to ridicule Christian beliefs! Popular Italian apologetic writer Antonio Socci writes about that in his work “La guerra contro Gesu”  (“The War Against Jesus”), based on opinion of literary scholars like Marta Sordi and Ilaria Ramelli.\nAccording to them, the Christian motives can be found in Petronius’ “Satyricon” and Seneca the Younger’s “Hercules Oetaeus”. \nBTW: There are 14 alleged letters between Paul and Senecca. http://en.wikipedia.org/wiki/Epistle_to_Seneca_the_Younger Although usually considered as the 4th century apocrypha, no one was able to give direct proof that they were forged, so there are still some scholars (although minority) who consider them authentic.\nNeverthelless, the friendship between Senecca and Paul is quite probable. Paul met Senecca’s brother, Gallio in Corinth in 52 AD.\n\n","date":"October 15, 2013 at 9:36 am","url":"https://shroudstory.com/2013/10/15/jesus-fiction-created-by-roman-aristocrats/","cat":"history","id":"comment-47560","author":"O.K.","site":"shroudstory"},{"title":"Jesus:  Fiction Created by Roman Aristocrats?","post":"It was a Roman, I believe, who said “There is no concept so outrageous, or any theory so mad, that some philosopher shall not someday say it. ” “Pacify the poor?”  Just exactly how were the poor of Judea to be pacified by a Messiah whom most believed to be a re-run of King David, one who would liberate by the sword? If the Gospel is any witness, most of His followers believed this: that He would liberate His people from Roman oppression, not establish a new covenantal relationship between God and Israel.  Mass crucifixions and brutal taxation kept the people “pacified” enough for Roman purposes.\nWhat I would like this author to do is come up with some proof.  Failing that, please establish a parallel or historical precedent where Pax Romana drew upon local “superstition”( I use this word purely in the context of Roman rule) to engage in conspiratorial control of anything. The coming Messiah was an obscure, and uniquely Jewish, concept. In fact, the beleaguered procurator Pilate had no wish to crucify Jesus at all.  I cannot understand why an event where local religious zealotry backed Rome into a corner would benefit either the Roman aristocracy or the military establishment.  In fact, it made Rome look really bad; the big, bad, Roman establishment being cowed into crucifying an innocent man by a bunch of  ill-tempered old farts comprising a local religious body called the Sanhedrin? Yeah, that makes Rome look swell.\nYou can hardly establish control over a population by attempting to manipulate a powerless minority.  Not even by the A. D. 400’s was Christianity the majority religion of the Roman Empire.  This author must have read Kurt Vonnegut’s “Cat’s Cradle” and assigned the character of Bokkonon to Jesus. It is the miserable failure of this and many, many other modern thinkers (term used very generously) to ascribe to the ancients concepts not found in Western thought until the Enlightenment. If you have a contingent of trained, merciless butchers, why the hell would you need a popular religion? If the Romans wanted to control their empire using religion, there were cults and devotions much more likely to appeal, less restrictive, less burdened with concepts like “sin” and “redemption.” Why not find some all-embracing, all accepting, anything-goes-as-long-as-you-pray-and-pay mother goddess from the Eastern provinces? Actually, any serious Christian of any denomination can tell you why. The Happy Goddess Mommy wouldn’t have lasted any more than “Good Vibes Jesus” or “Buddy Christ ” or “Anything Goes Forget that Whole Sin Thing Jesus” is going to last now. Only His love has that kind of power.\n\n","date":"October 15, 2013 at 10:10 am","url":"https://shroudstory.com/2013/10/15/jesus-fiction-created-by-roman-aristocrats/","cat":"history","id":"comment-47565","author":"Josie L. Tyner","site":"shroudstory"},{"title":"Jesus:  Fiction Created by Roman Aristocrats?","post":"Even the agnostic NT scholar Professor Bart Ehrman convincingly controverts every argument of the “Jesus is Myth” brigade, well and truly, and offers several independent arguments for the real existence of Jesus, see “Did Jesus Exist?”:\nhttp://ehrmanblog.org/did-jesus-exist-as-part-one/ a good read. \nRe the Septuagint: Ptolemy II was persuaded by an exiled Greek politician to establish the Great Library in Alexandria. Every traveller had all his books confiscated, copied, the original went to the Library, and the traveller was given the copy in return. A similar policy probably accounts for the origins of the Septuagint, notwithstanding the fables about it. \nA close study of even Matthew’s gospel will continue to surprise and amaze any modern reader as to the intimate and detailed acquaintance he had with the Hebrew scriptures, and the inventive way he applies them to the life of Jesus. Such detailed knowledge would be beyond the ability of any pagan Roman writer, no matter how familiar he may have been with the Septuagint. He would also lack the subtle knowledge of Judaism required in the writing of any gospel.\n\n","date":"October 15, 2013 at 3:35 pm","url":"https://shroudstory.com/2013/10/15/jesus-fiction-created-by-roman-aristocrats/","cat":"history","id":"comment-47585","author":"daveb of wellingon nz","site":"shroudstory"},{"title":"Jesus:  Fiction Created by Roman Aristocrats?","post":"Truly. Thank you for the clarification on the Septuagint.  Have read Ehrman and like his wor. .Among other works worthy of perusal is  the U.S bestseller “The Case for Jesus” by Lee Strobel. It falls under the genre of popular literature, but is amazingly and exhaustively well researched.  There are few serious  scholars who doubt the historical Jesus.  At the end of the day, I don’t think Mr. Atwill impressed either of us. Cheers.\n\n","date":"October 15, 2013 at 7:11 pm","url":"https://shroudstory.com/2013/10/15/jesus-fiction-created-by-roman-aristocrats/","cat":"history","id":"comment-47595","author":"Josie L Tyner","site":"shroudstory"},{"title":"Jesus:  Fiction Created by Roman Aristocrats?","post":"Josie, your note at #2: “Julius Africanus quotes Thallus and others who indeed confirm that on the afternoon of the crucifixion, an earthquake and darkness (possibly an eclipse) followed the crucifixion.” \nIt wasn’t an eclipse (can’t have a solar eclipse when there’s a full moon, time of Passover, more likely a dust-storm).  I’d appreciate a specific ref to the Julius Africanus, esp if on web. Some deniers assert that darkness & EQ were mere literary devices, I don’t think so.\n\n","date":"October 15, 2013 at 7:47 pm","url":"https://shroudstory.com/2013/10/15/jesus-fiction-created-by-roman-aristocrats/","cat":"history","id":"comment-47597","author":"daveb of wellingon nz","site":"shroudstory"},{"title":"Jesus:  Fiction Created by Roman Aristocrats?","post":"For the record, Julius Africanus does not agree with Thallus, although he records what he wrote.  This Thallus could have been one of two people: a respected historian who wrote a history of the fall of Troy, and lived between 50 and 100 BCE.  His name has been linked with one Castor of Rhodes, whose work was important in setting the standard for future historical writings. There was another Thallus to whom Flavius Josephus referred; he wrote a few minor works but was more famous for loaning about a million drachmas to Herod Agrippa.\nI have a library that includes the Anti Nicene Fathers, so I can vouch for the reliability of the Ethereal Library, a website where you can freely access almost every Christian work ever written.   It is in Chapter XVIII : “From the Circumstances Connected with Our Savior’s Passion and His Life-Giving Resurrection” (ANFO6: Fathers of the 3rd Century; Gregory Thaumaturges, Dionysius the Great, Julius Africanus.)  The work of JA exists only as preserved by Eusebius and a Byzantine Scholar who wrote mostly in Aramaic, one Georgius Syncellus.   However, as I understand it, a fragment of an earlier copy of the Chronography was discovered in one of the Oxyrhinncus Papyri.      Best, JT.\n\n","date":"October 16, 2013 at 12:43 am","url":"https://shroudstory.com/2013/10/15/jesus-fiction-created-by-roman-aristocrats/","cat":"history","id":"comment-47609","author":"Josie L Tyner","site":"shroudstory"},{"title":"Jesus:  Fiction Created by Roman Aristocrats?","post":"Thank you for that, Josie. I found what I was looking for. It’s a real Treasure Trove of Christian Writings I hadn’t been aware of.  Searching is easy, and you can read on-line.  I hope to return to it often.\nI recommend it to any researcher. Can be found at:\nhttp://www.ccel.org/  and I’ve made a note of it!\n\n","date":"October 16, 2013 at 2:51 am","url":"https://shroudstory.com/2013/10/15/jesus-fiction-created-by-roman-aristocrats/","cat":"history","id":"comment-47612","author":"daveb of wellingon nz","site":"shroudstory"},{"title":"Jesus:  Fiction Created by Roman Aristocrats?","post":"This is up there with the already debunked myth that Jesus and Mary Magdalene married and had kids in France (or wherever).  There is nothing scholarly here unless one counts fiction as scholarly.\n\n","date":"October 17, 2013 at 9:40 pm","url":"https://shroudstory.com/2013/10/15/jesus-fiction-created-by-roman-aristocrats/","cat":"history","id":"comment-47836","author":"Andy Weiss","site":"shroudstory"}]
