[{"title":"John of . . . , John the . . . ,  Servant of the Priest? That Also?","post":"I do not advocate this position, but there is at least one biblical scholar who advocates Mary Magdalene as the the beloved disciple. See Leonard Swidler, Jesus Was a Feminist: What the Gospels Reveal about His Revolutionary Perspective, Sheed & Ward, 2007\nIt is an interesting proposition but one that is not either faith affirming or denying. I do not believe that but I do believe that for his time and place Jesus was a feminist, and a radical one at that. But married to Mary M.? \nUnfortunately, that concept is the basis of all sorts of nonsense memorialized by Holy Blood, Holy Grail (HBHG) and the DaVinci Code, neither of which qualify as serious scholarship. I really, really don’t believe that Europe is waiting to crown a new king – even the one who is the grandson son, eighty times removed of Christ. (That was the real revelation of HBHG. Turns out the documents relied on by HBHG were forged by the putative descendant of Jesus.\nFrankly, simple is better. Christ has died, Christ has risen. Christ will come again. To borrow a quote from Rabbi Hillel: “Everything else is commentary.”\n\n","date":"November 15, 2014 at 7:40 am","url":"https://shroudstory.com/2014/11/15/john-of-john-the-servant-of-the-priest-that-also/","cat":"history","id":"comment-171386","author":"John Klotz","site":"shroudstory"},{"title":"John of . . . , John the . . . ,  Servant of the Priest? That Also?","post":"“Christ has died, Christ has risen. Christ will come again. To borrow a quote from Rabbi Hillel: “Everything else is commentary.”\nThanks John, you hit the nail on the head.\n\n","date":"November 15, 2014 at 8:22 am","url":"https://shroudstory.com/2014/11/15/john-of-john-the-servant-of-the-priest-that-also/","cat":"history","id":"comment-171396","author":"Mike M","site":"shroudstory"},{"title":"John of . . . , John the . . . ,  Servant of the Priest? That Also?","post":"There is no early evidence that indicates that the witnesses of Jesus’ appearances concluded that Jesus had been raised from the dead because they ALSO knew that the tomb was empty. The personal encounters with Jesus were decisive and later attempts to combine the two traditions  — empty tomb and appearances — were done to provide additional support for Jesus’ resurrection for the LATER generation of believers.\nStephen Jones is an Evangelical Christian,but I have my doubts if he has ever read the Protestant (Reformed Church) theologian Jürgen Moltmann. Moltmann is not a “Shroudie”.\n\n","date":"November 15, 2014 at 7:59 am","url":"https://shroudstory.com/2014/11/15/john-of-john-the-servant-of-the-priest-that-also/","cat":"history","id":"comment-171388","author":"Louis","site":"shroudstory"},{"title":"John of . . . , John the . . . ,  Servant of the Priest? That Also?","post":"I know of one theory that equates “the beloved disciple” with a presumed adopted son of Jesus.  Because of then high mortality rates, many orphans were prevalent in ancient times, and other family members would then adopt them.  Adoption gave the same legal rights as birth.  Because of Jesus’ claim to be a king his identity was kept secret as his life would be in danger as the natural heir.  If a king was defeated and killed, there was a need to forestall the possibility of pretenders to his succession.  He is variously identified with one of the named brothers in Mark’s gospel, the one who leaned on Jesus’ breast at the Last Supper, the one who fled naked in the garden leaving his pyjamas behind (Mark), the disciple present at the crucifixion, and the original author of the fourth gospel.  Clearly not all of these would necessarily apply to the same person. \nAdrie van der Hoeven’s 2011 paper “The Turin Shroud as John Mark’s temple garment” offers some fascinating speculations on the origins of the Shroud, and makes a good case for its originally being a temple garment.  It is certainly worth reading, but unfortunately seems to suffer from an apparent confusion associating the writers of the first and fourth gospels as the same person, and this would seem an unlikely identification.  \nAs to the authorship of the fourth gospel, Encyclopedia Britannica offers the following: \n“Irenaeus calls John the beloved disciple who wrote the Gospel in Ephesus. Papias mentions John the son of Zebedee, the disciple, as well as another John, the presbyter, who might have been at Ephesus. From internal evidence the Gospel was written by a beloved disciple whose name is unknown.” \n“Because both external and internal evidence are doubtful, a working hypothesis is that John and the Johannine letters were written and edited somewhere in the East (perhaps Ephesus) as the product of a “school,” or Johannine circle, at the end of the 1st century. The addressees were Gentile Christians, but there is accurate knowledge and much reference to Palestine, which might be a reflection of early Gospel tradition.”  \n”  … The author of John knows part of the tradition behind the Synoptic Gospels, but it is unlikely that he knew them as literary sources. His use of common tradition is molded to his own style and theology, differing markedly with the Synoptics in many ways.” \n” … Confidence in some apostolic traditions behind John is an organic link with the apostolic witness, and, from beginning to end, the confidence is anchored in Jesus’ words and the disciples’ experience-although much has been changed in redaction. Traces of eyewitness accounts occur in John’s unified Gospel narrative, but they are interpreted, as is also the case with the other Gospels. ” \nWhether the author of the fourth gospel can be identified with the author of Revelations, (identified as John written on the island of Patmos) is also a credible possibility:\n“The “Johannine circle” bearing the tradition of John, the Apostle of the Lord, and from which emerged the Gospel and letters bearing his name, might have been a continuation of the prophetic conventicle of Ephesus in which John was prominent. The various writings do not have to be consistent except in their basic faith in Jesus Christ; and, as the situations to which they addressed themselves were different, different styles and content were required.”\nHence the differences in style are not sufficient to dismiss a claim that the different writings may have had the same author.\n\n","date":"November 15, 2014 at 2:13 pm","url":"https://shroudstory.com/2014/11/15/john-of-john-the-servant-of-the-priest-that-also/","cat":"history","id":"comment-171433","author":"daveb of wellington nz","site":"shroudstory"},{"title":"John of . . . , John the . . . ,  Servant of the Priest? That Also?","post":"Correction to para 2 above: ” …  associating the writers of the first and fourth gospels as the same person, and this would seem an unlikely identification.” \nI meant in terms of order of time in writing, i.e. between the Marcan and Johannine gospel writers.  I was unable to avoid the impression that the paper identified the writers, said to be John Mark and John the disciple whom Jesus as the same person.  On several grounds this identification would seem unlikely.\n\n","date":"November 15, 2014 at 2:54 pm","url":"https://shroudstory.com/2014/11/15/john-of-john-the-servant-of-the-priest-that-also/","cat":"history","id":"comment-171438","author":"daveb of wellington nz","site":"shroudstory"},{"title":"John of . . . , John the . . . ,  Servant of the Priest? That Also?","post":"I seem to be in danger of catching Max’s habit, typing too quickly.\n“… that the paper identified the writers, said to be John Mark and John the disciple whom Jesus loved as the same person. On several grounds this identification would seem unlikely.”\n\n","date":"November 15, 2014 at 2:57 pm","url":"https://shroudstory.com/2014/11/15/john-of-john-the-servant-of-the-priest-that-also/","cat":"history","id":"comment-171439","author":"daveb of wellington nz","site":"shroudstory"},{"title":"John of . . . , John the . . . ,  Servant of the Priest? That Also?","post":"Dave you wrote: “On several grounds this (John Mark/John) identification would seem unlikely.” On which ones exactly?\n\n","date":"November 17, 2014 at 8:39 am","url":"https://shroudstory.com/2014/11/15/john-of-john-the-servant-of-the-priest-that-also/","cat":"history","id":"comment-171714","author":"Max patrick Hamon","site":"shroudstory"},{"title":"John of . . . , John the . . . ,  Servant of the Priest? That Also?","post":"Max, I have been in touch with Adrie concerning her hypothesis.  I have still to see any evidence that might support it.  Superficially:  The traditions relating to John and John Mark seem to be quite different, (Mark in Rome & Egypt, John in Ephesus); there seems little that would link the two gospels as coming from the same author but this might be attributed to the large time span between them; patristic authority claims that there were four gospel authors, not three; the name John was the fifth most common Jewish name in NT times (about 4.5% of the population) and so was common.  I may be able to address the issue more fully at a later date, but hopefully sooner.  Do you know of any specific material that would support the case?\n\n","date":"November 17, 2014 at 3:28 pm","url":"https://shroudstory.com/2014/11/15/john-of-john-the-servant-of-the-priest-that-also/","cat":"history","id":"comment-171750","author":"daveb of wellington nz","site":"shroudstory"},{"title":"John of . . . , John the . . . ,  Servant of the Priest? That Also?","post":"Dave re the John/John Mark identification, here are just a few hints for lack of time: \nEtymologically speaking, the surname Mark derives from the Aramaic Maqqabah, “the Hammer”, “the Maccabee” and the Maccabees appear in history as a priestly Judean family.\nMost likely John the Presbyter (of whom Polycrates said he was ONCE a high priest as he wore the petalon) = John Mark (since the latter is the transcription of YoHanan/Yonathan Ha-Maqqabah = John “the Hammer”/the Maccabee = belonging to the priestly Judean family.\nAt the time of  Yeshua’s Passion, Death and Resurrection, he was both the assistant secretary/assistant scribe (= a young man), Gr. hemeneutes + Gr. huperethen — applied to the same person namely John Mark — < Heb. sophereth, see my own analysis) and son of High Priest Hanan. Besides the Gospel of the Hebrews  can be dated just after the middle of the 1st c. CE. It is a Lost Gospel not an Apocryphon per se if we are to rely on Jerome who is our chief source of knowledge about this Gospel. According to the latter Yeshua's gave his shroud [sindon] to \"the servant/auxiliary of the priest\". Here the words servant/auxiliary can refer to John Mark/\"The Maccabee\" as High Priest Hanan's assistant scribe. Now it is well known 'the regalia of the high priest' were zealously guarded by the Maccabees… \nJohn Mark/John the Presbyter was also designated to be a high priest as early as 36 CE yet resigned on the same year (see Claude Tesmontant's \"Enquête sur l'Apocalypse\", p.221-295, ed. F.-X. de Guibert, 1994).\n\n","date":"November 17, 2014 at 5:30 pm","url":"https://shroudstory.com/2014/11/15/john-of-john-the-servant-of-the-priest-that-also/","cat":"history","id":"comment-171761","author":"Max patrick Hamon","site":"shroudstory"},{"title":"John of . . . , John the . . . ,  Servant of the Priest? That Also?","post":"Thanks, Max, I think I recall your mentioning some of these details previously.  I continue to be in touch with Adrie, and hope to get to her 2008 paper eventually.  John Mark scriptural refs are of course: Acts: 12:12 (Peter’s refuge from prison); 12:25 (Saul returns to Jerusalem with Barnabas & John Mark); 13:5 (accompanies Paul on mission journey), 13:13 (John leaves them at Pamphylia); 15:37 (Paul declines Barnabas’ suggestion that Mark accompany them, replaced by Silas); Col 4:10 (he was cousin to Barnabas, and he was then back with Paul).  He is mentioned as disciple of Peter in I Pet 5:13.  II Tim 4:11 (may be pseudonymous but has Paul asking for Mark’s help).  \nThe name Mark is not mentioned in the Witherington stats of Jewish names and is not mentioned in Rahmani stats of names on Jewish ossuaries.  I had assumed that it might have been adopted from some type of Romanism (Marcus is a very common Latin name),  The inference I take from yours above is that it was likely a type of family name or title associated with the Maccabees. \nJohn, son of Zebedee, is a leading apostle of Jesus, apparently enjoying his special favour, and tradition has marked him out as the author of the fourth gospel. He is Galilean, from a fisherman’s family, an unlikely candidate for a priestly scribe, and none of the gospels name him as John Mark.  From John’s gospel, the “beloved disciple” took the mother of Jesus into his home, and there is a site in Ephesus that lays claim to this.  Most exegetes seem to favour the final redaction of the gospel by a Johannine school in Ephesus.  If Revelations has the same author, then it was written by John on the island of Patmos nearby (I think a prison colony).  Contrariwise there is a tradition that John Mark was missionary to Egypt, and the Coptic Church has a strong tradition in this regard. \nI think there are many things about these times that will never be known because of a deliberate policy of secrecy by the early Church, as a defence against imperial and Jewish persecution.  We may speculate from some of the more arcane clues, but I suspect that conclusive finality will remain ever elusive.\n\n","date":"November 18, 2014 at 2:11 am","url":"https://shroudstory.com/2014/11/15/john-of-john-the-servant-of-the-priest-that-also/","cat":"history","id":"comment-171818","author":"daveb of wellington nz","site":"shroudstory"},{"title":"John of . . . , John the . . . ,  Servant of the Priest? That Also?","post":"Reminder for Dave et al: \n0/- Markos is the Hellenization and Marcus the Romanization of the Aramaic surname Maqqabah and Hebrew surname Maqqabi or Maqqabet\n1/- Yeshu’a on the cross looked at his mother and said to her, ‘Dear woman, here is your son,’ and then looked at the disciple/his beloved disciple standing beside her and said to him, “Here is your mother.” FROM THAT HOUR (uppercases mine) the beloved disciple took Yeshua’s mother into his own home IN JERUSALEM (and ONLY decades later in Ephesus). \nMary mother of Yeshu’a having been appointed as the mother of the beloved disciple is mentioned as ‘mother of John Mark’ (OF JERUSALEM NOT EPHESUS) in the Acts of the Apostles 12:12.  \n2/- Because of the beloved disciple’s preoccupation with ritual uncleanliness and purity, and atonement rites, although he reached Yeshua’s tomb first, he would not enter until Peter/Kepha had done so and established there were no corpse inside.  Whence most likely John Mark aka the beloved disciple was a priest.\n3/- Yeshua gave him his shroud as most likely it was ritually clean because they most exceptionally used the water of purification (the ashes of the red heifer mixed with water drawn from a fresh-water spring) on his burial for the cleansing and atonement of his shed innocent blood (as he was sentenced to death by the Sanhedrin for crass political\nconsiderations).\n4/- John Mark could have taken with him Yeshua’s Shroud on the island of Patmos and have his profound out-of-body vision from heaven triggered by the oversized-Rorschach-bloodstain pattern-test-like relic.\n\n","date":"November 18, 2014 at 7:08 am","url":"https://shroudstory.com/2014/11/15/john-of-john-the-servant-of-the-priest-that-also/","cat":"history","id":"comment-171859","author":"Max patrick Hamon","site":"shroudstory"},{"title":"John of . . . , John the . . . ,  Servant of the Priest? That Also?","post":"Of 286 names on 231 inscribed ossuaries held by the IAA, variants on the name Mary (Miriam, Maria) occur in 20 cases, 7% of all names (Rahmani statistics).  It was a very common name for Jewish women.  Mary mother of John Mark in Acts 12:12 is not specifically identified as the mother of Jesus, nor the mother of the “beloved disciple”.  \nThe “other disciple’s” deferral to Peter at the tomb might well be only because of Peter’s leadership role, and his Jewish preoccupation with ritual cleanliness does not necessarily stem from a priesthood role, but it is interesting nevertheless, as the gospel does make a point of his delaying his entry.  \nIt still does not deal with the countervailing patristic traditions of authorship, stylistic differences in the two gospels, nor of the strong Egyptian tradition concerning John Mark.  Why would John the disciple accept such a subordinate role as secretary to both Peter and Paul in Rome?  I don’t see John a Galilean fisherman, son of Zebedee, as being the same person as John Mark, a high priest’s secretary.  It doesn’t fit.\n\n","date":"November 18, 2014 at 3:43 pm","url":"https://shroudstory.com/2014/11/15/john-of-john-the-servant-of-the-priest-that-also/","cat":"history","id":"comment-171934","author":"daveb of wellington nz","site":"shroudstory"}]
