[{"title":"Maybe the James Ossuary is Jesus’ Brother’s Tomb, Maybe Not","post":"“Christians don’t need objects to prop up their faith!”  An interestng little aphorism, possibly with just a tinge of arrogance about it.  “I don’t need objects to prop up my faith, but you do, so my faith is better than yours!”  Not very good really.\nI fall back on what Pope Benedict had to say in the UK, when he was there to mark the beatification(?) of Cardinal Newman.  “Faith without knowledge is fanaticism! Knowledge without faith is fascism!” He certainly knew something of the latter disease.  And we have seen the general mayhem in our times that can result from uninformed fanatacism.\nWe should not under-rate the value of religious artifacts in the witness that they can give to the reality of faith.  Our faith is founded in historic events, not legendary, nor mythological, nor even philosophical creations of the mind.  Our faith has a tangible origin.  It is reasonable then that there shall be artifacts which connect us with the reality of that history, those events, and those persons.\nGenuine artifacts or relics can serve several purposes, besides merely giving witness.  They may satisfy an important psychological need to be mystically united with what they represent, and who they have been associated with.\nWhen used in an informed way, they have a valid proselytising or mssionary value.  Some of us are happy to make that leap in the dark, and say “I believe”, while some of us need something more.  It may be quite a simple thing:  perhaps a persuasive argument from creation by design, the picture of a Roman flagra, or a crucifixion nail.\nFaith is a gift; it does not come from ourselves, but for some of us the gift comes but slowly, and it is helpful to have something more to prop us up in the interim.  It connects us with the reality of our past!  We are not merely spiritual beings; we are also flesh and blood!\n\n","date":"March 16, 2012 at 3:32 am","url":"https://shroudstory.com/2012/03/15/maybe-the-james-ossuary-is-jesus-brothers-tomb-maybe-not/","cat":"history","id":"comment-9353","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Maybe the James Ossuary is Jesus’ Brother’s Tomb, Maybe Not","post":"“I fall back on what Pope Benedict had to say in the UK, when he was there to mark the beatification(?) of Cardinal Newman. “Faith without knowledge is fanaticism! Knowledge without faith is fascism!” He certainly knew something of the latter disease. And we have seen the general mayhem in our times that can result from uninformed fanaticism.”\nit’s one thing for a combative science bod to be misquoted (repeatedly) on this site, and even to find himself on the receiving end of that same (mis?)quotation above with the reference to “fascism”. But nowhere have I been able to find that Pope Benedict XVI ever made a specific reference to fascism in the context of faith and reason, or would have approved of folk attributing to him on internet forums the opinion that any deficits of faith implied a tendency towards fascism.\nHere’s a report from his UK visit that would seem a more credible version of the Pope’s actual words:\n“The heart of the speech was a pitch for constructive dialogue between faith and reason, and therefore between church and state. As he has before, Benedict argued that reason shorn of faith becomes destructive ideology; faith without reason shades off into a distorted “sectarianism and fundamentalism.” \nNot a mention of that f word anywhere, so DaveB’s allusion to the Pope’s own background seems especially ill-judged.\n\n","date":"March 16, 2012 at 5:18 am","url":"https://shroudstory.com/2012/03/15/maybe-the-james-ossuary-is-jesus-brothers-tomb-maybe-not/","cat":"history","id":"comment-9358","author":"colinsberry","site":"shroudstory"},{"title":"Maybe the James Ossuary is Jesus’ Brother’s Tomb, Maybe Not","post":"It is apparent from the Huffington Post report that the IAA have missed the target badly.  They had hoped to make an example of Golan, simply because he was high profile and suspected of being involved in the antiquities black market.  They thought they could get him by prosecutinig him for fraud.  It was always open to the judge to find that the inscription on the ossuary was fraudulent if the IAA could prove their case;  It is not so apparent how he might have found that it was genuine, in view of the conflicting evidence,  So it’s about as good as it could ever get for Golan\nSuppose for argument’s sake, that the ossuary is genuine, that it is indeed the ossuary of James the brother of Jesus.  What would this say about the IAA’s treatment of genuine Christian artifacts??!!  They have yet to demonstrate any evidence at all of any concern for early Christian archaeology!\nThe trial transcript could make some interesting reading, if one had the time to peruse it all!\n\n","date":"March 16, 2012 at 3:49 am","url":"https://shroudstory.com/2012/03/15/maybe-the-james-ossuary-is-jesus-brothers-tomb-maybe-not/","cat":"history","id":"comment-9354","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Maybe the James Ossuary is Jesus’ Brother’s Tomb, Maybe Not","post":"Personally, as a Catholic believer and one who really believe the Shroud is authentic, I think the statement “Christians don’t need objects to prop up their faith.” is like an ideal.  But since we are not resurrected yet (that will come my friends) and that we still live in this material world, I think it’s normal for any believer to experiment doubts at various degrees.  So, I think many people need a little boost now and then for their faith and that boost can be found, for some, in a christian relic like the Shroud or any other object related to Jesus, Mary or the Apostles.  But the problem would be to take an object like the Shroud and make it the center piece of your faith…  For me, that’s the “danger” that lies behind the Shroud.  It’s a danger that the Church has always fought all through his history and it’s call “Idolatry”.\nI said that, for some, a boost for their faith can be found in the Shroud.  But a boost for their faith can also be found elsewhere, like in the lives of the Saints, Mystics and Martyrs…  Personally, I found this kind of boost to be much greater than the Shroud !!!\n\n","date":"March 16, 2012 at 10:31 am","url":"https://shroudstory.com/2012/03/15/maybe-the-james-ossuary-is-jesus-brothers-tomb-maybe-not/","cat":"history","id":"comment-9372","author":"Yannick Clément","site":"shroudstory"},{"title":"Maybe the James Ossuary is Jesus’ Brother’s Tomb, Maybe Not","post":"The “quotation”, as I recall was how I remember it was expressed in NZ Catholic papers at the time;  I assumed they had it right; It had a good ring to it; And it made an impression on me as a terse expression of a significant truth.  I’m sorry that Colin took it so much to heart.\nGiven time, I may be able to source it, assuming it was accurately reported.\nI note that the report that Colin mentions, is in indirect speech, and therefore not a direct quote, and the interpretation of it in terms of “church and state” seems to be merely a particular focus of the reporter.\nAs with many young German youth of his generation, the young Joseph Ratzinger had been obliged to join the Hitler Youth, which would no doubt have exposed him to the evils of fascism and which would have later stood him in good stead as a churchman of his standing, hence my allusion to it.\nI certainly did not state “that any deficits of faith imply a (personal) tendency towards fascism” but intended that fascism is the natural consequence of pure reason unaided by faith.  For example the origins of Nazism might be discovered in the writings of Nietzsche, who rejected absolute moral values and the so-called “slave morality” of Christianity.  His ideal was the “Overman” or “Superman” who would impose his will on those who are too weak and worthless to be anything but slaves.\nI have no particular wish to sustain a quarrel with Colin, and I would hope that all of us are more concerned with a pursuit in search of truth.  I set little store by petty point-scoring.  But we can all have differing points of view, and in expressing those differences we should endeavour to maintain some mutual respect for the person.\nNeither Faith by itself, nor Reason by itself, can yield the truth.  But together both may capture a glimmer of the truth.\n\n","date":"March 16, 2012 at 4:25 pm","url":"https://shroudstory.com/2012/03/15/maybe-the-james-ossuary-is-jesus-brothers-tomb-maybe-not/","cat":"history","id":"comment-9380","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Maybe the James Ossuary is Jesus’ Brother’s Tomb, Maybe Not","post":"Dave, even if you misquoted it’s clearly not directed towards anyone. What’s worth pondering is why someone would react as if they felt personally stung by the comment. Most times on sites like this someone would merely ask for clarification on the quote, a link perhaps, before offering sentiments regarding it’s authenticity and application. Not so with some.\n\n","date":"March 16, 2012 at 8:24 pm","url":"https://shroudstory.com/2012/03/15/maybe-the-james-ossuary-is-jesus-brothers-tomb-maybe-not/","cat":"history","id":"comment-9389","author":"Chris","site":"shroudstory"},{"title":"Maybe the James Ossuary is Jesus’ Brother’s Tomb, Maybe Not","post":"As I indicated, I found myself on the receiving end of that same misquotation back in February, which you can easily confirm by googling. If you know of Godwin’s Law of internet forums, you will understand the attraction that particular misquotation holds for those who indulge in misrepresentation or ad hom as so many do on this site. Indeed, you are guilty of misrepresentation yourself, in suggesting I took the “fascism” comment personally in the present context. I did not, as a careful re-read should make clear.\nI have responded to your earlier “bankrupt scorch theory” on my own new site (http://strawshredder.wordpress.com). As indicated previously,  I no longer feel this site to be a suitable forum for discussing technical and scientific detail given the sniping, the misrepresentation, the gratuitous and offensive  ad hom and, more recently, the pre-moderation and threatened editing of my comments.\n\n","date":"March 17, 2012 at 3:27 am","url":"https://shroudstory.com/2012/03/15/maybe-the-james-ossuary-is-jesus-brothers-tomb-maybe-not/","cat":"history","id":"comment-9393","author":"colinsberry","site":"shroudstory"},{"title":"Maybe the James Ossuary is Jesus’ Brother’s Tomb, Maybe Not","post":"I’m grateful to Colin for the challenge as it sent me off on a search, where I discovered that Pope Benedict has had an incredible amount to say on the complementary roles of faith and reason, much more than I had realised, and his views appear to have been widely reported and have had widespread influence and impact.\nA key paper seems to have been his lecture at the University of Regensburg on 12 September 2006: “TRUTH, FAITH AND REASON: POPE BENEDICT XVI’S\nLECTURE AT THE UNIVERSITY OF REGENSBURG”, and of course predates his widely reported comments in the UK during John Henry Newman’s beatification in 2010.\nThere is a Wikipedia summary at http://en.wikipedia.org/wiki/Regensburg_lecture .\nThere is an extremely full commentary by Gerald E Marsh, underlying the importance of this address.  Marsh’s commentary:\nhttp://www.gemarsh.com/wp-content/uploads/TRUTH,%20FAITH%20AND%20REASON-F.pdf\nI also discovered that there were even Musim commentaries, so it was widely noted.\n\n","date":"March 16, 2012 at 10:40 pm","url":"https://shroudstory.com/2012/03/15/maybe-the-james-ossuary-is-jesus-brothers-tomb-maybe-not/","cat":"history","id":"comment-9392","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Maybe the James Ossuary is Jesus’ Brother’s Tomb, Maybe Not","post":"I read the full text of Benedict’s Regensburg address yesterday. Nowhere did I see any warning of reason, with or without faith, leading inevitably to fascism, and I while you cite that particular speech, best known for its references to Islam, I see you carefully omit to mention its contents.\nIn his UK speech, it was “destructive ideology” that was mentioned, which might just as easily have been a reference to communism as to fascism, especially as the former is underpinned by the “reason” of Marxist-Leninism. Did Hitler ever make appeals to reason? I thought he played mainly to people’s fears and resentments, offering easy scapegoats, leading finally to the Holocaust, which is yet another reason (apart from misquoting the Pope) why fascism should never be casually slipped into internet debates. But it is, all the time, here included – as the existence of Godwin’s Law demonstrates, verified yet again.\n\n","date":"March 17, 2012 at 6:04 am","url":"https://shroudstory.com/2012/03/15/maybe-the-james-ossuary-is-jesus-brothers-tomb-maybe-not/","cat":"history","id":"comment-9394","author":"colinsberry","site":"shroudstory"},{"title":"Maybe the James Ossuary is Jesus’ Brother’s Tomb, Maybe Not","post":"\ncolinsberry :\nAs I indicated, I found myself on the receiving end of that same misquotation back in February, which you can easily confirm by googling. If you know of Godwin’s Law of internet forums, you will understand the attraction that particular misquotation holds for those who indulge in misrepresentation or ad hom as so many do on this site. Indeed, you are guilty of misrepresentation yourself, in suggesting I took the “fascism” comment personally in the present context. I did not, as a careful re-read should make clear.\nI have responded to your earlier “bankrupt scorch theory” on my own new site (http://strawshredder.wordpress.com). As indicated previously,  I no longer feel this site to be a suitable forum for discussing technical and scientific detail given the sniping, the misrepresentation, the gratuitous and offensive  ad hom and, more recently, the pre-moderation and threatened editing of my comments.\n\nWho said I was talking about you? ;)\n\n","date":"March 17, 2012 at 1:06 pm","url":"https://shroudstory.com/2012/03/15/maybe-the-james-ossuary-is-jesus-brothers-tomb-maybe-not/","cat":"history","id":"comment-9399","author":"Chris","site":"shroudstory"},{"title":"Maybe the James Ossuary is Jesus’ Brother’s Tomb, Maybe Not","post":"Don’t forget my friends that there was and there still is totalitarism in the Christian religion, even today, as we can also found examples of this in every other religion on this planet.  It’s part of human nature I’m affraid.  I think we have to be very careful about that question.  Extremists are EVERYWHERE you can find organised structures in society.  There always have been and there always will be some people who will think like extremists…  I believe those are the ones who are the most fearful of all…  And the real problem is always the same :  IMPOSING a point of view against another person’s point of view.  Throughout the history of the Church, we can sadly found easily examples like that.  But, it’s also the same thing anywhere else…  Like I said, it’s part of human nature.  That’s why freedom is so important in our occidental society (and we should never take this gift for granted) and that’s why I hope the separation between the Church and the state will continue in the future and be more and more definitive.  Here in Quebec, this separation is complete…  Thank God !\n\n","date":"March 17, 2012 at 5:00 pm","url":"https://shroudstory.com/2012/03/15/maybe-the-james-ossuary-is-jesus-brothers-tomb-maybe-not/","cat":"history","id":"comment-9405","author":"Yannick Clément","site":"shroudstory"}]
