[{"title":"Imagine the image as part of the resurrection and not the result of the resurrection","post":"I think the image as caused by time related events in the cloth going back as Christ’s body went to another dimension, in a process like the teleport of the StarTrek movies.This could be the reason by which both the Shroud and the Sudarium of Ov iedo seem to be younger than they are\n\n","date":"August 10, 2012 at 7:10 am","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","id":"comment-14691","author":"tersio Gorrasi","site":"shroudstory"},{"title":"Imagine the image as part of the resurrection and not the result of the resurrection","post":"“We need to stretch our thinking”…”Think of the image as being part of the resurrection and not the result of the resurrection” …Okay, Isn’t that what I’ve been trying to say for months here? The image is here and it most definately was not made by man, most probably not a “freak of nature” either. Furthermore yes, Why must it be a byproduct of the resurrection? Do we not trust that God could or would give us proof of his resurrection, proof that we cannot explain with all our conceited science? …I think yes, and I think we should humble ourselfs…\nThat is my sermon for today. Thank-you.\nR\n\n","date":"August 10, 2012 at 7:11 am","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","id":"comment-14692","author":"Ron","site":"shroudstory"},{"title":"Imagine the image as part of the resurrection and not the result of the resurrection","post":"Who is this guy/gal? Right on!!\nhttp://johnklotz.blogspot.com\n\n","date":"August 10, 2012 at 7:28 am","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","id":"comment-14694","author":"John Klotz","site":"shroudstory"},{"title":"Imagine the image as part of the resurrection and not the result of the resurrection","post":"A completely miraculous image made by God himself…  That would fit in the scenario #4 I’ve describe in my recent paper concerning the evidence of the bloodstains…\n\n","date":"August 10, 2012 at 8:31 am","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","id":"comment-14702","author":"Yannick Clément","site":"shroudstory"},{"title":"Imagine the image as part of the resurrection and not the result of the resurrection","post":"I have to add a comment about that kind of scenario :  Even if I wanted to be honest in my paper and left the door open for to biggest number of “possible” scenarios in the context of a Shroud reported by tradition to be the one of Jesus Christ, I have to admit that, from my perspective, this one is most unlikely scenario of all the options I’ve included in my paper.  Why ?  For the simple and great reason that the body image is IMCOMPLETE !!!!  The UV fluorescence photos of STURP have been able to prove that there is missing parts in the image, especially in the region of the feet and also behind the knees in the dorsal image.\nThis simple FACT should be enough to dismiss or at the very least, to seriously doubt that this kind of scenario can be correct regarding the Shroud.  Seriously, do you see God makind miraculously an image on a linen cloth that wouldn’t be perfect and complete ??? :-)\nEven if the Shroud is reported to be the authentic burial shroud of Christ, I think we have to stay very prudent here not to fall in the dangerous trap that I call “The God of the gaps”.  I’ll say it again :  It’s not because the image is reported to be the one of Jesus Christ and that science still can’t explain it properly in 2012, that we have to think of an act of God !!!  For my part, knowing all the important and confirmed facts there is to know about this relic, you will never see me fallen into that trap regarding the Shroud…\n\n","date":"August 10, 2012 at 10:41 am","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","id":"comment-14720","author":"Yannick Clément","site":"shroudstory"},{"title":"Imagine the image as part of the resurrection and not the result of the resurrection","post":"I think it might be humble to say, “We don’t know” or “We cannot explain it with our current state of knowledge”. It is also humble as well and a leap of Faith to say, “I believe in Jesus’ Resurrection and I believe the image left on the shroud is a sign of it”.\nWhen we are born the only thing we have is Faith – Faith that our parents will love us and care for us to give us life because we are utterly incapable of doing so for ourselves as infants. It is this same Faith that Jesus has taught us is necessary to come to the Father because in every age there are things that we just cannot know. \nPerhaps we as humans may never “know” how the image was made on the shroud until the veil is lifted but perhaps, and more importantly, it is a great sign of Love from the Father to strengthen your Faith.\n\n","date":"August 10, 2012 at 8:59 am","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","id":"comment-14710","author":"Chris","site":"shroudstory"},{"title":"Imagine the image as part of the resurrection and not the result of the resurrection","post":"Hebrews 11:6 “And without faith it is impossible to please God, because anyone who comes to him must believe that he exists and that he rewards those who earnestly seek him.”\nIt is certainly OK, (to say the least) for Christians to believe in a “supra-Quantum” event in connection with the Shroud: something miraculous, as part of the resurrection AND as a result of it, AND as evidence of it… It is most certainly OK to add “faith” to the mix… IN FACT, Jesus would be disappointed in anything LESS!! He was always scolding his disciples for their lack of faith. He couldn’t understand it, and at times their lack of faith deeply grieved Him. \nThere are those who wish to cast Doubts on anyone who believes anything: they refuse to have faith in anything. They claim to have faith in “science” but that claim shows what hypocrites they are because science doesn’t represent anything in particular and science changes it’s mind constantly as new facts emerge. Science is as wishy-washy as it gets. Today coffee is good for you, tomorrow it will kill you. Butter is bad for you, butter is good for you. Same with chocolate etc etc. And unfortunately, “science” is motivated too much by money, because money pays its bills. Those who claim science as their god are copping out on reality, IMO, because there’s plenty of “evidence” that supra-natural is all around us. \nWe must not get down to the level of the Doubters and be ashamed of Faith or ashamed of miracles. \nOf course, it is reasonable to answer reasonable questions from reasonable people who want real answers. But the people WITH the answers should not be ashamed to embrace FAITH as part of the answer. \nAnd THAT may well be part of the MESSAGE of the Shroud: that faith is an ESSENTIAL part of solving its mysteries.\n\n","date":"August 10, 2012 at 10:41 am","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","id":"comment-14721","author":"Anniecee","site":"shroudstory"},{"title":"Imagine the image as part of the resurrection and not the result of the resurrection","post":"Besides, our thinking about “supernatural” is all messed up. If God is real, then supernatural is completely natural. Real is real. So the question regarding what’s “real” and what’s not real, boils down to whether GOD is real or not. It’s as simple as that.\n\n","date":"August 10, 2012 at 10:54 am","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","id":"comment-14724","author":"Anniecee","site":"shroudstory"},{"title":"Imagine the image as part of the resurrection and not the result of the resurrection","post":"Yannick… “Seriously, do you see God makind miraculously an image on a linen cloth that wouldn’t be perfect and complete ??? :-)”\nYes, absolutely. The Bible is full of incomplete-ness. The Birth of Christ fulfilled all the prophecies but also revealed how fragmented the prophecies were. \nThe Bible says that now we see through a glass darkly, but THEN we shall see Face-to-Face. It is the very incomplete-ness that makes FAITH necessary. We must jump over all those gaps and embrace Jesus ANYWAY. Jesus’ own life was incomplete, cut off in his prime, cut short of everything that the Messiah was predicted to be. We still wait for fulfillment of many incompleted prophecies regarding the Messiah, the coming King. His death doesn’t make any sense except to those who believe: to everyone else it was a tragic brutal waste. And that’s because the Story of Jesus Christ is not finished yet, it is not completed, even though the Bible TELLS us how the Christ Story will end, it has not happened yet. If the Story of Jesus ended at the cross and the grave, there would be absolutely no reason to be a Christian. But we know there’s MORE, that’s why we follow Him.  Incompleteness is everywhere in Christianity. \nWould God give us only a partial image? Oh, you bet He would. That’s exactly how God does things.  Because FAITH is essential in order to please God, and so it’s Faith that he’s digging around for, above all else.\n\n","date":"August 10, 2012 at 11:16 am","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","id":"comment-14726","author":"Anniecee","site":"shroudstory"},{"title":"Imagine the image as part of the resurrection and not the result of the resurrection","post":"You’re free to believe that it’s possible Annie.  Personally, I don’t buy this idea for 2 seconds, sorry.  The more scientific knowledge progress versus the Shroud and the more it really seem that the only “mystery” that soon will be left to explain is the mechanism that has produced the image.  An image that, at the level of his nature, science understand better and better and that really seem to be completely and naturally related to the ancient method of making linen cloths and the biologic products released by a fresh corpse that was tortured severily just prior to a death by crucifixion.  At this point in the history of the Shroud, I think the key element is the confirmation of the chromophore of the image.  Once this will be done without any serious doubt, I have a great confidence that science will finally be able to explain this image “naturally”.\nOf course, if I’m right, that would not mean at all that Jesus didn’t resurrect or that this cloth his not his authentic burial Shroud, but that would only mean that God is so much love that he didn’t want to leave us some kind of “proof” of this great event.  The Shroud, for me, is more like the empty tomb (a sign that point toward the Resurrection event) than some kind of physical evidence of this event.\nAn a sign (like Jesus miracles) is not that important.  It’s the meaning behind it that is !!!  That’s what I truly believe concerning the Shroud.  Of course, you’re free to believe otherwise.\n\n","date":"August 10, 2012 at 9:41 pm","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","id":"comment-14743","author":"Yannick Clément","site":"shroudstory"},{"title":"Imagine the image as part of the resurrection and not the result of the resurrection","post":"Hello Yannick,  Actually, I don’t care much if the Shroud is real or not. It doesn’t matter to me, even though I am intrigued by it. I was only commenting on the thought that God would have left a perfect image, if it was God that did it… and no, I don’t think that’s necessary. It’s not God’s way to leave a full and complete trail to any physical evidence. It would be NICE if He would provide solid proof now and then (it would make it easier for witnessing) but God prefers to drive us to Faith instead. \nI am inclined to believe that the Shroud probably is real, primarily because of the interest it raises, the questions it leaves unanswered and how it tantalizes the atheists: perhaps even mocks them. And, someone pointed out that the Shroud may be the “Sign of Jonah” predicted by Jesus.  These things speak to me of authenticity as much as the physical characteristics of the Shroud. \nI thought you believed the Shroud was real: have you changed your mind on that? Perhaps I was mistaken.\n\n","date":"August 10, 2012 at 10:15 pm","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","id":"comment-14744","author":"Anniecee","site":"shroudstory"},{"title":"Imagine the image as part of the resurrection and not the result of the resurrection","post":"No, I have not changed my mind.  For me, the Shroud is the authentic Shroud of Jesus and the image on it was probably produced by mother nature (with maybe some help of his Resurrection that could have stopped the chemical reaction that was going on AT THE RIGHT MOMENT).  That’s what I think right now, after all my years of investigation on the subject.  That’s the scenario I believe is the most probable in face of all the facts and observation we know (accompanied by my faith in the Resurrection of Christ).\nHave you read my recent paper on this subject ?  If you don’t, go read it here : http://shroudnm.com/docs/2012-07-26-Yannick-Clément-The-evidence-of-the-bloodstains.pdf\nTake good note of the scenario #3.  That’s the one I favored for the moment (especially the sub-scenario #3 that involve the Resurrection of Christ that can explain the undisturbed aspect of the bloodstains on the cloth).\nThat’s just my feeling.  The other 3 scenarios I described are also part of the “possible” options that are left on the table once you understand that the Shroud IS NOT an artwork of any kind, but on the contrary, that it is a real burial cloth of a real tortured and crucified man who suffer exactly like the Gospels told us concerning Jesus.\n\n","date":"August 10, 2012 at 10:31 pm","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","id":"comment-14746","author":"Yannick Clément","site":"shroudstory"},{"title":"Imagine the image as part of the resurrection and not the result of the resurrection","post":"By the way, I agree with you :  When you really have a solid faith, the Shroud is not important on this level.  But personally, I don’t have any shame to admit that the Shroud is like a little “insurance” for my little faith…\n\n","date":"August 10, 2012 at 10:33 pm","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","id":"comment-14747","author":"Yannick Clément","site":"shroudstory"},{"title":"Imagine the image as part of the resurrection and not the result of the resurrection","post":"God does not compel belief; He invites belief.  He leaves us with free will.  If there were no room for doubt, then the offence of unbelievers would be so much more serious than it is. But God is merciful.\n\n","date":"August 10, 2012 at 4:46 pm","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","id":"comment-14735","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Imagine the image as part of the resurrection and not the result of the resurrection","post":"Oh wow, thank you for that. I have often thought something similar: that deception is God’s mercy so that their judgment will be less. I am frustrated with deception when I encounter it, but I also realize that sometimes God leaves people entangled in their deceptions out of His mercy, because of their hardness of heart. Why force them to see Truth that they would ultimately reject and thus be responsible for more sins against God? The only thing we can do is speak the Truth anyway, but it was helpful for me to understand this. \nYou put it in a nutshell, and with a little variation. May I borrow it?\n\n","date":"August 10, 2012 at 8:54 pm","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","id":"comment-14741","author":"Anniecee","site":"shroudstory"},{"title":"Imagine the image as part of the resurrection and not the result of the resurrection","post":"Dave, you say : “God does not compel belief; He invites belief. He leaves us with free will.”\nThat’s exactly right my friend, but you have to push your reflection a bit further !  What you just said is the main reason why, theologically, it is ludicrous to think the image on the Shroud was produced by some by-product of the Resurrection.  Effectively, if that would be the case, that would mean God would have left a physical trace of this event and if it would be true, that would mean he would have deny the free will he gave us so graciously !!!  Meditate on that for a while.  If God is Love (as I believe), that mean he have a complete respect of the liberty he gave us.  One goes with the other.  Or he’s not love and Jesus-Christ Passion and death is just a joke !  Since I don’t think it’s the case, I just can’t see God leaving some kind of an “physical evidence” of the Resurrection of Christ that science could one day discover.  Think about it my friend :  if that would be the case, what would happen of our free will ???  In face of a physical evidence of the most important event in the history of mankind, what would be left of our liberty that a loving God gave us and respect from the very first day ???  Good questions don’t you think ?  I hope you wont react on the defensive and that you’ll take time to meditate on that “philosophical” argument I just gave you…  How can you keep side by side the idea of a loving God and the idea of a material trace of the Resurrection of his Son ?\n\n","date":"August 10, 2012 at 9:33 pm","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","id":"comment-14742","author":"Yannick Clément","site":"shroudstory"},{"title":"Imagine the image as part of the resurrection and not the result of the resurrection","post":"Rediculous argument, which you have stated before and counter-acted easily; How do you explain the Stones of the Ten Commandments? They were created by God and given to the people. The Shroud can be seen as no different; Created by God as a ‘sign’ of his resurrection, his truth! Not made perfect but in such a way as a leap of faith is required to believe…So yes Yannick, I believe he would make an imperfect or slightly unfinished image, surely and simply, for our sake…Furthermore, don’t make the mistake of putting to much faith in theology, you may want to read what scriptures says about that.\nR\n\n","date":"August 18, 2012 at 1:39 pm","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","id":"comment-15183","author":"Ron","site":"shroudstory"},{"title":"Imagine the image as part of the resurrection and not the result of the resurrection","post":"Ron, your God is NOT MINE…  You’re free to believe in a SUPERMAN kind of God.  I prefer to believe in a God that is only Love, like it was revealed by Jesus on the cross (which is the only purpose of the cross by the way : to revealed once and for all who God really is)..  \nBy the way, look at the image of the man of the Shroud :  Do you see some similarities there with Superman ? Absolutely not !  God is so Love that he accept to be rejected, tortured and put to death without offering any resistence, and that’s how he won.\nAnd I know in my heart that a God who is only Love (and not some Zeus with a baseball bat sitting on a cloud to watch us) wouldn’t create miraculously an imperfect image of Jesus just to plays game with our heads…  That’s not the way a God who is Love would act with his childrens.\n\n","date":"August 18, 2012 at 7:30 pm","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","id":"comment-15194","author":"Yannick Clément","site":"shroudstory"},{"title":"Imagine the image as part of the resurrection and not the result of the resurrection","post":"THANK-YOU, Anniecee and Daveb for your insightful thoughts.\nR\n\n","date":"August 10, 2012 at 5:06 pm","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","id":"comment-14736","author":"Ron","site":"shroudstory"},{"title":"Imagine the image as part of the resurrection and not the result of the resurrection","post":"I’m not at all clear why anyone who can make a generally appreciated insightful comment in the space of fewer than three lines would need a twenty-five line patronising sermon in the subject of his meditations by one anxious to render God in the model of his own imagination and image.  Try to be a little more concise, there’s a good chap!\n\n","date":"August 10, 2012 at 11:13 pm","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","id":"comment-14748","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Imagine the image as part of the resurrection and not the result of the resurrection","post":"Curious daveb, whom is your comment addressed too?\nR\n\n","date":"August 15, 2012 at 1:19 am","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","id":"comment-14971","author":"Ron","site":"shroudstory"}]
