[{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Professor Raman touches on an extremely important phenomenon, but no magazine article even in a publication dedicated to Science & Religion, will ever be able to do justice in exploring the concept and significance of consciousness.  There are all together too many aspect to it.  \nConsciousness creates a serious problem in materialistic philosophy.  For example it cannot do justice to the concept of intentionality, and the distinction between the mental and non-mental.  Thus the materialist will have problems in developing a mechanistic theory of mind. \nHowever we can also recognise various levels of consciousness perhaps in connection with neurological disease, from full alertness, through a continuum to stupor, sleep and coma.  These various levels will generally have a material origin. \nConsciousness is required, not merely in the observation of the merely physical world, which seems to be the nub of Professor Raman’s article, but also in the recognition of the abstract, such as symbolism, appreciation of art, exercise of imagination in reading a work of fiction, and indeed even in understanding the meaning of understanding.  \nConsciousness has an important role in the observation of the physical world, but here we run into the problems of quantum mechanics, in that the state of a subatomic particle cannot be known until it is observed.  This was a question hotly debated by Einstein, Schrodinger, Heisenberg and others in the first half of the 20th century.  John Cribben’s work “In Search of Schrodinger’s Cat” articulates the problem for the ordinary lay reader.  The mystery of parity at a distance is a very peculiar problem indeed. \nIt appears to be a reasonable assumption, that the physical work should in fact exist, without the necessity of it being observed, that is – requiring consciousness.  However it is extremely difficult, and possibly hazardous to one’s health, if an attempt is made to make the argument on grounds which are rigorously logical.  It may well be in a similar category as Godel’s Theorem of Undecideability. \nAs noted in the header, it is “Off Topic”, although it may have some metaphysical significance in our general discussions.  I’ve said enough about it already!\n\n","date":"August 9, 2012 at 6:20 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14646","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"I do not believe that this is “off topic” because the issue goes to the heart of existence both before and after the big bang. Christ is the intermediary between the consciousness from which existence spring (GOD) and the multiple consciousnesses which spring from that existence.The Shroud is not just an artifact it is a revelation by science for our time.\n\n","date":"August 9, 2012 at 6:43 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14647","author":"John Klotz","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"On the material level, what is fundamental to the Shroud Image is… scientific and archaeological truth no matter whether it is or not an Act of the Providence of G.od. On the spiritual level, this is the reverse.\n\n","date":"August 9, 2012 at 7:06 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14648","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Mistyping: “whether or not it is an Act of the Providence of G.od”\n\n","date":"August 9, 2012 at 7:38 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14651","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Correction: At marterial level;;;; At spiritual level…\n\n","date":"August 9, 2012 at 7:13 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14649","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"\nCarlos Otal :\n withdrawal or the theft of the corpse within 36-48 hours\n\nDo you see any other option ?\n\n","date":"August 9, 2012 at 10:16 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14659","author":"anoxie","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"In regard of the undisturbed aspect of the bloodstains, I think the withdrawal of the body from the Shroud is a crucial question.  I really think some experts should make experiments to evaluate this very particular aspect of the bloodstains.  I think there’s only Vignon who really made experiments concerning the effects of the withdrawal of a body from a linen shroud.  In all his experiments, Vignon NEVER was able to obtain the kind of undisturbed blood clots we see on the Shroud…  For him, Barbet, Legrand (and I know also Upensky thinks like that) this FACT is a SIGN of the Resurrection.  It’s true that it’s a great sign for someone who look at this with the eyes of faith, but iIt cannot be taken as a proof.  There’s a big difference between the two expressions. \nIn the end, because it is the reported Shroud of Jesus Christ and because the Gospels told us that he resurrect, I think there really are two different options to explain the withdrawal of the corpse from the Shrous and I talk about both options in my scenario #3 (because both options can “fit” with this particular scenario :  1- A natural manual withdrawal of the corpse (with the help of some persons) and 2- A supernatural withdrawal of the corpse (caused by the “dematerialization” or the “vanishing” if you prefer of the corpse from the Shroud).\nAnyway, in both cases, someone has to explain the undisturbed aspect of the vast majority of the bloodstains on the Shroud and it’s not easy !!!  Who knows if, in the future, a scientist will be able to clearly and naturally explained this particularity ?  It’s possible.  That’s why this undisturbed aspect of the bloodstains is a sign for our faith and not a proof…\n\n","date":"August 9, 2012 at 4:48 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14678","author":"Yannick Clément","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Probably, I had come across this point earlier, but until corneliotel’s recent comment, I have not become fully aware of how his point of \nwithdrawal or the theft of the corpse within 36-48 hours\n challenges Roger’s theory. corneliotel makes a very important point IF Maillard reaction is to endure a maximum of 36-48 hours.\nThe question is: is this the expected natural time for such a reaction or do we have to move to the explanation of a corpse being \nwithdrawn or stolen\n? I mean, did ever Rogers addressed this issue of did he simply ignore the fact that the Maillard reaction could not be working beyond this maximum of 36-48 hours?\n\n","date":"August 9, 2012 at 11:05 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14661","author":"Gabriel","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Following the post by Dan quoting corneliotel\n-Yannick says to support the supernatural interruption of the reaction of Maillard (reaction proposed by Rogers).\nwe can put it in a different way:\nDid ever Rogers propose a mechanism for interruption of the Maillard reaction?\n\n","date":"August 9, 2012 at 11:26 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14662","author":"Gabriel","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Once reactive amines hit the cloth, it’s just the first step of a long and complex series of reactions called Maillard reaction.\nA withdrawal of the corpse doesn’t stop the process.\nWhat Rogers published is about the nature of coloration of the shroud Maillard reaction, concerning the origin of amines he had a personnal idea but had not enough time to explore it further. I think it is unfair, and not scientific, to throw away his work on the Maillard reaction on the basis of his idea on the origin of amines, or the temperature of the body.\n\n","date":"August 9, 2012 at 11:30 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14663","author":"anoxie","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"As I recall with difficulty, Rogers once mentioned that the likely termination of an image imparting part of a complex solution that included a Maillard reaction, as he was envisioning it, would come from an exhaustion of the reactive starches and saccharides in the extremely superficial impurity layer on the linen fibers and not from the removal of the body (miraculous or otherwise) or an end of amine vapors caused by continued cooling of the body and/or changes from gaseous to liquid decomposition products that are part of the normal cycle of things. And, indeed, he thought a phase of the complex system (Maillard reaction) might continue for many days or even weeks until a latent image matured or developed to become visible. . \nI remember discussing this with Fr. Kim Dreisbach who was a very good friend of Rogers. Kim speculated that on that first Easter morning, one of Jesus followers, threw the rolled up shroud into a saddlebag or rump sack and fled from Jerusalem. Only weeks later, perhaps at Pentecost, he discovered the image.\n\n","date":"August 9, 2012 at 12:41 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14665","author":"Dan","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"“I remember discussing this with Fr. Kim Dreisbach who was a very good friend of Rogers. Kim speculated that on that first Easter morning, one of Jesus followers, threw the rolled up shroud into a saddlebag or rump sack and fled from Jerusalem. Only weeks later, perhaps at Pentecost, he discovered the image.”\nDan, can you please re-read the passage from the 1st c. CE Gospel of the Hebrews: it is clearly said that Yeshua gave his sindon to the Priest’s servant/auxiliary. .. Now, in the Second Temple period,  a sindon (as inner cloth/tunic) was the Judean gardeners’ current work wear… ring any bell?\n\n","date":"August 9, 2012 at 1:11 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14666","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Well maybe the priest’s servant was a follower with a saddlebag. I’m not a big literalist, particularly for a gospel with multiple hypothesized provenances. But it is interesting, nonetheless.\n\n","date":"August 9, 2012 at 1:20 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14667","author":"Dan","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Nepotism & cronyism is definitely not a good way to reach a non-intersubjective interpretation/exegesis of the NT…\n\n","date":"August 9, 2012 at 1:23 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14668","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Max, I have no idea what you are saying.\n\n","date":"August 9, 2012 at 1:25 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14669","author":"Dan","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Actually the major source regarding the Gospel of the Hebrews and the sole source for the fragment under comment is the testimony of Jerome, a most reliable church scholar. As far as the famous passage is concerned, it is definitely NOT with any hypothesized provenance!\nPlease don’t you poison the well namely Jerome as a most reliable source.\n\n","date":"August 9, 2012 at 1:54 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14670","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Dan, Do you seriously think that Kim Dreisbach’s testimony is more reliable that saint Jerome’s when it comes to this passage?\n\n","date":"August 9, 2012 at 2:06 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14671","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Exegesis is not 20th-21st century CE romance…\n\n","date":"August 9, 2012 at 2:18 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14672","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Correction: no\n\n","date":"August 9, 2012 at 2:39 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14673","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Here, I want to reply to Daveb’s comment that he wrote here : https://shroudofturin.wordpress.com/2012/08/07/and-yannick-responds-to-giulios-comments/#comment-14599\nAnd I think this comment will calm down also our friend Carlos :\nDave, I think your comment is very interesting. \nFirst of all, may I suggest you to read again my recent paper concerning the question of the authenticity of the Shroud. You’ll see that I’ve developed 4 possible scenarios to explain the relic and that one of them (the last one) include the possibility that the image on the Shroud could come, directly or not, from the Resurrection of Christ. And if you pay attention to the footnote related to the description I’ve make of the 4th scenario, you’ll read this : “This 4th scenario might shock some because it is based on a dogma of faith (the Resurrection of Christ) and, by definition, it goes beyond the pure scientific rationality. But, since the Shroud of Turin is considered by Christian tradition as being the authentic burial cloth of Jesus-Christ, it seems justified to keep open that possibility, even if, in face of all the known and confirmed data, such a scenario is not necessarily the most probable. For a very detailed analysis of that possibility, see: Raymond N. Rogers, A Chemist’s Perspective on the Shroud of Turin, Barrie Schwortz Editor and Publisher, July 2008. \nSo, I hope now you can admit the fact that it’s not true that I have completely shut the door to the possibility of a miraculous event in the case of the Shroud, even if I don’t considered this avenue as the most probable ! Stating that the image on the Shroud could not have been, in any way, a direct product or a by-product of the Resurrection of Christ was not the point I tried to make with my editorial letter. In fact, I agree with you that, on a PERSONAL AND PRIVATE BASIS, it is truly possible for someone to BELIEVE that the image on the Shroud is related to the Resurrection of Christ. I know very well that this is not an idea that the Catholic Church officially promote, but I don’t think we should (or can) FORCE someone to deny that faith if it’s what he believe. Besides, we can teach them properly about the Shroud and his image, but that’s another story…\nAnyway, the MOST IMPORTANT POINT I wanted to express in my editorial is this : If someone (and it is pretty evident that, sadly, there are many modern sindonologists in that category) start or base his study of the Shroud of Turin on the preconceived notion that the Resurrection SHOULD have something to do with the body image on the cloth and, consequently, avoid, neglect or, even worse, refuse completely to considered properly all the possibilities that exist for a natural occurring image formation, especially in the light of the observations, conclusions and hypotheses reported by Ray Rogers and others (especially concerning the probable chromophore of the image), then this person is guilty of doing a bad science, because it is religiously biased. Period. As I often said here on the blog, religious dogmas or ideas should not have anything to do with any good scientific research. And if such a person go ever further and try to “prove” the Resurrection using the image on the Shroud, then this is called “doing science with a religious agenda in the back of your mind” and it is a complete shame in comparison to any scientific research that is performed in the state of the art, following completely and honestly the scientific method (i.e. following ALL the data and facts no matter where it leads you and what the conclusion can be, even if it goes against some preconceived notions you could have at the beginning). A “scientist” that would be found guilty of such a “crime” should not be considered “reliable” no more on this particular subject and I’m sure there’s some modern sindonologists (I don’t want to mention any name here) that are part of that group !\nIt’s interesting you mention the fact that the Catholic Church will NEVER proclaim a miracle before science has done a complete in-dept analysis of the reported phenomenon and find out that this phenomenon CANNOT be scientifically explained by the known Laws of nature.\nI really think that if we apply this notion with honesty (and without any religious feelings) to the image on the image on the Shroud, we have to conclude that it is not possible, in this particular case, to call this a “miracle” (and the Church never claim the image to be miraculous by the way) for the simple and good reason that it is really premature to state that science CANNOT explained this thing with the known Laws of nature. That’s the reality because the Shroud and his image, up until this day, has not been DIRECTLY analyzed enough by science for someone to claim that science has come full circle concerning this image and 1- is still not able to define and understand his nature (the chromophore) and 2- is still not able to describe a natural theory that can account for all the known physical and chemical characteristics of the image.\nEven if a lot of researches have been made on the relic, we have to understand that direct testing has only been made once (by STURP and some Italians in 1978 and the years following), along with some more researches done after that by other scientists claiming they have worked with authentic samples from the Shroud. In this context, I really don’t think anyone has the right to proclaim that science has made a full and complete examination of the relic so far. The best proof of that can be found in the fact that the STURP team, right after having published his final peer-reviewed article concerning the research on the Shroud, was already asking permission to the Cardinal of Turin and the Vatican for a second round of direct testing on the cloth !!!! \nBecause of the fact that science still need further testing on this relic before it can be said that the analysis is complete, no one can proclaim that the image SHOULD have been caused by a miraculous event.\nPersonally, I think science is pretty close to answer the first question concerning the image chromophore and concerning the second question (the one related to the image formation process), it’s evident that this will be the more complex “mystery” to resolve, but if we can understand perfectly the real nature of the chromophore (question #1), then I truly believe science would be in a pretty good position to find the proper answer for the second question, especially if more testing under laboratory conditions can be performed to analyze more deeply some interesting natural image formation processes like the Maillard reaction proposed by Rogers (and there are others natural suggestions also interesting that exist) in the context of a body who suffered a long torture prior to his death by crucifixion and who was enveloped (probably loosely) in a shroud that was probably manufactured with the ancient method of making linen cloths. \nIn fact, this is precisely the SECOND MOST IMPORTANT POINT I wanted to make with this editorial letter ! To me, if science can finally find what is the real nature of the image chromphore (without any serious doubt), then it will be much easier to evaluate correctly all the proposal that have been made over the years concerning the most probable process (or processes) that can explain the image formation on the cloth in the very particular context I just describe. And this should hallowed science to finally have a much clearer idea of the direction where to search in order to find the solution to this enigma. I really think that this should be sufficient to eventually permit the resolution (once and for all) of this “mystery”, thanks to the scientific method.\nIf what I just said could be confirmed in the future, then I don’t think the possibility for the body image to have come from the Resurrection of Christ (and consequently, to be called “miraculous”) will still be there. Remember what Sagan said : Absence of evidence is not the same as evidence of absence. It’s not because the image is not fully understood today that it will always be that way in the future and that we have the right to call for a supernatural event in order to explain it… This TRUTH is very important if we want to stay scientifically sound in our analysis of the Shroud of Turin and his image (or any other material objects in the Universe by the way). Remember that science, in face of something it can’t explain, will ALWAYS add that this is only true for today because, as Barbet said very well in his book : WE CAN’T PRESUME OF THE FUTURE ! So, that why you will always see conclusions like this : In the PRESENT STATE OF OUR KNOWLEDGE, science cannot explain this phenomenon. \nIT IS EXACTLY THE SAME WITH THE SHROUD and, if we want to stay scientifically credible, we should recognized that there is no good reason (not even the tradition that state it is the burial Shroud of Christ) to believe otherwise ! And let’s never forget what Francisco Alconchel-Pecino said in his recent paper about the C14 issue : “Probably the controversy arose because, once more, HUMAN INNOCENCE WAS SURPRISED BY THE SUBTELTIES OF MOTHER NATURE.” This great TRUTH should always be kept in mind when it comes to analyzed the Shroud and his image… Unfortunately, this is not always the case (to say the least) !\nAnd concerning the idea that an earthquake could be responsible for the image, front and back, of a human corpse on a linen shroud, I’m sure I’m not the only to find this possibility quite absurd. Anyway, as I said, let’s wait for science to finally find out what is the true nature of the image chromophore and then, we’ll have a much better scientific basis to analyze properly if this hypothesis of the earthquakes can have any chances to explain the image on the Shroud… Is it a deal ??? ;-)\nBut be sure of one thing (I don’t want to presume of anything here. I just emit an hypothesis), if Rogers was correct about the image chromphore (i.e. that it resides ONLY in a thin layer of carbohydrates impurities on top of the fibers), then this earthquakes hypothesis (or any other hypothesis involving an energetic radiation) would really be in jeopardy. That’s why the exact nature of the image chromophore is so important to confirm and, in my mind, that should be the MAIN QUESTION that an eventual new series of direct researches on the cloth SHOULD TRY TO ANSWER IN PRIORITY. Because you can be sure of one thing : if the question of the chromophore is not properly answered and stay covered in doubt (as it is today), it will never be possible to prove any hypothesis of image formation ! \nI hope that my call concerning the resolution of this most important issue will be heard by some competent ears !!! One thing’s for sure : It doesn’t seem to have been heard by M. Fanti ! I say that because in his most recent paper “Open issues regarding the Turin Shroud”, here’s the 3 major issues in his mind : The formation of the image (as expected, it comes in #1 place even if, as I said, it should always come in #2, after the image chromophore), the conservation and his dating. You see ? NOT EVEN A WORD about the most crucial question of it all concerning the Shroud, which is the image chromophore !!!! This is truly incredible and pretty shameful… Let’s hope that other scientists will heard my call much better than M. Fanti, who seem to think (wrongly) that this question of the chromophore was settled with his 2010 paper in which he proclaimed, without any chemical testing to back it up, that the image chromophore was most probably the primary cell wall and not a thin layer of impurity on top of the fibers !!!! As I said in my editorial, it’s not surprising at all that he claimed this, since it is truly possible to colored only the primary cell wall of a linen fiber without affecting his core with a corona discharge (as demonstrated by an experiment done by Rogers himself !!!). \nMeditate on that for a while and you’ll see that all this doesn’t smell very good, to say the least. And what is also important (and shameful) to note is the fact that this question of the chromophore seem to be (wrongly) settled in the mind of many other sindonologists. I say that because, in Valencia earlier this year, a bunch of them had no difficulty to sign a list of “facts” proposed by M. Rolfe, in which we originally found the hypothesis of the primary cell wall, while the hypothesis of Rogers was completely cast out !!! To me, this is a VERY GOOD CLUE that clearly shows the very bad state of sindonology these days… I’ll say it again : This is really shameful !!! When he see that, Rogers (and others) must turn over in his grave !!! THE FACT IS THIS : THE QUESTION OF THE IMAGE CHROMOPHORE HAS NOT BEEN PROPERLY CONFIRMED YET AND SHROUD SCIENCE SHOULD FOCUS ON THAT INSTEAD OF ON IMAGE FORMATION !!! It’s only when this question will be properly settled that we could focus our attention on the image formation process…\nFinal note : At least, there’s one good thing that can be found in this paper from Fanti : For the first time (to my knowledge), in page 3 of his paper, he recognize the fallacy of his conclusion of the probabilistic model he once made and that gave a probability of 100% (!) that the Shroud is really the authentic Shroud of Jesus Christ (note : he doesn’t say “Jesus of Nazareth” as it should for a scientist, but “Jesus Christ”, which speak very loud to me). At least, here, M. Fanti was able to recognize that his result had no value whatsoever because they were based on “subjective evaluations”. At least, this recognition is one good point for him !!!\nP.S. : I am currently writing a follow up paper to my article concerning the authenticity of the Shroud and, in it, I will do an in-deep analysis of the second part of the question of the Shroud authenticity, which is the real identity of the man of the Shroud. I hope to be able to finish it this autumn… One thing’s for sure : you will never see me stating that the probability that this is really the Shroud of Jesus (of Nazareth !!!) is 100%, simply because it wouldn’t be an acceptable conclusion, scientifically speaking. On that particular question, we’re dealing with probabilities, not certainties!\n\n","date":"August 9, 2012 at 3:20 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14674","author":"Yannick Clément","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"I shall endeavour to confine my response to Yannick’s very long posting above, to only a few points.  I feel that much of it is a repetition of remarks he has frequently made before, and I see little point in sustaining a long to-and-fro argument about these. \n1) chromophore: It seems reasonably certain from what we have read, that indeed the chromophore lies in the impurity layer of the cloth, rather than in the textile itself.  It would add to our understanding of the image if this matter could be confirmed by further investigation.  However the now restricted access to the cloth is unlikely to allow further samples to be taken in the near future.  Any further testing will need to be limited to already exisitng samples. \n2) miracle or natural process?:  I suspect that Yannick & I will continue to have differing views on this matter.  I have already stated  aspects supporting the miracle hypothesis as: (a) no dorsal deformation (bluntly – the buttocks and shoulder blades do not appear to be flattened as they would expect to be from the body weight, assuming the body was laid on its back – most likely position) – it as if the body was suspended in space; (b) the projection of front and dorsal views with no image of the sides, as might otherwise be expected from a Maillard reaction – the edges of the front and dorsal images are relatively sharp; (c) the fairly high definition of the image (modified by previous comments by Anoxie & Gabriel). \nClearly the Vatican authorities are unlikely to proclaim the image as miraculous until all scientific avenues have been explored, which again is unlikely to be any time soon.  Meantime personal viewpoints as to whether the image is miraculous or natural will depend on how the various results to date are personally perceived and interpreted. \n3) Seismic activity as cause of image:  I dare say that Yannick in his seismic quiescent province of Quebec, probably has little understanding of certain aspects of seismic activity.  Despite my entreaties for him to do so, I rather suspect he has neither read nor understood Giovanna de Liso’s paper on her 12 years of experiments in Piedmont.  Section 2(b) of her paper describes in detail her use and treatment of the textile samples she used.  She seems to have made some effort to simulate the conditions of the Shroud cloth.  Unfortunately the PDF of her paper is secured so that copying and pasting of the relevant extract isn’t possible without retyping.  Meantime the seismically inert Quebecois may brand this cause as absurd if they so wish, but that doesn’t make it so! \n4) Identity of the Shroud man: I have already written an article on the identity of the Shroud man, and Dan posted a reference to this some weeks ago.  The article can be found in a copy of the Tawa Catholic News which I edit and produce quarterly:  “The Holy Shroud of Turin  2) Identity – Whose image?” By David Belz, Tawa Catholic News, Winter 2012, pp 29-34.  The issue can be found at: http://tawacatholic.org.nz/wp-content/uploads/2011/08/TCN-Winter-2012.pdf – check pp29-30.  Readers may want to use the ‘zoom-out’ tool at the bottom of the screen for ease of reading.  Alternatively the PDF file may be downloaded if so desired.  There are also other articles there which may entertain or inform.  Also the Autumn issue included an article summarising some of the scientific research that has been carried out, so that casual readers may become acquainted with some of this work.\n\n","date":"August 9, 2012 at 7:04 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14679","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"minor error: – Identity of Shroud Man in Tawa Catholic News (Winter) – article is on pp 29-34.\n\n","date":"August 9, 2012 at 8:16 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14681","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Gabriel:\na.-Las 36-48 horas post-morten ( probablemente menos horas) marcan el límite en que la Sábana comenzaría a impregnarse por los líquidos de la DESCOMPOSICIÓN, lo cual no se observa en la Sábana.\nb.-Creo que Rogers pensaba en una reacción de Maillard de inicio MUY RÁPIDO, con temperatura corporal muy alta y aminas pesadas MUY PRECOCES (cadaverina y putrescina):\n“The bodies are quite dry as a result of the hyperthermia. Many bodies are found at high temperature in closed automobiles or lying on the desert in the sun. Materials that are stable at normal room temperatures (about 22°C) can react rapidly at 41-43°C. Many simple chemical processes double (or even triple) their rates for each 10°C (18°F) increase in temperature. A dehydration-type of reaction could be expected to be about three times faster at normal body temperature than at room temperature and four to nine times faster at about 41°C.”\n“Scientific method applied to the Shroud of Turin. A review”Raymond N. Rogers* and Anna Arnold \ny\n“The sample was then treated for 10 minutes with ammonia vapour: a very light colour could be observed on the top surface after standing 24 hours at room temperature. To increase the reaction rate, a sample was treated at 66 ºC for a few minutes (Figure 2 above). In these conditions the development of colour is very clear and the most intense colour appears in the ring on top. Some colour appears around the ring on the back surface; however, the centre of the back is nearly white.”\n“The Shroud of Turin: An Amino-Carbonyl Reaction (Maillard Reaction) ” Rogers, Arnoldi\nc.-Pienso que Rogers NO SABÍA como INTERRUMPIR de manera NATURAL su reacción de Maillard. ( ya he comentado tiempo atrás que no se dan las circunstancias apropiadas en el Hombre de la Sábana para una reacción de Maillard).\nCreo haber leído lo que indica Dan, pero no recuerdo en dónde. Las objeciones a esa hipótesis parecen elementales:\nNO HAY AGOTAMIENTO de sacáridos reactivos. Sólo 1 a 3 fibrillas por hilo están afectadas por el color ¡POR CADA HILO AFECTADO POR EL COLOR!, por lo que quedarían INFINIDAD de fibrillas CON RECUBRIMIENTO de polisacáridos reactivos que NO HAN SIDO AFECTADAS .\nNO HAY DISMINUCIÓN de aminas reactivas, por el contrario su concentración va aumentando.\nCarlos Otal\n\n","date":"August 9, 2012 at 7:26 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14680","author":"corneliotel","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"corneliotel: I do think that you have really made a very interesting point!\n\n","date":"August 10, 2012 at 6:09 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14688","author":"Gabriel","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"\ncorneliotel :\nCreo que Rogers pensaba en una reacción de Maillard de inicio MUY RÁPIDO, con temperatura corporal muy alta y aminas pesadas MUY PRECOCES (cadaverina y putrescina)\n\nRead carefully Rogers article :\n\nRogers\nPostmortem body temperatures can reach 41ºC (Irvine, 2001), and steep temperature gradients would exist across the cloth as a result of the low thermal diffusivity of linen and the angular dependence of radiant heat flow from a nonmetallic surface (Gubareff et al, 1960). The temperature gradients will have a large effect on Maillard reaction rates. These combination of factors could produce a distribution of reaction products with the appearance of the image.\n\nRogers assumed there must have been steep temperature gradients on the shroud to explain image resolution since he thought the origin of the reactive amines should be in the lungs.\nHe admitted himself “The chemistry of the colour does not answer all questions about how the “photographic” image formed.\nI think the body had cooled down when reactive amines hit the cloth.\n\ncorneliotel :\nNO HAY AGOTAMIENTO de sacáridos reactivos. Sólo 1 a 3 fibrillas por hilo están afectadas por el color ¡POR CADA HILO AFECTADO POR EL COLOR!, por lo que quedarían INFINIDAD de fibrillas CON RECUBRIMIENTO de polisacáridos reactivos que NO HAN SIDO AFECTADAS\n\nIt is debatable. If you look at the areal density of color on the face you can see there may be a saturation on cheeks, nose, eyebrows, hair, beard. On these areas the limiting factor may be reducing saccharides.\nAs suggested Rogers, different amounts of these impurities could come from different surface tension of the washing solution and the surface energy of the specific linen fibers.\n\n","date":"August 10, 2012 at 4:56 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14685","author":"anoxie","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"To back up a supernatural hypothesis to explain the Sindon Image formation process (Daveb WNZ wrote: \n“no dorsal deformation (bluntly – the buttocks and shoulder blades do not appear to be flattened as they would expect to be from the body weight, assuming the body was laid on its back – most likely position) – it as if the body was suspended in space”.\nThis is to GRATUITOUSLY induce the burial cloth was just loosely draped over and not wrapped around Yeshua’s body and therefore his burial to have been  incomplete. This in blatant contradiction with John 19:40 “They took the body of Jesus and wounded/wrapped it in linen cloths along with spices, according to the burial custom of the Judeans.”\nIs Daveb WNZ used to just drape over burial sheets over a corpse in a very awkward position due to rigor mortis and not even try to counteract the latter through tightly wrapping up the corpse? This would be in blatant contradiction with the halakha (Judean corpus of religious. laws)\n.\nThere are also signs the body once wrapped up was turned and laid on its right side during the image formation process (my archaeological blood pattern analysis of the blood droplets and butterfly wings and shooting star-like shaped hematic constellations on the non-body image area). The most likely position of the body during the Sindon Image formation process is laying on its side.\nNow I am asking Daveb WNZ this very simple question: since most of the Second Temple period Judean burials even in time of peace were done in a relative haste on the very day of death, shall we automatically infer that most of them were incomplete as such? In other terms, does the phrase “buried according to the burial of the Judeans” means an incomplete burial or a complete one? \nTo infer from John, Yeshua’s burial was incomplete is just another received idea by arch-miraculists a little bit too prompt to consciously or unconsciously falsify the evangelical data and totally ignore the halaka (Judean corpus of religious laws).\n\n","date":"August 10, 2012 at 5:31 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14686","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Max, Dave’s statement DOES NOT in any way imply a loosely bound Shroud. Read it again, he is trying to say the dorsal image shows no signs of resting on a rock base as there is no signs of skin flattening. Which even if the body was in rigor would still occur from the body weight…so get it straight ;-)\nR\n\n","date":"August 10, 2012 at 6:36 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14689","author":"Ron","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Mistyping: does the phrase “buried according to the burial CUSTOM of the Judeans” means an incomplete burial or a complete one?\n\n","date":"August 10, 2012 at 7:17 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14693","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Max: I know we have debated this before.  To me, I feel you are insisting too strongly on an overly strict reading of John 19:40.  On the other hand I am prepared to be open to every possibility until it is CONCLUSIVELY proved otherwise.  Elsewhere within the last day or two, I have already commented that the absence of dorsal deformation could be explained by the body being laid on its side.  I cannot agree that the burial cloth being draped loosely over the body is a gratuitous comment, as it is a real possibility; As is also the possibility that the burial halakha rites were completed.  My comment above was merely to identify a few arguments which MIGHT support a supernatural cause of the image, as against a naturalistic explanation.  \nIt seems to me that everwhere we turn to search for any kind of naturalistic explanation we seem to encounter difficult problems, of one kind or another.  I am prepared to concede that some elementary observances were probably carried out, such as binding the jaws, and the feet; The hands were not bound to the extent that a wrist wound is plainly visible. \nAgainst the burial cloth being tightly bound around the body, are the following arguments: (a) the 3D encoded properties correlate with the loosely draped model used by Jumper & Jackson for their distance calibrations; (b) If the burial cloth was wrapped tightly around the body and the image was due to a Maillard reaction, we would expect to see a very different image from the one that is manifest; (c) both frontal and dorsal images are what we might expect to see if they had been produced by projecting the frontal and dorsal light pixels on to a more or less flat screen.    \nIt may be that the halakah rituals were observed, but likely modified to ensure that all the blood was conserved.  I concede that the imminent sabbath would not seem to hinder this – I understand that observance of burial rites were in fact a permitted sabbath activity.  Absence of light may have been a practical difficulty.  However if you insist that the body was completely wrapped, then my response would have to be that in that case the image cannot comply with a naturalistic explanation and that it must have been miraculous.  Those who would prefer a naturalistic explanation would conclude that the body was not tightly wrapped in the burial cloth, as otherwise a different image would have resulted. \nTherefore I fail to see how you can assert that the body not being completely wrapped is a received idea from arch-miraculists, when in fact a loosely draped body provides a better naturalistic explanation for the manifest image.  Any kind of wrapping at all would never deter an arch-miraculist! \nOne problem with a loosely draped body, is that very likely it compromises any kind of gaseous diffusion model, as it would allow the gases to escape,  A naturalistic explanation would then need to look elsewhere, such as the seismic activity explanation I have suggested as a possibility.  This is what I meant when I said that everywhere we turn, we seem to encounter difficulties in searching for a naturalistic explanation.\n\n","date":"August 10, 2012 at 6:58 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14690","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Dave, was I incorrect in my last statement in defence of your previous statement? Because I didn’t read any implication to body wrapping. Just the lack of evidence to body weight on the image….\nI think it’s also pretty safe to say the body was lying supine and not on it’s side when the image was formed. It may have been held to one side during preparations, hense the flow of blood. This has been asserted by forensic studies by the way., but definately not lying on his side during the image formation. That would suggest a horizontally produced image, which seems very unlikely.\nR\n\n","date":"August 10, 2012 at 7:35 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14695","author":"Ron","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Ron, a Medical examiner is definitely  NOT an ARCHAEOLOGICAL BLOOD PATTERN ANALYSTS. BTW are you an archaeological blood pattern analysist to make such an assertion?\n\n","date":"August 10, 2012 at 8:13 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14697","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"BTW I myself never read anything about a medical examiner having proved beyond any rational doubt that the sindon image was formed while the body was lying in suspine position. Either you are poisoning the well with a blatant LIE or you shall give me the link to such a research paper\n\n","date":"August 10, 2012 at 8:21 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14698","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Daveb WNZ, \nYou wrote: “the 3D encoded properties correlate with the loosely draped model used by Jumper & Jackson for their distance calibrations.” Actually you just forget Jackson’s idea of the wrapping of the Sindon did evolve though time and his very first model was biased (see Wilson’s first book on the Turin Shroud; its model totally ignores e.g. the bent forward position of the head!). \nYou also wrote: “If the burial cloth was wrapped tightly around the body and the image was due to a Maillard reaction, we would expect to see a very different image from the one that is manifest; ” How long will you overlook possible bridge and screen effects due to solid objects, medical flower heads and plants laterally pressed against the body?\nYou also wrote: “both frontal and dorsal images are what we might expect to see if they had been produced by projecting the frontal and dorsal light pixels on to a more or less flat screen.” Actually such images are TOTALLY CONSISTENT with gradual pressure release as the in-soaked long linen inner cloth got sort of taut again through bloody body ritual fumigation while the corpse was resting in extrza height (on two stones) and laying on its right side.\nYou also wrote: “Absence of light may have been a practical difficulty. [to perform the complete burial]. Most likely, the sun was not yet set when they took the corpse to the tomb. Beside, have you ever heard of oil lamps and torches? Have you ever heard the Judean custom was to leave a lit oil lamp by the deceased in the tomb?\nYou are free to totally ignore the gospel Greek  terminology, the halaka, Talmudic literature, the Hebrew time markers to evaluate Yeshua’s burial most likely time-frame, Avinoam Danin’s botanical research papers on the Shroud/Sindon, Second Temple funerary customs and  rites etc to explain your supernaturalistic viewpoint. \nThe fact is your supernaturalistic approach to the Sindon Image formation process is mostly based on speculative ignorance.\n.\n\n","date":"August 10, 2012 at 8:07 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14696","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"\nMax Patrick Hamon :Ron, a Medical examiner is definitely NOT an ARCHAEOLOGICAL BLOOD PATTERN ANALYSTS. BTW are you an archaeological blood pattern analysist to make such an assertion?\nNo, never said I was, plus I never heard of one either ;-). I’m guessing you are going to tell me now that you are? Furthermore, forensic pathologists (experts) would definately have knowledge of this. Especially ones which have studied hundreds of cases and thousands of bodies….next…\nR\n\n","date":"August 10, 2012 at 8:27 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14699","author":"Ron","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"I studied for three years archaeological blood pattern analytical techniques.\n\n","date":"August 10, 2012 at 8:30 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14701","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Ron, I can see you really have NO IDEA at all of what blood pattern analysis is all about.\n\n","date":"August 10, 2012 at 8:32 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14703","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"I even devised an eidomatic-numismatic reading grid based on blood pattern analytical techniques to study the possible presence of partial ancient coin blood decals on the Sindon face.\n\n","date":"August 10, 2012 at 8:35 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14704","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Mistyping: “analytical techniques to study the possible presence of  ancient coin PARTIAL blood decals on the Sindon face.\n\n","date":"August 10, 2012 at 8:37 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14705","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Mistyping: Have you ever heard of the Judean custom to leave a lit oil lamp by the deceased in the tomb?\n\n","date":"August 10, 2012 at 8:28 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14700","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Yes.\n\n","date":"August 10, 2012 at 8:49 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14708","author":"Ron","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"\nMax Patrick Hamon :BTW I myself never read anything about a medical examiner having proved beyond any rational doubt that the sindon image was formed while the body was lying in suspine position. Either you are poisoning the well with a blatant LIE or you shall give me the link to such a research paper\nI’m poisoning the well and lying? C’mon Max let’s get back to reality here. I have read extensively on the Shroud and listened to many interviews with Shroud experts and the concensus by almost all involved is that the body was SUPINE when the image formation occurred. It’s pretty commonly stated Max!…Think, why on earth would they place/leave his body on it’s side? Many 1st century Judanian burials have been discovered, and from what I read they were all found in the supine position, no mention of a side burial. If you want to stay in lala land and tell us the body was on it’s side, then please explain the image we see and how possibly it was formulated whilst the body was on it’s side.\nR\n\n","date":"August 10, 2012 at 8:48 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14706","author":"Ron","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Ron you wrote: “Think, why on earth would they place/leave his body on it’s side?” \nYou’d better think INSTEAD what is the reason why the buriers FIRST might well have placed it (once the purifying ritual was performed and the image formed, I have no problem with the corpse THEN being laid in supine position, are you kidding?).\nMost obviously my English must be too cryptic for you to understand… unless it’s just bad will on your side…\n\n","date":"August 10, 2012 at 9:05 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14711","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Mistyping: You’d better think INSTEAD what is the reason why the buriers FIRST might well have placed it SO\n\n","date":"August 10, 2012 at 12:07 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14727","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Ron, I am STILL waiting for the link I asked you.\n\n","date":"August 10, 2012 at 9:18 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14713","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Just one, PLEASE, forensically proving beyond any rational doubt the man was laid in supine position when the Sindon Image formed!\n\n","date":"August 10, 2012 at 9:32 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14714","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"I see Ron and Dave are making totally or almost totally gratuitous assertions as they still don’t know their stuff. How long will they be unable to really discriminate between die hard recieved ideas, true facts, what is most likely to be true, half-truths and mere speculative ignorance?\n\n","date":"August 10, 2012 at 8:49 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14707","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"\nMax Patrick Hamon :I see Ron and Dave are making totally or almost totally gratuitous assertions as they still don’t know their stuff. How long will they be unable to really discriminate between die hard recieved ideas, true facts, what is most likely to be true, half-truths and mere speculative ignorance?\nProbably less time then you Max….Curious what drugs are you on?\nR\n\n","date":"August 10, 2012 at 8:53 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14709","author":"Ron","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"No comment!\n\n","date":"August 10, 2012 at 9:09 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14712","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"The more I read posts on this blog and literature of all persuasion, the most I am aware  the real consciousness is to be able to discriminate between die hard ideas, biased observations, true facts, what is most likely to be true, half-truths and mere speculative ignorance.\n\n","date":"August 10, 2012 at 9:41 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14716","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Mistyping: the more I am aware\n\n","date":"August 10, 2012 at 9:42 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14717","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"+ mistyping: die hard received ideas\n\n","date":"August 10, 2012 at 9:44 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14718","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Here’s a message in which I want to react to the critics made by Carlos against me in the headline message.  Sorry again for the length of this message.\nFirst, I will take some quotes from Carlos and answer them directly.  Here’s the first one :\nQuote from Carlos : “-To the Rogers proposal be scientific, the Maillard reaction would have been interrupted suddenly by the withdrawal or the theft of the corpse of Jesus within 36-48 hours of their stay in the Sepulchre.”\nMy answer : Effectively, that’s what Rogers was assuming with his hypothesis, with the exception of one thing : The assumption of the maximum time before the body had to leave the Shroud is in fact 72 hours instead of 36-48 hours, because many studies have showed that the liquid phase of putrefaction can start between 36 to 72 hours, DEPENDING ON MANY FACTORS.  In page 116 of his book, Rogers say : “Vass et al. also report that putrefaction (structural degradation) starts between 36 and 72 hours after death…”  And he add : “Perhaps we can assume that the cloth could not have been in contact with the body for more than about three days.”\nQuote from Carlos : “Yannick said to admit the resurrection of Jesus, the “dematerialization” of the body of Jesus within 36-48 hours of their stay in the Sepulchre.”\nMy answer :  If you look closely at the 2 main conclusion I have written in my paper (in page 9), you’ll note that I talk of a range delay of 36 to 72 hours. I wrote this in order to stay scientifically correct versus the known maximum delay before the start of the liquid phase of putrefaction.  And concerning the idea that the corpse could have been “dematerialized” (or “vanished”) at the moment of the Resurrection, I have left the possibility open in my paper, mainly because of the undisturbed aspect of the bloodstains, as noted by Barbet, Vignon, Legrand, Baima Bollone, and many others Shroud researchers over the years and also because the Resurrection of Christ cannot be discarded, from a strict historical point of view.  Effectively, the Passion and death of Jesus of Nazareth, along with his entombment on Friday night and the discovery of the empty tomb (without ever finding his body) has been recognized by the majority of the credible historians (even secular historians) as historical facts !!!  That doesn’t mean, of course, that Jesus is really resurrected (his enemies said that the body was stolen instead), but there’s a “possibility” there that I couldn’t discard for the simple reason that I wanted to let the door open as wide as I honestly could when I was elaborating all the possible scenarios that could explain the Shroud and his image. But I also want to point out the FACT that, in my article, the idea of a “dematerialization” of the body to explain the particular state of the bloodstains on the cloth is only evident in the scenario #4, because it involved a direct or indirect role played by the Resurrection in the formation of the image.  If you take another look at the description of the scenario #3, here’s what you’ll find :  “The fact that the body left the Shroud before it started to corrupt can be related with his resurrection, but that’s not certain. In other words, a scenario like that doesn’t absolutely need to call for the resurrection in order to explain the bloodstains and the body image we see on the cloth.”  So, you can easily see that, for this particular scenario involving a natural phenomenon that caused the body image, I have left the question of the “dematerialization” of the body open, without any implicit recognition.  In my mind, because this scenario involved the Shroud of Jesus of Nazareth, a “dematerialization” of his body at the time of the Resurrection is a “possibility” but not a certainty (mainly because the formation of the image would not have been caused by the Resurrection event).  Anyway, I don’t see any contradiction with these 2 ideas : a natural formation followed by a possible “dematerialization” of his body at the time of the Resurrection that would have stoped the natural image formation process that was going on.  That’s what Barbet thought, that’s what Vignon and Delage thought, that’s what other researchers also thought and that a truly possible scenario in my mind.  Here I ask the question : Why would a scenario like that (it is in fact one of the 2 sub-scenarios included in the scenario #3) would be impossible to accept, from a theological and even historical point of view ?  IF the Resurrection was really an historical event (because of the empty tomb, followed by the testimony of the disciples, I don’t think nobody can really discard completely this possibility), I don’t see why this proposed scenario should be considered as completely unscientific and why you can think I’m confused here.\nQuote from Carlos : “Yannick says to support the supernatural interruption of the reaction of Maillard (reaction proposed by Rogers).”\nMy answer : This is untrue.  First, in my paper, I never mentioned any specific natural image formation process as a possible hypothesis, but I just mentioned the fact that, it it’s right, it would have been most probably a chemical process.  Also, as I just showed, in the description of the scenario #3 involving a natural formation of the image, I leave the door open to the possibility of a supernatural interruption of the natural image formation process, but I also left the door open to the possibility that this interruption was not supernatural too.  Since I’ve wanted to stay honest in that paper, I just exposed as clearly as possible the 4 possible scenarios that can (in my opinion) explain the Shroud rationally, without explicitly supporting one of these scenarios over the others.  In one particular footnote in my paper, you can find this comment that explain well my point of view on this question (extended here) : “As we have seen previously, there are only 4 possible scenarios concerning the Shroud that have any chance to “fit” with these two conclusions. And when we use the Occam’s razor principle, the probability seems to be much higher for some of them (like the scenario #3 for example) than it is for others (like the scenarios #1 and 2). In reality, when we analyse rationally each one of these four proposed scenarios, there’s no doubt that the scenario #3 (especially the one that don’t call for the Resurrection to explain the appearance of the bloodstains) is the one that demand the fewest number of special assumptions in order to work.  And I would even say that the second sub-scenario #3 that involved a dematerialization of the body that left the bloodstains undisturbed demand a fewer number of special assumptions in order to work in comparison with the scenario #4 (simply because a corpse CAN leave naturally an imprint on a cloth – we have examples of that, like the Jospine Mattress) while there is absolutely no way to know if the Resurrection even produced any form physical or chemical released that could have reacted with the surface of the cloth). Important note : that doesn’t mean this scenario is necessarily the correct one, but nevertheless, since we’re dealing with probabilities and not certainties, we have to admit that it is effectively the most probable scenario that can explain the bloodstains and the body image on the Shroud.”\nWith this footnote, I just wanted to make people realized that we’re dealing with probabilities here and not with certainties and that even if there’s no way to considered one of the 4 proposed scenarios as having 0 % of chances to be true, on the other hand, with the help of the Occam’s razor principle, we can come pretty easily to the conclusion that the scenario #3 (particularly the sub-scenario #3 that don’t involved a supernatural interruption of the image formation process), is the one that called for the fewest numbers of “special assumption” and, because of that, it should be considered as the most probable (even if, as I stated very clearly in my note : That doesn’t mean this scenario is necessarily the correct one).  I hope you can realize now how false was Carlos statement !\nQuote from Carlos : “The hypothesis of a supernatural interruption of the reaction of Maillard is not scientific.”\nMy answer: From a strict scientific point of view, you’re right and it is also true versus the possible scenario #4 (involving a supernatural event for the image formation) you can find in my paper.  But here’s what I said in a footnote to justify my decision to leave the door open to the “possibility” of a dematerialization of the body at the moment of the Resurrection : “This 4th scenario (note : I should have said also the sub-scenario #3 involving the Resurrection, even if I think it’s evident even if it’s not mentioned here) might shock some because it is based on a dogma of faith (the Resurrection of Christ) and, by definition, it goes beyond the pure scientific rationality. But, since the Shroud of Turin is considered by Christian tradition as being the authentic burial cloth of Jesus-Christ, it seems justified to keep open that possibility, even if, in face of all the known and confirmed data, such a scenario is not necessarily the most probable.”  For a better understanding, I should have said that it was also due to the FACT that most historians now recognized the historical reality of the empty tomb and of the testimony of the first disciple that were convinced that the Resurrection really happened. Because of that, along with the fact that the Shroud is traditionally considered as the Shroud of Christ, I think it was honest from me to leave the door open to the possibility of a “dematerialization” of the body, not only for the scenario #4, but also for the sub-scenario #3 that involved this event that can explain the undisturbed aspect of bloodstains.\nQuote from Carlos : “Rogers hypothesis is scientific if the Maillard reaction is interrupted by a NATURAL environment.”\nMy answer: Because of all I’ve said before in this long comment, I don’t see any good reason why the sub-scenario #3 that involved a natural process of image formation (Maillard reaction or something else) and that involved also the “dematerialization” of the body of Christ at the moment of his Resurrection (without any physical or chemical emission) to explain the particular state of the bloodstains should be completely discarded.  I agree that it is not a purely scientific scenario, but in the context of a scenario that involved the authentic Shroud of Christ, why should we close the door completely to this possibility ???  Anyway, we have to remember that it’s just one possible scenario among a list of 4 (in fact, a list of 5 because the scenario #3 included 2 sub-scenarios).\nQuote from Carlos : “the shroud being one object PHYSICIST REAL, all scientific to study the possible effects on the shroud of “chemical” reactions (be Rogers or is Garlaschelli, etc.) or reactions “physical” (or Fanti, Di Lazzaro, Antoacci that was), it will be a good scientist or will be an evil scientist because of the methodology applied, not because of their religious beliefs.”\nMy answer:  I’m not so sure about that !  I agree that the methodology is important in every scientific research but let’s not forget also the importance of the integrity of the researcher, liked with the premise of his research !  On that question, I suggest anyone to read the long comment I post yesterday on that same page (comment #20).  The problem is not the fact that a scientist is a believer or not (it’s true that both can do good science), but it comes when a scientist, who is also a believer, start or base his research on the Shroud with the preconceived notion that the Resurrection of Christ SHOULD have something to do with the body image on the cloth and, consequently, avoid, neglect or, even worse, refuse completely to considered properly all the possibilities that exist for a natural image formation process (or processes).  And, as I also said that if such a person go ever further and try to “prove” the Resurrection using the image on the Shroud, then this is called “doing science with a religious agenda in the back of your mind” and it is a complete shame in comparison to any scientific research that is performed in the state of the art, following completely and honestly the scientific method (i.e. following ALL the data and facts no matter where it leads you and what the conclusion can be, even if it goes against some preconceived notions you could have at the beginning).  To me, these kinds of acts constitute a real problem for the integrity of Shroud science and it’s pretty obvious to me that such acting EXIST in a certain number of modern sindonologists…  And if someone think that there’s no “scientists” with a religious bias in the Shroud world, then I’m sorry but he’s the most naïve person I ever see (or the most blind, which is as bad)…  Of course, if another scientist bases his research on the preconceived notion that the Shroud SHOULD be a forgery (like our friend Garlashelli did recently), it is also a bad science.  The authentic scientific method stipulate that a scientist who wants to do good science MUST follow EVERY confirmed facts and observations in the direction where they go, NO MATTER WHAT COULD BE IS PERSONAL OPINION ON THE SUBJECT !!!  Sadly, I’m not sure at all that this path is followed by a majority of modern sindonologists these days…  As Rogers states in his books : “IT IS NOT VALID TO ELIMINATE OR SUPPRESS FACTS IN ORDER TO SUPPORT A SPECIFIC HYPOTHESIS.”  Acting like that proves that you don’t follow correctly the scientific method and, again, it’s obvious to me that many modern Shroud researchers are acting exactly like that in order to support their preconceived notion (involving some supernatural event) concerning the image on the relic. \nQuote from Carlos : “Every scientist, believer or unbeliever, knows that NO there is no physical or chemical energy that can RESURRECT the dead.”\nMy answer:  Maybe that’s true, but if we turn things around, we can also state that there’s nothing at all that can hallowed us to think the Resurrection event could have produced or released any kind of physical or chemical energy !  Nevertheless, we constantly see in Shroud science researchers who based their research on that premise which has absolutely no scientific, historical, scriptural (there’s no Gospel account that reports what happen at the moment of  the Resurrection) or even correct theological basis (for example, you’ll never found anything in the Catechism of the Catholic Church that stipulate that there was any form of physical or chemical release from the body at the moment of the Resurrection).  Even if someone presume it was the case, the reality is this : Nobody can prove an unknown (the image formation on the Shroud) with another unknown (the purely speculative assumption that the Resurrection event have really produced or released any kind of physical or chemical energy).  And we also have to remember that any supernatural hypothesis proposal based on any form of energetic radiation is religiously biased from the beginning for the simple and good reason that SOMEONE NEED FAITH (IN CHRIST OR AT LEAST, IN GOD) IN ORDER TO PROPOSED OR SUPPORT AN HYPOTHESIS LIKE THAT, WHICH IS RELATED IN SOME WAY TO A SUPERNATURAL EVENT CALLED “THE RESURRECTION OF CHRIST”.  This is an important TRUTH too often forgotten in the marvelous world of the Shroud !!!  Have you noticed that there’s absolutely no Buddhist, no Muslim, no Hasidic Jew and no Atheist scientist that ever proposed a supernatural hypothesis concerning the body image formation, while, on the other hand, we found historically some non believers, like Yves Delage in France (beginning of the 20th century) who supported or proposed natural image formation process to explain the body image on the cloth ?!?  Meditate on that folks !!!\n\n","date":"August 10, 2012 at 10:57 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14725","author":"Yannick Clément","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"At my posting #29, I was hopeful of a meaningful, productive and fair-minded dialogue with Max Patrick Hamon.  I regret that now seems quite impossible.  We now seem to be in a similar position as we were a few months ago.  My views remain that all possibilities remain open until conclusively proved otherwise.  I have little to add to my previously stated views on this matter.\n\n","date":"August 10, 2012 at 4:35 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14734","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"The only thing I have to add to my posting at #53, is that the actual image is quite inconsistent with any kind of wrap-around disposition of the cloth, whether tightly bound or loosened, merely from elementary principles of projective geometry as understood by any high school student of technical drawing.  You don’t have to be a Gaspard Mong (ever heard of him?) to understand that simple fact!\n\n","date":"August 10, 2012 at 6:37 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14738","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Daveb NZL wrote: “the actual image is quite inconsistent with any kind of wrap-around disposition of the cloth, whether tightly bound or loosened, merely from elementary principles of projective geometry as understood by any high school student of technical drawing.” \nThis is just another very poor attempt by him to poison the well. I do think Daveb WNZ just deliberately or uncosciously misunsterdand the whole point when it comes to have both high resolution body image with not definite outline AND neat/sharp blood decals. Daveb WNZ definitely isn’t an archaeologogical blood pattern analyst.\n\n","date":"August 11, 2012 at 5:49 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14754","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Mistyping: with NO definite outline\n\n","date":"August 11, 2012 at 5:50 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14755","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"I also think Daveb WNZ has real difficulty to think in 3D…when facing a 2D imprint.\n\n","date":"August 11, 2012 at 6:00 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14757","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Correction:a laterally truncated volumetric image seen in 2D.\n\n","date":"August 11, 2012 at 6:03 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14758","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Daveb WZN is to be reminded that the document should  be studied from BOTH a scientific AND archaeological viewpoint.\n\n","date":"August 11, 2012 at 6:06 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14759","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"In terms of 3D reconstruction, It shall be reminded that even the physicist Jackson made a gross mistake as he first totally ignored the bent forward postion of the face encoded in the Sindon Image. \nGeometrically and gravitationally speaking Daveb WNZ  is no better off. Can the latter PLEASE e.g. account for the formation of the shooting-star like shaped hematic constellation as if starting off from the left elbow?\n\n","date":"August 11, 2012 at 6:18 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14760","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"In all likelihood, the body image was so much literally “projected” as “ante-injected”.\n\n","date":"August 11, 2012 at 6:38 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14761","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Correction: the body image was NOT so much literally “projected” as superficially “ante-injected”.\n\n","date":"August 11, 2012 at 6:40 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14762","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"MOST CURIOUSLY, when it comes to explain the Sindon Image in the hypothesis the cloth is Yeshus’a burial sheet, Daveb WNZ a so-called Christian, JUST IGNORE the four evangelists’ testimonies. This is the world upside down!\n\n","date":"August 11, 2012 at 6:47 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14763","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Ante-injected image = image gradually recorded before the receiving surface totally seperate form the source object\n\n","date":"August 11, 2012 at 7:25 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14767","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"+ Mistyping: archaeological\n\n","date":"August 11, 2012 at 5:57 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14756","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"It is sad to see MPH taking refuge in his pathetic attempts at incomprehensible arcanery, contemptuous of every view except his own.  I rather suspect that I am very likely better placed than he to comment on principles of projective geometry.\n\n","date":"August 11, 2012 at 6:58 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14765","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Daveb WN, you  are TOTALLY displaced to comment on what is most likemy to be an ante-injected image = image gradually recorded before the receiving surface totally seperate form the source object.\n\n","date":"August 11, 2012 at 7:27 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14768","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Corection: \nDWNZ, you are TOTALLY displaced to comment on what is most likely to be an ante-injected image = an image gradually recorded before the receiving surface totally seperates from the source object. \nYour selfserving ignorance of the four evangelists testimonies speaks for itself of your incompentency as Gospel scholar and your ignorance of blood pattern analysis of your incompentency as both an archaeological blood pattern analyst  I AM STILL WAITING for you to explain the shootiing-star like shaped hematic constellation formation on the non-body area…\n\n","date":"August 11, 2012 at 7:36 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14770","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Shall I remind DWNZ, that the Sindon Image formation process is NOT JUST a geometrical one?\n\n","date":"August 11, 2012 at 7:56 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14771","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Corre’ction: Shall I POLITELY remind DWNZ, that the Sindon Image formation process ISSUE is NOT JUST a geometrical one?\n\n","date":"August 11, 2012 at 7:59 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14775","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Correction a “projective” geometry iissue\n\n","date":"August 11, 2012 at 8:06 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14776","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Yannick:\nYa he comentado en muchas ocasiones que no se dan en el Hombre de la Sábana las circunstancias apropiadas para una reacción de Maillard….. y por el momento es una hipótesis NO demostrada el que en el tejido de la Sábana se encuentre el revestimiento de sacáridos reactivos necesarios para esa reaccción.\nPero la finalidad de mi comentario, yo soy “perro viejo”, era que el LECTOR tuviera una idea clara de QUÉ SE ESCONDE detrás de cada propuesta, en este caso qué se esconde tras la hipótesis de la reacción de Maillard.\nSuponía cúal era el pensamiento de Rogers y me alegra el que usted me lo confirme.\n[Quote from Carlos : “-To the Rogers proposal be scientific, the Maillard reaction would have been interrupted suddenly by the withdrawal or the theft of the corpse of Jesus within 36-48 hours of their stay in the Sepulchre.”\nMy answer : Effectively, that’s what Rogers was assuming with his hypothesis, with the exception of one thing : The assumption of the maximum time before the body had to leave the Shroud is in fact 72 hours instead of 36-48 hours, because many studies have showed that the liquid phase of putrefaction can start between 36 to 72 hours, DEPENDING ON MANY FACTORS. In page 116 of his book, Rogers say : “Vass et al. also report that putrefaction (structural degradation) starts between 36 and 72 hours after death…” And he add : “Perhaps we can assume that the cloth could not have been in contact with the body for more than about three days.”]\nEl científico honesto no debe dejarse influenciar por ningún aspecto religioso, Delage fue un magnífico ejemplo, y Rogers honestamente manifestó que su hipótesis NO JUSTIFICABA la imagen corporal, sino tan sólo el COLOR de la fibrilla afectada en su recubrimiento de impurezas.\nUna reacción de Maillard que NO parece ser viable y que NO justifica la imagen.\nSi la formación de la imagen se debiera a la reacción de Maillard propuesta por Rogers:\n1.- El Hombre de la Sábana ( Jesús de Nazaret) NO HABRÍA RESUCITADO, su cuerpo habría sido retirado o robado.\n2.- Los Evangelios contarían GRANDES MENTIRAS ( apariciones de Jesús, ascensión, etc, etc).\n3.- El Cristianismo se basaría pues en una GRAN MENTIRA.\nPara ser la reaccion de Maillard una hipótesis que NO justifica la imagen , admitirla como válida resulta bastante MÁS DAÑINA al pensamiento cristiano que las hipótesis de los ADVERSARIOS de la Sábana, McCrone, Nickell, Garlaschelli, Lombatti etc, etc, o que los resultados de la datación por el C14, ya siendo la Sábana una falsificación medieval, no afecta a aquellas cosas que son los pilares de la Fe cristiana.\n¿Comprenden los lectores?\nCarlos Otal.\n\n","date":"August 10, 2012 at 7:25 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14739","author":"corneliotel","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Carlos, I have translate your comment and you said : “If the image formation is due to the Maillard reaction given by Rogers A. – The Man of the Shroud (Jesus of Nazareth) had not risen, your body would have been removed or stolen. 2. – The Gospels count BIG LIES (appearances of Jesus, climbing, etc, etc). 3. – Christianity would build it in a BIG LIE.”\nI’m sorry to tell you this but I will anyway :  I HAVE NEVER READ SOMETHING SO DUMB AROUND HERE !!!  How can you think that ???  This is completely ludicrous.  Let me remind you that Pierre Barbet was a good faithful Catholic and thought that a scenario involving a natural formation of the image AND the Resurrection of Christ was TRULY POSSIBLE and he even saw a SIGN (not a proof) of this event with the undisturbed aspect of the bloodstains on the Shroud !!!  And he was surely not alone to think like that !!!!!\nLet’s take this scenario :  Imagine the body image was really caused by a Maillard reaction and that, after maybe 36 hours, the body of Jesus resurrected by suddently vanishing from the Shroud WITHOUT PRODUCING ANY FORM OF ENERGY (which is a speculative “Hollywood” style idea that has no basis, not even in official Catholic theology).  That would have stopped the released of amines suddently and the chemical reaction could not have continue and that would have had the effect to prevent the cloth to be completely stained by this chemical process.  Effectively, if the reaction would have continue for some time, it’s evident that there would have been a saturation of the coloration in many places on the cloth.  \nIn a scenario like that, Jesus would have really resurrect and the “active” part of the chemical reaction that produced his body image would have been finish at the same time (with a probable amount of time necessary after that for a full development of the image as we see it today). \nQuestion : How can you be so sure that a scenario like that would be impossible ???  I really don’t understand your line of thinking here.  As I understand you, the only way the Shroud can be the genuine Shroud of Christ would be to have an image produced by a release of some kind of energetic radiation.  Am I right ?  Excuse me but there’s other possible scenarios that this one !!!!!  In my paper, I didn’t rejected the scenario you defend so vigorously (look again at my scenario #4), so why would you reject the sub-scenario #3 involving a natural process of image formation AND the Resurrection of Christ, accompanied  by absolutely no release of energy at all ???  How can you be so sure that this is not the closest scenario versus the reality of Jesus Resurrection ???\nI recently exchange a few email with Manny Carreira, the Spanish physicist and Jesuit priest.  He read my paper and said this : “I am in complete agreement with your ideas. And for anybody who wants to sustain the hypothesis of a medieval forgery, the challenge remains: produce something like it, even with modern technology. This is the way science requires a hypothesis to be worth taking seriously.  The only change I would suggest would be to avoid the term “dematerialization”.”\nThen, he said this : “It is true that other people have used the term “dematerialize” to describe the loss of structure, reducing the body to loose elementary particles or even to their energy equivalents. I might be reacting strongly -being a physicist- when I want to stick to terms with their proper meaning, but language should be as precise as possible to avoid frequent misinterpretations, especially when using terms in a theological context.”\nThen, he suggest me to add a footnote to explain what I mean by “dematerialization” of the body at the time of the Resurrection.  Here’s what he told me :  “Perhaps no single word is adequate to avoid possible misinterpretations. When I write on this subject I feel more comfortable saying that “the entire human reality -soul and body- begins to exist outside the space-time frame where physical activity takes place”, as described by science. This is the way the Catechism of the Catholic Church expresses it (nos. 996-1000 especially). Since the spirit is independent -by its very nature- from space-time constraints, we can say that the body exists in a similar way as the spirit does.” \nAnd here’s what I wrote in the footnote that I add in my paper (based mainly on what M. Carreira told me) : “This expression should be understood in the sense of a “vanishing of the body”. And it’s important to note that, on a religious level, words like “dematerialization” or “vanishing” doesn’t mean that the body of Christ would have been “destroyed” in favor of a surviving of his soul only (like the idea we can have of a ghost, for example). Effectively, the Catechism of the Catholic Church (particularly #996–1000) indicates that, at the time of Jesus’ Resurrection, his entire human reality (body, spirit and soul) begin to exist outside the space-time frame where physical activity takes place, as described by science.” \nI sent it to M. Carreira and I got his approval !  He said : “Yes, the footnote makes sure that the idea is not misinterpreted.”\nAll this to say :  From a Catholic theological point of view, the fact that Jesus body was not “destroyed” in favor of a surviving of his soul only (like the idea we can have of a ghost, for example), but on the contrary, that his entire human reality (body, spirit and soul) begin to exist outside the space-time frame where physical activity takes place, as described by science, don’t mean at all that there was some burst of energy at that moment and that we would see some traces of this on the Shroud of Turin !!!  On the contrary, the theological idea defended by the Church and M. Carreira in particular concerning the Resurrection of Christ can not allow anyone to reject the scenario #3 I described in my paper or the scenario you told me concerning the Maillard reaction (accompanied by the Resurrection of Christ) !!!\nI think you should left the door open concerning my third scenario (especially the sub-scenario involving the Resurrection of Christ without any release of energy), as I have left the door open in my paper to the idea of an image directly produced by a supernatural event (i.e. the Resurrection of Christ).  And I did that to stay honest, even if on a personal level, I really don’t think this supernatural scenario is the most probable…  Meditate on all this and you’ll see that there’s no way, theologically, to reject the possibility of an image produced naturally, even in the case of the Resurrection of Christ.\n\n","date":"August 10, 2012 at 10:23 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14745","author":"Yannick Clément","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"But, dear, if you admit as an explanatory hypothesis miraculous resurrection of the divine body (fade, dematerialization and so on), all efforts explanatory are superfluous . Omnipotent God can resurrect with Maillard reactions, effects Corona, low-intensity laser beams or whatever else. Or all together while none of them. Have not heard you talk about the foolishness of St. Paul?\nOr we play to find a scientific explanation or we become theologians. Both things at once is a jam. In this sense I am “rogersist”.\n\n","date":"August 11, 2012 at 2:07 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14749","author":"David Mo","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"The Maillard reaction, if there was one, was not linked with Jesus Resurrection but with his dead body !!!  By the way, let’s never forget this great truth :  The Shroud show a dead body and not a glorious one !!!\n\n","date":"August 12, 2012 at 5:57 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14840","author":"Yannick Clément","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"\nMax Patrick Hamon :Corection:\nDWNZ, you are TOTALLY displaced to comment on what is most likely to be an ante-injected image = an image gradually recorded before the receiving surface totally seperates from the source object.\nYour selfserving ignorance of the four evangelists testimonies speaks for itself of your incompentency as Gospel scholar and your ignorance of blood pattern analysis of your incompentency as both an archaeological blood pattern analyst I AM STILL WAITING for you to explain the shootiing-star like shaped hematic constellation formation on the non-body area…\nIn that case you shall have to wait a very long time indeed!  I engage on this site expecting to give and receive respect, not to be insulted by an arrogant self-styled whatever you claim to be\n\n","date":"August 11, 2012 at 7:57 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14772","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"DWNZ, I also STILL do think you have a very hypocrite idea of respect.\n\n","date":"August 11, 2012 at 8:59 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14778","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"to DWNZ:\nShall I say POLITELY that the same applies to your ignorrogance? Whether or not I’ll would have been polite with you, I do think I still would have had  to wait FOR AGES since you JUST ARE TOTALLY UNABLE TO EXPLAIN THIS SPECIFIC HEMATIC CONTELLATION. Taking an ALL-BLACK (with ill-rancor)  leave when having to face facts and relevant contradiction?\n\n","date":"August 11, 2012 at 8:35 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14777","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"DWNZ, BTW when it comes to the Sindon volumetric/2D Image, we have to talk about variable projective geometry.\n\n","date":"August 11, 2012 at 9:11 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14779","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Correction: cryptovolumetric/2D image\n\n","date":"August 11, 2012 at 9:14 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14780","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Variable in terms of anatomical image excess and deficit, drying-up in-soaked linen mechanical return force and the like.\n\n","date":"August 11, 2012 at 10:51 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14786","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"How long  will the unraveling of the scientic and archaeological truth about the Sindon Image be inhibited? \nAs long as arch-miraculists  such as Dave and Ron will hold fast to their die hard received ideas, half-untruths, pseudo-facts, falsifed exegeses and speculative selfserving ignorance.\n\n","date":"August 11, 2012 at 10:04 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14781","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Shall I repeat here, if the Sindon Image is (as I do think after years of studies and research) just the result of a specific 1st cedntury CE Judean purifying ritual, this will never prove that  Yeshua hasn’t possibly raised from the death. Resurrection is first and foremost a matter of Christian faith (an inner certitude) and shall be respected as such.\n\n","date":"August 11, 2012 at 10:23 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14782","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Correction: 1st century CE\n                   raised from the dead\n\n","date":"August 11, 2012 at 10:33 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14784","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Max said ” Shall I repeat here, if the Sindon Image is ( as I do think after years of studies and research) just the result of…”  Thats one big “IF” Max!  Truly, I sense science will never find an answer to the Shroud. The Shroud is an enigma, which seems to stay one step ahead of our science…’Seemingly’ one figures out one thing, and yet another is there to perplex and bewilder!…Get the picture?\nR\n\n","date":"August 11, 2012 at 11:24 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14788","author":"Ron","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"If the image is the product of a specific 1st c Judean purifying ritual, it should be repeatable.  Why don’t you try it with a rat?  You could traumatise it first to get the bilirubin!\n\n","date":"August 11, 2012 at 5:19 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14799","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Most obviously, you STILL don’t understand the real research problem/puzzle of the Sindon image formation process reconstruction.\n\n","date":"August 12, 2012 at 4:39 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14816","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Ron,\nThere are WAYS and WAYS to figure out things as far as the Sindon Image is concerned,  mostly two: EITHER from true facts and what is most likely to be true OR received ideas, half-untruths, pseudo facts and speculatoive selfserving ignorance. This makes a whole world of a difference! \nArch-miraculists do seem just tend to deliberately or unconsciously cultivate a pseudo-scientific and pseudo-archaeological dead-end lest their supernaturalistic approach to the Sindon Image could lose even one inch of ground. They do seem not to be really interested in the scientific and archaeological truth in se :they just want the Sindon Image to be miraculous even at the cost of good Science and Archaeology.\n\n","date":"August 11, 2012 at 11:45 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14789","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Well Max with all the ways and ways, it is still an enigma! All scientifically tested facts found to date, all attemps to replicate, and all hypothesis put forward, so far, have not proven anything! We know what the image is not, but not what it is. But those are not the only reasons I believe the image is miraculous. I have my own reasons which I’ll keep to myself. Furthermore you could not be more wrong on one point, in that, I keep in-touch with all scientific studies done and by my understanding of everything (all facts) that I’ve read and of the perplexing qualities of the image, I still get the sense there is not nor will there ever be a simply ‘naturalistic’ conclusion to the Shroud. We will be long gone Max and the Shroud will still baffle all those who study it, as it has done for the last more then a century of scientific study.\nR\n\n","date":"August 11, 2012 at 4:01 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14797","author":"Ron","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Whether deliberately or unconsciously, arch-miraculists are and do everything  for the Sindon Image to remain an ongoing enigma so that they can keep  promoting their “God of the gap” approach. (see their list of so-called proven facts, aprioristic approach and implied received ideas as they appear in Fanti’s paper) This is neither Science nor Archaeology but applied ideology.\n\n","date":"August 12, 2012 at 4:49 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14817","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Corrections:\nArch-miraculists do seem TO just tend to deliberately or unconsciously cultivate a pseudo-scientific and pseudo-archaeological dead-end\nthey just want the Sindon Image to be miraculous even at the EXPENSE of good Science and Archaeology.\n\n","date":"August 11, 2012 at 11:53 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14790","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Actually the same can also be told about arch-sceptics and arch-atheists…\n\n","date":"August 11, 2012 at 11:57 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14791","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Correction: be said\n\n","date":"August 11, 2012 at 11:57 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14792","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"…they just want the Sindon Image to be an ingenuous fake at all cost.\n\n","date":"August 11, 2012 at 11:59 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14793","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Each side just keep poisoning the other’s well.Such is the deplorable state of things in to-day pseudo Shoud science world.\n\n","date":"August 11, 2012 at 12:03 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14794","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"In the process, the naturalistic/ritualistic approach is TOTALLY underrated, overlooked or even ignored. Therefore allow me to remedy to this current state of things. All the more so when arch-miraculists, arch-sceptics and/or  arch-atheists are not only wrong in their opinion  but also in their facts, present half-untruths as facts, try to sell us their received ideas and the like.\n\n","date":"August 11, 2012 at 12:42 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14795","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Correction:present half-truths as full-truths\n\n","date":"August 11, 2012 at 12:44 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14796","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"I would like to continue my exchange with Daveb because his last comment touches many interesting topics.  I will answer each one of the point raised by Dave in the comment #21 that you can find above, in this page.\nMy answer to point #1 :  I’m not sure Dave if you realize the crucial importance in determining, without any serious doubt, the real chromophore of the image.  The relevance of this question concerns all the proposal of image formation that have been made over the years.  Effectively, there’s no doubt in my mind that if science can confirm once and for all what is the real chromophore of the image, it will then be much more easy to evaluate the real pertinence of all these image formation hypotheses that were submit over the years.  And because of that, you can be sure that many of them could finally be set aside for good by science.  Right now, because the promising hypothesis of the image chromophore proposed by Rogers (and backed-up by many findings, facts and observations coming from the Shroud) have been questioned by Fanti and others, while they proposed another hypothesis (namely the primary cell wall of the linen fibers), it is impossible to be 100% sure, scientifically speaking, of what is the real image chromophore.  Finding what it is without any more doubt would be a HUGE STEP in the comprehension of the real nature of the image on the Shroud and, as I say, would enabled science to reject many hypothesis that are still “in the air” these days.  No doubt that the confirmation of the real image chromophore would seriously restrict the number of potential image formation hypotheses that could have some chances to really explain (totally or partially) the image on the Shroud.  At the very least, it would indicate the right scientific direction to follow in order to finally find out what is the most probable image formation process (or processes) that have caused the image on the cloth.  And think about it : if there was a scientific confirmation of the hypothesis of Rogers concerning the idea that the image reside ONLY in a thin layer of impurities on-top of the fiber that are the most superficial on the cloth, without any detectable effect on the primary cell wall of the fibers, then I’m afraid (for you) that all the hypotheses of image formation that involved any kind of energetic radiation (whether it be UV light, corona discharge, protons, neutrons and even the hypothesis of an electrostatic discharge coming from a seismic activity) would have to be set aside by science or, at the very least, would then be considered as “highly improbable”.  Why would it be that way ?  I once got this question from no other than Thibault Heimburger and, to answer his question, I talked to him about this important quote from Rogers book : “I studied the chemical kinetics of the impurity materials and conclude that it was IMPROBABLE that the impurities had been scorched by heat or any radiation source : the crystal structure of the flax image fibers was NO MORE DEFECTIVE than non-image fibers.  It would take very good temperature control specifically to scorch impurities without producing some defects in the cellulose.”  I hope you understand now the crucial importance for Shroud science to confirm or not the image chromophore hypothesis of Rogers !!!  What Rogers said here is if he’s correct about the chromophore, that would mean that any form of energetic radiation would not only produced a coloration of the impurity layer but ALSO would SURELY produced noticeable defects in the primary cell wall (defects that, if we believe Rogers, are simply NOT THERE on the Shroud).  And not only does Rogers said it, he experimentally showed it when he used a linen sample prepared with the same Antic method as reported by Pliny the Elder and submit it to a corona discharge !  You can read the report on this very important experiment in pages 83 to 86 of his book.  After the discharge, Rogers noticed easily an oxidation of the hemicelluloses and pectines (those are the less stable elements of the primary cell wall) present under the thin layer of impurities !!!  When we consider this experimental result obtained by Rogers and if we assume that he was right about the image chromophore, then it seem obvious that any form of energetic radiation (like the UV light proposed by Jackson, Di Lazzaro or Moran or the corona discharge proposed by Fanti or the protons proposed by Rinaudo or the electrostatic discharge coming from a seismic activity proposed by DeLiso), in order to leave a coloration like we see on the Shroud, would not only affect the thin layer of impurities but ALSO the primary cell wall of the linen fiber.  This kind of result for the primary cell wall would have been easily noticeable for an expert like Rogers, but it’s NOT what he observed concerning the image fibers on the Shroud, and it is especially true concerning the ghosts of coloration that has left a colorless, lustrous and undamaged linen fiber behind, which is a clear indicator that the primary cell wall was NOT AFFECTED by the body image formation process.  All these experimental results, facts and observation concerning the body image really seem to favored greatly the hypothesis of Rogers for the image chromophore.  So for me (and also for you as it seem!!!) this hypothesis MUST be considered the most probable we have for the moment.  I don’t see any good reason why Shroud science should favored another hypothesis for the moment.  That doesn’t mean Rogers hypothesis is surely correct, but in the present state of our knowledge versus the Shroud, this is there’s no doubt in my mind that this is the hypothesis that “fits” the best with all the known data concerning the Shroud… What Shroud science need now is another direct access to the cloth in order to see if Rogers hypothesis could be scientifically confirmed by an extensive chemical, spectroscopic and microscopic examination of colored fibers from the body image area and also of non-colored fibers from other places on the cloth that were not affected by the image formation process.  And while we wait for this kind of direct access to the cloth, why not trying to reproduced linen samples with the ancient method described by Pliny the Elder (and other possible ancient method that could be historically traced) and analyzed what kind of coating can be detect on the surface of the fibers and see the level of similarity in the physical and chemical nature of these non-image fibers versus the data we know about the non-image fibers from the Shroud ???  This kind of research COULD help to confirm even more Rogers hypothesis for the image chromophore (for exemple, these samples could be submit to the sticky tape test and see if they produced similar ghosts that were found by Rogers in non-image fibers samples) and if it would be the case, that would help us to understand even more the correct physical and chemical nature of the Shroud’s fibers and that would help to understand better what is the most probable method that was used to produced the cloth.  And, not the least, that would also give us another clue (one more !) that the Shroud is much older than the C14 results published in 1989.  Finally, if these results would really seem to confirm that these samples are very similar in nature in comparison with the Shroud’s fibers, it would also be interesting to use them in order to verify many hypotheses of image formation.  I think it is about time that science can do more laboratory experiments like that and, by doing so, push the work of Rogers even further (concerning the image chromophore first, and also concerning his Maillard reaction hypothesis).\n2- Again, IF Rogers hypothesis concerning the image chromophore is correct (and presently, this hypothesis really seem to be the best we have), then it seem that all the hypothesis involving an energetic radiation that would be a by-product of the Resurrection would have to be considered as “highly improbable” for all the reasons I’ve exposed in point #1 of this comment.  Presently, I think it’s very premature (and highly speculative) to point out some particular characteristic of the body image and claim that it is highly improbable that it could be due to a natural process.  Why ? For the simple and good reason that science has not fully tested yet (I mean under all possible laboratory conditions you can imagine and not only with some computer software, even if it is an interesting avenue of research too) every possible natural image formation process.  Any good science work like this :  before even thinking that there is no known natural process that can account for a particular phenomenon (or material object), a full and complete analysis MUST BE PROPERLY DONE (including real experiments done under laboratory conditions) of all the possible options involving some natural process.  And presently, it is far from being the case !!!  Much more researches need to be done before science can conclude that there is absolutely no known process that can account for the body image on the Shroud.  Someone who would state that today would be a liar or a very naive person.  I don’t think you’re one of those person Dave, since you clearly state : “Clearly the Vatican authorities are unlikely to proclaim the image as miraculous until all scientific avenues have been explored…”  But be sure there’s a lot of persons in that liar (or naive) group who think (wrongly) that science has already come full circle versus this relic and his image !!!  The STURP 2 direct investigation that was planed by the team between 1984 and 1988 is a very clear proof of the erroneous thinking of these people.  And for what you say about personal interpretation concerning the known data from the Shroud, of course each person is free to believe what they want, but let’s never forget that these kinds of personal interpretation are not a scientific truth !  Before thinking that the image is due to a supernatural event (the Resurrection), I think someone has to be very careful, for the simple reason I just gave you (i.e. it would be highly premature for science presently to conclude that the image on the cloth cannot be explained by the know laws of nature).  More researches need to be done !!!   \n3- Yes I have read (as promise) the paper written by DeLiso and it is very far from what can be considered as a confirmation that the image on the Shroud was produced by this kind of electrostatic discharge coming from a seismic activity  !  In his conclusion, DeLiso wrote that he was able to obtain images with 3D character and SOME SIMILARITIES with the Turin Shroud, during seismic radon emission, with electrostatic discharge and geomagnetic variations, near IRON MATERIAL, with infra-sound emission.  First, we have to understand that even if this is interesting, IF Rogers hypothesis concerning the chromophore is correct, that would mean that the coloration result obtain with this process on a linen sample of the same nature than the Shroud would surely affect not only the thin layer of impurities that would be present on-top of the fibers, but ALSO the primary cell wall of the linen fiber, which would mean a discrepancy with the real nature of the body image on the Shroud !  Of course, we can be sure about that for the moment, but because of the fact that Rogers hypothesis seem to be the closest to the reality of the image chromophore of the Shroud, we have to be very cautious with such promising claims like the one made by DeLiso in his paper, stating something like “I have been able to produced a SIMILAR image than the image on the Shroud” (note that Di Lazzaro made pretty much the same claim concerning his experimental results with UV lasers).  In fact, if Rogers hypothesis is correct, these kind of claims (that we can also see in some papers published in the “special edition” of Fanti, by the way) are most probably incorrect versus the reality.  Secondly, a human corpse is far more different than any kind of iron objects !!!  Have you noticed that all these hypotheses involving some kind of electric discharge almost always rely on images produced with metallic objects ???  About that, let’s never forget what Rogers said wisely in his book :  “The lower density of the hair makes it UNLIKELY that large amounts of either HEAT OR RADIATION WOULD HAVE BEEN PRODUCED IN THE HAIR.  This suggests that vapor diffusion was involved in image formation, because any fibrous mat, INCLUDING HAIR, reduces the rate of diffusion of gases.  Fiber mats are used for insulation, because they reduce gas diffusion and heat transfer by convection.”  This is a great objection from Rogers concerning all these energetic radiation hypotheses for image formation…  When someone, while using one of these energetic phenomenon, will be able to reproduced on a linen cloth the image of a wig (made of real human hair) with the same physical and chemical characteristics than the image of the hair we see on the Shroud, then maybe I’ll start to be more open on the question of whether or not an hypothesis like that can really offer a potential solution for the body image on the Shroud…  Lastly, I would say that it is not because one phenomenon involving one kind of energetic radiation seem to be able to produce a real 3D image on linen that we can conclude that this phenomenon is responsible to the image on the Shroud.  Let’s never forget that the 3D aspect of the body image on the Shroud (even if it is one of the most difficult characteristic to reproduce) represent only one particular characteristic of the image among many others and before claiming that one energetic phenomenon can produced a “similar” image on linen, it MUST be shown scientifically and without any doubt that the resulting image possess ALL the known chemical and physical characteristics of the body image on the Shroud and not just some of them, even if it is the 3D aspect of the image.  And as I said, if Rogers is right about the chromophore, then I think it would be extremely difficult for a researcher who propose an hypothesis based on any form of energetic radiation to prove that the resulting image he has produced on linen can really offer a total “match” with ALL the known characteristics of the image on the Shroud (that would include, in the case Rogers hypothesis was correct, a coloration that would rest ONLY in a thin layer of impurities while the primary cell wall of the fiber would not be affected at all by the image formation process).  And to conclude this point, here’s one interesting objection that Rogers raised against the corona discharge hypothesis of Fanti and that, I believe, could be also applied directly to this hypothesis involving seismic radon emission, with electrostatic discharge and geomagnetic variations : “In order for the body to charge to a high voltage, it MUST NOT BE GROUNDED.  A body insulated from limestone only by a single thickness of moist linen should be at ground potential : no corona could form.  In addition, body/cloth contact would bring the two surfaces to the same potential.  Even small, light, non-conductive pith balls short out on contact when used to demonstrate electrostatics in elementary science classes.  Because there is no such thing as a perfect insulator, materials in contact assume the same potential.  Without a potential difference, IONIZATION IS IMPOSSIBLE.”  Now, I’m not at all expert in the field of electrostatic but Rogers knew these kind of electric discharge VERY WELL.  I think we must all take account of this important objection and believe the expert.  And here’s one more very important objection that can be raised against the hypothesis of DeLiso concerning seismic radon emission, with electrostatic discharge and geomagnetic variations.  In the introduction of his paper, DeLiso indicate that, in order for him to obtain images on linen with his electrostatic phenomenon, he had to soak the cloth with different solutions (for example, he soak some samples in water and some others in an oily solution made of aloes, myrrh and other products).  This soaking of the linen cloth seems to be one major condition that MUST be reached in order for an image to form with his electrostatic discharge.  Here, I’m sorry to disappoint you but the data coming from the STURP analysis really seem to show that this wasn’t the case for the Shroud when the image formation process was active.  Here’s what Rogers had to say on this particular topic :  “No fiber in a pure image area were cemented together by ANY FOREIGN MATERIAL, and there were NO LIQUID MENISCUS MARKS.  The material that resembled bloodstains was quite different.  These facts seemed to eliminate any image-formation hypothesis that was based solely on the flow of a liquid into the cloth.  This also suggests that, if a body was involved in the image-formation, IT WAS DRY AT THE TIME THE COLOR FORMED.”  Meditate on that FACT for a while and add to this the fact that STURP wasn’t able to detect on the cloth any substances that was known to be used in ancient burial rites (like olive oil, aloes, myrrh, etc.) !!!  Look, even normal human sweat was not detected at all by STURP on the Shroud !!!  The data from STURP really seem to indicate that the cloth AND the body had not been soaked with any known burial products in a liquid form.  These data from STURP really suggest that if there ever was aloes and myrrh present in the vicinity or inside the cloth with the corpse, it must have been in solid state (maybe in powder).  Here’s a reflection concerning this last quote from Rogers :  I would really love to know if DeLiso could honestly say that there really is a total absence of cemented fibers in the image area of his samples of linen that bears an image !!!  I TRULY DON’T THINK SO !!!  And the same reflection can be made from this other quotes from Rogers book : “There is NO SIGNIFICANT DIFFERENCE in crystal perfection between image and non-image fibers.  The image WAS NOT produced by radiation.”  Again, I would really love to know if DeLiso could honestly say that there really is not significant difference in crystal perfection between image and non-image fibers present on his linen samples that bears an image !!!  And again, I TRULT DON’T THINK SO !!!  You see, before someone can proclaim that he has obtained a “similar” image on linen than the one that is on the Shroud, he SHOULD be able to scientifically PROVE that he has been able to match ALL the known characteristics of the body image that is on the Shroud !  I truly believe it is far from being the case concerning DeLiso’s images on linen…  And I don’t even mentioned the fact that his linen samples were surely not made with the Antic method of making linen cloth described by Pliny the Elder !!!  If Rogers hypothesis concerning the image chromophore is correct, the use of modern linen samples (that surely don’t have the same thin layer of impurities on-top of the fibers) would represent a very bad choice, because it would be like comparing apples and oranges !\n4- I promise I will read your paper this week.  It’s interesting that we both have the same topic idea for a paper !!!  I can’t wait to see your own conclusion and arguments in order to compare them with mine.  As I said, you will never see me conclude in a paper like this that it is 100% sure that the Shroud is the genuine Shroud of Jesus of Nazareth.  On that particular question of the identity of the man of the Shroud, since we’re dealing with probabilities and not certainties, making the kind of 100% sure claim that was once made by Fanti is simply not scientific at all !  At least, he admit this erroneous conclusion himself in his last paper…  That’s a good step in the right direction.  The direction being the honest quest for TRUTH regarding the Shroud instead of a subjective quest for someone’s own little truth.\nFinal note for Dave :  Our exchanges of the last few days have hallowed me to express in details my personal views concerning many important topics regarding the Shroud.  And the most important one can be summarized like this :  I think it’s about time that active researchers in Shroud science can put aside for 2 minutes all their different proposal concerning the image formation process in order to focus ONLY on the question of the image chromophore.  Before his death, Ray Rogers proposed a VERY INTERESTING hypothesis that took account of every known facts and observations that were made concerning the body image on the Shroud (and that could even account for some observations that are not confirmed yet, like the second superficial image of the hair on the backside of the cloth) and so far, I don’t see any good reason to discard his hypothesis in favor of other possible avenues like the primary cell wall proposed by Fanti et al.  I truly believe his hypothesis is the best we have right now.  If Shroud science is serious in his quest for truth, his PRIORITY FOR THE MOMENT should not be to find the correct image formation process, but instead to verify scientifically (with laboratory experiments, possibly assisted by specialized software) what Rogers had proposed concerning the image chromophore.  For this task, a good expert in chemistry, along with a good expert in ancient textile would surely be helpful.  And the best thing about that is the fact that many interesting experiments could be done right now, even if a direct access to the cloth is not permitted by Turin.  Outside a direct series of researches on the Shroud, I truly believe that it could be possible to confirm Rogers hypothesis concerning the chromophore (probably not completely but at least, a little bit more) or maybe to refine some aspects of it.  It’s only when the real nature of the chromophore will be determined beyond any serious doubt that it will be time to proposed hypotheses for image formation that would be consistent with the known image chromophore, NOT BEFORE !  In my mind, the actual Shroud science act way too much in reverse.  This bad tendency should be stopped.  First, we have to know if Rogers hypothesis is really correct.  Then, it will be much easier to judge any proposal for image formation in the light of the known image chromophore.  For the moment, since we’re not even 100% sure of the real chromophore, any proposal of image formation is like a shot in the dark.  Here, it’s very interesting to note that every image formation hypothesis that involved any kind of energetic radiation is based on the principle that the chromophore of the image is an oxidation-dehydration of the linen fiber itself (affecting probably only the primary cell wall of the fiber) while, in the light of Rogers work, this assumption is FAR FROM BEING PROVEN !  \nThanks a lot for this opportunity you gave me to express my opinion about that…  I hope that some Shroud scientists will hear my call for more researches concerning the image chromophore, with a great care to verify properly Rogers hypothesis, and that many things I’ve said will be an eye-opener for some people who’ll read this.  who knows ?  Maybe some of them will be encourage doing more research on these subjects.\n\n","date":"August 12, 2012 at 5:59 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14841","author":"Yannick Clément","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"YC, quoting his guru (Rogers), wrote: \n“No fiber in a pure image area were cemented together by ANY FOREIGN MATERIAL, and there were NO LIQUID MENISCUS MARKS. The material that resembled bloodstains was quite different. These facts seemed to eliminate any image-formation hypothesis that was based solely on the flow of a liquid into the cloth. This also suggests that, if a body was involved in the image-formation, IT WAS DRY AT THE TIME THE COLOR FORMED.” Meditate on that FACT for a while and add to this the fact that STURP wasn’t able to detect on the cloth any substances that was known to be used in ancient burial rites (like olive oil, aloes, myrrh, etc.) !!! Look, even normal human sweat was not detected at all by STURP on the Shroud !!! The data from STURP really seem to indicate that the cloth AND the body had not been soaked with any known burial products in a liquid form. \nThe true fact is the image just cannot “SOLELY” be based on “the flow of a liquid into the cloth”. This does not rule out at all the image formation hypothesis of an in-soaked linen cloth having been DRIED UP through a purifying ritual… \nTo really shift from mere theorical to experimental archaeology as far as the Sindon Man burial reconstruction is concerned, what is most needed is a full body silicone medical mannequin realistic replica of the Sindon Man with water chamber (to be filled with heated water to simulate body and body hyperthermia temperatures) and fully jointed neck, elbows, wrists, knees, and ankles (to provide a deathlike range of similar rigor mortis positions) +  3-4 sets  of ad hoc linen cloths (both medieval and late antique replicas).\n\n","date":"August 13, 2012 at 5:26 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14870","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"In-soaked linen cloth = a linen cloth soaked with alkaline waters such as spring waters mixed with ashes (of the Red Heifer) or rainwaters collected in a water tank reservoir hewn out in  the Malky rock stone of Jerusalem.\n\n","date":"August 13, 2012 at 6:07 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14872","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"\nMax Patrick Hamon :Whether deliberately or unconsciously, arch-miraculists are and do everything for the Sindon Image to remain an ongoing enigma so that they can keep promoting their “God of the gap” approach. (see their list of so-called proven facts, aprioristic approach and implied received ideas as they appear in Fanti’s paper) This is neither Science nor Archaeology but applied ideology.\nMax, just to clarify when I speak of facts, I speak of STURP conclusions, nothing else. Obviously you don’t read my comments with very much interest as your interpretation of them in some ways shows this. If you have considered ALL the evidence this image shows and still believe in your mind there is a ‘Naturalistic’ method for such, then that is your right, but I would suggest your missing something. You also fail to notice the main point in my comment, which was; Everytime one studies a certain detailed facet of the Shroud and believes he’s come to undertand it, another one shows up to throw in a wrench into it, as they say….Don’t you find this incredibly odd?\nR\n\n","date":"August 13, 2012 at 6:53 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14878","author":"Ron","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Ron you wrote: \n“Everytime one studies a certain detailed facet of the Shroud and believes he’s come to understand it, another one shows up to throw in a wrench into it, as they say….Don’t you find this incredibly odd?”. \nEach time one becomes more & more or really aware of all the biased observations, half-truths, misinterpretations based on aprioristic/religiously prejudiced approaches and the like, this is NO WONDER AT ALL… (It is no proof of any miraculous origin to explain the Sindon Image formation process as such).\n\n","date":"August 13, 2012 at 7:21 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14880","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Yannick C wrote:\n“In regard of the undisturbed aspect of the bloodstains, I think the withdrawal of the body from the Shroud is a crucial question.”\nSince the bloodstains are mostly accurate blood decals, what is really crucial to explore is the possibilty for the long inner in-soaked burial cloth (the corpse being tighly wrapped up) to mechanically get sort of taut again through a ritual drying up process (fumigation), the body resting in extra height (on two stones) first on the left then on the right side (the placing of the body on its left side is confirmed by the archaeological blood analysis of the non-image and orbital areas hematic cartography).\n\n","date":"August 13, 2012 at 8:03 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14881","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Mistyping: archaeological blood pattern analysis\n\n","date":"August 13, 2012 at 8:11 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14883","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"During the Sindon Image formation process, gradual mechanical separation of the cloth from the body is more likely than deliberate withdrawal.\n\n","date":"August 13, 2012 at 8:07 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-14882","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?","post":"Max two things bother me with your hypothesis; 1.- The off image blood at the elbow does not confirm any body movement, it can simply be the Shroud was tucked under the arm/elbow. 2.-With your gradual mechanical separation of the cloth from the body; Would not this STILL be evident on the blood, especially if removal was gradual? The studies have found no sign on the blood traces, whatsoever, of separation from the cloth.\nR\n\n","date":"August 27, 2012 at 1:19 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","id":"comment-15505","author":"Ron","site":"shroudstory"}]
