[{"title":"Tinfoil Hat Warning:  Chance to Experiment with Resurrection","post":"Mark 16:15-18; “15 He said to them, “Go into the whole world and proclaim the gospel to every creature. 16 Whoever believes and is baptized will be saved; whoever does not believe will be condemned. 17 These signs will accompany those who believe: in my name they will drive out demons, they will speak new languages. 18 They will pick up serpents [with their hands], and if they drink any deadly thing, it will not harm them. They will lay hands on the sick, and they will recover.”\nI had heard about extreme snake handling sects in some parts of USA, but there’s nothing in Mark’s text which says that believers will be empowered to raise the dead back to life.  Why can’t they just accept that the person’s time has come?  The futile human quest for earthly immortality! The mythical Fountain of Youth!  \nIt has been a Slow News Day!\n\n","date":"March 13, 2014 at 6:21 am","url":"https://shroudstory.com/2014/03/13/tinfoil-hat-warning-chance-to-experiment-with-resurrection/","cat":"news_&_views","id":"comment-88171","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Tinfoil Hat Warning:  Chance to Experiment with Resurrection","post":"One of them just died in Kentucky. \nhttp://bigstory.ap.org/article/kentucky-snake-handler-death-doesnt-shake-belief\n\n","date":"March 13, 2014 at 9:02 am","url":"https://shroudstory.com/2014/03/13/tinfoil-hat-warning-chance-to-experiment-with-resurrection/","cat":"news_&_views","id":"comment-88230","author":"John Green","site":"shroudstory"},{"title":"Tinfoil Hat Warning:  Chance to Experiment with Resurrection","post":"These guys could potentially be recussitating people, they certainly are not resurrecting anyone.But until they have independent documentation of their claims, keep the tin foil handy.\n\n","date":"March 13, 2014 at 7:30 am","url":"https://shroudstory.com/2014/03/13/tinfoil-hat-warning-chance-to-experiment-with-resurrection/","cat":"news_&_views","id":"comment-88195","author":"David Goulet","site":"shroudstory"},{"title":"Tinfoil Hat Warning:  Chance to Experiment with Resurrection","post":"John Green, Thanks for the link to the snake story which I read with great interest.  Apparently there’s been about 91 recorded deaths from serpent handling in USA, and it’s presently about 5 per year.  What I found fascinating is the way such deaths are rationalized, e.g. “He must have held the snake too long for egotistical reasons after the spirit had left him!” The deaths don’t discourage other practitioners, who seem to be ‘getting back on the horse after the rider’s been tossed off’ to allay their fear. Other rationalisations: “God must have decided his time was up!”. “God’s still God” etc. \nBut I wonder how well they’ve read the scriptures, Jesus’ temptation in the wilderness, “Thou shall not put the Lord God to the test!”  \nThere are no snakes in Ireland, nor in New Zealand, several varieties in Australia, I’m sure none of them are on two legs!\n\n","date":"March 14, 2014 at 6:09 am","url":"https://shroudstory.com/2014/03/13/tinfoil-hat-warning-chance-to-experiment-with-resurrection/","cat":"news_&_views","id":"comment-88638","author":"daveb of wellington nz","site":"shroudstory"}]
