[{"id":"comment-40247","author":"donn_reile","post":"I wanted to bring this up. It doesn’t have anything to do with this topic. Does anyone know anything about the Balatlar Church in Turkey? It was built in the year 660. One of the image show a similarity of the Shroud. Its the fifth picture along the bottom of the screen. I have never seen it before. Your thoughts? http://www.fotopedia.com/albums/NT p D7 R48 GM.","date":"2013-08-01","mins":"10:00 am","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","title":"Bible Archeology: The mystery continues"},{"id":"comment-27726","author":"donn_reile","post":"It does not look an ‘a’ at all. What I see are 3 separate marks, ‘c’ with what looks like a crescent moon above it and a curved letter ‘l’ as in ell in lower case. The marks are not connected at all. From the distance, it looks like an ‘a’, but up close, its actually 3 separate marks. The ‘cresent moon’ mark shows end points tapered. Same with the curved ‘l’. The ‘c’ is slightly squared at the ends..","date":"2013-03-18","mins":"8:50 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","title":"The Curious ‘a’ in the Hungarian Pray Manuscript"},{"id":"comment-27908","author":"donn_reile","post":"Great find, Max. I have been looking at medieval manuscript symbols. How were you able to locate the symbols?.","date":"2013-03-20","mins":"10:52 am","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","title":"The Curious ‘a’ in the Hungarian Pray Manuscript"},{"id":"comment-28370","author":"donn_reile","post":"I have followed the shroud research for the last 20 years. I have not yet seen one shred of evidence that would have led me to believe the shroud is a fake. I’m no scientist but after reading just about every comments Colin Berry have posted on this blog, I think there is only one way for me to see if Colin Berry’s so called scorch charcoal painting theory would hold up. Colin, would you kindly please present your findings or result of your experiment (must be photographic negative image) so that I can make a comparison between yours and the photographic negative image of the shroud? Right now I don’t care about the blood. I just want to see the image.Thanks.","date":"2013-03-25","mins":"9:29 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28459","author":"donn_reile","post":"I think there is no science for Christ. Its virtually impossible to reproduce the exact image of the shroud in addition with all of the other problems associated with it. Like you said, it will remains forever unknown. I was an atheist once. The TS has completely changed my life. It has giving me hope and happiness. The reason I still follow the Shroud is hopefully someday the truth will come out that it is authentic, probably not in my lifetime..","date":"2013-03-26","mins":"10:35 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28499","author":"donn_reile","post":"I have seen your banner before. What i was hoping for was an exact replica of shroud using bas relief as the model for your experiment. I find that its impossible to create a bas relief statue because the image on the shroud is so anatomically perfect. No sculpturist can do this. If one did, it would be in a museum as the greatest artwork ever in the history of mankind. As for my theological views, they are mine and I am welcome to them, as they had no relevance to the question I proposed. I am still interested in the scientific findings, seeing as I have no access to the shroud myself, and even if I did, I lack the scientific intellect and background to bring fourth results. As for your comment as a “dreaded internet time waster”, this is an open to the public blog (if you will) and I challenge you to change my mind, and see me as a devils advocate rather than an individual wasting your time; especially considering my depth of interest on the topic..","date":"2013-03-27","mins":"12:31 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"}]
