[{"id":"comment-18201","author":"donn_reile","post":"This is a waste of time. We all know gas diffusion will spread uniformly and show distortion. It will look look a inked thumb rolled across paper during fingerprinting. No detailed image whatsoever..","date":"2012-10-24","mins":"11:39 am","url":"https://shroudstory.com/2012/10/24/comment-promoted-denis-mannix-on-his-proposal/","cat":"image_theory","title":"Comment Promoted: Denis Mannix on his proposal"},{"id":"comment-18370","author":"donn_reile","post":"Even if the gas diffusion contacted the cloth, it will still be blurred and distorted. Its IMPOSSIBLE to created a detailed image with either the distant or contacted gas diffusion mechanism..","date":"2012-10-26","mins":"2:03 pm","url":"https://shroudstory.com/2012/10/24/comment-promoted-denis-mannix-on-his-proposal/","cat":"image_theory","title":"Comment Promoted: Denis Mannix on his proposal"},{"id":"comment-18372","author":"donn_reile","post":"Donn Reile :a Even if the gas diffusion contacted the cloth, it will still be blurred and distorted. Its IMPOSSIBLE to created a detailed image with either the distant or contacted gas diffusion mechanism. After reading my comment, you all would probably know I’m not a scientist. I can’t back up my claim. I’m just using common sense.","date":"2012-10-26","mins":"2:25 pm","url":"https://shroudstory.com/2012/10/24/comment-promoted-denis-mannix-on-his-proposal/","cat":"image_theory","title":"Comment Promoted: Denis Mannix on his proposal"},{"id":"comment-18394","author":"donn_reile","post":"I have been following the Shroud since the Vp 8 image analyzer. It just blew me away. I’m confident that this enigma will never be solved. Its beyond science..","date":"2012-10-26","mins":"10:05 pm","url":"https://shroudstory.com/2012/10/24/comment-promoted-denis-mannix-on-his-proposal/","cat":"image_theory","title":"Comment Promoted: Denis Mannix on his proposal"},{"id":"comment-49056","author":"donn_reile","post":"Still waiting for someone to create an exact image of the shroud. C’mon you guys, you’re telling me you can’t create something that was created probably 2000 years ago? I’m disappointed..","date":"2013-10-28","mins":"10:15 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49155","author":"donn_reile","post":"I’m not a scientist but I do love this blog. Great research by you scientists. I wish everyone in the world would read this blog! Just fascinating stuff. Keep up the good work!.","date":"2013-10-29","mins":"10:51 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-27565","author":"donn_reile","post":"I see desperation from both sides. One side with malliard reaction theory, a thin layer of gas diffusion between body and cloth. IMPOSSIBLE to do especially when the whole cloth is anatomically perfect. The other side, a combination of scorch and painting, yeah sure, I guess the artist knew what the photographic image would look like 800 years later. Absurd theories and a waste of time..","date":"2013-03-17","mins":"5:02 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","title":"Scorching Theory: Pseudoscience or Miracle?"},{"id":"comment-49941","author":"donn_reile","post":"Question, the images posted by Hugh Farey, the TS show image in ‘raise relief’ because it is 3 D encoded? The others does not show raise relief, why?.","date":"2013-11-04","mins":"5:27 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-49965","author":"donn_reile","post":"For Hugh Farey from what I understand about raise relief: In addition, the scientists had confirmed a startling new earlier finding that the image had 3 d information encoded on it. The clumping of degraded fibers was so uniform and precise that a computer could translate the lighter and darker groupings into mathematically precise values. Which enabled STURP members Dr John Jackson and Dr Eric Jumper to make a 3 dimensional model of the man in the shroud. They did this by feeding the encoded values of the various groupings into a VP 8 image analyzer, a device normally used by NASA to make raised relief maps from non traditional, electronic photos of distant planets. Because the distances were so far, such photos were not taken by conventional cameras using traditional light sensitive film, but by cameras tabulating emitted light photons. With the encoded information, a computer could plot exactly how the shroud lay over the figure; where it touched and didn’t touch. The computer did this by revealing minute but precise distances between the man and the cloth. Where the shroud touched his body, the degraded fibers were clumped the most; less so where there was space between the cloth and body. The lightest parts of the image had the least number of clumped fibers. In this way, the computer plotted the peaks and valleys on the head, torso, arms, and other aspects of frontal, dorsal, and side images. Jackson said that relief 3 d image on the analyzer’s screen looked anatomically plausible, even down to the subtle details of the face. No known paintings or traditional photographs have ever yet yielded such encoded values and do not produce 3 d images. “Eyes protrude, nose sink, and other distortions graphically testify to the uniqueness of the shroud image,” quoted by Kenneth Stevenson and Gary Habernas in their book Verdict on the Shroud. The 3 d encoding also appeared to negate the image being like a conventional photograph. Traditional cameras reflections of light (more light causing brightness, less causing shadows) to make an image. But the shroud images didn’t depend on light (unless light had caused the precision degrading of the fibers grouped like pixels together determining lightness or darkness and hereby etching the image. The image just happened to look like a photographic negative. In reality, it was a mathematically precise map of how the body contacted the cloth..","date":"2013-11-04","mins":"9:40 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"}]
