[{"id":"comment-3167","author":"tiro","post":"Thanks for the nicer of your comments on my post; I appreciate your kind words. Not so keen on these ones, though: “I guess new as opposed to old who we could burn at the stake” I’ve long given up wondering how otherwise pious Christians reconcile the peaceful message Jesus is said to have taught with their apparent desire to see unbelievers burned at the stake. I can only say that these are the Christians least likely to convince me of the merit of their belief system. Still, moving on: “Eleventh century? I’m surprised after reading your section on nitpicking. Not even the skeptics say eleventh century.” My understanding is that there’s dispute over the carbon dating of the shroud, with a suggestion that the fibres so tested were taken exclusively from a handy piece of mediaeval patch work. Which I guess is a good hypothesis for those whose faith is founded largely on assumptions about the provenance of this piece of cloth. But I’d have serious concerns if I thought my faith was dependent on so many assumptions. Would it not be strong enough to withstand the possibility that this is a mediaeval hoax, or an artwork unrelated to Jesus, or even an early experiment in photography? Let’s not forget that the mediaeval period saw a massive, truly massive, trade in spurious religious ‘relics’. There was *serious* profit to be made from bits of the True Cross, nails, and so on. But I’ll acknowledge that the eleventh century figure is disputed. In your sidebar, you refer to the carbon dating results as the ‘one stumbling block’ to public acceptance of this conclusion. They aren’t. Certainly for me, it’s only one problem amongst many (and let the record show that I don’t reject the existence of Jesus as a man; only as a god). There are plenty of other issues to be dealt with yet – and even if the shroud is one day shown conclusively to be contemporary with Jesus, that’s still a long way from proving he was wrapped it in. And even if *that* can be shown, that still has no weight in demonstrating his divinity..","date":"2011-05-20","mins":"3:00 am","url":"https://shroudstory.com/2011/05/19/professor-hawking-on-heaven-the-wild-road/","cat":"other_blogs","title":"Professor Hawking on Heaven « The Wild Road"}]
