[{"id":"comment-72199","author":"mike_morcous","post":"For me the following characteristics convince me it’s not an art work ( each one of them is sufficient to convince me actually): 1 negative image: why would a medieval artist produce something that can only be fully appreciated 600 years after it’s creation, how would check his work, how did he produce it and why didn’t he produce anything else) 2 3d information illustrated by VP8 image analyzer ( arguments same as above). 3 blood stains (Kelly’s arguments work for me) 4 the fact that a multidisciplinary team with some of the best image analysis experts spent all this time yet failed to explain the image creation technique and illustrated further questions re image superficiality and half tone effects. 5 forensic accuracy re rigor mortis, serum halos , high bilirubin, blood stains profiles unlike any depicted in art. Characteristic that convince me it is Jesus: 1 the profile of injuries match the biblical account perfectly. 2 the argument that this is a victim subjected to the same process described in the bible to create an artifact doesn’t convince me because it fails to explain how the image was formed, and is not required since people would be convinced with much less evidence as we can see in other relics. Questions for pro authenticity camp: 1 c14 dating (the sampling process is an embarrassment and is not a representative of the whole cloth, against the original protocol, not blind) 2 history gaps ( a valuable object like that with a naked Jesus would likely be hidden for long times as well, the mandilion hypothesis makes sense to me especially because they could only show the face of a naked Jesus) 3 was the body washed or not or partially washed.? Thus far the questions for pro authenticity camp are all non essential to the argument but are good for further inquiry. I am currently 100% convinced it’s authentic. I know I lose credibility by claiming 100% but I honestly don’t feel any doubt that I am looking at Jesus’s burial cloth..","date":"2014-01-04","mins":"12:15 pm","url":"https://shroudstory.com/2014/01/04/what-one-single-characteristic-about-the-shroud/","cat":"uncategorized","title":"What one single characteristic about the shroud  . . . ?"}]
