[{"title":"Barrie Schwortz on Catholic Radio Indy","post":"A breath of common sense.\n\n","date":"July 30, 2015 at 12:22 pm","url":"https://shroudstory.com/2015/07/29/barrie-schwortz-on-catholic-radion-indy/","cat":"radio_and_podcasts","id":"comment-206967","author":"anoxie","site":"shroudstory"},{"title":"Barrie Schwortz on Catholic Radio Indy","post":"The least common of all the senses!\n\n","date":"July 30, 2015 at 3:57 pm","url":"https://shroudstory.com/2015/07/29/barrie-schwortz-on-catholic-radion-indy/","cat":"radio_and_podcasts","id":"comment-206974","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Barrie Schwortz on Catholic Radio Indy","post":"Especially when it comes to religion and even more, when it comes to the Shroud!  Damn right!\n\n","date":"July 31, 2015 at 12:35 pm","url":"https://shroudstory.com/2015/07/29/barrie-schwortz-on-catholic-radion-indy/","cat":"radio_and_podcasts","id":"comment-207084","author":"Yannick Clément","site":"shroudstory"},{"title":"Barrie Schwortz on Catholic Radio Indy","post":"Hello Barrie:  Very good interview, I listened to the whole interview. I like how you\n1.Immediately brought into the discussion the match points between the Shroud and the Sudarium,\n2. Talked about the report/conclusions drawn by Barbet, Bucklin & Zugibe. ( 3 forensic pathologists all in agreement)\n3. Brought into discussion the Carbon Dating without getting to hung up on it.  Very well done. (avoided the Devil’s trap)\n4. Blood discussion and making it known blood stains have serum contraction rings around them, and more. \nA few months ago I put fresh red blood on 7 different samples of pure linen fabric herringbone weave  (made from flax)   My own blood in this case. It is still red.  \nI believe another contributing factor for why the blood is still red has to do with what the surface that blood is making contact with.   Pure linen in this case.   \nI am NOT in disagreement the elevated levels of bilirubin are the major reason why the blood has remained red, only mentioning the fact that the blood being transferred to  pure linen fabric may be another contributing factor.\nGood luck with all your future endeavors.\n\n","date":"August 1, 2015 at 12:42 am","url":"https://shroudstory.com/2015/07/29/barrie-schwortz-on-catholic-radion-indy/","cat":"radio_and_podcasts","id":"comment-207119","author":"Dave Hines","site":"shroudstory"},{"title":"Barrie Schwortz on Catholic Radio Indy","post":"Although Barrie Schwortz is currently doing an excellent job, here he is misleading at least on one particular point: the Oviedo Sudarium is not the Johannine soudarion. The latter refers to the Aramaic sudara, an all enveloping cloak or wrap used as a shroud. The OS is just a PRE-burial shroud not a clean wthite burial shroud.\n\n","date":"August 2, 2015 at 5:53 am","url":"https://shroudstory.com/2015/07/29/barrie-schwortz-on-catholic-radion-indy/","cat":"radio_and_podcasts","id":"comment-207252","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Barrie Schwortz on Catholic Radio Indy","post":"Hello Mr. Max Patrick Hamon:   Hope all is going well for you in whatever country you are residing in.  France?\nI’ve reached a point in my research where I  feel absolutely compelled to be be able to present what I am saying about The Shroud in a visual sense,  a genuine demonstrated reality.\nIn the same way if I was a Big Foot Researcher I would want to present a high quality video of Big Foot,  up close and personal right live on camera.  “Here it is”\nOne that would leave absolutely no doubt “This thing really does exist”   Get a blood sample as well and bring it to a lab.\nIf I was a UFO researcher I would want a actual spacecraft on the ground with aliens getting out of the craft, on video. close up shots and with a high quality camera. Live on video, Full HD, with sound.\nIf I was trying to prove a demon exists I want one on camera or film an exorcism with a body levitating and objects flying around the room.\nOne the huge challenges in Shroud research is that at some point in the research it requires having an actual dead body to wrap in pure linen herringbone weave fabric and attempt to recreate the scenario that went down in 1st Century and with the appropriate spices.  \nAs crazy as that may sound that is what is needed.   A genuine dead body and start experiments. A good relationship with the City Coroner would be helpful.\nThat is one of the reasons I am here in Central America.  I brought all my gear with me.   A lot of paranormal equipment.  Night vision cameras, EVP Voice Recorders, Electro Magnetic Field Sensor, Ect.\nThere is a Sanitarium here that also used to be max security prison I want to go see soon.  Supposedly one of the most haunted places in the world  Some of the testimony and photos I saw warrants going to the location and filming.   All night long if need be. \nAnyways, I am wishing you success in your Shroud research.  Many of the things you are saying make sense to me.  See if you can purchase all the spices you need.  Pure linen fabric of herringbone weave is available on line.  Many of the things you need are available on EBay.  The spices and the fabric.\nI think we are both at a point where we need to begin filming our research and start carrying out experiments so people can see visual results.  \nWe live in a visual age.  “Seeing is Believing” \nGood luck Max!\n\n","date":"August 2, 2015 at 6:25 pm","url":"https://shroudstory.com/2015/07/29/barrie-schwortz-on-catholic-radion-indy/","cat":"radio_and_podcasts","id":"comment-207290","author":"Dave Hines","site":"shroudstory"},{"title":"Barrie Schwortz on Catholic Radio Indy","post":"Thank you Barrie for your honest explainations. I believe.\n\n","date":"August 1, 2015 at 1:36 am","url":"https://shroudstory.com/2015/07/29/barrie-schwortz-on-catholic-radion-indy/","cat":"radio_and_podcasts","id":"comment-207120","author":"Sampath Fernando","site":"shroudstory"},{"title":"Barrie Schwortz on Catholic Radio Indy","post":"Hello Sampath:  I am still attempting to record interference pattern on linen. Very difficult.  This process involves having a more powerful laser than what I have.\n Barrie did mention also the Shroud has never been reproduced,\nMany centuries ago The Image of Edessa was  “the image not made by human hands”\n“The Shroud of Turin” is also…….. “the image that cannot be made with human hands”\nA very obvious connection,  A coincidence?   I think not.\nAt the end of the day after all is said and done The Shroud remains “the image that cannot be made with human hands”  And long after we are both gone and have left this world,  The Shroud will still be the only image in the world we cannot replicate.or fully explain. (unless the Spirit of God grants one the wisdom, understanding and insight into how it was)\nWho knows? that person could be you, maybe even tonight.  All things are possible.\nIf the Image of Edessa was just some painting on linen there would be historical record of it.  No one would have looked at it and said “Wow there is an image not made by human hands!”  There must have something about that image that was absolutely stunning, something no one had ever seen before.   Something amazing…like The Shroud.\n\n","date":"August 1, 2015 at 2:36 am","url":"https://shroudstory.com/2015/07/29/barrie-schwortz-on-catholic-radion-indy/","cat":"radio_and_podcasts","id":"comment-207122","author":"Dave Hines","site":"shroudstory"},{"title":"Barrie Schwortz on Catholic Radio Indy","post":"Concerning the last paragraph, I disagree completely with you.  First of all, the first few mentions of an image of Christ (always a facial image only of the living Christ) that we found in some accounts of the Abgar legend talks specifically about a man-made image done with paint by the man who was sent by Abgar in Jerusalem to meet Jesus.  That’s the first point: the image of Edessa was, at the origin, a painted image of the face of the living Christ made BEFORE his passion.\nThe second is this:  Don’t underestimate the great impact on the faithful and pilgrim’s faith and imagination that an official statement done by the Church leaders in Edessa concerning a so-called supernatural origin for the image could had back in those days (some time during the 6th Century or maybe a bit layer, during the Iconoclast period).  \nThis is an historical fact that once the Church declare something miraculous, you got immediately a bunch of person to believe this without questioning anything!  Look at what happened in Mexico with the Guadalupe Tilma and you’ll see that this is true…  Who can be certain if this Tilma is not simply a false painted relic?  This is a true possibility, even if the official position of the Mexico Church is to make believe it has been done through a miraculous event and even though you still got millions of faithful and pilgrims to believe it.\nThat’s precisely why I said in the short comment you can find above in this same page that when it comes to religion, common sense is not at all the first thing we can find in most faithful’s mind! And when it comes to the Shroud, it’s even truer…\n\n","date":"August 1, 2015 at 4:57 pm","url":"https://shroudstory.com/2015/07/29/barrie-schwortz-on-catholic-radion-indy/","cat":"radio_and_podcasts","id":"comment-207176","author":"Yannick Clément","site":"shroudstory"},{"title":"Barrie Schwortz on Catholic Radio Indy","post":"Hello Yannick:  i know you are really good researcher,  highly intelligent, a man of good moral character.  I apologize in any way if my post comes across negatively argumentative or overly aggressive.   I don’t want anyone feeling bad, or disrespected in any way.  I believe The Shroud was replicated in many ways by many people throughout the centuries. Hundreds and thousands of different types of imitations,  In the same way in this day and age any thing considered great is  immediately.imitated/replicated.  Be that a song, piece of art, a movie, clothing, a new car, toy or game, add infinitum to the list,.  Great things are imitated.\nIn most cases if not all, the original thing has to exist 1st before there can be a imitation.  Where is the original role model?  It looks very obvious to me.\nHowever, Until new evidence is forthcoming and I am able to present in a visual sense new evidence that supports the authenticity of the Shroud I am not going to be posting in regards to the Shroud on this Blog, with perhaps some rare exception, the exception being if The Spirit of God compels me to, and it is in accordance with his will.   I am not carrying out my own personal agenda.   I seek God’s will with diligence and 100% commitment.  Over 7 years now.  My work to date is the result of that commitment.  I’ve made some mistakes and made some overstatements in some of my presentations. But we learn by doings things and taking action.  I know what needs to be done.  And for that to accomplished I need to take a step back, A Shroud of Turin break.  Spend more time in prayer and much less on internet.  Good luck with all your future research.\n\n","date":"August 2, 2015 at 5:57 pm","url":"https://shroudstory.com/2015/07/29/barrie-schwortz-on-catholic-radion-indy/","cat":"radio_and_podcasts","id":"comment-207287","author":"Dave Hines","site":"shroudstory"},{"title":"Barrie Schwortz on Catholic Radio Indy","post":"Yannick..don’t think you know much about the tilma…..\n\n","date":"August 3, 2015 at 11:51 am","url":"https://shroudstory.com/2015/07/29/barrie-schwortz-on-catholic-radion-indy/","cat":"radio_and_podcasts","id":"comment-207351","author":"rick","site":"shroudstory"},{"title":"Barrie Schwortz on Catholic Radio Indy","post":"My rock solid witness will tell you Mr. Yannick Clement THE SHROUD IS GENUINE and is indeed THE SHROUD OF THE LORD, JESUS OF NAZARETH  we cannot assassinate his character or claim he is wrong.  He is a English Gematria calculator.  His numbers add up correctly.  He states The Shroud of Turin and the Image of Edessa are one in the same and it’s not a painting.\nThe testimony of my witness is compelling, subtle and  powerful,\nGematria  is an Assyro-Babylonian system of numerology later adopted by Jews that assigns numerical value to a word or phrase in the belief that words or phrases with identical numerical values bear some relation to each other or bear some relation to the number itself\n1.Behold The Image of Edessa= 1128\n2. It’s not a painting= 1128\n3. It’s The Mandylion = 1128\n4.Shroud of Turin = 1128\n5.Jesus of Nazareth = 1128\n6.  The Shroud of The Lord =1128\n7.  Risen Lord Jesus = 1128\n8. Shroud Is Genuine = 1128\n9. A Sacred Winding Sheet = 1128  & Sacred Shining Wrap= 1128 & Encoded Shining Wrap\n10.  A Picture Of Jesus =1128\n11.  3D Hologram Of Jesus = 1128\n12.  A Optical Illusion  = 1128  Inverted Mirror=1128\n13 Greatest 3D Hologram = 1128\n14. 3D Hologram On A Mantle = 1128\n15.   Son Of God 3D Hologram = 1128\n16   First 3D Hologram Made = 1128\n17   3D Hologram of God’s Flesh = 1128\n18  Cruelly Scourged = 1128\n19   120  3D Scourge Wounds = 1128\n20   A Brutal Scourging = 1128\n21   Beaten and Crucified Nude = 1128\n22   Crown Of Thorns = 1128\n23   A Number 3 Seen In Blood = 1128  (Refers to blood stain on forehead)\n24.   Right Side Pierced = 1128\n25   Legs Not Fractured = 1128\n26   Removed From Linen = 1128\n27    Israeli King Jesus = 1128\n28.    3D Hologram of The King = 1128\n29    A Real 3D Holographic Image = 1128\n30  Good Holographic Image= 1128\n31 Holographic Icon Image= 1128\n32.   World Prince Of Peace = 1128\n33.   Named Jesus Christ=1128\n(Not much grey area in that last one)\nMore Coincidences—\n Shape of Shroud = 1128\nShroud is 1.1 Meters Wide and 2 X 8 Cubits…1128\nScope of Shroud = 1182\nShroud is 1.1 Meters Wide and 8 X 2 Cubits…1182\nEither way it works,  (Spirit of God’s sense of humor on that one)\nThe reason being because the Shroud has mirror horizontal effect.   A little bit of reverse on the numbers and letters still adds up to the same thing.   \nCoincidence?  No Way.  \n11:28 PHRASES\n11:28 John “The Teacher is here and is calling for You”\n11:28 Mathew “Come to me, all you who are weary and burdened, and I will give you rest”\n11:28 Luke “Blessed rather are those who hear the word of God and keep it” \nI challenge anybody in the world to type in the name of a famous person, place or thing on a English Gematria Calculator and then find 33 other phrases and or words that relate to that person, place or thing and they will all have the same number?!  No Way!\nThe only other name that it works with is Satan and things relating to the Devil at 666.\nand Jesus at 888.  Jesus also equals 888 in 3 other languages,  Coincidence again? ","date":"August 2, 2015 at 5:42 am","url":"https://shroudstory.com/2015/07/29/barrie-schwortz-on-catholic-radion-indy/","cat":"radio_and_podcasts","id":"comment-207250","author":"Dave Hines","site":"shroudstory"},{"title":"Barrie Schwortz on Catholic Radio Indy","post":"Dave, I view this as a useless exercise in a form of questionable numerology. BTW: “useless exercise” also computes to 1128. That is amazing, isn’t it! So is it that the shroud is a useless exercise or is it that belief in numerology is? Sorry, Dave, I don’t buy it. Not at all.\n\n","date":"August 3, 2015 at 4:15 am","url":"https://shroudstory.com/2015/07/29/barrie-schwortz-on-catholic-radion-indy/","cat":"radio_and_podcasts","id":"comment-207319","author":"Dan","site":"shroudstory"},{"title":"Barrie Schwortz on Catholic Radio Indy","post":"Hi Dan, where are the other 32 phrases or words that relate to a “useless exercise”?\nI can put this into a question as in one would see in a IQ Test\n(I know you are a highly intelligent person, I am not doing this in a mocking manner)\nWhich of the following does not fit with the rest of the group?\na. Jesus of Nazareth\nb. Shroud of Turin\nc. Shroud of the Lord\nd. Useless exercise\ne. Son of God 3D Hologram\nThere are things on The Shroud of Turin unrelated to the distance information but in pointing those out does that mean the distance information on the Shroud is not genuine?\nIn the body of “info” on the Shroud there are water stains.   In pointing that out does that mean the distance information is not genuine?  \nThere are 2 possibilities\nAll the phrases and words relating to Jesus and The Shroud that equal 1128 are coincidental.\nAll the phrases and words relating to Jesus and The Shroud that equal 1128 are not coincidental. \nThere is a purpose and Higher Power intelligence involved or there is not.\nThere is no in between.   Yes or No. \nQuestion: What is genuine information?\nTo be genuine information the following criteria must be met.\n1. Statistic (Signal, # of Symbols)\n2. Syntax (Set of Symbols)\n3.Semantics (Meaning)\n4.Pragmatic (Action) (When Shroud is placed under VP 8 analyzer the “info takes action”)\n5. Apobetic (Purpose)\nQuestion: Is the distance info/3D info on the Shroud genuine info or not?\nNote that it passes all 5 tests to be genuine, not random.  Higher Power intelligence involved.  To conclude otherwise is not logical.  \nMy Gematria English Calculator has another purpose as well.  one of those is to bring attention to this subject.  What is genuine and what is not?   What is coincidence and what is not?\nAre all the match points between the Sudarium and Shroud also a series of incredible coincidences?\nMy question:  At one point does one stop and conclude  “These cannot all be coincidences”!\nThese are all variables one must compute on their own and then at some point, hopefully make a decision.  “which means to cut off from any other possibility”   \n To continue in doubt and uncertainty for a prolonged time is unhealthy. .  The 2 emotions blend, Doubt and Uncertainty blend and create Fear.   The underlying cause of all all illness, both physical and mental.  A disease is defined “as something that causes the abnormal function of the mind and body”    To be in doubt and uncertainty for a prolonged period will cause one to become ill.   Making a decision and taking bold action can eliminate that doubt and  uncertainty thus eradicating fear out of your life, the normal function of the mind and body is one of the benefits from making such a bold and courageous move.\nIs fear a counselor or a jailor?  An ally or enemy?   If it is the latter there is a problem\nSorry to get sidetracked,  I am sure you get the point.\nThanks for responding Dan.   Have a Great Day!\n\n","date":"August 3, 2015 at 1:55 pm","url":"https://shroudstory.com/2015/07/29/barrie-schwortz-on-catholic-radion-indy/","cat":"radio_and_podcasts","id":"comment-207357","author":"Dave Hines","site":"shroudstory"},{"title":"Barrie Schwortz on Catholic Radio Indy","post":"Hiya Dave.\nI somehow managed to miss your Gematria in the course of learning and teaching maths and statistcis, so was intrigued to find how it works. This is somewhat tentative, but I think it’s to do with there being a large number of letters in the English alphabet, 26 no less, and the relatively random distribution of the most and least frequent letters used in most English scripts.\nhttp://www.math.cornell.edu/~mec/2003-2004/cryptography/subs/frequencies.html\nThe reason it works with such amazing coincidence is probably due to inputting phrases with a sizeable number of letters, e.g. “shroud of turin” with 13 (half the alphabet, ignoring repetitions). That means that the sums of the letter values, multiplied by 6, add up to a sum total that falls within a fairly narrow range of values. All that’s needed to get that magic 1128 is to tweak here and there, changing one 5 letter word, say, for a synonym that has a slightly different sum.\nSorry to disillusion you, but that’s probability and statistics for you – the larger the number of “draws” the greater the averaging effect.\n\n","date":"August 3, 2015 at 2:44 pm","url":"https://shroudstory.com/2015/07/29/barrie-schwortz-on-catholic-radion-indy/","cat":"radio_and_podcasts","id":"comment-207358","author":"Colin Berry","site":"shroudstory"},{"title":"Barrie Schwortz on Catholic Radio Indy","post":"PS:  In fact, it’s even easier to explain.\n“Shroud of Turin” is the typical length of phrase one is asked to test, comprising 13 letters. The average score for A=1, B=-2, C=3 etc is 13, the midpoint of the alphanet. So the typical sum for a 13 letter phrase is 13×13 i.e. 169, which becomes 1014 when each score is multiplied by 6 (as per Gematria score system). So one’s now very close to 1128, the difference being a mere 114, or a single letter value of 19 (the letter S!) which is easily remedied by adding or subtracting a letter here or there. \nThe reason it works is because the most and least frequently used letters are fairly random distributed, not bunched together. If instead of ABCDE the English alphabet went ETAOINS etc (ranked by decreasing frequency) then Gematria would not work.\n\n","date":"August 3, 2015 at 3:39 pm","url":"https://shroudstory.com/2015/07/29/barrie-schwortz-on-catholic-radion-indy/","cat":"radio_and_podcasts","id":"comment-207360","author":"Colin Berry","site":"shroudstory"},{"title":"Barrie Schwortz on Catholic Radio Indy","post":"Hello Mr. Colin Berry:  Thanks for replying to my post.  If it was my goal to create reasonable doubt on the other side.  I would take a famous person, such as Tiger Woods for example which equals 810  or another name, place or thing that adds up closer to 1128.  and then find 12 words or phrases associated with that person, place or thing that also equals 810\nExample:\nTiger Woods= 810\nHole in One=\nA golf pro=      \nOr it could be a famous singer\nElvis Presley = 1002\nDon’t be Cruel = ?\nBottom Line:  Should be easy to debunk.  \nIf one can find 12 things that make sense and fit in with that person and equal the same number in the minds of a jury it would likely create reasonable doubt.   They would be thinking “this works with anything”  “This is not a message left behind by the Spirit of God”   “It’s coincidental”  “that lawyer is trying to trick me into believing the Shroud is genuine” \nThese are other things in Gematria that are also noteworthy to mention.\nThe name of Jesus for example = 888 in 3 languages.  Hebrew, Greek and English\nMore 888 Combos  (there are more I did not include to save time and space)\nA Message From God  888\nJesus Messiah   888\nThe Lion of Judah   888\nJesus The King   888\nHe is the Messiah  888\nHe was Scourged 888\nMocked and Crucified  888\nHe is a crucified Man  888\nLaid in a Garden tomb  888\nA clean linen cloth  888\nBurial Shroud  888\nEternal Kingdom 888\nSaved In Jesus  888\nHere are some 666 Combos    (there are more I did not include to save time and space)\n1. Mark of Beast=666\n2. Witchcraft=666\n3. Insanity=666\n4. Slaughter=666\n5. Corrupt=666\n6. Necromancy=666\n7. Demonic Evil=666\n8.Image of Satan=666\n9.Forehead Sign=666\n10.Satan’s Seal=666\n11. Demon Inside=666\n12. Satan’s Hell=666\n13. The Eden Snake=666\nGematria has been around for thousands of years.  The English language has only been around for 550 years.  Therefore the following results in Gematria could not have been fixed or set up by human intelligence. It is either a coincidence that’s a statistical monstrosity or a message from a higher source.  Unlike other modern languages, the English language is the world’s language, to which all others must comply in order to conduct business in the modern world.  If a Higher Power wanted to reach the largest amount of people with a message, the English language would be the one he would use to leave messages behind.\nIt is of my belief that is exactly what was done.  Many centuries ago. \nOn a closing note I want to make it clear I am not posting things like this with the goal of “proving someone wrong”  or out of spitefulness.   I do not want anyone feeling uncomfortable or bad in any way.  Quite the opposite.  I want people feeling good.  Having success in their lives.  Feeling free and happy.  That includes every body.  Skeptic or not.\nEveryone deserves a chance to have a happy, successful and purposeful life.  It is of my belief that can be achieved by one turning their life and will over the care of the Man in The Shroud/Jesus.  To give him a chance before rejecting him as a folklore story.\nNo one wants to come to the end of their life with a “What If?”  “What might have been had I given God a chance in my life”  That said.  May The Holy Spirit of Wisdom and Understanding Rest upon you,  A spirit of power and love eternal.   Amen\n\n","date":"August 3, 2015 at 5:42 pm","url":"https://shroudstory.com/2015/07/29/barrie-schwortz-on-catholic-radion-indy/","cat":"radio_and_podcasts","id":"comment-207362","author":"Dave Hines","site":"shroudstory"},{"title":"Barrie Schwortz on Catholic Radio Indy","post":"http://www.gematrix.org\nDemon Mind Control, The Satanic Bloodline, and Alien Infiltration.\nWell, that explains everything…\n\n","date":"August 3, 2015 at 5:42 am","url":"https://shroudstory.com/2015/07/29/barrie-schwortz-on-catholic-radion-indy/","cat":"radio_and_podcasts","id":"comment-207329","author":"Hugh Farey","site":"shroudstory"},{"title":"Barrie Schwortz on Catholic Radio Indy","post":"Hello Hugh:  I do believe in coincidence and random good luck.   That is based on years of research.  Yes, one could falsely perceive a Higher Power/God is involved in something when in fact it is not.   A single random event or even a few repeating themselves does not add up being to a miracle/message or as being genuine information.  In the same way a single letter or 2 does not make a word.\nBut when a event repeats itself over and over again is where it gets the attention of a forensic detective, as in 7 or more coincidences that point to the same suspect.  In such cases what were initially called “coincidences”  turned out not be coincidence. \nRecall that I wrote\n“I challenge anybody in the world to type in the name of a famous person, place or thing on a English Gematria Calculator and then find 33 other phrases and or words that relate to that person, place or thing and they will all have the same number?!”\nWhere are the other 32 phrases or words that relate to Demon Mind Control that equal 1128?\nWhere are the other 32 phrases or words that relate to Satanic Bloodline that equal 1128?\nWhere are the other 32 phrases or words that relate to Alien Infiltration that equal 1128?\nThose are random events, single letters that do make a complete word or message.\n.  Pieces of a puzzle that do not make a complete picture. \nTo make it easier try and find only 12 other words or phrases under, Demon Mind Control or Alien Infiltration that equal 1128.\nAnd they must have an obvious direct connection.  \nSuch as\nShroud of Turin= 1128\nJesus of Nazareth = 1128\nA Picture of Jesus= 1128\nThe Shroud of the Lord=1128\nA Sacred Winding Sheet=1128\nSon of God 3D Hologram=1128\nNamed Jesus Christ=1128\nThere is no grey area there.   They fit together, like pieces of puzzle that are obviously  connected and go together with ease. \nSatanic Bloodline and Demon Mind Control are related.  Good. Where are the other 31 phrases or words that relate to it?  That is only 2 pieces of a puzzle, 2 letters that do not make a complete word or message.  Random events without meaning.  To be genuine information the following criteria  must be met.\n 1. Statistic (Signal, # of Symbols)\n2. Syntax (Set of Symbols)\n3.Semantics (Meaning)\n4.Pragmatic (Action)  (When Shroud is placed under VP 8 analyzer the “info takes action”)\n5. Apobetic (Purpose) \nWhat you listed does not meet this criteria.  What I listed is much closer to meeting the  criteria for genuine information, The acid test to know if there is a outside intelligence at work or not is this, Does the “info” pass all 5 tests?  If so we can then a make a clear distinction between what is random or not random.  Coincidence or not.  There are still missing pieces of the puzzle that I have not listed.  It is not yet a complete picture.  \nOn a side note, the distance/3D info on Shroud meets/passes all 5 of the requirements to be genuine information.  Not a random letters and meaningless symbols that do make a complete message.  Look at the list.  Shroud passes all 5. Extremely noteworthy. \nYour skills at math are way above average.  You should be able to debunk what I wrote here as not being genuine information with fair ease if is coincidental and random.   But it will take more than just presenting a few random events to do so. \nAnd while doing so, make sure to have some fun doing it!   Enjoy the journey.  \nthanks Hugh for responding,  always a pleasure.\n\n","date":"August 3, 2015 at 1:05 pm","url":"https://shroudstory.com/2015/07/29/barrie-schwortz-on-catholic-radion-indy/","cat":"radio_and_podcasts","id":"comment-207354","author":"Dave Hines","site":"shroudstory"},{"title":"Barrie Schwortz on Catholic Radio Indy","post":"You’re letting yourself be bamboozled by a clever way of demonstrating the Law of Averages Dave. That became quickly obvious to this killjoy sceptic yesterday with that last example of yours (which I took for testing on account of your  “grey area” rider).:\n33. Named Jesus Christ=1128\n(Not much grey area in that last one)\nThe very first test I did was to replace “named” with a word that means the same (“”called”), and guess what? Both “named” and “called” score exactly the same, i.e. 222.\nActually, there’s a bit of luck there, given there’s only 5 versus 6 letters in each.  But the coincidence was sufficient to get me wondering why. \nIt’s nothing to do with the age or importance of a language. It’s mainly to do with having a large number of letters in an alphabet and a fairly random distribution of the least/most frequently used letters. That’s the input from probability and statistics. But there’s another input that is more subtle, one that comes with choice of words for testing the system. By choosing a phrase that has something to do with Christianity, Jesus, the Shroud (pre-Sabbath variety of course, not intended for final interment)  good, evil etc you are ensuring that there’s a rich vocabulary from which to write all those variants for testing.\n You could achieve the same in a more secular way by choosing “The vehicle crashed into the garden wall” and again you have lots of variants, but if you had “He was like a bear with a sore head”  you find you quickly run out of alternative ways of saying it (“she was like a coyote with an itchy paw” doesn’t quite do the business, does it?). The trick for making an impression, especially on the always-open-to-new-ideas super-impressionable,  is to choose a synonym-friendly way  for selling the Gematria message that there’s hidden magic at work in an otherwise boring old world. But there are other ways of making the world less boring – which is not to take everything one reads on trust, and to suss out for oneself how the mind-control fraternity is able get away with their recruitment strategies  through exploiting and weaponizing the oddities of maths and statistics.  I’m trying to think of another more visual example that works like your Gematria, able to subtly ‘sell a magical message’ that reels ’em in by the score, on this site especially.  I shall Pray it comes to me in a minute. Code-X seems to ring a bell.\n\n","date":"August 4, 2015 at 1:01 am","url":"https://shroudstory.com/2015/07/29/barrie-schwortz-on-catholic-radion-indy/","cat":"radio_and_podcasts","id":"comment-207375","author":"Colin Berry","site":"shroudstory"},{"title":"Barrie Schwortz on Catholic Radio Indy","post":"Good Evening Mr. Collins:  Thanks for replying.  You have a very imaginative unique writing style, with a touch of humor as well.   The only thing I am actually selling and promoting is my vacation rental property.  I have some guests coming this week and a ill person I have to attend to so I have to make this response a bit short.   We do not promote any of our videos, on rare occasion they are shared as the one shared on this this site. But that does not increase views being here. People come by attraction not promotion. If we wanted bigger numbers, we could go that route, but we prefer not too. We are against door to door knocking and telemarketing type things. Very much against that.\nThe Gematria display is a take it or leave it type presentation.   I don’t believe there is anything magical about Gematria.  Just letters and numbers.   We try not to get to hung up on any single display.   You mentioned a “mind control fraternity”  I am not exactly sure who that would be in reference too,  but on our channel we are not interested in controlling anyone or recruiting anyone.  We sell nothing.  We do not ask a person to part with any of their hard earned money.  To do so would be against the will of God.  At least for me, I can’t speak for anyone else.  We do not have a Church or Ministry or anything like that.  We ask only that people acknowledge the good works of the Lord Jesus. The Shroud being a witnessing tool only.  Let the Spirit of God take over after that.  Who is also not controlling or domineering but flexible and open minded.  That is based on my personal experience.\nThere are a lot of sick people in the world Mr. Collins doing very unholy and sick things.  Claiming to represent the Lord yet they do not represent him.  Launching attacks against people like you mentioned, I believe you called it a serial browbeater.\nJust so you know not everyone is like that.  In the same way one who is skeptic/sceptic cannot be stereotyped as being __________  It is flat out not true.\nOr one who is pro authenticity for  the Shroud is not a __________.\nWe are all unique individuals with different life paths to follow.  Different destinies.\nA time and a purpose for everything under Heaven.\nOn a closing positive note you are least doing experiments and making a visual presentation with how you believe The Shroud image was formed.  Not many are doing that. We live in a visual age.  People want to see things.   Let them see everything.  Let them see both sides.   Like I said in the beginning, there is a sick person I have to attend too that requires my attention.  I have to go.  Perhaps we will cross paths again in the future sometime.  Peace.  David\n\n","date":"August 4, 2015 at 2:48 am","url":"https://shroudstory.com/2015/07/29/barrie-schwortz-on-catholic-radion-indy/","cat":"radio_and_podcasts","id":"comment-207381","author":"Dave Hines","site":"shroudstory"},{"title":"Barrie Schwortz on Catholic Radio Indy","post":"Thanks Dave for introducing me to Gematria. It’s been interesting (reminding of an even spooker program that appeared on the internet some years ago that seemed able at first sight to be able to read one’s mind, but which I finally sussed – something to do with the properties of multiples of 9 as I recall!).\nOur little conversation has been saved for posterity on my site as well as here (Third entry, Week 32, 2015).\nhttps://shroudofturinwithoutallthehype.wordpress.com/2015/08/03/is-the-shroud-of-turin-really-just-18-years-short-of-its-2000th-birthday-see-this-blog-for-a-daily-acerbic-overview-of-current-wrangling-currently-2015-week-32/\n\n","date":"August 4, 2015 at 3:00 am","url":"https://shroudstory.com/2015/07/29/barrie-schwortz-on-catholic-radion-indy/","cat":"radio_and_podcasts","id":"comment-207383","author":"Colin Berry","site":"shroudstory"}]
