[{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"The title of the book is “Salvation is from the Jews”\nBased on my personal experience of God, this subtitle would have been excellent: “And it is a free gift that has been given to every child of God without exception”\nI have some doubt about the fact that this author believe like me in the universal salvation of all mankind, but nevertheless, that would have made a pretty good subtitle for his book…\n\n","date":"March 27, 2014 at 3:38 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-93948","author":"Yannick Clément","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"I’m in the same camp you’re in Yannick… with one exception, I hope I never get physically beaten to a pulp, crucified, or leave a shroud behind to have to prove this!\n\n","date":"March 28, 2014 at 7:42 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94369","author":"clublu22014","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"\nYannick Clément :\nThe title of the book is “Salvation is from the Jews”\nI have some doubt about the fact that this author believe like me in the universal salvation of all mankind…\n\nHi Yannick,\nnothing substantial to add but wanted you to know that I am also a Christian Universalist. I mentioned that I might have a post regarding the scourge marks and bloodstains on another post, but I think it’s going to be another week or so before I can do that.\n\n","date":"March 28, 2014 at 10:06 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94400","author":"Steve Hammond","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"If one goes to the link below, they can download any of the MP3s on the site.\nhttp://radiomaria.us/audio/salvationfromjews\n\n","date":"March 27, 2014 at 8:56 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94024","author":"Andy","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Thanks Andy!  I will listen to this for sure…  It’s always a pleasure to listen to what Barrie have to say about the Shroud.\n\n","date":"March 28, 2014 at 8:27 am","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94186","author":"Yannick Clément","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Very interesting – especially the information that the VP-8 image analyser was nothing to do with space research and Barrie’s outright rejection of Max Frei’s pollen claims.\n\n","date":"March 28, 2014 at 4:29 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94314","author":"Hugh Farey","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"What would also be very interesting for Barrie to tell versus the VP-8 test is the historical FACT that it was designed by Jackson and Jumper to verify the claim of French historian and Shroud researcher Antoine Legrand (which had altready been confirmed by another French man, Paul Gastineau, with his own 3D experiment PRIOR to Jackson and Jumper VP-8 test) that the Shroud image contained spatial information relative to the body it once covered.  Everytime I hear about the VP-8 test done by Jackson and Jumper, I never hear anything about the fact that it was some French researchers who were the very first to prove the presence of 3D information in the Shroud image…  That’s a total shame…\nEven Jackson agree with Legrand himself that he was the one who proved the presence of 3D information in the Shroud image and that his own VP-8 test was nothing more than an independent confirmation of Paul Gastineau’s experiment.  Would be nice to hear this historical fact whenever the VP-8 test is mention in an interview or in a documentary.\n\n","date":"March 28, 2014 at 4:39 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94318","author":"Yannick Clément","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Yannick ~ Is there information about Paul Gastineau’s work that is reliable I can read?  E-Mail me if there is with a link, please.\n\n","date":"March 29, 2014 at 2:31 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94606","author":"Andy","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Try:http://shroud.com/pdfs/ssi18part3.pdf\nand http://www.shroud.it/LEGRAND2.HTM\n\n","date":"March 29, 2014 at 3:13 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94618","author":"Hugh Farey","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Right, I was rather bemused at Barrie’s frankness about this on air.\n\n","date":"March 28, 2014 at 7:40 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94367","author":"clublu22014","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Really!\n\n","date":"March 28, 2014 at 7:44 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94372","author":"clublu22014","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"The origin of the VP8 is difficult to ascertain. Yannick’s FACT is of course wholly untrue – that it was designed by Jackson and Jumper. Such information as I can find suggests it was made by Interpretation Systems Incorporated (of Lawrence, Kansas), and Barrie in his lecture says it was being used to interpret X-rays in three dimensions. I have seen accounts of it being used in biological analysis, and the interpretatation of aerial photographs of vegetation. \nHe is correct that Paul Gastineau obtained a 3D image of the Shroud face in an extraordinary machine of his own, which converted luminosity directly into depressions carved into a “soft translucent material,” but incorrect to imply that either Gastineau, or his friend Antoine Legrand were “the very first to prove the presence of 3D information in the Shroud image.” That honour appears to belong to Gabriel Quidor, who produced a bas relief from blueprints in 1913. He was French though, Yannick, so that should keep you happy!\n\n","date":"March 28, 2014 at 7:22 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94359","author":"Hugh Farey","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Quidor never was able to prove his assertion…  It was simply a logical supposition he made while analysing Pia’s photographs.  Note:  Barbet and Vignon had the same intuition…  But those researchers were never able to find a way to prove this intuition.\nThat’s why I consider Legrand and Gastineau as being the first that were able to PROVE the 3D properties of the Shroud image.\nAnd concerning the VP-8, I think you didn’t understand correctly what I meant.  I meant that it was Jackson and Jumper (if I remember well) that planed to check out a photo of the Shroud face under the VP-8 in order to confirm Gastineau’s result.  I don’t think I’m wrong about that.\nThe main point I wanted to make is this:  It is simply WRONG to consider Jackson and other STURP members as being the first to have been able to show and prove the presence of 3D properties in the Shroud image, while using a VP-8.  \nThis honor belong to Legrand and his friend Gastineau.  Would be nice if all the English speaking spokesman of the Shroud could acknowledge that and mention it whenever they talk publicly about that.\n\n","date":"March 29, 2014 at 5:15 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94655","author":"Yannick Clément","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"By the way, Antoine Legrand is another historian and Shroud researcher who, despite his belief in the authenticity of the relic, never believe in Wilson’s fantasies about the Shroud’s ancient past in link with the Mandylion…  Interesting note: just like me, Legrand thought that the Shroud was most probably transferred directly from Jerusalem to Constantinople at an unknown date.  And just like me, Paul Vignon and others, Legrand thought that the Mandylion (and all the epithaphios and Christ Pantocrator icons) were man-made artistic creations that were based on the Shroud.  So, here’s for all the people here who cannot admit that Wilson’s idea about the Mandylion can be wrong:  It’s not dramatic for the authenticity of the Shroud that Wilson is effectively off-track versus the Shroud’s ancient past because, in all logic, the Mandylion (which appeared around the 6th century) has been made by someone who had seen the Shroud…  In that regard, the Mandylion is important for the Shroud’s ancient history because, along with the epithaphios and Christ Pantocrator icons, it represent a pretty solid piece of evidence to support the presence of the Shroud at least around the beginning of the 6th century and probably before that time…\n\n","date":"March 29, 2014 at 6:31 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94684","author":"Yannick Clément","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Precision concerning my comment above:  I said that, in all logic, the Mandylion was created by someone who have seen the Shroud.  I went a bit too far here…  Let’s say that it is a true possibility.  Another one is that it was based on the Pantocrator icons, which could well have been created at first by someone who had seen the Shroud.\nIn other words, to me, both the Mandylion and the Pantocrator icons (along with the epitaphios) are artistic creations that were all based directly or indirectly on the Shroud image and that’s a pretty important piece of evidence to support the presence of the Shroud in the East from at least the beginning of the 6th century.  In fact, to me, those artistic creations of Jesus face support the idea that it was around that time that the Shroud first came out of his hidden place and became known of some people (probably some members of the orthodox clergy).\n\n","date":"March 29, 2014 at 6:49 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94694","author":"Yannick Clément","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"The VP-8 was purchased by William Mottern of Sandia Laboratories from Interpretation Systems to use in the examination of the x-rays they were making at the lab. Bill felt it was another way to extract image data from nearly monochromatic x-rays. He originally saw the VP-8 advertised in a trade journal and bought one. Shortly after the Shroud image was placed into Bill’s VP-8, Jackson and Jumper purchased one for STURP’s use and the man who came to install it was Pete Schumacher, founder of the New Mexico Shroud Museum in Alamogordo.\nTwo of our team members were from the Jet Propulsion Laboratory and were directly involved in the space program. Don Lynn was in charge of imaging on the Voyager, Viking, Mariner and Galileo projects. At some point in time, some journalist out there wrote erroneously that the VP-8 was used in the space program and it seems to have stuck and become part of Shroud “mythology.” JPL had far more sophisticated technology than the VP-8.\nAs for Frei, his work can only be considered anecdotal at best and is not supported by any peer reviewed science. There is a lot more I could say about this, but this post is already longer than I like, so we’ll just leave it there for now.\n\n","date":"March 28, 2014 at 7:59 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94375","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"As for Frei, his work can only be considered anecdotal at best and is not supported by any peer reviewed science. There is a lot more I could say about this, but this post is already longer than I like, so we’ll just leave it there for now.\nBarrie.\nWith highest respect to your efforts, but after reading ObliczePrawdy/Essence of Truth – A Jewish Man Investigates the Shroud of Turin I am under impression that some of the former STURP members, including you, Ray Rogers, and a few others, feel like if they had been the only ones who had been given the privilege to study the Shroud, and thus the right to denounce the results of other researchers, who were not members of the STURP. For example Frei. His results had been controversial, one must admit, but I don’t think wothless. They have been at least partially confirmed by Baruch and Danin (with whom later  Litt disagreed, but that’s another story).\nAlthough I have the STURP efforts in highest esteem, I am highly disgusted with sometimes arrogant attittude of some of its former member. Frei was not the member of the STURP- so he must be condemned indiscriminately. For the principle. You are not in the STURP -so you have no right to speak authoritatively about the Shroud. Period.\n\n","date":"March 29, 2014 at 7:09 am","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94497","author":"O.K.","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"O.O.\n\n","date":"March 29, 2014 at 7:56 am","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94505","author":"clublu22014","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"I never said that Frei’s work was worthless. I only stated that his claims were not backed up by peer reviewed science or published in any credible journals, making them anecdotal at best. This was not an attack on Frei but simply a statement of fact. It has NOTHING to do with whether or not he was a member of STURP. Sadly, it was Frei’s own actions, both during and after the 1978 examination, that led to doubts about his methods and conclusions. \nAs an example, for many years those of us who lectured on the Shroud used a 35mm slide in our presentations that Frei himself had provided to us, claiming it was a scanning electron microscope image of a pollen he found on the Shroud. It wasn’t until several years later that we found out it was in fact a reference slide and not a pollen from the Shroud at all. It was then that many of us stopped discussing the pollen issue publicly and removed it from our presentations. I believed then as I do now, that there is plenty of other credible empirical evidence for the Shroud’s authenticity within the published scientific literature and we should not have to resort to unsupported anecdotal evidence to make our points. \nIt is easy to accept and defend information that supports our personal beliefs whether it is credible or not, and ALL of us are susceptible to such errors in judgement. Unfortunately, this happens all too frequently in the Shroud world and has the negative side effect of making all Shroud science seem suspect while giving plenty of ammunition to the skeptics out there to attack us. Sorry you were offended O.K. but the truth is the truth (not arrogance). Remember, it was my responsibility to observe and document these events as they occurred.\n\n","date":"March 29, 2014 at 5:51 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94668","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Just to clarify Barrie’s comment on one point, as Pete Schumacher tells it, the VP8 was donated by Interpretation Systems to Jackson & Jumper for their work.  I’m fairly sure they didn’t have the $25k it would take to purchase it then.  Pete agreed to deliver and install it if the company would pay for the gas.  This was Pete’s introduction to the Shroud and he had no knowledge prior to seeing the 3D green screen image in Jumper’s basement.  He knew the VP8 did not do 3D, but made brightness maps as one of its functions.\n\n","date":"March 29, 2014 at 2:38 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94611","author":"Andy","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"\nO.K. :\nAs for Frei, his work can only be considered anecdotal at best and is not supported by any peer reviewed science. There is a lot more I could say about this, but this post is already\nlonger than I like, so we’ll just leave it there for now.\nBarrie.\nWith highest respect to your efforts, but after reading ObliczePrawdy/Essence of Truth – A Jewish Man Investigates the Shroud of Turin I am under impression that some of the former STURP members, including you, Ray Rogers, and a few others, feel like if they had been the only ones who had been given the privilege to study the Shroud, and thus the right to denounce the results of other researchers, who were not members of the STURP. For example Frei. His results had been controversial, one must admit, but I don’t think wothless. They have been at least partially confirmed by Baruch and Danin (with whom later  Litt disagreed, but that’s another story).\nAlthough I have the STURP efforts in highest esteem, I am highly disgusted with sometimes arrogant attittude of some of its former member. Frei was not the member of the STURP- so he must be condemned indiscriminately. For the principle. You are not in the STURP -so you have no right to speak authoritatively about the Shroud. Period.\n\nTime out.  Where have things gone when Barrie Schwortz is to be impeached on charges of indiscriminate condemnation and having no right to speak?  Many others express this right.  Pound for pound, Barrie Schwortz is one of the most balanced & objective members of the Shroud crowd.  Replay the interview-scientific principles: yes; ad hominem: no.  No low blows occurred.\n\n","date":"March 29, 2014 at 9:04 am","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94522","author":"Kelly Kearse","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Time out. Where have things gone when Barrie Schwortz is to be impeached on charges of indiscriminate condemnation and having no right to speak? \nWho said he has no right to speak? He has a right to speak and defend his views, just as I have the right to criticize some of them.\nBarrie Schwortz is one of the most balanced & objective members of the Shroud crowd.\nNo doubt. But even he, in my opinion is wrong sometimes. Not very often, but there are some things where I deeply disagree with him. \nBut the matter is more general, and does not concern only Barrie. I have observed several instances when some STURP members feel they are the only ones who performed scientific examinations of the Shroud -and all the claims coming outside the STURP circle must be dismissed. Such attitude that if not one of ours, then he/she definetly must wrong. Frei is just one example of that.\n\n","date":"March 29, 2014 at 10:13 am","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94538","author":"O.K.","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"O.K.  You take great leaps in your comments.  Using words like “denounce, worthless, and condemned indiscriminately”  to describe S.T.U.R.P. views of other researchers (Max Frei) amount to nothing more than emotional hooey.  I know of a Jewish man who has investigated the Shroud.  His name is Barrie Schwortz and he has as much authority to speak on the Shroud as anyone in the world.  You may disagree with him or other members of S.T.U.R.P.  However, to proclaim your disgust with arrogant attitudes of former members is worthless diatribe.  Keep your comments civil and respectful…and don’t ascribe your views to reflect those with whom you may disagree.\n\n","date":"March 29, 2014 at 9:53 am","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94533","author":"David O.","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Who said he has no right to speak? \nI believe you did.  As in ” You are not in the STURP -so you have no right to speak authoritatively about the Shroud. Period.”\nPardon for omitting the word “authoritatively” and the afterwords “Period”.  I was paraphrasing to save space. Nothing more to add.\n\n","date":"March 29, 2014 at 11:05 am","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94549","author":"Kelly Kearse","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Misunderstanding. ” You are not in the STURP -so you have no right to speak authoritatively about the Shroud. Period.” -This is the attitude I criticize. I sense that some STURP members feel, or felt that they have the monopoly on the scientific knowledge about the Shroud. They don’t, but the myth that the STURP was the first/the only team that scientifically examined the Shroud (forget the research in 1969, 1973, 1988 and 2002) is still widespread.\nAnd besides much of the research was and is being performed without the physical contact with the Shroud, or any samples derived from it.\n\n","date":"March 29, 2014 at 11:10 am","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94552","author":"O.K.","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"“You” was not directed towards Barrie, but towards any Shroud researcher outside the STURP (Frei, Marion, Flury-Lemberg are just examples). STURP sometimes  presents “we know better” attitude, which I very dislike.\n\n","date":"March 29, 2014 at 11:17 am","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94554","author":"O.K.","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"OK, O.K.  I understand now about the usage of “You”.  I still find the rest a bit harsh.  I have never picked up on the we know better attitude-in fact, in my own experience, just the opposite.  I contacted Barrie several years ago, among others, when I first heard the “all old blood types as AB” mantra, also the extension to human classification of the blood-I found a very objective, very helpful attitude.\n\n","date":"March 29, 2014 at 11:33 am","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94558","author":"Kelly Kearse","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Kelly, if I may just put an example. See Ray Rogers’ FAQ:\nhttp://www.shroud.com/pdfs/rogers5faqs.pdf\nThe question two: 2) How do you know that there is real blood on the Shroud?\nRogers wrote: Several claims have been made that the blood has b\neen found to be type AB, and claims have been made about DNA testing. We sent blood flecks to the laboratory devoted to the study of ancient blood at the State University of New York. None of these claims could be confirmed. […] It is almost certain that the blood spots are blood, but no definitive statements can be made about its nature or provenience, i.e., whether it is male and from the Near East. \nand further about aloe and myrrh: Biblical accounts suggested several types of compounds that might have appeared on the cloth (e.g., aloes, myrrh, sebaceous secretions, etc.). We planned and executed chemical analytical methods that could detect them in 1978. Those methods were extremely sensitive, but they did not detect squalene or myrrh. These results could have been confirmed by additional tests on the Shroud, but the “restoration” has totally changed the Shroud’s surface.\nMay I ask: was Rogers even aware about Baima-Bollone’s existence?\nAnd what about insinuations in the style of: A suspicious person might wonder whether the “restoration” was rushed through to prevent ethical work on confirming both chemical and pollen observations. (still from Rogers’ FAQ). No low blows, really?\nSuch arguments are repeated in one place of the Barrie’s nterview with Górny -and I find them distasteful.\n\n","date":"March 29, 2014 at 11:42 am","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94562","author":"O.K.","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"\nO.K. :\nKelly, if I may just put an example. See Ray Rogers’ FAQ:\nhttp://www.shroud.com/pdfs/rogers5faqs.pdf\nThe question two: 2) How do you know that there is real blood on the Shroud?\nRogers wrote: Several claims have been made that the blood has b\neen found to be type AB, and claims have been made about DNA testing. We sent blood flecks to the laboratory devoted to the study of ancient blood at the State University of New York. None of these claims could be confirmed. […] It is almost certain that the blood spots are blood, but no definitive statements can be made about its nature or provenience, i.e., whether it is male and from the Near East.\nand further about aloe and myrrh: Biblical accounts suggested several types of compounds that might have appeared on the cloth (e.g., aloes, myrrh, sebaceous secretions, etc.). We planned and executed chemical analytical methods that could detect them in 1978. Those methods were extremely sensitive, but they did not detect squalene or myrrh. These results could have been confirmed by additional tests on the Shroud, but the “restoration” has totally changed the Shroud’s surface.\nMay I ask: was Rogers even aware about Baima-Bollone’s existence?\nAnd what about insinuations in the style of: A suspicious person might wonder whether the “restoration” was rushed through to prevent ethical work on confirming both chemical and pollen observations. (still from Rogers’ FAQ). No low blows, really?\nSuch arguments are repeated in one place of the Barrie’s nterview with Górny -and I find them distasteful.\n\nI don’t really see a problem with any of that, but that’s within the realm of opinion.  Maybe there should have been a cage match.  \nThe aloe & myrrh bit I have written about before; two different techniques were used, unless the same section of cloth was divided in half & evaluated, who knows?  Maybe.  Maybe not.   \nRegarding the multiple use of the word “claim”, I don’t pretend to speak for anyone else, but this may refer to the fact that neither the typing studies nor any DNA results (as far as I am aware) have ever been published in a formal, peer-reviewed journal.  This is a difference between much of STURP’s findings and those in discussion.  One could argue that STURP’s findings were more mainstream in the scientific community.  I don’t personally believe this automatically devalues the results of anyone else (non-STURP or otherwise), but consider this from the view of bench top scientists in the non-Shroud world, outside looking in. This is a criticism that will always be present in any type of Shroud-related matter.      \nNo further comment from me on the restoration-it was done, it’s over.  It’s 2014.\n\n","date":"March 29, 2014 at 12:31 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94578","author":"Kelly Kearse","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"It’s not about difference in techniques or results. It’s about ignorance. For Rogers, the Baima-Bollone’s results simply do not exist. Ignorance, or dellibarate omission? Anyway this gives bad impression about how one group of researchers perceives the others. That’s the problem. Lack of mutual respect, and inter-factional wars and animosites in the Shroud community. If you are not one of ours, your results does not deserve mention or should be portrayed in negative light.\n\n","date":"March 29, 2014 at 1:05 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94584","author":"O.K.","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"OK: “That’s the problem. Lack of mutual respect, and inter-factional wars and animosites in the Shroud community.”\nThat’s true. But the truth is that at the time (1978-1980) some people in Turin never wished to work with the STURP. For them, the Shroud was their own property.\nI have Gonella’s  archives. Gonella himself complained about the attitude of some people in Turin.\nJust an example. In 1980, STURP and Rogers asked Gonella the Raes sample for scientific studies. Gonella agreed but somebody in Turin said :no.\nAt the end, Card. Ballestrero ordered to send some threads to Rogers. That’s why Rogers only received some threads from the Raes sample rather than the entire sample. It seems to me that Rogers himself did not know that.\nThe studies of Baima Bollone are certainly interesting.\nThe problem is that he never (to my knowledge) published his discoveries in peer-reviewed journals, contrary to STURP policy.\nPerhaps you know better understand STURP’s attitude.\n\n","date":"March 29, 2014 at 4:49 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94646","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"OK: “That’s the problem. Lack of mutual respect, and inter-factional wars and animosites in the Shroud community.”\nReply: I think another important problem that pollute the sindonology community is the religious bias of many members…  Once you mix religion with science, you walk in a very dangerous territory.\n\n","date":"March 29, 2014 at 5:45 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94663","author":"Yannick Clément","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"To summarize my previous post that you can find above this one, I would say this:  It is a very good thing for a religion to take good note of the scientific discoveries in order to learn better God’s creation, but it is a very bad thing if science let religious beliefs interfered into its quest for a better knowledge of our material world.  Sadly, this bad thing has happened a lot of times in sindonology…\n\n","date":"March 30, 2014 at 6:03 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94999","author":"Yannick Clément","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"And concerning what I just say above, I think this truth has never been understood better by a religion than modern Catholicism, even though it took a lot of time to get there (and things could still get better at times)…\n\n","date":"March 30, 2014 at 6:07 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-95001","author":"Yannick Clément","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"I am deeply disturbed by Barrie’s comments on Max Frei’s work on Shroud pollens.  Frei was founder and director for 25 years of the scientific department of the Zurich Criminal Police.  Presumably his services were extensively and frequently used to secure criminal convictions in all of that time. His services had also been used for criminal work in Turin, when he was asked to notarise the 1973 shroud photography. His basic training was in botany. May we not assume that the techniques he used in retrieving and identifying pollens from the Shroud would not be too different from his practice in his criminal cases. \nScientific standards and protocols may be refined, improved and made more rigorous in the course of time.  Would not Frei be following the protocols he had developed during the course of his criminal work and accepted as good practice at the time. Does the criticism arise from measuring the standard of his work against a more recent and different standard? \nIn his 2010 book, Wilson tabulates a full-page detailed catalogue of 58 pollens identified by Frei, adapted from a posthumous work on Frei’s behalf by Professor Heinrich Pfeiffer. Further charts were publised by Dr Werner Bulst. Professors Danin & Baruch identified 91 species of thornbush exclusive to the Middle East. Dr Thomas Litt criticised the Danin/Baruch work as it appears that Baruch had not removed the pollens from the tapes to ensure accuracy of identification as apparently Frei had done. It was only at that stage that Danin disowned Baruch’s work. \nI now find it perplexing that Frei’s own work should be brought under a cloud.  What is the nature and source of the criticism, and how robust is this criticism? \nIt is vital that this matter be resolved. Otherwise Frei’s pollen samples are persuasive evidence that the Shroud during its history has at various times been in Southern Israel, in Jerusalem during March-April (Passover), and in Anatolia, as well as Western Europe. Is it now being stated that this can no longer be asserted with the same rigour as it has been previously?\n\n","date":"March 29, 2014 at 3:55 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94628","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"A fair question! Does anyone know what the pollen contamination of other ancient linens is like? I would think that the Shroud would indeed be laden with pollen, it is merely a question of from where and how might it have found its way there.\nI wonder if sometimes we aren’t guilty of being too quick to dismiss evidence that may appear to be ‘too good to be true’ — so as not to appear biased for authenticity. Having pollen on that linen that may point quite directly to authenticity certainly tempts the ‘too good to be true’ reflex. If confirmation bias is a danger, so too reverse-confirmation bias.\nFrei’s work may not be definitive, but making it ‘inadmissible’ is a mistake.\n\n","date":"March 29, 2014 at 4:16 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94634","author":"David Goulet","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Dave, sad to say, but I am under impression that this is the aftermath of some vindictive attitude of STURP towards Frei. He, using ordinary sticky tape, obtained 300 or so pollens from the Shroud surface, if I recall correctly, while STURP, using their sophisticated pressure-regulated tapes obtained only a single specimen. So the envy of the STURP is nothing surprising… See for example Barrie’s presentation from Valencia conference: http://www.shroud.com/pdfs/schwortzv.pdf  The description of Frei’s is just one cry that he made the Shroud dirty, and complains about strains to the cloth.\nBut who cares about pollen and results?\nSorry, but I don’t want to beat around the bush. Dave, don’t care about Barrie’s opinion towards Frei.\n\n","date":"March 29, 2014 at 4:08 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94632","author":"O.K.","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"It is a great pity that Max Frei died before he was able to respond to the criticisms of his work, but criticisms there are, and perfectly valid ones at that. Some of the most serious are:\n1) Few pollens can identified to species level even today. To identify 58 is wholly incredible.\n2) Most of the pollens Max Frei identified on the Shroud are from insect-pollinated plants, whose pollen does not drift through the air and does not fall on sheets.\n3) Frei claimed that he had identified his pollens by looking at them through a scanning electron microscope. He implied that the photomicrographs with which he illustrated his article in Shroud Spectrum International were from these studies. They are not, and have been identified as stock identification photos. Neither SEM photos of Shroud pollen, nor any of the specially prepared (gold-plated) slides which were required for making them, have been seen or heard of again.\nI don’t think Barrie was unkind or vindictive in his rejection of Frei’s work as valid, but until these points are clarified or explained, I cannot but agree with him. A full analysis of all his findings, and how they relate to the findings of Danin, Baruch, Litt et al. has been prepared for the next BSTS Newsletter.\n\n","date":"March 29, 2014 at 4:28 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94638","author":"Hugh Farey","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"I don’t think Barrie was unkind or vindictive in his rejection of Frei’s work as valid, but until these points are clarified or explained, I cannot but agree with him.\nAt first, I hardly believe that Barrie is authorative in that area. It is not up to him to decide whether Frei’s results are valid or not. \nA full analysis of all his findings, and how they relate to the findings of Danin, Baruch, Litt et al. has been prepared for the next BSTS Newsletter.\nFine. Just from the sceptical point of view, or from more balanced?\nHugh, have you seen this: https://www.academia.edu/1536346/The_question_of_pollen_grains_on_the_Shroud_of_Turin_and_the_Sudarium_of_Oviedo ?\n\n","date":"March 29, 2014 at 4:39 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94644","author":"O.K.","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Thanks OK. Yes I am familiar with Marinelli’s article. However it does not deal with the points raised above, which, in the absence of explanation, continue to cast doubt on Frei’s reliability. Neither Barrie nor I need to be palynologists to raise these difficulties – maybe someone does need to be one to settle them.\n\n","date":"March 29, 2014 at 6:49 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94695","author":"Hugh Farey","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"O.K. Professor Danin still stands by what he says and has defended Uri Baruch even after what I wrote in the introduction of the interview article:\nhttp://holyshroudguild.org/uploads/2/7/1/7/2717873/science_and_religion_meet_in_shroud_research-1.pdf\nSo far there has been no result and I was given to understand that it it was Professor Litt who had not done his homework and it does not look like he is interested in doing so.\nRogers was a chemist, not a palynologist, and he has been subject to attack on this very blog because his peer-reviewed papers were published in a journal owned by him. What is the big deal anyway since peer review does not mean that what is stated in a a paper is gospel truth, only that it merits consideration? Money is also sometimes involved in publishing in a peer-reviewed journal and not all of them merit attention.\nWhen it comes to newsletters, matters become worse, and they have published a lot of rubbish and refused to accept opinions that have challenged what they chose to publish.\nI think you have a clear picture of what is going on, since you mention it in #8.\n\n","date":"March 29, 2014 at 6:17 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94676","author":"Louis","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Rogers did not own the journal. He was simply one of its founding members but retired from any involvement with it years before he submitted his paper to it for publication. The editors spent 5 months (much longer than normal) reviewing Rogers’ paper and asking for changes and corrections before accepting it for publication.\n\n","date":"March 29, 2014 at 6:23 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94682","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Hello Barrie: It has NOTHING to do with whether or not he was a member of STURP. Sadly, it was Frei’s own actions, both during and after the 1978 examination, that led to doubts about his methods and conclusions.\nThe problem is, as I see that in when describing Frei’s efforts in your work, there is too much concentration on how “unproffesional” (in yours, and your STURP coleagues) the behaviour of Frei was. So the most important are complains that his tapes left glue residues on the Shroud, that he caused considerable strain on the cloth etc. Only the negative (in your view) aspects of his work. Well, there are two sides of the medal -perhaps he knew what was he doing, and what methods he considered appropriate for his work. One should also remember that he was present during 1973 examination, so contrary to STURP team, he had an experience with the Shroud. \nThere are other aspects with which I disagree. The opinion voiced by you in the interview with Górny regarding 2002 restoration was the point I disliked most. No matter how controversial the restoration was, the accusatory pronouncement, full of (sometimes absurd) charges, verging on the insinuations towards Turin was really disgusting. But I suppose it only reflects the attitude of some American (and not only) researchers, who, when not granted access to the Shroud, were spreading innuendoes towards Turin that for some purpose it wanted to “destroy” the Shroud.\nAnd at last -well the matter of pareidolia, particularly about the claims of the inscriptions claimed on the Shroud. While certainly being controversial, I think that this problem is too easily dismissed by several Shroud researchers, including you, Barrie. In my opinion, the pareidolia is often used as an easy and convenient excuse to put the matter aside, without giving it the proper and balanced assesment.\nIt is easy to accept and defend information that supports our personal beliefs whether it is credible or not, and ALL of us are susceptible to such errors in judgement. \nI agree. We are all susceptible. Both you and I and everyone else on this forum or anywhere.\n\n","date":"March 29, 2014 at 6:30 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94683","author":"O.K.","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Quote: “There are other aspects with which I disagree. The opinion voiced by you in the interview with Górny regarding 2002 restoration was the point I disliked most. No matter how controversial the restoration was, the accusatory pronouncement, full of (sometimes absurd) charges, verging on the insinuations towards Turin was really disgusting. But I suppose it only reflects the attitude of some American (and not only) researchers, who, when not granted access to the Shroud, were spreading innuendoes towards Turin that for some purpose it wanted to “destroy” the Shroud.”\nComment:  I have read the book of Meacham “The Rape of the Turin Shroud” and I was not impress by most of his argument against the 2002 restoration… I have to agree with you to some extend: I really don’t think the 2002 restoration was as terrible as some American researchers wanted to make believe (Meacham and others) and I agree that most of this controversy came from a feeling of jealousy on their part because they have been left out of the restoration operations…\n\n","date":"March 29, 2014 at 6:37 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94687","author":"Yannick Clément","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"To balance my last comment, I must also say that, if we believe Meacham’s testimony, the reactions some Shroud researchers had at the 2002 restoration press conference in Turin (if you want names, read Meacham’s book), where they accepted almost blindly everything that had been done on the relic in order to stay in good terms with the Turin authorities (and maybe obtain some favors from them in the future) is as ugly as those who wanted to make belief the restoration was a total disaster for the future of Shroud research.\n\n","date":"March 29, 2014 at 6:41 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94690","author":"Yannick Clément","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Yes, but, Frei’s finding were published on his behalf by Professor Heinrich Pfeiffer. The list was corroborated by Ian Wilson and is present in his most recent book which I’ll provide here:\n“Plant pollens corresponding to the Shroud’s historically definite travels around western Europe and the western Mediterranean\n1 Varieties best known under their everyday names           Rice (Oryza sativa L.)\nAnemone (Anemone coronaria L.)                                      Rock rose (Cistus creticus L.)\nBeech (Fagus silvatica)                                                      Rush (Scirpus triquetrus L.)\nCastor-oil plant (Ricinus communis L.)                               Rye (Secale spec.)\nCedar of Lebanon (Cedrus libanotica Lk.)             Spina Christi (Palinurus Spina-Christi Mill.)\nCypress (Cupressus sempervirens L.)                   Thistle (Carduus personata Jacq.)\nHazel (Corylus avellana L.)                                      Yew (Taxus baccata L.)\nJuniper (Juniperus oxycerdus L.)\nLaurel (Laurus nobilis L.)\nLove-lies-bleeding (Amaranthus lividus L.)\nOriental plane tree (Plantanus orientalis L.)\nPine (Pinus halepensis L.)\nPistacia (Pistacia halepenis L. & Pistacia lentiscus L.)\n2 Other varieties\nAlnus glutinosa Vill.\nCapparis spec.\nCarpinus betulus L.\nLythrum salicaria L.\nPhyllirea angustifolia L.\nPosterium spinosium L.\nRidolfia segetum moris\nPlant pollens indicative of the Shroud at some time in its history having been in Near Eastern environs, particularly Anatolia and Israel\n1 Varieties found in Desert and semi-desert   4 Varieties found in salty environs,\nterrain                                                                particularly the Dead sea\nAcacia (Acacia albida Del.)                                 Althea officinalis L.\nArtemsia herba-alba A.                                       Anabasis aphylla L.\nAtraphaxis spinosa L.                                         Gundelia tourneforti L.\nHaplophyllum tuberculatum J.                             Haloxylon persicum Bg.\nHelianthemum versicarium B.                              Prosopis farcta Machr.\nOligomejus subulata Boiss.                                 Reaumaria hirtella J. & Sp.\nPeganum harmala L.                                           Suaeda aegyptiaca Zoh.\nPteranthus dichotomus Forsk.                            Tamarix nilotica Bunge\nScabiosa prolifera L.\n2 Varieties found in steppe type terrain,          5 Varieties particularly typical of the\nas in eastern Turkey and southern Israel            environs of Jerusalem\nGlaucinum grandiflorum                                       Bassia muricata Asch.\nHyoscyamus reticulatus L.                                    Echinops glaberrimus DC\nIxiolirion montanum Herb.                                      Fagonia mollis Del.\nLinum mucronatum Bert.                                       Hyoscyamus aureus L.\nRoemaria hybrida (L.) DC                                     Onosma syriacum Labil\nSilene conoida L.                                                  Zygophylllum dumosum B.”\n3 Varieties particularly typical of\nAnatolian (Turkish) environs\nEpimedinum pubigerum DC\nPrunus spartiodes Spach.                                   \nAnyways, I’m not inclined to banish Frei’s pollen findings to the realm of “Shroud Apocrypha”.\n\n","date":"March 29, 2014 at 6:50 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94696","author":"Psuedonym","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"The posting got squashed, sorry.\n\n","date":"March 29, 2014 at 7:08 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94705","author":"Psuedonym","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Thanks, Psuedonym, but a mere list of plants means very little. Let’s look at the top two flowers in your list, Anemone coronaria and Cistus creticus. These are both brightly coloured insect-pollinated plants whose pollen is not released into the air, but must be collected, and delivered, by insects. It cannot have drifted onto the Shroud. Their pollen is not identifiable at species level anyway. These are serious anomalies in Max Frei’s findings, and must be explained.\n\n","date":"March 29, 2014 at 7:17 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94708","author":"Hugh Farey","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Hugh, insect pollination doesn’t shake the pollen evidence. Insect pollinated flowers, as you mentioned, are brightly coloured and may have been laid on the shroud during burial or orthodox liturgical ceremonies. Furthermore, pollen is resistance to decay and have been used to identify plant species on Egyptian mummies, much older than the shroud.\n\n","date":"March 29, 2014 at 7:32 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94713","author":"Mike M","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Sadly, as I will show, some 10% of Frei’s insect pollinated species of plant flower in the autumn, and others are not native to Jerusalem. Attempts to explain the distribution of insect-borne pollen by a frantic collection of widely scattered flowers to lay on the Shroud on the Friday afternoon of the crucifixion  stretch credibility. It is also interesting that the people who have identified the imprints of flowers on the shroud do not find that their lists coincide with Frei’s findings. Avinoam Danin, for example, decribes how on the right side of the face and across the brow, “there is an almost continuous carpet of flowers […] most similar in shape and size to flowering heads of Matricaria recutita or Anthemis bornmuelleri.” The pollen of neither of these flowers was among those identified by Max Frei. The anomalies remain.\n\n","date":"March 29, 2014 at 7:45 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94719","author":"Hugh Farey","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"I think a 10% margin of error is not unheard of. You have already, many times (rightly so) expressed the ridiculousness of the flower images claim, you can’t use it now, when its convenient, to discredit the pollen evidence.\n\n","date":"March 29, 2014 at 8:12 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94734","author":"Mike M","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Max Frei had placed his sample on “sticky tapes” and then placed the individual tapes on glass slides. Then, the man marked the slides with a number and letter group such\nas 2bd, 4bd, and so on. \nIn a broad look at the items present on the samples\nthere are FLOWER PARTS (my emphasis), bugs, cotton fibers, modern synthetic fibers and old\nwool fibers.\nIf the same flowers are indeed Matricaria recutita and Anthemis bornmuelleri, then the anomaly is inexplicable\n\n","date":"March 29, 2014 at 8:25 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94736","author":"Psuedonym","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"My single biggest objection to the 2002 restoration was the fact that NO scientists were involved. It didn’t matter one bit whether they were American, Italian, French or otherwise (and there were plenty of good ones available in Italy). Is no one else concerned that for 12 years a completely untested piece of cloth has been fastened to the back of the Shroud? Let’s not turn this into an issue of nationalism. It is not about that!\n\n","date":"March 29, 2014 at 6:51 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94697","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Well Barrie, that means you does not consider Mme Flury-Lemberg a scientist… Truly, I don’t know any other names  who took part in 2002 restoration, but I hardly believe they were random people picked from the entrance of the pub.\nAnd accusations that the Shroud image on the Shroud has faded since the restoration, because they attached a light backing cloth to it (thus smaller contrast with the background)… well this is ridiculous!\n\n","date":"March 29, 2014 at 6:59 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94701","author":"O.K.","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Perhaps the Polish translation of the interviews I gave Gorny in English are incorrect. I never said the image had faded. I said that the lighter cloth behind the Shroud lowered the APPARENT CONTRAST of the image. That is completely different and something that professional photographers know about. Did you see the Shroud in 2010? Have you compared the Durante post-restoration images with those of Vern Miller or myself? The evidence speaks for itself.\nIt sounds like I am going to have to carefully examine the English version of the book to make sure it is accurate before it is released to the public. Thanks for the heads up O.K.\n\n","date":"March 29, 2014 at 8:03 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94728","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"I agree 100% concerning the nationalism issue.  But the truth remains that many Shroud researchers were jealous because they were not part of the operation.  And concerning the idea that there were no scientist involved during the 2002 restoration, I think it’s partially wrong Barrie, in the sense that Baima Bollone was present there and, prior to the 2002 restoration, Al Adler was an important member of the restoration committee and their main scientific adviser who took part in the design of  their restoration protocol.\n\n","date":"March 29, 2014 at 7:02 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94703","author":"Yannick Clément","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Thanks OK. Yes I am familiar with Marinelli’s article. However it does not deal with the points raised above, which, in the absence of explanation, continue to cast doubt on Frei’s reliability. Neither Barrie nor I need to be palynologists to raise these difficulties – maybe someone does need to be one to settle them.\nBut Hugh, can we at least dismiss the accusations of fraud towards Frei?\n\n","date":"March 29, 2014 at 6:52 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94698","author":"O.K.","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"The assertion that most of Frei’s findings of pollen were of insect-pollinated plants and not wind pollinated plants would seem to be irrelevant, and that most pollens cannot be identified even today would seem to be incorrect. \nExtract from Encyc Brit article on pollen:\n“Because of their remarkably symmetrical structure and surface patterns, pollen grains are readily recognizable under the microscope. The structure of the wall of a pollen grain is oftentimes so characteristic that in some cases species may be identified by pollen grains alone. On the other hand, there are cases in which pollen grains of very like structure occur in quite unrelated plant families.\nBecause of their high resistance to decay, their widespread dispersal by wind and water, and their abundant production by plants, pollen grains are very common constituents of geologic sediments, both recent and ancient. Because of these features pollen grains have provided much information on the origin and geologic history of terrestrial plant life.\nPollen is produced in such quantities that it is a significant component of the airborne constituents of the Earth’s atmosphere, especially in areas over continents.” Etc … \nThe criticism of Frei’s work would seem to be ill-founded, to express it kindly!\n\n","date":"March 29, 2014 at 7:03 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94704","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"The problem is general reliability of palynology, not just the Frei’s identification.\nFrei identified some pollens of the spiecies gundelia tournefortii\nDanin and Baruch claimed that 91 out of 313 pllens were gundelia tournefortii\nLitt claimed that with the high probability it is not gundelia tournefortii but carduus.\nMarzia Boi claimed that alleged gundelia tournefortii is actually helichrysum\nSo one can shout: WTF, how much value has the whole pollen examination? Every palynologist says different things about the very same pollen! \nSo if you are a criminal, and have been convicted by pollen evidence -invoke the casus of the Shroud. Maybe they will have to release you from jail.\n\n","date":"March 29, 2014 at 7:12 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94707","author":"O.K.","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"(Reposted)”Plant pollens indicative of the Shroud at some time in its history having been in Near Eastern environs, particularly Anatolia and Israel\n1 Varieties found in desert and semi-desert\nterrain\nAcacia (Acacia albida Del.)\nArtemisia herba-alba A.\nHaplophyllum tuberculatum J.\nHelianthemum versicarium B.\nOligomejus subulata Boiss.\nPeganum harmala L.\nPteranthus dichotomus Forsk.\nScabiosa prolifera L.\n2 Varieties found in steppe type terrain,\nas in eastern Turkey and Southern Israel\nGlaucium grandiflorum\nHysocyamus reticulatus\nIxiolirion montanum Herb.\nLinum mucronatum Bert.\nRoemaria hybrida (L.) DC\nSilene conoida L.\n3 Varieties particularly typical of\nAnatolian (Turkish) environs\nEpimedium pubigerum DC\nPrunus spartiodes Spach\n4 Varieties found in salty environs,\nparticularly the Dead Sea\nAlthea officinalis L.\nAnabasis aphylla L.\nGunedelia tournefortii L.\nHaloxylon persicum Bg.\nProsopis farcta Machr.\nReaumaria hirtella J. & Sp.\nSuaeda aegyptiaca Zoh.\nTamarix nilotica Bunge\n5 Varieties particularly typical of the\nenvirons of Jerusalem\nBassia muricata Asch.\nEchinops glaberrimus DC\nFagonia mollis Del.\nHyoscyamus auren L.\nOnosma syriacum Labil.\nZygophyllum dumosum B.”\nAnyway, do not dismiss Frei posthaste.\n\n","date":"March 29, 2014 at 7:26 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94710","author":"Psuedonym","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Daveb, the method of pollination is not at all irrelevant, and your quotation from the Encyclopaedia Brittanica confirms rather than refutes my difficulties with Frei’s identifications. Insect pollinated plants produce pollen which clings to insects and is not carried through the air at all. It does not float about, eventually landing at random. It is true that some pollens are identifiable at species level, but most are not, and Uri Baruch was only able to confirm 4 of Frei’s 58 species. My three difficulties with Frei’s work above are not at all ill-founded, and continue to cast doubt on the reliability of his findings. There are several interesting websites to be found by entering ‘forensic palynology’ into Google.\n\n","date":"March 29, 2014 at 7:36 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94716","author":"Hugh Farey","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"There is one way to solve the controversy, however given what has gone on — and is going on — in the field of Shroud studies has made that impossible. Dr.Alan Whanger has what remains of Max Frei Sulzer’s tapes and there is what was vacuumed off the Shroud in 2002. Dr. Whanger, who is respected by Turin, has stepped out of the “minefield” and Turin has turned a deaf year to the pleas and petitions because of the “minefield”. Why? Just have a look at what has been posted or published in the realm of Shroud studies.\nPope Francis is no Bavarian, like his predecessor, but he can be as tough and blunt-spoken as his predecessor and he will need a lot of convincing to open the doors for Shroudies.\n\n","date":"March 29, 2014 at 7:36 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94717","author":"Louis","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"\nHugh Farey :\nThanks, Psuedonym, but a mere list of plants means very little. Let’s look at the top two flowers in your list, Anemone coronaria and Cistus creticus. These are both brightly coloured insect-pollinated plants whose pollen is not released into the air, but must be collected, and delivered, by insects. It cannot have drifted onto the Shroud. Their pollen is not identifiable at species level anyway. These are serious anomalies in Max Frei’s findings, and must be explained.\n\n Forgive my own lack of palynological sophistication, but Frei’s samples, observed on glass microscope slides, apparently had insects present on them. Would this, perhaps, account for the Anemone coronaria and Cistus cretius?\n\n","date":"March 29, 2014 at 8:02 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94727","author":"Psuedonym","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"As suggested by Hugh, I have Googled on “Forensic Palynology”. I note that it has been practised for some 50 years, but according to the Worcester University site it is “relatively new in this country”. It would seem that the Brits and non-palynologist practitioners there might well have some catching up to do! Frei with his botanical training and his establishment of the Swiss Police Scientific Dept, was evidently one of the pioneers in this activity, and my money would remain on him! I note that a few NZ criminal cases happened to be cited in some case study examples. Pollen does not have to be wind-borne to contaminate fabrics or other objects. It can come from casual contact. Recall the old method of preparing linen from flax; it included hanging the hanks of yarn on BUSHES! [Bushes have been known to harbour the pollen of their species]\n\n","date":"March 29, 2014 at 11:20 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94775","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"In medieval times, finished cloth was spread in fields to dry, particularly in the Low Countries. But in ancient times, the hanks of yarn were hung on bushes to dry before being woven into cloth. Not only was there the likelihood of picking up the particular species of pollen from such contact, whether insect-dependent or not, but also any other detritus from adjacent sources the bushes had picked up en passant. In modern times, several criminal cases have been successfully prosecuted because of proven contact with crime site vegetation demonstrated by the science of palynology.\n\n","date":"March 30, 2014 at 4:17 am","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94832","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Both fair points, both of which illustrate how sad it is it that Max Frei is not available to respond to queries. As it is, I have to say that I don’t think the insects barely detectable on microscope slides were polliniferous, nor do I think that the flax of the shroud was left to dry on such a smorgasbord of Israeli flora as to acquire two dozen different entomophilous pollen, while the 28 species of flower identified by the Whangers and Danin as having been placed on the shroud have apparently left almost none.\n\n","date":"March 30, 2014 at 4:23 am","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94834","author":"Hugh Farey","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Just read Mike M’s comment above. Quite right; I shouldn’t use evidence I dispute to support a different argument. Other evidence stands, however.\n\n","date":"March 30, 2014 at 4:31 am","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94836","author":"Hugh Farey","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"All your “evidence” really says is that the Israeli palynologists do not apparently have the 25 years of “forensic palynology” experience of Max Frei who had the advantage of an electron microscope to identify his pollens, and your possibly unjustified belief that insect-dependent pollen species are incapable of contaminating objects by any method other than insect transport. It is not unreasonable that autumn flowering species should contaminate the cloth quite independently of the date of the crucifixion. Frei was apparently unaware of sojourn theories that had at some times placed the Shroud in Anatolia when he identified species endemic to there. I would doubt that defence attorneys in criminal cases would have the gall to demand that Frei’s evidence in those cases be peer-reviewed! They would need to find their own experts to counter Frei’s evidence. Did they?\n\n","date":"March 30, 2014 at 6:21 am","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94859","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"They would need to find their own experts to counter Frei’s evidence. Did they?\nDave, I posted in #57:\n“The problem is general reliability of palynology, not just the Frei’s identification.\nFrei identified some pollens of the spiecies gundelia tournefortii\nDanin and Baruch claimed that 91 out of 313 pollens were gundelia tournefortii\nLitt claimed that with the high probability it is not gundelia tournefortii but carduus.\nMarzia Boi claimed that alleged gundelia tournefortii is actually helichrysum\nSo one can shout: WTF, how much value has the whole pollen examination? Every palynologist says different things about the very same pollen!\nSo if you are a criminal, and have been convicted by pollen evidence -invoke the casus of the Shroud. Maybe they will have to release you from jail.”\nBTW: I posted response about Scavone vs Templars here, if you haven’t noticed https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/#comment-94503\n\n","date":"March 30, 2014 at 6:29 am","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94862","author":"O.K.","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"There is another drawback: Uri Baruch left the field of palynology for computation and is therefore now beyond the Shroud scenario. His work continues to be defended by Professor Danin, who took Professor Litt to task.\nThere is a reason why Ray Rogers rejected Max Frei Sulzer’s findings. Being a good scientist and although not being a palynologist but a chemist he could have presented his views in a paper.\n\n","date":"March 30, 2014 at 11:19 am","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94913","author":"Louis","site":"shroudstory"},{"title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"The evidence of palynology has been practised in criminal cases for some 50 years, with of course countless convictions secured as a result. Frei established and was director of the Science Dept of the Swiss Criminal Police for some 25 years, with botany as his first discipline. He was no novice at it. Because of his reputation, he had also been engaged for criminal cases in Piedmont, which happened to coincide with his secondment to notarise the Shroud photographs of 1973. For purposes of identification he had removed the pollen grains from his tapes. The sometime palynologist Baruch did not, which was the main criticism of his work. If Frei had removed the pollen grains from his tapes, how then was Baruch able to identify the same pollen grains? As it happens, Baruch’s claim of gundelia tourneforti is still a Middle East species, and does not defeat the claim that the Shroud had a Middle East provenance at some stage of its sojourns. It would seem that because of the criticisms, Baruch decided to give up palynology and moved on to other interests.\n\n","date":"March 30, 2014 at 3:21 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","id":"comment-94964","author":"daveb of wellington nz","site":"shroudstory"}]
