[{"title":"New Barrie Schwortz Podcast","post":"I hope that this will not be taken as an inflamatory comment because the intention is simply to seek responses. There is no point in evading issues. I can understand that Jesus is simply taken as a man and have even  heard similar opinions from half-baked Christians and former Christians. So, why all this fuss about a man who left his image on cloth? There is another man, a half-black Jamaican who also left an image of his body, on a mattress. So if we have two men who left images of themselves, why is there no website about the Jamaican?\nhttps://www.academia.edu/4691379/Can_the_Jospice_Mattress_imprint_be_compared_to_the_Image_on_the_Shroud\nWe humans descend from a common ancestor and people of all races suffer from the same problems, there being some differences due to cultural environments, religions, mores and so on. However, the existential issue is the same for all and it is chiefly this issue that draws, consciously or unconsciously, attention to the Shroud.\nThere are differences between the images, and my contention was also based on other research:\n http://flora.org.il/en/books/plant-stories-2/chapter-o/useful_plants_06/\nSo can we talk about the two men, one of whom has no website dedicated to the image he left?\n\n","date":"September 12, 2015 at 2:24 pm","url":"https://shroudstory.com/2015/09/12/new-barrie-schwortz-podcast/","cat":"radio_and_podcasts","id":"comment-210220","author":"Louis","site":"shroudstory"},{"title":"New Barrie Schwortz Podcast","post":"Why all the fuss about this man? Because it is Jesus of Nazareth the man who billions worship, love, hate etc. all around the world. Its also a man who was rumored to have been Resurrected and we have his burial cloth and there is a mysterious image. Obviously, I think the shroud is authentic but its not hard to find out why there is so much interest in THIS burial cloth. With that being said I do think we should look into the “Jospice Mattress Imprint”  and while I haven’t looked into it much I know what it is, and i’d like to know more.\n\n","date":"September 12, 2015 at 3:03 pm","url":"https://shroudstory.com/2015/09/12/new-barrie-schwortz-podcast/","cat":"radio_and_podcasts","id":"comment-210223","author":"Matthew L.","site":"shroudstory"},{"title":"New Barrie Schwortz Podcast","post":"Thank you Louis. Even yesterday I told an Anglican that this is not an image to worship but to prove that resurrection is real.\nHow lucky we are because non Christian,  Barrie,  is taking major role to tell the world that Shroud is not a man made image.\nWhen I am talking to Buddhists, Hindus and Atheists I am using Shroud to convince them that resurrection is real.\nUnfortunately still people can’t understand that any thing about negative image and today we don’t have any negative image man made negative image either in 13th century or 1st century.\nHow a flaked out painting give us a perfect negative.\n\n","date":"September 12, 2015 at 7:08 pm","url":"https://shroudstory.com/2015/09/12/new-barrie-schwortz-podcast/","cat":"radio_and_podcasts","id":"comment-210231","author":"Sampath Fernando","site":"shroudstory"},{"title":"New Barrie Schwortz Podcast","post":"Hi Sampath\nThere is nothing to thank me for and I can understand your plight, having to explain resurrection and reincarnation.\nMy understanding of resurrection is roughly as Jürgen Moltmann understands it and in keeping with his stand against “monarchical” monotheism. We should not think of resurrection like the ancient Egyptians did, to be wrapped like mummies, with or without valuables.\nAccording to Moltmann, “not the corpse that we can dissect objectively, but the body with which we identify in life, stands in the life of resurrection hope. There is no meaningful hope for the body we have, but only for the body we are.”\nIt is important to grasp that he understands Jesus’ resurrection to be a physical resurrection, but his theology is built on eschatology, hope found in the resurrected Christ.\nBuddhism is a negative soteriology, that in fact was the way Buddha understood it. True Buddhism can only be practised in a monastery, where there is no room for material and sexual impulses. I would say that the Jains go even deeper, but will discuss this on another occasion.\nThe problem is that in Buddhism in the end there is Nothing. Who can envision nothingness? We have to undergo countless reincarnations to climb the karmic ladder and rid ourselves of existence. Buddha understood very well what he was saying, but it does not seem that those who call themselves Buddhists and are immersed in the material world do. Physicists say that nothing comes from nothing and nothing goes to nothing. So how do we solve the problem? In my view, the solution lies in the parables of Jesus, which were deliberately meant to be riddles. There is no room for belief in reincarnation here, we have to be truly involved in the quest for God, in truth and in spirit. In Hinduism, in general, where there is reincarnation, a belief that is not essential for the Brahmo Samaj, the aim is to unite oneself with the godhead, which is more in agreement with what Christians hold. There is one saying of Jesus that made an extremely strong impact on Hinduism. It is found in the Sermon of the Mount: “Blessed are the poor in spirit, they shall see God”. For Swami Vivekananda, the founder of Modern Hinduism, just this saying did away with the need for Scripture.\nAs for atheism, that will take us to a long discussion, but I don’t think that there can be an intellectually fulfilled atheist.\nIf we have a deep religious sense, then we would think like  Wittgenstein, who went beyond philosophy:\nhttps://www.academia.edu/6085481/Why_was_Wittgensteins_burial_attended_by_a_religious_ceremony\nAll the best.\n\n","date":"September 13, 2015 at 12:28 pm","url":"https://shroudstory.com/2015/09/12/new-barrie-schwortz-podcast/","cat":"radio_and_podcasts","id":"comment-210289","author":"Louis","site":"shroudstory"},{"title":"New Barrie Schwortz Podcast","post":"Matthew L., you should hear the podcast, then go to the links.\n\n","date":"September 12, 2015 at 3:07 pm","url":"https://shroudstory.com/2015/09/12/new-barrie-schwortz-podcast/","cat":"radio_and_podcasts","id":"comment-210225","author":"Louis","site":"shroudstory"},{"title":"New Barrie Schwortz Podcast","post":"Pope Francis has not opened any door for “Shroudies”. The only one he has opened is the one he is interested in, and mentioned a recent letter he wrote to Archbishop Rino Fisichella:\nhttp://www.thetablet.co.uk/texts-speeches-homilies/4/714/pope-francis-s-letter-to-archbishop-rino-fisichella\n\n","date":"September 13, 2015 at 10:53 am","url":"https://shroudstory.com/2015/09/12/new-barrie-schwortz-podcast/","cat":"radio_and_podcasts","id":"comment-210285","author":"Louis","site":"shroudstory"},{"title":"New Barrie Schwortz Podcast","post":"The concept of ‘negativity’ was largely taken over by photography in the 19th century, such that many of us find it difficult to imagine that anybody mediaeval could imagine it. But this is nonsense. Even before the invention of printing, the reproduction of images from woodcuts and the reproduction of raised surfaces from seals were extremely common, and every artist and craftsman was perfectly familiar with both the concept and the practice of producing “positives” from “negatives” even if they didn’t use those words. Judging by the difficulty Shroud researchers have themselves (is the Shroud hair negative or positive?), it seems that the medieval mind was considerably more familiar with the idea even than the 20th century one, and, in a few years, when film photography has all but vanished altogether, only engravers and brass-rubbers will understand the concept at all.\n\n","date":"September 13, 2015 at 4:16 am","url":"https://shroudstory.com/2015/09/12/new-barrie-schwortz-podcast/","cat":"radio_and_podcasts","id":"comment-210254","author":"Hugh Farey","site":"shroudstory"},{"title":"New Barrie Schwortz Podcast","post":"I saw an interesting exhibition in ( the medieval) York Minster which showed how medieval craftsmen were adept at creating negatives of the positive stone work they were creating. If you are having to create an intricately carved piece of stone and work from an original block, but definition you will have a positive and negative as you separate them!\nNever underestimate the skills of medieval craftsmen- just look at the roofs of a Gothic cathedral and think of all the carving and building skills needed!\n\n","date":"September 13, 2015 at 5:03 am","url":"https://shroudstory.com/2015/09/12/new-barrie-schwortz-podcast/","cat":"radio_and_podcasts","id":"comment-210259","author":"Charles Freeman","site":"shroudstory"},{"title":"New Barrie Schwortz Podcast","post":"I am agreeing with you Mr. Freeman. But we do not have any evidence. To prove that we should have more images similar to Shroud of Turin.\n\n","date":"September 14, 2015 at 12:43 am","url":"https://shroudstory.com/2015/09/12/new-barrie-schwortz-podcast/","cat":"radio_and_podcasts","id":"comment-210334","author":"Sampath Fernando","site":"shroudstory"}]
