[{"title":"Aggressive and Unapologetic New Atheists or Righteous Sinners","post":"Jesus said, “I would that you were hot or cold, but because you’re lukewarm I will spit you out of my mouth.”  \nAt least we completely know where the “New Atheists” stand. I don’t think the Atheists are much different from the New Atheists in their basic beliefs: it’s just that the New Atheists are more confrontational or Evangelical.  \nPossibly the “regular” Atheists were fooling themselves. Their views ARE extreme, it’s just that they didn’t want to create waves so they stayed low-key in promoting their philosophies.  The New Atheists are not shy, they’re out and about, loud and clear. They’re obnoxious, they know it and they love it. \nSo are the satanists, they’re coming out of the closet now as well. Lots of fringe groups are showing up, showing off and PROUD of their anti-Christian behaviors and beliefs. \nAccording to Jesus’ own words, He would rather have it this way. The gray areas of morality are disappearing. People are polarized in their beliefs. This is GOOD because it leaves far less room for hypocrites who want to play it both ways. \nAtheists: you wanted an anti-God society and you’re getting it. Just see what good it’s going to do this world, without the moral constraints of Jesus’ teachings (AND the influence of the Holy Spirit) to keep mankind’s impulses in check. Things are already getting very interesting, and it’s because the self-sacrificing nature of a Christian culture is disappearing quickly. It all began with the rebellions of the 1960’s. The hippies raised their kids with the new moralities, and those kids are raising their children with even newer moralities. Each generation grows up to be totally selfish and self-centered, in addition to being increasingly more violent. \nThe Atheists don’t have alternative moralities to offer these kids. The only suggestion they have is to continue to reject whatever God might have to say about anything.  So far it’s not working out very well at all.\n\n","date":"August 28, 2011 at 3:45 pm","url":"https://shroudstory.com/2011/08/28/aggressive-and-unapologetic-new-atheists-or-righteous-sinners/","cat":"news_&_views","id":"comment-3712","author":"AnnieCee","site":"shroudstory"}]
