[{"title":"More on Crazy Talk: Are Atheists biased or just uninformed?","post":"Hello Nick !\nFirst of all, I want to say that your comments are really interesting and I love to exchange my ideas with you !\nYou said “the best possible explanation”.  I prefer that than the word “proof” !  And you know why ?  Because that leave the door open for others explanations !!! \nLet’s stay scientific for a minute, would you ?  I don’t think science will EVER be able to prove that the Shroud is really Jesus burial cloth and also, science will NEVER say that there is an absolute proof of the resurrection on this cloth.  The only thing science can do his to prove or refute that this Shroud is a real gravecloth of someone who’ve been tortured and died pretty much like the Gospels says about Christ.  These days, we have a lot of scientific facts and circumstantial proofs that this cloth is a real Shroud of someone who looked like Jesus.  But, mainly because of the 1988 carbon dating and the refutation made by Ray Rogers in 2005, science today can’t say for sure when exactly this cloth was woven.  There are some elements, like the very particular sewing found by Machtild Flury-Lemberg in 2002 and the aragonite dust from the feet, who tend to say it is from the first century and/or it came from Palestine.  But, scientifically, those elements are just some clues and they’re not absolute proofs.  \nOf course, if another C14 dating (with many samples taken from various parts of the cloth) gave us a first century date with a strong confidence, then at this moment, science will be free to state that this is a real shroud from the first century and it is possible (or probable), after all, that it is the authentic shroud of Jesus of Nazareth.  But science is not there yet.  And that would be as far as science could go…  On the question of the Shroud being the real shroud of Jesus, one day, science could say “it is possible” or “it is probable” but nothing more than that.  Science will NEVER be able to say clearly “it is proven”.  \nAs for the supposed proof of the resurrection on the Shroud, this goes over what science can claim.  By essence, resurrection was a SPIRITUAL event and this is not the kind of event that science can study and reproduce in laboratories.  Keeping that in mind, science could never go beyond saying “we can’t fully explain the image yet.”  And don’t forget that it is not because science today can’t explain something that this thing was caused by a miracle event !  Regarding the Shroud, people often tend to forget this important fact…\nAs I say, with faith, we can see a SIGN of the resurrection on the Shroud because there was a crucified man under this cloth who was tortured and died like Jesus and the body left the cloth without any visible and tangible signs of this disappearance (specially regarding the state of the blood stains).  Till this day, science isn’t able to fully explain why the blood stains are in so good condition for a gravecloth who once envelop a corpse (we are pretty sure of this now) for a short time and after this time (less than 48 hours), this corpse left the cloth and didn’t corrupt there (another pretty sure fact : there’s no signs of putrefaction on the cloth).  But the unusual state of the blood stains on this gravecloth will never be an absolute proof of the resurrection…  We need FAITH to see this sign !  I see it…  And you ?\nAnd if we’re tempted to use the mysterious body image as a proof of the resurrection, it’s a premature thing in my mind because science didn’t fully test and analyze all the possible natural explanations (even if some of them were cast out long ago).  Here, I think mainly about the Maillard reaction that wasn’t tested completely by Ray Rogers (in my opinion, more testing should be done with real dead bodies) and also the Volckringer pattern who wasn’t analyzed that much over the years and who can account, theoretically, for some of the weirdest properties of the image, like the 3D properties.  Alan Mills, a scientist from England, wrote an interesting paper about this hypothesis but he wasn’t able to test it in a laboratory and nobody did it since.  John DeSalvo wrote also about this hypothesis and, like Mills, he never manage to test it. \nSo, again, if we want to stay scientifically credible, we have to wait until ALL the possible natural explanations will be rejected by science and then (only then) we can start to think about a supernatural event as an explanation for this image.  IT IS NOT THE CASE YET !!!  In fact, we’re still far from this moment…  So, let’s stay prudent regarding the possible cause for the body imprint…  And please, never forget this :  NATURE CAN BE REALLY SURPRISING SOMETIMES !  One of the best proof of this his the paper written by Frederick Zugibe about the Jospine Matress cover image of a man who died in England !  You can read it here :  http://shroud.com/pdfs/mattress.pdf\nThis case was not a fraud and it proves that nature is sometime really surprising !  Ok, I admit the body imprint is not of the same exact nature than what is seen on the Shroud but, nevertheless, it proves one thing :  We never know what nature can produce !  Since science don’t know fully all the material world, we have to be really prudent regarding the body image on the Shroud…  Another important and too often ignored aspect of the Shroud his this :  There’s a lot of VARIABLES regarding it that science is not sure yet, like :  1- What was the exact position of the body versus the exact position of the cloth who draped it ?  2- Did the cloth was tied around the body with linen strips or not ?  3- Was there some presence of Myhre, Aloes, spices and/or other products near the body in the tomb and, if there was, in which quantities ?  4- What was the exact temperature, the exact air pressure and the exact humidity level inside the tomb ?  5- How many hours exactly did the shroud was draped over the body ?  6- What is the exact list of chemical products that were left on the top of the linen fibers during the making process ?  7- How fast a tortured and crucified corpse emit gases after death and in which quantities ?  Etc, etc.  \nBecause of these unknown data, it is really hard to test properly every natural hypothesis…  There’s so many facts we will never know for sure !  So, when you don’t know precisely all the starting parameters, how can you test an hypothesis properly ???  I think it’s one major reason why science wasn’t able yet to duplicate and explain this image…\nAnd, because there’s so many things we still don’t know about the Shroud, I fully agree with the prudent attitude of my catholic Church !  You can bet one thing :  The Church will never used this Shroud as a banner for converting masses of unbelievers !  Faith is not based on scientific proofs and never will.  If we could prove our faith, then faith would not be faith no more !  Jesus said it well when he said to the doubting Thomas :  Blessed are those who believe without seeing !  This saying of the risen Christ is very important when we reflect about the Shroud.  And I think Christ would say this to Dawkins and Al. : “This generation calls for a sign, but the only sign they will get is the sign of Jonas !” (Matthew, chapter 12).  And, who know ?  Maybe the Shroud is precisely THE SIGN OF JONAS for this generation of materialists and rationalists !  But, don’t forget it is a sign, not a proof ! \nOne thing’s for sure : this cloth is not and never will be a faith dogma.  And since science still cannot tell us without any doubts that this cloth is the authentic shroud of Jesus, the Church cannot use it as a main tool for conversion.  Imagine if the Church was trying to convert people with this cloth and then, science would show us an absolute proof that it cannot be Christ shroud !!!  What do you think people would say ???  The Church is too bright to do this kind of mistake.  God doesn’t impose faith to us.  Faith is mainly a free choice and God respect every person and their decisions…\nThat’s why the Church mainly use the Shroud as an ICON of the suffering and death of Christ (and as a tool for evangelization like other icons) and, to me, that’s the main function of this cloth…  It’s a very good tool to reflect on the Passion, death and resurrection of Christ.  It can also be a sign of the resurrection of Christ (like the empty tomb and some other signs) but we can’t talk about a proof of it, in a scientific way.  Anyway, the best proof of the resurrection of Christ is this one :  You and I still believe in this incredible event some 2000 years after Jesus died on the cross !!!  The Church is still here after 2000 years and after a lot of persecutions.  That’s the main proof to me that this event wasn’t a joke !  People would never be willing to die for a fraudulent event !  The first Christian martyrs are the best testimony we can find about the reality of the resurrection of Christ.  \nAnd in your specific case, I think the Shroud was used by the Holly Spirit (who used everything he can !) to leads you to faith in Christ.  And I’m glad for you it was the case !  I don’t know you but I’m pretty sure you needed something like the Shroud to start your faith journey…  And I’m sure you’re not the only one (maybe some of your friend will take the same road than yours !).  I’m pretty sure that’s why the Church, even if it doesn’t used the Shroud for conversion and never claim this is the authentic Shroud of Christ, nor that it is the absolute proof of the risen Christ, still show this cloth periodically because it can affect people and made them think about Christ and what he did for us.\nGod Bless You Nick and I made this wish for you and your faith :  I hope one day you won’t need the Shroud no more to fully believe in Jesus-Christ !  Your faith will be so strong that you will look at the Shroud with a smile and say :   this Shroud was just a turning point on my trip to Heaven !!!  It was important for me but now, Jesus-Christ is more important than this cloth.  And when you wrote : “I’d probably remain a Christian”, I think it’s a very good sign that you’re walking in this direction !\nAnd I’m sure of one thing : The Shroud, unlike Jesus, will not be with us in the Father’s Kingdom…  It is a material object who, unlike everyone of us, is condemn to stay in the material world !  So, it’s not so important, after all !!! \nYannick\nP.S. :  When you said “Are we not called to evangelize all nations?”, my point of view on this subject is not the same as many Christian.  I think the best way to evangelize the world is not with the Shroud or anything like that.  It’s not even with what we say (preaching).  Instead, I firmly think it’s the quality of our faith in Jesus and the quality of our relationship with him (mainly through spiritual prayer) who is the best tool to evangelize the world.  And the best power someone have to change the world his to let God change his own life !  Believe it or not, I think it’s true !\n\n","date":"July 22, 2011 at 10:33 am","url":"https://shroudstory.com/2011/07/21/more-on-crazy-talk-are-atheists-biased-or-just-uninformed/","cat":"news_&_views","id":"comment-3382","author":"Yannick Clément","site":"shroudstory"},{"title":"More on Crazy Talk: Are Atheists biased or just uninformed?","post":"Here’s a another view; I know the Shroud is real and I knew it 100% the moment I first saw it.Don’t ask me how, I can’t explain it or prove it…To me the onus is on others to prove it isn’t authentic!…so far no one has or even come close.My faith in Jesus has been with me always or atleast since I can remember, so I don’t need the Shroud but it did strengthen my faith, especially in these days of so much fear mungering and hate from non-believers towards religion in general but specifically towards Jesus Christ.\nThe C-14 dating? I don’t think will ever prove anything or ever settle the matter.If it tests to 33CE people will just say it doesn’t prove the image was there since then.Also with some, even if science could, or did manage to prove the Shroud to be ‘real’, it would not make a difference or open their eyes, sad but thats the way it is.\nRon\n\n","date":"July 24, 2011 at 10:16 pm","url":"https://shroudstory.com/2011/07/21/more-on-crazy-talk-are-atheists-biased-or-just-uninformed/","cat":"news_&_views","id":"comment-3399","author":"Ron","site":"shroudstory"},{"title":"More on Crazy Talk: Are Atheists biased or just uninformed?","post":"Excellent comment Ron !  I agree totally with your point of view.  Barries Schwortz said it the best when it comes to the famous (or infamous) C14 result :  If you put all the data we have about the Shroud on a scales, 99% will be pro-authenticity and 1% (this C14 test alone) will be against authenticity.  Make up your mind folks !\nAnd I love the way you put it :  even with a new dating who would give a first century date, many people will still believe it is a paint !  Science will never be able to settle this debate once for all.  That’s my feeling…\n\n","date":"July 25, 2011 at 1:04 pm","url":"https://shroudstory.com/2011/07/21/more-on-crazy-talk-are-atheists-biased-or-just-uninformed/","cat":"news_&_views","id":"comment-3408","author":"Yannick Clément","site":"shroudstory"},{"title":"More on Crazy Talk: Are Atheists biased or just uninformed?","post":"Having said what I just said, I want to add something terribly important :  Even if the debate won’t possibly ever be settle, science MUST keep on the research on this intriguing cloth.  Since the Shroud is a part of the physical world, it must be observed and analysed by science using the scientific method (and not by pseudo-science).\n\n","date":"July 26, 2011 at 8:29 am","url":"https://shroudstory.com/2011/07/21/more-on-crazy-talk-are-atheists-biased-or-just-uninformed/","cat":"news_&_views","id":"comment-3419","author":"Yannick Clément","site":"shroudstory"},{"title":"More on Crazy Talk: Are Atheists biased or just uninformed?","post":"Hi Yannick, thanks for the compliment and I have to agree that studies must continue on the Shroud even if for no reason other then continued findings or ‘clues’ may draw more people to Christ, as it did for Nick in his case.Remember in my comment I said ‘some’ people may never see, but I’ll bet there are many that will and that’s one thing we can all pray for.Although there is the matter of the Church to do thier part and allow more studies to be made competently on the Shroud.As it is in my humble opinion, what God would want and possibly why the Shroud is here.As I believe the Shroud was ‘meant’ particularly for our time as opposed to earlier eras.\nRon\n\n","date":"July 26, 2011 at 9:31 am","url":"https://shroudstory.com/2011/07/21/more-on-crazy-talk-are-atheists-biased-or-just-uninformed/","cat":"news_&_views","id":"comment-3422","author":"Ron","site":"shroudstory"},{"title":"More on Crazy Talk: Are Atheists biased or just uninformed?","post":"I think the Shroud is somewhat of a thorn in the side for atheists and rationalists who only believe what they can see, because, unless they put their head in the sand, they see it and it’s REAL ! :-)  They can claim it’s a rubbing or a painting all they want (without considering the facts with a humble and honnest mind) but they cannot pretend it doesn’t exist !!!  And, what’s the best about the Shroud, it forces some to reconsider what they really believe.  That’s a very good thing.\n\n","date":"July 26, 2011 at 10:30 am","url":"https://shroudstory.com/2011/07/21/more-on-crazy-talk-are-atheists-biased-or-just-uninformed/","cat":"news_&_views","id":"comment-3423","author":"Yannick Clément","site":"shroudstory"},{"title":"More on Crazy Talk: Are Atheists biased or just uninformed?","post":"Just saw this was posted on here, and needless to say I was flattered to see it. Many thanks to Mr. Porter.\nYannick,\nYou’re absolutely right that the Shroud could never be proven to be the Shroud of Christ; as we probably all know Science doesn’t actually ‘prove’ anything but is an epistomology of measurement and recording. It disproves other explanations, but it never proves a certain one. My only issue is when I see this:\n“If we could prove our faith, then faith would not be faith no more !”\nI don’t get this. Belief that Christ rose doesn’t necessarily mean I have faith in Christ. Paul said that all are without excuse in believing that there is a God, but he talks about faith — the trust and love in God — separately. I largely agree with your post and will admit that perhaps I wanted too much out of it. I still don’t think it’s wrong to present it to others though at the very least as a possible justification for belief. I.e., Dawkins can’t go telling me irrational if I show him the Shroud as what led me to belief. \nIf still, I know that I could never use it as proof — it would simply be a piece of a much larger puzzle. One last thing. You said:\n“And, what’s the best about the Shroud, it forces some to reconsider what they really believe. That’s a very good thing.”\nI completely agree.\n\n","date":"July 29, 2011 at 6:00 pm","url":"https://shroudstory.com/2011/07/21/more-on-crazy-talk-are-atheists-biased-or-just-uninformed/","cat":"news_&_views","id":"comment-3483","author":"Nick","site":"shroudstory"},{"title":"More on Crazy Talk: Are Atheists biased or just uninformed?","post":"Yannick,\nOne last thing. Could you provide me a link or a source to where you got these conclusions:\n“…the body left the cloth without any visible and tangible signs of this disappearance (specially regarding the state of the blood stains). Till this day, science isn’t able to fully explain why the blood stains are in so good condition for a gravecloth who once envelop a corpse (we are pretty sure of this now) for a short time and after this time (less than 48 hours), this corpse left the cloth and didn’t corrupt there”\nI ask this because Robert Wilcox’s book makes it seem like Vignon was able to reproduce the blood clot images even though he did this by a tearing mechanism.\nGod bless,\n– Nick\n\n","date":"July 29, 2011 at 6:19 pm","url":"https://shroudstory.com/2011/07/21/more-on-crazy-talk-are-atheists-biased-or-just-uninformed/","cat":"news_&_views","id":"comment-3484","author":"Nick","site":"shroudstory"}]
