[{"title":"Stephen Hawking says God’s not needed. So?","post":"A question to Physicist Stephen Hawkins.\nHow His theory will tell difference between a living human Body and a dead human Body. Gravity is all the time existing….but something is missing from the dead human body. Existence of God can explain it. Let your theory explain it.\n\n","date":"September 4, 2010 at 10:55 pm","url":"https://shroudstory.com/2010/09/02/stephen-hawking-says-gods-not-needed-so/","cat":"news_&_views","id":"comment-1417","author":"Noya","site":"shroudstory"},{"title":"Stephen Hawking says God’s not needed. So?","post":"It’s just the Man of the Shroud, I believe, Who has all the answers about the mysteries of the Universe we need.\nThere is no effect without a cause. If the Universe began by itself, only following the physical laws, then one would ask” From where such laws came out?”\n‘Law’ means ‘order’and the chance only accounts for disorder, not order.\nThis is so that scientists today attempt to “recriate” the Big-Bang in the CERN by means of order (the action of human minds) and not by chance!\n\n","date":"September 9, 2010 at 8:18 am","url":"https://shroudstory.com/2010/09/02/stephen-hawking-says-gods-not-needed-so/","cat":"news_&_views","id":"comment-1426","author":"Tersio Gorrasi","site":"shroudstory"},{"title":"Stephen Hawking says God’s not needed. So?","post":"I utterly agree with comments from Noya and Tersio and despite we’re dealing with Universe creation  and Big bang phenomenon I guess we can establish a parallel reasoning with the Shroud of Turin.\nMay be in a near future science will be able to conclude what made de image that is to say determine what caused chemical change on tha thin polysaccharide layer around topmost fibers of the fabric, nevertheless even if a kind of mechanism for example corona discharge ocurred in a given moment and may account for that effect there will be a lotta questions without answer.\nWhat caused corona discharge? Why so called by products of that or other phenomena caused those chemical changes?\nWhy those chemical changes resulted in an image effect with such weird charactristics as Shroud of Turin’s image? Did that effect ocur just by chance?\nI’m sure science won’t answer these questions and like in Big Bang the only logical and right answers will be God and Resurrection\n             regards\n               Maria da Glória\n       Centro Português de Sindonologia\n\n","date":"September 16, 2010 at 7:06 am","url":"https://shroudstory.com/2010/09/02/stephen-hawking-says-gods-not-needed-so/","cat":"news_&_views","id":"comment-1436","author":"Maria da Glória Gonçalves Barroso","site":"shroudstory"},{"title":"Stephen Hawking says God’s not needed. So?","post":"Media hype aside Hawking has said nothing new in this latest statement. But it’s naive theology which places God in a creation situation requiring a before and after – ‘time’ as we know it is a creation too.\n\n","date":"September 23, 2010 at 6:40 pm","url":"https://shroudstory.com/2010/09/02/stephen-hawking-says-gods-not-needed-so/","cat":"news_&_views","id":"comment-1445","author":"Adam","site":"shroudstory"}]
