[{"title":"Steve Jobs’ Belief in God. Maybe.","post":"That’s a totally WIMPY effort, isn’t it:  Maybe kinda sorta. I really think he could have TRIED a little HARDER than THAT.  \nBut I’ve noticed that rich people aren’t very motivated to do it. In the book of Revelation, Jesus complains about the Church of Laodicea where the Christians were prosperous. And they were so selfish and self-centered that He couldn’t get them interested in the things they SHOULD be interested in. They could not be MOVED to make the effort. The Lord Jesus didn’t know what to do with them. \nIt’s interesting that God expresses real frustration in those verses. \nSeems as if Steve Jobs could hardly be bothered, even when faced with the reality of his own imminent Death.  I wonder what Steve Jobs would say to us NOW, today, if he could???  I betcha it would be a real earful. \nJesus said at one time that poor people should glory in their low position.  I really thought Jesus was being ironic when He said that, but maybe He wasn’t. Because poor people are more likely to learn to pray and to lean on God. When we get to the afterlife, we might see how truly lucky we were, that we had to rely on God and were thus forced to develop our spiritual side.\n\n","date":"October 24, 2011 at 7:14 am","url":"https://shroudstory.com/2011/10/24/steve-jobs-belief-in-god-maybe/","cat":"news_&_views","id":"comment-4275","author":"AnnieCee","site":"shroudstory"},{"title":"Steve Jobs’ Belief in God. Maybe.","post":"I read in several articles that appeared the day of his death, that he was a Buddhist.\nWhich would account for the non-committal attitude towards God.\nGuess he knows NOW, doesn’t he?\nThe man was a hard worker, a family man, and a genius who left us all a great legacy, as far as technology.\nI can only hope & pray that he had a moment of reckoning, and made peace with God while he still had breath to do so.\n\n","date":"October 24, 2011 at 10:34 pm","url":"https://shroudstory.com/2011/10/24/steve-jobs-belief-in-god-maybe/","cat":"news_&_views","id":"comment-4310","author":"Leina","site":"shroudstory"},{"title":"Steve Jobs’ Belief in God. Maybe.","post":"Yes, I hope so too. I think it’s “cheating” to make a deathbed decision for the Lord but it’s better than nothing. I hope something real and genuine did happen before he died.\n\n","date":"October 25, 2011 at 12:48 am","url":"https://shroudstory.com/2011/10/24/steve-jobs-belief-in-god-maybe/","cat":"news_&_views","id":"comment-4311","author":"AnnieCee","site":"shroudstory"}]
