[{"title":"The Evangelical New Atheist Movement","post":"I’ve run into a whole slew of pseudo-athiests who are most likely young men in their teens. I’ve noticed they have no real desire for learning anything and it’s obvious their presence on chat threads is not about learning Truth. It appears to me that they really like to swagger and bully others. \nI’ve also had some conversations with possibly “real” athiests who are more mature and more educated but after a number of indepth conversations I don’t think their philosophies and questions are a genuine, honest search for truth either. They want to skitter around some topics, there are some things you cannot force them to address. Such as whether there are real, supernatural phenomena (such as sightings of angels.) And if the supernatural exists then WHY do athiests demand proof of what is supernatural on their own terms? Maybe, if they’re really interested in knowing what’s behind the countless stories of supernatural experiences, they need to create a different set of criteria than what they use for exploring the Natural world. \nI think of it as aliens studying aliens. If we went to Mars and actually found little humanoid beings on that planet, would we insist that they learn things OUR way?? Or would we make an effort to learn about them in THEIR terms, in THEIR environment?  \nIf the supernatural is somewhere on a different plane than our own human experience, then we need to learn about THAT plane in order to learn what’s there and how it works.  And it’s not unreasonable to suggest that there are other planes of experience: science already suspects it. \nAnother thing athiests go berserk over is the topic of Noah’s flood. To me this is almost humorous, if you want to set off a roomful of athiests then just casually mention the Flood and it pretty much doesn’t matter what you say about it, the place will be hoppin’ with athiests having temper tantrums.  Why does this matter SOOOO much, I wonder??  It’s my own theory that they hate the story because it’s a story of God’s judgment. And if there truly is a God, those who celebrate the “International Day of Blasphemy” have really set themselves up for a truckload of Trouble with the God they have blasphemed.\n\n","date":"August 8, 2011 at 10:23 pm","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","id":"comment-3541","author":"AnnieCee","site":"shroudstory"},{"title":"The Evangelical New Atheist Movement","post":"I appreciate what this guy  Reza Aslan has to say. (His name is Aslan, really?  How cool.)  He is obviously very intelligent, a true philosopher and his analysis is very refreshing.  Thank you for posting it.\n\n","date":"August 8, 2011 at 10:29 pm","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","id":"comment-3542","author":"AnnieCee","site":"shroudstory"},{"title":"The Evangelical New Atheist Movement","post":"Well I think that that was a grand characterization.\nFundamentalism has absolutely nothing to do with scientific skepticism. It is in fact in opposition to fundamentalism. I think that it is funny that you have pigeon-holed me as a fundamentalist; science and skepticism is so clearly feared when it comes into conflict with cherished ideas and stories that it must be just a “new atheist” dogma.\nBut of course this is not the case at all. The person that I have been arguing with (if you have read the discussion) has no concept of argument, evidence, or science (and I think that Dan will support me on this point). The methods and evidence that I “demand” are simply the things that anyone would demand in order to establish some fact of reality. If we were having an argument about what the best type of coffee is, no one would care about my “demands”. But when I ask for the same standard for stories of floods and anecdotal angels, suddenly I have become a fundamentalist or a “bully”.\nHow convenient it must be for people of faith to play this card. If science helps religion, great, if it contradicts it, just ignore the findings, and faith is good enough for us. Religion can speak to the virtues of faith all they want, but if there was actually one iota of scientific evidence for a religious claim, I am absolutely certain that they would jump all over it. Would “non-overlapping magisteria” be an issue if we found DNA evidence for Jesus, for example? A reason why religion is wary of science is that it offers nothing to proselytize about. Science in fact contradicts much of the fundamentalism that you have accused me of.\nBut why do I demand such evidence? Why do \n\nAnnieCee :\n athiests demand proof of what is supernatural on their own terms? Maybe, if they’re really interested in knowing what’s behind the countless stories of supernatural experiences, they need to create a different set of criteria than what they use for exploring the Natural world.\n\nAtheism doesn’t even have “terms”; don’t confuse science and atheism, they are not identical and do not imply each other.\nBut I demand such evidence because “countless stories” are just that, stories. There is no truly documented case of a supernatural experience that does not have some more plausible, physical explanation. We do not need to “create a different set of criteria” because the criteria that we have works. Science and its method is the most successful set of criteria that humans have ever created to understand their surroundings. Even now I am writing this response only because this criteria has allowed us to understand everything from electromagnetism to quantum mechanics, and without such criteria, we would still be where we are when we are still steeped in ignorance, only with “stories”. Do not let your hope for the supernatural cloud your judgment or motivate your reasoning. Where people see ghosts, science sees a concatenation of psychology, physiology, neurology, physics, and biology. As Carl Sagan said, we are no longer live in a “demon haunted world”.\nFurthermore, AnnieCee, ask yourself, would a bunch of stories about a bridge being safe sufficiently convince you that you could drive over it? Or would you like some proof, some calculation, some evidence? The “bully” that I’m sure you are perceiving here, is asking no more of you than you would with anything besides religion. Is this exclusion warranted simply because you were born into a faith-filled household, or because one ancient book says so? I do not think so. But then again, requiring such evidence that I am asking for, the same kind that you would ask for with any other subject, is surely fundamentalism.\nIt must be so terrible for atheists to come out and have meetings and parades and demonstrations. How offensive that is. Why can’t they just celebrate Christmas with the rest of us? Religious people never subject non-believers to persecution or ridicule, what bullies those new atheists are.\nI suppose the truth always hurts someone.\n\n","date":"August 9, 2011 at 10:33 am","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","id":"comment-3546","author":"Kyle Hill","site":"shroudstory"},{"title":"The Evangelical New Atheist Movement","post":"As I said, it may be necessary to learn about other planes in order to find out what’s there. As long as athiests refuse to keep an open mind about the existance of the supernatural, they will know absolutely nothing. \nGod left us a trail of clues. In the Bible God says, “Those who come to God must believe that He is, and that He rewards those who diligently seek Him.”  So God is giving an invitation here, but He makes it clear that in order to learn what He’s got to offer, you must do it on HIs terms and in His “space” so to speak.  The leap of faith is actually a very simple matter, therefore: it’s a willingness to go to God on HIs terms. \nIf God is truly God, He is not being unreasonable in requiring this. But why does He do it this way, instead of coming into the Natural World and giving off displays of all his amazing powers? Why doesn’t He provide proof-on-demand? \nI think it’s because He’s looking for something among mankind. For one thing, God doesn’t want a lot of rebels, which I think is what athiests basically are because of their blasphemies.  If there is no God, then what’s the purpose of deliberately insulting Him?  To me, a true athiest would be above that. A true athiest would not be concerned about God at all, ever. But nobody talks about God more than the athiests, I think. \nSo this guy is right that athiests have become very evangelical.  It’s an anti-God campaign, and it’s very ugly. They say a lot of very negative things against God and anyone who believes. They love doing it, apparently it FEELS GOOD doing it, so they do more of it. And they’ve attracted a whole lot of young men who don’t have a clue what they’re talking about but these kids love, absolutely love, the negativity of it all. What a breed the athiests have spawned. I am not impressed.\n\n","date":"August 9, 2011 at 4:17 pm","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","id":"comment-3550","author":"AnnieCee","site":"shroudstory"},{"title":"The Evangelical New Atheist Movement","post":"It’s interesting how you say that no one talks about God more than atheists, yet God is your only argument, and God is your only reason. Making an argument that’s supposed to be convincing about God that has to first presuppose his existence is circular reasoning, and I am not impressed.\nI provided an adequate reason for why science uses the criteria that is does, and it certainly keeps and open mind (as I stated). It even tests the supernatural, such as the effects of ESP, the efficacy of prayer, and the implications of out-of-body experiences. The reason that you never hear about these studies is because their outcomes are never positive. As far as we know, there is no evidence that points to the supernatural. It is not that science is “close minded”, it is that there is no good reason to believe that the world works in a supernatural way. Your Christian/Religious bias is quite clear in your response, and I feel that you are letting that bias cloud your reasoning, claiming that science is being suppressive only until it actually finds something. If science did find something that was indeed supernatural, I don’t think that you would be accusing it of close-mindedness (and this discovery would be through the normal criteria that we have in place now).\nNot only did you dodge every single one of my arguments, you also are arguing on a basis that requires you to know God’s intentions, which is something that I think is a no-no for Christians. Who are you to say that “God doesn’t want a lot of rebels”? Do you know what God wants? That’s a pretty huge leap to make for a mere mortal.\nAnd are you kidding me with being offended that atheists are being evangelical? Try to ride 10 minutes in a car without seeing a church, or a religious billboard, or crucifix somewhere. Try to find a country where the Church hasn’t sent someone to go door to door or village to village in order to save souls. This is the definition of evangelical. But of course it’s only OK if it’s for religion right?\nIs everyone supposed to be OK with that, or is it only OK if you are a believer? What about the road signs that tell me that I am going to forever burn in hell for my non-belief? Does it suddenly become OK if its always been like that, or if there are more believers than atheists? You are arguing from a very privileged position, remember that, and remember that everyone has a right to express themselves, even if you don’t agree with what they say.\n\n","date":"August 10, 2011 at 12:10 pm","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","id":"comment-3559","author":"Kyle Hill","site":"shroudstory"},{"title":"The Evangelical New Atheist Movement","post":"Athiests have more questions than answers. More complaints than solutions. Look at all your question marks up there… ????  And if somebody attempts to respond to all those question marks, they come up with a zillion more.  Talk about circular reasoning!  Athiests are really good at running people around in circles without EVER breaking the cycle and actually coming to some CONCLUSIONS.  I will not enter into that endless game again, I’ve done it and it’s a huge waste of time. Athiests can waste of ton of time getting absolutely nowhere. \nI call athiesm a religion of DOUBT.  The professional doubters.  They love their doubts, they invent new ones constantly. The compare their doubts among each other and admire them and improve upon them.  They build enormous libraries of all these illustrious doubts.  Obviously you have a good library of them, too. \nDo I know what God wants?? Of course, it’s all in the Bible. It’s not a huge leap, it’s right there for any mere mortal to read.  Thanks to Martin Luther and others who sacrificed to get the Word of God into the hands of common folk. \nI can’t prove God exists but you can’t prove He doesn’t exist, either.  I have my own proof, you have to get your own. That’s how it has always worked. Until a person is willing to settle down before God and be willing to do things God’s way, they’ll never have any proof of their own.  I can’t give you my proof. I would if I could, really… and I wish it was that easy – but it doesn’t work that way.  \nThe first requirement is to be willing to get down on our knees and show respect. I have a friend who is an athiest, raised by Christian parents who were prominent and very well respected. It was not an abusive home, it was a loving home that she came from.  If anything she was too spoiled.  Now this woman is in her 50’s and she’s gone down this long long path of rebellion for so long, I don’t know if it’s possible to eat that much crow and find her way back. I’m rather appalled at the corner she’s painted herself into.  And she’s struggling with health issues too, so she may need to meet her Maker sooner than expected.  I mention her only because I know the pride that’s in her life and I can see how difficult it would be to “repent”, to change, to return to her roots. To make things right. I truly hope she can find the courage to do it. \nYou say that I am arguing from a very privileged position; I’m not quite sure what you mean by that but I kind of like it.  I’ve been a Christian since I was a child. I was saved before my parents were, so it wasn’t due to influence in the home. I can’t relate to you all my “proof” but a lifetime of walking with God is so precious to me, and His Bible is so living to me, that I do feel very privileged, yes.  I know how easy it would have been to make other choices, other decisions. It’s all in the little stuff, I believe that. Our lives turn on a tiny choice, sometimes. I marvel that I made the choice I did when I was 8, and I beg God even yet to forgive me for almost making the mistake that I did. I could have been selfish, I could have lied… I could have walked away and nobody would have known. Would it have been so awful, I was only 8 and it was only a small thing.  But I did the right thing, and I think my whole life turned in that moment. I am very grateful to God that I have known Him all my life. \nIt is in the small things, I believe that.  Which is why I am grieved for all the small words of blasphemy that harden the heart only a little bit more and a little bit more… until there is possibly no way back.\n\n","date":"August 10, 2011 at 9:36 pm","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","id":"comment-3563","author":"AnnieCee","site":"shroudstory"},{"title":"The Evangelical New Atheist Movement","post":"Saying that I ask you many questions and therefore I am engaging in circular reasoning is both logically false and intellectually lazy. I would have preferred an answer to at least one argument.\nIt’s interesting how you also view doubt as such a bad thing. I do not think that questioning has become something to look down upon. Indeed, I have quite the opposite view of your own “religion”, a radical adherence to blind faith. With doubt at least you can learn something, blind faith is an unmovable tome of superstition. The scientific worldview is one consisting mainly of focused doubt, and it has proved pretty useful. \nI’m not sure why you believe so vehemently (use of all-caps) that you do not have any evidence for. I don’t think that you cannot come up with any reason for this belief without presupposing that he exists. This is the definition of circular reasoning, not asking a lot of questions, as you so incorrectly put forward. I’m also glad that you served me up the old argument: “you can’t prove that he doesn’t exist”. The popular response goes something like this: \nI can’t prove that God does not exist, but neither can I prove that a teapot currently orbiting Mars does not exist. Does this justify my blind belief in the teapot as well? Both the evidence for God and the evidence for the teapot orbiting Mars are equally baseless. You can’t prove that something does not exist, as there may always be some variable or some data to hide from, but that does not logically imply that you should then believe wholeheartedly in it. More perplexing to me is that you think that an inability for me to disprove the existence of a deity means that a white-bearded father figure who reads your thoughts lives in the sky. How does this follow? Because one book told you so, and this is not adequate in my view.\nYou can’t disprove the existence of Zeus. That means that he exists in your logical framework. This surely doesn’t make sense to both of us.\nI am happy that your faith makes you feel good and privileged. I honestly am, I don’t mean any personal attacks or malcontent, I just completely disagree with how you think the universe works. But, I did not mean “privileged” in this way. What I meant by you arguing from a privileged position is that you are very used to acknowledging a Christian majority in this country. Therefore it is easy for you to get all huffy and puffy about “evangelical” atheists. My point was that your view may be different if you were in the minority, in this case, non-believers. Put yourself in my shoes, or a Muslim or Hindu’s shoes. If you can do this, I think that suddenly many of your own expressions of religion may be offensive to others, and I think you should remember that.\nYou say that atheists never come to conclusions, and ask a lot of questions (again why is that bad?). But atheism is actually built on one fundamental conclusion: there is no reason to suppose that God exists.\n\n","date":"August 10, 2011 at 10:32 pm","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","id":"comment-3564","author":"Kyle Hill","site":"shroudstory"},{"title":"The Evangelical New Atheist Movement","post":"I deal with doubts. For me, working through doubts has led to greater understanding of God and His ways. \nAthiests want to bog down the conversation with so many questions that there’s no way to finish a discussion.  Mass confusion is a favorite tactic: throw in a whole pile of questions for every 1 statement that the “opponent” makes. Changing the subject is a favorite tactic: switch to something else and something else and something else with each comeback. This is why I totally question the honesty of any athiest I’ve talked to.  How honest do you think YOU are?  \nI’m very busy this week and I truly don’t have time to play such games, which I think would not get us anywhere anyway. \nLike Jesus said, it was all about knowing His Father. He said this over and over: it was the core of His message. He wants us to know His Father. You think there is no God. I know you’re wrong, I’ve got way too much mileage with God to ever doubt that.  If I was smart enough, maybe I could beat down all your philosophies but that would not convince you anyway so what’s the point.  I have a decent IQ and I know the BIble fairly well and I’ve studied apologetics some and I love CS Lewis’ book called “Mere Christianity” which lays out in brilliant fashion how the only truly smart thing to do is to be a Christian. So if you’re honest and you want to know what the arguments are then I think you should go to Amazon or ebay right now and get that book and read it at least twice.  Lewis’s book is accepted by most Christian churches as being very good for basic apologetics. It’s not an easy read, there’s a lot to chew on. \nBut that is only for starters… I wonder if you’re willing to do what it takes to know Truth: which is to kneel before God, all by yourself, and tell Him you’re sorry.  And the Bible says that we totally have to mean business when we do it. And we might have to come back a few times until all the attitudes are really straightened out before God will be willing to get down to business.  \nIf I want to know the truth about God, it can’t be done how I want it. We do have to come to God on His terms, always. This isn’t a bad thing.\n\n","date":"August 10, 2011 at 11:57 pm","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","id":"comment-3565","author":"AnnieCee","site":"shroudstory"},{"title":"The Evangelical New Atheist Movement","post":"I am quite an honest atheist, but it would be hard for me to employ my atheist “tactics” for your comebacks because you have had none. I see not one thing about the world that requires us to suppose a god exists. We have natural reasons for the diversity of life, the origin of the universe, human morality, sightings of angels, hearing voices in your head, feeling a “sense presence”, etc. All of this points to the fact that no ancient god of Middle Eastern tribesmen needs to be inserted to explain the universe. And this is all backed up by evidence, honestly.\nI think the reason that you are feeling bogged down with questions is because you have provided me with absolutely zero answers. “Changing the subject”, as you call it, seems to be something very different from what I was doing. I present you with a question or argument, you respond, I respond to that response, etc. That is how a discussion works. Getting bogged down is a function of me making arguments that you refuse to address, not me switching the subject. \nThe reason that I present you with my “philosophies” is because I want to hear your answer. I am willing to hear any cogent argument or rebuttal, and will certainly not dismiss it out of hand just because it is religious in connotation (as you seem to think that I will do).\nYou also seem to think that I know little about Christianity. I was born in a Christian household, went to Catholic school for 8 years, attended a private Catholic college, and took extra-curricular classes on theology in general and Christianity specifically. I know all about the apologetics and C.S. Lewis, and I am familiar with all the arguments that they present. However, I have found none of them to be satisfactory, as the only arguments that are thought to “prove” God’s existence are philosophical, contradictory, and unfounded in nature.\nAgain, instead of saying for what reason you believe, you are simply taking it for granted, and making arguments that would only make sense to a religious person. The reason I should be a Christian believer is because God wants me to? Do you see how that establishes exactly nothing?\nBut I can see from our previous back-and-forth that you are not going to answer any of my arguments, and play the “you have to have faith” defense, so if you need me, we can continue this over at Science-Based Life (click my name underneath the icon).\nI will leave you with a quote:\n“When you understand why you dismiss all other possible gods (Zeus, Thor, Shiva, Vishnu, etc.), you will understand why I dismiss yours.”\n\n","date":"August 11, 2011 at 12:24 am","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","id":"comment-3566","author":"Kyle Hill","site":"shroudstory"},{"title":"The Evangelical New Atheist Movement","post":"You have been Catholic… and you have apparently applied yourself to extensive study of Christianity. And yet, you have not met with God?  I can see how that would happen. You have known religion.  Jesus Himself was up against Religion, in fact it was Religion that killed Him. I have plenty of complaints against Religion myself. \nI’m not trying to frustrate you.  I’m trying to cut through everything to help you find your way to God. As Jesus said, the Kingdom of God belongs to those who approach Him as a little child would.  \nI’m very sorry you’ve tangled yourself in such a mental cage, it’s as if you’ve become trapped in your brain somehow and can’t find the way out. I’m not mocking you. If you spent that much time learning about Christianity, you must have been searching for something. You didn’t start out with the idea that you would end up where you are now. \nMy Father has a good friend who eventually did become a Christian but it was a struggle for him to take the leap of faith because it just didn’t make any sense to him, and he tried to process that for a long time. He finally did become a Christian. He was an extremely intelligent guy who found it really, really hard to understand why Salvation works the way it does. He doesn’t have any problems with it now though. He’s convinced, he got his proof.  \nSeems as if you need to get your proof, yet.  That’s what I’ve been trying to explain. Trying to point you down the right path.  Maybe I, myself, am the proof you’ve asked for. I’m telling you, God is for Real.  I know it. You can know it, too.\n\n","date":"August 11, 2011 at 12:57 am","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","id":"comment-3567","author":"AnnieCee","site":"shroudstory"},{"title":"The Evangelical New Atheist Movement","post":"So after all my pleading I get another vacuous response? You sound like a nice woman, but you argue like a little child. But if that’s how Jesus wants you to approach him, I guess it makes sense. \nThe story of your father’s friend is interesting, albeit completely unconvincing. So you know a man who didn’t believe in Christianity and now he does. So what? \nI knew a man who wanted to become a vegetarian but struggled with the decision, because he found it really, really hard to understand why meat-processing works the way it does. He doesn’t have any problems with it now though. He’s convinced, he got his proof. Did that convince you to become a vegetarian? \nI’m also not sure that you have the slightest clue what the word “proof” means. Surely you don’t mean a mathematical proof, and you consistently refuse to offer any scientific proof, so I guess you are the “proof” that Christians like yourself (but not you Dan, you seem much more intellectually present) are the “I will not answer, here’s some stuff from the Bible instead” type.\nI find it completely insulting that you consider me in an mental cage just because I do not agree with your blind faith. What I have realized, “trapped in my brain”, is that I am only 22 years old and probably already know more about the way the universe works than you will care to discover in your entire life, with the only reasoning being that you have committed yourself with such radical adherence to a set of doctrines that tell you what to think and what not to doubt.\nPerhaps you should read some more of Dan’s material. He is a very intelligent and rational Christian, and although we don’t agree on everything, we agree on the basic structure of argument and why evidence matters. This agreement has seemed to have escaped you, so please, if we are to continue this discussion, don’t just hit me with more stuff you have been reciting since Sunday school.\n\n","date":"August 11, 2011 at 2:18 am","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","id":"comment-3569","author":"Kyle Hill","site":"shroudstory"},{"title":"The Evangelical New Atheist Movement","post":"AMEN! Keep witnessing. Kyle is just an awesome CHRISTian apologetic in the making-him and Bill Maher!\n\n","date":"August 13, 2011 at 1:44 pm","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","id":"comment-3599","author":"GODSbabygirl","site":"shroudstory"},{"title":"The Evangelical New Atheist Movement","post":"I can’t see that Athiests have any kind of plan. They mostly love dialogue. Love it. Our politicians get paid a lot to do the same thing, and they don’t get much done either. \nMy arguments are not so empty as you seem to think. It’s just that you don’t want to go down the road I am pointing out to you. I am showing you the path to God, the very gate where you may begin the journey. \nConsider a debate between Pro-Life and Pro-Choice…  The Pro-choicers insist the debate is about Choice. The Pro-Lifers insist the debate is about Life.  The debate goes nowhere because the two sides cannot agree on what the 1 core issue is so it’s a stalemate every time. Both sides are equally convinced of their position, both sides have their compelling arguments which they continue to refine, so the issue is very polarized. And it will never be resolved, it cannot be resolved under these circumstances. \nThat’s what the conversation between Christians and Athiests is like.  We’re on two different platforms, two different starting points entirely.  I’m asking you to jump platforms, essentially. It’s the only way to learn what I’m saying.  You’ll never learn it if you stay over there on your platform. \nSaying my responses are “vacuous” and I’m only reciting what I’ve learned from childhood… those are false insults and aren’t productive to the discussion. This is where your youth is showing. You’re frustrated because you can’t engage in the format that you enjoy.  I know what you wanted to do, you wanted to engage discussion on YOUR platform, not mine. So this was possibly a new experience.  I have prayed for you today, I do hope you’ll think about these things.\n\n","date":"August 11, 2011 at 3:49 am","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","id":"comment-3570","author":"AnnieCee","site":"shroudstory"},{"title":"The Evangelical New Atheist Movement","post":"@ AnnieCee: It’s spelled “atheist” . . . [edited]\n\n","date":"August 11, 2011 at 3:53 pm","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","id":"comment-3577","author":"AnnoyedChristian","site":"shroudstory"},{"title":"The Evangelical New Atheist Movement","post":"You again made my point exactly. I rest my case.\n\n","date":"August 11, 2011 at 10:02 am","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","id":"comment-3572","author":"Kyle Hill","site":"shroudstory"},{"title":"The Evangelical New Atheist Movement","post":"Kyle, you wrote :  With doubt at least you can learn something, blind faith is an unmovable tome of superstition. The scientific worldview is one consisting mainly of focused doubt, and it has proved pretty useful.  I totally agree with you !  And I am a believer and an catholic who go to the Sunday mass every week !  I am a believer but I don’t want to be like a blind man in my faith.  And I always say the doubt is the engine of faith !  I think every person with an “adult” faith have experienced doubt in his life.  You can be a believer and have doubts !  Even the Saints did !  It’s normal because it’s part of our human nature.  Since we are not complete spiritual beings yet, it’s normal.  Fundamentalists tend to be very strict in their faith because, inside of them, they experiment a great doubt.  The strickness of their religion kind of help to ease their doubts.  I really think it is the main source of fundamentalism…  They have so much fear of the doubt inside of them that they affirm their truth in a very strict way that aloud no questionning.  I don’t think it’s the best way to be a believer but we have to understand why they act that way…\n\n","date":"August 11, 2011 at 10:38 am","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","id":"comment-3574","author":"Yannick Clément","site":"shroudstory"},{"title":"The Evangelical New Atheist Movement","post":"The only way that Kyle will get the answers that he is looking for is if he gets alone with GOD in a quiet place, and HUMBLY ask GOD to reveal HIMSELF to him. If GOD can go to other non-believers, HE can reveal HIMSELF to Kyle.\n\n","date":"August 13, 2011 at 1:40 pm","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","id":"comment-3598","author":"GODSbabygirl","site":"shroudstory"},{"title":"The Evangelical New Atheist Movement","post":"Atheist… as in anti-theist.  Ordinarily I’m a good speller so thanks.  \nJesus told a story about a rich man, I’m sure Kyle knows the story. How the rich man ignored the poor beggar at his door, but when they both died, the rich man went to a place of suffering and Lazarus was comforted in the bosom of Abraham. The rich man begged Abraham to send someone back to warn his brothers. Abraham said it wouldn’t do any good. Abraham said there was plenty back there to warn anybody who was willing to listen, and the rich man’s brothers wouldn’t have any excuse when they died. \nThere’s quite a bit in this thread for anybody who is truly searching, so I think Kyle is skipping right over the good stuff. And I’m a little worried about that actually.  It didn’t turn out so well for the rich man and his brothers, when they did that. \nKyle says there’s No proof of the supernatural. Well, I’ll address that one. Here are some documented miracles that I have personally seen:  A cafeteria full of people were fed 100 hot dogs and there were 97 left over. The packages were hauled out of the garbage and counted and recounted, there were multiple witnesses and it was very thoroughly observed by many people who were there.  This was a classic “Loaves & Fishes” miracle at a church camp.  The three cooks in the kitchen were afraid there wasn’t enough food to go around, especially when even more people showed up than expected. So the three cooks prayed. There were more than three people who knew about it after lunch was over, and helped do all the counting. I was there, too, watching them doublecheck everything. My mother was one of the cooks. There were 75 people at lunch, they all had hot dogs and three people had two hot dogs. We figured that was why there were 97 leftover… \nFree gas. We were driving to visit my grandparents and it was the middle of the night and we were in the middle of nowhere with a station wagon, five kids and two adults (my parents.)  The gas tank had been on E for a very long long time. My folks prayed of course. Finally they saw a gas station that was open. They pulled in. The owner was there, filling up his boat so he could go fishing – but he let my folks buy gas.  That in itself could be considered a miraculous coincidence, but my folks put two or three gallons more in the gas tank than it could hold. If it was a 15 gallon tank, then they put in more than 17 gallons. My Dad knew how much that tank could hold. My folks figured God had given them some gas on loan, God’s sense of humor.  \nYou can dismiss these things easily just by saying “Where’s the Proof?” But they happened and there was no doubt about it. In fact, my folks got in trouble with their church for sharing about the gas tank episode and had to go to another church after that because people didn’t think God still did miracles. My folks were such new Christians they actually believed you could pray and God would answer… which He did.\n\n","date":"August 14, 2011 at 4:20 am","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","id":"comment-3604","author":"AnnieCee","site":"shroudstory"}]
