[{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"I bought Thomas’s book for a read on a recent long air flight between Australia and Europe. It’s a great resource, and he (in my view) presents quite a compelling argument for authenticity.\nYet, I do not find his theory that the Shroud inspired belief in the resurrection to be compelling, although it is quite interesting.\nI for one am a Catholic (converted from an agnostic protestant 2 years ago) who believes regardless of the Shroud. Whilst I think it is at least 60-70% likely that the shroud is authentic, if it was conclusively proven that it was of medieval origin then my faith would be in no danger whatsoever.\n\n","date":"May 6, 2013 at 8:49 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33041","author":"Matthias","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"That is the right and very good approach, Matthias.\n\n","date":"May 6, 2013 at 10:13 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33048","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"I also agree with Louis.  A faith in Christ that would rest almost solely on the Shroud would be very thin and weak in my mind.  The Shroud can be a great help to meditate on the humanity and on the Passion, death and Resurrection of Jesus-Christ and it can also be seen, like I see it myself, as a great sign (not proof) of the Resurrection of Jesus, but that should never be the corner stone of the faith of a real Christian.  The real corner stone of our faith in Christ must be found deep down our heart and not on some piece of cloth.\n\n","date":"May 6, 2013 at 10:56 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33053","author":"Yannick Clément","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"I also want to say that, from my personal experience with some of my friends who are atheists, I really don’t think they fear the Shroud !  Not at all.  And why should they fear the Shroud since it can only be seen as a sign and never as a proof of the Resurrection of Christ ?  I said it before on this blog, if the Shroud would be proven to be genuine one day, the vast majority of atheists in the world would only say something like this :  « Well, this only one more piece of evidence (along with the solid evidence coming from ancient written sources) of the reality of the existence of the historical Jesus and nothing else! »  For most of them, a proof of authenticity for the Shroud would only be seen as an archaeological piece of evidence for the existence of Jesus of Nazareth and never as a proof of his divinity or of his Resurrection (I must add :  as it should be).  In sum, I seriously doubt that a proof of the authenticity for the Shroud would have a great impact on most of the atheists in the world.  Maybe it could have some impact on some of them (or, more probably, on some agnostics who are seeking truth) but that’s it.  On a general level, I think it’s fair to say that, authentic or not, the Shroud will forever be important only in the eyes of a portion of Christians…\n\n","date":"May 6, 2013 at 11:28 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33057","author":"Yannick Clément","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"OK Yannick, this time I agree with your above comments.\n\n","date":"May 6, 2013 at 1:08 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33073","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"YC; “On a general level, I think it’s fair to say that, authentic or not, the Shroud will forever be important only in the eyes of a portion of Christians…” …and MAYBE, I would add, thats’ who it’s meant for. In this ever secular world we live in, it may be here to strengthen our convictions and to help those that may start to fall from the faith. The written word is strong but in the modern world, images speak volumes.\nR\n\n","date":"May 6, 2013 at 1:38 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33078","author":"Ron","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Quote : “it may be here to strengthen our convictions and to help those that may start to fall from the faith”\nDon’t forget also what I said about the agnostics.  I’m convinced that the Shroud can help some of them (probably not a majority of them but some anyway) to start a reflection about Jesus-Christ.  The Holy Spirit blow anywhere he wants and he often used “tools” like the Shroud of Turin to do so!\nBut when it comes to convinced atheists, forget it!  It’s not a bloody burial shroud with a ghostly Christ on it that will make them reconsider their position!\n\n","date":"May 6, 2013 at 4:08 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33087","author":"Yannick Clément","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"An important frequently overlooked question: “Why is the image that of an uncorrupted body, why are there no smears or tears in the cloth from removal of the body from its sticky surroundings, and where is the body that goes with this burial cloth??” There is only one reasonable answer!\n\n","date":"May 6, 2013 at 6:48 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33097","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Dave…  Here’s one much more important question to ask yourself :  Why such a gruesome bloodstain burial cloth has been removed from the tomb and carefully preserved until today?\nThis is the most important sign of the Resurrection of Christ a Christian can found while looking at the Shroud…  In other words, the Shroud itself IS THE SIGN!\nAt the very least, the simple fact that such a gruesome cloth was kept and carefully preserved until today is a proof that there were some people around Jesus who were firmly convinced that he was resurrected, or else, nobody would have dare, care and/or think to keep such a bloodstained burial cloth, which was in direct contact with the dead and tortured body of a criminal…\n\n","date":"May 6, 2013 at 7:26 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33102","author":"Yannick Clément","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Regarding the issue of Jesus with long hair, I wrote an article on the subject here. I emailed several scholars on the subject, and they didn’t provide much that was helpful, so I pulled together some resources I found in my own research.\nIf we want Christians (and others) to stop objecting to the Shroud on the basis of the length of the hair that’s depicted, then we ought to respond to that objection in detail and with direct and persuasive counterarguments. (It’s not enough to just quote a scholar, or more than one of them, saying that Jesus could have had long hair. Many people will want to know what evidence leads a scholar to that conclusion.) If we’re just dismissive of the objection, without addressing it in sufficient detail, then we’re not going to persuade people we might otherwise have persuaded, and we might alienate them even further. Some fundamentalists, atheists, and other people who often object to the Shroud could be persuaded if they’re offered evidence and argumentation. The fact that somebody currently holds a particular position, such as atheism, doesn’t tell you how close he is to transitioning to some other position or what would bring about that transition. But even if an atheist is unreasonable, why focus on him? Other people are looking on. In an online forum like this one, you don’t know who’s reading your posts. A good general approach to take is to follow the example set by the apostles in Acts: “explaining and giving evidence…welcoming all who come” (Acts 17:3, 28:30). The Holy Spirit converts people to Christianity supernaturally, but he often does so through evidence and argumentation. God, after all, is the one who gave us our minds. It’s not as though he’s opposed to the sort of intellectual activity that we see in Acts and so many other places in the Bible. To the contrary, anti-intellectualism is a sin. \nDan mentioned Thomas de Wesselow. Of course, Barrie Schwortz is another non-Christian who accepts the Shroud. Another non-Christian who comes to mind is Michael Prescott. He operates a popular paranormal blog, and he thinks the Shroud is authentic, even though he’s not a Christian.\nThe Shroud is evidence of Jesus’ existence, and I think it’s evidence of his resurrection. But those aren’t the only issues involved. The Shroud also has implications for the accuracy of the gospels, for example (Jesus’ age, that he had something like a crown of thorns placed on his head, that he was crucified with nails, that he was pierced through his side, etc.). If an atheist were to accept the Shroud, yet deny that it implies Jesus’ resurrection, he’d still have to address what the Shroud implies about the accuracy of early Christian sources on other subjects.\n\n","date":"May 6, 2013 at 6:53 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33098","author":"Jason Engwer","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Quote : “I think it’s evidence of his resurrection.”\nComment :  I think you might consider changing the word “evidence” in that sentence for the more proper word “sign” because I really wonder where you find a real piece of evidence of the Resurrection on that cloth…  If there was one, then I think the Shroud could really convert people, but the truth is :  there’s none (except maybe in the eyes of those who already believed in Christ).\n\n","date":"May 6, 2013 at 7:31 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33104","author":"Yannick Clément","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Yannick, using the term ‘sign’ is a little weak considering the point mentioned by Daveb in his post above. I could say the “evidence” is smack dab in front of you, in that the body image and blood traces show absolutely NO SIGN of tampering…How is this possible? …It isn’t, and there is your proof/evidence of the ressurection.\nR\n\n","date":"May 7, 2013 at 3:53 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33126","author":"Ron","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Yannick,\nI don’t know just what distinction you’re drawing between a sign and evidence. But I agree with Ron. In the way in which I use the term “evidence” and have seen others commonly use it, I think it’s an appropriate term here. But you may be defining the term differently, and your objection may make sense under a different definition.\nWe have good reason to believe in Jesus’ resurrection on grounds that are independent of the Shroud. Something left an image on the cloth and the body was removed, in the manner referred to by daveb and Ron above. The timing of the image and body removal line up well with the timing of the resurrection reported in the ancient sources. The resurrection is the best explanation we have for the combined data of the image formation, the body removal, and the timing of those events. What’s the alternative? That some highly unusual natural event, which would explain the image formation and/or body removal, happened to occur around the time of the resurrection? That some supernatural event other than the resurrection, which would explain the image formation and/or body removal, happened to occur around the same time? We already have good reason to accept the resurrection, and it explains the Shroud so well. Why look for some more complicated and more speculative alternative?\n\n","date":"May 7, 2013 at 6:13 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33139","author":"Jason Engwer","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"I was talking about evidence in term of scientific proof.  Of course, with the eyes of faith, you can use the term “evidence of the Resurrection” when you consider, for example, the undisturbed aspect of the bloodstains.  Barbet did it too.  But personally, I prefer to use the term “sign” in that case because no profesionnal and honest scientist would conclude that the vanishing of the body from inside the shroud is the only sure way to obtain such a result.  There will always be some space for other more “rational” explanations like this one :  It is possible to imagine that the body was extracted from the Shroud while the blood clots were still very humid and that would account for the fact that there not seem to be broken fibers in the bloodstains area and the bloodstains don’t look to have been disturbed.  Of course, such a rational explanation is somehow contradict by the most probable fact that the body must have stayed inside the cloth for at least 24 hours (that was Vignon estimation) in order to get a natural formation of the body image on the surface of the cloth, but who can be totally certain about that since we’re still unsure of the correct image formation process ?  So, in the case of the Shroud, I really prefer the term “sign of the Resurrection” because it refers to the faith you have in that event and avoid, at the same time, to make believe that there can be some sure scientific proof of that event on the cloth, which will never be the case I’m affraid.\n\n","date":"May 7, 2013 at 8:32 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33149","author":"Yannick Clément","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Yannick, I agree that we don’t have “sure scientific proof”. But I don’t think people usually have that concept in mind when they refer to “evidence”. Historians often refer to historical evidence for a conclusion when they have nothing more than a probability in mind.\n\n","date":"May 7, 2013 at 5:54 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33201","author":"Jason Engwer","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Dan,\nHave you considered including a more extensive topical index on your blog? Maybe have a section on your side bar that links to posts on a wider range of topics that frequently come up (like the objection based on the length of Jesus’ hair). That would make it easier for people to find things on the blog, and it would save you and others time when those topics come up again in the future.\nAlso, have you ever put together a collection of audio and/or video files on the Shroud? Or do you know of anybody else who has? If nobody’s done it yet, it would be a good idea to have a large collection of audio files on Shroud-related topics, for example, in one location.\nMaybe you’ve already done these things, and I don’t know about it. If you haven’t, I don’t want to burden you with it. I’m just making suggestions, if you’d have the time and interest to do these things at some point. Regardless, I appreciate the work you’re already putting into the blog. It’s a valuable resource.\n\n","date":"May 6, 2013 at 7:12 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33100","author":"Jason Engwer","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"So its a question of Believe in the Shroud because of Jesus and believe in Jesus because of the Shroud?\n\n","date":"May 6, 2013 at 7:18 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33101","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Seriously, I don’t think many people on the planet believe in Jesus because of the Shroud.  On the other hand, I’m certain that there are many people on this planet who think and reflect about Jesus life, teaching, Passion, death and Resurrection because of the Shroud and that’s quite a feat in itself for such a gruesome cloth.\n\n","date":"May 6, 2013 at 7:28 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33103","author":"Yannick Clément","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Thank you, Jason.\nI have never heard that anybody anywhere was objection to the long hair at that time – people had so many different hairstyles, and since society was so separated depending on the social ladder there is no reason not believe long hair together with a shorter one was totally possible.\nJesus Christ is traditionally depicted with long hair both in the Western and Eastern tradition – so there should be some ground to that\n(The comments on your blog are hilarious))))\n\n","date":"May 6, 2013 at 8:58 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33107","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"jesterof wrote:\n“people had so many different hairstyles, and since society was so separated depending on the social ladder there is no reason not believe long hair together with a shorter one was totally possible.” \nI agree. Some of the scholars I wrote to on this subject made similar points. There probably would have been a wide variety of hairstyles, influenced by factors like where people were on the social ladder of their day.\nStill, although the principle you’re appealing to makes sense in the abstract, it’s helpful to have some concrete examples of long hair being accepted in ancient Jewish contexts. That’s what I wanted to provide in my article.\n\n","date":"May 7, 2013 at 5:51 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33135","author":"Jason Engwer","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Some various interesting issues raised above. My comments: \n1) Jason – Jesus & long hair.\nCheck out any image collection of Jewish Rabbis. For example:\nhttp://www.fotosearch.com/photos-images/rabbi.html\nExcept for modern liberals/radicals, and lady rabbis, they all usually wear long hair and untrimmed beards. There are any number of other examples. Just Google ‘jewish rabbis images’, there are vast quantities of images of Jewish rabbis. When archaeologists start digging in Jerusalem, they are soon confronted by long-haired bearded ultra-orthodox ready to stone them. Check out the recent video of Barrie Schwortz. Sparse and all as it may be (still more than what I have), Barrie wears what hair he has, long and there’s also a tuft of beard! \nThe earliest icons of Jesus tended to follow the Greek & Roman models of short hair and were beardless. There was a major change in the 6th century to a long-haired bearded Jesus, and there are strong correspondences with the Shroud image suggesting it may have been the template for the facial image. St Augustine claimed that no-one knew what Jesus looked like. But he lived in the West and wouldn’t have understood the reasons for these icon representations. \nThe evangelicals’ argument for a short-haired beardless Jesus, seems to be little more than a recent reaction to traditional Catholic portayals of Jesus. Possibly they may be influenced by their own westernised image of what constitutes proper Christian appearance. In other words they seek to make God in their own image and likeness instead of the other way around. Thankfully they haven’t yet got him in a white shirt and tie with matching dark jacket and pin-striped trousers! \n2) Did Jesus exist?\nThe idea that Jesus never existed as a real person is far more prevalent than is generally realised. There is a considerable body of scholarly opinion ready to argue that Jesus is little more than a fanciful re-creation from classical myths and legends. These assertions are addressed in an excellent work “Did Jesus Exist” by Bart Ehrman, an agnostic professor of New Testament studies, currently head of Religious Studies at University of North Carolina, Chapel Hill. Ehrman makes a strong case for the existence of Jesus as a real historical person, providing several independent sources, and responding to the denyers.  Check out his blog site at:\nhttp://ehrmanblog.org/did-jesus-exist-as-part-one/\nHis book is available through Amazon. I read a copy from my local public library. \nThe Shroud gives testimony that a person suffered the extreme punishment of crucifixion in a manner described by the gospels, and provides supplementary corroboration of the real existence of the man Jesus. \n3) Question of the reality of the Resurrection:\nSome 15 years or so ago, I presented a seminar paper on the works of Catholic radical theologian Hans Kung. It seemed to me as I recall that Kung was prepared to interpret the Resurrection as a mystical or symbolic event, but which had no necessarily historical reality. At the time, I thought that here was an interpretation that many would-be Christians would be able to accept, and so remove a hurdle to their belief. It is a fact of our times that many would-be Christians are of a similar view, that the Resurrection as a real historical event is a hurdle that denies their full acceptance of Christianity. The liberal radicals, such as those in the ‘Jesus Seminar’ cannot accept it, seeing it as illogical and unthinkable. \nIn my previous posting #8 above, I posed a set of questions concerning the Shroud:\n“Why is the image that of an uncorrupted body, why are there no smears or tears in the cloth from removal of the body from its sticky surroundings, and where is the body that goes with this burial cloth??” There is only one reasonable answer!\n\n","date":"May 6, 2013 at 11:39 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33111","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"“Some 15 years or so ago, I presented a seminar paper on the works of Catholic radical theologian Hans Kung. It seemed to me as I recall that Kung was prepared to interpret the Resurrection as a mystical or symbolic event, but which had no necessarily historical reality. At the time, I thought that here was an interpretation that many would-be Christians would be able to accept, and so remove a hurdle to their belief. It is a fact of our times that many would-be Christians are of a similar view, that the Resurrection as a real historical event is a hurdle that denies their full acceptance of Christianity. The liberal radicals, such as those in the ‘Jesus Seminar’ cannot accept it, seeing it as illogical and unthinkable.”\nDaveb- not sure about the last sentence. Isn’t Marcus Borg part of the ‘Jesus Seminar’? My understanding is that Borg accepts the Resurrection as a real historical event, not in the sense of a physical bodily resuscitation, but in the sense of a spiritual bodily resurrection? ie. he appeared to the disciples as a real SPIRITUAL BODILY PRESENCE / VISION. This was of course recast in some parts of the Bible into a “bodily resuscitation” type of resurrection to accord with Jewish belief and to try and make tangible what we can only assume to be an experience of the risen Christ as a spiritual body that was so real that it also “Seemed” physical.\nPaul of course tends to emphasise the “Spiritual Body” aspects of the resurrected Jesus, over a skin and bones resuscitation.\nIs it necessary to believe in the resurrection of Jesus as a real historical event to be a Christian???…\n\n","date":"May 7, 2013 at 4:56 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33128","author":"Matthias","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Spiritual bodily presence? What is that precisely, and how does it differ from bodily resurrection?\nDoes it require a dead individual’s intangible soul, spirit call it what you wish, to depart the mortal remains, and then somehow re-materialize elsewhere while the remains are still undergoing post mortem changes in their original location?\nThere’s surely a problem with that – namely with the risen Christ having been at pains to display nail wounds and wound in the side. Why would a re-materialized spirit still carry the mortal injuries that had caused death?  Suppose that Christ, instead of being crucified, had been beheaded. Resurrection as a spiritual bodily presence that still  conserved the physical signs of the manner of death would have resulted in an inability to communicate via speech – which as we know requires continuity between lungs and voice box. Or suppose he had been burned at the stake? How would a spiritual bodily presence have appeared to onlookers?\n\n","date":"May 7, 2013 at 5:49 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33133","author":"colinsberry","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"The ancient Christians and their Jewish opponents were in agreement that the tomb was empty, as we see in Matthew’s gospel, Justin Martyr, and other ancient sources. The dispute was over how the tomb became empty, not whether it was empty. The idea of a non-physical resurrection is highly inconsistent with the evidence we have. Paul and the other early Christians held the traditional Jewish belief in a physical resurrection.\nFor a lengthy refutation of the notion that Paul and other ancient Christians believed in a non-physical resurrection, see Michael Licona’s The Resurrection Of Jesus (Downers Grove, Illinois: InterVarsity Press, 2010), which is based on his doctoral dissertation on the subject. For example, he writes the following about 1 Corinthians 15:44\n“Moreover, it is worth observing that had Paul desired to communicate this sort of contrast [between the physical and the non-physical], he had better words at his disposal, one of which he had employed just a few chapters earlier [in 1 Corinthians 9:11] while using a seed analogy similar to that of 1 Corinthians 15….if he had desired to communicate that our resurrection body would not be physical but rather immaterial in nature, why use the former term in a sense not employed earlier in his letter or for that matter anywhere else in the Pauline corpus, the New Testament or by any known author from the eighth century B.C. through the third century A.D., while ignoring a clearer term used just a few chapters earlier in a similar seed analogy?…I located 846 occurrences of the former [the term ‘natural’ in 1 Corinthians 15:44] from the eighth-century B.C. through the third-century A.D. and could not locate a single occurrence of the term that meant ‘physical’ or ‘material.’ This discovery in itself eliminates any interpretation of 1 Corinthians 15:44 that has Paul asserting physical corpses are buried while resurrection bodies will be immaterial (a la Wedderburn, RSV/NRSV et al.).” (414-415, 618)\n\n","date":"May 7, 2013 at 6:22 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33141","author":"Jason Engwer","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Daveb the Ehrman text is interesting. I need to look into his work more. I think he is an atheist?\nHe says:\n“how is it that within sixty years of his death his followers were saying that he was a divine being”\nActually Paul was first writing about 20 years after Jesus’s death that Jesus was divine. That’s a pretty short time frame ,especially as many who were alive when Jesus was preaching and was crucified were still around circa AD50.\nI expect Ehrman will present an atheistic explanation for Jesus’s presentation amongst his followers as a divine being\n\n","date":"May 7, 2013 at 5:51 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33134","author":"Matthias","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"More on long hair:\nThe evangelicals main scriptural argument for a short-haired Jesus, comes from I Corinthians 11:14. The USCCB version reads: “Does not nature itself teach you that if a man wears his hair long it is a disgrace to him.”  The Jerusalem Bible has the milder translation: “… and whether nature itself does not tell you that long hair on a man is nothing to be admired,…” \nNow Paul was addressing this to the brethren in Corinth, a long way from Jerusalem. He himself was from Tarsus in Cilicia, (now southern Turkey) which in 67 BC, became a province of Rome under Mark Anthony. Tarsus also had a famous school of Stoic philophers, and Paul enjoyed Roman citizenship as a privilege granted the previous century to his military forbears. So we are talking fashionable Greek and Roman hair styles here, and not how a proper Jew in Jerusalem might groom himself.\nAs Saul, he had joined the Pharisee sect, avid for the literal compliance with the Law of Moses, but upon his conversion he seems to have turned his back on this and now castigated this Law which could not save. His mission was concerned with gentiles, Greeks and Romans, and the Jews had rejected him.  He himself had only ever seen Jesus as if in a vision, not in ordinary mortal life. \nHe closes off the discussion at verse 16: “But if anyone is inclined to be argumentative, we do not have such a custom, nor do the churches of God.” The whole section vv 4-16, is directed at appropriate dress in a Corinthian Christian church, no room for any long-haired hippies hair nor weirdie beardies. Nevertheless, long hair and beards continue to be the normal style in Jewsish congregations to this very day. Jesus had long hair and a beard! I wonder if Paul would have banned him from attending church? \nInteresting Shroud foot-note on Tarsus. During the Roman and early Byzantine periods, Tarsus was one of the leading cities of the Eastern Empire, with an economy based on agriculture and AN IMPORTANT LINEN INDUSTRY. Modern Tarsus continues to be a prosperous agricultural and cotton-milling centre.\n\n","date":"May 7, 2013 at 1:45 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33116","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"daveb,\nLong hair on men is widely accepted among Evangelicals. (I’m an Evangelical myself.) Depictions of Jesus in Evangelical contexts frequently portray him with long hair. It’s common in artwork, movies, etc. I think only a small minority of people in Evangelical circles object to the long hair on the Shroud. But that minority is disproportionately vocal and has a significant tradition behind it.\nI’m familiar with the argument from long hair on modern Jewish men. While that argument has some significance, it doesn’t carry much weight. We’re two millennia removed from Jesus. Traditions often change over time, including on matters more important than hairstyle. We should be focused on the evidence we have for hairstyles closer to and before the time of Jesus. (I’m including the pre-Christian era because opponents of long hair often suggest that ancient Jews or ancient cultures in general, not just right around the time of Jesus, were opposed to long hair on men.) It’s not enough for advocates of the Shroud to just do something like point to long hair among modern Jewish men or cite scholars claiming that ancient Jewish men had long hair, without any accompanying evidence. We ought to do more than that. In my experience, though, those who are defending the Shroud seldom do more.\nI agree that 1 Corinthians 11:14 is important in this context. I address the passage (by linking to some other articles on it) in my post I cited earlier.\nThe apostle Paul spent a lot of time in Israel and was highly knowledgeable about Jewish life. We have good evidence that he saw the risen Jesus, performed many authenticating miracles as an apostle, and was supported in his authority claims by the other apostles and mainstream early Christianity in general. Paul is a highly credible historical witness, one whom Christians are obligated to obey. We shouldn’t be dismissive of Paul or 1 Corinthians 11. And neither Paul’s work in general nor 1 Corinthians 11 in particular is inconsistent with the Shroud.\n\n","date":"May 7, 2013 at 5:40 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33132","author":"Jason Engwer","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Colin\nI have no answer to your questions, these are questions that theologians have debated for centuries!!! These are eternal questions of faith that science will never be able to answer.\nI am entirely comfortable with placing my faith in this great mystery. Others (ie atheists) may not be. That is just fine.\n\n","date":"May 7, 2013 at 5:56 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33136","author":"Matthias","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"So have I got this right? One can have faith in the authenticity of Shroud – but without having to buy into physical resurrection of mortal remains. One has simply to propose the appearance/re-materializing elsewhere of a spiritual bodily presence that is a kind of facsimile of the original (celestial 3D printer?) given it still conserves all of the final physical features of the deceased, right down to the details of the subject’s manner of death. \nI can’t say as I’m surprised that centuries (at least) of debate are needed resolve what some might see as something of a logical self-contradiction, or less charitably, perhaps, an inspired fudge.\n\n","date":"May 7, 2013 at 6:19 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33140","author":"colinsberry","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Colin said:\n“There’s surely a problem with that – namely with the risen Christ having been at pains to display nail wounds and wound in the side”\nNot all the Gospels argue this, and Paul does not write of the risen Christ in this way . I am of the view that this inconsistency is best explained as an effort to try and imagine the resurrection as essentially a “physical resuscitation” to accord with the dominant Jewish view of resurrection, or for other reasons that I am sure theologians have put forward.\n\n","date":"May 7, 2013 at 6:02 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33138","author":"Matthias","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Matthias,\nEvery gospel has the tomb empty. Three of the four have Jesus being physically touched and so forth. The only reason why Mark doesn’t is because his gospel ends at Mark 16:8, where the resurrection appearances have been promised, but haven’t been narrated.\nAs 1 Corinthians 15:1-11 indicates, Paul was in agreement with the other early Christian leaders with regard to the resurrection. Later in the same passage, he refers to Jesus’ resurrection as the firstfruits of the future resurrection of believers, which is more than just a resuscitation. Furthermore, 1 Timothy 5:18 most likely is citing Luke’s gospel as scripture. Thus, Paul is indirectly affirming Luke’s highly physical portrayal of the resurrection. (I believe that Paul wrote 1 Timothy, but even if one were to reject that view, the document still represents the early beliefs of people who were close to Paul and thought highly of him. There’s a good chance that their view would be the same as Paul’s. Surely we wouldn’t assume that they contradicted Paul as our default position.) The earliest Pauline churches, as reflected in the early patristic literature, also accept a highly physical view of Jesus’ resurrection like that found in the gospels. This sort of evidence, and much more could be cited, suggests that Paul and the gospel writers held the same view of Jesus’ resurrection.\n\n","date":"May 7, 2013 at 6:35 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33142","author":"Jason Engwer","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"1) Long hair again:\nFirstly I am not being dismissive of 1 Cor 11:4-16. But I see it in the context of what was to be considered the proper conformity of dress and appearance of a Corinthian Christian in the 1st century, as addressed by a missionary well familiar with Greek and Roman culture. It might be seen as unnecessarily socially provocative not to conform in this way. To then argue that therefore Christ was necessarily short-haired and beardless is grasping a straw and to read a message into scripture that is not there. \nIan Wilson in his 2010 book “The Shroud” gives several pictorial or iconic images of Christ. Until the 5th century, there were occasional portrayals of Christ as short-haired and beardless. From the 6th century, concurrent with the discovery of the Image of Edessa, whatever that might have been, the icons become standardised with long hair and forked beard. \nYou may look in vain for images of 1st century Jews to discover their hair style, as you would be aware that they were averse to any kind of images. However in his 1978 “The Turin Shroud”, Wilson cites two authorities quite independently of the Shroud, H Gressman and Daniel-Rops. Gressman’s work is in German; Daniel-Rops work is “Daily Life in Palestine at the Time of Christ” (Londom Weidenfeld 1962). Wilson points out that Aaron, Moses’ brother is specifically stated as having a beard, and beards were only shaved off as a sign of deepest mourning.\nGressman has apparently shown that an unbound pigtail was a common fashion for Jewish men in antiquity in the simple form of long hair caught at the back of the neck. Daniel-Rops claims that except on public holidays Jewish men wore this pigtail plaited and rolled up under their head-gear.\n2) Matthias – Bart Ehrman:\nEhrman as I recall claims to have been brought up as a conservative evangelical. He now claims to be an agnostic, not necessarily an atheist. Nevertheless he seems to be an excellent New Testament scholar, and his work on “Did Jesus Exist” I found quite intriguing. I found I was not able to agree with him on some minor technical details. For example he denies the the idea of the resurrection cycle of ancient fertility gods. I was only too well aware of the Phoenician Baal cycle epic having presented a seminar paper on that topic, which would contradict Ehrman’s viewpoint. There also seemed to me to be a few other minor errors. As he claims to be an agnostic, I would be cautious in accepting what he might have to say about Christ’s divinity, not having read the work. However he might have a useful perspective on how this viewpoint developed in the early church if based on cited sources, as I expect he would. \n3) Importance of Resurrection – Marcus Borg:\nI rather suspect that Borg’s viewpoint might not be too far removed from Kung’s which I mentioned previously. I mentioned that it had some appeal for me at the time I read it, as I saw it as removing a barrier to Resurrection skepticism. I no longer hold this view, partly because the Shroud persuades me that it was a real historical event. As for what Resurrection is or was, we only have the NT accounts, supplemented by various orthodox Christian writers, to be read with proper judgment, and an authoritative teaching church. I cite Paul from memory: “If Christ be not risen from the dead, then our faith is in vain!”\n\n","date":"May 7, 2013 at 8:01 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33147","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"daveb wrote:\n“Firstly I am not being dismissive of 1 Cor 11:4-16. But I see it in the context of what was to be considered the proper conformity of dress and appearance of a Corinthian Christian in the 1st century, as addressed by a missionary well familiar with Greek and Roman culture. It might be seen as unnecessarily socially provocative not to conform in this way. To then argue that therefore Christ was necessarily short-haired and beardless is grasping a straw and to read a message into scripture that is not there.”  \nI agree.\nYou write:\n“You may look in vain for images of 1st century Jews to discover their hair style, as you would be aware that they were averse to any kind of images. However in his 1978 ‘The Turin Shroud’, Wilson cites two authorities quite independently of the Shroud, H Gressman and Daniel-Rops. Gressman’s work is in German; Daniel-Rops work is ‘Daily Life in Palestine at the Time of Christ’ (Londom Weidenfeld 1962).” \nI was aware of both sources, and I got a copy of one of Daniel-Rops’ books last year, when I was researching my article. I didn’t find any extra-Biblical documentation in his book, and I was already familiar with the Biblical data. I’ve come across a lot of sources of that nature. They make a claim about ancient hairstyles, but they don’t offer much support, if any, for their claim. The testimony of scholars has some value, but it would be better if their claims were accompanied by evidence.\nI haven’t checked Gressman. I don’t know much German.\nThere are some images depicting Jews in and around the first century, largely images produced by Gentiles. I mention some of them in my article. We also have comments on Jewish hairstyles in some ancient literature. Scholars could cite such sources when discussing this subject, but they often don’t. Maybe Gressman does. If Daniel-Rops does so, it must be somewhere other than where I read him. The scholars I emailed didn’t have much to offer, and they often commented on how little evidence there is to go by.\n\n","date":"May 7, 2013 at 6:20 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33203","author":"Jason Engwer","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Re Yeshua, long hair: his post-psychologically-and-physically-traumatic-death physical resuscitation/Resurrection could have resulted in acute alopecia/hairloss (or alopecia universalis or alopecia areata universalis as  autoimmune disorder). This could account for Mary of Magdalene mistaking him for the gardener (Second Temple period gardeners used to wear a sindon as workwear and be hairless to be easily recognizable as their contact was a possible source of ritual impurity). Since Yeshua used to wear long hair, beard and moustache, after his post-resuscitation/Resurrection acute alopecia, they just could not recognize him.\n\n","date":"May 7, 2013 at 8:32 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33150","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"This is my personal opinion as a cryptologist.\n\n","date":"May 7, 2013 at 8:38 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33151","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"But Christ was not interred in a crypt, was he, but a cave or rock tomb, so how can you be a cryptologist? (A crypt – from the Latin crypta from the Greek κρύπτη, kryptē; meaning concealed, private – is a stone chamber or vault beneath the floor of a burial vault possibly containing sarcophagi, coffins or relics).\nMy Latin’s a bit rusty now, but I reckon you would be entitled to describe yourself as a speluncamologist. It sounds so much classier and exclusive, don’t you think, than than that misleading “cryptologist”?\n\n","date":"May 7, 2013 at 9:15 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33158","author":"colinsberry","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Foodie getting thicker and thicker. Non requiescat in pace?\n\n","date":"May 7, 2013 at 10:05 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33161","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"If you want to convert information from a readable state to real nonsense, just ask CB the Foodie.\n\n","date":"May 7, 2013 at 10:23 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33163","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"…the foodie Sindonospoilogist that is.\n\n","date":"May 7, 2013 at 11:06 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33168","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Needless I don’t belong to any Synagogue, Mosque, Church or Temple. I am a free thinker.\n\n","date":"May 7, 2013 at 8:59 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33154","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"…and speaker.\n\n","date":"May 7, 2013 at 9:00 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33155","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"(even when subjected to threats of censorship)\n\n","date":"May 7, 2013 at 9:01 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33156","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Archaeo(crypto)logical truth is my sole agenda as far as the Turin Shroud is concerned.\n\n","date":"May 7, 2013 at 9:04 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33157","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"foodie tries to parade around his knowledge of languages :LOL:\n\n","date":"May 7, 2013 at 10:41 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33166","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"With respect to long hair, has anyone considered the possibility Jesus was a Nazarite from the Essene sect?  \nSee the Jewish encyclopedia article:\nhttp://www.jewishencyclopedia.com/articles/11395-nazarite \nAs well, please note the following:\nExcerpt:\n “Munk says that the “Nazireate was an institution established before the laws of Musah.” This is evident; as we find this sect not only mentioned but minutely described in Numbers (chap. 6). In the commandment given in this chapter to Moses by the “Lord,” it is easy to recognize the rites and laws of the Priests of Adonis. The abstinence and purity strictly prescribed in both sects are identical. Both allowed their hair to grow long, as the Hindu cœnobites and fakirs do to this day, while other castes shave their hair and abstain on certain days from wine. The Prophet Elijah, a Nazarene, is described in II Kings and by Josephus as “a hairy man girt with a girdle of leather.” And John the Baptist and Jesus are both represented as wearing very long hair”\nhttp://www.wisdomworld.org/additional/christianity/Jesus-ATrueNazarene.html\nBest,\n\n","date":"May 8, 2013 at 7:56 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33286","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Hullo Angel\nYou can be sure that Jesus was anti-Essene because he did many of the things the Essenes prohibited. The Essenes also had some strange esoteric beliefs since they were a fringe group and it is not clear if they influenced John the Baptist because there were many baptismal groups and “free-lance” baptizers around in the desert region. If Jesus was a Nazarite he would have to make vows and take pigeons to the Temple for blood sacrifice and it is highly improbable that he would agree with these things.\nBest.\n\n","date":"May 8, 2013 at 8:29 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33288","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Hi, Louis and thank you.\nIs it possible the two turtle doves offered by Jesus’ mother, Mary, covered Jesys’ Essene animal sacrifice, as well?\nWhy would Pope Benedict XVI make this statement in the following article, dating back to 2007?\nPope suggests link between Jesus and mysterious Essene sect\n “In addition, the pope said Thursday, Jesus celebrated Passover “without a lamb, as did the Essene community,” which did not sacrifice animals. “Instead of the lamb he offered himself, he offered his life,” Benedict added.” \nhttp://ejpress.org/article/15698\nBest,\n\n","date":"May 8, 2013 at 9:54 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33290","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"typo.  3rd line should read “covered Jesus’ Essene animal sacrifice…\n\n","date":"May 8, 2013 at 9:55 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33291","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"It is certain that Jesus was not an Essene. The sect observed a form of ritual purity even more extreme than the Pharisees which is completely at odds with the teachings of Jesus in the gospels.  However, it is possible that the group of Jesus and his followers may have observed the Essene calendar which was more ancient than then commonly observed. We might speculate whether the Essene calendar still prevailed in Galilee. Scholars have attempted various explanations for the disconnect between the Synoptics and Johannine gospels on this point. \nThe Paschal lamb sacrifice was associated only with the first night of the Exodus and after that only upon the entry into the Promised Land and while both Solomon’s Temple and the Second Temple still functioned. It would not have been observed during the Babylonian Exile. It was discontinued with the destruction of Jerusalem in 70 AD. It is now only practised by Samaritans on Mount Gerizim. The Jewish Seder meal now only includes a lamb’s shank bone in memory of those times. A Jewish group in recent times sought to resume the sacrifice on Temple Mount but the authorities rejected the proposal as being too provocative. \nAs the requirement for a paschal lamb involved temple sacrifice, a conventional paschal lamb would not have been available at the Last Supper if John’s account that the crucifixion occurred on Preparation Day is accepted. We may conjecture that the early Christians, including the evangelists may have read back into the Last Supper (a farewell meal) the meaning of a Passover meal with Jesus as the symbolic Paschal Lamb, and with the Passover observance so imminent. In many respects, such as the timing of the crucifixion when the lambs were to be sacrificed, this symbolism is singularly appropriate.  \nJohn P Meier addresses the issue in his “Marginal Jew”. The following is an extract from my notes:\n“Although all evangelists agree that the crucifixion occurred on a Friday, John’s gospel asserts that this was also Preparation Day (Jn 19:31) making the Sabbath (Saturday) the day of Passover, a Sabbath of special solemnity therefore, and the reason why the bodies could not remain on their crosses.”\n“The synoptics on the other hand seem to envisage that the Last Supper was intended as the meal for Jesus and his disciples to observe their Passover.  Scholars have attempted assorted solutions to resolve this problem.  These have included assertions that there were various practices within Jewry, including one claiming that the meal actually occurred on a Tuesday thus allowing more time for the subsequent events to unfold, or that the synoptic verses connecting the meal to Passover were late stage insertions.  Meier opts for John’s statement that Friday was in fact Preparation Day, making the year either 30 or 33 AD.  Possibly the first Christians saw the Last Supper, with its institution of the Eucharist, as supplanting the Passover rites, and therefore ascribed it a comparable status in the synoptics.” (Meier finanally adopts Thursday, April 6, 30 AD for the evening of the Last Supper)\n\n","date":"May 9, 2013 at 5:29 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33310","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Hi!\nYou may be correct, David.  I haven’t researched the Essenes to any great length and thought, because of their purification/baptismal rituals, this may be a possibility.\nOn the other hand, I have researched the birthday of Jesus.  There is much evidence Jesus’ birthday was April 17th, 6BC (BCE).  See the ancient coin found and an explanation of the star/planet alignment on the link below:\nThe Star of Bethlehem: The Legacy of the Magi\nhttp://www.eclipse.net/~molnar/\nRemembering, Aries is the sign of the Ram and Jesus was the sacrificial lamb; therefore, there may be truth in this date.  As well, this would place the age of Jesus at approximately 42 and the question to Jesus by the Pharisees “You are not yet 50 years old and you have seen Abraham?” would verify the age of Jesus as being in his 40s.  Had Jesus been in his 30s, the Pharisees would have said, “You are not yet 40 years of age.”\nEven the facial image on the Shroud looks to be a man in his 40s, not 30s. \nWhat are your thoughts?\nBest,\n\n","date":"May 9, 2013 at 3:22 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33350","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"A quick check of Michael Molnar’s eclipse web-site and the summary book reviews suggest he seems to have done a thorough job of research, on the astronomy events, and the then cultural perceptions of astrology. However I would certainly hesitate to place any significance on astrological interpretations or predictions. There have been various suggestions for an explanation of the Star of Bethlehem as there were a number of planetary conjunctions around this time. For eight months in 7BC, Jupiter and Saturn were within 3 degrees of each other; There was a triple conjunction of Mars, Saturn and Jupiter in early 6BC. Chinese annals record novae in 5BC and 4BC. \nAs to Jesus’ age, you need to relook your math. If born in 6BC, he would be aged 36 in 30AD and aged 39 in 33AD, the two favoured dates for the crucifixion when Preparation Day fell on a Friday. Herod the Great died in 4BC, so 6BC is a credible date for Jesus’ birth. From Luke 3:1, John the Baptizer began his preaching between the Augusts of 28AD and 29AD. This would support the synoptic inference of 18 months for Jesus’ mission if he died in 30AD but is a problem for the 3 year mission inferred from John’s gospel.\nIt cannot be known if Matthew’s story of the “magi” and the star is recording a real event or is a literary device. For example no other source records Matthew’s story of Herod’s slaughter of the infants, although there were several riots in Jerusalem around this time resulting in mass crucifixions and Herod’s arteriosclerosis had advanced, making him mentally unstable.  \nThere are three reasons why Matthew would use such a literary device. The first is that astrological signs were an accepted way of underlining and emphasising the importance of major events, such as the birth of a messiah, king or great leader. The second reason is that Matthew is speaking to a gentile church, so he brings in gentile wise men (Luke has Jewish shepherds). Matthew includes gentiles in Jesus’ genealogy and Jesus cures a Roman centurion’s servant and a Canaanite’s daughter.  A third reason is that Matthew wants to proclaim Jesus as the new Moses and so wants to bring him out of Egypt, but he has to get him down there first. So whether the story is actual or a way of stressing the significance of Jesus’ birth can be optional. You pays your money, and you makes your choice!\nI’ll stretch a point, and say that Providence has its own way of communicating its message, and maybe astrology was one of the ways in those times.\n\n","date":"May 9, 2013 at 9:40 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33372","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Actually the second Temple period Essenes’ approach was double: one of separatism from the world while living in cities e.g. like Jerusalem or Jericho and another one of “ultraseparatism” from the community at large and living in the Judean wilderness/wastelands. Josephus describes the Essenes as having lived throughout the Roman province of Judea  in their own communities.\n\n","date":"May 9, 2013 at 5:30 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33311","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Yeshua is said to have been dedicated to G.od while still in the womb (Luke i. 15).  According to the Jewish Encyc., “The most prominent outward mark of the Nazarite was long, flowing hair, which was cut at the expiration of the vow and offered as a sacrifice (Num. l.c.; Jer. vii. 29).”  In the hypothesis of his physical resuscitation/bodily resurrection, most likely Yeshua appeared hairless and then with growing hair after the event (i.e. once his vow was accomplished). \n  “Nazarite was allowed to drink wine only on the Sabbath and on feast-days, since the Messiah will not appear on these days (‘Er. 43a). A shepherd who saw a lock of his own beautiful hair reflected in the water, and was tempted thereby to sin, took a Nazarite vow (Tosef., Naz. iv. 7; Ned. 9b).” \n  However etymologically speaking, in Hebrew, Ha-Natsory/Ha-Notsry (= The Hidden (prince)”, “The one of the (region of the hidden) grottoes”,  “The Nazorene”, refers to somebody from Nazarath (a toponym as region of the hidden grottoes) not to ha-nazir, “the nazarite”. The latter can only read as a word play.\n  Two among the earliest Yeshua’s portraits both dating from the 2nd-3rd c. CE (including  one 3/4 view copied by Victorian artist Thomas Heaphty and one left profile view mostly unknown) feature him with a beard and LONG NOT FLOWING HAIR.\n\n","date":"May 9, 2013 at 6:30 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33316","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Yeshua is said to have been dedicated to G.od while still in the womb (Luke i. 15) as first born…\n\n","date":"May 9, 2013 at 6:52 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33318","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"I would concur with one prelate’s expressed view that Pope Benedict’s comparison with the Essene practice of not sacrificing animals was merely an intellectual musing of no particular significance. I think he was merely drawing attention to the Christian view that Jesus was the true Paschal lamb. \nWhereas the synoptics set out to establish the meal as an observance of Passover, John 13:1 deliberately states that it was before the festival of Passover, and then at Jn 13:2 introduces the farewell meal merely by saying “They were at supper …” with no indication that this is intended as a Passover meal. Not even the institution of the eucharist is mentioned, but is only foretold by the discourse on the “Bread of Life” back in chapter 6.  The long discourses in John’s account of the Last Supper cover new and other material entirely, quite distinct from that in the synoptics. \nI think it is a fair bet, that the symbolism of Jesus as the Paschal Lamb was read back into the compilation of the proto-synoptics, so that the farewell meal was then given the status of the disciples’ Passover meal. \nHowever, the Dead Sea scrolls reveal that a community following a solar calendar observed the Passover on a Tuesday, and it is credible that the disciples may also have done this. In that case the synoptics have compressed a juridical process that may have taken a few days into a few hours.  The difficulty of reconciling the synoptics with John’s account will now be apparent.\n\n","date":"May 9, 2013 at 7:42 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33319","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"That the Essenes were in a way demons in the guise of angels is revealed in some of their writings. Take for instance the War Manual.\n\n","date":"May 9, 2013 at 4:10 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33353","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"David, I tried to post this in the reply to your post, but was unable.\n I see your point, but with respect to Jesus’ age, I gathered this information from a site a few years ago, similar to the site I linked.  Using historical data on the site I visited, the age of Jesus was calculated to be about 42 years. \nHere is an example, although this is not the site I saw originally.  Yet, the man on the TS surely looks to be in his 40s, not 30s.\nHistorical Data\n“The best way to date the death of Christ is to look for the key players in his death drama, about whom there is considerable information, and to establish the context surrounding Jesus’ death. We begin by acknowledging that Jesus’ death followed the death of John the Baptist, and occurred while Caiaphas*was High Priest and while Pilate*was Prefect. We*have reason to believe*that John the Baptist met his gruesome death in 35 A.D.*[1], Caiaphas was deposed by Lucius Vitellius, the legate of Syria, in 36 A.D. and Pilate was recalled to Rome at the end of 36 A.D [2]. Ipso facto, Jesus must have been crucified in the year 36 A.D. Having been born in 6 B.C. and having died in 36 A.D. means that Jesus was in his 40s when he died, probably 42 years old.\n*\nThe Gospel Record\n*\nFurther proof that Jesus was in his 40s when he died comes directly from the Gospel of John. Jesus is discussing the destruction of the temple and he says: ‘Destroy this temple, and in 3 days I will raise it up.’ The Jews then said, ‘This temple has been under construction for 46 years, and you will raise it up in 3 days?’ But he was speaking of the temple of his body (John 2:20-21).’ John points out that later, when he is crucified, Jesus’ disciples remembered his prophecy of the 3 days; however, no one seems to recall the 46 years. Taken at his word, Jesus is clearly saying that he is 46 years old, and that when he dies, he will resurrect in 3 days. If Jesus was 46 years old when he died in 36 A.D., it means he was born in 10 B.C., which is theoretically possible, although 6 B.C. is a more probable date.\n*\nWe find further proof that Jesus is in his 40s from the Gospel of John. Jesus is in a Temple, close to the Mount of Olives, talking to the Scribes*and Pharisees. The subject turns to Abraham, and the ‘Jews’ ask Jesus: ‘You are not yet 50 years old, and have you seen Abraham? (8:57).’Jesus answers: ‘…before Abraham was, I am’, but the important thing to observe here is that the questioners describe Jesus as not yet being 50. Were he in his 20s or 30s, they would have chosen a different year, but by saying that he is not yet 50, they clearly identify him as being in his forties.\n*\nOther Christian Sources\n*\nThe noted Christian Irenaeus*(130-202 A.D.) in Against Heresforc*\n�gainsins7�D.) ind have you inple of his bodeo old when he died.\n*\nAll this evidence shows a significant divergence from the commonly accepted idea that Jesus was in his 30s when he died. All three methods indicate Jesus died in his 40s, between 42 and 46. It also suggests that Jesus’ ministry was significantly longer than the 1 to 3 bodeo that are traditionally attributed to it, because if he began his ministry when he was about 30, and he died between 42 and 46, his ministry was 12 or more years, not 1 or 3.”\nhttpins//www.biblewheel.com/forum/showthread.phpinF1071-Date-of-Jesus-Crucifixion\nBest.\n\n","date":"May 10, 2013 at 7:05 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33450","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Hullo Angel\nNo, the pigeons taken by Jesus’ mother to the Temple was a common Jewish practice and had nothing to do with Essene belief. Father Roland de Vaux, who excavated Qumran, found a cemetery for animals, where the flesh was completely removed from the bones before burial. This is still a mystery to be solved. Did the Essenes reject blood sacrifice? It is possible that they did not offer blood sacrifices at the Temple because this magnificent building was rejected by them — and it was in the hands of the Sadducees, the “Saduquim”, with whom they had serious differences. They had a different idea about what the Temple would have to be like, and, who knows, would offer blood sacrifices  if they had their way. After all, they thought that they, and not the Sadducees, were the legitimate priests. Also to be remembered is that the prophets rejected these sacrifices:”I will have mercy and not sacrifice.” It is also possible that the Essenes  had what is called “kapparot” blood sacrifice rituals, in their communities, but there is no proof. They also seem to have been influenced by beliefs in ancient Iran, learnt by the Israelites in general after the Babylonian Captivity, although their dualism was subordinate to Jewish monotheism.  Syncretism was common even then and the Sadducees demonstrated Greek influence. \nHow is it that that there is no mention of the Essenes in the New Testament? Did Jesus know about the Essenes? Yes. How could he NOT have known about them? It has been pointed out that he referred to them as Herodians. Herod favoured them, and they did not have to make an oath of loyalty to him. They were influenced by a military manual, Herod’s manual, which, in turn, was influenced by a Roman military manual. They were preparing for the “final war” between the “Sons of light” (Essenes) and the “Sons of darkness” (The “kittim”, that is, the Romans, and possibly Jews belonging to other groups). This is clearly Iranian influence. The Bible absorbed many of the beliefs in Near Eastern cultures. We can see five different traditions – JEDP, that is Jahvist, Elohist, Deuteronomist and Priestly — making their points in the composition of the the Pentateuch, the first five books of the Bible. \nTo understand what Jesus thought about all this you must first understand why he hovers in the New Testament. That is the key to unlock the mystery.\nAll the best.\n\n","date":"May 10, 2013 at 10:14 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33472","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Thank you, Luis.  There certainly is much to research.\nLuis says:\n“How is it that that there is no mention of the Essenes in the New Testament? Did Jesus know about the Essenes?\nTo understand what Jesus thought about all this you must first understand why he hovers in the New Testament. That is the key to unlock the mystery.”\n***Angel says:  If, in fact, Melchizedek (Torah) and Jesus (NT) were one and the same, then there would be a relationship between Melchizedek and one of the orders of the Essenes. \nJESUS AS HIGH PRIEST\nIN THE LETTER TO THE HEBREWS\nhttp://www.mycrandall.ca/courses/ntintro/Melch8.htm\nThere were several subgroups under the Essene umbrella.  \nTHE DIFFERENT BRANCHES OF THE ESSENES\nhttp://www.communityofpeace.net/Britxt/Bessenen.htm\nThe Mandaean doctrine mandated short hair and Jesus wore His hair long.  Would this be a form of rebellion to which the Mandaeans referred, in regard to Jesus?  This group of Essenes rejected Jesus as the Messiah.\nExcerpt:  “The Mandaeans, themselves hold the belief that both Yeshua (Jesus) and the Baptist were Nasurai, but that Yeshua (Jesus) was a rebel, who betrayed the secret Qabbalistic doctrines and made religion easier.” \nhttp://www.essene.com/B%27nai-Amen/EssenesAndNasuraiMandaens.htm\nWhether or not Jesus was an Essene may be determined at some future point in time through archaeological digs.\nBest,\n\n","date":"May 12, 2013 at 2:26 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33561","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Louis says:\n“How is it that that there is no mention of the Essenes in the New Testament?”\nAngel says:  \n“There was no mention of Mary Magdalene being a prostitute either, and yet she remains one to this day.”   :)\nI left out the “o” in your name in the previous post.  Please forgive me. \nBest,\n\n","date":"May 12, 2013 at 2:31 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33563","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"*\nFurther proof that Jesus was in his 40s when he died comes directly from the Gospel of John. Jesus is discussing the destruction of the temple and he says: ‘Destroy this temple, and in 3 days I will raise it up.’ The Jews then said, ‘This temple has been under construction for 46 years, and you will raise it up in 3 days?’ But he was speaking of the temple of his body (John 2:20-21).’ John points out that later, when he is crucified, Jesus’ disciples remembered his prophecy of the 3 days; however, no one seems to recall the 46 years. Taken at his word, Jesus is clearly saying that he is 46 years old, and that when he dies, he will resurrect in 3 days. If Jesus was 46 years old when he died in 36 A.D., it means he was born in 10 B.C., which is theoretically possible, although 6 B.C. is a more probable date.\n*\nCan you, please, explain the logic of deriving the 46 years of the “temple of body” from the Jews saying that the temple ( of stone) is under construction for 46 years?\nI think you mixed it up – from the 46 years of construction of the stone temple nobody can make the conclusion that “Jesus is clearly saying that HE is 46 years old”\n\n","date":"May 11, 2013 at 7:46 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33525","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"We find further proof that Jesus is in his 40s from the Gospel of John. Jesus is in a Temple, close to the Mount of Olives, talking to the Scribes*and Pharisees. The subject turns to Abraham, and the ‘Jews’ ask Jesus: ‘You are not yet 50 years old, and have you seen Abraham? (8:57).’Jesus answers: ‘…before Abraham was, I am’, but the important thing to observe here is that the questioners describe Jesus as not yet being 50. Were he in his 20s or 30s, they would have chosen a different year, but by saying that he is not yet 50, they clearly identify him as being in his forties.\nThe other logical mistake – from one saying “you are not yet 50 years old” does not the conclusion that he is in his 40s logically follow. The same might be said to somebody in his 30 and in his 20s as well – if the mark 50 has it’s own meaning. But it clearly can be told to the person in his 30s as to somebody in his early 40s as well – without any clear distinction.\n\n","date":"May 11, 2013 at 7:50 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33526","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"jesterof says:\n“The other logical mistake – from one saying “you are not yet 50 years old” does not the conclusion that he is in his 40s logically follow. The same might be said to somebody in his 30 and in his 20s as well – if the mark 50 has it’s own meaning. But it clearly can be told to the person in his 30s as to somebody in his early 40s as well – without any clear distinction.”\n***Angel says:  jesterof, I replied to your question, but I just found the results of the scientific analysis on the Shroud of Turin.\nExcerpt:.\n“The tradition of the Church and the results of scientific research affirm with the highest probability that the lifeless body impressed upon the linen of Turin is that of Jesus. In fact, the fabric reveals an adult man, about 40 years of age, strong, about six feet tall, who shows the marks of scourging and crucifixion and who was paid an honorific burial.”\nhttp://www.aleteia.org/en/article/who-is-the-man-of-the-shroud\nBest,\n\n","date":"May 12, 2013 at 7:05 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33572","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"All this evidence shows a significant divergence from the commonly accepted idea that Jesus was in his 30s when he died. All three methods indicate Jesus died in his 40s, between 42 and 46. It also suggests that Jesus’ ministry was significantly longer than the 1 to 3 bodeo that are traditionally attributed to it, because if he began his ministry when he was about 30, and he died between 42 and 46, his ministry was 12 or more years, not 1 or 3.”\nNo, it does not. 2 of your provided “proofs” are not proofs at all – one is a logical mistake and the other one is just as possibly applied to the person in his 40s as to the person in his 30s.\n\n","date":"May 11, 2013 at 7:53 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33528","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Jesterof says:\n“The other logical mistake – from one saying “you are not yet 50 years old” does not the conclusion that he is in his 40s logically follow. The same might be said to somebody in his 30 and in his 20s as well – if the mark 50 has it’s own meaning. But it clearly can be told to the person in his 30s as to somebody in his early 40s as well – without any clear distinction.”\nAngel says:  “Firstly, I was not the author of the link article, but it is my belief Jesus was in his 40s.\nAs well, Irenaeus ((2nd century – c. 202 CE), places the age of Jesus closer to 45. \nHere is an excerpt.\n“However in Demonstration (74) Irenaeus expressly states “For Herod the king of the Jews and Pontius Pilate, the governor of Claudius Caesar, came together and condemned Him to be crucified.”[13][14] which by two of the rulers presented would put the crucifixion between 42 and 44 CE making Jesus at least 45.”\nhttp://en.wikipedia.org/wiki/On_the_Detection_and_Overthrow_of_the_So-Called_Gnosis\nAs for the Shroud facial image, this is not the face of a 30 year old man.  This is the face of a man in his 40s.  \nCheck out “google images” of the 40 year old Shane Shuyler, as an example.\nBest,\n\n","date":"May 12, 2013 at 1:10 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33557","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Angel\n#60\nDon’t worry about how my name was spelt. What’s in a name?\nIt does not matter if Mary Magdalene was a prostitute or not, it does matter when we try to find out the relationship between Jesus and the Essenes. They are two very different things and one can, when dealing with the Essenes, be misled by Allegro or Wilson. Don’t rely on Wikipedia for your studies, it may be an useful start. Go to the heavyweights: Fathers Roland de Vaux and Fitzmyer, Yadin, García-Martínez and others.  \nBest.\n\n","date":"May 12, 2013 at 3:38 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33564","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Louis says:\n “it does matter when we try to find out the relationship between Jesus and the Essenes. They are two very different things and one can, when dealing with the Essenes, be misled by Allegro or Wilson.”\n***Angel says:  What about Eisenman?  \nYet, we will not know with any degree of certainty if Jesus was affiliated with the Essenes, until the remaining translations of the Dead Sea Scrolls (over 400) are made available.\nGrant Jeffrey, with reference to Jesus and the Essenes, states the following:\n“The Crucified Messiah Scroll\nIn 1991 the world was astonished to hear that one of the unpublished scrolls included incredible references to a “Messiah” who suffered crucifixion for the sins of men. The scroll was translated by Dr. Robert Eisenman, Professor of Middle East Religions of California State University. He declared, “The text is of the most far-reaching significance because it shows that whatever group was responsible for these writings was operating in the same general scriptural and Messianic framework of early Christianity.” Although the original scroll team still claimed that there was no evidence about early Christianity in the unpublished scrolls, this new scroll totally contradicted their statements. This single scroll is earth-shaking in its importance. As Dr. Norman Golb, Professor of Jewish History at the University of Chicago said, “It shows that contrary to what some of the editors said, there are lots of surprises in the scrolls, and this is one of them.”\nGeza Vermes, translator of “The Dead Sea Scrolls” has died at the age of 88.  Hopefully, there are additional translators in the wings.\nBest,\n\n","date":"May 12, 2013 at 6:46 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33571","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"\nAs for the Shroud facial image, this is not the face of a 30 year old man.  This is the face of a man in his 40s.\nCheck out “google images” of the 40 year old Shane Shuyler, as an example.\nBest,\n\nas for the Shroud image this face can be a 20 ye man – this man was tortured, beaten, underwent extreme dehydration and rabdomyolysis, which, i all possibility led to a lont of very grave clinicla conditions and was crucified.\nThe face of the man who died in those circumstances will not resemble any angeliic faces you are used to see on the drawings.\nYou’ve obviously weren’t exposed to a lot of dead people of various ages who have not been crucifies but died from severe traumatic conditions.\nI was.\nThe face on the Shroud can belong to ANY aged man – from 20 to 60\n\n","date":"May 12, 2013 at 7:17 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33574","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"jesterof says:\n“The face on the Shroud can belong to ANY aged man – from 20 to 60\n***Angel says:  Yet, not according to the scientific investigation.  See below:\nEXCERPT \n“scientific research affirm with the highest probability that the lifeless body impressed upon the linen of Turin is that of Jesus. In fact, the fabric reveals an adult man, about 40 years of age…”\n http://www.aleteia.org/en/article/who-is-the-man-of-the-shroud\nBest,\n\n","date":"May 13, 2013 at 9:23 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33622","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"This is NOT a scientific investigation.\nthis is an article in the internet, without ANT proof to it’s assumptions. Some of the information is supported by the known science, some is a total fiction.\nBut it does not in any dimension provide any evidence, or scientific proof, that man in the Shroud is in his 40s.\nThe man of the Shroud could as well be in his 20s as in his 60s.\n\n","date":"May 13, 2013 at 10:00 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33625","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Angel\nWill you mind if I say you are on the wrong track? Robert Eisenman is not taken seriously by most DSS scholars, he was by the sensationalist writers Baigent and Leigh. The same can be said about Norman Golb, although he is serious, only his theory being flawed.\nI did learn about Geza Vermes. RIP. There were flaws in his translations and he, too, is controversial. Tell me what you feel about his scholarship and, depending what you say, I may have some news for you.\nBest.\n\n","date":"May 12, 2013 at 7:54 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33575","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Louis says:\nAngel\nWill you mind if I say you are on the wrong track? Robert Eisenman is not taken seriously by most DSS scholars, he was by the sensationalist writers Baigent and Leigh. The same can be said about Norman Golb, although he is serious, only his theory being flawed.\nI did learn about Geza Vermes. RIP. There were flaws in his translations and he, too, is controversial. Tell me what you feel about his scholarship and, depending what you say, I may have some news for you.\n***Angel says:  I never stated Eisenman’s deductions were set in stone.  Perhaps I have not articulated my viewpoint thoroughly.  My point is Melchizedek and Jesus (God in the flesh) were one and the same.  And there is a connection between Melchizidek and the Essenes.\nGenesis 14:18,19  And Melchizekek, King of Salem, brought forth bread and wine, and he was the priest of the most high God. And he blessed him and said, “Blessed be Abram of the most high God, possessor of heaven and earth.\nIn the following two scriptural verses Jesus states the following:\nJohn 8:56 “Your father Abraham rejoiced to see my day: and he saw it and was glad.\nJohn 8:58 “Jesus said unto them “Verily I say unto you, Before Abraham was, I AM.\nNow John 8:58 may very well be Jesus referring to His appearance as Melchizedek speaking to Abram.  \nThis statement Jesus made may be read\n“Before Abraham WAS….I AM”  which is interpreted as before Abraham’s existence was I AM or before Abraham’s existance was God.\nYet, the statement may also be read, “Before Abraham…. WAS I AM, which is interpreted by me to mean (standing before Abraham was I AM).\nAnd Melchizedek or God in the flesh was standing before Abraham.\nNo matter which way the statement is interpreted, I read it as Melchizedek is God in the flesh.\nJesus is also God in the flesh.\nAnd if there is an association of Melchiedek to the Essenes, there would also be an association of Jesus to the Essenes. I used Eisenman’s reference to verify, but there may be Essene sites that also verify this scenario.\nJust my opinion though.\nBest,\n\n","date":"May 13, 2013 at 10:45 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33627","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Dan, I think you are using exceptions to disprove a rule which is only meant as a generalization, rather than an absolute.\nThere certainly are fundamentalist commentators on the Shroud who are strongly opposed its authenticity, but they are a small minority. The vast majority of self-identified Christians are favorable or at least “equitable” to the Shroud. It is also true that there are rare atheists (as with De Wesselow and his farfetched “Shroud-as-resurrection” theory) who believe in the Shroud’s authenticity, but again, you are treating an exception to the rule as though it defeats the entire category. She said that atheists (*presumably those who pay attention to and comment on the subject*) “tend” to get worked up about the Shroud, not that every atheist everywhere does, and in my experience, she is right on the mark in that regard.\n\n","date":"May 13, 2013 at 5:16 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33613","author":"Cody Wendt","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"\njesterof :\nThis is NOT a scientific investigation.\nthis is an article in the internet, without ANT proof to it’s assumptions. Some of the information is supported by the known science, some is a total fiction.\nBut it does not in any dimension provide any evidence, or scientific proof, that man in the Shroud is in his 40s.\nThe man of the Shroud could as well be in his 20s as in his 60s.\n\n****Angel says:  \nThe Authentication of the Turin Shroud:\nAn Issue in Archaeological Epistemology\nby William Meacham – Archaeologist\nhttp://www.shroud.com/meacham2.htm\nMeacham gave a more varied age range for Jesus in his scientific article (30-45 years of age).\nYet, if you are of the opinion Jesus was in his 20s or 30s, well, that is your belief. \nBest,\n\n","date":"May 13, 2013 at 11:14 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33630","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"\nAngel :\n\njesterof :\nThis is NOT a scientific investigation.\nthis is an article in the internet, without ANT proof to it’s assumptions. Some of the information is supported by the known science, some is a total fiction.\nBut it does not in any dimension provide any evidence, or scientific proof, that man in the Shroud is in his 40s.\nThe man of the Shroud could as well be in his 20s as in his 60s.\n\n****Angel says:\nThe Authentication of the Turin Shroud:\nAn Issue in Archaeological Epistemology\nby William Meacham – Archaeologist\nhttp://www.shroud.com/meacham2.htm\nMeacham gave a more varied age range for Jesus in his scientific article (30-45 years of age).\nYet, if you are of the opinion Jesus was in his 20s or 30s, well, that is your belief.\nBest,\n\nIt is not my BELIEF. It is what is written in the Gospels.\nI tend to apply the Occam’s razor principle and not to split the hair in 4 parts in order to prove a dubious point – if it written Jesus was in his 30s, he WAS in his 30s.\nShroud image in no way disputes that age\nmeacham does not dispute the age ff 30-35 at all\n\n","date":"May 14, 2013 at 8:19 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33650","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Jester says:\n“It is not my BELIEF. It is what is written in the Gospels.\n I tend to apply the Occam’s razor principle and not to split the hair in 4 parts in order to prove a dubious point – if it written Jesus was in his 30s, he WAS in his 30s.\n Shroud image in no way disputes that age\nmeacham does not dispute the age ff 30-35 at all”\n***Angel says:  “WHERE is the TRUE birth date of Jesus written in the Gospels?  Without ABSOLUTE truth, there is no way to determine the age of Jesus. \nTherefore, you may continue to believe Jesus was 30 and I will not falter from my belief that Jesus was approximately 40.\nPeace!\n\n","date":"May 15, 2013 at 7:13 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33727","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"you can believe whatever you want, even in green UFO :-) \nbut your belief has nothing to do with the reality that the Shroud image can belong to a man aged from 20s to 60s, so there is absolutely no reason to doubt the age of Jesus described in the Gospels ( if you don’t know where it is described – I suggest to read them and refresh your memory, it is clearly stated by one of them) and there are plenty of direct historical milestones to start with – and I’ll give you some hints – Herod the Great, John the Baptist, Pontius Pilate and the first census ( to name the few)\nEnjoy the numerical historical detective story.\nOr you can just search the web – this is not an unknown and disputable issue – scholars do not dispute the age of Jesus Christ in mid-30s of  by the time of his death.\n\n","date":"May 15, 2013 at 9:40 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33734","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"I posted my reply three times, but it is not showing up.\n\n","date":"May 16, 2013 at 7:39 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33821","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"jesterof says:\n“you can believe whatever you want, even in green UFO :-)” \n***Angel says:  “Your statement is laughable, considering the Vatican’s binocular telescope (LUCIFER) located in Mount Graham Nevada, may be searching for not only distant stars, but alien life, as well.  :)\nhttp://www.ecumenicalnews.com/article/vatican-astronomers-are-searching-for-alien-life-say-auhors-22068\n\n","date":"May 16, 2013 at 7:43 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33824","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"It is the words of Jesus that matter, not whether he was 20, 30,40 or 50 years of age when he uttered them. The impact is such that those who understand don’t seem to bother about minor matters. We can not forget that he played the central role in history and this is something that a even a sceptic like Renan accepted without problems, going to the extent of stating that ….\n\n","date":"May 16, 2013 at 7:58 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33829","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"****Angel says: “Agreed, Louis.”\nBest,\n\n","date":"May 16, 2013 at 9:57 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33840","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"\nLouis :\nIt is the words of Jesus that matter, not whether he was 20, 30,40 or 50 years of age when he uttered them. The impact is such that those who understand don’t seem to bother\nabout minor matters. We can not forget that he played the central role in history and this is something that a even a sceptic like Renan accepted without problems, going to the extent of stating that ….\n\nWords of wisdom, sir :-)\n our sciencebod might have found an internet soul mate ))))\nJesus Chrst’s age was never disputed except on some obscure blog or forum which Angel mentioned at the start. let her believe it as in green ufo as well :-)\n\n","date":"May 16, 2013 at 8:44 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33835","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"jesterof,\nI choose not to argue the point; however, Dr. Michael Molnar, Professor at Rutgers University, is considered credible.\nhttp://partners.nytimes.com/library/national/science/122199sci-archaeo-jupiter.html\nBest,\n\n","date":"May 16, 2013 at 9:52 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33839","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Jesterof, your arguments about the age have been convincing, and what was being referred to were some biblical studies where the question of age has been raised.\n\n","date":"May 16, 2013 at 9:10 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33837","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"from the last Angel’s link:\nHis date for the star’s appearance is consistent with many scholarly estimates of the year of Jesus’ birth. It is generally accepted that Jesus was born within two years of the death of the Judean King Herod, which has commonly been put at 4 B.C. But that date has been called into question in recent years. \nDr. Jack Finegan, an emeritus professor at the Pacific School of Religion in Berkeley, Calif., and author of “The Handbook of Biblical Chronology,” a standard reference on the subject, now puts Herod’s death more likely at 1 B.C. \nJohn Mosley, program director at the Griffith Observatory in Los Angeles and an expert on the Star of Bethlehem, said that while it may never be possible to know what the star was, “when Herod died was an actual event and should be knowable.” And if Herod died in 1 B.C., he added, “you can’t stretch the birth of Jesus back to 6 or 7 B.C.” \nIf this is correct, then the age of Jesus Christ in mid-30s is even more substantiated\nLuke 3:23\nNow Jesus himself was about thirty years old when he began his ministry. He was the son, so it was thought, of Joseph, the son of Heli,\nand we know that Jesus Christ was crucified during the reign of Pontius Pilate which is known to be from AD 26–36, so if the Herod’s death is pushed to 1 BC, than jesus Christ birth is also pushed to maximum 3 BC, which makes the latest possible date of his crucifiction by 36AD and his latest age at 39 and the earliest  at 29.\nwhere does mid-40s come from, only Angel knows :-)\n\n","date":"May 17, 2013 at 10:46 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33870","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Agreed, the Bible scholars generally do not bother about the age because there are more important things to write about and the chronology is generally accepted.\n\n","date":"May 17, 2013 at 5:25 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33901","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"jesterof says:\nwhere does mid-40s come from, only Angel knows :-)\n***Angel says:  Never said mid-40s.  \nI referenced an age of 42 (early 40s) and gave you a link to the research of Dr. Molnar, who is a Physicist and Astronomer.  \nYet, there is also the difference in the Gregorian calendar vs. the Jewish calendar.\nAs has been noted:\n“The Gregorian calendar was an attempt to begin the new date (A.D.) based upon the year that Jesus was born. In the end, the calculation was incorrect by a number of years due to missed historical facts. It is now known that Herod the Great died in the year 4 B.C. Since he was alive when Jesus was born, that already puts Christ’s birth earlier than the year 4 B.C. and not A.D. 1. Furthermore, we also know from Matthew two that Jesus was two years old at the time the wisemen and Herod met. If we put these things together, we can determine that Jesus was born between 7 and 6 B.C., which is why the Gregorian calendar is off by that many years.”\nhttp://www.ariel.org/qna/qjewcal.htm?iframe=true&\nRECOVERED CUNIFORM SCRIPT\n“This leads to consideration of a series of prior astrological events that occurred in 7 BCE. Four copies of an ancient Babylonian astronomical text, written in 8 BCE in cuneiform script on clay tablets, have been recovered. This text predicts a triple conjunction of the planets, Jupiter and Saturn, in the constellation, Pisces, on what are now known as May 27, October 6 and December 1, 7 BCE. “The . . . conjunction of 7 B.C.E. . . . was special in that the planets met three times in succession in the same constellation. . . .”\nhttp://www.worldviewpublications.org/outlook/archive/article.php?EDITION=078\nFurther, regardless of which of these scholars makes a claim as to any type of authenticity on an hypoethesis or theory, the proof or truth remain ONE archaeological dig away.  And unfortunately, without actual proof, nothing is set in stone.\nYet, even though gnostic text has been excluded from the Canon, if an archaeological dig unearthed an ancient gnostic text that detailed the Shroud of Turin as originating in 1BC, the fact it was gnostic scripture would be conveniently ignored and would be used as proof of the shroud’s authenticity.  So, we choose whatever verifies our beliefs.\nBest,\n\n","date":"May 17, 2013 at 1:22 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33883","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Angel, I quoted the very link that you provided and it DOES NOT support you early 40s theory.\nDo you at least read yourself  what you are providing?!? Your link CLEARLY states that Herod the Great died 1BC and not earlier – exactly because the new hypothesis of the scientists involved, which makes the date of birth not earlier than 3BC.\nAnd your fixation just on astrology is just your fixation.\nThere are other dates, which are very far from 4-6 BC – and all the way to 6 AD – the date of first census, for example, which is much more important, since it is not disputed and so there is no theory – the Holy family had to show up for the census.\nThis date is KNOWN and not speculated.\nBut if you do not understand – I will repeat – you are free to believe that Jesus Christ was 42,46 or 50 years old – you may also believe in green UFO – who cares.\nJust do not provide the arguments which are not supportive of this theory, quite to the contrary.\n\n","date":"May 17, 2013 at 5:49 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33904","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"again, upon checking the provided link http://www.worldviewpublications.org/outlook/archive/article.php?EDITION=078 – it is clear by the publication, that even they move the birth date to 6-7 BC, but by accurately stating that the beginning of ministry of Jesus was in 28AD – it is absolutely clear that by the time of his death he could not be older than 35 years of age.\n\n","date":"May 17, 2013 at 5:58 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33906","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"jesterof,\nThe link I gave you was an alternate view on the age of Jesus.  Yet, Jesus was born April 17, 6 BC and King Herod the Great died in 4 BC, which means Jesus (who was living with His family in Egypt) was two years old when Herod met his death.  One of the scholars to which you refer, Dr. Martin, used the word “probably.”  And “probably” is indicative of not being certain.\nYou are actually quite funny and would make a great spokesman for the women’s anti-aging campagne.\nAfterall, there would be no need for women to undergo a lifestyle lift, if one was able to view them through your lens.  I’m still laughing. \nYou would have no problem telling 40 year old women they were 30, regardless of whether or not their birth certificates indicated otherwise.  :) \nAt any rate, the age of Jesus saga is tantamount to beating a dead horse.  You have your beliefs and are entitled to them, as do I. \nWe’ll just wait for the next archaeological dig to confirm Jesus’ age either up or down.\nBest,\n\n","date":"May 17, 2013 at 10:50 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33914","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Angl,\nyour absolute dates are simply laughable – nobody and nowhere knows FOR SURE the date of birth of Jesus Christ, ther are stimations which vary from 6 BC to 6 AD, but to name it April 17 of year 6 just makes one laugh, since you sound like you were there . Or were you? :-)\nThe age of Jesus upon starting his ministry IS known and was never disputed, as was never disputed the age at which He died, since both numbers were given in th Gospels and are indirectly confirmed by other dates. So your belief in “green UFO” saga of the age of Jesus at His death is just your belief which is NOT substantiated by anything, even by your own links.\nYou are totally entitled to believe that Jesus Christ died at 42, or 46 or 48, but that is just your belief, no mor, no less – the links you’ve provided on this thread DO NOT confirm that belief.\n\n","date":"May 18, 2013 at 12:08 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33952","author":"jstrof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"I agree with Jesterof, most likely Yeshua was in his 30s (35-37 years old). \n  Angel misleadingly wrote: “We find proof that Jesus is in his 40s from the Gospel of John. Jesus is in a Temple, close to the Mount of Olives, talking to the Scribes*and Pharisees. The subject turns to Abraham, and the ‘Jews’ ask Jesus: ‘You are not yet 50 years old, and have you seen Abraham? (8:57).’Jesus answers: ‘…before Abraham was, I am’, but the important thing to observe here is that the questioners describe Jesus as not yet being 50. Were he in his 20s or 30s, they would have chosen a different year, but by saying that he is not yet 50, they clearly identify him as being in his forties.” \nWrong. Ethnoculturally speaking, the sentence shall be read: “You are not old enough (to grow a white beard) to be fifty (i.e. to be a zaqen, Heb. for “a (white) beard” or “a wise man”. This is no “proof” at all they “clearly identify (Yeshua) as being in his forties”.\n\n","date":"May 18, 2013 at 1:01 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33954","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Patrick Hamon says:\n“Wrong. Ethnoculturally speaking, the sentence shall be read: “You are not old enough (to grow a white beard) to be fifty (i.e. to be a zaqen, Heb. for “a (white) beard” or “a wise man”. This is no “proof” at all they “clearly identify (Yeshua) as being in his forties”.\n***Angel says:  Well, fortunately, I have the “Jewish New Testament,” which is a translation by Jewish author, David H. Stern.   The Jewish translation of the New Testament expresses its original and essential Jewishness.  \nYochanan (John) 8:57 is translated ” Why you’re not yet fifty years old,” the Judeans replied, “and you have seen Avraham?”  Yeshua said to them, “Yes, indeed!  Before Avraham came into being, I AM!”  At this, they picked up stones to throw at him, but Yeshua was hidden and left the Temple grounds.\nAs to your scholars, they continue to translate the “Holy Spirit” as a “he,” when in fact the Holy Spirit is a “she.”  The Ruach HaKodesh is the female gender, and why the dove, which symbolizes the feminine was flying above Jesus when he was baptized by John.  The statement, “This is my son, in whom I am well pleased” can be made by a mothe, as well as, a father.\nThe Trinity (three separate or interchangeable entities under one Godhead) is comprised of a family unit (Father, Mother, Son).  The Father (God) heads the family unit and the Mother is the Ruach HaKodesh (Holy Spirit).\nYet, I choose not to continue arguing the point.  You may believe as you will and I will continue to believe Jesus was approximately 40 years of age when He was crucified and that His birthday is April 17th, 6 BC.\nPeace!\n\n","date":"May 18, 2013 at 8:17 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33985","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Obviously it was a way of rounding up the age, 50 if Jesus was 30, and it could have been 100 if he was seventy. They were talking in terms of fifties and hundreds because the context was the reference to Abraham who had lived more than 2000 years earlier. If 50 was used, therefore, that was due to the fact that Jesus was below 50, not because he was in his forties.\n\n","date":"May 18, 2013 at 1:56 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33956","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Louis says:\nObviously it was a way of rounding up the age, 50 if Jesus was 30, and it could have been 100 if he was seventy. They were talking in terms of fifties and hundreds because the context was the reference to Abraham who had lived more than 2000 years earlier. If 50 was used, therefore, that was due to the fact that Jesus was below 50, not because he was in his forties.\n***Angel says:  “If” does not define truth or certainty, but merely speculation.”\nBest,\n\n","date":"May 18, 2013 at 8:19 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33986","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Angel, I was just talking about the word “fifty” (in Hebrew nun) not about the “Holy Spirit”!????????\n  I think you totally missed/misunderstood my point. In Hebrew the word nun can translate “fifty” but also “posterity” and refer to the 50 gates of wisdom (as in ben Nun, literally “son of fifty” = “son of the 50 gates of wisdom”). In John 8:57, “fifty” does refer to the “age of wisdom”, i.e. the age of an elder/wise man not to chronological age stricto sensu. You’re totally off the cultural and linguistic mark.\n\n","date":"May 18, 2013 at 8:54 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33990","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Max,\nI stated Jesus was approximately 40 years of age when he expired and this was the reason the Pharisees made the 50 year old statement.\nNow, dependent on whether this recently translated 1,200 year old Coptic manuscript – clay tablet (The Pilate diaries) is authentic or not, it is stated Jesus was crucified in 43 AD.\nhttp://www.dailymail.co.uk/sciencetech/article-2293301/Shape-shifting-Jesus-spent-supper-Pontius-Pilate-claims-just-deciphered-1-200-year-old-Egyptian-manuscript.html\nThere are several links to this find, I just gave one.\nI’m not stating the manuscript is authentic, but it also correlates to the age I have determined Jesus to be.\nRegardless, the truth will eventually come to light as to the age of Jesus.\nBest,\n\n","date":"May 18, 2013 at 10:04 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33997","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"To infer this is a  “proof (sic)” they “clearly (sic) identify (Yeshua) as being in his forties (sic)” is to be totally ignorant of the Hebrew word nun, “fifty”, used in conjunction with the figure of a Second Temple period “Elder “.\n\n","date":"May 18, 2013 at 9:13 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33993","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Max Patrick Hamon says:\nTo infer this is a “proof (sic)” they “clearly (sic) identify (Yeshua) as being in his forties (sic)” is to be totally ignorant of the Hebrew word nun, “fifty”, used in conjunction with the figure of a Second Temple period “Elder “.\n***I am not inferring anything.  Jesus was not 30, Jesus was 40 and for this reason the statement was made, “You are not yet 50 and you have seen Abraham?”\nYou may, as I’ve stated previously, believe as you choose.  The truth will be made manifest with new archaeological finds.\nAs well, I am not asking you to believe Jesus was 40.  I am stating that is my belief.\nBest,\n\n","date":"May 18, 2013 at 11:56 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34005","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"***settling with a big bag of popcorn***\nHoly Spirit as a “she”?!? Trinity as a “family unit” !?! I see now from which depths of enlightenment all this “knowledge”, including April date of Birth, age of 42 is coming from.\nKeep talking :D\n\n","date":"May 18, 2013 at 9:21 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33994","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Jesterof, According to Rabbi Koniuchowsky\n “Wisdom is justified of Her Children, Luka 7:35 We have the Father, and the Son, but where’s Mom? \nIn Jewish thought and literature, as well as in the nuances of the Hebrew language itself, is revealed an understanding of the personage and character of the Ruach HaKadosh that has for the most part been lost through translation and introduction of pagan influences into the assembly. Lost to everybody, that is, except the Jews and others learned in the Torah, and in the Hebrew language of Scripture. \nThe Ruach is simply the femine manifestation of YHWH!\nLet’s begin by first stating that Hebrew, like many languages of the earth, contain both feminine and masculine tenses. The tense of the word determining the gender of the noun being described. For example, in Spanish “muchacho” means boy, and “muchacha” means girl. The “o” at the end of muchacho defining masculine tense, and the “a” at the end of muchacha defining feminine tense. \nIn Hebrew, the word “Ruach” is feminine tense, assigning to the Spirit a feminine nature, character, gender. But when a tense (male or female) is in reference to a life form, then the tense is in reference to the “gender” of the life form. \nSince we know the Ruach to be a conscious, living being, the manifested power of YHWH capable of leading us, guiding us, and of instructing and teaching us in the Way of all truth; Yochanan 14:26, Luka 12;12; we can determine from the tense of the Hebrew and Aramaic words that the Ruach HaKadosh is feminine tense, and therefore, “female in gender. \nThis point is entirely lost in the Greek which has no feminine tense for spirit, but only a neuter tense, which is why “Spirit” is always presented as a “He” in the Greek (neuter words are given male attributes in translation), which error has been erroneously transferred over into the English.  In the Aramaic the word for Spirit is Feminine as well with the word Ruacha axwr, confirming the Hebrew understanding of the word Ruaah or …”\n##  I tried to include the link, but this site is not working.  Research Who/What is the Ruach HaKodesh on your arms to Israel.\nBest,\nI\n\n","date":"May 19, 2013 at 12:15 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34010","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"John 8:57 (second paraphrase): You are not even an Elder (Zaqen) and you say you have seen Avraham.\n\n","date":"May 18, 2013 at 9:29 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-33995","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Angel #95\nIf we look for certainties all the time then there will be no time left to do anything else, therefore many things are taken for granted in life. Delete the “if” in #94 as it helps to make things more clear.\nBest.\n\n","date":"May 19, 2013 at 9:11 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34029","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Louis says:   Delete the “if” in #94 as it helps to make things more clear.\n***Angel says:   My philosophy is the text is either correct or it’s incorrect.  If there is even a word or a line that doesn’t make sense, although the majority of the text may be correct, I prefer to find the correct word or line or the omission, deletion or the insertion. \nWhat continually comes to mind is a statement Jesus made, “Seek and ye shall find.”\nThis in no way means I am denouncing the Canon as truth,  but some things just don’t add up.\nGenesis 1.  Adam, Eve, Cain and Abel.  Cain kills Abel.  Therefore, there should have been three people left on earth at that time.  \nWith that in mind, how is it possible for Cain to go into the Land of Nod and take a wife?  Where did she come from?\nThese are the type of things that I question\nBest,\n\n","date":"May 19, 2013 at 7:03 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34075","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Angel #101\nIt is not difficult to detect pagan influence in the composition of the Torah and the question of “he” and “she” has more to do with anthropomorphism. In the NT Jesus tells us what it is like “up there” while answering a query posed by the Sadducees.\n\n","date":"May 19, 2013 at 9:30 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34031","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Louis, I see your point.\nBest,\n\n","date":"May 19, 2013 at 7:08 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34076","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"\nAngel :\nJesterof, According to Rabbi Koniuchowsky\nI\n\n***chewing the popcorn***\nAngel, what makes you think I am interested in the opinion of Rabbi Koniuchowsky?\nI am pretty happy with the Gospels in their translation as I know it ( I read them not in English – there are too many English versions for me)\n\n","date":"May 19, 2013 at 10:46 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34032","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"jesterof,\nWhen was the first time you posted on this board?  Have you posted anything two or three months ago?  Just wondering!\nBest,\n\n","date":"May 19, 2013 at 7:11 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34078","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"\nAngel :\nMax Patrick Hamon says:\nTo infer this is a “proof (sic)” they “clearly (sic) identify (Yeshua) as being in his forties\n(sic)” is to be totally ignorant of the Hebrew word nun, “fifty”, used in conjunction with the figure of a Second Temple period “Elder “.\n***I am not inferring anything.  Jesus was not 30, Jesus was 40 and for this reason the statement was made, “You are not yet 50 and you have seen Abraham?”\n\nNo, Jesus was not 4o, Jesus was 30 and for this reason the statement was made :-)\n\n","date":"May 19, 2013 at 10:47 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34033","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"jesterof says:\nNo, Jesus was not 4o, Jesus was 30 and for this reason the statement was made :-)\n***Angel says:  And you were there, of course. :)\nMy question to you is if ancient sacred text that predates the Gospels is unearthed that proves the age of Jesus otherwise, what then will you say?  :)\nAs I’ve stated previously, what is known today is only as good as the next archaeological find.\nBest,\n\n","date":"May 19, 2013 at 7:15 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34079","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"\nAngel :\njesterof says:\nNo, Jesus was not 4o, Jesus was 30 and for this reason the statement was made :-)\n***Angel says:  And you were there, of course. :)\nMy question to you is if ancient sacred text that predates the Gospels is unearthed that proves the age of Jesus otherwise, what then will you say?  :)\nAs I’ve stated previously, what is known today is only as good as the next archaeological find.\nBest,\n\nThat that ancient text is not a Gospel. It may say whatever it wants. It does not matter :-)\n\n","date":"May 19, 2013 at 9:32 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34086","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"“As I’ve stated previously, what is known today is only as good as the next archaeological find.”\nNo, it is not. So far no archeological find proved the age of Jesus Christ NOT to be the one described by Luke.\nAnd it won’t change :-)\n\n","date":"May 19, 2013 at 9:35 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34087","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"\njesterof :\n\nAngel :\nJesterof, According to Rabbi Koniuchowsky\nI\n\n***chewing the popcorn***\nAngel, what makes you think I am interested in the opinion of Rabbi Koniuchowsky?\nI am pretty happy with the Gospels in their translation as I know it ( I read them not in English – there are too many English versions for me)\n\naddition – Jesus did not speak Hebrew, but Aramaic just to remind you. And the Gospels were written also NOT in Hebrew, but  Greek Koine.\nThe differences between Hebrew and Aramaic are more or less like between French and Spanish – those are from the same group, but different languages.\nOne might fantasize a lot based on his/her assumptions on the language differences, but that leaves it only where it belongs – speculations, no more.\nI’ll stick to the originals.\n\n","date":"May 19, 2013 at 11:02 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34034","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"jesterof says:\nGospels were written also NOT in Hebrew, but Greek Koine.\n***Angel says:   The Aramaic Ruach is also feminine.\nExcerpt from the article – link below:\n“Part of the problem we have with the New Testament is that the one used by the Western Churches is a Greek translation of the original Hebrew, a language evolved within a pagan context as opposed to the Hebrew of the Old Testament which was, we believe, the original divine language and which evolved within the context of a divine theocracy (Israel). This means, in our opinion, that Hebrew is more precise and inspired than Greek. Moreover, we have good reason to believe that most, if not all, the New Testament was originally written in Hebrew and subsequently translated into Greek. Therefore in terms of defining the gender of the Holy Spirit, New Covenant Christians are more disposed to the Hebrew Old and New Testament witness of the Bible which overwhelmingly reveals the Holy Spirit to be feminine. \n English has three genders, masculine, feminine and neuter (i.e. he, she and it). Hebrew and Aramaic have no neuter gender. In Hebrew and Aramaic everything is either a “he” or a “she” and nothing is an “it”. \nAlso gender plays a much more important role in Hebrew and in Aramaic than in English. In English gender is usually only an issue when dealing with pronouns. But in Hebrew and Aramaic nouns and verbs are also maculine or feminine. \nAnd while there are no true adjectives in Hebrew (nouns are also used as adjectives), noun modifiers must agree in gender with the noun. Now the Hebrew word RUACH (Aramaic RUCHA) is gramatically feminine as is the phrase Ruach haKodesh. This is matched by the rôle of the Ruach haKodesh as “comforter” (Jn.14-16) and the identifier of the “comforter” with YHWH acting as a “mother” (Is.66:13).\nit is very clear that the gender of the RUACH has been revised in many passages of the Aramaic to agree with the Hellenistic concept of the Holy Spirit as being either a he” or an “it”.  \nhttp://www.tektonics.org/qt/shespirit.html\nBest,\n\n","date":"May 19, 2013 at 2:45 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34052","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Charmain rauch being feminine or notdoes NOT matter.\nThe Gospels were written in GREEK.\nspeculations of the gender are of no interest to me. You may want to discuss it on som gnostic forums.\nI am totally happy with the way it is in the Bible – neither the Father nor Holy Spirit has gender at all. Jesus Christ has assigned male gender only because He had the Earth mission to complete.\n\n","date":"May 19, 2013 at 3:15 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34056","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"error: Aramaic, not chairman ))))\n\n","date":"May 19, 2013 at 3:15 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34057","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Part of the problem we have with the New Testament is that the one used by the Western Churches is a Greek translation of the original Hebrew,\nThere was NO original Hebrew. The Gospels ALL were written in GREEK\n\n","date":"May 19, 2013 at 3:17 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34058","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"“Therefore in terms of defining the gender of the Holy Spirit, New Covenant Christians are more disposed to the Hebrew Old and New Testament witness of the Bible which overwhelmingly reveals the Holy Spirit to be feminine. ”\nNew Covenant Christians may also believe in green UFO – who cares :-)\n\n","date":"May 19, 2013 at 3:19 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34059","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"and yet again – the provided link actually DISPUTES your point, Angel and totally REFUTES your idea of Holy Spirit being a “she: and NT written in Hebrew  :-)\nhere is what is there on the link about the Gospels written in Hebrew:\n“The claim about the NT being written first in Hebrew is so far off from scholarship that it needs only be summarized here http://www.tektonics.org/gk/greekbrew.html\n“While we can speculate until a blue moon about lost originals… there is absolutely no linguistic basis for the claim that the bulk of the NT was written in any language other than Greek.\nthe evidence strongly favors that the bulk of the NT was originally written in Greek – because:\n this is what all the textual evidence we have indicates;\n    this was the language of most of the people written to! So, for example, ALL of Paul’s letters were written to congregations in Gentile cities, and therefore there is an overwhelming probability that they were written in Greek, not Hebrew or Aramaic. There were some converted Jews in some of those groups, of course, but the likelihood that a Jew of this day – especially a diaspora Jew like Paul and his readers – would use Hebrew or Aramaic in daily correspondence to a group that included or was exclusively Gentiles is vanishingly small. (Similarly, the intended original audience of all of the Gospels except Matthew was Gentiles.)”\nthe whole link to the actual page is a rebuttal of the claim but some Sweden Protestant group about Holy Spirit being a “she” :LOL:\nAngel, read your sources, please :-)\n\n","date":"May 19, 2013 at 4:14 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34063","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"jesterof,\nI believe you are missing the point of my statement.\nJust look at the two words spirit (soul) and ghost (apparition).\nDuring the transfiguration of Jesus, Simon thought he had seen a ghost (apparition).\nJesus stated something to the effect, the spirit (soul) resides in each of us.\nYet, the Greek uses both words, spirit and ghost, interchangeably.  These words are synonymous in the Greek.  There was no distinction between the two words in the Gospel.\nWith respect to my other statement, where I believe Jesus was 40, I am aligning this to the Moses law, so to speak.\nMoses spent 40 days and nights on Mt. Sinai\nMoses spent 40 years in Midian tending his father-in-laws sheep\nJesus was tempted of Satan 40 days and 40 nights\nThe Israelis wandered in the desert 40 years\nDuring Noah’s flood it rained 40 days and 40 nights\nThis is another reason I believe Jesus was 40 years old when He was crucified.\nAnd, I’m not trying to make this a great argument, and I am not disputing the entire Canon, I just have questions on a few translations.\nBest,\n\n","date":"May 19, 2013 at 6:38 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34073","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Angel,\nTo be honest, it is difficult to understand WHAT is actually your point, especially after the last post :-) Can you describe what are you trying to prove? we know that souls do not have gender, why should the Spirit have?\n==========\n“Yet, the Greek uses both words, spirit and ghost, interchangeably. These words are synonymous in the Greek. There was no distinction between the two words in the Gospel.”\nSame is done in English ( which is not my mother tongue), but is not in 3 other languages I speak. And spirit is not the same as soul, I would assume in the hierarchy it is much higher than the soul. The word “soul” is a she in my native language but it does not mean that my compatriots perceive that the soul HAS gender and all the souls are female :-)\nYou are trying to explain the philosophical or theological question by means of linguistics and that is wrong. The word “way” in my native language has at least 2 synonyms – one is male, the other is female, both mean the same. To make things even more funny in the other language I speak one of the synonyms of the word “way” sounds exactly the same as in my native one, but it is female there and male in my language.\n\n","date":"May 19, 2013 at 7:09 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34077","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"jesterof says:\nAnd spirit is not the same as soul, I would assume in the hierarchy it is much higher than the soul. The word “soul” is a she in my native language but it does not mean that my compatriots perceive that the soul HAS gender and all the souls are female :-)\n***Angel says:  jesterof, when I was researching ghost (apparition) and spirit (soul), I had a little help from Jesus.  I had a vision of Genesis, where the Holy Spirit was walking through the trees in the Garden of Eden.  I saw a long grey, silky type skirt with an ivory/beige brocade detail around the waist band of the skirt, in the shape of a wide or elongated “V.”  I was standing on the ground and I could see the Holy Spirit’s shoes and ankles and the hem of the skirt.  I looked up so that I could see the face of the Holy Spirit, and no matter how far up I looked, I was never able to see the face.  The waistband of the skirt was at sky level and I was standing on the ground.  So, the upper part of the Holy Spirit was beyond the sky.\nTherefore, in my vision, the Holy Spirit was female.\nAfter this I made an attempt to find some scriptural verification of this fact.  I could find nothing in the Canon, so I looked at “The Gospel of Philip” and I noticed one particular passage that verified what I had seen.  Philip stated the following:\n“Those who believe Mary conceived by the Holy Spirit are in error.  When did a woman ever conceive of a woman?”\nTherefore, I believe Jesus helped me to see the light, in this case, and the vision settled the fact the Holy Spirit was female, at least, to my mind.\nI was watching the Sunday morning talk shows a few weeks ago and one of the panel referred to the Holy Spirit as a “He,” and Cokie Roberts quickly corrected him by stating “She.”  Therefore, word must be getting around in other circles, as well, the Holy Spirit is a “She.”\nYet, I can see your point in regard to your mother tongue and the various languages you speak.\nBest,\n\n","date":"May 21, 2013 at 5:22 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34239","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"PS\nWith that in mind, Mary, the mother of Jesus, was the virgin or the young maiden no power defiled.  The seed that was placed inside Mary was the seed of God the Father and the Holy Spirit, the Mother (Light and Truth).  These are the two powers. Mary was neither defiled by power #1 (God the Father) or power #2 (Holy Spirit, the Mother).\nThese two powers are the same powers that formed the world in Genesis.  Why do you think the world was lit, prior to the sun’s formation in Genesis?; Why?\nPower #1 God the Father.  In the beginning God created the heaven and the earth and the earth was without form and void; and darkness was upon the face of the deep. \nPower #2  And the Spirit of God (Mother) moved upon the face of the waters.  God said, “Let there be light” and there was light.  So, the Light, which is the Holy Spirit was the light that lit the world.\nPower #1 and Power #2 are the same two powers that formed the seed inside Mary.  Therefore, Jesus was formed of God the Father and the Holy Spirit, the Mother (truth and light) and that accounts for the divinity of Jesus.\nOn the cross Jesus stated, “Woman this is you son.”   Jesus did not state “Mother, this is your son.”  \nBest,\n\n","date":"May 21, 2013 at 5:50 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34243","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Angel\nThe account in Genesis can not be taken literally, the Pentateuch is a composite document.\nBest.\n\n","date":"May 21, 2013 at 7:38 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34252","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Louis says:\n“The account in Genesis can not be taken literally, the Pentateuch is a composite document.”\n***Angel says:  Yes, I understand.  I was told on the Jewish forum that Rashi stated the word “bara” in the Torah is the noun meaning “creating” as opposed to “created,” the verb.  And this verse(Genesis 1) doesn’t teach an order of creation, but a point during the creation process, when the world was…\nYet, I was not speaking of an order, per se, but rather the Holy Spirit is the female aspect of the Godhead.\nBest,\n\n","date":"May 23, 2013 at 3:40 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34502","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Angel, I can not dispute with visions :-)\n\n","date":"May 21, 2013 at 9:33 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34261","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"jesterof says:\n“I can not dispute with visions :-)”\n***Angel says:  The statement was not meant to be a convenient way for me to show I alone am correct.  I always believed the Holy Spirit was male.\nYet, what I am stating concerning the vision is truth, and it wasn’t until I had the vision that I searched the scriptures for the Holy Spirit being the female aspect of the Godhead.\nLeoncio A. Garza-Valdes did find female DNA in the blood on the Shroud of Turin, but this could also be attributed to those nuns who repaired the Shroud or some other female who handled the cloth.\nWe’ll know for certain when Jesus returns.\nBest,\n\n","date":"May 23, 2013 at 4:14 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34503","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"“The statement was not meant to be a convenient way for me to show I alone am correct”\nAngel, I understand.\nThe problem is –  it is just simply two unreconcilable positions and there is no way to prove who is right, because either one can be right and wrong – sometimes.\nFor me:\nHoly Spirit IS NOT FEMALE or MALE\nHoly SPIRIT does not have a gender.\n humans have gender, but God does not\n( neither do the Angels)\nBut I do not see any possible way to convince you and you are not going to convince me\n“We’ll know for certain when Jesus returns”\nThat’s for sure :-)\n\n","date":"May 23, 2013 at 4:51 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34508","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"jesterof,\nYes, I understand your sentiment and except for my vision I would agree with you.\nWhat do you think the massive circular object, weighing approximately 60,000 tons, just found in the Sea of Galilee might be? \nExcerpt:\n“Yitzhak Paz, an archaeologist with the Israel Antiquities Authority who is involved in the project, said that based on sediment buildup, it is between 2,000 and 12,000 years old, a vast range that tells little about it. Based on other sites and artifacts found in the region, Paz places the site’s origin some time during the 3rd millennium B.C., or about 5,000 years ago, although he admits the timeframe is just a guess.”\nhttp://www.foxnews.com/science/2013/05/23/massive-submerged-structure-stumps-israeli-archaeologists/\nBest,\n\n","date":"May 23, 2013 at 7:48 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34527","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Jesterof,\nJust a thought!\nHave you considered the statements made by God in Genesis when you came to your conclusion?  \nYou claim humans have gender, but God does not, and if this is truth, why would God specifically use the words “image”  and “likeness?”\nGod in Genesis 1:26\n‘And God said, Let us make man in OUR image, after OUR likeness…\nGenesis 1:27\nSo God created man in his own image, in the image of God created he him, male and female created he them.\nBest,\n\n","date":"May 23, 2013 at 8:09 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34530","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Angel,re #125\nSorry, you seem to have been led to read rubbish, because that which you read is a way of dodging the issue. Genesis says creation was ready in six days, the world was ready for humans to explore and so on. There were different trends that merged in the composition of that book and only a fundamentalist is willing to take what is written literally. The apostle Paul understood many such things clearly and thus began to transform the Jesus movement into the Christian Church.\nBest.\n\n","date":"May 23, 2013 at 8:07 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34529","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Angel, re.the comment addressed to Jesterof. Non-human animals were also created male and female.\nBest.\n\n","date":"May 23, 2013 at 8:18 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34532","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"\nAngel :\nJesterof,\nJust a thought!\nHave you considered the statements made by God in Genesis when you came to your conclusion?\nYou claim humans have gender, but God does not, and if this is truth, why would God specifically use the words “image”  and “likeness?”\nGod in Genesis 1:26\n‘And God said, Let us make man in OUR image, after OUR likeness…\nGenesis 1:27\nSo God created man in his own image, in the image of God created he him, male and female created he them.\nBest,\n\nBecause God was referring not to the body but to the spirit in therms of Image and likeness.\nSpirits do not have  gender as gendernis just there for procreation necessity.\nSpirits do not procreate, therefore they do not NEED gender\n\n","date":"May 23, 2013 at 8:24 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34534","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"jesterof says:\n“Because God was referring not to the body but to the spirit in therms of Image and likeness.\n Spirits do not have gender as gendernis just there for procreation necessity.\n Spirits do not procreate, therefore they do not NEED gender”\n***Angel says:  “God’s purpose was procreation, where the male and female (Adam and Eve) were directed by God to populate the earth. (‘Be fruitful and multiply’). \nWhile God, the Father, is Energy, the Holy Spirit, the Mother, is Light, Jesus, the Son is representative of God’s intent on earth for mankind, the family unit.\nI am not stating God is a physical man and the Holy Spirit is a physical woman.  My vision showed the Holy Spirit was the female aspect of God and this is why no matter how high up I looked, I was never able to see the upper half, or the face, of the Holy Spirit.  The vision was meant only to show the Holy Spirit was the female aspect.”\nExcerpt:\n“GOD IS FEMALE TOO!\nThere is a female aspect of God that has equal standing with the male aspect of God. God has many names and titles which, when understood, shed light upon His nature and also upon His purposes in creation.\nEL SHADDAI\n(fem.) is translated ‘Almighty God’ in most versions. The actual meaning of the Hebrew\nwords, when translated, is THE MANY-BREASTED ONE or THE FULL-BREASTED ONE\ndepicting the maternal ability to feed, succour and enfold each new life.\nBy contrast, JAHWEH(or Jehovah) is the ‘Father Image’ and one can readily see the commanding figure that such a name produces as He gives His no-nonsense directions, deals with enemies and also knows how to spank the wayward to bring them back into line!\nGod made a spiritual man (Gen.1) out of Himself in the Image and Likeness of Himself. The Hebrew word for ‘image’ is masculine in gender, while the word for ‘likeness’ is feminine.\nWhen God formed man of the dust of the earth, he was made up of both male and female parts. This readily seen when God later separated these two parts. The Hebrew word TSELAH, translated rib’ in the KJV, actually means FLANK, SIDE, HALF.\nGod brought Adam’s other half to him and declared,t hey shall be one flesh (Gen.2:24). . . no longer duality\nTSELAH-flank has the same root meaning in Hebrew as does ‘image’. As God created male and female, He placed both soul and spirit in each human vessel. Thus we could put ‘image’ as the male — spirit and ‘likeness’ as the female — soul.\nGod called their name\nAdam (Gen. 5:1). Adam later declared that Eve\nwas bone of his bone and flesh of his flesh. If she was just a ‘rib’, then he could only have said, Bone of my bone.”\nhttp://www.godfire.net/rayknight/70_Male_Female.pdf\nTherefore, when God created man in OUR image and OUR likeness He was referring to His male and female aspect, soul and spirit.  And Adam and Eve (male and female) were representative of the “flesh”  or body of mankind.\nAs a result, male and female were created with the purpose of being representative of both soul and spirit (God, the Father, Holy Spirit, the Mother) and the flesh, the mortal body (Adam and Eve).\nBest,\n\n","date":"May 24, 2013 at 2:33 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34654","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"\nAngel :\njesterof,\nYes, I understand your sentiment and except for my vision I would agree with you.\nWhat do you think the massive circular object, weighing approximately 60,000 tons, just found in the Sea of Galilee might be?\nExcerpt:\n“Yitzhak Paz, an archaeologist with the Israel Antiquities Authority who is involved in the project, said that based on sediment buildup, it is between 2,000 and 12,000 years old, a vast range that tells little about it. Based on other sites and artifacts found in the region, Paz places the site’s origin some time during the 3rd millennium B.C., or about 5,000 years ago, although he admits the timeframe is just a guess.”\nhttp://www.foxnews.com/science/2013/05/23/massive-submerged-structure-stumps-israeli-archaeologists/\nBest,\n\nI have no idea what that could be. I’ll be patient and just wait and see what will be found.\n\n","date":"May 23, 2013 at 8:27 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34535","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"The Bible was not dropped from heaven to be taken literally in everything that is stated, it was a slow development involving inspiration and revelation, myths, legends, history. Genesis shows how Mesopotamian myths crept into the text and therefore also how neigbouring nations influenced Hebrew culture.\n\n","date":"May 23, 2013 at 8:49 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34538","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Louis says:\n“The Bible was not dropped from heaven to be taken literally in everything that is stated, it was a slow development involving inspiration and revelation, myths, legends, history. Genesis shows how Mesopotamian myths crept into the text and therefore also how neigbouring nations influenced Hebrew culture.”\n***I am not taking the entire Bible literally.  \nFor certain there have been omissions, deletions, insertions and presumptions, specifically by Pope Gregory, who propagated a theory Mary Magdalene was a prostitute, despite this not being recorded in either of the four Gospels.\nYet, a major portion of the Bible is God’s word and was meant to be easily understood by the masses and taken literally.  God would not have encrypted His word to mankind.  \nAnd if the word of God was altered by man, God would still reveal his intent to those who follow Him, without doubt, through visions and dreams, as He did with Abraham, Daniel, Joseph and Moses.\nJesus stated in Matthew 11:25, “I thank thee O Father, Lord of Heaven and Earth, because thou has hidden these things from the wise and prudent and hast revealed them unto babes.”\nTherefore, whether some or a majority of the Bible is metaphor, God will still reveal its meaning to the faithful through dreams and visions.\nBest,\n\n","date":"May 24, 2013 at 2:45 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34655","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Angel\nThere is absolutely no reason to interpret everything in the Bible as metaphor and the objection is against the fundamentalist approach, something like saying “Everything is true or nothing is true.” That is the biggest mistake and clashes with what we learn from science today, but not that science alone can determine what we can know about existence. \nI have a lengthy six-page interview on the Bible ( Finkelstein, Exodus, Wellhausen and JEDP, Albright, John P. Meier, Helmut Koester, Revelation and Inspiration in the Bible, Dead Sea Scrolls, Father Roland de Vaux, Geza Vermes, Father Émile Puech, Father Justin Taylor, Essenes, Qumran excavations, “Jesus family tomb,” the Messiah, Jesus of history/Christ of faith etc.)  with one of the world’s foremost biblical scholars and hope to be able to post it soon.\nBest.\n\n","date":"May 24, 2013 at 3:36 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34660","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin:  A bit scary for Atheists?","post":"Louis says:\n“There is absolutely no reason to interpret everything in the Bible as metaphor and the objection is against the fundamentalist approach, something like saying “Everything is true or nothing is true.” That is the biggest mistake and clashes with what we learn from science today, but not that science alone can determine what we can know about existence.”\n***Angel says: “Louis, the bible contains symbolism and metaphor, but a significant portion is literal.  The book of Daniel, as an example, contains prophetic metaphor and Revelation is purely symbolical.\nJesus used the parables to insure the important points of His message were received and comprehended by even the least intelligent of His followers.  \nAnd all people understood the “Ten Commandments” were the laws of God.  As well, Jesus expanded on these laws with the two great commandments, ” Thou shalt love the Lord thy God with thy whole heart, and with thy whole soul, and with thy whole mind, and with thy whole strength” and”Love Thy Neighbor as Thyself” \nIt matters not whether one is able to interpret the metaphor or symbolism that exists in many of the books of the bible, since following God’s commandments alone is what is required for mankind’s salvation and the eternal kingdom.\nIf the entire world abided by the laws of God, there would be neither greed, corruption nor  hatred and war.  What Jesus visualized would finally come to fruition: heaven on earth.\nLouis says:\n“I have a lengthy six-page interview on the Bible ( Finkelstein, Exodus, Wellhausen and JEDP, Albright, John P. Meier, Helmut Koester, Revelation and Inspiration in the Bible, Dead Sea Scrolls, Father Roland de Vaux, Geza Vermes, Father Émile Puech, Father Justin Taylor, Essenes, Qumran excavations, “Jesus family tomb,” the Messiah, Jesus of history/Christ of faith etc.) with one of the world’s foremost biblical scholars and hope to be able to post it soon.”\n***Angel says:  “I look forward to that post.\nBest,\n\n","date":"May 25, 2013 at 11:45 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","id":"comment-34841","author":"Angel","site":"shroudstory"}]
