[{"title":"Quotations for Today: Benedict XVI and Atheist Piergiorgio Odifreddi","post":"The well-known German journalist Peter Seewald, former editor of “Der Spiegel”, once a communist and atheist, returned to Catholicism, stating that “Pope Benedict XVI is a spiritual master who can give answers.” In the interviews he later published in a book, Seewald heard the pontiff tell him that he did not want to see any questions in advance, and they were forthright questions, with answers that convinced him. Seewald was looking for the truth. Whether that will also be the case with Piergiorgio Odifreddi only time will show.\n\n","date":"September 26, 2013 at 8:39 pm","url":"https://shroudstory.com/2013/09/26/quotations-for-today-benedict-xvi-and-atheist-piergiorgio-odifreddi/","cat":"off_topic","id":"comment-45553","author":"Louis","site":"shroudstory"},{"title":"Quotations for Today: Benedict XVI and Atheist Piergiorgio Odifreddi","post":"I think it’s significant that Benedict took the time and trouble to read all of Oddifredi’s book.  Before dialogue with or evangelisation of the secular catchment can occur, it is essential to know precisely where they’re coming from and what they are saying.  Otherwise there can be no common ground for discussion.  Surprisingly, the god that atheists or agnostics don’t believe in, is often the same one that Christians don’t believe in either. In Oddifredi’s case it seems that he was already familiar with some specific works of Benedict.  One would hope that this ought to make for some fruitful and useful exchanges.  May the dialogue be as fruitful as it can be! Benedict: “… notwithstanding all the contrasts in the central area, points of convergence are nevertheless not lacking.”\n\n","date":"September 26, 2013 at 9:20 pm","url":"https://shroudstory.com/2013/09/26/quotations-for-today-benedict-xvi-and-atheist-piergiorgio-odifreddi/","cat":"off_topic","id":"comment-45557","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Quotations for Today: Benedict XVI and Atheist Piergiorgio Odifreddi","post":"There is more to read. Pope Benedict has also aimed at RD:\nhttp://blogs.telegraph.co.uk/news/timstanley/100237766/hes-back-benedict-xvi-speaks-out-on-sex-abuse-and-calls-richard-dawkins-science-fiction/\n\n","date":"September 27, 2013 at 11:05 am","url":"https://shroudstory.com/2013/09/26/quotations-for-today-benedict-xvi-and-atheist-piergiorgio-odifreddi/","cat":"off_topic","id":"comment-45623","author":"Louis","site":"shroudstory"},{"title":"Quotations for Today: Benedict XVI and Atheist Piergiorgio Odifreddi","post":"The Church is hitting hard and there is now news from: not Benedict, but Pope Francis. He has excommunicated the Australian priest Greg Reynolds for advocating the ordination of women.\n\n","date":"September 27, 2013 at 7:26 pm","url":"https://shroudstory.com/2013/09/26/quotations-for-today-benedict-xvi-and-atheist-piergiorgio-odifreddi/","cat":"off_topic","id":"comment-45659","author":"Louis","site":"shroudstory"}]
