[{"id":"comment-12164","author":"matt","post":"“A telling tale couple of bloodstains” Exactly, as I have pointed out. I am yet to hear any sort of convincing rebuttal as to what these red streaks may be. Probably because there isn’t a convincing rebuttal. Oh let’s see, just a random decorative element like the singular, asymmetrical L shaped 4 holes!!!!!!!.","date":"2012-06-10","mins":"8:37 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12165","author":"matt","post":"I was interested to come across this depiction of Christ’s entombment in a stained glass window at Chartres Cathedral. Note the shroud like image, right hand crossed over left. Not nude because it would have been offensive. Note the red burial platform / slab. Http://www.sacred destinations.com/france/chartres cathedral stained glass photos/slides/w03 8377c entombment.","date":"2012-06-10","mins":"8:49 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12163","author":"matt","post":"Colin There is a wide variety of representations of Jesus’s entombment. The majority of representations that show a sarcophagus show one WITHOUT a lid. And then there are the representations that simply show Jesus laid on a slab of stone. There is no biblical case for a sarcophagus, only references to him being entombed in a sepulchre. It is well documented that a red stone slab made from porphyry was transported from Ephesus to Constantinople in the 12th century. The stone was highly venerated as that which Jesus’s body was laid upon. Given this, and given the likelihood that the shroud was in Constantinople, I differ from others and interpret the lower object with red crosses as being representative of the red stone. The object above it is then undoubtedly (refer: 4 holes in L shaped patter mirroring the shroud – sorry Colin minimal chance this is just a random decorative element – two red streaks likely representing blood – herringbone weave type pattern – crosses under the head napkin and beyond it on the shroud near the angel’s foot representing where Christ’s body and image was imprinted into these objects) Colin, you can continue to rationalise this matter, but the cumulative evidence strongly suggests that the images are a representation of the shroud, therefore rubbbishing the carbon tests..","date":"2012-06-10","mins":"8:27 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12166","author":"matt","post":"And the work dates from circa 1150 AD.","date":"2012-06-10","mins":"8:51 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12177","author":"matt","post":"“Since when have platforms or slabs been so highly ornate?” Again you are really missing the point – do you not understand what “symbolism” means? the bottom object represents the red stone of unction, the crosses are not a literal depiction, rather symbolic depicting the fact that Christ was laid on that slab. Notwithsatnding this, there ARE depictions of an ornate stone of unction, such as that you will see in the stained glass window at Chartres (dated 1150 AD), which I posted a link to above.","date":"2012-06-11","mins":"4:26 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12179","author":"matt","post":"Historical art depictions of Jesus’s entombment often show a “sarcophagus” without a lid. In fact, what is considered to be a “sarcophagus” may not actually be a sarcophagus. It could actually be the walls of the stone of unction. Search under images in Google and you will see the stone of unction now in Jerusalem. The stone actually has walls, which project slightly above the level of the stone. Obviously some art of the entombment has shallow walls and some deep walls. The various depictions might represent a mix of objects, ie. Stone of unction or sarcophagus.","date":"2012-06-11","mins":"4:47 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12178","author":"matt","post":"Colin. I’m still waiting for an explanation from you as to the meaning of the two red streaks. You had earlier said you didn’t have time to offer an explanation. That seems very convenient for you. After all, you seem to spend plenty of time here countering other arguments. Until I hear an explanation, I will assume you don’t have a better one than that the streaks represent the blood of Christ on the shroud.","date":"2012-06-11","mins":"4:29 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12187","author":"matt","post":"I stongly diagree that it is an irrelevance. It is highly relevant to study of the shroud, because its likely integrity discredits the carbon dating that so many skeptics rely on. The fact remains that there are a number of compelling facts that strongly point to the likelihood that the images depict the shroud: – the rarity of nude depictions of Christ, which in itself is not necessarily so compelling but when combined with: – the herringbone weave like pattern – The presence of one motif on the shroud, which happens to comprise 4 holes in an L Shape, the likelihood that the artist chose this as a decorative feature is very small given the motif’s lack of symmetry – a cloth sitting on the shroud, likely representing the head napkin – the shroud in its central portion having crosses on it, likely representing the shroud image of Christ – the red streaks representing the blood on the shroud (again the likelihood that the artist just decided to whack on two red streaks for no reason is small).","date":"2012-06-11","mins":"5:41 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12191","author":"matt","post":"Yes they seem to Max. It’s totally fanciful. They compare the 4 holes to the circles forming decorative mofifs in other images, seemingly oblivious to the fact that the use of circles in other images is always in repeated patterns which are symmetrical.","date":"2012-06-11","mins":"5:54 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11840","author":"matt","post":"There are in fact 2 streaks of blood beneath the angel’s feet. And the face of jesus sits behind Mary’s right arm, rising up from the shroud, connecting to it through the alpha letter. The 4 holes are definitely the poker holes of the shroud, the L shaped alignment is assymetrical – if the circles were meant to be decorative then they would have been arranged symmetrically.","date":"2012-06-03","mins":"7:34 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11886","author":"matt","post":"Colin Man, you really, obsessively over rationalise!!!! Nothing wrong with rational thought, but….You just can’t be that rational with a piece of art that holds as much symbolic representation as literal representation, it is such a one dimensional world view. Having said that there is plenty of rational reasoning to lead one to the conclusion that the image does represent the shroud. Yes, circles are frequently used as decorative elements in the images, but they are always in symmetrical, repeated patterns. Looking at it rationally, it simply makes no sense to me that the artist would have departed from the norm to paint a “L shaped” “pattern” which has no decorative value whatsoever! Surely, if it was meant to be decorative it would have been in a symmetrical shape, such as a cross, etc. I really find your letter rationalising rather absurd. Also you have questioned why the artist would represent the poker holes at the expense of other features. I can’t answer that, only the artist knows, and remember this is a symbolic artwork not a literal representation, but anyone who looks at the shroud can see how strong a feature the poker holes are, and who knows maybe in the past they were interpreted in some spiritual manner. A latter representation of the shroud (I think from the 15th century) explicitly copied the poker holes. Also – and this is just my interpretation – the head of Jesus behind Mary’s right arm, I believe, is meant to represent the face of Christ on the Shroud, the alpha letter connects the head of Christ to the shroud. Another subjective interpretation, the head has a remarkably composed and serene feel, like the shroud. Also, there are red lines on the object – now they could be interpreted in different ways, of course, but I interpret them as representing the streaks of blood on the shroud, perhaps the two main streaks on the arms. Otherwise, what might they be? I am open to any alternative “rational” explanations, but at this stage I personally can’t think of any. If they indeed represent blood, why would there be streaks of blood on a tomb lid?Or did the artist just happen to randomly draw two red lines for some artistic effect (I think not).","date":"2012-06-04","mins":"7:21 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11917","author":"matt","post":"Respectfully, that is rubbish. There is plenty of symbolic , non literal material on the shroud. How about the alpha letter floating above the shroud, connnecting to the head figure of Christ? How about the crosses over the mid portion of the shroud, representing Christ’s contact with the shroud and the head cloth? How about the fact that Christ’s body, being taken from the cross, and then laid out on the shroud, is free of blood marks (this is clearly symbolic,or at least based on social / spiritual mores). Where I agree with you is that the artist is not a particularly skilled one. That doesn’t matter. In fact that explains things like the fact he painted crosses over the shroud, near the angel’s feet, to represent Christ’s image on the shroud. You haven’t addressed my points on the crosses, nor on the two red streaks. I think these are very valid, previously unmentioned points. I don’t think they are easy to dismiss, but I’d like to see you try…..","date":"2012-06-04","mins":"6:44 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11887","author":"matt","post":"Also there are cross motifs near the angel’s feet and the two red streaks, which carry through under the head cloth, and depart from the herringbone pattern on the balance of the shroud. Again, my interpretation is that the crosses symbolically represent Christ’s image on the shroud. They also cross under the head cloth, again representing Christ’s physical contact with that object.","date":"2012-06-04","mins":"7:39 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12189","author":"matt","post":"Ron – exactly. I agree that his explanation of the resurreciotn is dubious, but when it comes to his art historian credentials they are strong. Until another highly qualified art historian provides an alternative viewpoint, that is all we’ve got.","date":"2012-06-11","mins":"5:43 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11969","author":"matt","post":"I note Colin has still not addressed my points re: the crosses in the middle portion of the shroud, which I have stated symbolically denote the image of Christ on the Shroud, nor the two red streaks near this area (which I interpret as blood streaks). Presumably he thinks these are just random artistic emphasis Baloney!!!!.","date":"2012-06-05","mins":"11:29 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11980","author":"matt","post":"Colin said: A zig zag pattern (“herring bone weave”) and four tiny circles (“L shaped poker holes”) are simply not sufficient grounds for rejecting the most likely interpretation – a sarcophagus lid – and substituting something radically different. You can add to the two grounds of the herringbone weave, and the L shaped holes, the two red streaks likely representing blood (why would there be blood on a lid?), and the cross motifs on the central part of the shroud, as well as the image of Jesus’ serene face behind Mary’s right arm, connected to the shroud via the “floating” intermediary “alpha” letter.","date":"2012-06-06","mins":"4:02 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11979","author":"matt","post":"Well, you floated around my interpretations very nimbly, Colin. At least you are admitting the limitations of science. Yes, we will never truly know what the artist intended, but why can’t we try? That’s what artistic interpretation is, whether it is interpretation of film, painting, music etc. I’m really curious as to why you keep ignoring my comment about the two red streaks on the shroud next to the cross motifs, I can only assume one of two reasons: 1. For some reason you think my interpretation is ludicrous and not worthy of comment – if so I’d like to know why it’s ludicrous and what the two red streaks, otherwise not seen in the art, might mean 2. It is a compelling point and you are ignoring it because it is an inconvenient observation for your perspective At this point I believe the presence of two red streaks (representing blood), next to the crosses on the herringbone weave shroud (the crosses symbolically representing the image of Jesus on the Shroud), next to the L shaped holes are COLLECTIVELY compelling reasons pointing to the image being a representation of the shroud, and therefore discrediting the carbon dating..","date":"2012-06-06","mins":"3:56 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11981","author":"matt","post":"Question – does anyone know if the words in the manuscript relate in any meaningful and direct way with the images?.","date":"2012-06-06","mins":"4:08 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11989","author":"matt","post":"Colin A big “so what” re: the google search. They are hardly authoritative expert views, just opinions. Just as my view is an opinion. You can take or leave those opinions – as I do leave them – and people can take or leave my opinion – as you leave mine. I remain convinced in my opinion. I’ve heard the counter – such as your suggestion that the L shaped circles are just a random decorative element – and I disagree with them (I think it is totally illogical that an artist would draw an asymmetrical one off motif when his use of circles in all other motifs in the images are symmetrical and repeated, not to mention the red blood streaks, the cross motifs etc) BTW, I was previously doubting on the Pray Manuscript representing the Shroud. I disagreed with Stephen Jones on several of his interpretations and continue to do so. However there are several KEY features which convince me the images in the manuscript do represent the shroud. The concentraiton of these 4 5 factors around the feet of the angel through the alpha letter to Christ’s head convince me. Had there just been one or two factors then I might not have been convinced (and I was NOT convinced until I saw the red streaks, the cross motifs in the centre of the object, and Christ’s head).","date":"2012-06-06","mins":"8:31 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12016","author":"matt","post":"Colin I am afraid you are as blinded and biased as the Shroud extremists ( I note here that I am still agnostic on the shroud’s authenticity, although steer towards the pro authenticity view). I’ve said repeatedly that the use of the circles on the “shroud” has a number of key differences from use of circles in other images. Namely, it is a once used motif, unlike the other applications where they are repeated motifs characteristic of a decorative pattern AND it is assymetrical unlike the use of circles in the other applications.You appear to gloss over these FACTS You continue to apply a highly rigid scientific approach to artistic interpretation, which is totally inappropriate. Fine if you are studying cells under a microscope, not fine if you are trying to unravel meaning in a medieval work of art. Yes my interpretation of the red streaks is that they are blood. What’s wrong with that? What else could they be? Until I hear a more convincing explanation I will maintain that view.","date":"2012-06-06","mins":"7:43 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12017","author":"matt","post":"Colin You said: “I personally doubt they represent blood, but shan’t go into reasons right now” Why not? Why do you doubt they represent blood? Convince me! mmm, let’s see, the artists just decided to randomly paint two red lines, next to a pattern of crosses located centrally on an object otherwise having a herringbone like pattern, next to a cloth that looks like Jesus’s head napkin sitting on the object (refer John, Jesus’ cloths (Shroud) and head cloth were left behind) , which is next to 4 circles in a L shaped pattern, which bears no resemblance to the symmetrical repeated circle motifs in other images.","date":"2012-06-06","mins":"7:59 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12027","author":"matt","post":"Yawn, I’m leaving it there. Your world view is seriously distorted with a bizarre obsession with scientific extremism. There’s no point in any further debate!.","date":"2012-06-07","mins":"2:36 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12021","author":"matt","post":"Colin If you go to Stephen’s wesbite he now has an extract from the book “The Sign”. The author makes the same observation as me (independently) that the circles make no sense from a decorative perspective. Note the artist is an art historian EXPERT..","date":"2012-06-06","mins":"9:37 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12022","author":"matt","post":"Sorry I rushed the email, it should read “note the author is an art historian EXPERT”.","date":"2012-06-06","mins":"9:39 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12668","author":"matt","post":"The author of the book “The Sign” is a reputable art historian and he claims that the codex was influenced by the Shroud. Until you, or Colin or any other skeptic can present an art historian of equal or better standing than him arguing based on comprehensive analysis that the codex is unlikely to have been influenced by the Shroud, then you are on the losing side of the argument in terms of art history..","date":"2012-06-18","mins":"7:17 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12425","author":"matt","post":"Good try Colin, but not good enough. What you perceive as the Shroud (and others like myself perceive as the face cloth) has a clearly defined thicker edge that finishes well to the right of the two red streaks (blood stains) and the crosses. But good to see you now acknowledge the red streaks represent blood, which are not on the face cloth (your “Shroud”) but are clearly on the herringbone weave like shroud. Makes no sense whatsoever that a sarcophagus lid would have streaks of blood on it. Just as it makes no sense to me (unlike you) as to why an artist would happen to randomly paint 4 small circles in an assymetrical L shape mirroring the prominent poker holes on the real shroud (remembering that in reality the image is faint and the poker holes are a prominent feature, possibly one of mystery back in time) I am going to test your claim “I suspect that most folk looking at my picture with the non essential detail blanked out will accept my interpretation.” on my 15 year old, 150 IQ son tonight, doing my very best not to influence his opinion (he is sufficiently confident and outspoken that he will state his view rigorously regardless of any influence) Matt Ph D (History).","date":"2012-06-14","mins":"3:24 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12776","author":"matt","post":"Colin Now you are simply being nasty and childish. If you go to Stephen’s site, you will see I have admitted I was wrong. Unlike some people, I am genuinely interested in exploring interpretations and different points of view. I found something, I put forward a theory, I searched further and tested – and found my theory wrong. I’m man enough to admit it. I note that you proudly state that you picked that it was St Alexius tending to a sick girl – well the last laugh is on you because upon my further research I found the legend that clarifies that the “little girl” is actually St Alexius, and it is the Pope visiting him. So before you go pointing your finger and going “ha ha you were wrong” maybe you need to consider your own human fallibility as well. And now I’ve heard it all about the 4 L shaped holes. Testing the ink? Please, that’s just really desperate!!!!! The fact is the cumulative evidence is overwhelming in support of the codex image being influenced by the Shroud. Please explain the blood as represented by the red streaks, when no shroud in an entombment scene in art showed blood, within hundreds of years of this image (I’ve seen the odd image dating much later that shows blood on a shroud, probably because as Christianity evolved Christ’s humanity and suffering came to be emphasised more) ..","date":"2012-06-20","mins":"8:52 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12426","author":"matt","post":"Just another thought upon perusing the image again, I’m sure people have touched on this before…In the upper image of the nude Christ, neither of his hands have thumbs. This is logical for his right hand, given the perspective, but not so logical for the left hand. It would have been logical for the thumb to be displayed for the left hand, given the perspective. The fact that it isn’t provides further strength to the case that the image is based on the real shroud..","date":"2012-06-14","mins":"3:42 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12841","author":"matt","post":"Colin To be fair you didn’t say MIGHT, you said “probably” (10.32) and also indicated a fairly strong belief in the notion of red streaks as blood at comment at 12.51. You said: “But when I came to take a close look at the red zig zags, I noticed they were wavy in profile. “What’s more, they matched a similar wavy profile, i.e. With rounded crests, on the adjacent black pattern. But elsewhere the black pattern was strictly stepped, with sharp right angles” Simply not true. The black lines are only SLIGHTLY off the right angle next to the red streaks, and if you go further over to the right in the vicinity of the L shaped circles you will see further evidence of black lines that are slightly curved / off the right angle.","date":"2012-06-21","mins":"4:38 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12839","author":"matt","post":"“I do not understand why anyone would want to copy it without making it very clear, from the size of the cloth and the double image, what they were wanting to show their audience.I have seen no good reason why this has to be a secret or symbolic picture of the Shroud.” Unlike Church Frescoes or paintings, the image is not intended for “public consumption”. The manuscript was likely used as a resource by monks / clerics. Therefore there was no driver to explicitly show an image of the shroud. This may also explain why Jesus is shown nude, without the usual skimpy cloth around his waist and pubic area – there was no need to protect Jesus’s modesty in a highly public setting. Given Hungary’s close connections with Constantinople at the time, it is likely that the Shroud and its characteristics were quite well known amongst holy men in Hungary, therefore there would be little need to represent it literally. But as anyone who has viewed the Shroud with the naked eye will testify to, two of the most apparent features to the naked eye are the red streaks of blood on each of the arms, and the two sets of 4 poker holes in an L shape. These were simple enough to illustrate fairly literally by the rather unsilled artist working on a miniature work as we see in the codex illustration. By contrast, imagine the difficulty for the unskilled artist working in a miniature medium trying to represent a light, ghostly image of Jesus – difficult. This is why the artist has taken the “shortcut” of representing the body image in a more symobolic manner by way of the cross motifs in the middle of the shroud, just adjacent to the angel’s foot. It should be kept in mind that the main purpose of the illustrations is unrelated to the shroud. The illustrations merely illustrate the story of Jesus’s death, descent from the cross, burial and resurrection. The knowledge of the Shroud and its characteristics has merely informed the art. Probably just as the presence of the venerated red stone “stone of unction” at the time in Constantinople has informed the red colouring of the burial stone at the bottom of the image. If the stone in Constantinople had been yellow, then we probaly would see yellow crosses on the burial stone at the bottom of the picture. The knowledge of the sacred relics has merely informed the art – it’s as simple as that. There is not an agenda to mysteriously and symbolically reveal the Shroud. This is simply my interpretation, any how..","date":"2012-06-21","mins":"4:12 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12428","author":"matt","post":"Further to my point at 3:24 am, if the crosses were only connected to what Colin calls the shroud (and I call the face cloth) then the crosses should have gone further to the right across the raised cloth. They don’t and the image clearly depicts a face cloth lying over the shroud, with the crosses underneath and to the left of the face coth representing Christ’s image on the shroud UNDERNEATH the face cloth.","date":"2012-06-14","mins":"3:48 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12840","author":"matt","post":"Colin If it is an ingenious invention created by human hands, why with all the modern knowledge and technology we now possess no one has been able to convincingly explain how the image was created, and REPLICATE the image with ALL its unique characteristics? If you, or someone else, can convincingly explain and replicate the image with all its characteristics, then I might be open to changing my view on the shroud Until then….","date":"2012-06-21","mins":"4:18 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12849","author":"matt","post":"Colin I fail to see why it isn’t a fair test, given today’s technology and knowledge? the flourescence is a key one…if you could prove that then I’d be one step closer to contemplating that the shroud MIGHT be a human invention (despite what you might think I’m actually pretty much agnostic on the shroud’s creation – albeit leaning slightly more towards a divine explanation).","date":"2012-06-21","mins":"5:07 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12847","author":"matt","post":"I agree with much but not everything Stephen says. Personally I think the feminine figure on the right is holding part of the larger shroud with her left hand, but I think the other elements that he has coloured in green are simply parts of the clothing that the characters are wearing.","date":"2012-06-21","mins":"5:00 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12850","author":"matt","post":"Colin Surely can’t be too hard to find a skeptical practising scientist to test that, or for you to access the necessary equipment?.","date":"2012-06-21","mins":"5:10 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12848","author":"matt","post":"Actually the hand position of the character on the left indicates he might be holding part of a larger shroud too.","date":"2012-06-21","mins":"5:03 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12431","author":"matt","post":"Colin It is pefectly clear where the face cloth ends, in my opinion – it is just a little to the right of the red streaks, with some double thickness, dimpled type lines. There are clearly crosses between this edge of the face cloth and the red streaks. The crosses clearly depict Christ’s image on the shroud, which the face cloth sits on top of. Well, that’s my strong opinion, anyway. You are perfectly entitled to your view!.","date":"2012-06-14","mins":"4:33 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12437","author":"matt","post":"Ok, results in. My son traced the outline of the cloth and it agreed with my opinion independently.But….to be fair my wife independently came to your conclusion Colin.","date":"2012-06-14","mins":"5:40 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12494","author":"matt","post":"I’ve asked 5 people today to trace the outline of the face cloth, and all have come to the same conclusion I did. They clearly see the edge of the cloth as I have, and consider the cloth is transparent, hence why you can see a couple of the crosses through the cloth..","date":"2012-06-15","mins":"3:15 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12430","author":"matt","post":"Ha ha ha. Just thought I’d add in my Ph D since you did for yourself the other day, just to make it clear that contrary to what “some” people may think, it is not just nutty simpletons who believe the manuscript images were based on the shroud. BTW, in my Catholic prayer group 3 out of 8 members are current doctoral students in SCIENCE. So much for science and Christianity being incompatible! “Who says there is blood on the sarcophagus lid? I certainly don’t. My interpretation is that it is just peeping through on the wavy end of the shroud having tracked down the inside surface that is out of view” Now that is a good one!!!!.","date":"2012-06-14","mins":"4:27 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12429","author":"matt","post":"Good point Yannick. It is the collective evidence that is compelling, rather than one or two discrete factors.","date":"2012-06-14","mins":"4:21 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12451","author":"matt","post":"I think it is significant that Colin has finally admitted that the two red streaks represent blood on the shroud. I am happy to be corrected but as far as I can recall there are no images of this period that show the shroud in an entombment scene, with blood stains / marks. This uniqueness presents a further argument for the pray manuscript images having been influenced by the shroud..","date":"2012-06-14","mins":"8:56 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12509","author":"matt","post":"Colin How about you ask a few people for their opinion? Without bias. Just say “look, do you see that cloth looking object sitting on the object with the pyramid like pattern? Can you trace with your finger what you think the outline of the cloth is” I have nothin to “admit”. The cumulative evidence points strongly in favour of the view that the images in the manuscript has been influenced by the shroud.I’m not going to repeat each item of evidence again, it’s been done to death. And again you make the “fundamentalist scientist” error of trying to interpret everything literally, in terms of questioning why the head napkin should be transparent. In your world view, we need to rationalise the great symphonies, the great art, the geat poetry. There is no room for artisitc licence, symnolism, metaphor. What a sad, souless, artless and one dimensional world view..","date":"2012-06-15","mins":"6:02 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12762","author":"matt","post":"I’ve just come to this comment of Colin’s and again have to disagree and feel the need to explain this: “There are no compelling biblical grounds for the illustrator needing to include a napkin in his picture, but every reason to show a burial shroud, which is what that heap of discarded cloth represents” Why are there “no compelling biblical grounds” Colin? The linen cloths and the head napkin are both mentioned in John. Neither are mentioned in Mark, which nonetheless provides a strong basis for the picture. The artist has created a scene that is a composite of the story of different gospels. Both gospels of John and Mark were the most highly revered gospels at that time. Creating a composite picture is in fact highly logical when one thinks that the Christian worldview is a composite of accounts that are in spirit the same, but have differences here and there..","date":"2012-06-20","mins":"6:25 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-14085","author":"matt","post":"I went to the University today which has a large selection of books on art history, including byzantine art. I couldn’t find this epitaphios, but I found a similar one ( similar pose, marks over the body, weaved shroud) that was dated in a reputable source at 1200 AD. Where did you find the image Colin? Would be great if we can find some answers on this!.","date":"2012-07-22","mins":"3:44 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)"},{"id":"comment-12514","author":"matt","post":"Colin I never claimed the image was a great piece of art. In fact I have stated that it is a relatively poor illlustration. But it is still ART, in that it is a representation of something, with symbolic and metaphorical context. Anyway, any further debate is futile because our positions are deeply entrenched and not at all reconcilable. But thanks for the chat, I’ve learnt something and in fact become more convinced of my position..","date":"2012-06-15","mins":"8:34 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-14146","author":"matt","post":"Dan That date is interesting. The epitaphios from 1200 (Venice) is very similar style, including markings and blood all across the body, and the herringbone weave. Either G. Schiller is wrong (I think unlikely) or the info you have posted is wrong. Of course they might be 100 200 years apart, but that seems unlikely given their striking similarities I’ll try and get into the uni and so a colour photocopy and scan of the 1200 AD Venice one..","date":"2012-07-23","mins":"6:41 pm","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)"},{"id":"comment-14440","author":"matt","post":"Dan Did you not have any luck tracking down a better resolution image, also can you please provide the source for this image??? Personally, I find so much of the science still inconclusive or questionable , I think the better clues lie in art history / history. I’m going to try and get the image from 1200 AD.","date":"2012-08-03","mins":"8:01 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)"},{"id":"comment-14106","author":"matt","post":"Good comment Yannick. It seems unlikely that epitaphios artists would have just coincidentaly decided to use a herringbone weave pattern. I think it is highly likely that they did so having viewed the Shroud, or at least heard of the Shroud’s herringbone weave. The only other realistic possibility I can think of is that maybe linen cloths at the time the epitaphios were created in the 1200s / 1300s had herringbone weave? Can anyone confirm or deny this? As I said above, I viewed an epitaphios dated circa 1200 AD in G. Schiller’s authoritative Iconography of Art volume. That had the herringbone weave, so if one accepts the argument that the use of the herringbone weave pattern on shrouds shown in epitaphios was influenced by the Shroud of Turin, then that provides further evidence for the Shorud of Turin’s existence before 1200 AD..","date":"2012-07-22","mins":"11:02 pm","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)"},{"id":"comment-14114","author":"matt","post":"Yes the 1200 AD Venice epitaphios is the one I viewed in G. Schiller’s authoritative volume. Max – I fail to see any zigzag weave pattern in the Hetoimassia:.","date":"2012-07-23","mins":"6:45 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)"},{"author":"matt","post":"For me, there are many interesting things in this image, some of which are more compelling than others. But the two most compelling factors remain:1. The position of the nude Jesus in the artwork, strikingly similar to the image of Christ on the shroud2. The herringbone bone weave like pattern at the bottom of the image, with the 4 poker holes in the L shape.Any notion that these holes are some kind of pattern or motif without any connection to the poker holes on the shroud is illogical. A decorative pattern comprising the circles would surely have been in a symmetrical pattern, rather than the asymmetrical pattern of the 4 L shaped poker hole alignment..","date":"2012-05-28","mins":"8:39 PM","url":"http://theshroudofturin.blogspot.com/2012/05/my-critique-of-pray-codex-wikipedia-1.html","title":"\nMy critique of \"The Pray Codex,\" Wikipedia, 1 May 2011\n"},{"author":"matt","post":"And what of the letter of the alphabet type figure above the supposed shroud? Is it a hungarian letter? What might it mean?Also, is that an image of the shroud's peaceful, closed eyes head behind the right arm of the apostle?.","date":"2012-05-12","mins":"10:57 AM","url":"http://theshroudofturin.blogspot.com/2010/01/shroud-of-turin-z-pray-manuscript.html","title":"\nThe Pray Manuscript (or Codex)\n"},{"author":"matt","post":"Stephen I fail to see how the shroud can be interpreted to be twice the length of the man please explain. The only thing I can think of is that you are interpreting what I think is the tomb (with the red crosses) as part of the shroud. Likewise, I can't understand the reference to the L shaped pattern of holes on \"the front and the back\". Clearly there is the L shaped pattern of 4 holes on the object which the angel is standing on, but I interpret the circular objects on the object below it with the red crosses (which I think is the tomb) as decorative. Also, if the painting is a copy of the shroud why is Jesus's body in the top part of the painting free of wounds and blood stains? Also, does Jesus in the painting have a beard? At best I can pick out whiskers!.","date":"2012-05-12","mins":"8:34 PM","url":"http://theshroudofturin.blogspot.com/2010/01/shroud-of-turin-z-pray-manuscript.html","title":"\nThe Pray Manuscript (or Codex)\n"}]
