[{"id":"comment-14322","author":"matt","post":"I’m a very open minded person (I think it is highly likely based on the collective evidence that the Shroud is authentic, but I am certainly not 100% convinced), and as I said Colin talks sense sometimes when he is not talking nonsense (he’s better sticking to science, rather than getting into quite frankly absurd historical and artistic arguments). I think he has some interesting thoughts on his scorch theory, and I for one wouldn’t dismiss his theory that the Shroud image is a LIGHT scorch, hence why it is non fluorescent. I would like to see this theory tested further, to me it is the only plausible argument for non authenticity. His thoughts on the crease marks adjacent to the head image being potential evidence for a scorching method are also quite interesting, in my view. If someone disproved his theory I’d say I’m 100% convinced of authenticity (I have no time for bas relief rubbing theories).","date":"2012-07-30","mins":"7:04 am","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But."},{"id":"comment-14402","author":"matt","post":"Hi Yannick Re: Number 1. I’m still not satisfied!!! What could possibly block the image formation through the top of the head? Could Jesus’s crown of thorns have prevented image formation, for example if the Crown of thorns was tall enough to prevent contact between the top of the head and the cloth? But even if that was possible, it would be unlikely that Jesus would have been wrapped in the shroud without removal of the crown of thorns?.","date":"2012-08-02","mins":"4:02 am","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But."},{"id":"comment-14403","author":"matt","post":"Further to my last comment I see from searching the internet that some theorise that the crown of thorns was more like a cap. If that is the case, the cap of thorns would have prevented contact between the top of the head and the shroud, perhaps explaining the lack of image. However, if this is correct it may be problematic for resurrection induced radioactive image creation. Surely if the image was created by supernatural energy generated during the resurrection, that would have been emitted from the top of the head and the energy would have left an image of the top of the head and cap of thorns? Therefore, if we are to argue the case that the shroud really wrapped Jesus, perhaps image formation through some biological process resulting from contact between body and shroud is more likely? I find it hard to accept the vertical projection theory.","date":"2012-08-02","mins":"4:14 am","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But."},{"id":"comment-14375","author":"matt","post":"Yannick Thanks for your responses. There are a couple of other things that still trouble me about the Shroud: 1. Why is there no image on the top of the head. Surely the top of the head would have created an image, whether the rest of the image was created by radiation, amines or whatever? The lack of image on the top of the head provides some support for Berry’s bas relief scorch theory 2. How about the creasemarks just below the chin / above the head? I think Berry makes quite a good argument that these creasemarks appear the product of a scorch ( they remind a bit of what happens when you iron a crease into a shirt).","date":"2012-07-31","mins":"11:26 pm","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But."},{"id":"comment-14343","author":"matt","post":"Yannick – but my point is that Colin’s theory is that a light scorch, as opposed to a heavy scorch may NOT cause a flourescence. Do you have any evidence to disprove that LIGHT scorches also do not cause flourescence.","date":"2012-07-30","mins":"6:46 pm","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But."},{"id":"comment-14288","author":"matt","post":"Great piece Yannick. I have one question you or others might be able to answer. I have often heard it said that there is no image under the bloodstains. Can someone please explain how this is known? would it not be impossible to tell without scraping away the bloodstains? Or has this been determined through some kind of scanning technology? This has been troubling me for a while so an explanation would be appreciated!!!!.","date":"2012-07-29","mins":"4:06 am","url":"https://shroudstory.com/2012/07/28/yannick-delights-with-another-great-paper/","cat":"blood_studies","title":"Yannick Delights with Another Great Paper"},{"id":"comment-14318","author":"matt","post":"Yannick Could not the presence of blood have chemically affected the image eg. The blood was added on to the image, and the blood worked chemically in some way to erode the image? I am not a scientist, but just offering up what seems a possible alternative consideration as a layman.","date":"2012-07-30","mins":"3:17 am","url":"https://shroudstory.com/2012/07/28/yannick-delights-with-another-great-paper/","cat":"blood_studies","title":"Yannick Delights with Another Great Paper"}]
