[{"author":"matt","post":"Superb critique Stephen.Speaking of Dan's blog, I have been debating the Pray Manuscript with Colin Berry. A significant development was that after much prompting I got him to admit that the two red streaks on the shroud were in fact blood. This is a significant victory, because as I pointed out to him it is unknown for art of that period and even up to at least the 14th 15th centuries, for images to show blood on the shroud in entombment scenes. This is further evidence that the manuscript is based on a viewing of the shroud.He's still saying that the 4 circles in a one off, assymmetrical L shaped pattern are just a random decorative motif though, which just defies logic as far as I am concerned!.","date":"2012-06-16","mins":"12:42 PM","url":"http://theshroudofturin.blogspot.com/2012/06/turin-shroud-is-fake-and-its-one-of-40.html","title":"\n`The Turin Shroud is a fake ... and it's one of 40': Antonio Lombatti\n"},{"author":"matt","post":"Stephen I should clarify that when I am referring to two red streaks on the shroud, I am referring to the shroud as shown on the Pray Manuscript image. Sorry for not articulating that clearly.Colin didn't admit to real blood on the real shroud, rather he admitted the two red streaks on the object in the Pray Manuscript image which he thinks is the sarcophagus lid and we think is the shroud, represent blood.I think this is significant. As I say,in the history of the art of Jesus's entombment there is very little evidence of blood on Jesus's discarded cloths / shroud. Almost always the cloths / shroud are unblemished. I think that the Pray Manuscript artist shows two red streaks representing a bloodied shroud is therefore very significant.My interpretation is that the two red streaks represent the two long streaks of blood on the arms of Jesus in the real shroud. In my view this is all stacking up very nicely, as the two long streaks of blood on the arms in the real shroud, and the L shaped poker holes, are two of the most prominent features..","date":"2012-06-16","mins":"4:32 PM","url":"http://theshroudofturin.blogspot.com/2012/06/turin-shroud-is-fake-and-its-one-of-40.html","title":"\n`The Turin Shroud is a fake ... and it's one of 40': Antonio Lombatti\n"},{"author":"matt","post":">I cannot see those \"two red streaks\" on plate III of my copy of Berkowitz.I'm talking abut the two parallel red streaks on the image at the bottom of Plate 3, near the angel's foot, on the herringbone weave patterned object. The red streaks are next to cross motifs which I believe symbolise the image of Jesus on the real shroud.So, to sum up, what I interpret in the lower image of plate 3: There is the herringbone weave patterned shroud (whether it is the shroud by itself or the shroud on top of a sarcophagus lid is fairly inconsequential) On this representation of the shroud are crosses in its central area, to the right of the angel's foot. These crosses represent the image of Jesus on the Shroud Immediately to the left of the crosses, just under the angel's foot, are two red streaks, which represent the blood marks on the shroud, possibly the two most prominent streaks of blood on Jesus's arms. The streaks are shown as the artist is moving progressively to showing Jesus's wounds and pain, from the small blood marks on the head in the upper image of Plate 3, to the more prominent red streaks in the lower image, to the blatant wounds on Jesus in Plate 4 Then to the right of the crosses and slightly overlapping them is the head cloth of Jesus, which is connected to the image of Jesus's head on Mary's sleeve. Colin Berry thinks this is the shroud.Note the original Greek of the Bible uses a word equivalent to \"entwined\" for the head cloth, rather than the commonly used word \"Folded\" in English translations. To my eye at least the head cloth looks entwined Then to the right of this are the 4 circles which we interpret as the poker holes. Their placement is consistent with their placement on the real shroud just to the side of Jesus's image.","date":"2012-06-17","mins":"7:25 AM","url":"http://theshroudofturin.blogspot.com/2012/06/turin-shroud-is-fake-and-its-one-of-40.html","title":"\n`The Turin Shroud is a fake ... and it's one of 40': Antonio Lombatti\n"},{"author":"matt","post":"Stephen I got an interesting book on the Christian World in the Middle Ages, I found an image from the 11th century, a fresco from the church of San Clemente, Rome. It depicts scenes from the life of St Alexius, who lived in the fifth century, and interestingly was based in Edessa.In this image, St Alexius is praying over a sick girl, but look at the object by his right side. It looks suspiciously like a representation of the Shroud of Turin, although it is a bit hard to decipher the detail. At the very least, it is Jesus's full length image on \"something\". Http://www.flickr.com/photos/hen magonza/4641534107/Thoughts???Matt.","date":"2012-06-17","mins":"3:54 PM","url":"http://theshroudofturin.blogspot.com/2012/06/turin-shroud-is-fake-and-its-one-of-40.html","title":"\n`The Turin Shroud is a fake ... and it's one of 40': Antonio Lombatti\n"},{"author":"matt","post":"Stephen Freeman's comment that interest in the Shroud has only been intense in the last 50 years is patently untrue.The large number of copies of the Shroud from the 1500s is witness to the interest that has always existed in it.It is certainly true that interest in the Shroud is MORE intense and widespread today, thanks to technology, as well as the benefit of photography..","date":"2012-07-05","mins":"3:52 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n"},{"author":"matt","post":"Stephen The atheist Freeman notes the following under an image on an early page of his piece:\"Above, this wonderful icon from c. 1500, now in the Museum of Byzantine icons in Venice, shows clearly how the discarded burial cloths were seen in the eastern tradition, based doubtless on the gospel accounts. There is a separate sudarium and the wrappings from which Christ had extricated himself. The cloths found in the Jerusalem tomb in 2009 correlate with this tradition, an interesting example which points to the historical reliability of John’s gospel.\"Note the references to the separate sudarium and the wrappings, and the reference to the 2009 tomb findings supporting this. This supports the notion that the Pray Codex lower image Plate III shows the sudarium on top of the Shroud. As we know some anti authenticists claim the Shroud is the small cloth object on top of a sarcophagus lid.It's also interesting looking at this image and seeing the tomb / sarcophagus without a lid adjacent to it. Again, contrary to what some anti authenticists say, it is actually far more common in art to see the empty tomb without an adjacent lid than an empty with an adjacent lid.Also of interest to me is Freeman's acknowledgement of the historic reliability of John's gospel quite an admission from an atheist!!!! I'm working my way through his paper and will offer more views..","date":"2012-07-09","mins":"11:08 AM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n"},{"author":"matt","post":"Freeman says:\"An even more bizarre explanation comes when Wilson tackles Byzantine art. Seventy years ago a Frenchman, Paul Vignon, noted that the bearded face on the Turin Shroud has some of the characteristics of Byzantine art. All kinds of measuring was done and some enthusiasts found as many as sixty resemblances. This is all interesting but Wilson goes on to make the absurd suggestion that this was because Byzantine art was born from the Image of Edessa, also known to Wilson as the Turin Shroud! Wilson makes some vague points about a new period in art at this time and finds a reference to two wandering Georgian monks with contacts with Edessa in the 530s who may have painted images. His key argument is the appearance in iconography of Christ with a beard happens just at this time. Yet, even if Wilson claims, against Belting who prefers a date fifty years later, that the Image of Edessa was known from the 540s, Byzantine art was well under way by then. So we have the earliest bearded Christ in the catacomb of Commodilla in Rome in about 390 and then a fine central image of a bearded Christ in the church of San Pudenziana of c. 405 (below). Even a brief glance at a standard history of early Christian art would have shown Wilson the emergence of these fully fronted bearded portraits in the fifth century.\"Actually, as I have stated before, the story of St Alexius has him travelling to Edessa in 405 AD to venerate an icon, that eventually \"talks to him\" and influences his spiritual path.Whilst the evidence is not categorical, I consider it very likely that the icon is the Image of Edessa, which takes us back to 400 AD at least. So it is likely that the Image of Edessa DID influence the bearded depictions of Jesus that began to arise in the late 300s / early 400s.","date":"2012-07-09","mins":"5:26 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n"},{"author":"matt","post":"Freeman says:\"If Wilson’s thesis that this linen cloth was the Mandylion was not already in enough trouble, he still has a major issue to tackle, the history of the Shroud from AD 30 to the second half of the sixth century when the Edessa Image aka to Wilson the Turin Shroud is first recorded in Edessa. It is a long period, much more challenging than filling in a mere 150 years.\"I have suggested above that the story of St Alexius strongly suggests that the Image of Edessa was in Edessa at least as early as 400 AD. Freeman overlooks the fact that Christianaity was persecuted in its first few hundred years of existence, and as result Christian relics would hardly be widely publicised!!! Once Emperor Constantine stepped in to cut that nonsense out in the early 300s, we then have less than 100 years of a lack of documentation. I would suggest that is a relatively insignificant gap. Or even if the St Alexius story is not accepted, about 200 years which again isn't really problematic.It should also be remembered that the iconoclasm from the early 700s likely saw many images and / or records of the Mandylion / Image o Edessa / Shroud of Turin destroyed.","date":"2012-07-09","mins":"5:36 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n"},{"author":"matt","post":"My last point:Freeman says:\"When one looks at the lower image of the Codex, the discarded burial cloths are there but if the illustrator had seen the Shroud he would have surely shown the image of Christ on them. As it is they are jumbled up and hardly seem anything like the size of the Turin Shroud.\"Comment: Why didn't the illustrator show the image of Christ on the Shroud? I don't know! But I can only hypothesize. Most significantly, the size of the Pray Manuscript is very small and it would have been very hard for the artist to meaningfully depict Jesus's image at this scale.There is also the question of HOW he would depict what is a very faint image. I believe the Shroud image of Jesus is symbolically represented by the cross motifs near the angel's foot, and this is an easy way to get around both the scale issue as well as the faint image issue. Freeman goes on: \"The most important point of all is that a blown up image shows that the sudarium is depicted as a separate piece of cloth and so the source seems, once again, to be the account in John’s gospel where the sudarium is reported as lying separately. This cannot be the Turin Shroud! The usual practice of taking the gospel accounts as an inspiration seems to have been followed here.\"Comment: I'm glad Freeman acknowledges the small bundled up cloth is far too small to be the Shroud. Indeed it is! He rightly identifies it as the Sudarium, which is supported by the alpha letter connecting the sudarium to Jesus's head behind Mary's right arm. So at least Freeman is one step more advanced than our friend \"Science bod\" who thinks this small piece of cloth is in fact the shroud (no matter what you think of the artist's abilities, he does tend to get scale and perspective quite accurate in the illustration, and this cloth is far too small relative to the human figures adjacent to be the shroud. You are on the right track Mr Freeman!!!). And finally Freeman again:\"No one who had seen the Turin Shroud and been impressed with it would have illustrated the discarded burial cloths of Jesus as is actually done on the Pray Codex, with, in the conventional gospel representation from John, of the sudarium being shown separately as it clear from a blow up pof this part of the manuscript. There is not a single hint that there is anything to do with the Turin Shroud here!\"Comment:Wrong! Freeman the historian should know as much as anyone that ancient art used much symbolism. He acknowledges the small bundled cloths are the sudarium (good!) but fails to see the Shroud beneath it. He dismisses the random asymmetrical 4 holes in an L shaped pattern but does not offer an alternative explanation. He thinks it is a sarcophagus lid but ignores the two red streaks which subtly represent the blood of Christ on the Shroud. If it is a sarcophagus lid then what are the two red stripes? And is it mere coincidence that the red stripes and the 4 holes are located adjacent to the cross like motifs, echoing the blood images on the Shroud image and the holes just to its side? BUT Freeman has actually done our case a great service. He recognises the small bundle of cloths as the sudarium, but then wonders why there isn't a shroud, since the sudarium is consistent with John (but missing the shroud of John). Well, Mr Freeman, the image is more consistent with John than you imagined, because both the head cloth AND the shroud is there in the image (the former on top of the latter). To be fair to Mr Feeeman, the shroud is encoded in the artwork rather subtly and symbolically..","date":"2012-07-09","mins":"7:44 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n"},{"author":"matt","post":"I turn to Freeman's criticism of the Pray Manuscript: \"These scenes are supposed to show that the illustrator knew of the Turin Shroud. However, let us start with what would be obvious to anyone who had seen the Shroud, the size of the cloth and the two images. So to turn to the Pray Codex, it shows Christ being laid onto a shroud, which, in traditional Jewish style, as recorded in John’s gospel, reaches only to his shoulders. There does seem to be some sort of fold under the buttocks but hardly enough to make up the size of the Turin Shroud. Surely anyone knowing the Turin Shroud would have shown it with the top half of the Shroud above his head ready to be folded back over the body and fixed at the feet. Then the Turin Shroud shows a bearded Christ, this illustration does not, unless it is a very light beard.\"As Stephen has shown, actually the Shroud in the Pray Manuscript is much bigger than it first appears, as the figures in the background are holding an area of the shroud much greater than that which lies under Jesus's body.Also the illustration of Jesus does show him with a light beard.The beard on the Shroud image is not particularly heavy either, and many illustrations of Jesus in art history have him with a relatively light beard..","date":"2012-07-09","mins":"7:15 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n"},{"author":"matt","post":"Stephen Further to my previous points about the real suffering of Jesus not being graphically shown until the 1400s, I've borrowed a book called \"Jesus Christ\" by J.R. Porter. Porter is Professor Emeritus of Theology at the University of Exeter.A chapter on the history of Jesus's representation in art is written by art historian / lexicographer Jennifer Speake. On page 216 she states:\"In the post Romanesque West a concentration on the physical torment of the Passion aimed to elicit powerful emotions of horror and sympathy in the onlooker. FROM THE FIFTEENTH CENTURY ONWARD, a growing observation and understanding of anatomy in the West brought to the NEAR naked body of Jesus on the Cross a disturbing realism completely absent from the stylized torsos and musculature in Eastern icons.\"So this from an art historian backs up my own non art historian observations that the kind of graphic, body wide torturous suffering we see on the Shroud was not observed until well into the 1400s (some from the 1420s / 1430s, most from after 1450) in art, and further that all art (I think there might be one known exception) showed Jesus's moedesty protected by a loin cloth at least.Anti authenticists need to explain the following: Why would an \"artist\" create the shroud in a manner that departs so radically from the conventional artistic depictions of Jesus at the time? (ie. Prior to 1357 AD). We know in modern art that there have been radical innovators who have departed from the norm, but in ancient times artistic evolution was far more gradual. In particular, if an \"Artist\" did it as a way to benefit from the relic trade, then it doesn't make sense to show Jesus's brutal inflictions when most people at this time would have found such a depiction offensive Furthermore, even into the 1400s and 1500s Jesus was almost universally shown with a loin cloth as a minimum protecting his modesty. Again it makes no sense that an artist looking to profiteer from the relic trade would create the shroud without the loin cloth, with buttock images on full display Similarly, an artistic creation would surely aimed to unambiguously show Jesus with wounds in both hands, let alone one wrist. The Shroud image alludes to a wound on both hands by virtue of the streams of blood on both forearms, however it is hard to imagine that a artist looking to profiteer from the relic trade would be so subtle Supporting these points is that ALL the copies of the Shroud do one or more (usually all) of the following: Show Jesus with a loin cloth Show Jesus with both hands pierced Do not show the body wide flagrum marks.","date":"2012-07-11","mins":"9:14 AM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n"},{"author":"matt","post":"Christian Art Historian Thanks, I hadn't come across that pieta statue. I have also seen a date of 1360, so not sure how reliable the dating is. Can you provide reliable source of its dating?What I can say is that most of the pieta showing Jesus's extreme suffering date from 1390 or later: Refer:http://en.wikipedia.org/wiki/Piet%C3%A0 And in terms of painting, such grotesque depictions of Jesus certainly didn't become commonplace until well into the 1400s..","date":"2012-07-11","mins":"7:49 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n"},{"id":"comment-8948","author":"matt","post":"The “No” in the beginning was supposed to be a “Now”.","date":"2017-04-20","mins":"3:47 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/04/07/sturp-space-age-technology-unleashing-religious-propaganda/","cat":"turin_shroud","title":"STURP: Space-age Technology Unleashing Religious Propaganda!"},{"id":"comment-8936","author":"matt","post":"Hey, nice post. I got another one for ya. So I found Ian Wilson’s claim that King Abgar was reportedly in possession of a cloth that shows Jesus’ ” whole body”. People are saying the Edessa image is the Shroud of Turin. I heard Joe Nickell address this but he kinda brushed off by referring to forgers confession and carbon dating (which is an accurate date). I was hoping for a more savage debunking of that claim. As far as I can see the Image of Edessa was only a face image. Then I go read Dan Porter and he’s saying thats absolute proof the Shroud was in Constantinople in the 8th century and Edessa in 5th century. Like usual, skeptical shroud material is always in short supply. Any thoughts on this one?.","date":"2017-04-20","mins":"2:56 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/04/07/sturp-space-age-technology-unleashing-religious-propaganda/","cat":"turin_shroud","title":"STURP: Space-age Technology Unleashing Religious Propaganda!"},{"id":"comment-8946","author":"matt","post":"No, as for the King Agbar stuff having a full body image of Jesus. Even if it is, how do they know it’s the same one. Also it’s a little sketchy that some hidden document in the Vatican library etc says blah blah blah. I laughed when I heard Porter say the c14 was “a bust” because he wouldn’t have said that if it was dated to 1st century. He just assumes Ray Rogers was right based on his vanillin “dating” with those samples they illegally gave him. Funny how these repairers didn’t reweave the burn marks but just this small area that happened to be picked for dating. Lastly, why didn’t they just do another carbon date on a place where they can all agree was original to the shroud? Repeat experiments are done all the time. Anyways thanks for your input. It just baffles me that in the age of reason, you have to dig so deep in order to find skepticism material on this stuff..","date":"2017-04-20","mins":"3:20 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/04/07/sturp-space-age-technology-unleashing-religious-propaganda/","cat":"turin_shroud","title":"STURP: Space-age Technology Unleashing Religious Propaganda!"},{"id":"comment-8938","author":"matt","post":"Apparently this is the sermon Ian Wilson cites, Introduction # 1 A sermon by Gregory the Archdeacon and Referendarius of the great church at Constantinople, about how incredible things are not subject to the laws of praise, and about how three patriarchs have declared that there is an image of Christ which was brought from Edessa 919 years afterwards by the zeal of a pious emperor, in the year 6452 (944 AD). Lord bless us. . . . . . . .But Jesus, undergoing the passion of his own free will, believing that human nature fears death – indeed death comes upon the very nature that was made to live – taking this linen cloth he wiped the sweat that was falling down his face like drops of blood in his agony. And miraculously, just as he made everything from nothing in his divine strength, he imprinted the reflection of his form on the linen. . . . # 21 He will do this straight away for us if we so desire, if we look upon the reflection and the immense beauty it is depicted with. For this is not the art of painting, which provides a door for the mind to consider the original and depicts images. This reflection was imprinted from a living original. Painting establishes a complete form with various beautiful colours, representing the cheeks with a blooming red, the encircling of the lips with red, it paints the beard with flowery gold, the eyebrow with shining black, the whole eye in beautiful colours, the ears and nose in a different way, overshadowing the flanks of the imprint with a compound of qualities and showing the chin with hair. #22 This reflection, however – let everyone be inspired with the explanation – has been imprinted only by the sweat from the face of the originator of life, falling like drops of blood, and by the finger of God. For these are the beauties that have made up the true imprint of Christ, since after the drops fell, it was embellished by drops from his own side. Both are highly instructive – blood and water there, here sweat and image. Oh equality of happenings, since both have their origin in the same person. The source of living water can be seen and it gives us water, showing us that the origin of the image made by sweat is in fact of the same nature as the origin of that which makes the liquid flow from the side. …. I then went to Dan Porters FAQ and I found a mix of bullshit and believable info. I thought his arguments for a bad C14 dating to be unconvincing and with his bilirubin mantra and the claim that the image is above the blood stains along with the dubious claim that Ray Rogers had discovered an invisible reweaving (lol). It just seems from someone, like me who is still learning, that Dan has it all figured out. Speaking from experience, I’ve found that people who I initially thought debunked me weren’t all that “figured out” as I thought. Is he bullshitting me? Forgive me for going on, its just I never heard of that Image of edessa and the sermon before and like I mentioned before, theres a lack of skeptical material on the net for this stuff..","date":"2017-04-20","mins":"5:55 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/04/07/sturp-space-age-technology-unleashing-religious-propaganda/","cat":"turin_shroud","title":"STURP: Space-age Technology Unleashing Religious Propaganda!"},{"id":"comment-8947","author":"matt","post":"Also about the “snap crackle and pop”, I’m curious to why he says, “There is no need to appeal to miracles to explain the images. And claims that the Shroud is somehow evidence of a miracle, even specifically the Resurrection, is problematic.” although I agree given the many problems with the shroud, it just seems like he’s talking out of both sides..","date":"2017-04-20","mins":"3:26 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/04/07/sturp-space-age-technology-unleashing-religious-propaganda/","cat":"turin_shroud","title":"STURP: Space-age Technology Unleashing Religious Propaganda!"},{"id":"comment-14764","author":"matt","post":"I am a Catholic and don’t believe in a physical bodily resurrection. I believe in the resurrection of the “Spiritual body”.","date":"2012-08-11","mins":"6:57 am","url":"https://shroudstory.com/2012/08/11/yannick-clments-summa-theologica/","cat":"news_&_views","title":"Yannick Clément’s Summa Theologica"}]
