[{"id":"comment-174467","author":"dan","post":"Reblogged this on Best of Shroud Story..","date":"2014-12-03","mins":"9:38 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-127688","author":"dan","post":"Pam emailed me to clarify. First she wrote: “Just to say that I applied to Oxford University (under the UK Freedom of Information Act 2007) to supply the photographs and data surrounding the 1988 tests. “Professor Ramsey has put most of it online. (one of the samples is missing but the Shroud data is there). I wrote to her and asked her to explain what she meant when she said a sample was missing. Her next email to me stated: “If you look at the whole sample of three of the tested cloths p2574 5; p2576 5 and p2575 8 you can see the first three samples. But the last one (I suspect it is Louis’ cloak) is missing. “I’m fairly sure the Shroud is p2575 – the only herringbone weave and it looks like other related images we’ve seen of nearby samples. But on Monday I will go back to the compliance officer and question it.”.","date":"2014-06-08","mins":"12:14 am","url":"https://shroudstory.com/2014/06/07/1988-pictures-and-details-from-oxford/","cat":"carbon_14_dating","title":"1988 Pictures and Details from Oxford"},{"id":"comment-47984","author":"dan","post":"The insult is uncalled for..","date":"2013-10-19","mins":"3:55 am","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-159198","author":"dan","post":"Thanks..","date":"2014-10-04","mins":"7:00 am","url":"https://shroudstory.com/2014/10/04/an-abstract-for-today/","cat":"carbon_14_dating","title":"An Abstract for Today"},{"id":"comment-159181","author":"dan","post":"Why is that?.","date":"2014-10-04","mins":"5:50 am","url":"https://shroudstory.com/2014/10/04/an-abstract-for-today/","cat":"carbon_14_dating","title":"An Abstract for Today"},{"id":"comment-159214","author":"dan","post":"Thanks..","date":"2014-10-04","mins":"8:35 am","url":"https://shroudstory.com/2014/10/04/an-abstract-for-today/","cat":"carbon_14_dating","title":"An Abstract for Today"},{"id":"comment-151414","author":"dan","post":"Sorry about the missing link to the TV interview. It is http://www.ksdk.com/story/news/local/2014/09/15/stl hosts shroud of turin conference/15690671/.","date":"2014-09-16","mins":"6:32 am","url":"https://shroudstory.com/2014/09/16/and-interview-with-lind-and-antonacci/","cat":"carbon_14_dating","title":"An Interview with Lind and Antonacci"},{"id":"comment-31326","author":"dan","post":"Nick, would you please direct me to some non shroud related scientific literature on this: the creation of these isotopes and the technology for measuring. The petition, as written, seems too vague. I’d like to be able to reference this material and get blog discussions going. At the moment I think that signing is premature..","date":"2013-04-19","mins":"4:34 pm","url":"https://shroudstory.com/2013/04/18/antonacci-proposing-molecular-and-sub-atomic-testing-to-resolve-disputes-regarding-the-shroud/","cat":"carbon_14_dating","title":"Antonacci Proposing Molecular and Sub-Atomic Testing To Resolve Disputes Regarding the Shroud"},{"id":"comment-31432","author":"dan","post":"Fair enough. Send me links and other material. I’ll get a conversation going and maybe generate some interest..","date":"2013-04-20","mins":"5:20 pm","url":"https://shroudstory.com/2013/04/18/antonacci-proposing-molecular-and-sub-atomic-testing-to-resolve-disputes-regarding-the-shroud/","cat":"carbon_14_dating","title":"Antonacci Proposing Molecular and Sub-Atomic Testing To Resolve Disputes Regarding the Shroud"},{"id":"comment-84765","author":"dan","post":"Yannick, Mike M is completely right. You have made significant contributions in this blog and to the advancement of our knowledge about the shroud. Don’t ruin it..","date":"2014-03-04","mins":"5:58 am","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","title":"As long as these results are not refuted . . . [they] have scientific validity?"},{"id":"comment-84772","author":"dan","post":"I must now moderate your all your comments..","date":"2014-03-04","mins":"6:16 am","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","title":"As long as these results are not refuted . . . [they] have scientific validity?"},{"id":"comment-78643","author":"dan","post":"Would this be it, John? It is still in your blog. You seem to have dropped an l in html. That’s all. Http://johnklotz.blogspot.com/2012/08/michael redux quantum mechanics.html.","date":"2014-02-12","mins":"8:50 am","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"id":"comment-73963","author":"dan","post":"Hugh wrote,“Benford and Marino’s ﬁrst approach was to use some almost neglected results from the 1978 STURP investigation, namely the so called ‘quad mosaic images…” Hugh then added, “The next attempt to recognise invisible weaving was to try to observe it on close up photos.” I think this is completely backwards. I believe that Sue Benford and Joe Marino started out with the close up photos. That was pretty much all that was being used as evidence when Ray Rogers was involved. I don’t think Sue and Joe paid any attention to the quad mosaics, at least in writing or in presentations, before their article in Chemistry Today in 2008. Maybe Joe can confirm this. Am I right? I think you have it wrong, Hugh. I’m a bit troubled when Hugh writes of the close up photos, “These were of rather poor quality at the time, but nevertheless evinced remarkably conﬁdent conﬁrmations of its presence from several expert tailors.” Tailors? Textile experts? Is Hugh looking at the same pixel density photos that Sue and Joe were using? Or was he looking or at web based quality image files (72dpi)? How does he know that these are remarkably confident confirmations? Did he consult textile experts? Is this personal judgment? I’d like to know a little bit more in this area. On occasion, Hugh has made it clear that he sits on a fence when it comes to authenticity. It’s a percentage thing, this way or that way. I’m sympathetic to this. I get it. But then I read this article in BSTS and I think that but for an adjective here and another one there — or by the turn of a phrase like remarkably confident — and this article, itself, sits on the fence. I could pencil it up and pretty much say how confident I am in Sue and Joe’s work. I was. I remain so. Iconoclastic? Maybe. I’ve been there. I’m there now and then. Some backwards history? Been there, too. Cat among the pigeons ? I guess it depends:.","date":"2014-01-21","mins":"1:51 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-10950","author":"dan","post":"John and Russ, you are probably right. Nonetheless, I support the idea. The point is that we have nothing to fear in any such testing. And I would love to see new results from testing done right..","date":"2012-04-29","mins":"9:26 am","url":"https://shroudstory.com/2012/04/29/carbon-dating-the-shroud-of-turin-again/","cat":"carbon_14_dating","title":"Carbon Dating the Shroud of Turin Again?"},{"id":"comment-74201","author":"dan","post":"No and no..","date":"2014-01-23","mins":"3:12 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-51380","author":"dan","post":"It was held algorithmically. I don’t know why..","date":"2013-11-14","mins":"9:19 pm","url":"https://shroudstory.com/2013/11/14/colin-berry-is-writing-to-the-vatican/","cat":"carbon_14_dating","title":"Colin Berry is Writing to the Vatican"},{"id":"comment-37591","author":"dan","post":"Says who? You, Colin? Chris’ comments are most appropriate..","date":"2013-06-21","mins":"9:18 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-87404","author":"dan","post":"Hi Stephen. That last paragraph is close to being an allegation of intellectual dishonesty. To suggest that Hugh is anti authenticity seems to be a similar charge. I think he and I are both pro truth even as we disagree in our beliefs about authenticity for now. Let’s all of us try to not make this so personal..","date":"2014-03-11","mins":"1:33 pm","url":"https://shroudstory.com/2014/03/09/comment-promoted-on-the-hacking-hypothesis/","cat":"carbon_14_dating","title":"Comment Promoted:  On the Hacking Hypothesis"},{"id":"comment-37578","author":"dan","post":"A response to Paulette: Unable to criticize Ray Rogers’ finding scientifically, Colin Berry resorts to trying to plant unfounded suspicions. Colin, who repeatedly accuses others of ad hominem attacks and the use of pseudoscience, himself, epitomizes these very unprofessional behaviors. He may know chemistry, even know some aspects of it very well, may have a Ph D and years of employment experience, but it takes more to be a good scientist and a real researcher, at least to my way of thinking. I thought this needed to be noticed by others and I felt that Colin’s own words demonstrated this better than anything I could say..","date":"2013-06-21","mins":"7:45 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-126183","author":"dan","post":"Max, you are going a bit too far..","date":"2014-06-01","mins":"9:15 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-31207","author":"dan","post":"Actually, there is an interesting idea being presented here that you get to when you get past the prefatory bull. This is where the press release should have started and ended. “New technology could demonstrate or refute that this event occurred! Neutron radiation not only creates new C 14 atoms, but also creates Cl 36 and Ca 41 atoms which virtually do not exist in nature. If such an event occurred, these rarest of atoms would still be present within the molecular structures of the linen, blood, or other irradiated material. The presence of these atoms, well above their infinitesimal natural levels, could only result from neutron radiation, which could not be generated by humans until the 20th century. “Interestingly, all three atoms (C 14, Cl 36 and Ca 41) are created by neutron radiation at rates that are known to scientists. Thus the amount of neutron radiation received by the Shroud, and the date this miraculous event occurred, can be calculated by scientists with the same accuracy as C 14 or radiocarbon dating. These tests could even be conducted on the original limestone walls of Jesus’ reputed burial tomb(s).” Of course, that is assuming that the Resurrection is a neutron radiation event..","date":"2013-04-18","mins":"4:11 pm","url":"https://shroudstory.com/2013/04/18/antonacci-proposing-molecular-and-sub-atomic-testing-to-resolve-disputes-regarding-the-shroud/","cat":"carbon_14_dating","title":"Antonacci Proposing Molecular and Sub-Atomic Testing To Resolve Disputes Regarding the Shroud"},{"id":"comment-122236","author":"dan","post":"Max..","date":"2014-05-20","mins":"5:02 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"},{"id":"comment-122238","author":"dan","post":"Max, you have been warmed. Do not reply to this..","date":"2014-05-20","mins":"5:05 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"},{"id":"comment-99647","author":"dan","post":"Yeah, maybe. But the cheap shot wasn’t directed at Catholics. It was, in this case, because a Roman Catholic priest (formerly Episcopalian) was begging for money online, having difficulty supporting his family. It was a Catholic archbishop who was living in a lavish house. It happens in every tradition. The rector of Trinity Wall Street Episcopal Church lives in an in town Manhattan mansion that is even bigger and more expensive. The church paid for it. It was Catholics who finally shamed the archbishop into selling his Atlanta home. Good for them. Pope Francis has set the tone and that is why not only Catholics love him but so does everyone. Here is an RNS story as it appeared in the Washington Post: VATICAN CITY — Days after Pope Francis summoned a controversial German bishop for talks on his luxurious lifestyle, the Vatican is facing an embarrassing new scandal about the lavish spending of Atlanta Archbishop Wilton Gregory. Gregory on Monday (March 31) apologized for a lapse in judgment after he built a plush $2.2 million mansion for himself in the heart of Atlanta’s upscale Buckhead district. His extravagant investment has provoked an outcry from some local Catholics, forcing the 66 year old archbishop to “apologize sincerely and from my heart” in a statement published in The Georgia Bulletin, a Catholic newspaper. “I personally failed to project the cost in terms of my own integrity and pastoral credibility with the people of God of north and central Georgia,” the archbishop said. “I failed to consider the impact on the families throughout the archdiocese who, though struggling to pay their mortgages, utilities, tuition and other bills, faithfully respond year after year to my pleas to assist with funding our ministries and services.” The pope himself rejected the Vatican’s ornate papal apartments for more simple lodging in the Santa Marta residence behind St. Peter’s Basilica and chose a humble Ford Focus for his official vehicle. Construction of Gregory’s new 6,000 square foot home was funded by money left by parishioner Joseph Mitchell, nephew of “Gone With the Wind” author Margaret Mitchell, when he died in 2011. Mitchell left $15 million and his home to his local parish and the archdiocese and asked that his endowment be used for charity. Gregory said he had received many “heartfelt, genuine and candidly rebuking” telephone calls, letters and emails for what he had done and published one atop his apology: “We are disturbed and disappointed to see our church leaders not setting the example of a simple life as Pope Francis calls for,” read the anonymous complaint. The archbishop’s personal apology came as he appeals on his own archdiocese website for donations to the church’s 2014 annual appeal beneath the headline, “You shall love your neighbor as yourself.”.","date":"2014-04-15","mins":"3:35 pm","url":"https://shroudstory.com/2014/04/11/funny-that-when-it-comes-to-the-shroud-of-turin-the-carbon-testing-must-be-considered-watertight-scientific-proof/","cat":"carbon_14_dating","title":"Funny that when it comes to the Shroud of Turin the carbon testing must be considered watertight scientific proof."},{"id":"comment-95636","author":"dan","post":"I’m sorry, Stephen, but some time ago I explained some ground rules about questioning someone’s intellectual honesty in this blog without solid evidence. The above comment, as you wrote it, was unacceptable for that reason. Someone’s possible attitude and speculation, therefore, that he may have told someone else something privately is not evidence. I have removed the name and much of the content..","date":"2014-04-01","mins":"7:50 pm","url":"https://shroudstory.com/2014/04/01/developing-a-hacking-theory/","cat":"hacking","title":"Developing a Hacking Theory"},{"id":"comment-214964","author":"dan","post":"Maybe Ox Cal has been hacked. I know, for instance, that my bathroom scale has been hacked..","date":"2015-11-22","mins":"7:52 am","url":"https://shroudstory.com/2015/11/21/computer-hacking-theory-for-carbon-dating-continues/","cat":"uncategorized","title":"Computer Hacking Theory for Carbon Dating Continues"},{"id":"comment-28593","author":"dan","post":"I have just heard this from Giulio Fanti. More to come shortly. Stay tuned..","date":"2013-03-28","mins":"8:00 am","url":"https://shroudstory.com/2013/03/28/common-sense-for-today/","cat":"carbon_14_dating","title":"Common Sense for Today"},{"id":"comment-95822","author":"dan","post":"Well said..","date":"2014-04-02","mins":"7:46 am","url":"https://shroudstory.com/2014/04/01/developing-a-hacking-theory/","cat":"hacking","title":"Developing a Hacking Theory"},{"id":"comment-204844","author":"dan","post":"The Rational Wiki weighs in: A conspiracy theory originally meant the “theory” that an event or phenomenon was the result of conspiracy between interested parties; however, from the mid 1960s onward, it is often used to denote ridiculous, misconceived, paranoid, unfounded, outlandish or irrational theories..","date":"2015-07-07","mins":"8:38 am","url":"https://shroudstory.com/2015/07/07/the-hacking-of-the-carbon-dating-wikipedia-and-the-media/","cat":"conspiracy_theory","title":"The Hacking of the Carbon Dating, Wikipedia and the Media"},{"id":"comment-216103","author":"dan","post":"You simply don’t know what you are talking about. I was out and about when the posting arrived on my cell phone; someone calling himself shroudie1 made a constructive comment. I approved it. It turns out that it was Joe Marino accidentally using a moniker that he uses for other purposes. He also posted the exact same message under his real names when he saw the mistake he made, thinking that that had fixed it. He didn’t see what I was doing and I didn’t see what he was doing. As soon as he saw the problem, sometime later, he emailed me asking me to fix it. I did so. As for calling himself shroudie1. So what? You went about calling yourself sciencebod. So what? And if it had been sciencebod1 would anyone have objected? No, of course not. I have a neighbor with a vanity licence plate that reads VIETVET1. So what? Colin, you are so busy half the time looking for what is wrong in other people that you go about imaging things that just aren’t true. BTW: There is another person using the nickname Joe. It is not Joe Marino, who to my way of thinking is and should be voted shroudie1. He deserves it..","date":"2015-12-10","mins":"4:03 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-216105","author":"dan","post":"To Joe Marino: I agree except that if the term shroudie1 is an honor, you deserve it in my book..","date":"2015-12-10","mins":"4:06 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-76379","author":"dan","post":"Thibault appears to be correct and I have the wrong photo. I used the photo from the Reuters article, assuming that this news agency was correct. Here is the caption from the Reuters: “The tunic of Saint Francis of Assisi is seen during a exhibition in Gubbio in this September 30, 2006 file photo. Carbon dating has cast doubt on the authenticity of one of four robes kept by Italian churches as relics of the medieval Saint Francis of Assisi, though another tunic, a belt and a cushion were found to be the right vintage. REUTERS/Daniele La Monaca.” I am removing the image from the blog posting..","date":"2014-02-04","mins":"3:53 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-206310","author":"dan","post":"Nothing. It is just interesting..","date":"2015-07-22","mins":"5:27 am","url":"https://shroudstory.com/2015/07/22/interesting-article-on-radiocarbon-dating/","cat":"carbon_14_dating","title":"Interesting Article on Radiocarbon Dating"},{"id":"comment-76195","author":"dan","post":"Noted..","date":"2014-02-03","mins":"11:09 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-76715","author":"dan","post":"Colin wrote above: ” Methinks the lady should stick to her textiles, and leave the interpretation of ancient manuscripts. . .” Colin, listen to yourself. You go about acting like a polymath: an expert on ancient medals, Templar history and all manner of things and people while criticizing Flury Lemberg for stepping out of what you have defined as her boundaries when it comes to expertise. It is getting old, this act of yours of being the junkyard dog of shroud research. It is tiresome. Two years ago you arrived on the scene and with no foundation in shroud science you started criticizing the work of fellow scientists like Al Adler, and Paolo Di Lazzaro by calling their work “Mickey Mouse science.” You called the folks at ENEA “idiots” and a “bunch of jokers.” Lately you have been telling us all about Rogers. Those who knew him know that you have no idea what you are talking about. Kim Johnson of the New Mexicans for Science and Reason wrote the following as part of an obituary for Rogers who was also a member of this skeptical society. “He was a Fellow at Los Alamos National Laboratory, and tried to be an excellent, open minded scientist in all things. In particular, he had no pony in the ‘Shroud of Turin’ horserace, but was terribly interested in making sure that neither proponents nor skeptics let their scientific judgment be clouded by their preconceptions. He just wanted to date and analyze the thing. He died on March 8th from cancer. He was a good man, and tried his best to do honest science.” I read hundreds of emails by Rogers. I read his papers. He didn’t go about blasting other people. He didn’t need to. Methinks Colin, the “sciencebod” as he calls himself, should stick to his field of chemistry, and leave the interpretation of ancient history (medals and the Hungarian Pray Codex) and the evaluation of other people’s performance and expertize to those who know what they are talking about. Two years ago, when you started commenting in this blog, I had hoped for a helpful skeptic who was a good chemist. You have been that and you have made a valuable contribution. And actually, and I hate to admit it, your speculation about medals and the Pray Manuscript are fine and helpful, as well. We need to think more about these things. But these endless put downs of others. One wonders why..","date":"2014-02-05","mins":"8:03 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-48507","author":"dan","post":"That reminds me of something I read a few years ago. It was written by a B17 bombardier during WWII. I’ll need to paraphrase: Those planes had the best bombsights science could devise. According to the manual they would let us hit the target ninety percent of the time. But, in reality, we could only draw circles around the target. The average of all the craters was where the target was some ninety percent of the time, maybe. But we hit the actual target zero percent of the time. So we modified them..","date":"2013-10-23","mins":"7:38 am","url":"https://shroudstory.com/2013/10/23/jones-none-of-the-three-laboratories-dated-its-sample-to-between-1260-and-1390/","cat":"carbon_14_dating","title":"Jones:  “none of the three laboratories dated its sample to between 1260 and 1390”"},{"id":"comment-3100","author":"dan","post":"I look forward to the discussion..","date":"2011-05-09","mins":"3:07 pm","url":"https://shroudstory.com/2011/05/09/kyle-c-hill-and-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Kyle C. Hill and the Shroud of Turin"},{"id":"comment-95791","author":"dan","post":"Stephen, I draw a line here. Yes, the man is deceased, but he probably has family. It is a serious matter to infer that he was a hacker in the sense of cheating while doing science, particularly when you are also suggesting that the KGB was behind the hacking. If you had evidence it would be a different matter. But you don’t. You have an assumption about bias and a bit of flakey conspiracy theory like speculation; that’s all that I can see. I’ll continue to point to your blog. That is what I do. That may even seem hypocritical on my part; in fact it may be. Regardless, I can’t condone what you are doing so you can’t do it here. Other than that, your comments are always welcome..","date":"2014-04-02","mins":"5:13 am","url":"https://shroudstory.com/2014/04/01/developing-a-hacking-theory/","cat":"hacking","title":"Developing a Hacking Theory"},{"id":"comment-48627","author":"dan","post":"Thanks, daveb, what a great resource. It is going to.keep me busy this weekend..","date":"2013-10-24","mins":"4:54 pm","url":"https://shroudstory.com/2013/10/24/meanwhile-part-2-works-for-me/","cat":"carbon_14_dating","title":"Meanwhile, Part 2:  “Works for Me”"},{"id":"comment-48591","author":"dan","post":"The more I read what Colin has to say, the more I’m sure the shroud is real..","date":"2013-10-24","mins":"7:01 am","url":"https://shroudstory.com/2013/10/24/meanwhile-part-2-works-for-me/","cat":"carbon_14_dating","title":"Meanwhile, Part 2:  “Works for Me”"},{"id":"comment-227","author":"dan","post":"What French scientist? I know Joe Nickell, an American, spent some time attempting to duplicate the 3 D effect. He didn’t do a totally bad job. But he copied from the shroud and did not start with real body or even a statue, which isn’t all that difficult. What he was not able to do was reproduce the detail or get the saturation details correct. Was Jesus washed. Keep in mind, if you are going to rely on custom, that the burial may not have been complete if indeed Passover was about to begin. And by the way, there are forensic experts such as Fred Zugibe, the head of forensics for Rockland County, NY, who argue that the body indeed might have been washed. Dead bodies, undisturbed, normally don’t bleed. But slight movement can cause blood to flow out of a body. It isn’t cut and dry. Would they have left the thorn crown in there. Most shroud researchers see no evidence of this. This hypothesis comes mainly from Alan Whanger. But, yes, they might have left it in there, probably would have. Blood shed in death was considered near sacred and items of clothing and anything else with the blood on it would probably have been buried. Your theories about the Gospels have merit and are recognizedd by many scholars. I tend to agree with much of what you say. I don’t think however that John was copied from Mark. Matthew probaby was derived in large measure from Mark or possibly Q, a hypothetical earlier lost source. Luke was also probably sourced from Mark or even Matthew. I agree that we cannot confirm the authors. Luke seems to be the real Mc Coy and Matthew and Mark may be attributions to oral traditions ascribed to them. John may have been John of Patmos or the “beloved disciple” who may or may not have been John. As for one or more of the authors trying to explain the destruction of the Temple, I think the idea has merit. But I think it is a matter of degree and tone and not an attempt at pure allegory or metaphor. Actually, the fact you mention about lime pits is partly correct. There is no evidence of burning but, yes, crucifixion victims were thrown into shallow pit grave and lime was used to prevent disease. Many of the victims were left on their crosses (and poles in some cases) as carrion for birds and wild dogs. John Dominic Crossan, who until his retirement taught at St Paul University (Catholic) has made a great deal about this and suggested that Jesus may not have been buried. But the Gospels don’t speak about normal circumstances but a premitted exception. Archeological evidence has proven that at least one other individual (known not to be Jesus) was crucified and buried in a tomb with the spike still through his foot. You refer to the coincidental references to the Torah Scriptures (actually the references apply more broadly to Old Testament literature). Many scholars think that indeed those references were not merely coincidental but a literary device known as historizing prophesy. That is quite possible. It does not diminish their significance, in my opinion. Thanks for your comments..","date":"2008-12-15","mins":"1:09 pm","url":"https://shroudstory.com/2008/12/01/new-shroud-documentary-to-air-on-discovery-channel-in-december/","cat":"carbon_14_dating","title":"New Shroud Documentary To Air On Discovery Channel In December"},{"id":"comment-103207","author":"dan","post":"We now have a PDF file..","date":"2014-04-24","mins":"9:26 am","url":"https://shroudstory.com/2014/04/23/new-paper-the-missing-corners-and-the-radiocarbon-date/","cat":"carbon_14_dating","title":"New Paper: The Missing Corners and the Radiocarbon Date"},{"id":"comment-194721","author":"dan","post":"Hi Dave, would you care to share your website with us?.","date":"2015-03-28","mins":"3:17 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-50056","author":"dan","post":"I was thinking about the leech man’s day job steaming thyme near the shroud exhibit..","date":"2013-11-05","mins":"12:11 pm","url":"https://shroudstory.com/2013/11/05/overheard-behind-us-during-barries-talk-thats-only-listerine/","cat":"carbon_14_dating","title":"Overheard behind us during Barrie’s Talk: “That’s only Listerine”"},{"id":"comment-44813","author":"dan","post":"Dave, I took the abstract directly out of the back of the paper (copy and paste), which clearly is wrong. That should be μm (Mu) not m. However the main body of the paper seems to be right so I have replaced the abstract in this posting with the initial summary from the opening paragraphs of the paper. You can refer to the pdf to see the abstract as it was. Thanks for bring this to my attention..","date":"2013-09-20","mins":"5:09 am","url":"https://shroudstory.com/2013/09/20/paper-chase-giulio-fantis-new-flax-fiber-dating-machine/","cat":"carbon_14_dating","title":"Paper Chase:  Giulio Fanti’s New Flax Fiber Dating Machine"},{"id":"comment-48272","author":"dan","post":"Max & Colin, stop it..","date":"2013-10-21","mins":"1:04 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","title":"Quote for Today: Stephen Jones on journalists and their readers"},{"id":"comment-9499","author":"dan","post":"No, no, Colin. Saying it’s a British thing is the ad hom. I’m the guilty party. I mean, after all, what can you expect from a Brit? Oops there I go again. I’m just joking with you..","date":"2012-03-21","mins":"6:42 pm","url":"https://shroudstory.com/2012/03/21/sharon-hill-should-check-out-her-facts/","cat":"carbon_14_dating","title":"Sharon Hill should check out her facts"},{"id":"comment-9497","author":"dan","post":"I didn’t make those letters sound like anything exalted or otherwise. I think this must be a British thing, Sir Berry of Ad Hom. Dan Porter, Royal Fellow of Laughter (ROFLMAO).","date":"2012-03-21","mins":"5:59 pm","url":"https://shroudstory.com/2012/03/21/sharon-hill-should-check-out-her-facts/","cat":"carbon_14_dating","title":"Sharon Hill should check out her facts"},{"id":"comment-143702","author":"dan","post":"Reblogged this on Best of Shroud Story..","date":"2014-08-13","mins":"10:35 am","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-94888","author":"dan","post":"Hi Stephen. I’m sorry if you took offense to the twin comment. Frankly, I thought you would have found it amusing; my mistake. I don’t think the personal attacks are incessant, as you say. What we will certainly be discussing is your fraud theory as it unfolds in revised form. I don’t think it will be comfortable at all times. As for Romans 12:19, I guess I interpret that a bit differently. That’s okay, though, and the warning is noted. I’m not going to pre moderate every comment like you do. But do watch for an upcoming “Report Abuse” button on my site, maybe in April..","date":"2014-03-30","mins":"8:59 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","title":"Stephen Jones’ Revised Hacking Theory Part I is Available"},{"id":"comment-143688","author":"dan","post":"I agree..","date":"2014-08-13","mins":"8:41 am","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-95122","author":"dan","post":"No it is not a new policy. Nor is this particular moderation directed at you; it was not retaliation. I have blocked certain people in the past for various reason but never because of beliefs and ideas and never to retaliate. That is not the way I do things. The reason you received the message is because your posting contained more than three outbound links. There are other reasons for automatic comment moderation as well. One person keeps using certain profanities that I don’t want in this blog. Another has a tendency to be far too insulting to others. When a comment gets blocked I may approve it, edit it, or send it back for revision. Sometimes, algorithmically, a comment looks like spam even though it is not. I carry an i Phone with me at all times and it signals me every time a comment is awaiting moderation. It is three o’clock in the morning here as I clear your comment and write this to you. Even though we disagree, your comments are always welcome here. Everything said or written about the shroud should be subject to scrutiny. That includes what I say. Of course..","date":"2014-03-31","mins":"3:40 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","title":"Stephen Jones’ Revised Hacking Theory Part I is Available"},{"id":"comment-73061","author":"dan","post":"No..","date":"2014-01-11","mins":"1:14 pm","url":"https://shroudstory.com/2014/01/10/surely-youre-joking-mr-jones/","cat":"carbon_14_dating","title":"Surely You’re Joking, Mr. Jones"},{"id":"comment-50051","author":"dan","post":"You mean like parsley, sage, rosemary and thyme?.","date":"2013-11-05","mins":"11:50 am","url":"https://shroudstory.com/2013/11/05/overheard-behind-us-during-barries-talk-thats-only-listerine/","cat":"carbon_14_dating","title":"Overheard behind us during Barrie’s Talk: “That’s only Listerine”"},{"id":"comment-125540","author":"dan","post":"Let me ask the dumb questions. Are the odds against getting a 1325 +/ 65 date astronomical? Is there any way with math to show that he Stephen is right or wrong?.","date":"2014-05-29","mins":"2:42 pm","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","title":"The Challenge for Stephen Now"},{"id":"comment-125546","author":"dan","post":"Stephen is either right or wrong when he says, “it would be a miracle if the Shroud being first century `just happened’, by a combination of chance factors, like contamination and medieval repairs, etc, to have a radiocarbon date of 1325 +/ 65, only 25 30 years before the Shroud’s first appearance in undisputed history.” Or, are we thinking that there is no way to 1) know the odds, which is one thing, or there is no way to 2) know if Stephen is right, which is something altogether different. This could be the subject of the year..","date":"2014-05-29","mins":"3:00 pm","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","title":"The Challenge for Stephen Now"},{"id":"comment-453","author":"dan","post":"Actually, Rogers did obtain and verify using a thread from the the reserved sample. The point is missed: the anomolies in the region of the C14 sample are sufficient to impute reasonable doubt to the 1988 testing. They cannot any longer be called definative by any stretch of the imagination. They draw attention to many red flags that were simply ignored in 1988 and when the paper was written in 1989. I quoted Brown correctly. One does not judge Villarreal by the audience. How ad hominem is that? (Not that everyone at the conference sided with Rogers, which you presume. There were those who still hope that John Jackson is correct). Ramsey’s point is that more studies are need. Indeed they are. Given the blue mosaic photographs that showed some evidence of chemical anomolies. Given that Giovanni Riggi, the person who actually cut the carbon 14 sample from the Shroud stated, “I was authorized to cut ap proximately 8 square centimetres of cloth from the Shroud…This was then reduced to about 7 cm because fibres of other origins had become mixed up with the original fabric …” Given that Giorgio Tessiore, who documented the sampling, wrote: “…1 cm of the new sample had to be discarded because of the pres ence of different color threads.” Given that Teddy Hall, then head of the Oxford radiocarbon dating laboratory, had noticed fibers that looked out of place. Given that a laboratory in Derbyshire concluded that the rogue fibers were cotton of “a fine, dark yellow strand.” Derbyshire’s Peter South wrote: “It may have been used for repairs at some time in the past…” Given that Gilbert Raes, when later he examined some of the carbon 14 samples, noticed that cotton fibers were contained inside the threads, which could help to explain differences in fiber diameter. This may also explain why the carbon 14 samples apparently weighed much more than was as expected. Given that Alan Adler at Western Connecticut State University found large amounts of aluminum in yarn segments from the radiocarbon sample, up to 2%, by energy dispersive x ray analysis. Why aluminum? That was an important question because it is not found elsewhere on the Shroud. Given that the radiocarbon lab at the University of Arizona conducted eight tests. But there was a wide variance in the computed dates and so the team in Arizona combined results to produce four results thus eliminating the more outlying dates (reportedly they did so at the request of the British Museum, which was overseeing the tests). Given that, according to Remi Van Haelst the results failed to meet minimum statistical standards (chi squared tests). Why the wide variance in the dates? Was it because of testing errors? Or was it because the sample was not suffi ciently homogeneous? The latter seems very likely now, and the statistical anomaly indicates something very suspicious about the samples. Given that Bryan Walsh, a statistician, examined Van Haelst’s analysis and further studied the measurements and concluded that the divided samples used in multiple tests contained different levels of the C14 isotope. The overall cut sample was non homogeneous and thus of questionable validity. Walsh found a significant relationship between the measured age of various sub samples and their distance from the edge of the cloth. Though Walsh did not suggest invisible reweaving, it is consistent with his findings. Given this, given Rogers’ findings, given Brown’s observations —– therefore we must be suspicious of the results, scientific methods not withstanding. As Rogers made it clear, the labs didn’t even try to investigate available data and problems. So much for scientific method and thoroughness. Of course I’m biased. I am annoyed that my initial skepticism about the shroud, based on what I thought was good science, was so founded on poor science. I still don’t know if the shroud is real but I know for sure that the 1988 tests cannot be trusted. So don’t lecture me about faith. Perhaps I was unfair to Ramsey in not providing the full context. Thank you for furnishing the link for others. But the fact is, and we can squabble about what direct means, he is in a bit of a bind if that is his take, is he not. Like Ball’s piece, mine is an opinion piece. The dating of the shroud is quite possibly the biggest mistake in carbon dating history. That picture is emerging. The way to address it is to reexamine the evidence..","date":"2009-05-06","mins":"2:52 pm","url":"https://shroudstory.com/2008/09/21/the-big-carbon-dated-mistake-shroud-of-turin-and-the-scientific-quest-for-god/","cat":"carbon_14_dating","title":"The Big Carbon Dated Mistake: Shroud of Turin and the Scientific Quest for God"},{"id":"comment-173833","author":"dan","post":"Hi Giorgio. Google reported your pages. I found out about them when I turned my phone on after landing in Savannah Airport last night and I got a tweet from Yahoo News before the plane even got to the gate. I did not put it out there. I can only imagine that Google found out about the pages because you notified them or you linked to the pages from other indexed pages. There is no way that I would have even known the UR Ls if they were not indexed in the search engines. Hundreds of email copies of this post went out after I made this posting. It’s been tweeted on Twitter. Facebook has it in full. Attempting to remove the post would only draw more attention to it, I’m afraid. I’m sorry; I post when I see things in public. Otherwise I ask for permission. Think about what you want to do and write to me offline if you want (danielrobertporter@gmail.com)..","date":"2014-11-30","mins":"11:42 am","url":"https://shroudstory.com/2014/11/30/the-raes-samples-that-rogers-used-had-been-switched/","cat":"carbon_14_dating","title":"The Raes samples that Rogers used had been switched?"},{"id":"comment-70540","author":"dan","post":"Fair enough, Andy, but I was thinking about technology, not the specifically bungled 1988 tests. While Fanti’s methods may be promising, the jury is still out on the accuracy of the method. Consider radiocarbon dating history going back to the days of Libby; how many refinements have been introduced and how much has experience with the technology given us a real sense of accuracy. Fanti is doing pioneering work. It may not be useful. We just can’t say “the technology employed in these new tests yields more accurate results than that used in 1988.” The operative word is technology..","date":"2013-12-31","mins":"10:39 am","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","title":"This may be the Shroud of Turin Story of the Year"},{"id":"comment-70864","author":"dan","post":"Around here, in this blog, we tend to argue with substance rather than with mere insults. You are welcome to join us in constructive conversations. We lose our cool now and then but usually after some back and forth with facts, observations and logical arguments..","date":"2014-01-01","mins":"1:30 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","title":"This may be the Shroud of Turin Story of the Year"},{"id":"comment-215055","author":"dan","post":"That is not correct. Max was not kicked out. Max is welcome to submit comments that I will look at first before they appear. Louis had nothing to do with this. This applies to three other individuals, as well. And contrary to comments elsewhere, CB has not been kicked out. He has gone silent. He has not commented here or posted to either of his own blogs since August. And just for the record, I object to the unsubstantiated accusation that Louis is promoting untruths about the shroud..","date":"2015-11-24","mins":"8:05 am","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-74073","author":"dan","post":"Oops. O.K. Had sent me this in an email: I would like also to add the link to the Joseph Uten’s article THE TITLE OF THE CROSS from Shroud Spectrum International #16 http://www.shroud.com/pdfs/ssi16part3.pdf This may be useful to the readers. Sorry. But there you go..","date":"2014-01-22","mins":"8:12 am","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","title":"Titulus Crucis:  A Fascinating Guest Posting by O.K."},{"id":"comment-215793","author":"dan","post":"Try now..","date":"2015-12-07","mins":"8:00 am","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-6541","author":"dan","post":"There is no slur here. I have always considered Prof. Ramsey open minded and have quoted him to that effect. But when the press states certain things, people react. I can ignore it or blog about it. If I don’t blog about it others, who I think are less committed to accuracy, will. It was not the shroud’s custodians who were being quoted; it was Prof Ramsey. I find the arguments against Benford/Marino/Rogers, given all the evidence, insufficient for a qualification of “unlikely.” David, I know we disagree and I doubt either one of us is about the change opinion. But my disagreement was not a slur. Dan Porter.","date":"2012-01-04","mins":"11:10 am","url":"https://shroudstory.com/2012/01/04/what-did-christopher-ramsey-know/","cat":"carbon_14_dating","title":"What did Christopher Ramsey Know"},{"id":"comment-6573","author":"dan","post":"Sciencebod, please first get the facts. The French Reweaving (a method known by that name, not artisans of a particular nationality — think French fries) was for a repair that was made before the fire. The repair was likely commissioned by Margaret of Austria, Hapsburg princess, Regent of the Netherlands, wife to Philibert II of Savoy and legal custodian of the shroud and the House of Savoy collection of tapestries. The repairs after the fire, which are crude patches, are unrelated to the reweaving. I do blame the labs, the British Museum and church authorities (not the Vatican actually but the Archdiocese of Turin and its Cardinal who was the official custodian for the shroud in 1987). The original protocol called for samples from multiple locations. Church authorities had agreed to this. When it was decided at the last minute to allow only one sample the labs should have walked away. Moreover, the labs didn’t consult with experts about the sampling site and they didn’t do a proper chemical characterization of the sample. I don’t know anyone who is trying to promulgate a first century date without adequate evidence. I happen to believe it, but I don’t know it. I would rather know the truth no matter what the result tells me. Right now, I can’t imagine that it is a medieval fake. As for the 1987 carbon dating, there is enough reasonable doubt to set it aside, to invalidate the results. As for the ENEA report, I have my reservations. It has nothing to do with this subject..","date":"2012-01-05","mins":"3:34 pm","url":"https://shroudstory.com/2012/01/05/tom-chivers-has-an-opportunity-to-do-some-real-investigative-journalism/","cat":"carbon_14_dating","title":"Tom Chivers has an opportunity to do some real investigative journalism"},{"id":"comment-70863","author":"dan","post":"Around here, in this blog, we tend to argue with substance rather than with mere insults. You are welcome to join us in constructive conversations. We lose our cool now and then but usually after some back and forth with facts, observations and logical arguments..","date":"2014-01-01","mins":"1:30 pm","url":"https://shroudstory.com/2014/01/01/for-sure-someone-is-lying-here-talk-about-chumming-the-comment-pool/","cat":"carbon_14_dating","title":"“For Sure Someone is Lying Here” — Talk About Chumming the Comment Pool"},{"id":"comment-70631","author":"dan","post":"She has been a rep for 18 years..","date":"2013-12-31","mins":"3:07 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","title":"This may be the Shroud of Turin Story of the Year"},{"id":"comment-88634","author":"dan","post":"Probably not, unless he comes up with something new..","date":"2014-03-14","mins":"6:04 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","title":"The Computer Hacker Hypothesis is Short on Factual Material"}]
