[{"id":"comment-209411","author":"dan","post":"I have emailed him and asked him for more information either by posting a comment or sending me additional details by email..","date":"2015-09-01","mins":"3:21 am","url":"https://shroudstory.com/2015/08/31/colin-berrys-and-my-3d-plotting-problems/","cat":"3d","title":"Colin Berry’s and My 3D Plotting Problems"},{"id":"comment-127603","author":"dan","post":"Colin, I don’t see the problem. I agree with you. You had an interesting post. I said that. I’ll say it again. You said, “I can say with confidence , based on the colour charts, flags etc, that 3 D enhancible images do not necessarily have encoded 3 D information.” That’s right. I agree. Everyone should read what you wrote. I don’t know what the right setting are. I don’t know how we evaluate what we have. Maybe I shouldn’t have used the wording “isn’t a legitimate plot.” Maybe something go lost in the trunk or the boot. We can, if we want, try to merely imitate a VP8. Or we can see if there is much more we can do regardless of agenda’s. Yes, spotting pseudoscience is an agenda. Maybe 3 D characteristics will prove to have been a mistaken idea. Or maybe it will prove to be more significant than we ever thought..","date":"2014-06-07","mins":"3:40 pm","url":"https://shroudstory.com/2014/06/07/colin-berry-is-up-with-an-interesting-posting-about-3d-enhancement/","cat":"3d","title":"Colin Berry is up with an interesting posting about 3D enhancement"},{"id":"comment-127574","author":"dan","post":"Hey Colin, I’m advertising your stuff. Smart people will read it. You made an extraordinarily good point when you wrote,”[W]hat are the ‘correct’ settings that gives a valid image?”, There is no dogma here. I’m the first to admit having reservations about the 3 D and what it means. Oh, the flags are cute..","date":"2014-06-07","mins":"1:37 pm","url":"https://shroudstory.com/2014/06/07/colin-berry-is-up-with-an-interesting-posting-about-3d-enhancement/","cat":"3d","title":"Colin Berry is up with an interesting posting about 3D enhancement"},{"id":"comment-175941","author":"dan","post":"I agree. Now what about Colin’s scorched images?.","date":"2014-12-12","mins":"1:54 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-176087","author":"dan","post":"But this may be a more accurate version of the painting:.","date":"2014-12-13","mins":"9:35 am","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-176593","author":"dan","post":"On a line with no other text simply copy and paste a complete link to an image. (e.g. Htt…….jpg). You won’t see the result until the comment is published..","date":"2014-12-15","mins":"2:48 am","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-175344","author":"dan","post":"Ray Rogers used a similar illustration. Put a drop of ink on a filter paper and then photograph to spreading out ink. There are no limits on the number of 3 D images you can create. The interesting thing is that you, Colin, created one of a human form by scorching linen cloth with a hot statue..","date":"2014-12-09","mins":"6:25 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-176606","author":"dan","post":"Best TV series ever made. My wife and I binge watched the whole thing..","date":"2014-12-15","mins":"4:09 am","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-175354","author":"dan","post":"I agree. And that I think would be very difficult if not impossible. My point is about the 3 D characteristics. I think they need to be more carefully described. I don’t want people believing the shroud is real based on incorrect information. For me, I just want to know what is correct..","date":"2014-12-09","mins":"6:56 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-127773","author":"dan","post":"Hugh, do you mean grayscale or a single shade of gray — at least in the sense used by Image J. Grayscale, they do not make clear, is basically the the “original image” converted to black and white. By using, grayscale (in this sense of the word) we still “overlay a supposed 3 D construction with an actual image,” only we have eliminated color. By using gray or any single color and shade (one RGB value) we get a solid isometric plot of the brightness and with the addition of artificial lighting and whatever viewing angle we choose, we see 3 D. The different shades are from highlights and shadows. Colin is writing some addenda and if you look at it — all though he calls it monochrome — you can see it is still just a 3 D enhancement, an overlay, so to speak — a black and white of the same thing. At some point we are all going to need to come to terms with terminology..","date":"2014-06-08","mins":"11:49 am","url":"https://shroudstory.com/2014/06/08/speaking-of-3d/","cat":"3d","title":"Speaking of 3D"},{"id":"comment-211320","author":"dan","post":"I’m looking forward to it..","date":"2015-09-27","mins":"5:09 am","url":"https://shroudstory.com/2015/09/26/the-vp8-cinderella-question/","cat":"3d","title":"The VP8 Cinderella Question"},{"id":"comment-212041","author":"dan","post":"Actually, it is a death mask used by Accetta to illustrate the point that a regular photograph can have the same 3 D properties as the shroud. Joe is very much among us..","date":"2015-10-08","mins":"8:49 am","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-99560","author":"dan","post":"On searching this blog, I found that in May of 2012, Thibault Heimburger wrote in a comment: Diimide was in fact used by Adler on colored fibers among 21 solvents employed in dye extraction tests. Only hydrazine (very slowly) and diimide (a strong powerful reducing agent) could bleach the yellow color of image fibers. This test only show that the color is not a dye and that the color is only at the surface of the fiber. Rogers wrote clearly :” Up until this time, we had assumed that the image color was a result of chemical changes IN the cellulose of the linen; The most likely change would involve the dehydration of the cellulose to produce conjugated double bonds system. Adler’s observations strongly suggested that the cellulose was not involved in image formation”. If the color is only in the pcw, you’ll find exactly the same result because the pcw is a thin surface layer. The cellulose is not involved. The fact that diimide leaves undamaged fibers behind shows only that it can not destroy or modify the strong cellulosic structure of the secondary cell wall. It is not surprising. But, because diimide is able to bleach the colored fibers, the chromophore carrier is likely a non cellulosic structure at the very surface of the fiber. No more no less. It is the same for all the other properties found by the STURP, Rogers etc..regarding the chemistry of the image. To my knowledge there is no known fact able to distinguish between the 2 possibilities. However the fact is that Rogers never wrote the world primary cell wall. Why ? Here we must remember that he was fascinated by the ( true ) fact that the image appears to be more dense in the dark bands than in the light bands. He thought that the bands seen on the Shroud could be explained if there were more impurities left after washing and bleaching in the dark bands than in the light bands. Therefore everything makes sense : dark bands = thick impurity layer = dense image. ALL the impurity layer hypothesis is based on this hypothesis. But the fact is that this hypothesis is very controversial. For example, many textile experts think that the bands can be explained by the heterogeneity of the density of the threads (something which is often observed in ancient fabrics). Dark bands = more threads = more fibers = more “pcw” = dense image and vice versa. In my opinion, Rogers did not even think about the pcw as a possible color carrier because he found very early a complete reliable hypothesis able to explain all the observed facts. This is human. But recently, on the basis of the description of the pcw by some experts, we found (in SSG) that all the known microscopic, macroscopic and chemical properties could be explained if the image were the result of some kind of dehydration oxydation of the hemicellulose found in the pcw. Both hypotheses are possible but the pcw hypothesis does not necessarily imply the complex process required to explain the impurity layer..","date":"2014-04-15","mins":"9:18 am","url":"https://shroudstory.com/2014/04/15/good-chemistry-questions/","cat":"science","title":"Good Chemistry Questions"},{"id":"comment-151198","author":"dan","post":"A reply from Yannick who is unable to post comments; Message from Yannick: “I note that many people, once again, I’ve not understood the heart of the message I wanted to deliver, which is that the important observations and analyses done by Rogers on his Shroud samples were good enough for him, a chemist expert in determining chemical damages on different types of material, to completely discard all the image formation hypotheses involving any form of energetic radiation and that’s include not only the corona discharge proposed by Fanti or De Liso, the burst of UV light proposed by Di Lazzaro or Jackson, the burst of protons and neutrons proposed by Rinaudo, but also the scorch hypothesis proposed by various skeptics over the years. That’s the main point. The second is this: Unlike what some people have understood, I’m not saying that the Maillard reaction hypothesis (in the form described by Rogers) is THE answer to the image formation, but what I’m fully convinced after years of readings about the Shroud and particularly, after reading with attention and no bias all the writings of Rogers, is this: 1 The image formation must have come from a mild chemical reaction happening at low temperature (and possibly at room temperature). 2 This image formation process must have involved a quantity of “energy” quite small and most probably related to the biological state of the Shroud man’s corpse (and probably also related to its traumatic state). 3 The image chromophore must be located inside a thin and UNEVEN (very important element) layer of carbohydrate impurities instead of being located Inside the structure of the fiber itself (note that this type of carbohydrate coating is, as Rogers said clearly, a type of chromophore much easier to color chemically than the fiber itself, whether we talk about the primary cell wall or the rest of the fiber). And finally, concerning the “P.S.” that you can find at the end of my guess post, I wanted to show people a clear proof that, unlike some other Shroud researchers (I don’t want to name no one), I’m able to change my mind on a particular topic associated with the Shroud if my reflection eventually leads me to a different conclusion than what I first thought. This concerns the fact that I gradually came to reject the image formation hypothesis described by Fazio and Mandaglio IN THE FORM THEY WROTE IT, while it leads me to propose a new hypothesis that has never been proposed before, which is that the discontinuous distribution of colored fibers in the image area can well have come from a combination of an image chromophore located only inside a thin and UNEVEN layer of carbohydrate impurities AND (in probably a lesser way) a stochastic process of image formation that involved a so small amount of “energy” that it wasn’t able to color every carbohydrate coated fibers it encountered. If I’m right, that means that out of 3 fibers that were hit by the weak energy (that could have been post mortem gases or something else probably related to the biological and traumatic state of the body), one could have been coated with a good amount of carbohydrate impurities and would have become yellowed through a still undermined chemical process, another one could have also been coated with a good amount of the same impurities but would have remained uncolored because the energy was so weak that it provoked a stochastic result of coloration and a third one could also have remained uncolored, not because of the weakness of the energy involved, but because this particular fiber would not have been coated with enough impurities to produce a visible yellowing on top of the fiber. THAT’S THE 3 MAIN MESSAGES I WANTED TO DELIVER WITH THIS GUESS POSTING OF MINE. Unlike what some people seem to believe, I never intended to “sell” Rogers’ image formation hypothesis (in the form he wrote it) to anyone…”.","date":"2014-09-15","mins":"1:02 pm","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level"},{"id":"comment-127974","author":"dan","post":"Russ, I had lunch with Ray Downing in Manhattan a few years ago. He brought with him a lenticular print of the face which he handed to me. “What’s wrong with it?” he asked. It was clear. The image resolution was wonderful and you could actually see the herringbone pattern on the face. On the face, curving around the cheeks, and so forth. It was clearly the overlay problem, what we encounter in Image J when using the Original Color option. We talked for a long time. I have not doubt that he extracted 3 D information from the image. But I don’t know how. Smoothing to reduce the effect of the weave, banding and all manner of noise including bloodstains? Was the brightness to distance relationship linear or curved? What assumptions were made about the cloth? To be considered evidentiary,his work must be documented enough to allow questions and criticism. Anyone with the necessary skills should be able to repeat his work precisely and get the same results. That knowledge, ideally, might lead to new thinking about how the images were formed. Did the cloth wrap a body. Probably! That is a reasonable conclusion. It is reasonable unless the image was faked. Colin Berry has proposed that the cloth wrapped a hot statue. He is a good chemist and he does not believe that his hypothesis has been proven unworkable. Many people would agree with that. And what artistic method have we not thought of? We have yet to here from Joseph Accetta yet. Maybe he is onto something. Frankly, I’m quite convinced that the cloth is not from the medieval era in Europe. But what about the early church era in parts of the Byzantine empire. Could there be some artistic method that we don’t know about? The best I can really say is it probably wrapped a body. I believe it did. Moreover I believe it wrapped the body of Jesus. Evidence suggests those beliefs. But beliefs are just that: beliefs..","date":"2014-06-09","mins":"10:03 am","url":"https://shroudstory.com/2014/06/08/speaking-of-3d/","cat":"3d","title":"Speaking of 3D"},{"id":"comment-99662","author":"dan","post":"I agree..","date":"2014-04-15","mins":"5:14 pm","url":"https://shroudstory.com/2014/04/15/good-chemistry-questions/","cat":"science","title":"Good Chemistry Questions"},{"id":"comment-206658","author":"dan","post":"I think it is the arch anti archers who really don’t see..","date":"2015-07-27","mins":"6:07 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","title":"1999 Interview with Isabel Piczek"},{"id":"comment-37296","author":"dan","post":"Max. Enough. We get it. Well no, not the other dimensions. But do take the insults down a notch..","date":"2013-06-18","mins":"7:24 am","url":"https://shroudstory.com/2013/06/03/a-completely-inappropriate-experiment-nice-white-lab-coats-anyway/","cat":"image_theory","title":"A completely inappropriate experiment. Nice white lab coats, anyway"},{"id":"comment-33042","author":"dan","post":"It will work both ways. I promise you that. It was just a matter of timing..","date":"2013-05-06","mins":"8:50 am","url":"https://shroudstory.com/2013/05/04/a-mysterious-work-of-art/","cat":"image_theory","title":"A mysterious work of art?"},{"id":"comment-16602","author":"dan","post":"Actually, David, my thoughts on this are a bit stronger than those of the letter writer. However, I’m not a big fan of the Maillard reaction hypothesis. My objection to the decisions made at Valencia had to do with the possible presence of an impurity layer on the fibers which, while necessary for a Maillard reaction, is not the same thing as a Maillard reaction. There seems to be no end to the confusion about this. What troubled me most about Valencia was the way a small handful of scientists tried to rule by small group consensus on a matter on which there was insufficient evidence and no broad scientific agreement. As for the Denis Mannix proposal, it cannot possibly begin to address the subject. Rogers spoke of a complex system. He wrote, in one instance, “I do not push a ‘diffusion model.’ I have presented a complex group of phenomena which, taken together, could produce something with the characteristics of the image.” It is detractors of the Maillard reaction who have dubbed it a mere diffusion model, Fanti in particular. Yet that is all that Denis’ proposal seems designed to test. It is pointless. I strongly recommend reading Yannick’s comments in the next posting, “Speaking of the the Mannix proposal to test the Maillard Reaction” at https://shroudstory.com/2012/09/20/speaking of the the mannix proposal to test the maillard reaction/ Dan.","date":"2012-09-20","mins":"3:32 pm","url":"https://shroudstory.com/2012/09/20/agenda-driven-shroud-science-what-a-pity/","cat":"image_theory","title":"Agenda Driven Shroud Science?  What a pity."},{"id":"comment-206181","author":"dan","post":"That first paragraph is an unwarranted attack on Fanti’s professionalism and integrity. Please avoid this type of criticism..","date":"2015-07-19","mins":"7:36 pm","url":"https://shroudstory.com/2015/07/16/a-reason-to-doubt-the-image-was-formed-by-radiation/","cat":"image_theory","title":"A Reason to Doubt the Image Was Formed By Radiation"},{"id":"comment-92620","author":"dan","post":"Colin, working with color photographs can be a problem. Film in the older photographs was sensitive to different colors in different ways and never captured all shades and saturation levels of color perfectly. Digitizing these photographs introduced new problems. Direct digital photography has many of the same problems. So does scanning, but less so. Moreover, needed contrast enhancement distorts colors. Displaying images on LCD displays introduces additional problems. Finally, our own eyes fool us. What appears to one person as two examples of the same color may appear to someone else as two different colors. You have implied that colors on the shroud are the same because they appear the same to your eyes, in second or third generations copies of photographs displayed on your computer screen. Writing, as you do, “What a weird and wonderful thing is this sindonology. Can anyone join? On second thoughts. I think I’ll stick with the science,” is snide, rude and arrogant in the extreme. You published in a public forum. We are criticizing your ideas in a public forum. That is how good science works. As Harry Truman put it, “If you can’t stand the heat, get out of the kitchen.” Can anyone join? Yes! You are welcome, here. We really want your input. Most of us are open to any solution for the enigmatic image so long as it is truly scientific. Make your case, scientifically, not by insulting us..","date":"2014-03-24","mins":"7:06 am","url":"https://shroudstory.com/2014/03/23/baked-in-creases-really/","cat":"image_theory","title":"Baked-In Creases. Really?"},{"id":"comment-147112","author":"dan","post":"Comment deleted by moderator. It was clearly intended as a personal insult..","date":"2014-08-29","mins":"10:18 am","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-146456","author":"dan","post":"The image on Colin;s site is at: Word Press seems to cache a copy in my space..","date":"2014-08-27","mins":"3:54 am","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-192358","author":"dan","post":"Some places to start: 1) [PDF]Speculations on the 14th Century Origins of the Turin Shroud by JS Accetta http://www.shroud.com/pdfs/stlaccettapaper.pdf alum or a combination of alum and tannic acid. There are many different techniques for this process and many are based on a percentage of dry fabric weight to … 2) [PDF]The Setting for the Radiocarbon Dating of the Shroud by E Marinelli https://www.shroud.com/pdfs/marinelliv.pdf Alum has been used as a common mordant for millennia. Furthermore, UV fluorescence photograph shows that the area of the radiocarbon sampling. 3) [PDF]An Alternate Hypothesis for the Image Color – The Shroud of … http://www.shroud.com/pdfs/rogers10.pdf Then Jumper, Adler, Jackson, Pellicori, ….. (a) Wet Ice (b) Wood (c) Glass (d) Paper (e) Clay (f) Copper Oxide (g) Aluminum Oxide (h) Aluminum Paint (i) Bismuth. 4) [PDF]Frequently Asked Questions (FA Qs) – The Shroud of Turin by RN Rogers https://www.shroud.com/pdfs/rogers5faqs.pdf aluminum found by Adler), and Madder. UV fluorescence photograph of the 14 C sample area. The small, white triangle (bottom left) is the location of the Raes. 5) [PDF]Perspectives for the Future Study of the Shroud http://www.shroud.com/pdfs/barberisv.pdf However, as Alan Adler always asserted, this experiment would … Rogers deduced the presence of madder (alizarin) or of its aluminum metal complexes since ….","date":"2015-03-04","mins":"5:07 am","url":"https://shroudstory.com/2015/03/03/checking-in-on-colin-berry-a-new-image-model-forming-in-my-mind/","cat":"image_theory","title":"Checking In On Colin Berry:  A New Image Model  ‘forming in my mind’"},{"id":"comment-20268","author":"dan","post":"I received the following email from Colin Berry. I decided to post it here in comments rather than make it into a full guest posting. It fits better here: Hello Dan It’s entirely your business as to whom you allow to make guest postings on your site, and MPH is no exception. However, given that this individual claims to be an expert in so many arcane disciplines, and is constantly questioning the right of others to question his judgements on the grounds that others lack his expertise, surely the time has come for MPH to be more specific about his own qualifications. “Former professor at the University of Riyadh (Kingdom of Saudi Arabia) Founder and director of LE CER Cle (Office for Studies and Research in Cryptology), Reze (France) Independent researcher in Late Antique and Medieval archaeoperceptive cryptology” A commentator last year on your site described the above as “unusual”. Yes, it is unusual, not least that “Archaeoperceptive cryptology”, which looks suspiciously like gobbledegook to this untutored mind. Might I suggest the time has come for MPH to provide a much fuller cv/resumé listing his degrees, from where obtained, a fuller description of his post at the University of Riyadh and previous academic appointments, and, most important of all, a comprehensive list of his publications in peer reviewed journals. Kind regards Colin Berry.","date":"2012-12-12","mins":"5:52 am","url":"https://shroudstory.com/2012/12/11/coins-on-eyes-issue-again/","cat":"image_theory","title":"Coins on Eyes Issue Again"},{"id":"comment-147055","author":"dan","post":"Looking at the cheek area (my right), I’m seeing thin “demarcation” lines that look like they might be rubbed in dirt where the herringbone shift takes place but that those lines may not be boundaries of the wider banding. We could have a lot of I think I see going on here..","date":"2014-08-29","mins":"6:14 am","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-208730","author":"dan","post":"Yes. But that doesn’t mean I will accept comments like the one I just redacted..","date":"2015-08-22","mins":"1:35 pm","url":"https://shroudstory.com/2015/08/21/close-to-the-finishing-line-or-the-starting-line/","cat":"image_theory","title":"Close to the finishing line or the starting line?"},{"id":"comment-206865","author":"dan","post":"This one did. I see don’t see anything pending approval. ..","date":"2015-07-29","mins":"10:21 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","title":"1999 Interview with Isabel Piczek"},{"id":"comment-191557","author":"dan","post":"Maybe I wasn’t clear, Charles. I wanted to know if you have you ever found an example of a medieval painted negative image, not a mirror image. And, of course, I don’t mean a painted copy of a negative image. I mean in the history of art, say, from Chauvet Pont d’Arc until today, can you think of a single painted negative image? Figurative painting, of course, but a bowl of fruit will do, or a running beast on the wall of a cave, or a man. Or are you saying it is a pity that no examples exist except for the shroud? If that is so, I’ll offer you a challenge. I’ll accept a proxy; find a living artist today who can paint a negative image of a man or a bowl of fruit. He must paint the man or the fruit, not copy a photographic negative..","date":"2015-02-22","mins":"10:11 am","url":"https://shroudstory.com/2015/02/21/colin-berry-stop-calling-the-faint-image-a-faint-image/","cat":"image_theory","title":"Colin Berry:  Stop Calling the Faint Image a Faint Image"},{"id":"comment-11186","author":"dan","post":"“When I have seen by Time’s fell hand defaced. The rich proud cost of outworn buried age;” William Shakespeare (Sonnet 64). There is no “consenus” on what he exactly meant except that fell means destructive, defacing, etc. He is almost certainly referring to engravings on grave stones and ravages of time on their clarity. That is the meaning I was implying, the loss of clarity from trying to arrive at consensus..","date":"2012-05-06","mins":"10:49 pm","url":"https://shroudstory.com/2012/05/05/colin-berry-and-luigi-garlaschelli-may-have-already-won-the-prize-with-different-solutions/","cat":"image_theory","title":"Colin Berry and Luigi Garlaschelli may have already won the prize with different solutions."},{"id":"comment-191553","author":"dan","post":"Actually, Google is not quite that smart. If your article had been published in The Onion or cited by Tractor Pull Competition Quarterly it would have had a much higher Google rating. Even so, History Today was a source of good Google ranking. BTW, have you ever found an example of a medieval painted negative image yet? I keep asking. A bowl of fruit will do fine..","date":"2015-02-22","mins":"8:40 am","url":"https://shroudstory.com/2015/02/21/colin-berry-stop-calling-the-faint-image-a-faint-image/","cat":"image_theory","title":"Colin Berry:  Stop Calling the Faint Image a Faint Image"},{"id":"comment-191565","author":"dan","post":"Charles, you say that the Quem Queritis ceremony gave them a reason to do a painting that showed the marks of a crucified body as if they had been transferred onto the grave cloth. So this is what we have, you say, as the wound on the left side shows. Let’s say I accept the motive. Let’s say I accept the method of reversing sides, too. And so they paint a mirror image. But that is not a negative image. In a negative image darker shades are lighter and lighter shades are darker. In dark rooms of old, negative images on the celluloid were left to right reversed, as well, but that is not what made them a negative. You do realize this difference? You do realize too that the shroud image, the one of the cloth, is a negative image? Why in the world would an artist, commissioned or not, paint a negative image? A mirror image, I understand. More significantly, how did he do it? I contend it is nearly impossible to paint a negative image. Charles, your theory depends on the idea that the shroud was like so many other paintings. I contend that no such painting has ever been done but would welcome one “black swan” from the whole of art history that proves me wrong..","date":"2015-02-22","mins":"11:31 am","url":"https://shroudstory.com/2015/02/21/colin-berry-stop-calling-the-faint-image-a-faint-image/","cat":"image_theory","title":"Colin Berry:  Stop Calling the Faint Image a Faint Image"},{"id":"comment-201690","author":"dan","post":"I think Paulette would have to say what she really meant. But since I said I somewhat agreed with her, let me say what I think she meant. Freeman missed the target completely. Not the bull’s, eye but the whole damn target. Country mile is a way of expressing that. That means every hypothesis misses the target completely, in her view. I, (and I’m talking about me, now), have not seen one proposal from Vignon to Jackson to Fanti to Berry to Freeman to Garlaschelli to Rogers or to anyone that I feel is the least bit viable. I could be wrong but I have not seen anything that impresses me. It is the old argument between two men as to whose wife is a little bit more pregnant. We are not playing horseshoes here. No one is pregnant. No one is even a little bit pregnant. No image hypothesis is even a little bit pregnant. No hypothesis is close enough to be closer to being right. Did I get it right, Paulette? If I did, I agree..","date":"2015-06-12","mins":"4:54 am","url":"https://shroudstory.com/2015/06/11/comment-promoted-charles-freeman-comes-closest/","cat":"image_theory","title":"Comment Promoted:  Charles Freeman Comes Closest"},{"id":"comment-91335","author":"dan","post":"I do wish I had used a question mark in the title. Your point is well taken..","date":"2014-03-20","mins":"8:14 pm","url":"https://shroudstory.com/2014/03/20/comment-promoted-another-hypothesis-about-the-image-formation/","cat":"image_theory","title":"Comment Promoted:  Another hypothesis about the image formation"},{"id":"comment-14824","author":"dan","post":"I don’t allow link only comments..","date":"2012-08-12","mins":"8:07 am","url":"https://shroudstory.com/2012/08/11/colin-berry-so-how-could-ray-rogers-have-got-it-so-wrong/","cat":"image_theory","title":"Colin Berry: So how could Ray Rogers have got it so wrong?"},{"id":"comment-147054","author":"dan","post":"Let’s stop with the name calling. No one around here is a troll..","date":"2014-08-29","mins":"5:55 am","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-208162","author":"dan","post":"And then there are potentially realistic bloodstain scenarios suggested by Crossan: “My best understanding is that the Shroud of Turin is a medieval relic forgery. I wonder whether it was done from a crucified dead body or from a crucified living body. That is the rather horrible question once you accept it as a forgery.” Yannick’s “proof” maybe allows for such a forgery..","date":"2015-08-13","mins":"10:29 am","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-207989","author":"dan","post":"I doubt that STURP required that everyone agreed on everything. Moreover, there is no way that you can know what anyone thought about from time to time unless you have obtained some specific information from them. I know you want to believe it. That’s fine. But because you believe it does not make it a fact..","date":"2015-08-11","mins":"3:16 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-207565","author":"dan","post":"I’m not defending Colin on this; just reporting. You are probably right if it is real. But if it is a man made pseudo relic then the creator of it may not be as smart as the two of us..","date":"2015-08-06","mins":"8:16 am","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-207702","author":"dan","post":"Yannick. If you want to rewrite your last two comments to eliminate the insults I might allow them. Capisce?.","date":"2015-08-07","mins":"5:00 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-34456","author":"dan","post":"Max, I still don’t have it as an email with attachments. You might want to double check the email address you are using..","date":"2013-05-23","mins":"9:25 am","url":"https://shroudstory.com/2013/05/12/dear-stephen-e-jones/","cat":"image_theory","title":"Dear Stephen E. Jones"},{"id":"comment-127016","author":"dan","post":"We discussed this on November 3, Maybe the 3 D data doesn’t mean what we think it does. Here is another thought. The intensity at each x,y point is also a measure of distance from a hypothetical plane that intersects the body. The problem with that is imagining a process that could create an image. But do we have anything more than imagination so far when we think of body to cloth distance? Maybe the reader will write back. Like you I’d like to know what the many reasons are..","date":"2014-06-05","mins":"8:06 am","url":"https://shroudstory.com/2014/06/05/everymans-vp8/","cat":"image_theory","title":"Everyman’s VP8"},{"id":"comment-34428","author":"dan","post":"Max, send it again. I don’t see it. Perhaps it landed in the spam folder but I don’t see it there either. Thanks. Dan.","date":"2013-05-23","mins":"6:40 am","url":"https://shroudstory.com/2013/05/12/dear-stephen-e-jones/","cat":"image_theory","title":"Dear Stephen E. Jones"},{"id":"comment-127086","author":"dan","post":"I don’t understand the question..","date":"2014-06-05","mins":"2:20 pm","url":"https://shroudstory.com/2014/06/05/everymans-vp8/","cat":"image_theory","title":"Everyman’s VP8"},{"id":"comment-127085","author":"dan","post":"How do you plot the shroud face without smoothing?.","date":"2014-06-05","mins":"2:19 pm","url":"https://shroudstory.com/2014/06/05/everymans-vp8/","cat":"image_theory","title":"Everyman’s VP8"},{"id":"comment-127219","author":"dan","post":"Mike, I agree with you in a qualitative sense. But the classic claim that a 3 D plot cannot be produced from a conventional photograph is hard to defend in a general sense. O.K. I understand why not to use original colors because it includes the underlying image. Is grayscale, here different than gray?.","date":"2014-06-06","mins":"2:44 am","url":"https://shroudstory.com/2014/06/05/good-3d-from-a-conventional-photograph/","cat":"image_theory","title":"Good 3D from a conventional photograph"},{"id":"comment-157956","author":"dan","post":"Reblogged this on Best of Shroud Story..","date":"2014-09-30","mins":"7:01 am","url":"https://shroudstory.com/2014/09/30/inspired-by-colin-berrys-experiments-with-lemons/","cat":"image_theory","title":"Inspired by Colin Berry’s Experiments with Lemons . . ."},{"id":"comment-164561","author":"dan","post":"I completely agree. Interesting. This could have an impact on many hypotheses. I’m excited to see where it goes, with Colin and with others who have some graphics background..","date":"2014-10-22","mins":"5:53 am","url":"https://shroudstory.com/2014/10/22/homogeneous-or-not-thats-the-question/","cat":"image_theory","title":"Homogeneous or Not? That’s the Question"},{"id":"comment-165225","author":"dan","post":"Good point!.","date":"2014-10-24","mins":"1:46 pm","url":"https://shroudstory.com/2014/10/22/homogeneous-or-not-thats-the-question/","cat":"image_theory","title":"Homogeneous or Not? That’s the Question"},{"id":"comment-9267","author":"dan","post":"This is actually funny..","date":"2012-03-12","mins":"5:27 pm","url":"https://shroudstory.com/2012/03/12/irene-corgiats-shroud-of-turin-image/","cat":"image_theory","title":"Irene Corgiat’s Shroud of Turin Image"},{"id":"comment-207951","author":"dan","post":"Fair enough. I’m always open to new thinking. Joe Accetta’s suggestion that photographs of death masks might yield 3 D data with the right lighting conditions and Colin’s demonstration of (weak) 3 D effect from scorches must be taken into account. I’m as convinced as ever that the shroud is real, more so than even a year ago. But I have come to realize that the 3 D data is not well understood and I won’t use it to try to convince anyone about authenticity. I very much appreciated the letter from the reader that called out the specifics of the issue. 1) The adage that regular photographs and painting never have/can’t have/don’t have 3 D information is inaccurate. 2) The assumption that image density/brightness/grayscale value represents cloth to body distance is just that, an assumption. There are other options. 3) The notion that the image is derived by an interaction between a body and a cloth depends on a cloth body assumption being true. Is that not a form of begging the question? I have never seen controls for the VP8. That would be easy. Hint to the folks in New Mexico. Get your best 3 D projection. Now without touching the VP8 dials and switches AND without touching the camera, particularly the lens (leave aperture and focus settings untouched) do a 3 D projection of a card with calibrated grayscale values and precision line width cross hairs so we can estimated linearity of the calculated height and the amount of smoothing that takes place in the calculation. Does the VP8 have a built in, electronic smoothing/Gaussian blurring function or is it achieved with an out of focus lens. Let’s have a do over. Then let’s do the same with the best new higher definition tools out there like Image J. The 3 D is very mysterious. Let’s stop pushing the mystery and try to understand the mystery with data. Maybe it is all about cloth to body distance. Let’s find out instead of assuming..","date":"2015-08-11","mins":"5:12 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","title":"It is really, really time to rethink what we think about 3D"},{"id":"comment-51803","author":"dan","post":"I will post it first thing in the morning..","date":"2013-11-17","mins":"5:52 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-207941","author":"dan","post":"Got it, Fixed it. Thanks to a reader for spotting my mistake; I added the word NOT. My last two sentences before the notes should have read, “I still think the data is real 3 D data. I’m just NOT persuaded that cloth to body distance is a valid assumption.”.","date":"2015-08-11","mins":"2:37 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","title":"It is really, really time to rethink what we think about 3D"},{"id":"comment-135059","author":"dan","post":"Yahoo and Facebook are news aggregators (although Facebook as we see is a bit tweaked in that regard). Unlike them I read material and evaluate it. Often I comment on it. I am not a news aggregator. And you are not news. You are completely focused on the by my way part of my posting. Lighten up. I was, admittedly in an off handed way, saying that your content was too significant to be missed, as it was likely to be because of the way you posted it. Okay, a bit more directly: GREAT STUFF (excuse me for shouting). Do it however you want. It is still great stuff. As for your word of advice: as they say in The Bronx, fuhgeddaboudit..","date":"2014-07-03","mins":"6:09 am","url":"https://shroudstory.com/2014/07/03/its-everything-to-do-with-an-unyielding-structure-called-the-upper-rib-cage/","cat":"image_theory","title":"It’s everything to do with an unyielding structure called the upper rib cage"},{"id":"comment-51454","author":"dan","post":"Louis :All, repeat, all, the data contained in the relic should be addressed before a really convincing theory on how the image may have been produced can be proposed. We don’t see that in pro authenticity image theories. A UV laser induced coloration of flax but with no other image characteristics whatsoever gets worldwide headlines. Corona Discharge leaves much to be desired. The Maillard Reaction/Diffusion of Something proposals don’t work so far and maybe never will. And despite Antonacci’s claims that his Historically Consistent Method fits the bill, it doesn’t. What has Colin done differently? Every pro authenticity and every skeptical proposal has come up short. In the final analysis, I quite sure, Colin’s scorch theory will too..","date":"2013-11-15","mins":"11:07 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-8948","author":"dan","post":"“Highly misleading” is quoted in the headline. It stands. Someone who instead of substantively criticizing the work of other scientists like Al Adler, Ray Rogers and Paolo Di Lazzaro, resorts to calling their work “Mickey Mouse science;” someone who calls the folks at ENEA “idiots” and a “bunch of jokers” doesn’t have a lot of standing here to ask for kid glove treatment. Dan Porter.","date":"2012-03-05","mins":"7:49 am","url":"https://shroudstory.com/2012/03/04/john-jackson-on-colin-berrys-highly-misleading-comments/","cat":"image_theory","title":"John Jackson on Colin Berry’s “highly misleading” comments"},{"id":"comment-157629","author":"dan","post":"Reblogged this on Best of Shroud Story..","date":"2014-09-29","mins":"5:55 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","title":"Mario Latendresse’s take on the 3D data"},{"id":"comment-58495","author":"dan","post":"Michael, we will buy your book if we want to. We are probably less inclined to do so because you are tossing out teasers. Here in this blog we tend to say what we have to say..","date":"2013-12-12","mins":"3:24 pm","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"},{"id":"comment-49719","author":"dan","post":"I met with Ray Downing for lunch and he assured me of the same thing. There is no question that the data is there. I’ve made projections with Image J, POV Ray and Corel Brice. The questions is what does the 3 D data represent, 1) cloth to body distance, 2) elevation from a plane (which is what we plot) or 3) something altogether different that we believe is 3 D data (such as proposed if it is some sort of trick photography). I don’t think it is cloth to body distance, even approximately or inaccurately. I don’t think it is a painting or a photograph or a scorch o graph or anything like that. The 3 D data isn’t encoded. It isn’t in the image in the sense that it can be extracted from the image, leaving something behind. I think the 3 D data is the image. Except for spurious noise from dirt and wrinkles and such I think it is all 3 D data that just happens to look like an image. I think it is connected to the resurrection but not caused by it. I think it is a real image of Jesus. It might have been imprinted before, after or during the resurrection. At this point I don’t see it being formed by chemical reactions from gas, light, particles, etc..","date":"2013-11-03","mins":"9:17 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","title":"Maybe the 3D data doesn’t mean what we think it does"},{"id":"comment-150654","author":"dan","post":"Reblogged this on Best of Shroud Story..","date":"2014-09-13","mins":"4:47 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"},{"id":"comment-214596","author":"dan","post":"Amen..","date":"2015-11-14","mins":"4:33 am","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","title":"Nevertheless, the images are real enough!"},{"id":"comment-37634","author":"dan","post":"Actually, Colin, in this case you are mistaken. The 3 D data that allows plotting (e.g. Imagej, VP8, etc.) can also be viewed in many ways: stereoscope, 3 D glasses, lenticular print, simulated motion, etc. The shrinking you see was artistic effect, very common in documentaries — panning in and panning out. It has nothing to do with the 3 D effect you see. Really! Ray Downing did the work in his documentary. I’ve met with him. I’m completely convinced about the quality and integrity See https://shroudstory.com/2013/02/02/teaser of the day 3 why many state that the shroud is a 3d image/.","date":"2013-06-21","mins":"2:22 pm","url":"https://shroudstory.com/2013/06/21/nice-3d-image/","cat":"image_theory","title":"Nice 3D Image"},{"id":"comment-138900","author":"dan","post":"I stand corrected. It was MS Office Picture Manager instead of Photo Shop..","date":"2014-07-17","mins":"7:29 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?"},{"id":"comment-37637","author":"dan","post":"Actually, Colin, you have done enough work, yourself, with imagej to know better. Plot several images by changing to viewing position just slightly. Then animate the GIF, a very elementary task. Now, do it with my picture. Shaking my head is a whole different game and doesn’t mean it is 3 D..","date":"2013-06-21","mins":"2:30 pm","url":"https://shroudstory.com/2013/06/21/nice-3d-image/","cat":"image_theory","title":"Nice 3D Image"},{"id":"comment-818","author":"dan","post":"While I agree that faith is much more complex than that, I don’t agree that the shroud in fake. Reality, after all, can be very complicated. See the Joe and Lenny Paradox listed to the right..","date":"2009-10-12","mins":"4:59 pm","url":"https://shroudstory.com/2009/02/21/nicholas-allens-photograph-theory-just-wont-die/","cat":"image_theory","title":"Nicholas Allen’s Photograph Theory Just Won’t Die"},{"id":"comment-89493","author":"dan","post":"One of them, as I recall, was.","date":"2014-03-16","mins":"4:25 am","url":"https://shroudstory.com/2014/03/15/of-pixels-spectrum-and-density/","cat":"image_theory","title":"Of Pixels, Spectrum and Density"},{"id":"comment-143850","author":"dan","post":"Reblogged this on Best of Shroud Story and commented: I was prompted by an email from a reader of http://www.shroudstory.com to find this and post it again on the blog. So why not reblog it, as well..","date":"2014-08-14","mins":"4:26 am","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","title":"Of inexplicable explanations"},{"id":"comment-20218","author":"dan","post":"Actually, I can’t account for it because, frankly, I don’t see a UCAI sequence on the shroud. Yes, I see bits of shading that might somewhat resemble UCAI like lettering. It could be a pareidolia. It is not distinct enough for me to say comfortably that it is lettering. Moreover, I wonder if what I see is a color change to the fiber or a coating, blood, dirt, a yarn defect, banding (bleaching differences) or even a photographic artifact such as a shadow or silver clumping during contrast enhancement (these are not digital photographs) all in some combination. Maybe Gabriel is right that there is software without bias that can determine a statistical probability that what is there is possibly a coin image. I think that we must go back as close as possible to looking at the cloth itself. Can I see the original negatives or high definition unenhanced digital scans of them? Can I see each generation of film to film enhancement with a microscope to see that artifacts are not being generated. Is the enhanceement work precisely documented and reproducible. Right now it is a one time shot in the dark, seat of the pants ehahncement, isn’t it. Maybe another series of enhanceements will produce different results. It would be nice to use digital methods with the original negatives. Different digital algorithms might produce different results. And by the way, I’m not impressed with Rodante’s and Moroni’s analysis. If anything, as I look at it, I think they show that this letters cannot reside on the yarn unless image color can bridge across from one fiber to another..","date":"2012-12-11","mins":"11:48 am","url":"https://shroudstory.com/2012/12/11/coins-on-eyes-issue-again/","cat":"image_theory","title":"Coins on Eyes Issue Again"},{"id":"comment-89248","author":"dan","post":"Apparently, by stealing the thread and changing the subject..","date":"2014-03-15","mins":"12:27 pm","url":"https://shroudstory.com/2014/03/15/of-pixels-spectrum-and-density/","cat":"image_theory","title":"Of Pixels, Spectrum and Density"},{"id":"comment-24673","author":"dan","post":"Seriously, Colin? You are going to boost my visitor count or Google ranking by answering a question on my site???? Is this what this is all about? The way you boost visitor counts or Google ranking is by not thinking about it and thinking instead about what you are writing or posting on your own blog. Luminance distribution? Good grief, man, I just realized. You just did answer thus boosting something or other, maybe. Except you didn;t really answer, did you. Oh, well. We’ll maybe catch you on your blog and boost your whatever this is about..","date":"2013-02-18","mins":"8:39 am","url":"https://shroudstory.com/2013/02/18/one-handed-clapping-for-colin-berrys-criticism-of-the-colorado-paper/","cat":"image_theory","title":"One Handed Clapping for Colin Berry’s Criticism of the Colorado Paper"},{"id":"comment-167895","author":"dan","post":"I think it has always been listed on Barrie’s site since 2005 as linking to Mario site (http://www.sindonology.org/papers/latendresse2005a.pdf). Mario now catches the request and redirects it to Academia. This is nice. No disk storage costs, no bandwidth issues (but who pays for that anymore — it’s free these days) and I definitely think more exposure. I’m looking at ways to put the 2008 Ohio conference papers there to save costs and increase exposure. See: Publishing Shroud of Turin Papers on Academia.edu.","date":"2014-11-02","mins":"9:29 am","url":"https://shroudstory.com/2014/11/02/paper-chase-a-significant-paper-by-mario-latendresse/","cat":"image_theory","title":"Paper Chase:  A Significant Paper by Mario Latendresse"},{"id":"comment-75005","author":"dan","post":"What are you saying? Do you mean an image “not even noticeable for anyone during the Middle Ages”? Not even noticeable enough to allow the charge that some one confessed to painting the unnoticeable? Not even noticeable enough to make a medallion of the unnoticeable?.","date":"2014-01-28","mins":"4:12 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-131256","author":"dan","post":"Ruling out “high amount of energy.” In your opinion. I think there is room for some skepticism about that conclusion..","date":"2014-06-19","mins":"10:16 am","url":"https://shroudstory.com/2014/06/17/photomicrographs-and-stochastic-imaging/","cat":"image_theory","title":"Photomicrographs and Stochastic Imaging"},{"id":"comment-27965","author":"dan","post":"It is the head of a pin. The point of a pin is unreasonable. It would be impossible to measure accurately..","date":"2013-03-21","mins":"7:20 am","url":"https://shroudstory.com/2013/03/21/of-laser-like-light-and-scorching/","cat":"image_theory","title":"Of laser like light and scorching"},{"id":"comment-99995","author":"dan","post":"I fixed it, sort of..","date":"2014-04-16","mins":"1:47 pm","url":"https://shroudstory.com/2014/04/16/remember-the-valencia-consensus-parenthetical/","cat":"image_theory","title":"Remember the Valencia Consensus Parenthetical"},{"id":"comment-101897","author":"dan","post":"Watching carefully..","date":"2014-04-21","mins":"5:11 am","url":"https://shroudstory.com/2014/04/16/remember-the-valencia-consensus-parenthetical/","cat":"image_theory","title":"Remember the Valencia Consensus Parenthetical"},{"id":"comment-22002","author":"dan","post":"If you want I can post them. Just email them to me with captions..","date":"2013-01-14","mins":"12:36 pm","url":"https://shroudstory.com/2013/01/14/scorched-image-by-the-resurrection/","cat":"image_theory","title":"Scorched Image by the Resurrection"},{"id":"comment-87296","author":"dan","post":"Which is exactly why I called attention to the discussion on Colin’s site. Surely, there will be more..","date":"2014-03-11","mins":"6:08 am","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","title":"Scorching Onion Skins"},{"id":"comment-155147","author":"dan","post":"That’s right. Think of it like a cartoon. I simply took a picture of the shroud and added “electronic” Photoshopped in some brush strokes..","date":"2014-09-24","mins":"1:34 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-49802","author":"dan","post":".","date":"2013-11-03","mins":"5:49 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-58903","author":"dan","post":"Please Only Discuss Michael Jude’s Book and Claims HERE.","date":"2013-12-13","mins":"1:01 pm","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"},{"id":"comment-7113","author":"dan","post":"Co, you wrote: “Dan, do you think that this beautiful image of the fetus shows 3 D contains information encrypted? “I dare say (I have no software on this) that it does not, there is no relationship of proportionality in its “points” between distance and intensity of the image. “From that image, coherent 2 D, I think it could get a consistent image in 3 D … …” It is my understanding that this picture is the 3 D representation or plot of the ultrasound spatial data, which like the shroud data is relative distance that might have been stored in grayscale values. The picture of the fetus might be less confusing if it was green like the VP 8 output of the shroud image..","date":"2012-01-17","mins":"4:25 pm","url":"https://shroudstory.com/2012/01/16/the-3d-images-on-the-shroud-of-turin-are-not-unique/","cat":"image_theory","title":"The 3D images on the Shroud of Turin are not unique"},{"id":"comment-44636","author":"dan","post":"Mark, I knew about Frascati, so I spoke in haste suggesting that your paper should be presented in a public forum. I apologize for giving the wrong impression. But the need is still there, I’m hoping some day for a conference where discussion following a presentation is readily available to everyone, preferably in video form archived on You Tube or Vimeo, where discussion is open and comprehensive (may Dallas 2005 with its imposed refusal to allow questions and with uniformed Texas Rangers in the room to make sure, never happen again). I would like to see your paper openly discussed along with all of the other image hypotheses – all of them. In the meantime, we might hopefully do it here. Peer review doesn’t give credence to a hypothesis in a paper, only to the scientific methodology of the author, which is important. Peer review of anything published in open access journals like Academic Journals’ “Scientific Research and Essays” is probably suspect in the minds of many people. I have much greater trust in the scientific caliber of something published by Paolo dl Lazzaro, for instance, with or without peer review. When I see anything from Academic Journals I’m immediately prejudiced against the paper. Paulette is right. We should drop the term peer review when trying to promote an idea. It has probably been abused and bastardized beyond meaning in the world of shroud research: that is too bad. Giulio in a guest posting defending the use of Academic Journals Paper Chase: Mark Antonacci’s Hypothesis.","date":"2013-09-18","mins":"3:40 pm","url":"https://shroudstory.com/2013/09/16/speaking-of-more-scientific-testing-of-the-shroud/","cat":"image_theory","title":"Speaking of more scientific testing of the shroud"},{"id":"comment-6078","author":"dan","post":"Google Translation: I find it very curious Yannick commitment that the body of Jesus of Nazareth suffered the ROT! That is not the opinion of most experts on the Shroud … … with the exception of Rogers, great chemistry but little familiar with medical and forensic aspects. The decay (and the release of ammonia is a sign of putrefaction) does not start until the disappearance of rigor mortis (called Brouardel Act), and the image of the Shroud shows no signs of decomposition, including gaseous diffusion. I find very unfortunate comments on Di Lazzaro, Fanti and “other guys”, which includes among others, his “friend” Dr. Heimburger, a colleague of mine..","date":"2011-12-24","mins":"7:33 am","url":"https://shroudstory.com/2011/12/23/surprising-live-poll-on-the-shroud-of-turin/","cat":"image_theory","title":"Surprising Live Poll on the Shroud of Turin"},{"id":"comment-44440","author":"dan","post":"Paulette, after making some inquiries, it is my understanding that Mark is one of a half dozen people involved in organizing the conference. His foundation is a co sponsor of the conference, Given that he is not a scientist or historian, he should not have a significant role in selecting papers or speakers. And frankly, I would like to see Mark present a paper so that it can be examined in a public.forum..","date":"2013-09-16","mins":"2:43 pm","url":"https://shroudstory.com/2013/09/16/speaking-of-more-scientific-testing-of-the-shroud/","cat":"image_theory","title":"Speaking of more scientific testing of the shroud"},{"id":"comment-172145","author":"dan","post":"I don’t know. Sometimes something happens and I’m not watching 24/7..","date":"2014-11-19","mins":"10:49 pm","url":"https://shroudstory.com/2014/11/18/the-conspiracy-of-the-faux-sweat-imprint/","cat":"image_theory","title":"The Conspiracy of the Faux-Sweat Imprint"},{"id":"comment-206402","author":"dan","post":"Easy!.","date":"2015-07-23","mins":"12:25 pm","url":"https://shroudstory.com/2015/07/23/the-morphing-of-rogers-and-berry/","cat":"image_theory","title":"The Morphing of Rogers and Berry?"},{"id":"comment-206413","author":"dan","post":"Very well said!!!.","date":"2015-07-23","mins":"2:02 pm","url":"https://shroudstory.com/2015/07/23/the-morphing-of-rogers-and-berry/","cat":"image_theory","title":"The Morphing of Rogers and Berry?"},{"id":"comment-206411","author":"dan","post":"Redacting is fine at home with a laptop. It is not when I’m using a phone. And while we are on the subject someone else, lower in the alphabet, is close to getting the boot if he isn’t careful. I’m not looking for Jambalaya, just calm. This is an important topic. What Colin has to say is important. Voice to text not checked..","date":"2015-07-23","mins":"2:00 pm","url":"https://shroudstory.com/2015/07/23/the-morphing-of-rogers-and-berry/","cat":"image_theory","title":"The Morphing of Rogers and Berry?"},{"id":"comment-103196","author":"dan","post":"Dear Prof Allen, I regret to inform you that the Shroud of Turin Blog does not make exceptions for serious scientists. And though it pains us to do so, we occasionally discuss the work of non fringe people such as you. I am sorry to hear that you were ill advised to appear on this recent Smithsonian Channel documentary which claimed that a real scientist was going to evaluate your findings. If you would care to submit a guest posting to this blog, I promise you that it will be discussed by a real scientist. Apparently, you are more than a scientist. According to your profile at Freelanced, “Prof Dr NPL Allen has been lecturing both Fine Art and Art History since 1981. From 1985 – 2007 he worked at the Faculty of Art and Design (PE Technikon) where he was the Head of the Fine Art Department (1995) and Dean of Faculty (1996 – 2007). Qualifications: Dip. F.A., M.F.A., M.A., D. Phil., D.Laur. Tech. This is great news but regrettably makes it even more difficult to make an exception for you. How can we do so and still discuss your theory “that all blood ‘flows’ on the shroud contain acute angled kinks somewhere along their supposed flow. This is caused by an artistic flick of the wrist during painting. Also, all blood flows, regardless of where they supposedly emanate from, exhibit the same thickness and consistency.” All of this contradicts the conclusion of other real scientists. Thank you for commenting in the fringe..","date":"2014-04-24","mins":"8:56 am","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","title":"The pig experiment was not Barrie’s experiment"},{"id":"comment-206412","author":"dan","post":"That was Kumbayah not Jambalaya. Siri isn’t perfect..","date":"2015-07-23","mins":"2:01 pm","url":"https://shroudstory.com/2015/07/23/the-morphing-of-rogers-and-berry/","cat":"image_theory","title":"The Morphing of Rogers and Berry?"},{"id":"comment-131259","author":"dan","post":"While I don’t share your irritation, Colin, I do like your suggestion. I’m going to think about it. Thanks..","date":"2014-06-19","mins":"10:20 am","url":"https://shroudstory.com/2014/06/19/revisiting-the-turin-shroud-image-is-not-a-scorch/","cat":"image_theory","title":"Revisiting:  The Turin Shroud Image is not a Scorch"},{"id":"comment-183478","author":"dan","post":"Charles, are you confusing the notion of a mirror image for a negative image? You keep talking about left and right. You even wrote, “For a more sophisticated negative image look at the mirror on the famous Arnolfini portrait by Van Eyck in the National Galley, London ( 1434).” That is no negative image in that painting. No, really!.","date":"2015-01-15","mins":"7:13 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-208137","author":"dan","post":"As far as I’m concerned, Hugh Farey amply demonstrated that there is no basis whatsoever to Gematria when it comes to the Shroud of Turin. Thanks, Hugh..","date":"2015-08-13","mins":"4:48 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-183512","author":"dan","post":"Nathan Wilson writes: “The first linen image created by Beauchamp’s window, exposed for ten days generally parallel to the sun’s path. The linen bears a negative image, dark on light (left), which becomes positive, light on dark (right), in a true photonegative.” Unlike Freeman, Wilson understood what a negative was. It should be noted that Wilson used unbleached linen which is not quite so white..","date":"2015-01-15","mins":"10:08 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-169328","author":"dan","post":"Reblogged this on Best of Shroud Story..","date":"2014-11-06","mins":"3:18 pm","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","title":"Those Dark Specks in the Mark Evan’s Photographs"},{"id":"comment-183469","author":"dan","post":"And thus can I imagine that the shroud might be an “accidental” negative created from a positive painting, maybe even something from Constantinople? Chemistry? Is this possibly a sun bleaching of an image not completely unlike the sun bleaching experiments of Nathan Wilson..","date":"2015-01-15","mins":"6:26 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-160353","author":"dan","post":"Posted on behalf of Yannick, who may not comment on this blog (with some editing on my part): Mr. Latendresse said that, in his mind, there was surely no physicist in the peer review commity… I want to claim here [he is totally wrong.] I’ve learn through Mr. Fazio that one of the referee was Alan Mills, who is a senior lecturer in Planetary Science at the Department of Physics and Astronomy at Leicester University in England and who should know Physics quite well! Also, Mr. Latendresse should know that Mr. Mills spent a long time studying the Shroud and even proposed an interesting natural image formation hypothesis involving atoms of singlet oxygen that would have been released by the corpse of the Shroud man. Because of this, I think his presence on the commity of referees was truly relevant and was a guaranty of the professionalism of our paper (thanks to Fazio and Mandaglio), even though I agree that this paper could have been even better (and more “accurate”). Finally, I also want to inform Mr. Latendresse and anyone else that our final draft was blocked the first time and we had to rewrite some parts of our paper before we finally got the approval from the 3 referees who analyzed our paper. I can ensure you that this process of peer review was done with professionalism and with honesty from the 3 referees, as well as from the 3 authors of the paper in question….","date":"2014-10-08","mins":"5:00 am","url":"https://shroudstory.com/2014/10/07/to-revisit-a-stochastic-process/","cat":"image_theory","title":"To Revisit a Stochastic Process"},{"id":"comment-18207","author":"dan","post":"Hugh, Rogers explained it this way: “Because the cellulose was not involved in image formation, the color must have formed in impurities on the surfaces of the image fibers. Independent observations have proved that all of the image color resides in a very thin layer on the outside surfaces of colored fibers. “Evaporation concentration can explain the superficial nature of the image and the identical properties of the front and back images. It can also explain the “doubly superficial” image, i.e., the presence of a superficial image on the back surface of the cloth as reported by Ghiberti and Fanti and Maggiolo. “When a solution evaporates at the surface of a porous solid, dissolved solutes are concentrated at the evaporating surface. The principle is illustrated in the photomicrograph with blue dye. A piece of linen was saturated with a dilute solution of blue dye, and the cloth was dried while laying on a sheet of Teflon. All evaporation occurred at the top surface, and the dye concentrated on that surface. It is obvious that most of the dye deposited on the highest parts of the weave and the upward pointing fibers of the nap. A sheet of cloth that contained sugars and starches would deposit those impurities at the very topmost part of the weave after washing and drying.”.","date":"2012-10-24","mins":"1:43 pm","url":"https://shroudstory.com/2012/10/21/thibault-heimburger-now-i-know-for-sure-that-the-ts-body-image-is-not-a-scorch/","cat":"image_theory","title":"Thibault Heimburger: Now, I know for sure that the TS body image is not a scorch"},{"id":"comment-90436","author":"dan","post":"Good..","date":"2014-03-18","mins":"1:55 pm","url":"https://shroudstory.com/2014/03/14/two-comments-promoted-colin-berry-has-cracked-the-shroud-enigma/","cat":"image_theory","title":"Two Comments Promoted:  Colin Berry Has Cracked the Shroud Enigma?"},{"id":"comment-217288","author":"dan","post":"Reblogged this on Best of Shroud Story..","date":"2015-12-27","mins":"1:29 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","title":"Watertight Evidence"},{"id":"comment-198591","author":"dan","post":"Frankly, when it comes to the subject of long hair, you need to be better informed. Type the words long hair into the search box of this blog in the upper right hand corner and read the several postings along with comments..","date":"2015-05-08","mins":"5:32 am","url":"https://shroudstory.com/2015/03/31/whats-to-like-over-on-colins-blog-right-now/","cat":"image_theory","title":"What’s to like over on Colin’s blog right now?"},{"id":"comment-5223","author":"dan","post":"Donald, something must have been lost in translation from American to Australian. In America a moron is someone who is perceptive, bright and very intelligent. I’m sure that is what Ron meant. As for my criticism of how you see what you do, you need to do some research. Don Lynn at the Jet Propulsion Lab (JPL) along with other image analysts studied the images for months. There is no sword image there (yes, I see something that looks like a sword made up of banding lines, creases, dirt, etc.. Nor really are there any confirmed things some people see like flowers, a broom, dice, teeth, coins, nails, etc. I see what looks like flowers, but I see how they are formed by anomolies. Forensic pathologists such as Robert Bucklin and Fred Zugabe have studied the image using large scales hi res life size images. This is the front side and backside of a man on the shroud. It may not be Jesus, as you say, but it is a naked man who appears to be crucified. I can cite dozens upon dozens of peer reviewed scientific journals for you. As humans, we have a very natural ability to see images in random patterns. Frequently, people see patterns with which they are most familiar. Faces are common and hence people often see images of Jesus or Mary on tortillas and grilled cheese sandwiches, in wood grain, in patterns of smudges of all sorts. I see what I am certain is a pareidolia of a sword. That is the word many shroud researchers use: pareidolia. Search this blog (upper right hand corner) for pareidolia. Martin, I will take the time to read some of your blog. We are not rushing to judgment. This blog gets over 1500 or more pageviews per day, mainly on the home page. There are two or three posts per day. We just look rushed. By the way, I like the documentary you recommend because I appear in it. But I don’t agree with some of the things other researchers who also appear have to say. That is the way it is in shroud research. Later today, I hope to present a list (put together by Joe Marino) listing over 2000 primary researchers in the last century, most still active and most legitimate scientists in academia. Donald, I don’t worship the shroud. I have never met anyone who does. I merely want to know what it is, very carefully. Donald, I can probably arrange to get you gigs and gigs of some high res full color, large size images for serious study. Let me know if I should pursue it..","date":"2011-12-04","mins":"10:44 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor"},{"id":"comment-171068","author":"dan","post":"Charles, I don’t think you deliberately deceived anyone. But I am sure you are mistaken in thinking the shroud is a painting. You say what if the tests were redone and it was discovered that the calcium carbonate was gesso instead of dust. How is that determined? Have you consulted a chemist or a microscopist? There are so many other reasons that it is not a painting that it would probably mean nothing. You wonder what it would mean if experts show that the shroud could only have been made of a loom only known in Europe since 1000. Essentially that would be an opinion that the cloth was not more than a thousand years old. That doesn’t make it a painting. I ask you again, Charles: You speak of historical context. Can you thus give an example from anytime in history of a painted negative image that is not copied from a negative image? Hint: a mirror image does not mean the image is a negative image. Can you explain how the image is chemically formed after all the paint has flaked off? Do you have one example from history of this happening..","date":"2014-11-13","mins":"12:38 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-209185","author":"dan","post":"Come on Stan, you know better than to ask a question like that. It is irrelevant and insulting..","date":"2015-08-28","mins":"2:47 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","title":"You may reassure Mr. Berry"},{"id":"comment-209200","author":"dan","post":"I would be insulted if you asked me “do you believe by the light of the Holy Spirit you are truly wise?” even though I make it clear that I believe in the Trinity. And by the way he was talking about a medieval man coated with flour, not Jesus. Stan, he is the only serious skeptic who in many years has been very creative and done extensive experimenting. What he believes — and that is his business — is of no consequence to what he does as a scientist. Should we ask someone in the medical field if he believes by the light of the Holy Spirit that he is truly wise? Colin has been very insulting of many people. I have pointed that out. You have also been insulting and I am pointing that out. Why not explain why you are “not bamboozled by Colin’s liberal use of chemical terminology and his verbosity” rather than hinting at religious heresy as a reason? Why not be truly wise? Sorry, Stan, but that is what I think..","date":"2015-08-28","mins":"7:23 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","title":"You may reassure Mr. Berry"},{"id":"comment-174602","author":"dan","post":"Louis, send it. I’ll upload it and make it available to anyone..","date":"2014-12-04","mins":"7:19 am","url":"https://shroudstory.com/2014/12/04/paper-chase-the-second-face-defended/","cat":"paper_chase","title":"Paper Chase:  The Second Face Defended"},{"id":"comment-47983","author":"dan","post":"I wasn’t comparing. I was illustrating the point about reflected light. Sorry if there was some confusion..","date":"2013-10-19","mins":"3:49 am","url":"https://shroudstory.com/2013/10/18/how-do-we-know-no-directionality-of-light/","cat":"uncategorized","title":"How do we know? No directionality of light."},{"id":"comment-47986","author":"dan","post":"If we can’t answer the questions then something is wrong..","date":"2013-10-19","mins":"4:08 am","url":"https://shroudstory.com/2013/10/18/how-do-we-know-no-directionality-of-light/","cat":"uncategorized","title":"How do we know? No directionality of light."},{"id":"comment-208138","author":"dan","post":"As far as I’m concerned, Hugh Farey amply demonstrated that there is no basis whatsoever to Gematria when it comes to the Shroud of Turin. Thanks, Hugh..","date":"2015-08-13","mins":"4:54 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-186335","author":"dan","post":"Google Translation: “Black hands”? The researchers of the Shroud (pro authenticity and anti authenticity) should take the agreement to make a public document addressed to the Pope in order to “clarify” the most important relic of Christianity. Carlos.","date":"2015-01-26","mins":"4:49 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers"},{"id":"comment-186152","author":"dan","post":"Ouftlanked implies us versus them. I try not to think that way. But I do think the folks in Turin will find themselves increasingly left out of discussions and much research..","date":"2015-01-25","mins":"8:34 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers"},{"id":"comment-23876","author":"dan","post":"Actually, Paulette, the Siefker and Spicer paper includes the following: “In order to build upon the work of other Shroud research colleagues not associated with TSC, we have included, as a literal benchmark, the image characteristics that are most often mentioned in the corpus of empirical studies on the Shroud and also enumerated in an important paper by Giulio Fanti published in the Journal of Imaging Science and Technology. (See reference 1.) The cardinal numbered items in this table correspond to the characteristics listed in Fanti’s paper. There are additional items included in the table that augment Fanti’s list. These items are supported by multiple sources including the research team of TSC. These additionally listed image characteristics, like the benchmark characteristics, place restrictions on proposed image formation hypotheses. The additional items are inserted into the table at what we believe are the proper logical points and are identified with a decimal fraction number.” So credit is given. Your point about whether or not the authors can explain the resolution statement is, however, a good one..","date":"2013-02-09","mins":"11:15 am","url":"https://shroudstory.com/2013/02/08/topic-of-the-day-8-the-body-image-disappears-at-a-distance/","cat":"topic_for_today","title":"Topic of the Day (#8):  The body image disappears at a distance"},{"id":"comment-208217","author":"dan","post":"And thus it is like some mental Ouija board. I’m sorry, Dave, but I completely disagree with you. I see Gematria as nothing more than a parlor trick..","date":"2015-08-14","mins":"1:26 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-7112","author":"dan","post":"Google translation of co’s comment: The “authors” (authors) if you understand how the VP 8 … …. Others do not understand. The VP 8 in height or inshore assign different densities of a photographic image provides a 3 D FALSE so NOT used to study the topography planetary “The purpose of the isometric display WAS to make it Easier to follow patterns of Changes in shades of gray Within an image. Particularly, the light pattern of light reflection Changes in soils and vegetation from near a fault line of interest Were. Following patterns of soil types and vegetation types of interest Also WAS. But in no case ever Was There Any indication on the isometric display of how high or low, how tall or short something was. “Peter M. Schumacher (the engineer who programmed the VP 8). 1 in graphics support (photographic film containing the image planetary or any other image) there is no information about the distance between the support and the actual image graphic, and submit it to the VP 8 and transforming the intensities in distance can not be consistency between the image and the image REAL “The isometric display WAS never Intended to produce a” real three dimensional “display. A snow covered peak Would look like a high, flat surface, while a rock sitting on top of the snow Would look like a deep hole in the high surface. Reflecting Light from a stream at the bottom of a valley Would Appear to be a high elevation, Perhaps Even Higher Than the snow on the peak of the mountains. Dull dark rocks and vegetation Would Appear to Be Lower Than the water of the stream. In other words, objects are not as tall or short, high or low, as Their reflectance of light Might indicated. There is no correlation Between reflectance and altitude. “Peter M. Schumacher (the engineer who programmed the VP 8). 2 Artifacts in the Shroud: When the VP 8 provides a false 3 D photographic image of the marks of fire 1532 (or others APPLIANCES unrelated to body image) is working properly, is to be expected of the VP 8. By transforming the VP 8 intensities at distances there is no consistency between the image of the artifact (burn mark) and the burn mark REAL. 3 Body Image on the Shroud: When a photograph of the Shroud (print graphic support of a body) is submitted to the VP 8 is produced in body image and unexpectedness of the VP 8. By transforming the VP 8 SI intensities over distances there is coherence between body image of graphic support (Shroud) and the body of a REAL MAN. 4 Demonstrating that intensity and epicentral distance relationship stored in the Shroud of proportionality, and generating a REAL VP 8 3 D In this graphic support (Shroud) the densities of body image are proportional to the distances at each point SUPPORT MAN, each point of support (Shroud) has encoded information about its distance from the point that was printed REAL BODY, about you THREE DIMENSIONAL called 3 D. [That 3 D, three dimensionality was enunciated by Delage and Vignon in 1902, studied by Gabriel chydorids in 1913 with a suitable mechanical studied by Paul Gastineau in 1974 that made the first bas relief of the face from the photograph of the Shroud by attached stylus on an optical system, acting on a stylus malleable material. In 1976 is demonstrated by the VP 8 by Jackson, Jumper, Stevenson, Charter and Schumacher.] The DECODE better or worse that dimension (distance) to obtain a volumetric model is an issue closely related but different, depending on the advancement of technologies in this regard..","date":"2012-01-17","mins":"4:17 pm","url":"https://shroudstory.com/2012/01/16/the-3d-images-on-the-shroud-of-turin-are-not-unique/","cat":"image_theory","title":"The 3D images on the Shroud of Turin are not unique"},{"id":"comment-5313","author":"dan","post":"The process, as I understand it, was to bury someone in a “family” tomb, probably with a burial shroud, for several months or a year. Afte that time the tomb was opened and the bones were gathered and placed in an ossuary or “bone box.” It might be a jar. That would be returned to the tomb. Under almost any circumstance the shroud would have decomposed quickly. Decomposition products from a body, that would have damaged the cloth, begin to appear within days. That is unless the funeral preparations were not completed or the tomb was opened for some other reason. In either case the body and the cloth would have needed to have been separated, right? Dan Porter.","date":"2011-12-07","mins":"1:00 pm","url":"https://shroudstory.com/2011/12/07/why-do-we-think-it-is-an-image-of-jesus-on-the-shroud-of-turin/","cat":"image_theory","title":"Why do we think it is an image of Jesus on the Shroud of Turin?"}]
