[{"id":"comment-5620","author":"dan","post":"Annie, I am unable to reconcile belief in a completely loving God with the belief that we must have been baptized, have confessed to some latest sin or accepted some formulaic belief to attain salvation. I think God knows the heart and mind and everyone. “Father, forgive them,” says the agonizing Christ, “for they know not what they do.” Those words resonate with my beliefs. This is where I think the church and especially my church, the Anglican Communion, doesn’t have it quite right. Oh, well, they have only had 2000 years to work on it. I didn’t like Hitchens’ highly aggressive antitheism. But he did argue for it out of what he believed was best for the world. I think he was wrong. But despite his insulting manner, I don’t think he wished or sought to do harm as he promulgated his worldview. I like to think he can still make peace with God and even if it is a struggle, he is hopefully with God — if indeed his heart was in the right place. I even sometimes think I like the Roman Catholic notion of purgatory for people like Hitchens. Should I light a candle for him? Dan.","date":"2011-12-16","mins":"11:23 am","url":"https://shroudstory.com/2011/12/16/rip-christopher-hitchens/","cat":"news_&_views","title":"RIP Christopher Hitchens"},{"id":"comment-96244","author":"dan","post":"Yannick, enough is enough. Thibault is right to study scorches. Hugh is right in his criticisms of your endless repetition..","date":"2014-04-03","mins":"5:43 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","title":"Am I the only one?"},{"id":"comment-2571","author":"dan","post":"Great..","date":"2011-02-24","mins":"8:52 am","url":"https://shroudstory.com/2011/02/23/an-exhibit-of-the-shroud-of-turin-at-the-royal-church-of-san-lorenzo/","cat":"other_blogs","title":"An Exhibit of the Shroud of Turin at The Royal Church of San Lorenzo"},{"id":"comment-206839","author":"dan","post":"Assuming, of course, that the Resurrection was a process. And assuming the image is somehow a result of that process..","date":"2015-07-29","mins":"5:11 am","url":"https://shroudstory.com/2015/07/27/and-we-are-all-mathematician-even-if-we-dont-know-it/","cat":"other_blogs","title":"And We Are All Mathematician Even if We Don’t Know It"},{"id":"comment-206826","author":"dan","post":"No ill will. No hostility at all, Dave, and I apologize if I came across that way. I have never seen enough evidence to persuade me that the image was formed by any the agencies or combination of agencies you propose. And I mean that, too, if we understand paint and imprint as a proxy for arts and crafts of any kind: man made if you will. Similarly, I am not persuaded by any natural chemical means including reactions involving ammonia. By light, I assume you mean a portion of the electromagnetic spectrum. By electricity I assume you mean corona discharge, lightening, and all other aspects of the flow of electricity including electromagnetism. I imagine we also need to include all forms of radiation; Your handicapper, Dave, would certainly want to know what all the options are. Be that as it may, I am still not persuaded by any hypothesis or whiff of a suggestion I have seen. I wouldn’t bet so much as a plug nickel on any of these things. The shroud is indeed a great mystery. Hence, my intuitive sense tells me there is something else going on with this image. I just don’t know what. And everything I am saying is not directed at you but at everyone here. Really!!! This is what I think. No. I don’t have any other ideas..","date":"2015-07-29","mins":"4:02 am","url":"https://shroudstory.com/2015/07/27/and-we-are-all-mathematician-even-if-we-dont-know-it/","cat":"other_blogs","title":"And We Are All Mathematician Even if We Don’t Know It"},{"id":"comment-206797","author":"dan","post":"None of them. Really!!! That is what I think. No. I don’t have any other ideas..","date":"2015-07-28","mins":"2:59 pm","url":"https://shroudstory.com/2015/07/27/and-we-are-all-mathematician-even-if-we-dont-know-it/","cat":"other_blogs","title":"And We Are All Mathematician Even if We Don’t Know It"},{"id":"comment-7794","author":"dan","post":"Google Translation of co’s comment: By now, 2012, we are not certain what they are “burned” in the test of C14. As you know I think, sciencebod the Prof.Hull (laboratory of Arizona) recently surprised us by posting in your journal Radiocarbon, who was in possession of one of the pieces of the shroud that everyone thought, because they had Nature, which had been “burned” … … …..","date":"2012-01-31","mins":"5:29 pm","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","title":"Badder Still: Bad Archaeology at Bad Archaeology"},{"id":"comment-11372","author":"dan","post":"And why not?.","date":"2012-05-15","mins":"2:06 pm","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","title":"Comment of the Week by Thibault Heimburger"},{"id":"comment-11569","author":"dan","post":"Let’s try the picture from Wa Po.","date":"2012-05-24","mins":"9:58 am","url":"https://shroudstory.com/2012/05/23/becky-garrison-article-in-killing-the-buddha/","cat":"other_blogs","title":"Becky Garrison Article in Killing the Buddha"},{"id":"comment-7795","author":"dan","post":"There has been a lot of suspicion about Arizona: outliers concealed, material set aside? It may not be significant but it sure raises questions about their adherence to protocol..","date":"2012-01-31","mins":"5:32 pm","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","title":"Badder Still: Bad Archaeology at Bad Archaeology"},{"id":"comment-7796","author":"dan","post":"Exactly. Sciencebod you have no idea what you are talking about..","date":"2012-01-31","mins":"5:34 pm","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","title":"Badder Still: Bad Archaeology at Bad Archaeology"},{"id":"comment-65507","author":"dan","post":"Hi Colin And a Merry Christmas to you Friend. Dan Porter.","date":"2013-12-23","mins":"7:27 am","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-4411","author":"dan","post":"Gabriel, we need your scientific thinking. I do try to keep the blog open to everyone as best I can. I’m thinking of creating a special open thread where message such as ‘saddened’ can be moved because it is so far off topic. Right now, this blog is very successful. According to Alexis it is drawing more hits than the other three top Shroud of Turin websites combined without pulling them down. In the end I hope that is good for science as it pertains to the shroud. Any suggestions?.","date":"2011-10-27","mins":"4:06 pm","url":"https://shroudstory.com/2011/10/26/destroying-the-magic-of-the-shroud-of-turin/","cat":"other_blogs","title":"Destroying the Magic of the Shroud of Turin"},{"id":"comment-3086","author":"dan","post":"Gargoyles are not keeping evil spirits aways from the cathedrals but I still want them there as part of the art..","date":"2011-05-06","mins":"7:45 am","url":"https://shroudstory.com/2011/05/06/comment-of-the-day/","cat":"other_blogs","title":"Comment of the Day"},{"id":"comment-19681","author":"dan","post":"David R, I gather that you won’t admit to bad judgment on this. This comment makes no sense whatsoever, in my judgment, of course..","date":"2012-11-30","mins":"10:40 am","url":"https://shroudstory.com/2012/11/28/david-roemer-will-maybe-present-the-shroud-of-turin-at-the-princeton-club-in-new-york/","cat":"other_blogs","title":"David Roemer will maybe present the Shroud of Turin at the Princeton Club in New York"},{"id":"comment-208272","author":"dan","post":"Yannick, the word is not propaganda. Views and beliefs will do fine. Why use a word that is insulting to people and implies intellectual dishonesty. Show some respect..","date":"2015-08-14","mins":"2:21 pm","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"id":"comment-8028","author":"dan","post":"I know..","date":"2012-02-07","mins":"2:27 pm","url":"https://shroudstory.com/2012/02/07/dont-confuse-him-with-facts-his-mind-is-made-up/","cat":"other_blogs","title":"Don’t confuse him with facts, his mind is made up"},{"id":"comment-160934","author":"dan","post":"Max, is a simple photograph of one of the pages a possibility? I’ll post it..","date":"2014-10-10","mins":"4:35 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-159471","author":"dan","post":"Posted on behalf of Yannick: “Hi again Mr. Zias! In a study done by Dina Teitelbaum concerning the practice of ossuary burials (link : http://www.collectionscanada.gc.ca/obj/s4/f2/dsk2/ftp04/mq22102.pdf), she mention the finding of Haas: « Dried herbs were sprinkled afterwards on top of the collected bones. Apparently, people used different spices and ointrnents, for example myrrh and aloes. (note : Bunches of withered flowers were found in ossuaries among bones – Haas, “Giv’atha Mivtarw, 38 40. Spices and embalment rnay have been an act of deference to the deceased, and for improving the srnell; see Zlotnick, Mourninq, 16 1 n.9). » Then, she wrote : « The next citation leads to the conjecture that eventually only dried herbs were permitted: “The bones may be sprinkied with wine and oil.” So Rabbi Akiva. Rabbi Simeon ben Nannas says: “Oil, but not wine, because wine evaporates.” “Neither wine nor oil”, Say the Sages, “because these only invite Worms, but dried herbs may be put on them.” Sem 12.9 Following this interesting part of Mrs. Teitelbaum’s paper, I have some good questions for you : 1 Is it possible that the so called flowers and wheat found by Haas were truly what he thought but that it was a very exceptional practice that was only confirm for this specific case? Note : The same good question can truly be asked in the case of the nailing of Jehohanan through the heel bone! 2 Sub questions : In how many ossuaries did Haas found out these botanical species? Beside the tomb where Haas made his finding, are you aware if there were any other botanical discoveries like that in other ancient tombs or ossuaries? 3 Concerning the Jewish quote given my Mrs. Teitelbaum, which indicates that only dried herbs could be sprinkled over the bones, is it possible that, in most cases, this had nothing to do with flowers or wheat, but concerned some particular species of dried herbs (maybe spices more than anything) usually used for burials?” And here’s what he wrote to me: « Shalom, some of this requires me going to a library and remember I left the IAA in 97, due to religious folks changing the laws. As for question one and two, one has to read the entire Haas article in I Ej to see why he is almost never quoted. As for three, there is often quite a difference in what is perceived and what is written in a biblical sense. In ossuaries, we find stones, animal bones, in fact, in one ossuary we found remains of 8 individuals. It was done in a dark cave and whatever wasn’t moving got put in. There is some evidence in but a few ossuaries that some liquid was poured over the bones, but no one ever tried to find which. » After this, I sent him this new email: « Then I must understand that what Haas took for flowers and cereals was surely something else, probably what you say to me (remains of roots or plants that were growing near the tomb). Nevertheless, I have to say that some people to whom I talked about this particular hypothesis of yours have remained skeptical about that… » And here’s the short reply I received from Mr. Zias: « These skeptics have never cleared nor seen an ossuary in situ… ».","date":"2014-10-05","mins":"6:50 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-11381","author":"dan","post":"I’m on it. Thanks, Thibault..","date":"2012-05-16","mins":"6:35 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","title":"Comment of the Week by Thibault Heimburger"},{"id":"comment-158300","author":"dan","post":"Posted on behalf of Yannick who cannot comment on this site: After having read a few comments in link with my guest post, I would like to ask 2 questions to those who still wants to see flowers and coins images on the Shroud : 1 If the Shroud is authentic like you obviously believe, then how in the world those who did the burial (which would have been all first century Jews obviously) would have lose time picking flowers outside the tomb, while this kind of action was not at all common in their culture when it comes to burying their dead (even if there could have been some exceptions in history, the fact remains that flowers were not part of a normal Jewish burial at that time and even today) and also while they were in a hurry because of the coming of the Sabbath? 2 Why those who did the burial would have lose time placing coins or any other material thing to cover the eyes of the Shroud man, while the whole shroud itself was covering all his body, including his eyes? Sub question: If the purpose of placing these things over the eyes was just to make sure they would not open, then again, I ask the question: why doing this while the whole shroud itself was covering all his body, including his eyes? Another sub question, just in case some people think these coins would have been part of a burial ritual: Taking into account the historical fact that coins were placed inside the mouth during Pagan burial rituals, why in the world these Jews would have placed coins over the eyes of the Shroud man instead of in his mouth if they really wanted to perform such a Pagan ritual? I can’t wait to see someone giving me a RATIONAL answer for all these good questions….","date":"2014-10-01","mins":"6:04 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-159468","author":"dan","post":"Posted on behald of Yannick: ” Hello folks! Following my last 2 replies that Dan kindly posted for me on the blog, I reflect again on the whole subject and I now think that there’s a slim possibility that things like flowers and coins (or some other material objects covering the eyes) could have been used in the particular case of the Shroud man, simply because those who did the burial knew they had to comeback and re open the shroud. In such a context, we can think they could have used flowers to help remove some bad smells and they could have used « something » (whether it’s coins or pieces of ceramic or something like that) to make sure they wouldn’t see the eyes open when they would re open the cloth. But having said that, I have to underline the fact that these 2 hypotheses must be considered as being highly improbable for at least 2 good reasons : 1 These kind of « procedures » were not part of the First Century Jewish culture when it comes to burial rituals, at the exception of maybe some very scarce examples here and there (which could well have come from very hellenized jews by the way). On that question, sorry but I prefer to rely on the professional opinion of Joe Zias, who is a real Jewish achaeologist who spent all his life diging ancient Jewish tombs than, let’s say, Max Patrick Hamon… Important note about Mr. Zias : I’m fully aware that he’s not at all a partisan of the authenticity of the Shroud, but I don’t see why his opinion on this topic should affect in any way his professional knowledge of the most common Jewish burial procedure in the time of Christ (which did not included the use of flowers, not the use of coins or any other things to cover the eyes of the dead). Also, I need to underline the fact that even if there could be some examples of possible uses of flowers and coins (or any other things covering the eyes) during ancient Jewish burials coming from archaeological findings, these are obviously exceptions that confirm the rule, because, to my knowledge, withered flowers have only been found in one particular tomb (in some ossuaries and not in a burial shroud, which refers to a different part of the whole Jewish burial procedure!) and coins have only been found in 2 different tombs (and they were placed singly inside the mouth and not over the eyes). And concerning the eyes, I’m not aware of any archaeological finding in Israel that would have lead the scientist to conclude that the eyes of the dead were covered with material things to make sure they would not open suddenly… So, in such a cultural context where these kind of burial procedure were surely done only on very rare occasion, I think it’s fair to consider improbable a scenario in which those who would have done the partial preparation of the body would have thought of doing these unusual « procedures »… 2 If there would have been flowers, coins or any other material things over some parts of the Shroud man’s body, including the eyes, then we must expect that absolutely no yellowing of fibers would have happened in these places, because we know for a fact that even a very thin layer of serum was enough to prevent any image formation on the cloth’s surface. Of course, since we don’t knowfor sure what was the real process that lead to the image formation, we must remain prudent here, but in my mind, there’s only one slim possibility that a mild chemical process could have produced at the same time a body image and images of flowers and/or coins on a linen cloth and it’s to think that a yellowing of fibers would have been produced by the interraction of some highly volatile and reactive burial product(s) that would had been sprinkled over the corpse (and therefore, over the flowers and/or the coins or any other thing covering the eyes) just before the end of the partial burial procedure and a thin layer of carbohydrate impurities located on the top surface of the cloth, thus creating not only an image of the body on the cloth, but also images of these flowers and/or coins (or any other thing covering the eyes). In such a scenario, it would be the burial product(s) that would have acted as the sole « catalytic compound » that would have lead to the yellowing of a portion of the topmost fibers of the cloth. But having given you this possible scenario, I must admit that this seems to me as being quite far fetched and that’s why I still believe that this second reason I just gave you is a very good one to think these hypotheses are highly improbable… In the end, it’s evident that, regarding the hypotheses I discussed in my guest post, it’s impossible to be 100% sure about their inaccuracy, considering the present state of our knowledge. To discard them for good, we would need to make an in deep analysis (including a chemical investigation and a very high resolution imagery analysis) of the areas where some people claim to see flower images and coins inscriptions. But having said that, I think the 2 reasons I just gave you are strong enough to at least consider these hypotheses as highly improbable IN THE PRESENT STATE OF OUR KNOWLEDGE. Maybe the future will prove I was wrong of thinking this, but when I consider the known cultural context in which ancient Jewish burials were normally performed (which normally do not included the use of flowers and coins or other things covering the eyes, at the exception of the very scarce examples that archaeologists have found in one or two ancient tombs) and when I consider the fact that even a thin layer of serum located between the corpse and the cloth’s surface was enough to prevent any yellowing of fibers, I’m not ready to change the highly improbable estimation I reached (which must be, I’m sure, better for Max, Hugh, Domenico and some other people than if I said « the probability is equal to absolute zero »). Let’s wait until new direct researches could be done on the Shroud and, at that moment, we’ll surely have a better idea if my estimation was right or wrong…”.","date":"2014-10-05","mins":"6:47 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-158299","author":"dan","post":"Posted on behalf of Yannick who cannot comment on this site: I’ve read your interesting comment following my guest post and I decided to go ahead and ask Mr. Zias about the particular quote you gave us. Here’s what he just told me via email: « He (Domenico) probably got it from Haas and what he (Haas) mistook for flowers were probably remnants of decayed roots from plants/ trees which had infiltrated from above the tomb. Even today when Jews place flowers on graves here in Jerusalem, the burial society removes them when the mourners have left. » Then, I sent this email to Mr. Zias: « Thanks for your fast answer… So, to complete your thought on this topic, would you say that there is no solid archaeological (and historical as well) indications that the Jews of the first century were using flowers and/or plants during the enshrouding procedure of the body and that there is no more solid indications that they were using these botanical species when they were placing the bones of their deads in ossuaries? I just want to be certain that I understand you correctly… » His reply was short but confirmed that I understood him correctly. He said: « This is correct. » Finally, I sent him one last message: « So, since no flowers or plants were used in ancient Jewish burials, we can say that today’s Orthodox Jews have been able to keep this ancient tradition up until today, right? I say this because it is a fact that in today’s Orthodox Jewish burials, no botanical species are used. » And here’s what he told me (which confort even more my impression that, inside the Shroud, there was only the Shroud man’s body and nothing else): « Correct. In Jerusalem today, it’s much as it was back then : no casket, no embalming, body is washed, wrapped in the shroud, covered, carried on a stretcher and buried. Psychologically i think its healthier, no illusion that one went to sleep as is the case in the US. In fact, here burial costs are picked up by the state whereas in the US costs thousands of dollars to be buried as on co. Bought most of the cemeteries in the US, its thus a monopoly on the burial game. » And here’s one last note concerning the washing procedure : Despite what Mr. Zias just told me concerning the usual washing of the corpse prior to be placed inside a burial shroud, I still believe, like Barbet and other specialists, that in the particular case of the Shroud, the man’s body was still unwashed when he was placed inside the cloth, mainly because of the kind of blood and serum stains we see on the cloth (which came from moistened blood clots and not from liquid blood) and also because of the few traces of dirt that were found in specific areas of the body image….","date":"2014-10-01","mins":"6:01 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-160131","author":"dan","post":"Posted on behalf of Yannick who cannot comment in this blog: Hi Max! Concerning your questions, I would answer this: Question 1: After having exchanged a lot on the subject with Mr. Zias and after learning the FACT that there’s only TWO CASES where coins have been found in situ inside ancient Jewish skulls, I came to believe (just like Zias by the way) that this must have been a very rare practice in ancient Israel and, personally, I came to the rational conclusion that, in these rare cases where Jews placed coins on the body of their dead (whether it was in the mouth, which seem to be the most common “pagan” ritual, or over the eyes), it is most probably due to the fact that these particular Jewish burials were done by hellenized Jews greatly influenced by pagan culture and pagan beliefs. This seem highly logical to me, because we know for a FACT that, during that era, there really was in Israel some Jews (mostly from the high class by the way, including some members of the Saducees, but most probably not Pharisees, who respected much better their ancient traditions) who adopted the Greco Roman lifestyle. We also know for a FACT that these hellenized Jews were in minority among their Jewish brothers and sisters. In such a context, I think it’s fair to assume that including some pagan rituals in a Jewish burials (like the use of coins and probably also the use of flowers) must have been very rare and must have come, in most cases, from these hellenized Jews. What’s illogical in that kind of reasonning? Question 2: If Zias and other colleagues came to this surprising conclusion, it’s mostly because of the reasonning I just exposed you, which is based on the FACT that, during that period, most Jews were not hellenized Jews and must have been very respectfull of their culture and tradition when it comes to burial procedures, which didn’t normally included the use of flowers, coins or any other object over the eyes. The other basis for such a conclusion comes from the FACT that all these coins were not found in situ but elsewhere in the tombs, except for the cases of the two coins found in ONE skull in Jericho and another one found in ONE skull in Caiaphas tomb. Personally, I think some of these other coins (those not found in situ) can well have been originally placed on the dead, but who can be sure about that? And even if that would be the case, these cases where coins were found in some tombs do not represent a majority, or else, archaeologists would surely have come to the conclusion that the use of coins was common in ancient Jewish burials… The truth is that I’m not aware of any archaeologist expert in Biblical archaeology who believe this pagan practice was common in Israel during the Second temple period. If I’m wrong here, please prove it by giving me some quotes taken from papers or books written by REAL archaeologists expert in Biblical study that would clearly state that this was a common practice among Jews of that time to use coins during their burial procedure… Important note: even if Sir James George Frazer, who was not an archaeologist but an anthropologist and who, unlike Zias, did not digged ancient Jewish tombs in Israel, thought that practice of placing coins or potsherds over the eyes of deceased Jews was common in Antiquity, this is surely not the general opinion defended by the vast majority of Jewish archaeologists and anthropologists today. Just read this quote from Wikipédia concerning Charon’s obol, which represent the general conclusion of modern experts (at least, those not influenced at all by the Shroud) on this topic (which is the roughly the same exposed to me by Zias the other day): “Jewish ossuaries sometimes contain a single coin; for example, in an ossuary bearing the inscriptional name “Miriam, daughter of Simeon,” a coin minted during the reign of Herod Agrippa I, dated 42/43 AD, was found in the skull’s mouth. Although the placement of a coin within the skull is UNCOMMON in Jewish antiquity and was potentially an ACT OF IDOLATRY, rabbinic literature preserves an allusion to Charon in a lament for the dead “tumbling aboard the ferry and having to borrow his fare.” And concerning the specific use of coins over the eyes, here’s another interesting and very telling quote taken from the same Wikipedia page, which express, once again, the most common conclusion among experts: “Only RARELY does the placement of a pair of coins suggest they might have covered the eyes. In Judea, a pair of silver denarii were found in the eye sockets of a skull; the burial dated to the 2nd century A.D. Occurs within a Jewish community, but the religious affiliation of the deceased is UNCLEAR. Jewish ritual in antiquity did not require that the eye be sealed by an object, and it is debatable whether the custom of placing coins on the eyes of the dead was practiced among Jews prior to the modern era. During the 1980s, the issue became embroiled with the controversies regarding the Shroud of Turin when it was argued that the eye area revealed the outlines of coins; since the placement of coins on the eyes for burial is not securely attested in antiquity, apart from the one example from Judea cited above, this interpretation of evidence obtained through digital image processing CANNOT BE CLAIMED AS FIRM SUPPORT for the shroud’s authenticity.” Question 3: Read again my recent post: “I’m fully aware that he (Zias) is not at all a partisan of the authenticity of the Shroud, but I don’t see why his opinion on this topic should affect in any way his professional knowledge of the most common Jewish burial procedure in the time of Christ (which did not included the use of flowers, not the use of coins or any other things to cover the eyes of the dead).” On the contrary, when it comes to questions directly related to the Shroud, I’m much more prudent versus what he can think or conclude… But on the particular topic concerning the question of whether or not flowers and coins were commonly used in ancient Jewish burials (which is a topic not directly in link with the Shroud), I have no reason to doubt his professional opinion. Note also that, in my recent post, I do not reach the kind of drastical conclusion Zias reached when it comes to the Shroud… In other words, Zias would say something like: “The use of flowers and coins was not part of the common Jewish burial in the time of Christ; therefore there is SURELY no images of things like that on the Shroud”, while I conclude this instead (which is a much more “balanced” and “open” conclusion): “Maybe the future will prove I was wrong of thinking this, but when I consider the known cultural context in which ancient Jewish burials were normally performed (which normally do not included the use of flowers and coins or other things covering the eyes, at the exception of the very scarce examples that archaeologists have found in one or two ancient tombs) and when I consider the fact that even a thin layer of serum located between the corpse and the cloth’s surface was enough to prevent any yellowing of fibers, I’m not ready to change the highly improbable estimation I reached.”.","date":"2014-10-07","mins":"10:49 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-8549","author":"dan","post":"Colin, we’ve been here before. Of course, you will get 3 D relief from any scorch. You;ve told me that and I have always agree. You’ll get it from a drop of ink on blotter paper. You’ll get it from squished bugs and bloodstains and any spot that is lighter or darker than its surroundings. Duh! There is nothing magical about this. You get it from paintings and photographs, too. In demonstrating the old VP8 they would use a chess board. The whole point is do you get 3 D that looks realistic for what is being plotted, in particular a face or a human body. It is a judgment call. And adjusting the gain and the blur is not only permissable, but expected. As for the fluorescent ghostly green screen, maybe you’re too young to remember old fashioned dumb terminals with their fluorescent ghostly green screen. It wasn’t made for TV..","date":"2012-02-20","mins":"2:40 pm","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","title":"Image by scorching heat? Or science by hot air?"},{"id":"comment-35343","author":"dan","post":"Right. I should have called this post “Nonsense of the Day.” But I like the comments that are there..","date":"2013-05-30","mins":"9:15 am","url":"https://shroudstory.com/2013/05/30/how-can-you-argue-with-this/","cat":"other_blogs","title":"How can you argue with this?"},{"id":"comment-134852","author":"dan","post":"It was the picture that got me laughing, not the idea of false imaging from compression. The shaving cream idea came from the other picture. I’m still laughing at the silly little girl..","date":"2014-07-02","mins":"7:46 am","url":"https://shroudstory.com/2014/07/02/is-the-beard-of-the-man-of-the-shroud-an-impactogram/","cat":"other_blogs","title":"Is the beard of the man of the shroud an impactogram?"},{"id":"comment-174975","author":"dan","post":"Todd, I am the moderator of this blog. Your monetary offer is not trivial and therefore poses potential problems. If you want to make such an offer, find another venue. I am removing any reference to it. On other things you are saying, we don’t know “that no one on earth can currently explain the UNIQUE PROPERTIES of the shroud.” There is no way to know that. Do not demand proof to the contrary because you must bear the burden of proof if you make the statement. And what do you mean by unique properties? Which ones? Statements like, “As a matter of fact. The Shroud image cannot be explained by physics,” is simply wrong. Can you prove that? In fact, the image can be explained by physics. What may not be explainable is how the image got there on the cloth. You statements about photographs or paintings comes from a lot of old, maybe out of date, attempts to explain that the body images are some sort of brightness maps or height fields that can be plotted as 3 D objects. I get it and I do think it is quite mysterious. But you are misstating the situation. I would recommend that you don’t use such bullying language as talk is cheap. It is insulting..","date":"2014-12-06","mins":"3:02 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-175047","author":"dan","post":"Interesting because the picture is the plot made from sonagram data where brightness represents distance. I wish I had the source data, in effect the 2 D picture. I’m looking for it..","date":"2014-12-07","mins":"1:21 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-174981","author":"dan","post":"It is not to be refuted. It simply is not correct. Who told you that physics has not presented an explanation? You can’t go around saying “as far as I am aware” and then ask people to refute it. You might as well say that as far as you are aware the world is flat and think it so unless someone refutes it. Virtual reality and gaming software regularly uses 2 D height field images to produce realistic looking 3 D landscapes. NASA uses them to generate 3 D surface representations of the moon and planets. Those height fields are created by radar and lasers. Google Earth software makes 3 D renderings of our planet from 2 D heigh field images. NOAA produces 3 D images of hurricanes from radar data represented in 2 D images. Height fields are regularly used in new generation 3 D ultrasound sonograms..","date":"2014-12-06","mins":"4:25 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-5527","author":"dan","post":"No, Max, it is simply silly fad art built into a toaster. It is not pareidolia, pseudo or otherwise. As for negative pareidolia, I have no idea what you are talking about. Dan.","date":"2011-12-14","mins":"9:36 pm","url":"https://shroudstory.com/2011/12/14/jesus-toasters-of-course-someone-would-think-of-it/","cat":"other_blogs","title":"Jesus Toasters: of course someone would think of it."},{"id":"comment-3106","author":"dan","post":"I’ve read many books about why God doesn’t exist. If I get a chance this summer I’ll download yours and read it. But that isn’t the issue here. I wondered about you not looking at all the evidence on the carbon dating. — Dan.","date":"2011-05-10","mins":"9:50 am","url":"https://shroudstory.com/2011/05/09/lawyer-jack-lemoult-wonders-why-catholics-go-on-believing/","cat":"other_blogs","title":"Lawyer Jack LeMoult Wonders Why Catholics Go On Believing"},{"id":"comment-212234","author":"dan","post":"Actually, Jim, the Rev. Albert Dreisbach is an Episcopal PRIEST. Actually, all ordained Anglican clergy (the Episcopal Church in the United States is part of the Anglican Communion) are part of the threefold order of bishops, priests and deacons. Their vocational attire, when not in vestments, for both male and female deacons, priests and bishops is pretty much the same, a shirt or blouse with a clerical collar, either the full band collar or the tab collar. The shirt is usually black but may be other colors. Bishops frequently wear magenta or purple shirts. It is perfectly acceptable to call an Episcopal priest father. In fact, Fr. Dreisbach, Fr. Kim, or just Father are preferred but not mandatory forms of address. Most women priest prefer to be addressed as Mother but a few prefer the title Father, which is perfectly acceptable. Deacons who wear the same attire are not addressed by Father. Bishops may be addressed as Father, Bishop (generally preferred) your Excellency, your Grace, etc. According to Wikipedia: “Today the term “priest” is used in Catholicism, Eastern Orthodoxy, Anglicanism, Oriental Orthodoxy, The Church of the East, and some branches of Lutheranism to refer to those who have been ordained to a ministerial position through receiving the sacrament of Holy Orders, although “presbyter” is also used.[16] Since the Protestant Reformation, non sacramental denominations are more likely to use the term “elder” to refer to their pastors.”.","date":"2015-10-10","mins":"10:01 am","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","title":"No Closer to the Truth Because of Simony"},{"id":"comment-191066","author":"dan","post":"The purpose of having pictures in the comments is to support discussions about the shroud and related subjects. It is not for silly cartooning. They will likely be deleted from now on..","date":"2015-02-14","mins":"5:28 pm","url":"https://shroudstory.com/2015/02/14/on-deaf-ears-here/","cat":"other_blogs","title":"On Deaf Ears Here?"},{"id":"comment-52436","author":"dan","post":"Stephen has changed the wording. It now reads, “as per the Vatican’s policy of refusing to confirm or deny that any Catholic relic is authentic (including the Shroud of Turin)”. Much better!.","date":"2013-11-22","mins":"5:00 pm","url":"https://shroudstory.com/2013/11/22/quote-for-today-13/","cat":"other_blogs","title":"Quote for Today"},{"id":"comment-46462","author":"dan","post":"Max, I find a crucifixion scene with Jesus partly clothed and nailed through the wrist with thumbs and all. I don’t see a naked back view. Do you have a URL?.","date":"2013-10-08","mins":"6:34 am","url":"https://shroudstory.com/2013/10/06/one-persons-take-away-from-a-shroud-lecture/","cat":"other_blogs","title":"One Person’s Take Away from a Shroud Lecture"},{"id":"comment-12914","author":"dan","post":"Yawn. Dan Porter (Dictated to Siri on i Phone).","date":"2012-06-22","mins":"2:06 pm","url":"https://shroudstory.com/2012/06/22/shroud-congresses-places-where-fantasies-are-peddled/","cat":"other_blogs","title":"Shroud Congresses – Places where fantasies are peddled?"},{"id":"comment-205367","author":"dan","post":"Thank you..","date":"2015-07-12","mins":"5:26 am","url":"https://shroudstory.com/2015/07/12/the-meaning-of-solid/","cat":"other_blogs","title":"The Meaning of Solid"},{"id":"comment-56316","author":"dan","post":"I get the buffet line analogy. And I agree with you. I think this is a major weakness in the way Jones looks at authenticity. However, I don’t get the You Tube significance. It seems a bit insulting to Jones without any real basis. What do you think?.","date":"2013-12-04","mins":"10:32 am","url":"https://shroudstory.com/2013/12/03/the-science-of-logical-forensics/","cat":"other_blogs","title":"The Science of Logical Forensics"},{"id":"comment-34127","author":"dan","post":"This is NOT SCIENCE. Seeing things or photographing them by looking at an LCD at an angle is like a mirage, an optical illusion in which light rays are bent to produce a false image. Vinny, you are not seeing Jesus alive or seeing his signature or even really a negative. I’m sorry..","date":"2013-05-20","mins":"11:38 am","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"},{"id":"comment-147724","author":"dan","post":"Where do you think I stole the wording? From Colin Berry?.","date":"2014-09-01","mins":"6:43 am","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","title":"Time will tell."},{"id":"comment-156595","author":"dan","post":"I guess I didn’t see how pervasive Facebook was because like most people in the world I’m logged in all the time to keep up with my children and grandchildren..","date":"2014-09-26","mins":"5:58 am","url":"https://shroudstory.com/2014/09/26/to-be-lost-in-a-sea-of-trolls-and-spam/","cat":"other_blogs","title":"To be lost in a sea of trolls and spam"},{"id":"comment-73860","author":"dan","post":"Take a day off. Take a couple of days. Things are going to get crazy around here shortly and you’ll want to be around. And we want you around..","date":"2014-01-20","mins":"5:06 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-58902","author":"dan","post":"Please Only Discuss Michael Jude’s Book and Claims HERE.","date":"2013-12-13","mins":"1:01 pm","url":"https://shroudstory.com/2013/12/13/update-at-the-holy-shroud-guild/","cat":"other_blogs","title":"Update at The Holy Shroud Guild"},{"id":"comment-152448","author":"dan","post":"Reblogged this on Best of Shroud Story..","date":"2014-09-19","mins":"6:04 am","url":"https://shroudstory.com/2013/12/15/well-no-you-cant-call-him-a-catholic-wingnut-wingnut-yes/","cat":"other_blogs","title":"Well, no. You can’t call him a Catholic Wingnut. Wingnut? Yes!"},{"id":"comment-73198","author":"dan","post":"Diane has corrected the website. She wrote to me and I wrote back to her. I told her she was always welcome on the blog and could ask questions of us. Andy, I have followed the work of Dr. Soons. I don’t doubt his honesty. But I’m most cautious about the conclusions he arrives at. Type in “Soons” in the blog search field to see prior discussions. Dan.","date":"2014-01-13","mins":"12:22 am","url":"https://shroudstory.com/2014/01/11/you-do-not-like-them-so-you-say-try-them-try-them-and-you-may/","cat":"other_blogs","title":"You do not like them. So you say. Try them! Try them! And you may"},{"id":"comment-73881","author":"dan","post":"Not that crazy..","date":"2014-01-20","mins":"8:29 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."}]
