[{"id":"comment-196853","author":"dan","post":"William, you are out of line. In this blog we don’t use scripture as a whack a mole paddle..","date":"2015-04-19","mins":"2:48 pm","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-80359","author":"dan","post":"Does anyone have a link?.","date":"2014-02-18","mins":"11:44 am","url":"https://shroudstory.com/2014/02/18/barrie-schwortz-will-appear-on-coast-to-coast-am-with-george-noory/","cat":"news_&_views","title":"Barrie Schwortz will appear on Coast to Coast AM with George Noory"},{"id":"comment-28919","author":"dan","post":"Colin, you have made some good points in this thread and they are appreciated. I agree with much, but not all, of what you have to say in comment #20. You obviously think clearly and explain yourself well. We all benefit from that. So why resort to name calling and insults as you have done in #23 and #25? I warned others after complaints from you and now I am asking you to dial it down a bit..","date":"2013-03-31","mins":"3:48 am","url":"https://shroudstory.com/2013/03/29/barrie-schwortz-biggest-issue-so-far-seems-to-be-the-validity-of-fantis-samples/","cat":"news_&_views","title":"Barrie Schwortz:  Biggest issue so far seems to be the validity of Fanti’s samples"},{"id":"comment-9471","author":"dan","post":"I just put in a better link that bypasses about.com. Sorry about that..","date":"2012-03-20","mins":"10:08 am","url":"https://shroudstory.com/2012/03/20/interview-with-barrie-schwortz-in-intrepid/","cat":"news_&_views","title":"Interview with Barrie Schwortz in Intrepid"},{"id":"comment-28922","author":"dan","post":"I have asked Stephen to stay. And I’m asking you to stay. Happy Easter..","date":"2013-03-31","mins":"4:04 am","url":"https://shroudstory.com/2013/03/29/barrie-schwortz-biggest-issue-so-far-seems-to-be-the-validity-of-fantis-samples/","cat":"news_&_views","title":"Barrie Schwortz:  Biggest issue so far seems to be the validity of Fanti’s samples"},{"id":"comment-73160","author":"dan","post":"There is no connection except in the faith journeys of some of us. Some look to the shroud for reassurances about their beliefs in the incarnation and the resurrection. Some people, frequently fundamentalist Protestants, find that deplorable. Others look to NDE/ODE experiences for similar reassurances. And, of course, some find that deplorable even as NDE books are becoming a best selling genre. I find neither subject positively reassuring or deplorable for my faith journey. Both are interesting. I knew a Catholic priest who would go on and on about the faith inspiring value of the shroud; but mention ND Es and he almost foamed at the mouth calling the subject heresy. A good friend of his, a devout Presbyterian minister, felt just the opposite. In the two subjects they found common ground and they loved to argue about both subjects. They are subjects that many scientists claim are scientific while numerous other scientists claim otherwise. That is the best I can do..","date":"2014-01-12","mins":"10:29 am","url":"https://shroudstory.com/2014/01/12/barrie-schwortz-tedx-talk-featured-on-nde-site/","cat":"other_blogs","title":"Barrie Schwortz’ TEDx Talk Featured on NDE Site"},{"id":"comment-11596","author":"dan","post":"Why Catholic? Why not Episcopalian?.","date":"2012-05-25","mins":"1:34 pm","url":"https://shroudstory.com/2012/04/21/rosetta-correa-interviews-barrie-schwortz/","cat":"news_&_views","title":"Rosetta Correa interviews Barrie Schwortz"},{"id":"comment-198613","author":"dan","post":"Okay, Max. Next time we are in the same city at the same time I’ll buy you a drink..","date":"2015-05-08","mins":"9:01 am","url":"https://shroudstory.com/2015/05/08/a-folding-method-charles-freeman-might-accept/","cat":"news_&_views","title":"A Folding Method Charles Freeman Might Accept"},{"id":"comment-15729","author":"dan","post":"Good catch, Ron. Thanks..","date":"2012-09-02","mins":"1:39 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-147053","author":"dan","post":"Colin, it is not about you or your blog. It is whatever “pops up on the radar,” for instance Google Blog Search or news search, etc. If it is public, interesting, not too far off the planet, etc. Then I bring it up. It is not about you. If you write about the shroud in public space and because you are making significant contributions, I am going to bring it up. You have some options. Don’t be provocative or interesting. Ask the search engines to not index your pages. Make you blog private. Ignore me. Anyways, enjoy the Caucasus..","date":"2014-08-29","mins":"5:45 am","url":"https://shroudstory.com/2014/08/28/a-response-to-a-comment-by-colin-berry/","cat":"uncategorized","title":"A Response to a Comment by Colin Berry"},{"id":"comment-76391","author":"dan","post":"Andy, last week I received a cortisone injection in the spinal canal of the low back for sciatica. I never knew an injection that went on and on for several minutes could be so painful. It worked slowly. A week ago, walking was the act of dashing to the closest chair. Now I’m walking the dog and enjoying it. Colin is an epidural like pain in the butt that goes on and on. But he makes a wonderfully useful contribution to the discussion. That doesn’t mean I accept much of anything he has to say. I don’t. Not yet. I’m open to being convinced. He makes me think, however. For instance, how sure are we that there is no image underneath bloodstains?.","date":"2014-02-04","mins":"4:34 am","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","title":"Colin Berry on Rogers’ Thermochimica Acta Paper"},{"id":"comment-143536","author":"dan","post":"Reblogged this on Best of Shroud Story..","date":"2014-08-12","mins":"9:03 am","url":"https://shroudstory.com/2014/08/05/5050-colin-berrys-most-outlandish-proposal/","cat":"other_blogs","title":"50/50  :  Colin Berry’s Most Outlandish Proposal"},{"id":"comment-75509","author":"dan","post":"Colin, I’ll concede that I threw in the “the” in “the long term editor.” It was careless for I meant “the wording long term editor.” But you’re playing semantic games. Thermochimica Acta currently has three editors and a long list of people serving on an editorial board. Actually, there is no editor in chief, to use your wording. And as I look at several journals I find similar pattern. The fact of the matter is that Rogers served the community by being part of what is a board not a position, probably well and probably very honorably. There was absolutely nothing wrong with him submitting to that journal. There was nothing wrong with the journal publishing because of his prior association. Your criticism is simply petty as I confess mine was of Jull. Or do you think Jull and his journal was wrong?.","date":"2014-01-31","mins":"5:43 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","title":"Colin Berry on Rogers’ Thermochimica Acta Paper"},{"id":"comment-84285","author":"dan","post":"Colin, do what you must, but do it elsewhere..","date":"2014-03-02","mins":"10:34 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","title":"Colin Berry on Rogers’ Thermochimica Acta Paper"},{"id":"comment-47797","author":"dan","post":"Colin wants to know, “So what’s happened to that handy listing of “Latest Comments” in the sidebar?” Recent Comments. It is there, right under Recent Posts..","date":"2013-10-17","mins":"4:14 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","title":"Colin Berry: The 1532 fire  was no accident"},{"id":"comment-47804","author":"dan","post":"That’s funny. It works fine with Internet Explorer 10 but not with Chrome 30. I don’t have Firefox on this machine. I’ll contact support if it doesn’t clear up in a while..","date":"2013-10-17","mins":"4:39 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","title":"Colin Berry: The 1532 fire  was no accident"},{"id":"comment-47807","author":"dan","post":"Boy, I can’t type today. First cataract comes out on the 30th so I’ll then be able to see my typing before posting..","date":"2013-10-17","mins":"4:45 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","title":"Colin Berry: The 1532 fire  was no accident"},{"id":"comment-47806","author":"dan","post":"I’m getting the same on my wife’s lapton. And it is broken on Safari running on an i Pad. So I’m going to durect this problem over to wordpress. At least Max can’t have all the entries for a while..","date":"2013-10-17","mins":"4:44 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","title":"Colin Berry: The 1532 fire  was no accident"},{"id":"comment-25037","author":"dan","post":"Paulette. I am talking about the reading style. I love it. As for the excessive acerbity, you may be right. A change in that might result in improved readership and participation. One of my original goals when I started blogging was to include skeptics or the shroud in open conversation. I am not, as Colin says, “providing a billboard for the promoters of Shroud authenticity and all the proselytising baggage that comes with it.” I find it puzzling when Colin writes of me, “Why should it matter to him where the Russ Breault Shroudie roadshow is next appearing, or whether STERA Inc. Gets voluntary donations on top of its licensing copyright fees?” Does he think that I wouldn’t advertise a skeptic’s “Shroudie roadshow,” as well? Russ and Barrie Schwortz are good personal friends and so I do care. They know I am more about wanting the truth about the shroud than anything else. And by the way, my wife and I have only met Thibault once, in Ohio in 2008; what a great guy, we said to each other after we parted. I’d love to sit down with Colin for a drink and some talk. Who knows, we might become friends. I have good friends and familiy members who are 100% skeptical about the shroud. So what? So, let’s hope..","date":"2013-02-20","mins":"10:54 am","url":"https://shroudstory.com/2013/02/20/colins-new-blogging-style/","cat":"other_blogs","title":"Colin’s New Blogging Style"},{"id":"comment-539","author":"dan","post":"The link to my site seem to not work..","date":"2012-08-21","mins":"10:38 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/21/dan-porter-and-his-2002-long-bet10-years-on-was-he-right-i-say-no-time-has-proved-him-spectacularly-wrong/","cat":"criteria","title":"Dan Porter and his 2002 Long Bet,10 years on. Was he right? I say NO.Time has proved him spectacularly WRONG…"},{"id":"comment-5","author":"dan","post":"Welcome to the fray. It should be fun. It should help to keep the conversation going and help those of us who believe first and foremost that determining the truth about the shroud is important. Dan Porter.","date":"2012-02-13","mins":"12:48 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/12/hello-all-you-shroud-sceptics-out-there/","cat":"cellulose","title":"Hello, all you Shroud sceptics out there"},{"id":"comment-9441","author":"dan","post":"I agree. It is not going anywhere..","date":"2012-03-19","mins":"4:31 am","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","title":"Welcome to Colin Berry’s new Straw Shedder blog"},{"id":"comment-9415","author":"dan","post":"Colin, we don’t know how the image is formed. Oh, yes, some of us may have pet theories, favorite hypotheses. Some of us day dream about possibilities – the mustard seed of science. We have taken up the challenge and so far have failed. We don’t know how the image is formed. Nor do you. We admit it freely. You do not. What have you done? You’ve scorched some linen. You’ve shown that it can produce a negative image. Good start. But can scorching produce a superficial image? You have tried to show that it can by scorching an onion skin, easily 1000 times as thick as the image, placed over a piece of linen and shown that the linen underneath was not scorched. That experiment is fraught with so many problems that it cannot even be thought of as a scientific experiment. (One might even suspect that there was some confusion between microns and nanometers). On the other hand Di Lazzaro showed and explained why scorching could not produce a superficial image on a fiber. Unable to criticize his work, you, like the creationist scientists who ignore fossil records while claiming that dinosaurs walked the earth among the offspring of the biblical Adam and Eve less that 10,000 years ago, have decided to simply ignore factual scientific observations. You write, “If you can’t, then stop expressing surprise and dismay that I should continue to assert that we are looking at a contact scorch. Instead be thinking of ways of verifying or falsifying an entirely reasonable and rational proposition.” Surprised, yes; dismayed, no. We have suggested many ways to verify your assertion that it is a scorch. You tried to get away by telling us that it was up to us to prove you wrong. Wrong! (One might even suspect that there was some confusion between falsifiability and falsificationism). It is simple, my friend. Provide evidence of 1) a fiber scorched by your methods that is scorched only to a depth of 200 nanometers, 2) a yarn segment which is also superficially scorched only to a depth of two or three fibers, 3) a piece of linen cloth that is scorched on the reverse side as well as the front as is the case with the hair and mustache of the man whose image is “somehow portrayed” on the shroud, 4) a bit of scorch image removed from the surface of linen cloth by sticky tape, 5) a scorched image on cloth that is extremely faint or an explanation that is more than unscientific speculation as to how the scorch faded with time and 6) a demonstration of shading by scorch that replicates the halftone effect seen in the shroud. Colin, unless you can demonstrate most of these characteristics experimentally and not by verbal contortionism , I am far more inclined to think that Leonardo da Vinci created the shroud with proto photographic methods and I’m about 100% certain that he didn’t..","date":"2012-03-18","mins":"5:35 am","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","title":"Welcome to Colin Berry’s new Straw Shedder blog"},{"id":"comment-9440","author":"dan","post":"Google translation: The conspiracy theory was favored by the attitude and declarations of the heads of the laboratories themselves …… The Zurich laboratory for the BBC prepared a photo montage showing IMPOSSIBLE samples and subsamples were dated. Although it was known by the description of Bonnet Eymard he did when he showed Prof: Woelfli I had it in his office, the photo was not published until 2005 by ETH Life International, newsletter of the Swiss Federal Institute of Technology Zurich, to which the laboratory that dated the Shroud by the C14. Http://archiv.ethlife.ethz.ch/e/articles/sciencelife/turin.html The 3 sub Z1.1.1, Z1.1.2 and CAN NOT PROCEED Z1.1.3 sample Z1.1 (among several other things the “scraping” of the “fishbone” typical tissue and appears in Z1 and Z1 .1, had to appear in any of the 3 sub samples that are “burned” ……) If anyone knows the solution of the puzzle, probably Colin, that the explain ……. And if there are errors, that have not been recognized, something as simple as making ESE photomontage for the BBC, who knows what it was that was “burned” …… [Prof. Hull, the Arizona Laboratory surprised everyone recently the owner of a subsample said that as Nature was “burned” (dated)].","date":"2012-03-19","mins":"4:28 am","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","title":"Welcome to Colin Berry’s new Straw Shedder blog"},{"id":"comment-177500","author":"dan","post":"David has taken the page down and replaced it with a place holder page. Tip to everyone: If you put it out there Google will find it..","date":"2014-12-18","mins":"6:04 am","url":"https://shroudstory.com/2014/12/17/please-revisit-david-rolfes-shroud-enigma-soon/","cat":"other_sites","title":"Please Revisit David Rolfe’s Shroud Enigma Soon"},{"id":"comment-57608","author":"dan","post":"You mean like this:.","date":"2013-12-10","mins":"6:25 am","url":"https://shroudstory.com/2013/12/08/barbet-vs-zugibe/","cat":"other_blogs","title":"Barbet vs Zugibe"},{"id":"comment-58952","author":"dan","post":"From Stephen’s own profile page in blogger: Blogs: Creation Evolutio…, Jesus is Jehovah!, The Shroud of Turin Gender Male Occupation High school teacher Location Warwick, Western Australia, Australia Interests Christianity, the Shroud of Turin, chess, mathematics..","date":"2013-12-13","mins":"2:29 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?"},{"id":"comment-93977","author":"dan","post":"Daveb, I must agree. Sorry, Yannick..","date":"2014-03-27","mins":"5:18 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-94200","author":"dan","post":"Biased, yes, but balanced and brief..","date":"2014-03-28","mins":"8:56 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-49352","author":"dan","post":"For the petition, CLICK HERE. As far as I can tell there are about 235 signatures since April over at ipetition.com. Not many names that I recognize. See: Antonacci Proposing Molecular and Sub Atomic Testing To Resolve Disputes Regarding the Shroud And: Speaking of more scientific testing of the shroud.","date":"2013-10-31","mins":"3:24 pm","url":"https://shroudstory.com/2013/10/31/press-release-marino-endorses-antonacci-petition-and-proposal/","cat":"news_&_views","title":"Press Release:  Marino Endorses Antonacci Petition and Proposal"},{"id":"comment-57277","author":"dan","post":"Paulette, can’t you get anything right?.","date":"2013-12-08","mins":"1:34 pm","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-213670","author":"dan","post":"Hi Scott. I used to interpret John the same way. This You Tube may help..","date":"2015-10-27","mins":"1:04 am","url":"https://shroudstory.com/2015/10/26/dan-spicer-we-have-a-simple-explanation/","cat":"critical_summary","title":"Dan Spicer:  We have a simple explanation."},{"id":"comment-175208","author":"dan","post":"Paulette, I disagree. It doesn’t matter where a paper is stored as long as it is accessible. I don’t see anything wrong in this regard. This is common. The links work and the search engines take care of the rest..","date":"2014-12-08","mins":"6:36 am","url":"https://shroudstory.com/2014/12/07/a-response-to-the-critical-summary-presentation/","cat":"uncategorized","title":"A response to the Critical Summary presentation"},{"id":"comment-213675","author":"dan","post":"And I have “judged” otherwise. IMHO, the binary choices those little Xs represent are not sufficiently justified and based on observations that are still open issues. You say fall through fits the data. Okay, maybe it does (and maybe other hypotheses not listed in the page 73 chart do too). I say the data still warrants critical examination. We saw this with the recent “bartender” discussion about the questionable appearance of metacarpal bones and other bone structures. If I were making the judgment at this time, I’d have to leave Bone Structures (B9.1) off of the chart because I think it represents dubious data..","date":"2015-10-27","mins":"1:32 am","url":"https://shroudstory.com/2015/10/26/dan-spicer-we-have-a-simple-explanation/","cat":"critical_summary","title":"Dan Spicer:  We have a simple explanation."},{"id":"comment-163987","author":"dan","post":"See the next posting as well..","date":"2014-10-20","mins":"6:24 am","url":"https://shroudstory.com/2014/10/20/in-the-belly-of-the-beast/","cat":"critical_summary","title":"In the Belly of the Beast"},{"id":"comment-163973","author":"dan","post":"You’re up early. I can’t recall ever seeing the raking light photographs..","date":"2014-10-20","mins":"5:08 am","url":"https://shroudstory.com/2014/10/20/in-the-belly-of-the-beast/","cat":"critical_summary","title":"In the Belly of the Beast"},{"id":"comment-164028","author":"dan","post":"I thought it was one word. But who knows what it is below the equator or across the pond. Dictionary.com defines it as a stupid person. Of that, there is no dispute..","date":"2014-10-20","mins":"9:09 am","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","title":"Quick Reaction to In the Belly of the Beast"},{"id":"comment-3931","author":"dan","post":"Stephen, I think I found it. Look at your blog http://creationevolutiondesign.blogspot.com/2007/06/bogus shroud of turin 7 dirt on feet of.html. Look for “That finding was later confirmed by Dr Levi Setti … This interesting.” The single quote seems to be missing after Setti… and one might think that “This interesting” is part of Kim’s words. I think this is what Linda is referring to. Hope that helps and I don’t think it is that big a deal (but it makes for an interesting posting on a slow news day). Dan.","date":"2011-09-18","mins":"5:52 am","url":"https://shroudstory.com/2011/09/17/guscin-dreisbach-and-the-risk-of-dot-dot-dotting/","cat":"news_&_views","title":"Guscin, Dreisbach and the Risk of Dot-Dot-Dotting"},{"id":"comment-205312","author":"dan","post":"Reblogged this on Best of Shroud Story..","date":"2015-07-11","mins":"6:21 pm","url":"https://shroudstory.com/2014/12/10/remembering-ray-rogers-at-the-st-louis-conference/","cat":"news_&_views","title":"Remembering Ray Rogers at the St. Louis Conference"},{"id":"comment-50335","author":"dan","post":"Mark, thanks for the clarification..","date":"2013-11-07","mins":"4:06 pm","url":"https://shroudstory.com/2013/11/07/some-questions-about-mark-antonaccis-petition/","cat":"news_&_views","title":"Some Questions About Mark Antonacci’s Petition"},{"id":"comment-11839","author":"dan","post":"I hope so, David; I hope so..","date":"2012-06-03","mins":"6:36 am","url":"https://shroudstory.com/2012/06/02/does-dawkins-even-know-he-has-been-challenged/","cat":"challenge","title":"Does Dawkins even know he has been challenged?"},{"id":"comment-11842","author":"dan","post":"Colin, I just finished taking you off of mandatory monitoring of comments. Maybe I’ll have to put you back on. Insults in lieu of substance are not welcome here..","date":"2012-06-03","mins":"8:18 am","url":"https://shroudstory.com/2012/06/02/does-dawkins-even-know-he-has-been-challenged/","cat":"challenge","title":"Does Dawkins even know he has been challenged?"},{"id":"comment-11276","author":"dan","post":"David, we are clearly not communicating. You wrote, “There was definitely no intention to exclude any of the major contending image formation theories from consideration.” In my reply to you at SSG I wrote, “It is not about a favorite body image hypothesis.” I repeated the sentence three or four times throughout the letter. I used the word favorite because you had used the word favorite instead of major as you now do. I tried to make it clear that it is about the impurity layer that Rogers concluded was on the fibers. I think Yannick makes this clear as well. Impurity layer, which is a characteristic, does not necessarily mean a Maillard reaction, which is a body image formation hypothesis. Nor, for that matter does a Maillard reaction necessarily mean that an impurity layer of starch and saccharide is required. Isn’t that what Paolo Di Lazzaro was trying argue? David, characteristics of the image, whatever they are, ultimately dictate what image formation theories/hypotheses are acceptable. You don’t exclude or include hypotheses when literally report characteristics. You report observed characteristics, which should be factual. Now it may be that there are differences of opinion. Some SSG scientists have claimed that the image that was formed lies very superficially within the fiber. Others have claimed, Ray Rogers most notably, have claimed that the image that was formed lies within a very superficial impurity layer of starch and sugar. In other words there is no consensus on the statement that reads: “The body image is created by molecular change of linen fibres.” Yes there is a consensus by a cabal of a few scientists who met in Valencia. But the public is not going to accept that. And Dawkins after a few minutes of Googling by one of his volunteers is not going to accept it. Their commentary is likely to be that people behind the challenge don’t know what they are talking about or are promoting a one side view. The correction to sentence one should be “The body image is created by molecular change of linen fibres or to a chemical impurity layer adhering to the fibers.” You say that I rejected your offer to go back to the signatories or whatever they are. I didn’t. Go back. But it is not about a favorite or major image formation hypothesis. It is about the impurity layer. Go back. Discuss it. Get consensus on the non consensus. I have not objection to that. What I also stated is my objection to science by consensus and the foregoing is why. Science should be driven by facts. And if there are differences of opinions about what is factual, then and until they can be ironed out, openness and candor must be the norm. It is easy to get a small number of scientists together and present a consensus about just about anything. How different would be the consensus about the Anthropic Principle by a dozen or so members of the Society of Ordained Scientists and a dozen or so scientist members of the Council for Secular Humanism. Tell me the consensus group from Valencia isn’t a group of scientists who are not perceived to have a bias. Permit me to quote Jos Verhulst who, in regard to this matter, wrote: “But there nothing wrong, absolutely nothing wrong, with this lacking of a ‘consensus’. If people want to debate the shroud, they should do so as rational individuals, with each individual thinker pondering the evidence and developing careful reasoning. That’s all that there is to a scientific discussion. Thinking that the position of a protagonist moves somehow closer to the truth, or becomes more trustworthy or reliable, when it is backed by a ‘consensus’, is completely absurd. ‘Consensus’ is for those who believe, not in the power of truth and reason, but in the power of number and amount. This whole consensus thing should be dropped.” What has happened to Shroud Science? Is it now the tossing down of gauntlets and daring skeptics to knock blocks off of our shoulders rather than pursuing the truth of the shroud with open candor..","date":"2012-05-11","mins":"7:00 am","url":"https://shroudstory.com/2012/05/11/sentence-one-in-the-richard-dawkins-challenge-is-wrong-period/","cat":"challenge","title":"Sentence One in the Richard Dawkins Challenge is Wrong. Period."},{"id":"comment-11465","author":"dan","post":"Bing Translation: Question for colinsberry, expert in food industry:Do they inhibit the high figures of lactic acid production of vapours of ammonia and aromatic amines (cadaverine and putrescine)?.Thanks for the reply..","date":"2012-05-20","mins":"9:19 am","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","title":"The Valencia Dawkins Challenge:  No Consensus on Consensus"},{"id":"comment-176334","author":"dan","post":"I like it very much..","date":"2014-12-14","mins":"11:44 am","url":"https://shroudstory.com/2014/12/14/russ-breault-the-shroud-of-turin-in-fifteen-minutes/","cat":"uncategorized","title":"Russ Breault: The Shroud of Turin in Fifteen Minutes"},{"id":"comment-176598","author":"dan","post":"While I believe that the grayscale (bright and dark) values of the images show shape, I remain unconvinced that this means they represent distance between the body and the cloth. They may; I’ll concede that point. But I have not yet seen convincing evidence of that. Also, I have not seen any convincing evidence that light caused the image. Moreover, I don’t think scriptural passages, which may be metaphorical in their reference to light, can be used in this context. Other than that, the video is an excellent introduction to the shroud. It is the best I’ve seen..","date":"2014-12-15","mins":"3:13 am","url":"https://shroudstory.com/2014/12/14/russ-breault-the-shroud-of-turin-in-fifteen-minutes/","cat":"uncategorized","title":"Russ Breault: The Shroud of Turin in Fifteen Minutes"},{"id":"comment-103557","author":"dan","post":"You got me. I was thinking of Virginia Gentleman. I used to live near the Smith Bowman distillery in Reston before it moved to Fredericksburg. But when the picture of the Wild Turkey came up in Google and it seemed to fit the posting, well I copied and pasted without thinking it through. Now, some folks will say it isn’t bourbon unless it is made in Kentucky but that is a topic for another blog..","date":"2014-04-25","mins":"8:12 am","url":"https://shroudstory.com/2014/04/25/some-advice-from-stephen-jones/","cat":"other_blogs","title":"Some Advice from Stephen Jones"},{"id":"comment-85079","author":"dan","post":"Ridiculous!.","date":"2014-03-05","mins":"3:30 am","url":"https://shroudstory.com/2014/03/02/jones-the-turin-shroud-is-authentic-get-over-it/","cat":"other_blogs","title":"Jones:  The Turin Shroud is authentic. Get over it!"},{"id":"comment-97179","author":"dan","post":"“The theory of evolution has seen an amazing process of accretion of facts since it was first proposed, and it has proved to have predictive value.” — Ray Rogers. Ray Rogers was a charter member of the Coalition for Excellence in Science Education in New Mexico, which stressed the importance of teaching evolution in the schools. He was strongly against teaching creationism in the schools and actively lobbied against it. In one case he wrote a rather strong letter to the editor of the Los Alamos Monitor, the city’s local newspaper. R. N. Rogers 10 Jan. 1997 The Los Alamos Monitor Editor: Sig Hecker is the director of the most famous laboratory in the world, certainly the laboratory that has had the largest effect on humanity’s perception of science since the beginning of recorded history. This is The Laboratory that has shown people that they must take the effects of science seriously. It is also one of the laboratories that could teach the world just what science is and what they can expect from it. I have reason to believe that Sig Hecker is an exceedingly poor choice to represent science. The public largely does not understand exactly what science is, and there appears to he a strong desire not to be compelled to find out either in school or by personal study. A significant fraction of the public has a deep hate for what they think science is. Another fraction feels that its beliefs are threatened. Both groups have launched assaults on science, and the people who love science cannot believe that it is happening. It is! We have seen a very practical result in the State Board of Education that will have long term effects. Science is not “things.” It is a way of thinking. Classical Scientific Method is simply a method for objectively applying logic to the solution of problems. 1) The problem must be stated in clear terms, and obscure words must be defined clearly. The goal sought must also be stated clearly. 2) Everything known about the problem must be studied, and all references must be acknowledged. There must be no “hidden facts,” and it is not clever to “blind side” the opposition. Carefully planned observations should be made. Different methods of observation should be made when possible, and results must be checked for internal consistency and agreement with reported results. All observations must be taken seriously, until some justifiable and clearly stated reason can be found to eliminate any. 3) A “brainstorming” session, preferably with other workers familiar with the problem, should try to develop as many potential explanations (hypotheses) as possible (Method of Multiple Working Hypotheses), All hypotheses must be clearly stated. And 4), all of the hypotheses must be tested equally against the same, complete list of observations and facts. Testing may often involve making predictions on the basis of the hypotheses and testing the predictions by experiment. The Principle of Parsimony (Occam’s Razor) states that the hypothesis that includes the largest number of facts and observations will be closest to the truth. Hypotheses that do not accept many facts without “special pleading” should be discarded. We are now living in a time when the special pleadings have assumed more importance than the facts. An approach that does not include the components of Scientific Method is not “science.” A well tested hypothesis, for which no exceptions have been found, is called a “theory.” The word “theory” in science does not connote “speculation.” Creationists misuse the term to confuse the public. I asked Sig Hecker for help in the defense of science. He has, after all, espoused excellence in science” as his fundamental desire for the laboratory. With regard to creationism, his response was the following: “The lab has no official position on creationism. The media have tried, several times to get me to take a stance, and I have refused.” I suppose that a large government financed scientific organization must be politically correct. It might not be good for the careers of scientific managers to propose an official position on something like science. An individual scientist, however, might be expected to make continual application of classical Scientific Method. He would be expected to keep “truth” as his primary goal. He would be expected to defend his methods under peer review. I believe that Sig’s refusal to make a personal statement on creationism is his scientific position. If the laboratory is managed by creationists who still profess to be scientists, they should be willing to present all of their facts for public scrutiny. If they are not willing to do this, I believe that higher authorities should return the laboratory to scientific management as quickly as legally possible. Persons who value science should insist on it. R. N. Rogers Here is another letter. Any questions now about where Rogers stands? R. N. Rogers 17 Jan. 1997 The Los Alamos Monitor Editor: John Baumgardner’s response to my letter attributes statements to me that I did not make. I was advocating classical scientific method as the best approach to the solution of problems. I did not advocate or even mention atheism. I did not advocate any control over religious expression. Religion is “revealed”: The body of knowledge in science is developed by application of a specific logical process. The two operate in different spheres. Science and atheism are two different things. Trouble comes when a person attempts selectively to accept or deny scientific observations primarily on the basis of religious beliefs. By definition, a “scientist” is a person who uses scientific method. Like Caesar’s wife, a scientist must be above suspicion. The more “renowned” the scientist, the more careful he should be. I was accused of proposing atheism as official policy for the laboratory. I was accused of advocating control over free religious expression. Those are serious accusations. I did neither. The Greeks classified logical fallacies over two thousand years ago, and many fallacies appear in attempts to circumvent honest application of scientific method on any topic. Baumgardner’s accusations against me are a good example of an argument ad hominum, with which you attack a person rather thrums logic (common in politics). Invocation of great theist scientists seems to have as its unstated conclusion that “therefore, creationism is true.” True science should not use hidden premises; however, the type of argument used involves the non sequitur fallacy (argumentative leap). The most common fallacy I see used is “begging the question”: The argument assumes as true what it needs to prove. Hundreds of years of observations and measurements by thousands of scientists have provided the basis for the scientific theory of evolution. Has all of that been a conspiracy? Back to begging the question, can anyone prove that “science has falsified evolution” without first accepting the premise that God created everything, most things, some things, or (fill in the blanks)? In science you state your hypotheses and premises, and I have yet to see all of the creationist premises and/or hypotheses clearly stated. Incidentally, I hated to use the word “theory.” Its use by creationists illustrates another fallacy, the fallacy of equivocation. This involves the deliberate use of the same word or phrase in more than one sense. A scientific theory is more solidly established than a hypothesis. The theory of evolution has seen an amazing process of accretion of facts since it was first proposed, and it has proved to have predictive value. The fallacy of composition has often been used in attempts to disprove evolution. It involves the suggestion of some doubt and the application of that doubt to the attempted destruction of an entire body of knowledge. Each doubt must be critically analyzed, and I do not see that being done. Is it necessary to disprove anything to prove God? Do warped logic and outright lies support God? I admit that I have not read Behe’s book. I have, however, had a son who worked in Melvin Calvin’s laboratory at Berkeley, and I have read many of Calvin’s works. Calvin wrote Chemical Evolution, and he got a Nobel Prize. I have not seen any creationist work of similar stature. Perhaps a corporate philosophy that allows a lack of scientific rigor explains the lack of Nobel Prizes at Los Alamos. I would have to see some scientific analysis of creationists’ claims, made by creationists with rigorous methods, before I organized a symposium with them. I do not enjoy illogical polemics and vague claims. With or without scientific, method, I suggest most strongly that John Baumgardner watch very closely what he says or writes about any scientist R. N. Rogers.","date":"2014-04-06","mins":"4:34 pm","url":"https://shroudstory.com/2014/04/06/stephen-jones-is-even-questioning-my-beliefs-about-the-resurrection/","cat":"other_blogs","title":"Stephen Jones is even questioning my beliefs about the Resurrection"},{"id":"comment-141331","author":"dan","post":"Perhaps, but with Meriiam Webster at hand. . . Sig·nif·i·cant adjective \\sig ˈni fi kənt\\: – large enough to be noticed or have an effect – very important [. . . ] I’m not questioning the expertise of the STURP team. I’m not buying into what Colin is saying. He is not my favorite skeptic by a long shot and readers of this blog know that. I don’t just report what is favorable to my belief in the shroud’s authenticity. We face a credibility problem when we simply say the facts speak for themselves and therefore we won’t address what skeptics have to say. What Colin had to say, IN MY OPINION, is significant,until shown otherwise, even if he is wrong..","date":"2014-07-30","mins":"9:11 pm","url":"https://shroudstory.com/2014/07/30/a-significant-criticism-of-sturp/","cat":"other_blogs","title":"A Significant Criticism of STURP"},{"id":"comment-66373","author":"dan","post":"Note: before allowing this comment from Francis De Stefano, I sought additional confirmation from him. This, in part, is what he wrote to me: “Hi Dan, “I first learned from Kevin Moran that Dr. Whanger had purchased the collection of pollens from the estate of Max Frei. “It was Kevin who told me that Dr. Whanger paid about $50,000 for these materials. “Ian Wilson in one of his books about the Shroud refers to “an American Shroud enthusiast” purchasing these materials, without mentioning Dr. Whanger by name. “When I visited Dr. Whanger at his home in early February of 2012, he explained to me that Max Frei’s pollen collection was stored inside a bank vault in the general vicinity of his home, and that he has made this collection available to qualified researchers on occasion. “Max Frei died before completing his study of these pollens, and, to my awareness, no team of pollen experts has ever completed a definitive examination of these pollens that is available in the scientific literature. [. . . ] “As you probably already know, the Shroud was “vacuumed” during its private 33 day “restoration” so the Frei collection probably remains the definitive data set, when it comes to pollen research, imperfect as it is. “I hope this is helpful to all of you, and a very Merry Christmas to you all.”.","date":"2013-12-24","mins":"5:01 am","url":"https://shroudstory.com/2013/10/02/a-sturp-sequel/","cat":"news_&_views","title":"A STURP Sequel?"},{"id":"comment-205313","author":"dan","post":"Reblogged this on Best of Shroud Story..","date":"2015-07-11","mins":"6:22 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries"},{"id":"comment-14605","author":"dan","post":"Bing Translation: Hydroxyproline! An excellent argument for authenticity! In the normal, healthy individual, the hydroxyproline is found as traces in the blood serum and in greater amounts in urine as a free hydroxyproline and conjugate hydroxyproline with peptides. On the individual sick with various diseases that do not interest here, the hydroxyproline increases in the blood serum and urine. Did they guess situations in which increases substantially the hydroxyproline in serum and urine? The hydroxyproline increases very significantly in blood serum and urine in deep stretch muscle kept, what is well known for the sports medicine. I think not a stretch muscle maintained more intense than the one provided for 3 hours of CRUCIFIXION. [the peak of hydroxyproline in the sample from the heel suggests to me “pollution” by urine.] [The type of death suffered by Jesus would normal urine…. Even of faeces and seminal fluid emission] I am a clinician, suggest that a doctor better qualified than me in biochemistry of blood and urine as Dr. Heimburger resume the subject of the hydroxyproline. Carlos.","date":"2012-08-08","mins":"3:52 am","url":"https://shroudstory.com/2012/08/07/and-yannick-responds-to-giulios-comments/","cat":"news_&_views","title":"Yannick Reacts to Special Issue"}]
