[{"id":"comment-200229","author":"dan","post":"Strange. Let me get back to you on that..","date":"2015-05-26","mins":"6:20 am","url":"https://shroudstory.com/2015/05/26/a-treasure-of-reading-material/","cat":"paper_chase","title":"A Treasure of Reading Material"},{"id":"comment-200244","author":"dan","post":"Fixed. Enrico very quickly sent me a new file..","date":"2015-05-26","mins":"9:11 am","url":"https://shroudstory.com/2015/05/26/a-treasure-of-reading-material/","cat":"paper_chase","title":"A Treasure of Reading Material"},{"id":"comment-169802","author":"dan","post":"See new posting Colin Berry Wants Feedback.","date":"2014-11-08","mins":"6:05 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-176338","author":"dan","post":"I disagree. This is a well accepted page..","date":"2014-12-14","mins":"11:50 am","url":"https://shroudstory.com/2014/12/14/a-new-york-times-one-sip-of-coffee-story/","cat":"press_coverage","title":"A New York Times One-Sip-of-Coffee Story"},{"id":"comment-165400","author":"dan","post":"Max, that’s it. I need to pre moderate your comments which is a pain for both of us..","date":"2014-10-25","mins":"5:51 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-165370","author":"dan","post":"Max. This part of the discussion is over. No reply is necessary and no, you don’t get the last word..","date":"2014-10-25","mins":"3:55 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-165723","author":"dan","post":"This conversation is over..","date":"2014-10-26","mins":"4:49 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-56302","author":"dan","post":"You were right!!! The first hat tip is to Andrea Nicolotti..","date":"2013-12-04","mins":"8:04 am","url":"https://shroudstory.com/2013/12/03/about-to-break-breaking-news/","cat":"press_coverage","title":"About to Break Breaking News?"},{"id":"comment-168623","author":"dan","post":"Reblogged this on Best of Shroud Story..","date":"2014-11-04","mins":"10:39 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-205311","author":"dan","post":"Reblogged this on Best of Shroud Story..","date":"2015-07-11","mins":"6:20 pm","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","title":"BBC News Magazine:  The Perplexing Image"},{"id":"comment-9861","author":"dan","post":"Google translation: Some skeptics should have reached a serious problem for the genitals while lying …….. Which in some cases must be quite frustrating. It’s the dumbest thing one can say of the Man of the Shroud, but spent years repeating HAVE TROUBLE, not just learn it and repeat it like parrots. The “sine qua non” to work that stupidity is that NO ELBOWS off the ground. Since we have a stupid, unless you tell it well! “Anyone who wants to simulate the position of the supposed” corpse “can do the following: lying on the floor face up, let it rest your elbows on the floor, take one wrist with the other hand, without taking off the elbows ground, trying to hide the genitals … to achieve this position is as impossible as biting the elbow. “The article referred to the skeptic a deplorable Colombian Hernan del Toro in the magazine “Think” n1, v 1 January March 2004. Obviously, if the elbow joint immobilized by squeezing the ground can not be achieved genitalia or navel, or nose, or mouth, or NADA. Stephen Wagner, DO NOT SUGGESTIONS, you’re normal and you can achieve your genitals lying perfectly still, that if, when you try not insist on squeezing no elbows on the floor ……….","date":"2012-04-02","mins":"6:54 am","url":"https://shroudstory.com/2012/04/02/a-silly-why-the-shroud-of-turin-is-fake-article/","cat":"news_&_views","title":"A Silly “Why the Shroud of Turin is Fake” Article"},{"id":"comment-192226","author":"dan","post":"Let’s try to avoid cross commenting. It frustrates others..","date":"2015-03-02","mins":"3:49 pm","url":"https://shroudstory.com/2015/03/02/daily-beast-review-of-cnns-shroud-of-turin-episode/","cat":"press_coverage","title":"Daily Beast Review of CNN’s Shroud of Turin Episode"},{"id":"comment-198229","author":"dan","post":"I’ll look into it. Unfortunately, I’m not at my computer. I am just posting this from my i Phone. I will let you know..","date":"2015-05-03","mins":"5:18 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-166171","author":"dan","post":"I should not be editing at 4:00 am..","date":"2014-10-28","mins":"7:59 am","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-205822","author":"dan","post":"Reblogged this on Best of Shroud Story..","date":"2015-07-15","mins":"5:16 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-170166","author":"dan","post":"Charles, I do think that you don’t understand that the shroud images are negative or what that means, for you wrote: You have a cloth that originally had images on the outer fibrils (STURP finding but in line with medieval manuals), the images have faded ( hardly surprisingly after a minimum of seven hundred years) and you then make a photographic negative of what is left today. No wonder you end up with something that looks rather mysterious! It doesn’t matter that the images are on the outer fibrils. It doesn’t matter if the images have faded or not. It is not a matter of making a photographic negative and ending up with something that look rather mysterious. If anything it is the other way around. Charles, the images on the cloth are negative images. What that means, if your painted image hypothesis is to be thought valid, is that 1) an artist painted a negative image or 2) an artist painted a positive image that as it faded (or is it as the paint flaked off) became a negative image. There is no evidence that this has ever happened in the history of art. Moreover, option 1 is near impossible to do and option 2 would be a startling scientific phenomenon. Actually if you could explain how option 1 is doable or option 2 is scientifically possible, you might have something. Otherwise, your hypothesis is baseless. Which is it? That is a simple question. Again, some other questions come to mind: In defense of your hypothesis, do you know what Secondo Pia discovered in 1898? Can you describe the difference between a mirror image and a negative image? Do you have any evidence of a painted grey scale negative image at any time in the history of art? Saying that medieval artists were ingenious or something like that is not evidence..","date":"2014-11-09","mins":"3:33 pm","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-166172","author":"dan","post":"I know. Ill be pulling it..","date":"2014-10-28","mins":"8:00 am","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-170406","author":"dan","post":"Are you now too busy to answer the questions I asked you about negative images?.","date":"2014-11-10","mins":"10:12 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-200852","author":"dan","post":"Reblogged this on Best of Shroud Story..","date":"2015-06-02","mins":"4:29 am","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"id":"comment-170448","author":"dan","post":"“How did this look when it was first created?” Charles, you say that is the central work of every archaeologist and art historian. Let me ask you then: How did it look? Were the images negative images when it was first created? If so, how is that possible? Certainly, they were not painted. But if not, what happened to change the images into negatives? We are not talking about “a negative photo.” And it is irrelevant that the images are decayed (or faded or flaked away), as you say they are. And no one is saying that anything therefore or otherwise comes out mysterious. And nobody, but nobody, is reasoning from that that the shroud is the burial shroud of Christ. Who, Charles? Can you show me one instance of a painted negative image in the history of art? A mirror image doesn’t count unless it is also a negative image. And a negative image does not need to be a mirror image..","date":"2014-11-10","mins":"2:36 pm","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-200410","author":"dan","post":"The paper loaded fine for me. Nonetheless here is another copy of The death of the Shroud Man: an improved review ( https://shroudofturin.files.wordpress.com/2015/05/p07.pdf ).","date":"2015-05-28","mins":"5:38 am","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"id":"comment-97667","author":"dan","post":"Hi Larry, Catholic Answers in the normal course of business is selling individual PD Fs of the entire magazine for $3.95. If you have a link to a free copy or can provide a copy to me in PDF format for posting on this blog, I will be happy to provide this information to others. It is really too bad when articles like yours get locked up behind pay walls. BTW, no sooner had I purchased the article, I received an email solicitation asking me to contribute to Catholic Answers Forum. It read, in part: “Dear shroudstory, “Catholic Answers Forums is a valuable service for people everywhere. It provides information, companionship, and the chance to grow closer to God. “But it needs your help to stay online and keep helping people. Specifically: It needs to raise $70,000. “That’s why we’re writing to you. . .”.","date":"2014-04-08","mins":"2:29 pm","url":"https://shroudstory.com/2014/04/08/lawrence-e-schauf-for-the-prosecution-the-trial-of-the-shroud/","cat":"article","title":"Lawrence E. Schauf for the Prosecution: The Trial of the Shroud"},{"id":"comment-97675","author":"dan","post":"Catholic Answers Inc. Is a 501(c)(3) tax exempt organization. Charity Navigator gives them 0 stars overall, which is about as low as you can get. More than 30% of what they raise is used for administration and fundraising. In other words hold on to your money. They reported income of $6,000,000. They fail to provide any of the following on their website: Donor Privacy Policy, Board Members List, Audited Financials and their Form 990. Hold onto your money..","date":"2014-04-08","mins":"3:29 pm","url":"https://shroudstory.com/2014/04/08/lawrence-e-schauf-for-the-prosecution-the-trial-of-the-shroud/","cat":"article","title":"Lawrence E. Schauf for the Prosecution: The Trial of the Shroud"},{"id":"comment-212636","author":"dan","post":"I posted the following comment two years ago under In case you missed Isabel Piczek’s wonderful paper after Hugh Farey asked, “Can anyone anywhere explain why Isobel Piczec is referred to as a physicist?” Mine, was not the only comment: There are many references to Dame Piczek as a particle physicist, a theoretical physicist and a Hungarian trained physicist. Then there is this nice but far too short biography from the Miner Messenger, a publication of the alumni, friends, and parents of Bishop Manogue Catholic High School in Reno, Nevada. I wish I knew more. Chapel Stained Glass Artists Have International Reputation Bishop Manogue has been graced with the works of remarkable and internationally famous artists, the sisters Isabel and Edith Piczek. Both sisters were born in Hungary. They were friends of Sister Ida, Foundress of the Sacred Heart Sisters who provided years of ministry in the Diocese of Reno. Isabel, our principal contact, won a national competition for painting at a very early age, and at thirteen she decorated her first church with stained glass. Young Isabel, a Catholic, got herself into religious conflict with the communist government of Hungary and had to flee her country, accompanied by Edith, her sister and colleague. Almost immediately after her arrival in Rome, she won the International Grand Award for Painting and another competition to paint a 400 square foot fresco mural at the Vatican’s famous Pontifical Biblical Institute. She spent three years in Rome. During this time she completed another 42 murals at the Precious Blood Monastery of Rome and elsewhere. She also pursued her other interest, particle physics. Leaving Rome, Isabel came with her sister to the United Stated and with her she established her art studio, the Construction Art Center in Los Angeles. To date she has completed huge murals, mosaics, ceramic tile murals and stained glass windows for 493 churches and public buildings in seven countries on three continents. In addition to her outstanding work in the Bishop Manogue chapel, some of Isabel’s major works can be found at the St. Thomas Aquinas Cathedral and Our Lady of Snows parishes in Reno; the Guardian Angel Cathedral in Las Vegas; the Basilica of the National Shrine of the Immaculate Conception in Washington, D.C.; Holy Cross Mausoleum in Culver City, California; Holy Family Cathedral in Orange, California; and numerous other buildings in California, Rome, Canada, Illinois, New Mexico and elsewhere. Ms. Piczek is also an internationally known expert on the Shroud of Turin. She has appeared many times on national television..","date":"2015-10-16","mins":"2:06 am","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-165913","author":"dan","post":"Last warning. You can say all you want. You cannot call people ignorant or use other insulting terms..","date":"2014-10-27","mins":"8:58 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-212638","author":"dan","post":"And here is a Wikipedia article on Isabel Piczek. Isabel Piczek (born 1941) is a Hungarian born ecclesiastical artist and physicist, perhaps best known for her study of the Shroud of Turin, and who currently lives in Los Angeles. Her sister, Edith Piczec, was also a noted religious artist. Piczkc, as with her sister Edith, was born in Hungary, where her father was a noted artist and art professor, and graduated from the Academy of Fine Arts in Budapest. After World War II, however, the sisters fled to Rome during the Communist regime to pursue their work in sacred art. There, whilst still only teenagers, they won a 1949 competition to paint a mural at Rome’s Pontifical Biblical Institute. By 1955 they were in Canada and shortly after arrived in Los Angeles to pursue their combined talents. In Las Vegas, Edith designed the 2,000 square foot mosaic on the façade of the cathedral that illustrated the roles of the Guardian Angel.[1] In 1992, Piczek was honoured by Pope John Paul II in recognition of her prolific artistic achievements, examples of which can be found in nearly 500 different cathedrals, churches and other buildings across the world.[2] Cardinal Roger Mahony, Archbishop of Los Angeles, conferred on Piczec admission into the Pontifical Order of Saint Gregory, and the title Dame of Saint Gregory, whereby she became one of only 70 Knights and Dames throughout the world who hold this honour.[3].","date":"2015-10-16","mins":"2:25 am","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-165907","author":"dan","post":"Max, I have over 200 spam comments this morning, mostly people trying to sell stupid stuff or lure people to gambling sites, etc. “My brother told me about your blog. You wrote about the topic so well. I’m going to come back every day to read more about the subject.” You get the idea. It takes time and work to clear these out. I don’t have time to edit out your insults of others in this blog. So and so is not ignorant. You won’t quit. You just keep it up, trying to prove a point. Well, I’m just deleting them and the trail of typo corrections that you shoot out every few minutes afterwards. I may just need to automatically block your comments if you persist..","date":"2014-10-27","mins":"8:40 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-166872","author":"dan","post":"Max. Fine and good, you are an expert. But that doesn’t mean I think you’re right. I have no reasons to think so. You have given me none. I’m not an expert in anything. I’ve spent my career in business and I wouldn’t invest a nickle in what you say simply because you are an expert. In other words, no sale. And if you pull any of those “methinks” or “shall I repeat” phrase on me I’ll just put that nickel in my pocket and walk away. And, no, I don’t need to have the image on the nickle crypto whatevered..","date":"2014-10-30","mins":"7:48 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-212570","author":"dan","post":"Good catch by a reader. I posted Satan and his clever Shroud of Turin trickery in January of 2012. I had forgotten that..","date":"2015-10-15","mins":"11:53 am","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-181797","author":"dan","post":"Calm down, Rick. We all try to find polite ways of saying things. I slip up often, so I get it. Nonetheless. . ..","date":"2015-01-07","mins":"6:16 am","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","title":"News Story from Sindone.org"},{"id":"comment-190826","author":"dan","post":"I removed it. That the picture appeared in the Daily Mail is reason enough. Don’t pursue with other examples. We are overdoing it with pictures as comments..","date":"2015-02-12","mins":"10:32 am","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-197039","author":"dan","post":"Yeah, you’re right..","date":"2015-04-21","mins":"7:47 am","url":"https://shroudstory.com/2015/04/21/retracted-papers/","cat":"article","title":"Retracted Papers"},{"id":"comment-211412","author":"dan","post":"To quote Trump, the details are not important. If only the Black Knight had brought it back to England when he could have ….","date":"2015-09-28","mins":"7:49 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","title":"The Shroud of Canterbury"},{"id":"comment-190721","author":"dan","post":"I never said five. I said I am considering a limit. What you do, Max, is to write a short comment, then follow it with a typo correction, and then follow that with an additional short thought or two and soon we have 4 or 5 comments when with a little care you could’ve written it as one comment. Those of us who follow comments as emailsend up getting four or five emails. If that is enough you sometimes sprinkle in a couple comments that really say nothing substantive but are intended to insult someone. I’m asking you, Max. Please help me out Stop and review your comment before sending it. You are causing me a lot of extra work..","date":"2015-02-11","mins":"1:41 pm","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-190928","author":"dan","post":"The article should probably read, “In 1978, Jackson led a team of scientists who spent five days intensely studying the Shroud for authenticity, before [personally himself] ultimately concluding it is genuine and not an artistic fake.”.","date":"2015-02-13","mins":"8:17 am","url":"https://shroudstory.com/2015/02/13/two-more-articles-about-upcoming-cnn-series-on-finding-jesus/","cat":"press_coverage","title":"Two More Articles About Upcoming CNN Series on Finding Jesus"},{"id":"comment-157901","author":"dan","post":"See posting, The Metamorphosis and Manipulation of a Legend?.","date":"2014-09-30","mins":"4:22 am","url":"https://shroudstory.com/2014/05/29/available-for-pre-order/","cat":"books","title":"Available for Pre-Order"},{"id":"comment-191382","author":"dan","post":"The hyperbole hides the fact that Barrie always approached the subject of authenticity with admirable objectivity..","date":"2015-02-19","mins":"9:02 am","url":"https://shroudstory.com/2015/02/19/windsor-star-story-on-upcoming-shroud-of-turin-exhibition/","cat":"press_coverage","title":"Windsor Star Story on Upcoming Shroud of Turin Exhibition"},{"id":"comment-40645","author":"dan","post":"See and discuss above comment at Comment: The real history is nothing like what Christians believe. . ..","date":"2013-08-07","mins":"10:50 am","url":"https://shroudstory.com/2012/03/21/bart-ehrmans-new-book-did-jesus-exist/","cat":"books","title":"Bart Ehrman’s new book: ‘Did Jesus Exist?"},{"id":"comment-125360","author":"dan","post":"Agree..","date":"2014-05-28","mins":"8:10 pm","url":"https://shroudstory.com/2014/05/27/can-doubts-about-the-shroud-strengthen-christian-faith/","cat":"books","title":"Can doubts about the shroud strengthen Christian faith?"},{"id":"comment-3355","author":"dan","post":"Ron, thanks for sending the file. I have put it at https://shroudofturin.files.wordpress.com/2011/07/3dexamples.jpg. I see what you are talking about but I’m not convinced that it is an image of a flower. I have long argued that there are images on both sides of the head that look like flowers but that I think they are formed by background noise. I’m willing to be convinced otherwise but this image is not clear enough to me. Dan Porter.","date":"2011-07-18","mins":"4:31 am","url":"https://shroudstory.com/2011/06/13/david-rolfe-interview-with-avinoam-danin-on-the-shroud-of-turin/","cat":"books","title":"David Rolfe Interview with Avinoam Danin on the Shroud of Turin"},{"id":"comment-3352","author":"dan","post":"Ron, can you send me the image that you are talking about. I can post it here if it is a jpg, gif, png, etc.. Send it to drporter@optonline.net. Dan Porter.","date":"2011-07-17","mins":"5:48 am","url":"https://shroudstory.com/2011/06/13/david-rolfe-interview-with-avinoam-danin-on-the-shroud-of-turin/","cat":"books","title":"David Rolfe Interview with Avinoam Danin on the Shroud of Turin"},{"id":"comment-30986","author":"dan","post":"Note update 2. Giulio sent along a revised version of the translation after noting some criticism. I have replaced the old one above. I have left the PDF version unchanged..","date":"2013-04-16","mins":"4:24 pm","url":"https://shroudstory.com/2013/04/16/giulio-fanti-responds-to-gian-marco-rinaldis-book-review/","cat":"books","title":"Giulio Fanti Responds to Gian Marco Rinaldi’s Book Review"},{"id":"comment-5621","author":"dan","post":"Count me among the guilty..","date":"2011-12-16","mins":"11:26 am","url":"https://shroudstory.com/2011/12/14/forensic-chemistry-handbook-an-embarrassingly-unscientific-chapter/","cat":"books","title":"Forensic Chemistry Handbook: An Embarrassingly Unscientific Chapter"},{"id":"comment-84236","author":"dan","post":"Yannick you are out of bounds..","date":"2014-03-02","mins":"7:44 pm","url":"https://shroudstory.com/2014/02/26/giulio-fantis-book-launched/","cat":"books","title":"Giulio Fanti’s Book Launched"},{"id":"comment-145064","author":"dan","post":"Maybe everyone should make up their own mind about NT Wrights anti Catholic bias after reading NT Wright Responds to Richard Neuhaus in First Things, published by the Institute on Religion and Public Life, founded by Richard John Neuhaus, himself: Second, there is no “pervasive edge of anti Catholicism” in the book [=Surprised by Hope], which is in no sense a denominational polemic. Most of my main targets are in my own church. (Does that make me “anti Anglican”?) In the quest to speak clearly about eschatology, classic Roman Catholicism is a friend and ally. Among my greatest encouragers has been Gerry O’Collins, formerly of the Gregorian University. When I taught there as a happy guest six years ago, including being introduced to the man Neuhaus calls “John Paul the Great,” I don’t think anyone would have noticed the slightest tinge of anti Catholicism. Indeed, some of my Reformed critics regularly accuse me of being far too friendly to Rome, but that is another story. More poignantly, on my last visit to a dear but sick friend, before his untimely death, I found him reading Surprised by Hope , and he professed himself delighted. He was Kevin Dunn, my “opposite number” and occasional golf partner, the late Roman Catholic bishop of Hexham and Newcastle. Nor was I “refuting Catholic ecclesiology” when I quoted Douglas Farrow”and neither was I ignorant of the fact that Doug, a good friend these past twenty years, has recently converted to Roman Catholicism. Doug was rightly attacking a particular form of ecclesial triumphalism, which occurs in many traditions, including some parts of Catholic tradition at some, not all, periods in history”but also occurring, particularly, in various types of liberal Protestantism. In any case, that part of the book was hardly central or particularly load bearing for the whole. More important, I was not attempting to claim that the present pope was coming round to my way of thinking or that I was offering him “tutelage.” I was merely noting, as anyone familiar with Cardinal Ratzinger’s work surely knows, that in his 1977 book Eschatology , he offers a remarkable account of purgatory in terms of the fire spoken of in 1 Corinthians 3 and states that this fire, which is a metaphor for the all consuming meeting with Christ himself, “cannot be quantified by the measurements of earthly time.” This is a careful and explicit rejection of some aspects of what some Roman Catholics had sometimes taught in earlier times” just as he refers to “what were in part objectionable and deformed practices,” presumably meaning the sale of indulgences and the like. In other words, Ratzinger was arguing, long before I started writing on this subject, (a) that traditional expressions of purgatory in terms of a linear, temporal progression are mistaken; (b) that at or after death the redeemed person meets with Christ in a moment of fiery judgment that burns away all the dross, and that this is what the traditional language of “purgatory” is attempting to refer to; and (c) that the Reformers were right to react against some practices that had grown up around the doctrine as some people taught and perceived it at the time. All I was doing was hailing this fine piece of work by a great Roman theologian of our day. As for suggesting that I would do well to consult the pope’s new encyclical, Spe Salvi , and what it says about purgatory”well, Neuhaus should himself read not only what the encyclical says about purgatory (since it repeats exactly the argument Ratzinger had made thirty years earlier) but also my grateful comments on that encyclical in The Tablet last December. Do your homework, Neuhaus, I wanted to say again and again. Why should Neuhaus imagine such unseemly and pervasive anti Catholicism? He thinks it is because I “must justify [my] separation from the centering authority of the ancient Church.” How bizarre. Of course, I know that many people brought up in the Germanic world, presented with a stark choice between a very Protestant (and latterly existentialist) Lutheranism and a traditional Catholicism, found themselves facing that sort of question. As Neuhaus said to me over lunch recently, many good Lutherans are taught to remind themselves every day why they are not Roman Catholics. Or was there something else?.","date":"2014-08-20","mins":"7:19 pm","url":"https://shroudstory.com/2014/08/20/how-to-start-a-rumor/","cat":"books","title":"How to Start a Rumor"},{"id":"comment-135926","author":"dan","post":"Yes. I’ll be posting something today or tomorrow. I did not have time to deal with it during this 3 day 4th of July holiday weekend..","date":"2014-07-07","mins":"8:33 am","url":"https://shroudstory.com/2014/07/07/is-francis-right/","cat":"books","title":"Is Francis Right?"},{"id":"comment-83694","author":"dan","post":"Colin, for someone who doesn’t bother with this site anymore, you bother with it quite a bit..","date":"2014-03-01","mins":"2:50 am","url":"https://shroudstory.com/2014/02/26/giulio-fantis-book-launched/","cat":"books","title":"Giulio Fanti’s Book Launched"},{"id":"comment-33352","author":"dan","post":"Let’s cool it a few degrees..","date":"2013-05-09","mins":"4:02 pm","url":"https://shroudstory.com/2013/05/08/joe-nickells-new-book-the-science-of-miracles/","cat":"books","title":"Joe Nickell’s New Book: The Science of Miracles"},{"id":"comment-20736","author":"dan","post":"Maybe zealot or fanatic or some other word instead of freak..","date":"2012-12-19","mins":"4:26 pm","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"id":"comment-95133","author":"dan","post":"The battery in my mouse wore out just having to scroll so far..","date":"2014-03-31","mins":"4:44 am","url":"https://shroudstory.com/2014/03/30/john-klotz-wants-your-feedback/","cat":"books","title":"John Klotz Wants Your Feedback"},{"id":"comment-20629","author":"dan","post":"Yannick, I think that is unfair..","date":"2012-12-18","mins":"10:19 am","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"id":"comment-125083","author":"dan","post":"That would be great. Just let me know what you want to do..","date":"2014-05-27","mins":"3:13 pm","url":"https://shroudstory.com/2014/05/22/more-tomfoolery-the-carbon-dating-results-are-worthless/","cat":"books","title":"More Tomfoolery: The carbon dating results are worthless"},{"id":"comment-214871","author":"dan","post":"I read once, I have no idea where, that the second most popular syndicated newspaper photograph in 1898 was Pia’s. First place went to Teddy Roosevelt’s Rough Riders charging San Juan Hill I suspect that the 1898 photograph was far more significant and better seen than the 1970 television showing..","date":"2015-11-20","mins":"10:34 am","url":"https://shroudstory.com/2015/11/19/just-in-time-for-christmas-the-relic-master/","cat":"books","title":"Just in time for Christmas:  The Relic Master"},{"id":"comment-123129","author":"dan","post":"I wasn’t referring to King Umberto. By tomfoolery I was referring to all the snipping and pulling of threads and the making of relics out of relics that was going on. I agree with Hugh on many things but not this. I’m sorry if I didn’t make myself clear..","date":"2014-05-22","mins":"9:12 am","url":"https://shroudstory.com/2014/05/22/more-tomfoolery-the-carbon-dating-results-are-worthless/","cat":"books","title":"More Tomfoolery: The carbon dating results are worthless"},{"id":"comment-75140","author":"dan","post":"Thibault, I simply missed it. I have since removed it and temporarily removed automatic comment approval for Anonymous. It is too bad because Anonymous oftentimes contributes to the conversation..","date":"2014-01-30","mins":"3:05 am","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"id":"comment-6710","author":"dan","post":"I agree, of course. I have argued with Helmut for years, to no avail. We all have, I suppose. I must, however, respect his beliefs. I know he is sincere..","date":"2012-01-09","mins":"5:56 am","url":"https://shroudstory.com/2012/01/09/new-kindles-from-helmut-felzmann/","cat":"books","title":"New Kindles from Helmut Felzmann"},{"id":"comment-167983","author":"dan","post":"The comment was edited..","date":"2014-11-02","mins":"7:00 pm","url":"https://shroudstory.com/2014/11/01/new-publication-on-manoppello-veil/","cat":"books","title":"New Publication on Manoppello Veil"},{"id":"comment-49314","author":"dan","post":"Thanks for reminding me..","date":"2013-10-31","mins":"8:45 am","url":"https://shroudstory.com/2013/10/31/new-book-about-christs-relics-from-ignatius-press/","cat":"books","title":"New Book About Christ’s Relics from Ignatius Press"},{"id":"comment-137029","author":"dan","post":"Hold on to your day job..","date":"2014-07-11","mins":"5:59 am","url":"https://shroudstory.com/2014/07/11/new-novel-the-blood-of-the-shroud/","cat":"books","title":"New Novel: The Blood of the Shroud"},{"id":"comment-58946","author":"dan","post":"Nor do I..","date":"2013-12-13","mins":"2:24 pm","url":"https://shroudstory.com/2013/12/13/please-only-discuss-michael-judes-book-and-claims-here/","cat":"books","title":"Please Only Discuss Michael Jude’s Book and Claims Here"},{"id":"comment-59269","author":"dan","post":"Enough, Michael, please. This is what Twitter is for. You have the potential for a much bigger audience by tweeting. Why not start a Twitter account. I’ll let you announce it here in this thread. Thanks..","date":"2013-12-14","mins":"6:54 am","url":"https://shroudstory.com/2013/12/13/please-only-discuss-michael-judes-book-and-claims-here/","cat":"books","title":"Please Only Discuss Michael Jude’s Book and Claims Here"},{"id":"comment-72333","author":"dan","post":"Louis, did you just post something that vanished? It read, “At the rate things are changing. . . ” and then it vanished as I was attempting a reply. I can’t find a copy. Do you have a copy?.","date":"2014-01-05","mins":"6:44 pm","url":"https://shroudstory.com/2014/01/03/rest-in-peace-ian-barbour/","cat":"books","title":"Rest in Peace Ian Barbour"},{"id":"comment-29324","author":"dan","post":"Please post any comments you have of review at http://tinyurl.com/dxgej5k where the review has been reposted..","date":"2013-04-04","mins":"11:46 am","url":"https://shroudstory.com/2013/04/04/sales-and-amazon-reviews-of-fantis-new-book/","cat":"books","title":"Sales and Amazon Reviews of Fanti’s New Book"},{"id":"comment-45298","author":"dan","post":"Hugh and David, I completely agree. Three comments by Francis have been removed..","date":"2013-09-24","mins":"8:38 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45741","author":"dan","post":"Jmarino240 : Still having problems with the copying/pasting. In my last posting (#41), please refer to Chris B’s original posting #36. It seems that text bracketed by two ‘less than’ symbols and two ‘greater than’ symbols wipes out the text in between. Text with just two ‘less than’ (pointing left and to the left of the text) works just fine. ..","date":"2013-09-28","mins":"12:25 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45749","author":"dan","post":"OK. I don’t recall anything. Please send it again. I have been receiving 100s of unwanted email from one person who is upset because I have blocked him from the blog. I’ll watch carefully..","date":"2013-09-28","mins":"3:33 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45783","author":"dan","post":"Done..","date":"2013-09-29","mins":"5:19 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45705","author":"dan","post":"Joe, paste into Word and send it to me. Let me take a look at it..","date":"2013-09-28","mins":"5:44 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-41580","author":"dan","post":"Colin, some suggestions?.","date":"2013-08-19","mins":"8:51 am","url":"https://shroudstory.com/2013/08/18/shroud-of-turin-quote-of-the-year-so-far/","cat":"books","title":"Shroud of Turin Quote of the Year (so far)"},{"id":"comment-168507","author":"dan","post":"This one? CLICK HERE.","date":"2014-11-04","mins":"4:16 am","url":"https://shroudstory.com/2014/11/03/the-holkham-bible-recently-much-mentioned/","cat":"books","title":"The Holkham Bible Recently Much Mentioned"},{"id":"comment-45902","author":"dan","post":"Dave, as we say here in the USA, if the King James Bible was good enough for Jesus then it is good enough for us..","date":"2013-09-30","mins":"6:22 am","url":"https://shroudstory.com/2013/09/30/the-gospel-according-to-bill-oreilly-continued/","cat":"books","title":"The Gospel According to Bill O’Reilly Continued"},{"id":"comment-203930","author":"dan","post":"Thanks. Get back to us ***by email to me*** with a link when the song is released..","date":"2015-06-28","mins":"1:38 am","url":"https://shroudstory.com/2015/06/27/times-square/","cat":"books","title":"Time’s Square"},{"id":"comment-5168","author":"dan","post":"David, that is fine an good as a personal vision of reality. It is nonetheless your opinion. But an Atheist would disagree, particularly one of the so called new Atheists who reject the very notion of faith as being something that one might call knowledge. The Atheist doesn’t say, “God hasn’t given me the gift of faith.” He says it is all bunk to even think so. So where does that leave you? Dan Porter.","date":"2011-12-02","mins":"1:17 pm","url":"https://shroudstory.com/2011/12/01/was-the-shroud-of-turin-created-by-gnostics/","cat":"books","title":"Was the Shroud of Turin created by Gnostics?"},{"id":"comment-2654","author":"dan","post":"Not us, but certainly the author of this book. It gets weirder every day..","date":"2011-03-07","mins":"7:22 pm","url":"https://shroudstory.com/2011/02/25/the-shroud-of-besancon-holds-the-key-to-how-the-tomb-was-openedtin-foil-hat-warning/","cat":"books","title":"The Shroud of Besancon holds the key to how the tomb was opened–Tin Foil Hat Warning"},{"id":"comment-2501","author":"dan","post":"Exactly so. And thus one can never, ever prove of disprove the existence of God, the divinity of Christ or the nature of the shroud’s images..","date":"2011-02-17","mins":"4:09 pm","url":"https://shroudstory.com/2011/02/17/yikes-another-book-from-left-field/","cat":"books","title":"Yikes! Another Book from Left Field"},{"id":"comment-207319","author":"dan","post":"Dave, I view this as a useless exercise in a form of questionable numerology. BTW: “useless exercise” also computes to 1128. That is amazing, isn’t it! So is it that the shroud is a useless exercise or is it that belief in numerology is? Sorry, Dave, I don’t buy it. Not at all..","date":"2015-08-03","mins":"4:15 am","url":"https://shroudstory.com/2015/07/29/barrie-schwortz-on-catholic-radion-indy/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Catholic Radio Indy"},{"id":"comment-168624","author":"dan","post":"If you will send me a corrected file in PDF format, I will replace the other file. I cannot post DOCX files. And I cannot get into the business of reformatting and correcting anything..","date":"2014-11-04","mins":"10:45 am","url":"https://shroudstory.com/2014/11/04/decrypted-iconosteganalysist-or-iconocryptanalyst/","cat":"paper_chase","title":"Decrypted:  Iconosteganalysist or Iconocryptanalyst"},{"id":"comment-3413","author":"dan","post":"I agree. And I certainly didn’t mean that I agree with Manny’s hypothesis because I said it makes good sense. Like Yannick, I need to meditate on it. Dan Porter.","date":"2011-07-25","mins":"4:09 pm","url":"https://shroudstory.com/2011/07/25/paper-chase-the-shroud-of-turin-from-the-viewpoint-of-the-physical-sciences/","cat":"news_&_views","title":"Paper Chase: The Shroud of Turin From the Viewpoint of the Physical Sciences"},{"id":"comment-185772","author":"dan","post":"Corrected papers are often published. It should include the word “Corrected” under or above the title on the title page and a brief explanation should be offered at the end of the paper. Roemer’s Gnostic speculations, Jone’s conspiracy theory and Ruello’s made up discoveries in science were not conference reports nor would they have been. The problem is that conference papers are often treated as though they were (in a sense) peer reviewed. A citation study might be very revealing. Papers like this, when not called out, reflect on the entire community of researchers. I’d like to see Jeffrey have a chance to make corrections. If not, at the very least, archive sites should provide notices..","date":"2015-01-23","mins":"2:51 pm","url":"https://shroudstory.com/2015/01/23/should-a-st-louis-conference-paper-be-withdrawn/","cat":"paper_chase","title":"Should a St. Louis Conference Paper be Withdrawn?"},{"id":"comment-99009","author":"dan","post":"That would be extraordinarily interesting. You could change my mind..","date":"2014-04-13","mins":"2:33 pm","url":"https://shroudstory.com/2014/04/10/new-dvd-of-the-women-of-grace-programs-on-the-shroud-plus-some/","cat":"lectures","title":"New DVD of the Women of Grace Programs on the Shroud Plus Some"},{"id":"comment-98545","author":"dan","post":"Hugh, you write: “a photo he shows specifically to illustrate that the blood stains are undisturbed is actually of a blob of wax. . . “. Do you have the part number and a time mark?.","date":"2014-04-12","mins":"12:27 am","url":"https://shroudstory.com/2014/04/10/new-dvd-of-the-women-of-grace-programs-on-the-shroud-plus-some/","cat":"lectures","title":"New DVD of the Women of Grace Programs on the Shroud Plus Some"},{"id":"comment-98540","author":"dan","post":"What I said was, “According to information at You Tube, J. Wayne Phillips ‘is an expert Shroud of Turin and has a degree in Shroud Studies from the Vatican Apostolorum College.'” That is taken directly from the You Tube channel of the Jesuit High School in Tampa. See https://www.youtube.com/watch?v=Q12 Cd Hh AXOE&list=UU6q1m Aq8po0a Ov3 Nd F Mqo Rw&index=3. I did not verify what they wrote but I did provide my source..","date":"2014-04-12","mins":"12:05 am","url":"https://shroudstory.com/2014/04/10/new-dvd-of-the-women-of-grace-programs-on-the-shroud-plus-some/","cat":"lectures","title":"New DVD of the Women of Grace Programs on the Shroud Plus Some"},{"id":"comment-98962","author":"dan","post":"Okay, so it’s Doc. Let me address your comments in reverse order. 3)Joe Marino is a good friend. He is a frequent contributor to this blog. Note a posting this morning comes from him: Another Enduring Belief Question: Jesus in the Nude He has been the source of most of the material about the St. Louis Conference. Search this blog on St. Louis for several postings. I don’t think it is a SSG hosted conference. 2) I think the real problem is that there simply isn’t a good basis for saying that bloodstains are undisturbed. With centuries of rolling, folding, displaying, etc. It is hard to justify. Let me see one picture that is clearly not possibly just a worn down bloodstain. 1) Perpendicular radiation? What makes it perpendicular? How does this work? Radiation, by the way, is natural. Only the source of it is in question. Miraculous is it? Wouldn’t 100% miraculous nonenergetic information transfer and molecular chemical change work just as well? Why depend on an accidental byproduct of a miracle? If it is not accidental but purposeful why not just go for another miracle? Philosophically, Jackson, Fanti, et. Al. Don’t make sense? Theologically, they don’t make sense. Scientifically, they don;t make sense. I think the image is real but I don’t see sufficient evidence from anyone in SSG or anywhere else for any explanation of the image. Not yet. As for the pollen, it is suspect right now and nobody gets to exam it. Why is that? Welcome to the blog, Doc. Lots to discuss. We are getting about 2,500 page reads a day, right now..","date":"2014-04-13","mins":"11:06 am","url":"https://shroudstory.com/2014/04/10/new-dvd-of-the-women-of-grace-programs-on-the-shroud-plus-some/","cat":"lectures","title":"New DVD of the Women of Grace Programs on the Shroud Plus Some"},{"id":"comment-98832","author":"dan","post":"I should add, I’ll see you in St. Louis. I’ll be blogging from there..","date":"2014-04-12","mins":"9:24 pm","url":"https://shroudstory.com/2014/04/10/new-dvd-of-the-women-of-grace-programs-on-the-shroud-plus-some/","cat":"lectures","title":"New DVD of the Women of Grace Programs on the Shroud Plus Some"},{"id":"comment-98831","author":"dan","post":"I was not aware that SSG was hosting the conference in St. Louis. As far as I know there are two sponsors: 1) Mark Antonacci’s Resurrection of the Shroud Foundation and 2) Salt River Production Group whose president, if I am reading his blog correctly is part of Antonacci’s foundation. What we do here is argue. Everything should be scrutinized. As for peer review, most of what is being claimed to have been peer reviewed lately is pure pay to play vanity publications. I was not aware that the majority of SSG members “agree the shroud had to some how achieve somewhat of a stiff plane like unwrapping to give such a perfect photographic image.” I have been a member of SSG since day one and I very much doubt that claim. Can you substantiate it? And frankly, I do not agree with your assessment of SSG’s work..","date":"2014-04-12","mins":"9:23 pm","url":"https://shroudstory.com/2014/04/10/new-dvd-of-the-women-of-grace-programs-on-the-shroud-plus-some/","cat":"lectures","title":"New DVD of the Women of Grace Programs on the Shroud Plus Some"},{"id":"comment-33030","author":"dan","post":"I just spilled a cup of coffee in my lap when I read that. How did I miss that? I’ll be amending the page. No, I’ll be doing that and bringing this to the top for the attention it warrants..","date":"2013-05-06","mins":"6:02 am","url":"https://shroudstory.com/2013/05/06/new-real-face-of-jesus-pages-at-the-history-channel/","cat":"video","title":"New ‘Real Face of Jesus’ pages at the History Channel"},{"id":"comment-208920","author":"dan","post":"No, that is not Barrie. That is Hugh: an oddity of You Tube that I have no control over..","date":"2015-08-25","mins":"4:32 am","url":"https://shroudstory.com/2015/08/25/simon-brown-video-of-barrie-schwortz-at-jalsa-salana-uk/","cat":"video","title":"Simon Brown Video of Barrie Schwortz at  Jalsa Salana UK"},{"id":"comment-2787","author":"dan","post":"Ah shucks, about Christmas. Super cosmonaut, you say at your website. It should be astronaut. Jesus was American, wasn’t he?.","date":"2011-04-03","mins":"7:48 am","url":"https://shroudstory.com/2011/04/02/search-for-jesus-at-history-com/","cat":"video","title":"Search for ‘Jesus’ at History.com"},{"id":"comment-33033","author":"dan","post":"Thanks, Colin. You beat me to it. It is still only 6am on this side of the pond. Quite a bit of discussion then; then forgotten for more than three years. Déjà vu all over again, indeed..","date":"2013-05-06","mins":"6:32 am","url":"https://shroudstory.com/2013/05/06/new-real-face-of-jesus-pages-at-the-history-channel/","cat":"video","title":"New ‘Real Face of Jesus’ pages at the History Channel"},{"id":"comment-143927","author":"dan","post":"Actually, Colin, I relied on Dawkins’, “The Greatest Show on Earth,” which just incidentally is a wonderful book that I enjoyed very much. I take my statement about the shroud being controversial from pp. 105 106 of the Free Press Paperback reprint. Note in the quotation the phrase “carbon dating technique.” And I agree. It is good science. And in the case of the shroud it was good science done poorly. If Dawkins had been well informed about the objections to the radiocarbon dating – not fire caused contamination but evidence of material intrusion probably from reweaving – he could have given a better account. Notice he avoids the question of sampling altogether. Is there no one other than you with the courage and/or the comprehension of good scientific practices to proclaim that each and every one of the 1988 scientists should have walked away from the single sample. Dawkins comes out looking dull. David Goulet suggests striking it. I probably will. Or I may expand upon it to show how imprecise Dawkins is. (I’ll probably strike it). Maybe I should change it to even Colin Berry thinks the scientists should have walked away from a single sample (just kidding, but yeah!). Here is the quote from the book: “. . . When mass spectrometry made it possible to date a tiny sample of the shroud, rather than the substantial swathes that would have been needed before, the Vatican allowed a small strip to be cut off The strip was divided into three parts and sent to three leading laboratories specializing in carbon dating. In Oxford, Arizona and Zurich. Working under conditions of scrupulous independence — not comparing notes — the three laboratories reported their verdicts on the date when the flax from which the cloth had been woven died. Oxford said AD 1200, Arizona 1304 and Zurich 1274. These dates are all — within normal margins of error — compatible with each other and with the date in the I 350s at which the shroud is first mentioned in history. The dating of the shroud remains controversial, but not for reasons that cast doubt on the carbon dating technique itself. For example, the carbon in the shroud might have been contaminated by a fire, which is known to have occurred in 1532. I won’t pursue the matter further, because the shroud is of historical, not evolutionary, interest. It is a nice example, however, to illustrate the method, and the fact that, unlike dendrochronology, it is not accurate to the nearest year, only to the nearest century or so.” Let’s look at the important part of the above. “The dating of the shroud remains controversial, but not for reasons that cast doubt on the carbon dating technique itself,” He is talking about the technique, the science, ‘to illustrate the method.” But the dating remains controversial. Why? Because of poor quality use of the otherwise good technique. As for capitalizing Atheist, I am much convinced by a good friend, an Atheist himself, who generally prefers that the word be capitalized in the same way that Christian is capitalized – a member of a class of people. I understand your comparison to theist. I also understand that the an ample majority of writers do not capitalize atheist. I believe the Chicago Tribune Style Guide allows both. We could toy with many words like Catholic, Orthodox, Evangelical. When I do capitalize atheist, I do it out of respect as I do for someone who is Muslim or Jewish or an Epicurean. We have bigger issues. As for my experiment with the Best of, it is just that, an experiment. Feel free to launch a counterpoint..","date":"2014-08-14","mins":"4:29 pm","url":"https://shroudstory.com/2014/08/14/update-on-the-movie-the-shroud-conspiracy/","cat":"movie","title":"Update on the Movie, The Shroud Conspiracy"},{"id":"comment-2932","author":"dan","post":"Yes, we will see..","date":"2011-04-18","mins":"2:15 pm","url":"https://shroudstory.com/2011/04/06/updated-jesus-the-lost-40-days-the-history-channel-april-20/","cat":"news_&_views","title":"Updated: “Jesus, the Lost 40 Days” the History Channel April 20"},{"id":"comment-51341","author":"dan","post":"Lighten up Max. I am not promoting Dr. CB’s thesis..","date":"2013-11-14","mins":"5:46 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-208934","author":"dan","post":"For the record the text I quoted did not come from an email but from a very public You Tube video accessible to everyone. Calling a public site a Christian channel doesn’t make insensitive comments okay even if they are meant to be seen as a joke. Simon has replaced the description on You Tube with: “It must be noted. The Muslims are loving and caring people. In fact they believe love all and hate non. I believe they practice what they preach. The Muslims believe Jesus was crucified, but survived death and therefor was not resurrected. However this is a great deception by the enemy and will stop millions from being saved.” I happen to be a Christian. I believe in the Resurrection. I don’t believe that a loving God will “stop millions from being saved” because of what they believe if indeed they are “loving and caring people.” In fact, I don’t think “this is a great deception by the enemy” but that thinking it might be just might be. Your mileage may vary..","date":"2015-08-25","mins":"7:24 am","url":"https://shroudstory.com/2015/08/25/simon-brown-video-of-barrie-schwortz-at-jalsa-salana-uk/","cat":"video","title":"Simon Brown Video of Barrie Schwortz at  Jalsa Salana UK"},{"id":"comment-51248","author":"dan","post":"It is also six in the morning and I’m walking the dog. Focus on what is important..","date":"2013-11-14","mins":"7:36 am","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51422","author":"dan","post":"Max. If you will stop attacking CB I will stop moderating your comments. If you continue double posting I will delete everything. I haven’t the time or inclination to be a referee for rock throwing games..","date":"2013-11-15","mins":"7:56 am","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51232","author":"dan","post":"I’ve deleted some messages and instituted some measures to block future such insults..","date":"2013-11-14","mins":"6:30 am","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50957","author":"dan","post":"I don’t know why it dropped out. It is back..","date":"2013-11-12","mins":"11:55 am","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51475","author":"dan","post":"I’m not interested in being fair, just effective. Now drop it and let’s deal with the shroud and not personalities. Oh , BTW, Professor Hamon, it ‘s Dr Berry or just CB or Colin Stop trying to insult..","date":"2013-11-15","mins":"12:47 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"}]
