[{"author":"maria_da_glória","post":"Dear Professor Stephen Jones Thanks for your kind words.If you allow me I´d like to add some textile facts that point the Shroud beeing woven in the first century.Besides the stitching similar to the one found in Masada fortress clothes dating from 70 A.D. Shroud of Turin yarn has not uniform color due to chemical bleaching producing image artifacts the so called variegated pattern.In medieval times artisans after weaving the fabric used to bleach it by sunlight so it could have uniform color.Another important aspect,topmost fibers of Shroud of Turin threads have a polysaccharide layer which by a chemical process of dehydration and oxidation changed color producing the image effect.this polysacccharide layer is just the residue of washing the cloth in a saponaria officinalis solution The way the Shroud of Turin was made fits with the method described by roman historian of first century Pliny the Elder in his book Natural History.The 3:1 herringbone twill of the Shroud indicates no doubt an expensive fabric but Joseph of Arimathea was wealthy enough to afford it.Trying to disauthenticate the Shroud of Turin with such a weak claim is ludicrous.best regards Maria da Glória CENTRO PORTUGUÊS DE SINDONOLOGIA.","date":"2009-12-29","mins":"6:23 AM","url":"http://theshroudofturin.blogspot.com/2009/12/burial-shroud-proves-turin-shroud-not.html","title":"\nBurial shroud proves Turin Shroud not from 1st century C.E. Jerusalem?\n"},{"author":"maria_da_glória","post":"I guess this claim is absolutely preposterous how can the discovery of shroud fragment with a kind of twill prove that another shroud was not weaved in same period?Experts in ancient textiles concluded that the Shroud of Turin was weaved in an middle east loom and textile expert Dr.Mechtild Fleury Lembert stated that the Shroud of Turin had a kind of stitching similar to the ones found in Masada fortress In the name of all Shroudies I thank you for your quick rebuttal Maria da Glória CENTRO PORTUGÊS DE SINDONOLOGIA.","date":"2009-12-27","mins":"3:57 AM","url":"http://theshroudofturin.blogspot.com/2009/12/burial-shroud-proves-turin-shroud-not.html","title":"\nBurial shroud proves Turin Shroud not from 1st century C.E. Jerusalem?\n"}]
