[{"id":"comment-173952","author":"joe_marino","post":"Here is what archaeologist William Meacham wrote in a paper in 1986: “The fact that significant discrepancies have often resulted because of the contamination present in the best specimens from optimal archaeological conditions has the greatest implications in the Carbon 14 measurement of the Shroud. Firstly, any idea that a radiocarbon date of whatever entity could resolve forever the question of authenticity should be abandoned. Secondly, the choice of site for the cutting of the specimens from the relic must be controlled by considerations regarding the possibility of contamination and the desirability of measuring both typical and atypical specimens. Thirdly, an elaborate programme of pre treatment and selection must be carried out before the measuring of the specimens. Finally, the result must be interpreted for the general public in the light of the contamination and of the other uncertainties that are inherent in the radiocarbon datring method.”.","date":"2014-11-30","mins":"9:05 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-173602","author":"joe_marino","post":"Although I believe the evidence is very strong that there was reweaving in the C 14 area, that doesn’t preclude having my opinion that because of the unique nature of the Shroud and the problematic nature of C 14, that the test probably shouldn’t have been done. Assuming there is a reason that the C 14 is wrong, that reason is probably going to be challenged precisely because of the Shroud’s nature and various C 14 problems. There are plenty of other data points besides C 14 dating, which is obvious considering the Shroud is probably the most intensely studied artifact of all time. It’s ridiculous that one questionable test is given so much weight..","date":"2014-11-29","mins":"9:19 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-173647","author":"joe_marino","post":"O.K. Wrote “What’s so unique in the Shroud with regards to the carbon dating? We tried it once, unfortunately we came across interpolated sample, the results were not satisfactory, we had bad luck, it happens, sorry. Why not try once again? But this time with wiser, transparent approach, no blind tests. Remember , to skew a date from 1st to 14th century we need 66 75 % non original material (a simple calculation). That’s really big amount! If we don’t hit unlucky area again (and if we take more than one sample from different areas, we shouldn’t) the results should be 1st century or close. The carbon dating is not so unreliable as they paint it, actually it is more foolproof than fool vulnerable” and ” Let it turns 1st century, then I would like to see their mugs. Let it turns 1st century, then I would like to see their mugs.” Archaeologists prefer to carbon date items that have been undisturbed in ideal archaeological settings and not exposed even to cigarette ash. The Shroud has been anything but undisturbed for over 500 years and has been in a fire. I think those 2 factors right there make the Shroud a less than suitable item. And if another test is done and it comes out 1st century, don’t you think the skeptics would constantly bring out facts that they think invalidated the results? As several people at the conference pointed out, if another C 14 test was done and didn’t come out 1st century for whatever reason, the case for the Shroud’s authenticity would effectively be over. Prof. Barberis has apparently been trying for 10 years to get an international commission formed to look at the problems of carbon dating the Shroud. I think that if a good commission was formed and an appropriate protocol was produced, it would be possible to do a legitimate C 14 test. But I can’t say I’m confident that it would ever happen. And if it did, I still think it should be done in the context of multi disciplinary studies..","date":"2014-11-29","mins":"4:40 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-192994","author":"joe_marino","post":"On almost any point on the Shroud, one can find experts with opposing opinions, whether they agree it’s authentic or not. Most times a psychological aspect also comes into play, whether it’s a bias toward authenticity or not or possibly an attraction to a particular theory. All one can do is to continue to look at the evidence, acknowledging one’s own biases and continue searching for the truth. One can have a bias so strong that a rational look at the truth is impossible. There are some people who deny the Holocaust even happened. Regarding the question of a reweave, here’s a significant excerpt from Paul Maloney’s 2008 Ohio conference paper: It is now clear that the presence of cotton spun inside linen yarns in the Raes’ Corner is supported by the findings of five [should be “six”] separate and independent investigators: Gilbert Raes, (1973 1974) STURP’s own early analyses reported by STURP spokeswoman, Joan Janney, (1981) Investigators at Precision Processes (Textile lab) Ltd in England (1988) Ray Rogers’ 2004 investigations, and John Brown at Georgia Tech. Robert Villarreal & team, LANL (2008) I’ll conclude with a comment by Ray Rogers, who felt very strongly that the C 14 sample was not representative. On an internet group, he said “How much evidence is needed?”.","date":"2015-03-09","mins":"6:10 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-192969","author":"joe_marino","post":"“Remember that Whangers’ paper (2005) preceeded Jackson’s article (2008).” It should be pointed out that Jackson actually presented a paper at the 1999 Richmond conference arguing against a reweave..","date":"2015-03-09","mins":"1:23 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-35037","author":"joe_marino","post":"Yannick wrote: “Is it a PROVEN FACT that the sample 3 CB has been taken from a bloodstained area of the cloth?” Paul responded I got my Mc Crone slide out and read the inscription he put in the margin. It is as follows: “Madder Rose” “Linen fiber” “Medusa (blue)” “Sample 3 CB” There is good reason why I used the word “apparently” and added my own commentary regarding the important photographs that Barrie Schwortz took in 1978 the sample removals. The round magnetic markers which Dr. Tom D’Muhala laid down in each site cannot easily be “duplicated” by the pen drawn marks which Mc Crone tried to do to simulate the rectangular area of the STURP sticky tape. Such drawings are always to be seen as Mc Crone’s interpretation of where the samples came from. In order to be scientifically precise one could have wished that it might have been possible to actually photograph the sticky tape samples in situ before they were removed from the Shroud (as was more easily possible with the Frei tape sampes). But, this was not feasible because in every case the “torque applicator” was applied (which limited the pounds per square inch pressure on the Shroud), the instrument covers up the actual sample site from which the tape was removed (in other words, blocks the view). Moreover, there was so much going on during that spectacular week of STURP’s work on the Shroud, that it would have been nearly impossible to get photographs without disrupting the schedule. Barrie, for example, could not photograph the first seven sample sites where Max Frei took samples on the image side of the Shroud because, when Frei and Aurelio Ghio first came into the room at 11:00 pm, they set to work immediately to removing their samples. It was hectic and their work was “without warning” for Barrie. But, I have not yet had a chance to get my own collection of Barrie’s invaluable documentation photos to double check. I suspect that there is room for “free variation” left or right, up or down, in any attempt to reconstruct exactly and precisely where the samples really did come from (whether it was STURP’s or Frei’s–but, as noted above, far easier with Frei’s that with STURP’s samples). Moreover, it may be irrelevant given the fact that we know the Shroud was rolled and unrolled, folded and unfolded over the centuries so that a single particulate–in this case a linen fiber on 3 CB–may have moved a distance (however short) from the original site on which it was first deposited. Thus, it is terribly difficult to be more “scientific” when we prefer scientific precision. It’s a condition, I think, we will have to live with unless and until there is a future opportunity to do further work with the actual Shroud and address these questions anew with a more precise sampling technique and a rigorously planned photo documentation methodology. Barrie and I have actually talked about the disadvantages of taking photos at an angle when we could wish for a direct overhead view. But those were the situations Barrie had to face and work with on site and he did an absolutely tremendous job of capturing on film the action that was taking place. I continue to be amazed (and immensely appreciative) at all the data that was gathered by STURP given their limited time, schedule pressures, and the non clean room circumstances under which they operated. Sorry it would not be possible to be more precise about this–given the nature of the situation. Best regards, Paul Gen. Proj. Dir., ASSIST.","date":"2013-05-27","mins":"2:05 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35071","author":"joe_marino","post":"Giorgio wrote, “Joe can you ask Paul if he can tell me what would be the physical attributes that a researcher would indicate Madder Rose if any is present in these slides?” Paul wrote: It is most unfortunate that I am not a chemist–I really wish I were! I don’t personally know what the chemical and physical characteristics of rose madder are. But, as the name implies, “rose” has a rosy color when impregnated in a linen fiber. It is not a permanent color because it is of organic origin (the plant is Rubia tinctoria). The extract, purpurin, is more permanent than rose madder. Joe Kohlbeck, on the other hand, is both a microscopist and chemist with Hercules Industries in Salt Lake City, Utah. His observation about the change of color in cargille oil is significant and one you can “take to the bank.” It is a pity that Mc Crone did not include an index of STURP tapes and where he discusses them in his book. It would make the use of his book a lot easier. He does note “a few visible red fibers and particle agglomerates” on p. 86 (in his description of color figure 15, but this is a brief reference to a 10x macroscopic view of STURP tape 3 FB. And, by the way, there is a discrepant description of tape 3 CB which, in the list on p. 93, (which he adapted from his 1880 article “Light Microscope Study of the Turin Shroud, II (THE MICROSCOPE, no. 28, nos. 3 & 4) Mc Crone labels as from the right side wound. Well, yes and no. If he were to have maintained that the blood flow across the back (on the dorsal end of the Shroud) is from the right side wound which is on the frontal end of the Shroud, then, yes because Mc Crone believes an artist painted that blood run as having originated from the perforation in the side which is on the frontal end of the cloth. But, as I noted in a previous comment, I am not certain that we can be absolutely, scientifically positive that this sample actually came from directly upon the flow across the back. That’s why I used a qualification: in Mc Crone’s map of tapes it was “apparently” from the flow. Another reference to 3 CB is to be found in Mc Crone’s handwritten note on p. 137 where he finds an agglomerate particle that is “100 % vermilion.” But, in fact, his study of this tape (on the subject of vermilion) begins on p. 126 which, I think was largely adapted from his 1981 article “Light Microscope study of the Turin Shroud, III” which he published in his own journal, THE MICROSCOPE, (no. 29). Although Mc Crone appears to make much of this, STURP’s own studies failed to show up any concentration of vermilion (vermilion comes from mercury and should have showed up in their scans). In any case, this is probably another example of a contaminant of a paint that might have come from one or more of the True Copies that were touched image to image and cloth to cloth to the original Shroud. However, back to rose madder, Mc Crone is not really interested in rose madder. For him, it is only a contaminant that demonstrates that the Shroud was probably in an artist’s studio or, at least, exposed to an artist’s collection of pigments. Mc Crone’s main thrust is that the image on the Shroud is not organic, but, rather inorganic–having been produced by the artist’s use of iron oxide using a “dry brush” technique that causes “snow fencing” (i.e. The accumulation of pigment on one side of a fiber). Best regards, Paul Gen. Proj. Dir., ASSIST.","date":"2013-05-27","mins":"9:09 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35418","author":"joe_marino","post":"Yannick wrote [See message 156.] Paul Maloney wrote: “Sorry I’m slow to respond. I am in the throes of getting ready to leave for State College and, though I’ve not finalized my schedule, I’ve been attending to domestic projects–trying to take care of every detail before I’m gone. I’m not certain that I can offer much more by way of a cogent answer to your questions. I’m reluctant to commit myself to speculation. I’m the kind of person that likes to base my responses on the facts. In a previous e mail comment I noted that there is much we do not yet know about the Shroud. And many of those questions, good questions they are, but I think are incapable of a factual basis until a scientific team can go back to the Shroud and address them directly by a fresh study of the cloth with its image. Having said that, there are a few comments I can make. First, to the comment about the Church Authorities having woefully mis handled the scientific testing in 1978–this is something I think was completely irrelevant at that time. The Church did not receive ownership of the Turin Shroud until March 1983 after the death of the former owner, the late Italian King Umberto II, who was living in exile in Portugal. Fr. Peter Rinaldi, a personal friend of the King’s, shared some things with me as General Projects Director as I was in the midst of preparing a team for a new round of testing on the Shroud. Technically, all of the samples taken from the Shroud were still owned by King Umberto II and made available to STURP for scientific study. The custodian of the Shroud at that time was His Eminence Anastasio Cardinal Ballestrero who needed a science advisor to guide him because Cardinal Ballestrero was not himself a scientist. Prof. Luigi Gonella of Turin Polytechnic was tapped for the job. But I know from talking with Gonella personally, the goal was aimed toward the conservation of the Shroud–this totally aside from the effort to radiocarbon date the cloth–a project that was wrested away from the main protocol by Harry Gove. As Adler once said, you cannot conserve a cloth, with an unexplained image, that also had blood on it. So the samples were used to identify the various components of that cloth with the hopes that an idea about conservation might come forth. But having said that, I must also add that Fr. Peter revealed to me that King Umberto was also very “liberally” disposed toward what science wanted to do with the cloth to determine its nature. He even would have allowed the backing cloth to have been removed during that week that STURP was in Turin in October 1978. However, Cardinal Ballestrero, the custodian, prevented that from happening. There was, as Gonella said to me on an occasion at the Rye Town Hilton, in Ryetown, New York, (Nov. 21, 1987), much concern about conserving the stitches and repairs made by royalty over the centuries. Gonella, himself, resisted the idea to remove any of the patches (or the backing cloth) for that reason and, I believe, Cardinal Ballestrero was seemingly of that same opinion. But I don’t know who influenced whom–Gonella influencing Cardinal Ballestrero, or the other way around? Second: As I noted in a previous communique, I am an archaeologist, a trained historian [they say that an archaeologist is “an antique historian” : )] As such I have been trained to be extremely cautious about “arguments from silence” because there is always the danger that we humans may “read into” that silence to draw conclusions that the person of which we are asking it (and now deceased) would not want drawn–say, for example, Dr. Pierre Barbet. It is true that he did not make any comment about the “redness of the blood” but this may be meaningless. If no one asked Dr. Barbet about it he may never have thought to discuss it. Thus, history conclusions should not be based upon arguments from silence. Third, Rogers was a dedicated scientist. In fact, he was a very rigorous scientist! As such he was a model to be much admired. Rogers, the human, probably had many opinions about many things–and I know from my private phone discussions with him, in fact he did. But Rogers, the scientist, did not always engage himself to answer questions that he had not carefully researched. The registry of surprise that Mc Crone, or Rogers, or others, had not addressed some of the issues does not take into account the fact that someone who wanted to maintain his reputation for rigor, would, instead, want to spend some time researching it before answering the issue. But Rogers was not a specialist in blood–a hematologist–he was technically a thermal chemist. For example, he knew full well–and immediately, when the conservation commission opted for the intervention of Summer of 2002 on the basis that the burn areas on the Shroud might catch fire, or blow up–it was Rogers who blew up!! Rogers knew that there was nothing at all to the fear that the Shroud might be subject to spontaneous combustion and destroy itself. Instead, he lamented to me that much of historical value (not only the stitches and patches and backing cloth which Gonella had resisted having removed) but also the pre 1532 fire evidence when the fibers that surrounded those burn holes were tweezed away and lost to future science. As for Mc Crone, he made himself abundantly clear that the redness of the blood was due to an artist’s pigment and nothing else. Finally, In a previous communique I also alluded to an employee of Mc Crone’s who had found an organic [blood?] signal on one of the STURP tapes, and in parentheses I mentioned the name “Anderson????”. From Mc Crone, in his book JUDGEMENT DAY FOR THE TURIN SHROUD, (p. 126) I learned my spelling was off. It was actually “Andersen.” I located my copy of Barrie Schwortz’ book which he edited for Ray Rogers and could confirm that Mark Anderson was the person of whom I was referring. I looked up “Andersen [it is actually spelled “Anderson” there) and found the passage I was referring to: p. 61 and I quote: “Joan Rogers identified suitable fibers on the tape samples and prepared them for analysis. She took tapes, fibers from non image areas, and fibers from image areas to Instruments SA, Inc., in Metuchen, N.J. In December 1979. The samples were analyzed by Dr. Fran Adar. Similar samples were analyzed by Mark Anderson, Mc Crone’s MOLE expert in January 1980.” “Anderson observed that most of the red flecks on the Shroud ‘bubbled up and turned black’ when he hit them with the laser beam. This was an entirely different response than he got from authentic hemitite crystals. He said it ‘acted like an organic phase’ (21 January 1980). Walter Mc Crone refused to accept those observations. If he wanted the image to be painted with hematite, no conflicting observations would be allowed.” I don’t know when I will be able to return to Quakertown and have access to my own computer and my research library. I hope the above comments will suffice for the moment. Many thanks.” Paul Gen. Proj. Dir. ASSIST.","date":"2013-05-30","mins":"10:26 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34814","author":"joe_marino","post":"Yannick wrote, ” These are questions concerning the possible presence of Gum Arabic along with the possible madder rose in the sample analyzed by Nitowski: Where is this sample now? Who owns it? Would it be possible to do some more chemical analyses of this particular sample?” Paul responded: “Dr. Nitowski is now deceased. I tried reaching relatives and close friends but, with the exception of a cousin in New Jersey, I received no answers. No one knows where her samples are today–and it has been several years, now, that Jeannie passed away. Sorry I could not be more informative about this. Regards, Paul.","date":"2013-05-25","mins":"9:09 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35658","author":"joe_marino","post":"Paul Maloney writes, “Please convey my thanks to all the participants and their wonderful questions. Sorry I can’t be available for a time for further participation.”.","date":"2013-06-01","mins":"9:15 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34837","author":"joe_marino","post":"Paul Maloney wrote, “Hi Giorgio, Thanks for the summary listing of reference to Mc Crone’s notes of 3/3/79. But, actually, may I offer aslight correction to your remark about iron oxide and madder rose. It was Mc Crone who saw both the madder rose (not Rogers) AND the iron oxide and that Mc Crone’s main conclusion was that iron oxide was the basic ingredient in the image color.” Regards, Paul.","date":"2013-05-25","mins":"10:39 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34789","author":"joe_marino","post":"Yannick wrote: Question #1 for Joe Marino: Why do you refer to only one sample in which there could have been found some traces of madder rose while Mc Crone and Maloney talked about 2? Question #2: Can you tell me where is located the sample #1 FH? I don’t find it in Mc Crone’s map given by Mr. Maloney… Does it came instead from Barrie’s map? Question #3: Along with the presence of madder rose, you seem to think that there was also some traces of Gum Arabic in this sample 1 FH… Is it a proven fact? Let me answer question 2 first. 1 FH is a designation from a mapping system that Eugenia Nitowski put together to chart samples given to her by Rogers. It was a Holland cloth patch examined by Kohlbeck but not returned to Rogers. We referred to only one sample with madder rose based on the Nitowski map as opposed to 2 samples that Maloney and Mc Crone referred to on Mc Crone’s map. It’s not proven that gum arabic was on 1 FH–we just said it was plausible based on the Quad mosaic data and Rogers’ findings..","date":"2013-05-25","mins":"6:32 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34903","author":"joe_marino","post":"Yannick wrote, “Can you confirm to me that both Mc Crone and Nitowski have only analyzed samples that were taken by STURP and not by Max Frei or Riggi?” Paul responded: Here’s the “chain of possession” for the STURP tapes. Joe Kohlbeck was a good friend of Ray Rogers. So after Ray got the STURP tapes back from Mc Crone he sent them to Hercules (to Joseph Kohlbeck) in Salt Lake City, Utah. While Kohlbeck was studying these tapes he heard of an archaeologist (Dr. Eugenia[Jeannie] Nitowski) who was studying the Shroud of Turin. So he called her because she lived nearby in a Carmelite Monastery. They got together and both studied the tapes with Nitowski doing much of the microscopy on the tapes. It was at this time that I contacted Nitowski on a related matter and she, in turn, sent me some of the STURP tapes!! I, in turn, sent them first up to Dr. Zugibe, President of ASSIST, and when I got them back from him I forwarded them up to Dr. John A. De Salvo in Minnesota (John is Vice President of ASSIST) who personally hand delivered them to Ronald Youngquist of the 3 M company–where this tape material had begun their “life” in Shroud research many years before. Youngquist put together a professional team of scientists at 3 M to do their own study. Meanwhile, Ray talked with Joe on the phone and discovered what Joe had done. Joe had loaned the tapes to Jeannie Nitowski. “WHAT??????” Ray was upset. Upon further probing he learned that Jeannie had sent them to “Paul Maloney General Projects Director at ASSIST” Ray was more upset, “WHAAAAT????!!! ASSIST what? Paul who???? Then, being the curious kind of guy I am, I called Ray not knowing he was upset with everything that had happened. But Ray was still upset that the “chain of possession” had been violated. Actually, there is something to be said for Ray’s concern. It was his worry that the tapes might be contaminated with how someone else might use them and thereby vitiate their value. It’s a worry I would still have with the Max Frei Tapes. So when I got Ray on the phone he went ballistic! He demanded that the tapes be returned post haste pronto immediately! Ray and I later became good friends. But for the moment I was a phantom stranger who had no pedigree at all! So–sadly–I had to return the STURP tapes to Ray. 3 M never did get a chance to conduct the planned scientific testing they wanted to do. But I did, indeed, understand Ray’s concern and agreed with it. I think while Joe Kohlbeck may have taken some samples for testing in his lab at Hercules, I don’t think Jeannie compromised the tapes in any way. Her goal was only to do visual photo microscopy and I have a wealthy album of Kodak transparencies representing the work she did. I can assure you that neither Ray Rogers, nor Joseph Kohlbeck, nor Dr. Nitowski ever saw any of the Max Frei Tapes. They only had access to the STURP tapes. Moreover, the Riggi materials were in the form of dusts–not mounted on microscope slides at the time and they were not sent by Riggi to Ray, or to Joe, or to Jeannie for additional analysis. Best regards, Paul.","date":"2013-05-26","mins":"4:47 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34920","author":"joe_marino","post":"I think you mean 39–about slide 3 CB? Yes, I did send to him..","date":"2013-05-26","mins":"6:44 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-151535","author":"joe_marino","post":"We plan to have an online discussion between authors and readers–no requirement to have attended the conference. We also will have a discussion at the conference about future testing of the Shroud..","date":"2014-09-16","mins":"5:12 pm","url":"https://shroudstory.com/2014/09/16/and-interview-with-lind-and-antonacci/","cat":"carbon_14_dating","title":"An Interview with Lind and Antonacci"},{"id":"comment-18639","author":"joe_marino","post":"I had understood that it was supposed to be available in the U.S. Around now (it’s already dubbed into English for the Italian parts. Many of the people interviewed spoke in English. I will try and find out more..","date":"2012-10-30","mins":"9:52 pm","url":"https://shroudstory.com/2012/10/30/another-article-on-francesca-saracinos-la-notte-della-sindone-documentary/","cat":"carbon_14_dating","title":"Another Article on Francesca Saracino’s “La notte della Sindone” Documentary"},{"id":"comment-196893","author":"joe_marino","post":"The main article that Dan cites has links to 8 separate Shroud articles. One of the articles is titled “BARBERIS: “THE EXAMINATION OF THE CARBON 14 SHOULD BE REDONE” (https://translate.google.com/translate?sl=auto&tl=en&js=y&prev= t&hl=en&ie=UTF 8&u=http%3 A%2 F%2 Fwww.famigliacristiana.it%2 Farticolo%2 Fsindone dalle tracce ematiche al carbonio 14 le 11 cose da sapere.aspx&edit text).","date":"2015-04-20","mins":"4:47 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-196963","author":"joe_marino","post":"Hugh wrote, “If the story is not true, who was lying – Sox or Rinaldi?” I met Fr. Rinaldi, and I, and anyone who knew him, would tell you that there is ZERO chance that he would have lied about this.”.","date":"2015-04-20","mins":"4:07 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-197109","author":"joe_marino","post":"PHPL wrote “I have since then never read or heard of any official statement from the Holy See questioning the validity of the 1988 results or agreeing with any of the hypotheses or theories formulated by supporters of authenticity in attempts to discredit the Radio Carbon dating medieval date.” A Vatican spokesman around 1990 said that the 1988 results were “strange” and were not compatible with all the other scientific evidence. I will dig out this weekend the original article. Regarding the Vatican agreeing with theories, it claims no competence in scientific matters but has simply encouraged scientists to continue their research. If the Vatican really believed that the 1988 C 14 results proved the Shroud was not authentic, it’s most unlikely that they would have allowed exhibitions in 1998, 2000, 2010 and 2015..","date":"2015-04-21","mins":"8:52 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-197255","author":"joe_marino","post":"PHPL wrote ““(The radiocarbon test was) an experimental datum among the others with the validity and also the limits of the sectional tests that have to be integrated in a multidisciplinary field» An incidental, ambiguous, and low keyed oral unofficial statement that doesn’t even address the issue directly.” I found the original Associated Press article titled “Vatican considers new Shroud of Turin Tests,” dated Aug 19, 1990. Here are several key paragraphs: “The Vatican said Saturday it would consider proposals for new scientific tests on the shroud of turin to determine whether the linen is Jesus’ burial cloth. The announcement by Vatican spokesman Joaquin Navarro cast doubt on earlier test results indicating the shroud was only about 700 years old.” “. . . Navarro described the 1988 results as ‘strange’ and said they conflicted with previous tests which indicated the cloth could date back 2,000 years.” “Despite the 1988 findings, Ballestrero and other church officials disputed claims the results proved the shroud was a fraud, fake or forgery — words indicating the cloth was meant to deceive people.” There is nothing “incidental, ambiguous and low keyed” about this. It clearly states that the Vatican does not accept that the C 14 results prove the Shroud to be a forgery. Some may feel that the C 14 results do prove the Shroud to be a forgery, which justifies narrowing image formation theories to medieval origins, but I believe this statement alone is grounds for disputing that stance..","date":"2015-04-22","mins":"9:20 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-74023","author":"joe_marino","post":"Some clarifications about the order and circumstances of the invisible reweave theory. We did not start out with the Quad Mosaic photos when we first presented our theory in 2000. We had shown some experts photos that included a very high quality photo of the C 14 area that’s in the excellent book by Gino Moretto (of the Shroud Museum in Turin) called Shroud Guide. It was only brought out in 2008 in the Chemistry Today article from 2008 and the presentation made at the Ohio Shroud conference that year. Regarding the experts we showed it to, one was Thomas Ferguson & Co. Ltd, world renowned makers of Double Damask Linen, another was Louis Harner of Albany International Research Company, and the third was European trained weaver David Pearson, owner of the French Tailors in Columbus, Ohio, who was very familiar with the French invisible reweave technique. I will leave it to others to decide if the fact that they aren’t academics is significant. Going back to the Quad Mosaic, there’s a very fine article on Barrie’s site about it at http://www.shroud.com/pdfs/quad.pdf, with some important comments by the late Jean Lorre, an imaging expert from the Jet Propulsion Laboratory in Pasadena, California..","date":"2014-01-21","mins":"6:48 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74156","author":"joe_marino","post":"Here is another pertinent paper:Digital image processing techniques demonstrating the anomalous nature of the radiocarbon dating sample area of the Shroud of Turin at http://www.academicjournals.org/article/article1380798975 Morgan.pdf.","date":"2014-01-22","mins":"6:54 pm","url":"https://shroudstory.com/2014/01/22/comment-promoted-are-the-quad-mosaics-meaningless/","cat":"carbon_14_dating","title":"Comment Promoted: Are the Quad Mosaics Meaningless?"},{"id":"comment-15187","author":"joe_marino","post":"Freeman wrote: <> None of the explanations directly leads to a first century dating, but: 1) If the samples had been switched, it wouldn’t necessarily mean that the Turin shroud is first century, but it would certainly invalidate accepting the medieval results as determining the origin of the shroud. It would at least leaves open the possibility that the shroud is first century. To not acknowledge this is just disingenuous. 2) If there had been some form of contamination, it again wouldn’t necessarily mean that the Turin shroud is first century, but it would certainly invalidate accepting the medieval results as determining the origin of the shroud. It leaves open the possibility that an uncontaminated sample of the shroud could be first century. Again, to not acknowledge this is just disingenuous. 3) If there had been an invisible reweaving, a mixture of 16th century cloth and first century cloth would produce results very close to the mean results of the Oxford lab. (See http://www.shroud.com/pdfs/marben.pdf.) Once again, in this scenario, there is real possibility that the shroud could be 1st century. Along these lines, I just borrowed from my local library Freeman’s book, “Holy Bones, Holy Dust: How Relics Shaped the History of Medieval Europe” In a book of over 300 pages, the only thing Freeman says about the Turin shroud is “Calvin also criticizes a shroud in which it is claimed that the body of Christ was wrapped while he was in the sepulchre. (It seems similar to the shroud then in Chambery, now in Turin, but there were many such shrouds by the sixteenth century.) However, as Jewish burial custom requires the head to be wrapped separately and John’s Gospel specifically states that ‘a napkin which had been over his head’ is described as lying apart from the other wrappings in the tomb (20:6), then that in itself is enough to destroy the authenticity of the shroud.” How many of those “many such shrouds” have had hundreds of thousands of hours of scientific analysis? Given the fact that the Turin shroud, even if it is a fake, was significant in both Italian and French medieval history, I find it amazing that less than 100 words were devoted to it. And for the life of me, I cannot understand the argument that a napkin negates the possibility that the Turin shroud was one of the other wrappings. To me, to so easily dismiss something that is probably the most studied object in human history, is the height of disingenuousness..","date":"2012-08-18","mins":"4:58 pm","url":"https://shroudstory.com/2012/04/29/carbon-dating-the-shroud-of-turin-again/","cat":"carbon_14_dating","title":"Carbon Dating the Shroud of Turin Again?"},{"id":"comment-74166","author":"joe_marino","post":"Perhaps you can persuade Morgan to join in and directly address your comments. His email is jmorgan@towson.edu..","date":"2014-01-22","mins":"8:46 pm","url":"https://shroudstory.com/2014/01/22/comment-promoted-are-the-quad-mosaics-meaningless/","cat":"carbon_14_dating","title":"Comment Promoted: Are the Quad Mosaics Meaningless?"},{"id":"comment-104770","author":"joe_marino","post":"I just sent the author the following email: “I AM EXTREMELY UPSET AT THE WAY YOU’VE PAINTED SUE’S INVOLVEMENT. – What Sue Benford reported about her alleged telephone conversation with Rossman is unlikely to have occurred in a couple of ways. For one thing, it’s unlikely that Rossman would confess to a stranger over the telephone. – Secondly, it’s unlikely that he’d say that he didn’t want to discuss the matter any further just after confessing. While people sometimes do things that had seemed unlikely, and the scenario Benford described might have occurred, we’re being asked to accept a sequence of events that’s improbable upfront. – Benford made some misleading claims about the 1988 tape of Adler, and she claimed to have had an unlikely telephone conversation with Rossman. Has Rossman similarly been misleading or made unlikely claims in a relevant context? Not that I’m aware of. I see no way to deny that Rossman has more credibility. YOU MAKE A BLANKET STATEMENT “Benford made some misleading claims about the 1988 tape of Adler…” YOU GIVE NO SPECIFICS–WITH ALL THE IN DEPTH DETAIL YOU HAVE IN THIS ARTICLE YOU GIVE NO DETAILS TO BACK UP THAT STATEMENT. SHE DIDN’T MAKE ANY MISLEADING CLAIMS. REGARDING WHAT SHE REPORTED ABOUT THE PHONE CALL TO ROSSMAN, SHE WOULD NOT HAVE RISKED HER AND MY REPUTATIONS AND A POTENTIAL LAWSUIT BY CLAIMING THAT ROSSMAN SAID SOMETHING HE DIDN’T. JUST BECAUSE WHAT HE SAID AND HIS FOLLOWUP ACTION IS UNLIKELY DOES NOT GIVE YOU THE RIGHT TO CAST ASPERSIONS ON MY LATE WIFE. AT THE BEGINNING OF YOUR ARTICLE YOU ASK ANYONE WITH INFORMATION TO CORRECT OR EXPAND. PLEASE CORRECT THIS..","date":"2014-04-28","mins":"6:36 am","url":"https://shroudstory.com/2014/04/28/did-a-single-thread-get-tested-in-1982-is-it-important-to-know-and-why/","cat":"carbon_14_dating","title":"Did a single thread get tested in 1982. Is it important to know? And why?"},{"id":"comment-105636","author":"joe_marino","post":"I feel as if we’re beating a dead horse. I stand by the original story as it was told. I stand by the comments that I sent to the author, which I had posted. I have responded further to the author via private email..","date":"2014-04-29","mins":"6:25 am","url":"https://shroudstory.com/2014/04/28/did-a-single-thread-get-tested-in-1982-is-it-important-to-know-and-why/","cat":"carbon_14_dating","title":"Did a single thread get tested in 1982. Is it important to know? And why?"},{"id":"comment-104904","author":"joe_marino","post":"The answer to your question is yes. The excessive confusion in all of this makes the aspersions cast on Sue all the more aggravating..","date":"2014-04-28","mins":"9:53 am","url":"https://shroudstory.com/2014/04/28/did-a-single-thread-get-tested-in-1982-is-it-important-to-know-and-why/","cat":"carbon_14_dating","title":"Did a single thread get tested in 1982. Is it important to know? And why?"},{"id":"comment-105704","author":"joe_marino","post":"I did bring up that point in a private email to the author..","date":"2014-04-29","mins":"7:55 am","url":"https://shroudstory.com/2014/04/28/did-a-single-thread-get-tested-in-1982-is-it-important-to-know-and-why/","cat":"carbon_14_dating","title":"Did a single thread get tested in 1982. Is it important to know? And why?"},{"id":"comment-106117","author":"joe_marino","post":"Frankly, I am tired of all this badgering, so I am now done. I do have other things to do..","date":"2014-04-29","mins":"7:29 pm","url":"https://shroudstory.com/2014/04/28/did-a-single-thread-get-tested-in-1982-is-it-important-to-know-and-why/","cat":"carbon_14_dating","title":"Did a single thread get tested in 1982. Is it important to know? And why?"},{"id":"comment-194034","author":"joe_marino","post":"Dr. Ray Schneider made some interesting comments about this on another forum. I asked him if would mind posting it to this blog. He wrote: “You certainly have my permission to post it if you think it contributes to a thread on Dan’s blog.” Dr. Schneider presented a paper at the recent St. Louis conference. The paper and video can be found at http://www.shroud.com/stlouis.htm. Background on Dr. Schneider can be found at http://www.stlouisshroudconference.com/app get involved/presenters. In his posting, Dr. Schneider wrote: “I’m inclined to say that what it shows is that there is something quite profoundly anomalous about the whole C14 sample region and so no conclusion can be drawn from the C14 data with any reliability. The details only get worse since there were so many anomalous findings in the area like dyes, binders, fibers of cotton interwoven into the material. When you consider all the anomalies you have to say that the samples were from an area heavily contaminated with signs of manipulation. Both the Blue Quad Mosaic and the UV F show the whole area as anomalous. That being said one doesn’t then jump off a cliff and suggest that therefore the samples show that the corner was older so the shroud was younger. Rather the anomalies say this sample is unrepresentative of the object we are trying to date and no conclusions can be drawn, especially as we don’t have any idea why the area is anomalous. What drove the underlying manipulation? Why does the fluorescence deviate from the norm? I’m not one to salute C 14 dating as the be all and end all — as William Meacham has commented elsewhere based on C 14 datings he has done — only about 78% return a date compatible with other known dating markers. This particular dating was not very scientific one either on the side of the church or on the side of the carbon labs. They selected a terrible sample and only one. Then it was poorly documented by both the church and the carbon labs given the importance of the test and the clear limitations of the sampling. Then when the data showed clear inhomogeneity they didn’t say anything about it. It had to be pointed out by others. The extra Arizona sample was not dated and held back without comment. The public comments of some of the individuals involved vested absurd confidence in C 14 dating and denigrated the provenance of the shroud without any apparent knowledge of other data that points to a much older date than the one determined. I personally think the whole thing was an embarrassment to both the church and the scientific community.” In the email to me giving me permission to re post here his comments he then added: “I think all the data shows the sample to be totally anomalous based on objective data. It’s rather funny to then try to spin that into a narrative that the shroud is even younger than it dated. Whatever that is, it isn’t science. Most people don’t really understand science very well. One thing that is important to point out is that science only really works very well when you have control of all the variables. Then you can explore the details with objective observations. That’s what experiments are. They are all about control. Science works increasingly less well as the degree of control available deteriorates. In the case of objects like the shroud there is very little control so to get totally convincing results is rather more difficult than with objects over which you exercise more complete control. The accuracy of the C14 technology to measure C12 and C14 etc. Is not in question. The problem is always with surrounding aspects. The assumptions which are often not mentioned and not really controlled include that we know the C14 concentration a priori, that there are no enrichment mechanisms in play (ion exchange that selects for C14 or something), no significant additive or substituted materials, etc. Etc. Etc. These are all aspects of “control” and I think it is most disappointing that the labs didn’t document their samples and their testing better. Since we have quite clear evidence of location based dating anomalies it would have been nice to be able to explore the data set at the sub sample level. But we can’t other than statistically. The overwhelmingly confirmed conclusion is that there is something wrong with the samples. No amount of handwaving will change that.”.","date":"2015-03-22","mins":"12:28 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-209912","author":"joe_marino","post":"This is a follow up to my posting of 5:38 a.m. Of this morning: I would like to address several points in the authors’ editorial in addition to a previous posting countering their assertion that the invisible mending idea was based on low resolution photographs. They use the phrase “so called invisible mending.” The use of the pejorative “so called” is obviously meant to belittle the idea of invisible mending as a technique. For the validity of the technique, see for example: https://en.wikipedia.org/wiki/Invisible mending http://www.thefrenchreweavers.com/faq.htm http://www.invisible mending.com.au/ Also, if you look at 2 articles I co authored, various people postulated that different types of repairs may have been made on the Shroud over the years (see pre 1988 entries). Those articles can be found at: http://www.shroud.com/pdfs/chronology.pdf (link to 2nd article can be found at end of aforementioned link). I would also like to address the authors statement: ” “No one has hypothesized this before 1988 (before C14 analysis gave an ‘undesired’ date for the linen); …” Not true. Discussing preparations for the 1986 planning meeting in Turin, Gove writes in his 1995 book “Relic, Icon or Hoax: Carbon Dating the Turin Shroud” (Bristol and Philadelphia: Institute of Physics Publishing, 1996, pg. 90), “Tite felt there should be a textile expert present, if samples were to be taken, to make sure that we were getting a piece of cloth from the main body of the shroud on which the image was imprinted and not a rewoven area or a patch.” Note that this 2 years before the 1988 dating. The following passages about invisible mending on the Shroud are taken from the book “The Untold Story of the Holy Shroud” by Carlos Evaristo, the archivist for the Savoy family, who owned the Shroud until King Umberto died in 1983. (pp.217 218). According to the testimony of King Umberto II of Savoy (later recalled by friends, the exiled Monarch entertained in the 1950s, at Villa Italia, in Cascais, Portugal), oral tradition in the Savoy Royal Family confirmed that the Custodians of the Holy Shroud, from the earliest medieval period, had sporadically made copies of the Shroud,but also removed fragments from all around the outermost edges of the Burial Cloth, even as far inward as 10 centimeters and distributed these to close relatives, devotees and allies. That a mysterious seam or pronounced crease mark is visible all along one length of the Shroud is a fact that has baffled Scientists, some of whom have gone as far as to ridiculously (?) propose that a removed section was used to bind the Shroud to the Body at the chin, hands and feet and then sewn back onto the sheet, at a later date. What could also be probable is that this thick, long strip of the original cloth was removed at one point [and] cut up into sections for distribution in reliquaries. Another possible scenario is that this strip was used in a transfer boiling ritual or else separated, thread by thread, so as to have been incorporated into Ex Extractum copies of the Holy Shroud. Any one of these processes could have been carried out by the Canons guarding the Shroud at Lirey or Chambery without the consent or knowledge of whoever owned the Sacred Relic. Once carried out or the abuse discovered, the section could have ordered or rewoven, back onto the original whole or else the section in question was substituted with another piece of similar cloth. Pp. 218 & 220 (there is a picture on pg. 219) According to King Umberto II, the pious practice of sharing Major Relics of the Holy Shroud was, according to tradition, continued by the first three Savoy Lords who possessed it, although they, unlike some of their predecessor Guardians, never purposely removed fragments from their areas with the image of the Corpus Sancti (Holy Body.) Another fact confirmed by His Majesty was that it was traditionally affirmed, that at one point in the past, he edges of the Lenzuoli (Sheet) had become so tattered as to cause embarrassment or criticism of the Custodians, and those areas were repaired and rewoven using identical techniques, but obviously with similar, yet newer, materials containing dyes and other medieval manufacturing ingredients, in an attempt to better blend the new sections in, as best possible, with the original fabric. In truth, the presence of medieval dyes was detected in these areas and this fact has been already pointed out by Scientists as additional proof of the inaccuracy of the 1988 Carbon 14 dating test results that placed the samples taken from these areas, as having been fabricated sometime in the middle ages. In truth, any one of the aforementioned practices alone would also account, for not only the contamination of the fabric resulting in inaccurate Carbon 14 dating results, but also, the different types of linen, dyes, resins and fabric patches, discovered to have been present on the outermost edges of the sheet that usually held by Bishops during the exposition of the Sacred Relic to the public for veneration. (pp. 265 & 267 (picture on pg. 266) of the Evaristo book. The removal of all patches and of the reinforcement Holland Cloth backing of the Holy Shroud, in the year 2002, confirmed what King Umberto had stated, namely that small sections of the repaired and rewoven edges, had continually been removed from the Sacred Relic and probably as late as the second half of the 17th century. That thepractice of removing small fragments and even full length or width threads from the outer edges [of] the Holy Shroud, was a family tradition only finally suppressed by Duke Vittorio Amedeo II of Savoy, was another fact Umberto II of Savoy confirmed to Blue Army Founder and Shroud Devotee John Mathias Haffert, in the mid 1960’s. It was the same Vittorio Amedeo II, who along with his wife, the Infanta Anna d’Orleans, personally assisted Blessed Sebastiano Valfre on June 6th, 1694, in repairing the Sacred Burial Cloth of the The Christ, shortly before transferring the Sacred Relic to the new Chapel of the Guarini. Later, it became a tradition on June 6th of each year for the Savoy Royal Family to distribute relics of the backing cloth. It was in 1694, that in accordance to the Savoy Family tradition, some of the removed sections of thread were then woven into full size replicas of the Sindone (Shroud) for private or public veneration in Convents and Cathedrals during popular Holy Week celebrations. Unlike the meticulous repair work that had been carried out in previous centuries by religious expert weavers following the damage caused to the Shroud by fires and which left little trace of the removed sections, the intervention of the Savoy and the Blessed was aimed primarily at replacing the cloth backing of the Relic giving it added thickness and strength and also a better contrast to the image. The last intervention by religious sisters had been considered poor by the various members of the House of Savoy since, rather than reweaving the areas nearest the outermost edges that were either missing or had frayed from manipulation and wear, they had camouflaged them with cloth coverings and patches. The backing of black cloth added by Blessed Sebastiano Valfre was later removed by Princess Maria Clotilde di Savoia, (1843 1911) Consort of Prince Napoleon, who substituted it for a pink silk on April 28th, 1868, on account of the backing having also become deteriorated from manipulation and removal of pieces for relics. Note what Piero Savarino, who was scientific advisor to the Turinese Cardinal Poletto, wrote. In a 1998 booklet, he stated that the 1988 C 14 testing might have been erroneous due to “extraneous thread left over from invisible mending‟ routinely carried out in the past on parts of the cloth in poor repair. Savarino went on to emphasize: ―…if the sample taken had been the subject of invisible mending‟ the carbon dating results would not be reliable. What is more, the site from which the samples actually were taken does not preclude this hypothesis. (Source: Savarino, P. And Barberis, B. “Shroud, Carbon Dating and Calculus of Probabilities.” London: St. Paul‘s, 1988, pp.21 22.) Now, it’s possible that in the original Italian, “invisible mending” might not equate specifically to the type of technique we hypothesized, but it’s another strong example of the fact that it is known that repairs have been made to the Shroud, making such a technique plausible. The authors of the editorial conclude “The work of the late Dr. Rogers has been exploited to support a pseudoscientific hypothesis which is in no way confirmed by the reported data.” The ascription of the word “pseudoscientific” to a clearly scientific theory again suggests a bias on the part of the authors. I agree with the last part of their last sentence that “the scientific community and the general public can only be misled by this paper,” but with application to their own paper. Rogers was a brilliant scientist who was not easily exploited and was actually one of the founders of Thermochimica Acta. He actually thought he would be able to prove me and my late wife wrong in 5 minutes, and said he was actually embarrassed to have to say we were right. His 2005 paper fully supported our claims from 2000. In addition, another paper by me and my wife was published in 2008 in a peer reviewed journal called Chemistry Today and was titled “Discrepancies in the radiocarbon dating area of the Turin shroud (http://www.shroud.com/pdfs/benfordmarino2008.pdf) Finally, if one of the points of peer reviewed literature is to help fine tune the author’s thinking, it seems a bit questionable that this editorial comes 10+ years after the original article by Rogers and the death of the author..","date":"2015-09-08","mins":"8:32 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-210142","author":"joe_marino","post":"Hugh and Charles, in Pam Moon’s booklet for her exhibition, she mentions that Donna Campbell of Thomas Ferguson Irish Linen acknowledges that the fabric of the Shroud is not uniform, but Campbell also says “there are signs in the Shroud sample that direct the notion of mending or reweaving of the actual woven fabric.” Campbell wrote a 17 page report that I’m having trouble locating it electronically. I’ve emailed Pam Moon for help in supplying it. In the meantime, Pam has a very good article on her site related to this at http://www.shroudofturinexhibition.com/Shroud of Turin exhibition/Three threads files/The%20black%20thread%2023rd%20 Sept.pdf ..","date":"2015-09-11","mins":"4:03 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209876","author":"joe_marino","post":"The Middle Ages is generally considered to have been between the 5th and 15 centuries and the Early Renaissnace is generally considered between the 14th and 17th centuries, so there is actually a bit of an overlap. So, I don’t think the use of “medieval” is a huge issue here. Regarding the invisible mending being a “pseudoscientific hypothesis,” I will post something this evening..","date":"2015-09-08","mins":"5:38 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-2235","author":"joe_marino","post":"When Sue Benford and I submitted to Radiocarbon in 2001 our paper on the 16th century patch (a.k.a. Invisible reweave), we were told who the reviewers were: *Paul Damon, head of the U. Of Arizona laboratory *Jacque Evin, French C 14 expert present at the 1988 sample taking *Gabrial Vial, French textile expert present at the 1988 sample taking *Franco Testore, Italian French textile expert present at the 1988 sample taking *Harry Gove, inventor of the C 14 method, who had literally bet a companion that the Shroud was medieval and was heavily involved in various aspects of the dating, including working to keep STURP from being involved in any testing Do you think the deck was stacked against us?.","date":"2011-01-18","mins":"9:08 pm","url":"https://shroudstory.com/2011/01/18/even-more-on-suspicious-university-of-arizona-testing-of-the-shroud/","cat":"carbon_14_dating","title":"Even More on Suspicious University of Arizona Testing of the Shroud"},{"id":"comment-209732","author":"joe_marino","post":"One prominent skeptic likes to point out in his mainly recycled writings about the Shroud that several members of STURP were on the executive committee of the Holy Shroud Guild. Ergo, those scientists were biased and their findings were biased. It’s a double standard to have no problems with a skeptical scientist that’s part of a group that purports to always come up with a supposed rational explanation for all things paranormal, including any claims related to religion..","date":"2015-09-06","mins":"10:04 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-215993","author":"joe_marino","post":"I assure you it was not an attempt to post under a new anonymous pseudonym, it was simply an error in filling out the boxes. I posted that message under my own name, so why would I intentionally post the same message under an anonymous pseudonym? What this does show, however, is that you have made an unfounded assumption. For some, that could be a factor when they try to evaluate your scientific assertions. Regarding “shroudie1,” I doubt if anyone would want to be awarded such as label, as it is somewhat a derisive term. And the 1 has nothing to do with primacy–I chose a number as part of the string and 1 was as convenient as anything. Whatever your talents are as a scientist, omnipotence is not one of them..","date":"2015-12-09","mins":"9:17 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-215969","author":"joe_marino","post":"So people who believe the Shroud is authentic are not allowed to present new facts and develop an existing theory? And can’t advise someone who independently advocates the theory? But people who doubt the Shroud’s authenticity are allowed to go to their labs each morning and put forth their views and don’t have any preconceptions? The fact that the data is not even alluded to is telling..","date":"2015-12-09","mins":"5:48 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-216136","author":"joe_marino","post":"Pam Moon has indicated to me that she will periodically be updating the paper as she gets new information..","date":"2015-12-10","mins":"11:22 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-216385","author":"joe_marino","post":"Louis, No. Pam wrote “As there is strong evidence for dye in the radiocarbon date material it is worth exploring reasons for the presence of dye. This can only be speculative as there is no definitive explanation. The most obvious answer is that additional cotton material was added to the corner and dyed to cover up the colour difference. There is significant textile evidence of the use of invisible reweave presented by Sue Benford and Joe Marino.28 Donna Campbell reported that the Oxford photographs may direct research toward ‘the effects of mends on the sample.’29 Therefore cotton was added to the corner and then the whole area was painted with dye to make a continual colour. Secondly, the linen needed dyeing for a different reason and cotton was added to the corner to make that dyeing and colour matching easier. Rogers alluded to that: 17) The colored encrustation does not seem to stick to linen as well as cotton. Some linen fibres appear to be nearly clean, and the cotton fibrils can be heavily encrusted in the same thread sample. This suggests that cotton was added to the Raes threads to make dyeing possible. The cotton in the threads would have made color matching easier. Linen is difficult to dye or stain. 7 Thirdly the purpose of the dye and the additional cotton was to make the corner look like a different part of the Shroud: ‘the object must have been to match colours.’7 The cut area has a similar colour to the fire and water damage immediately to its right although the corner was not damaged by fire in 1532. If the corner was removed because of bacterial damage following the use of douse water and the linen was bleached to kill the organisms damaging the Shroud then dyeing the area was a very effective cover up. Fourth, a combination of all three of the above.” And finally, “Consequently, as Rogers wrote: ‘the radiocarbon sample can not be valid for dating the time at whichthe cloth was produced.’24.","date":"2015-12-13","mins":"8:45 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-215987","author":"joe_marino","post":"For those willing to consider others’ opinions about Rogers’ reputation, please see http://shroud.com/pdfs/stlschwortz2ppt.pdf.","date":"2015-12-09","mins":"7:55 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-75954","author":"joe_marino","post":"Daveb commented that if the 1988 Shroud dating had come out 1st century, the skeptics would have objected to the methodology (and probably still would be objecting). I agree 100%. Carbon dating is not infallible, except seemingly in the case of the Shroud. Generally in radiocarbon datings, when C 14 dates do not match other data, the C 14 data are routinely thrown out, except in the case of the Shroud. Based on the basic rules of science, those who do not accept the results of the Shroud dating have a legitimate beef..","date":"2014-02-02","mins":"9:21 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-179003","author":"joe_marino","post":"Charles wrote “Do we know whether ‘Rome’ or ‘Turin’ has formally rejected the carbon dating?” The Vatican Press Office came out in 1990 with a statement saying the 1988 results did not match with all of the data collected by the 1978 examination. Also, it’s unlikely the Vatican would have allowed exhibitions in 1998, 2000, 2010 and the upcoming one in 2015 if they felt that the 1988 evidence conclusively proves the Shroud is a fake..","date":"2014-12-24","mins":"6:50 pm","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","title":"Just Published:  What Went Wrong with the Radiocarbon Date?"},{"id":"comment-47146","author":"joe_marino","post":"There’s a great quote I’ve seen about C 14 for which can’t remember the source. It basically says if the C 14 results are good, they’re trumpeted in the article text, if the results are questionable, it’s relegated to a footnote and if the results are bad, they’re completely left out. I’ll hunt a bit for it when I get a chance to see if I can find..","date":"2013-10-11","mins":"11:34 pm","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","title":"Low Level Fraud? and more"},{"id":"comment-47233","author":"joe_marino","post":"O.K., thanks for the reference. Here is what it says, “A well known specialist of the subject, Michael Winter, does not hesitate to declare this in writing, ‘If a Carbon 14 dating confirms our theories, we show it clearly in the main text; if it contradicts them, but not completely, we relegate it to a footnote; if it contradicts them completely, we hide it from everybody.'” Marinelli’s/Petrosillo’s original source is cited as “Giuseppe M. Pace, Sindone e C14, CPS, November/December 1988, pg. 50.”.","date":"2013-10-12","mins":"11:26 am","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","title":"Low Level Fraud? and more"},{"id":"comment-2259","author":"joe_marino","post":"Radiocarbon is a peer reviewed journal but Jull is indeed the editor, so if there was peer review, one has to wonder how rigorous it would have been. This is very similar to the late Dr. Walter Mc Crone’s peer reviewed journal “The Microscope.” He published one or two Shroud articles in there, but that was literally his own journal, so once again, one has to wonder about the rigor of any article written by a principal of the journal. The circumstances of Jull’s article, much like the Arizona samples, will likely remain murky. (I was not even tempted to say “will likely remain shrouded in mystery.).","date":"2011-01-21","mins":"8:04 pm","url":"https://shroudstory.com/2011/01/21/mark-oxleys-paper-is-a-must-read/","cat":"carbon_14_dating","title":"Mark Oxley’s Paper is a Must Read"},{"id":"comment-172793","author":"joe_marino","post":"Mario wrote “This paper should not be taken too seriously. The sample area of the 1988 radiocarbon dating is NOT a rectangle. Therefore, the very simple calculation of 8.1 cm x 1.6 cm for the area of the sample cannot be correct, whatever the width and length used. This error completely changes all the other calculations and the main conclusion.” Important, though, is the assertion, that the Shroud has undergone various types of repairs, including “invisible mending.” One would have liked to see better documentation, though..","date":"2014-11-24","mins":"7:06 am","url":"https://shroudstory.com/2014/11/23/paper-chase-the-shroud-of-turin-and-its-radiodating/","cat":"carbon_14_dating","title":"Paper Chase:  The Shroud of Turin and its Radiodating"},{"id":"comment-32672","author":"joe_marino","post":"Dave referred to a paper that myself and my late wife Sue Benford wrote. The version he cited was in the British Society for the Turin Shroud Newsletter. There is a more complete version at http://www.shroud.com/pdfs/marben.pdf. In that version the colorized Wilson diagram has the caption “Proposed Carbon Dating Sequence from Actual Results. So, it was a guestimate based on Wilson’ photo, Bryan Walsh’s diagram of “Distance from edge of Shroud cloth vs. Radiocarbon date in YBP” and the published results of the labs. Regarding Hugh’s question regarding the instructions for the labs, I assume he means the original protocol, which reads: CONCLUSIONS AND PROCEDURAL STEPS The Turin Workshop on “Radiocarbon Dating of the Turin Shroud” was held from 29 September to 1 October, 1986. Twenty two persons, representing the Archbishop of Turin, the Pontifical Academy of Sciences, and laboratories in France, Hong Kong, Italy Switzerland, the United Kingdom and the USA, participated in the workshop. After two and one half days of technical discussions, carried out in a spirit of amity, the following conclusions and procedural steps were agreed upon. 1. This is the time for radiocarbon dating of the Shroud of Turin. 2. A minimum amount of cloth will be removed, which is sufficient (a) to ensure a result that is scientifically rigorous and (b) to maximize the credibility of the enterprise to the public. For these reasons, the decision was made that seven laboratories will carry out the experiment: five accelerator mass spectrometer laboratories and two small counter laboratories. 3. The samples should be taken from an unobtrusive part of the Shroud, and from a portion which is not likely to yield other useful information. The samples should not include charred material. They should be prepared in a form, not too small, so as to allow reasonable pretreatment processes. In addition to the Shroud samples, the British Museum will also prepare and provide two control samples for each laboratory. 4. For logistic reasons, samples for radiocarbon dating will be taken from Shroud immediately prior to a series of other experiments planned by other groups. Selection of the material to be removed and the actual removal will be the responsibility of Mrs. Flury Lemberg (Abegg Stiftung, Bern, Switzerland). 5. Seven samples containing a total of 50 milligrams of carbon will be taken from the Shroud. In addition, a single dummy sample will be prepared by the British Museum. These Shroud samples and the dummy sample will be distributed to the seven laboratories in such a way as to ensure that the seven laboratories are not aware of the identification of their individual sample. This distribution will be the responsibility of the following three certifying institutions: the Pontifical Academy of Sciences (Professor C. Chagas), the British Museum (Dr. M. S. Tite) and the Archbishopric of Turin (Professor L. Gonella). 6. The taking of the samples will be done so that representatives from the seven laboratories will have complete knowledge of the process. Samples will be delivered by the three certifying institutions (See 5 above) directly and immediately to the representatives of the seven laboratories who will thereafter be responsible for the samples. 7. At this time, a date will be chosen for submission of experimental results from the seven laboratories to the following three analyzing institutions: the Pontifical Academy of Sciences, the British Museum, and the Metrological Institute of Turin, “G. Colonnetti”. These institutions will keep the results in sealed envelopes until an agreed upon date, at which time they will be opened for statistical analysis. 8. After the analysis of the experimental results by the three analyzing institutions, a meeting will be held in Turin between the three analyzing institutions and representatives of the seven laboratories to discuss the results of the statistical analysis with the objective of deciding the final result of the measurement program. 9. The radiocarbon groups will, through correspondence, establish a common format for presenting the experimental results to the analyzing institutions. 10. The cost of the experiments and the analyses will be borne by the participating institutions. Travel and living expenses entailed will be provided by the Pontifical Academy of Sciences unless other arrangements are made. 11. Samples from the Shroud will be taken by May, 1987. It is hoped that the final result will be available by Easter of 1988. This final result will be published in an appropriate scientific journal as a collaborative paper..","date":"2013-05-02","mins":"9:48 pm","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","title":"Special Request from Hugh Farey"},{"id":"comment-32755","author":"joe_marino","post":"Hugh, Dr. Jull, head at Arizona, is pretty good about responding to emails. His address is: jull@email.arizona.edu.","date":"2013-05-03","mins":"11:21 am","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","title":"Special Request from Hugh Farey"},{"id":"comment-32794","author":"joe_marino","post":"Hugh, I’ve also had some correspondence with Ramsey at Oxford. His address is christopher.ramsey@riaha.ox.ac.uk. George Bonani’s address at Zurich is bonani@phys.ethz.ch ..","date":"2013-05-03","mins":"6:37 pm","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","title":"Special Request from Hugh Farey"},{"id":"comment-15525","author":"joe_marino","post":"Forgot to give the link for Emanuela’s paper: http://tinyurl.com/cammkgx. It can be gotten by searching under her name on the Blog or in the Valencia conference page at shroud.com.","date":"2012-08-27","mins":"8:58 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","title":"Was this page removed because it was just too political?"},{"id":"comment-15586","author":"joe_marino","post":"Ron asked if I had written “a paper (outside of the patch hypothesis) on the c14 dating and it’s issues?” You’re probably thinking of one I co wrote: “Chronological History of the Evidence for the Anomalous Nature of the C 14 Sample Area of the Shroud of Turin” (http://www.shroud.com/pdfs/chronology.pdf). Barrie’s recent update also has another article “Bibliography of Major Sources Pertaining to the Events of the 1988 C 14 Dating of the Shroud of Turin” (http://shroud.com/pdfs/marinobib.pdf)..","date":"2012-08-29","mins":"7:53 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","title":"Was this page removed because it was just too political?"},{"id":"comment-15512","author":"joe_marino","post":"Actually, it appears that it was just moved to another page: http://www.crc internet.org/1401 ii the conclusion of a new trial.html. (I had trouble pulling up the wayback page to compare, although I was able to get it this morning.).","date":"2012-08-27","mins":"6:07 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","title":"Was this page removed because it was just too political?"},{"id":"comment-15522","author":"joe_marino","post":"For anyone who has not yet read Emanuela Marinelli’s C 14 setting paper presented at the 2012 Valencia conference, I highly recommend it. It’s 30 pages, has over 250 footnotes, and is very thorough..","date":"2012-08-27","mins":"8:20 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","title":"Was this page removed because it was just too political?"}]
