[{"id":"comment-193654","author":"joe_marino","post":"I can’t help but comment that while the St. Louis conference was labeled a “pseudo conference,” material from that conference was used as a springboard by that labeler for ideas in at least 2 threads. Perhaps the conference fulfilled one of its aims to further research?.","date":"2015-03-17","mins":"9:17 pm","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-193864","author":"joe_marino","post":"He bowed out several years ago due to health issues. I haven’t seen a single posting since..","date":"2015-03-20","mins":"9:30 am","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-195011","author":"joe_marino","post":"If one starts out thinking like a medieval artisan in order to solve the mystery of the Shroud, with the obvious implication that the Shroud has to be a medieval forgery, then one is guilty of a Joe Nickell favorite standard: starting with a conclusion and working backwards. If a scientist can find no other way to form a Shroud like image other than with lasers, he may not be proving that the Shroud was made by lasers, but it could indicate that something out of the ordinary might have happened with the Shroud, something perhaps even beyond the understanding of science, possibly short term, possibly long term. It could lead down other roads. Assuming it’s medieval is a one way road. If science is the search for truth, it’s clear which approach is more scientific..","date":"2015-03-31","mins":"7:40 pm","url":"https://shroudstory.com/2015/03/31/whats-to-like-over-on-colins-blog-right-now/","cat":"image_theory","title":"What’s to like over on Colin’s blog right now?"},{"id":"comment-33879","author":"joe_marino","post":"This series also has a segment for the Vinland Map: http://www.youtube.com/watch?v=az Vc CM1a D5c..","date":"2013-05-17","mins":"12:50 pm","url":"https://shroudstory.com/2013/05/17/quest-tv-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"Quest TV: Treasures Decoded: The Turin Shroud"},{"id":"comment-195068","author":"joe_marino","post":"Colin wrote “There’s the crucial difference between Paolo and myself. He’s already at a dead end, but does not appear to realize it.” David Mo wrote “At the moment we can only say two things: the fabric is medieval and the image is not the imprint of a human body. At 99% if you want. The other 1% is for miracles.” Those are your opinions, nothing more. The fact that numerous bonafide scientists believe that the Shroud could be authentic and that over 3 million people visited the Shroud in the last 3 exhibitions (with probably another million this spring) indicate that it’s not obvious to many that the Shroud is a medieval forgery..","date":"2015-04-01","mins":"5:40 am","url":"https://shroudstory.com/2015/03/31/whats-to-like-over-on-colins-blog-right-now/","cat":"image_theory","title":"What’s to like over on Colin’s blog right now?"},{"id":"comment-195145","author":"joe_marino","post":"Colin wrote, “Maybe others understand the point you are making, or trying to Joe. Sadly i don’t.” I’ve been responding to other posts and making some observations about the comments regarding the assertion that the Shroud is medieval. I don’t understand what’s so hard to understand. Regarding your statement about your approach appearing to cause wholesale offence, it’s quite up to you if you want to continue posting. I personally think it’s healthy to hear comments from someone of a different position. It can help one fine tune one’s own thinking..","date":"2015-04-01","mins":"8:19 pm","url":"https://shroudstory.com/2015/03/31/whats-to-like-over-on-colins-blog-right-now/","cat":"image_theory","title":"What’s to like over on Colin’s blog right now?"}]
