[{"id":"comment-46649","author":"joe_marino","post":"I hope the people who dismiss the Shroud because the Gospel of John mentions “linen strips” see this..","date":"2013-10-09","mins":"10:30 am","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-46734","author":"joe_marino","post":"At least 1 major translation has used “strips”–I can’t remember which one it is. But most people don’t pay too much to Biblical scholarship before voicing an opinion on whether the Shroud is authentic or not. Another thought comes to mind concerning arguments based on John’s gospel–more related to common sense than scholarship. I’m always amazed at how many people use the argument that John mentions linen clothes and since the Shroud is just one piece, it can’t be authentic. That’s like saying if I lost a pair of shoes and find just one, it can’t be part of the pair because I originally lost 2. And these folks somehow never think to mention that the Synoptics used the word “sindon,” which fits very well with the Shroud..","date":"2013-10-09","mins":"11:36 pm","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-34154","author":"joe_marino","post":"I communicated with Paul regarding the madder rose. I’ve asked him to put something together for me to post but he’s not gotten back with me. Basically, he said madder rose is not found throughout the Shroud, just in 3 areas: the Raes corner and STURP area 3 CB and 3 AB..","date":"2013-05-20","mins":"9:30 pm","url":"https://shroudstory.com/2013/05/18/because-it-needed-to-be-said-contaminated-in-the-weavers-workshop/","cat":"uncategorized","title":"Because it Needed to be Said: Contaminated in the Weaver’s Workshop"},{"id":"comment-46779","author":"joe_marino","post":"Daveb, I’ve seen people in print equate “bands” with “strips.” Thanks for the clarification..","date":"2013-10-10","mins":"5:54 am","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-34262","author":"joe_marino","post":"Paul Maloney does not believe that madder rose is found all over the cloth. The fact that it was found on the 2 STURP tapes away from the Raes corner could be from a simple trace migration. Paul and I will be having a discussion soon and I will post more as I get it..","date":"2013-05-21","mins":"9:35 pm","url":"https://shroudstory.com/2013/05/18/because-it-needed-to-be-said-contaminated-in-the-weavers-workshop/","cat":"uncategorized","title":"Because it Needed to be Said: Contaminated in the Weaver’s Workshop"},{"id":"comment-50592","author":"joe_marino","post":"Barrie has told me that in 1978 they weren’t concerned too much with the corner from which the samples were taken, of course not knowing it would become important 10 years later. He says that the late Vern Miller might have taken some photographs that could shed some additional light–Miller’s collection is now in the hands of Tom D’Muhala..","date":"2013-11-09","mins":"8:07 pm","url":"https://shroudstory.com/2013/11/08/cementing-over-central-park/","cat":"news_&_views","title":"Cementing Over Central Park"},{"id":"comment-184616","author":"joe_marino","post":"Hugh wrote, “I do not believe a single word of the last paragraph. I do not believe any of the experiments described were carried out; I do not believe any of the results occurred.” It’s one thing to believe a certain experiment is silly or brings discredit to sindonology, but it’s another to just dismiss the claim that the experiment was done. I was not involved in the experiment that Jeffrey refers to, but he did visit Sue and me in 1998 and I do remember them working on this. I’m not sure I have any documentation in files of Sue that I still have but I recently sent Jeffrey various materials related to some of her experiments, so there might be something in those materials and/or Jeffrey may have some of his own material related to the experiment in question..","date":"2015-01-19","mins":"5:22 pm","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","title":"Jeffrey Skurka on Buffalo Catholic Radio Station"},{"id":"comment-50513","author":"joe_marino","post":"I really enjoyed this whole thread and wanted to add my two cents worth regarding a few issues. First of all, regarding current complaints from pro authenticity people regarding the events surrounding the 1988 dating: it’s safe to say that if the 1988 testing had come out 1st century, skeptics would still be complaining today about some of the things that went on such as the discrepancies in the sizes and weights of the samples. One of the most important scientific tests in all of history and they can’t even get the basic facts about the samples right? And that was just the beginning of the problems. The Shroud should have been tested in 1988 with the multi disciplinary plan that STURP has proposed. No matter how useful C 14 is as a scientific tool, it is often inaccurate. With all of the mysteries of the origins of the Shroud and its known and unknown history, more should have been thrown at the Shroud, not less. If the Church was open enough to have allowed the 1978 testing, it should be open enough to allow further testing on the most important relic in Christianity, especially with all the controversy with the 1988 dating. While I suppose the Church would run the risk of alienating some Christians if further testing proved the Shroud not authentic, they could have such a positive effect on Christians if further testing did not disauthenticate it. And given all the scandals in the Church, you’d think they’d allow testing just to put the attention somewhere else. Regarding skeptics and agnostics about the Shroud, their comments, I think, help to force pro Shroud people to think outside the pro authenticity box, which can be rather small and compressed. Regarding Kelly’s: “Rap music mutually exclusive terms IMO, but to each his own” and compliments about the Beatles: AMEN! And a question for another blog: why can’t Mc Cartney ever come up anymore with some of the great songs he wrote as a Beatle? Regarding the book Elvis was reading when he died, I have a handwritten letter from the late Frank O. Adams, author of the book “A Scientific Search for the Face of Jesus,” who told me that Elvis had been reading his book, which was not totally on the Shroud, but contained a lot of material on it. “Now it’s time to say Goodnight…” (Lennon & Mc Cartney from the fantastic “White Album”)..","date":"2013-11-09","mins":"1:47 am","url":"https://shroudstory.com/2013/11/08/cementing-over-central-park/","cat":"news_&_views","title":"Cementing Over Central Park"},{"id":"comment-16057","author":"joe_marino","post":"Now that one of greatest mysteries on the planet has been debunked (in a mere 25 pages with lots of spacing between lines), I suppose I can move on now to something that can have real impact on people’s lives: starting fan clubs for Lindsay Lohan and Charlie Sheen..","date":"2012-09-09","mins":"9:44 am","url":"https://shroudstory.com/2012/09/09/lyingwonders-com-satan-is-behind-it/","cat":"news_&_views","title":"LyingWonders.com:  Satan is behind it"},{"id":"comment-8045","author":"joe_marino","post":"I’ve noticed over the years that many researchers have talked about the Shroud being mentioned in the same breath with phenomena like UF Os, etc. The implication here is that visitors from space (or time?) don’t (can’t?) exist. Although the term UFO is synonymous in some people’s minds with extraterrestrial spaceships, UFO just stands for Unidentified Flying Objects. Those certainly exist. While 95% of sightings are probably misidentified phenomena or hoaxes, about 5% have never adequately been explained. That equates to a lot of cases. These includes ones that astronauts, pilots, military personnel, police, etc. Have seen and reported. These do not preclude the possibility of the UF Os being extraterrestrial craft. I defy anyone to come up with a simple rational explanation for the 1980 UFO incident at the Bentwaters/Woodbridge Air Force bases in England(also sometimes referred to “Rendelshem Forest, which is between the two). By some accounts, as many as 30 personnel saw a landed craft over three straight nights the week after Christmas. These men, who were overseers of nuclear weapons on the bases, claimed to see and experience things they were not at all familiar with. One sargeant claimed to have actually touched the craft one of the nights. The Deputy Base commander has gone on record saying he believes they saw an extraterrestrial craft. Whatever the resurrection was, it apparently happened to one man in history, so it does exist, even if it’s never happened to anyone else. While trying to explain the Shroud, many people fail to look at ALL the evidence and just cherry pick data that support their stance. There are unidentified flying objects, and one cannot simply explain all cases without looking at all the data. Who knows, maybe God didn’t want to trust the whole universe to just humans..","date":"2012-02-08","mins":"8:07 am","url":"https://shroudstory.com/2012/02/07/quote-for-today-by-arthur-schopenhauer/","cat":"quotations","title":"Quote for today by Arthur Schopenhauer"},{"id":"comment-172744","author":"joe_marino","post":"Russell’s comments about the JFK assassination brings out an important point: despite thousands of books and articles that suggest that the Oswald did it alone theory is not plausible, there are plenty of people who still buy into it. In other words, evidence doesn’t play a big factor in their opinion of what happened. It’s similar with the Shroud–and I realize that pro and con both feel that the other side is the one ignoring the weight of the evidence..","date":"2014-11-23","mins":"10:22 pm","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","title":"Second Annual Bertrand Russell Award in Sindonology"},{"id":"comment-25450","author":"joe_marino","post":"Whether the movie is good or bad, it’s safe to say this movie would not have been released in 1989..","date":"2013-02-23","mins":"9:55 pm","url":"https://shroudstory.com/2013/02/23/more-on-the-power-of-few-movie/","cat":"news_&_views","title":"More on The Power of Few Movie"},{"id":"comment-216569","author":"joe_marino","post":"I’m really sorry to hear this. I’m glad to hear, though, you’ll keep the blog up for future research and reading–it’s an absolutely indispensable resource. Thanks for all your efforts on this. Good luck on all your future endeavors..","date":"2015-12-15","mins":"8:56 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-202573","author":"joe_marino","post":"After the St. Louis conference, I had a one on one talk with Prof. Barberis. 2 of the points I made were: A) New testing on the Shroud is important because of its evangelisation potential and B) 2 of the most knowledgeable people on the planet on the Shroud, John Jackson and Barrie Schwortz will not be around forever and it would be wise to do any new testing while they are still alive..","date":"2015-06-17","mins":"8:34 pm","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","title":"The Masters of Comedy in Piedmont"},{"id":"comment-42496","author":"joe_marino","post":"Here is the announcement in the update about the 2014 St. Louis conference: There will be an international Shroud Conference titled “Shroud of Turin: The Controversial Intersection of Faith and Science” in fall 2014 in St. Louis, Missouri, USA. Due to scheduling issues with several potential speakers, the exact date has not been picked, but it likely will be September 18 21, September 25 28, or one of the weekends (Thursday through Sunday) in October. The date is expected to be selected very soon. The conference is being co sponsored by Resurrection of the Shroud Foundation and Salt River Production Group. Subject matter for the papers is open to any major aspect of sindonology, eg., Science, History, Art, Theology and can also include other relevant artifacts such as the Sudarium of Oviedo, Manoppello Cloth and the Tilma of Guadalupe. Abstracts should be submitted electronically to Joe Marino no later than 15 March 2014. If for some reason the abstract can’t be sent electronically, please send to Joe Marino / 2408 Sovron Ct. / Dublin, Ohio 43016 / USA. Authors will be limited to a maximum of 2 (two) papers as primary or secondary author. Abstracts will be sent to selected reviewers, who will not be informed of the identity of the author. Authors will also be required to send vitaes. English will be the official language of the conference. Abstracts are to be submitted and papers are to be read in English. Many new and exciting papers are expected to be presented. It is hoped that the conference will draw numerous established sindonologists, as well as many new ones. As more details become known, they will be disseminated via http://www.shroud.com and http://www.shroudstory.com..","date":"2013-08-31","mins":"10:33 am","url":"https://shroudstory.com/2013/08/31/update-to-shroud-com-2/","cat":"news_&_views","title":"Update to Shroud.com"},{"id":"comment-197457","author":"joe_marino","post":"Colin wrote “As I say, I’m only here for the science, determined to expose pseudoscience at every opportunity, on account of the damage it does to the reputation of science and of real scientists to say nothing of one’s irritation in reading headlines that state “Scientists say Turin Shroud is supernatural” (Independent, December 2011). Anyone who says that to the media does not deserve to call himself a scientist.” Scientists do not write article headlines. As I recall, there were some comments on this blog at the time how the journalists went beyond what Paolo and others said. Journalists are notorious for getting various things wrong in articles about the Shroud (and other topics as well.).","date":"2015-04-24","mins":"8:07 pm","url":"https://shroudstory.com/2015/04/23/the-real-meaning-is-not-authenticity/","cat":"2015","title":"The Real Meaning Is Not Authenticity"}]
