[{"id":"comment-166709","author":"joe_marino","post":"Colin wrote “Like why were no questions permitted to speakers at the St;Louis pseudo conference?” We’ve been over this before. You are trying to make it look like it was a control issue. I explained to you that there were so many accepted papers that there wasn’t time for question and answers. I also let everyone know that the conference site has a discussion forum in which there can be an ongoing discussion between the presenters and the attendees/public. Only a few questions and answers can even be done after a presentation so the forum has an advantage over the onsite forum. You made a point of saying you wouldn’t dream of having a conference without having questions and answers. I’ll say again what I said in one of my postings: it wasn’t your conference. And let me repeat again that with the conference site openly showing what was to take place, we had 162 people from 8 countries. Take a hint. People aren’t concerned that you consider it a pseudo conference. Frankly, by saying again after my postings that no questions were permitted, you come across as someone who has an axe to grind, and you will win few people to your side..","date":"2014-10-29","mins":"7:49 pm","url":"https://shroudstory.com/2014/10/29/an-apology-to-colin-berry-and-some-comments/","cat":"other_blogs","title":"An Apology to Colin Berry.  And Some Comments."},{"id":"comment-75556","author":"joe_marino","post":"Some of you have heard this story before but it bears repeating in this context. In late 2001, Sue and submitted to Radiocarbon our Orvieto paper. In a letter dated January 1, 2002, Dr. Timothy Jull, editor of the journal Radiocarbon, and one of the scientists from the University of Arizona laboratory that dated the Shroud in 1988, sent Sue and me a reply regarding the submission of our C 14 paper. For those not familiar with the process by which papers are published in scientific journals, the editor chooses various reviewers, usually anonymous to the author and supposedly objective, who then make suggestions to the author(s) on how to make the paper better. After changes are made, the reviewers read the paper again, and make their recommendations to the editor as to whether the paper should be published or not. However, the final decision is in the hands of the editor. The review of our paper was out of the ordinary insofar as the reviewers were revealed to us, something that normally doesn’t occur. They were all originally directly involved in the specific topic of our paper, the 1988 Shroud C 14 dating. It was our contention that the C 14 dating was skewed due to the presence of a sixteenth century repair. Here is a list of the reviewers of our paper: Paul Damon, head of the Arizona laboratory that participated in the 1988 Shroud dating Jacques Evin, French C 14 expert present at the 1988 sample taking The late Gabriel Vial, French textile expert present at the 1988 sample taking Franco Testore, Italian French textile expert present at the 1988 sample taking Harry Gove, inventor of the AMS radiocarbon dating method, who had literally bet a companion that the Shroud was medieval and was heavily involved in various aspects of the dating What were the chances that any of these men, each of whom would publicly look bad if our theory were correct, would want to see our paper published? The answer was obvious. Needless to say, our paper was not accepted. Most interesting was a comment by Evin, who wrote in the review sent by the editor to Sue and me: The authors, who, for several reasons, are convinced that the shroud is authentic, want to publish an article in Radiocarbon only to introduce a doubt about the dating. All people involved in the sampling and in laboratory analyses, will be very angry with these suspicions turning on so an important mistake or a misconduct… Enigmatic comment by Evin, is it not? How fair or ethical was of it of Radiocarbon to use reviewers who were directly or closely involved with the Shroud C 14 dating?.","date":"2014-01-31","mins":"8:48 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","title":"Colin Berry on Rogers’ Thermochimica Acta Paper"},{"id":"comment-148352","author":"joe_marino","post":"Wow, I think this is a new level of incompetence for the popular media. The mention of the teeth by Gary Habermas, who isn’t even speaking at the conference, got more space in the article than the conference itself. And they didn’t even list the conference website for people to get additional info..","date":"2014-09-03","mins":"5:26 pm","url":"https://shroudstory.com/2014/09/03/you-might-think-st-louis-was-all-about-gary-habermas/","cat":"press_coverage","title":"You might think St. Louis was all about Gary Habermas"},{"id":"comment-143127","author":"joe_marino","post":"Giorgio, in what format is the quote from Raes? Was there some sort of French only written Proceedings from the 1989 Paris conference?.","date":"2014-08-09","mins":"2:59 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries"},{"id":"comment-18301","author":"joe_marino","post":"Several points that I think De Wesselow really drove home well was the idea that a 14th century forger would not have gone to all the trouble to make the image as intricate as it was (and certainly not as a negative, even if he knew how to produce one). Another point is the fact that the blood would had to have been painted on, so if the image itself is not a painting but a different type of forgery, the artist would had to have used 2 different methods to produce his fake, which once again brings it back to its intricacy. He’s absolutely convinced that the Shroud can’t be a 14th century forgery. It’s really nice to hear an art historian from the period from which the Shroud supposedly was forged give his expert point of view..","date":"2012-10-25","mins":"5:17 pm","url":"https://shroudstory.com/2012/10/25/must-listen-thomas-de-wesselows-talk-at-shroud-enigma/","cat":"art","title":"MUST LISTEN: Thomas De Wesselow’s talk at Shroud Enigma"},{"id":"comment-4013","author":"joe_marino","post":"I also attended the Elizabethtown Shroud conference. During the question and answer session, I asked Mc Crone how his supposed forger was able to incorporate details that weren’t even discernible for several hundred more years until various scientific devices were even invented. His “answer?” He said “I’m not going to answer that–he just did it.” That’s scientific?.","date":"2011-09-23","mins":"6:55 am","url":"https://shroudstory.com/2011/09/23/more-on-mccrones-role-in-shroud-of-turin-studies-ii/","cat":"science","title":"More on McCrone’s Role in Shroud of Turin Studies (ii)"},{"id":"comment-191225","author":"joe_marino","post":"I don’t see that saying the Shroud is not suitable for C 14 and proposing a reason why it was wrong are mutually exclusive..","date":"2015-02-16","mins":"5:58 pm","url":"https://shroudstory.com/2015/02/16/walter-mccrone-art-experts-should-not-weigh-in/","cat":"uncategorized","title":"Walter McCrone:  Art Experts Should Not Weigh In"}]
