[{"id":"comment-200497","author":"joe_marino","post":"Josephus actually documented at least one–I think it was actually 2 or 3–friends of his who did survive after being on a cross for several days. I don’t know the exact citation but it could probably be found by googling something like “surviving crucifixion.” Obviously those are rare cases..","date":"2015-05-29","mins":"4:40 am","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"id":"comment-197653","author":"joe_marino","post":"Although one can put the Shroud or any other topic “on trial” and perhaps get a verdict that matches with one’s belief, it’s also important to remember that just because a court reaches a certain verdict based on the evidence, it doesn’t mean the verdict is correct. Obviously, there are numerous law cases in which a verdict was reached based on the available evidence at the time and the verdict turned out to be wrong. Another factor at play is the very human desire to be right about things and wanting other people to agree with us. In the case of the Shroud, there are certain people on both sides of the question (and perhaps some in the middle) who will never be convinced by the evidence from (an)other side, no matter how compelling they think it is. Personally, although I think that studying the Shroud is frustrating to a degree because there will probably never be a clear cut solution, I think one has to be somewhat comfortable with mystery and tolerant of the fact we are never going to be able convince everyone of one’s own view. Regarding the comment about those who are able to make financial gains from touting the Shroud’s authenticity, I would love to see what would have to be an extremely short list, as most shroudies spend many of their own resources, including the greenbacks..","date":"2015-04-26","mins":"12:02 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-197516","author":"joe_marino","post":"Nickell wrote (for the umpteenth time) “STURP’s leaders served on the executive council of the Holy Shroud Guild, which is devoted to the ’cause’ of the reputed relic.” Does he really think that could have been enough for the STURP group as a whole to say the image was not made by the hand of man? The group had Jews, atheists and agnostics. They worked in the country’s space and nuclear programs. To imply that because STURP’s leaders were part of the Holy Shroud Guild, the group as a whole couldn’t come to any objective conclusions is ludicrous. Has anyone ever seen Nickell mention that Luigi Garlaschelli, an Italian who has supposedly shown how the Shroud could be faked, has his work sponsored by an Italian atheist group. Of course, Garlaschelli has claimed that has no bearing on his work. Apparently no double standard here..","date":"2015-04-25","mins":"8:25 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-192027","author":"joe_marino","post":"I’m reading the accompanying book that just came out. The book has no footnotes, which I can understand, since it’s aimed for a general audience. But I’m disappointed in the Shroud chapter regarding the treatment of the reweave. While one peer reviewed journal is mentioned in the text regarding another aspect, there is no mention of peer reviewed articles pertaining to the reweave theory. Here is what is said about it: “Like every piece of new research connected to the shroud, the detailed findings from the 1988 radiocarbon tests raised doubts: the swath of cloth that was tested was not from the original shroud, but came from an edge of it that had been patched, and touched by many grimy fourteenth century hands as the icon was moved from place to place.” If one is intending to educate an audience, I would think a little more thoroughness is warranted..","date":"2015-02-28","mins":"11:17 am","url":"https://shroudstory.com/2015/02/28/hints-about-shroud-of-turin-episode-in-cnn-series/","cat":"press_coverage","title":"Hints About Shroud of Turin Episode in CNN Series"},{"id":"comment-209957","author":"joe_marino","post":"But the expertise of the textile experts has to be weighed against the expertise of the chemists and microscopists who found evidence of a reweave. In any crime scene, for example, evidence is not just based on visual inspection but also on chemical evidence..","date":"2015-09-09","mins":"8:36 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"},{"id":"comment-209958","author":"joe_marino","post":"By the way, in 1986, during the Turin planning meeting, before Flury Lemberg had apparently even seen the Shroud, Harry Gove wrote (per Gove’s book although I don’t have the exact page # handy) “”Flury Lemberg stated that the cloth is the same from one end to the other. There is no need to take samples from various places. One could take strips from the edges of the main cloth from any place and it would be the same.” Based on that statement, she was possibly predisposed to not finding any evidence of a reweave. Experts are not immune to biases..","date":"2015-09-09","mins":"9:19 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"},{"id":"comment-209964","author":"joe_marino","post":"Flury Lemberg made the assumption, not Gove. Gove just quoted her..","date":"2015-09-09","mins":"9:58 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"},{"id":"comment-209996","author":"joe_marino","post":"I believe that when she made the statement (at the planning meeting and the Shroud wasn’t present) she hadn’t even seen the Shroud. I have no idea what she based it on. She would have to expand on that herself. And based on several replies in this thread, I’ll refrain for now from speculating on that and several other issues raised..","date":"2015-09-09","mins":"4:27 pm","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"},{"id":"comment-2717","author":"joe_marino","post":"Speaking of fallacies, I wonder if anyone has put together a list of fallacious Shroud arguments against authenticity. A few immediately come to mind (with a little sarcasm thrown in here and there): *There’s no way a cloth could have lasted that long. Therefore it must be a fake. *The Bible says that more than 1 cloth was used. The Shroud is only 1 cloth. Therefore it’s a hoax. *All relics are fakes. The Shroud is a relic. Therefore the Shroud is fake. *Leonardo was talented enough to produce the Shroud. Therefore he did it. (Never mind that the Shroud was around for about 100 years before he was born. *Enough was known about photography in the 14th century that the Shroud could have been produced by a photographic process. Therefore it was. *A bishop in the 14th century said he knew the artist that did it AND paint particles have been found on the Shroud. Therefore, it’s a painting. *I’ve read 1 or 2 newspaper articles that say it’s a fake and I agree. Even though I haven’t done any research, my opinion trumps those that say a few measly hundreds of thousands of hours of the best scientific research of the 20th and 21st century has failed to come up with a viable explanation. *The C 14 test gave results of AD 1260 1390. Even though only 1 questionable sample was taken, the putting of the samples into the tubes for the lab was the only part of the procedure not videotaped, and the reports of the sizes and weights of the samples kept changing, there’s no reason to doubt the validity of a test that’s often discarded because results are often affected by unknown factors. I would enjoy seeing others add to this list..","date":"2011-03-23","mins":"9:46 pm","url":"https://shroudstory.com/2011/03/23/a-review-the-fallacy-of-god-a-religious-conspiracy/","cat":"books","title":"A Review: The Fallacy of God: A Religious Conspiracy"},{"id":"comment-189172","author":"joe_marino","post":"Following up on Hugh’s comment, I am amazed at how often these Shroud based novels come out. I did read Sequencing Faith but really can’t remember much about it. My main complaint about the fiction novels is that there usually are only 2 main themes: Jesus being cloned from the blood on the Shroud (a scientific impossibility, at least in our day) or the Shroud gets stolen. I see where Caldwell spent 10 years researching for this. It would be interesting to ask all of the authors of these fiction novels if they believe the Shroud is authentic or if that really even matters to them..","date":"2015-02-04","mins":"8:57 pm","url":"https://shroudstory.com/2015/02/04/a-most-anticipated-book-of-spring-2015-about-the-shroud-of-turin/","cat":"books","title":"A Most Anticipated Book of Spring 2015:  About the Shroud of Turin"},{"id":"comment-16802","author":"joe_marino","post":"It just occurred to me that the author may believe that Jesus’ body may have been just thrown in a pit for criminals, but he doesn’t specifically say that. Yet, the one crucifixion victim that was discovered, “Johanan,” whose remains were found in 1968 in an ossuary in Jerusalem (and crucified around the time of Jesus), had apparently been given a traditional burial, otherwise his bones would likely not have been put in this bone box as the 2nd part of the burial process in effect in Jerusalem in that time period. So even though Jesus was crucified as a criminal, there’s no reason to doubt that he wasn’t given a traditional burial..","date":"2012-09-23","mins":"11:35 am","url":"https://shroudstory.com/2012/09/23/downright-stupid-analysis-in-the-empty-tomb-jesus-beyond-the-grave/","cat":"books","title":"Downright Stupid Analysis  in The Empty Tomb: Jesus Beyond the Grave"},{"id":"comment-33368","author":"joe_marino","post":"Colin wrote <> Rogers was not the only one who found cotton. In a paper by Archaeologist Paul Maloney presented at a conference held in 2008 at The Ohio State University, he wrote: “It is now clear that the presence of cotton spun inside linen yarns in the Raes’ Corner [i.e., the C 14 sample area] is supported by the findings of five separate and independent investigators: *Gilbert Raes, (1973 1974); *STURP’s own early analyses reported by STURP spokeswoman, Joan Janney, (1981); *Investigators at Precision Processes (Textile lab) Ltd. In England, 1988; *Ray Rogers’ 2004 investigations; *John Brown at Georgia Tech (2004).” In addition, a 9 person team at Los Alamos National Laboratories also confirmed Rogers’ findings. If multiple scientists find cotton, it unravels like cotton and otherwise tests as cotton, then it probably is cotton..","date":"2013-05-09","mins":"9:17 pm","url":"https://shroudstory.com/2013/05/08/joe-nickells-new-book-the-science-of-miracles/","cat":"books","title":"Joe Nickell’s New Book: The Science of Miracles"},{"id":"comment-213348","author":"joe_marino","post":"“Unfakeable” is one of those little used words for which at least some dictionaries allow for the alternate spelling of “unfakable.”.","date":"2015-10-22","mins":"9:00 am","url":"https://shroudstory.com/2015/10/22/new-book-by-mark-antonacci-is-available/","cat":"books","title":"New Book by Mark Antonacci is Available"},{"id":"comment-33289","author":"joe_marino","post":"Notice how the publisher in its blurb uses the word “magical” in conjunction with the Shroud. “Magical,” of course, is a loaded word. Nickell’s summary of the Shroud saga is basically a rehash of older material. His reference includes many books and articles from the 70s, 80s and 90s. Recent material includes a recap of Garlaschelli’s replica, which Garlaschelli says “has all the characteristics of the Shroud of Turin.” Nickell says it “shows shroud science trumped by real science.” Amazingly, Nickell does not even mention Ray Rogers or his paper in the peer reviewed journal Thermochimica Acta in 2005, not even to debunk it. I’m surprised at that, since he has written about it in the past. Needless to say, that’s an integral part of the story–but apparently not of Nickell’s version. Also not mentioned is the fact that some scientists published material showing how Garlaschelli’s replica, first revealed to the world by the popular press, does not have all the features of the Shroud. What constitutes “real science” depends on your point of view..","date":"2013-05-08","mins":"9:42 pm","url":"https://shroudstory.com/2013/05/08/joe-nickells-new-book-the-science-of-miracles/","cat":"books","title":"Joe Nickell’s New Book: The Science of Miracles"},{"id":"comment-37347","author":"joe_marino","post":"Fr. J.V., I’d be curious to know how you came up with the inspiration for the female STURP scientist who was divorced twice/married 3 times. Perhaps you know where I’m coming from..","date":"2013-06-18","mins":"9:46 pm","url":"https://shroudstory.com/2013/06/17/new-shroud-of-turin-novel-the-chimera-by-fr-j-r-veneroso/","cat":"books","title":"New Shroud of Turin Novel, The Chimera by Fr. J. R. Veneroso"},{"id":"comment-209477","author":"joe_marino","post":"One can preview on the American site. When the book comes up after having done a word search on “Turin Shroud”, there’s a hot link off to the right of the screen that shows a truncated sentence containing “shroud” and pertinent page numbers..","date":"2015-09-02","mins":"8:10 am","url":"https://shroudstory.com/2015/09/02/non-fiction-the-vatican-prophecies-available-september-15/","cat":"books","title":"Non-Fiction: The Vatican Prophecies Available September 15"},{"id":"comment-50169","author":"joe_marino","post":"I also informed Israeli botanist Avinoam Danin about this. He emailed that he is no longer working on the Shroud and added “Tamarix hampeana does not grow in Palestine. Pistacia palaestina is not regarded by any botany book of our area as ‘endemic’.”.","date":"2013-11-06","mins":"7:42 am","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"id":"comment-50285","author":"joe_marino","post":"I received this response from Danin: “I am sorry about my response concerning Tamarix hampeana. It is mentioned in Flora Palaestina part 2: 359 (Zohary, 1972) and regarded as a very rare plant. I did not see it in the field and I could not erase it from the list of plants in Flora Palaestina area. Hence it is mentioned in my Distribution Atlas of Plants in the Flora Palaestina Area (Danin 2004) as a very rare plant found in the Philistean Plain. The nomenclature in my website (flora.huji.ac. Il) is based on Flora Palaestina. Tamarix species are very hard to determine and I suspect anybody can determine pollen grains as belonging to a certain species of Tamarix. I suggest you address Prof. Dr. Thomas Litt (Bonn, Germany) about the pollen types mentioned in your letter.”.","date":"2013-11-07","mins":"7:11 am","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"id":"comment-50243","author":"joe_marino","post":"O.K., I have passed along your comments to Danin..","date":"2013-11-06","mins":"8:55 pm","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"id":"comment-39546","author":"joe_marino","post":"Finding the truth, about the Shroud or anything, is difficult. I can think of several reasons: 1)History (and science) are written by the winners. 2) Many people are capable of telling many lies and half truths. 3) We all often deceive ourselves through our own desires and biases..","date":"2013-07-22","mins":"8:54 pm","url":"https://shroudstory.com/2013/07/21/science-is-after-all-nothing-more-than/","cat":"books","title":"Science is, after all, nothing more than . . ."},{"id":"comment-46102","author":"joe_marino","post":"I’ve been mostly out of commission for a few days dealing with a sick dog. I had almost completed a single posting consisting of various responses originally posed in the “Shreds of Evidence” posting from 9/23, which I was just going to post here since this current thread overlaps, when I somehow managed to make the posting disappear. I will have to reconstruct the whole thing. I’m not in the mood to do that tonight. I’m going to be out of town this weekend but maybe I can start doing it again tomorrow night and finish early next week. I absolutely hate it when I lose things on computers..","date":"2013-10-03","mins":"9:29 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-46425","author":"joe_marino","post":"I’m trying to catch up after having the sick dog and also a weekend trip out of town. Pakeha wrote, “could you explain why Flury Lemburg’s evaluation of the possibility of reweaving is untenable?” and “Are you saying Flury Lemburg was incompetant to find cotton fibres in the area? And seriously, do you understand the amount of extraneous fibre need to have skewed the dating. Are you claiming Fleury Lemburg wouldn’t notice there was over 50% cotton in that area? Or is she part of the conspiracy? Flury Lemburg may be a textile expert and although she says an invisible reweave is impossible, 6 independent sources as cited in posting #37 show there was cotton in the C 14 sample area. Let’s not forget that Professor Piero Savarino, co authored a booklet on the Shroud before he was appointed advisor to Cardinal Poletto of Turin. In the 1998 booklet, he stated that the 1988 C 14 testing might have been erroneous due to “extraneous thread left over from ‘invisible mending’ routinely carried out in the past on parts of the cloth in poor repair.” Savarino went on to emphasize: “…if the sample taken had been the subject of ‘invisible mending’ the carbon dating results would not be reliable. What is more, the site from which the samples actually were taken does not preclude this hypothesis” (cited in http://www.shroud.com/pdfs/benfordmarino.pdf) David Mo wrote, “Who is M. Bourcier de Carbon?” All I know is that he was a French statistician who presented a paper at a 1993 Shroud conference in Rome. Do any other readers have any details to contribute? Pakeha wrote: “Sorry to have taken so long in providing links to arguments against the Heller/Adler conclusions. They’re written by hugh farey and I found them to be most interesting. Http://forums.randi.org/showthread.php?p=9387545&highlight=Adler+blood#post9387545 http://forums.randi.org/showpost.php?p=9394626&postcount=8900 http://forums.randi.org/showthread.php?p=9386857&highlight=Adler+blood#post9386857 http://forums.randi.org/showpost.php?p=9386813&postcount=8803” Those are all from the Committee for Skeptical Inquiry group, formerly known by CSICOP, which has always been anti Shroud. It’s not surprising they contest it. And it’s not something from a peer reviewed scientific journal..","date":"2013-10-07","mins":"10:09 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45559","author":"joe_marino","post":"I respond to some of the comments by David Mo and Matthias. David wrote: <> “The age of the Shroud given by the labs was 663 +/ 25 years, which includes 666.” I had forgotten I had written that. The theme of the paper was parallels between biblical history and Shroud history. If I were writing that article today, I would definitely leave that out. David wrote: <> In the June 1989 issue of Catholic Counter Reformation in the X Xth century, No. 220, pg. 25, it states, “Quoting the Daily Telegraph for Holy Saturday, 25 March, Brother Bruno revealed that forty five business men and “rich friends” (sic) gave Professor Hall, who will reach retiring age next year, 1 million (pounds) for his services and notably for having ‘determined last year that the shroud of Turin was a medieval fake.’ The money was handed over on Good Friday, 24 March.” David wrote: <> From: http://www.shroud.com/pdfs/marinelliv.pdf Hall wants to ensure the survival of his chair after his retirement and hopes a Sunday newspaper will pay a large sum for the rights to the story of the Shroud dating. He receives one hundred thousand pounds from ITV, the independent television, BBC’s rival, and a million pounds from 45 businessmen and “rich friends”. The chair is to be filled by Tite. Gonella emphasizes: “Since the beginning, this story of dating the Shroud has been vitiated by publicistic aspects, to which 14 C laboratories showed to be even too much sensitive”. The Cardinal’s consultant, exasperated, expresses a heavy judgment: “The custodians of the cathedral of Turin behaved more seriously, kept silent about the sampling of seven centimeters of the sheet, than a group of scientists, who took the liberty of violating the secret and of announcing to scandal seeking tabloids that the Shroud is a medieval fake. In my opinion there is an anti Catholic conspiracy of specific milieus”. Which milieus? In a later interview, Cardinal Ballestrero will be asked this question: “In this whole affair could the Freemasonry have had a hand? And external pressures?” Cardinal Ballestrero answered: “I think it’s indisputable!” Matthias wrote: <> I am providing some documentation in this posting. Regarding Klotz’s claims, he stated he’s writing a book. One can’t expect to see chapters of a book when’s he’s making a post. I’ve read some of his chapters. He provides footnotes. We will have to wait until the book is published before we see everything. The only information I provided in my original email that was anecdotal was my statement: ” I believe was even allowed to observe the actual testing at Zurich.” I checked Sox’s book The Shroud Unmasked: Uncovering the Greatest Forgery of All Time and he, in fact, states that he did observe the testing in Zurich. (See pp. 136 140 of the paperback, Hampshire: Lamp Press. Everything else I stated was a fact: *Sox’s book was printed before the official announcement: From: http://www.shroud.com/pdfs/n20part4.pdf The book, which was already printed, but not yet released, more than two weeks before the official announcement of the carbon dating results, makes clear that Sox authoritatively knew the carbon dating result well in advance. Inevitably, therefore, someone leaked their result to Sox, and he in turn was responsible directly or indirectly for at least two of the highly publicised leaks from within the U.K., those immediately in the wake of his Timewatch programme, and the Sunday Times premature announcement (headlined an “official” result) of 18 September, which the Sunday Times admitted derived from an advance copy of Sox’s book. *The documentary was complete before the official announcement, as indicated by the information in the documentary itself and alluded to in the statement by Ian Wilson above regarding Sox’s book *A million pound donation was given to Oxford “notably for having ‘determined last year that the shroud of Turin was a medieval fake'” per the Daily Telegraph article of March 25, 1989. Please note that at the end of the posting I wrote: *Were there any connections/associations between the publisher of Sox’s book, BBC/Timewatch, which put out the documentary, and the “anonymous businessmen” that donated the million pounds to Oxford? *We may never know the answers, but I have a feeling that if we did, there would be some shocking revelations. I didn’t categorically state there were connections between the publisher, BBC/Timewatch and the donors–I just asked the question. There’s a difference between making charges and raising questions/suspicions. I concluded we don’t have all the answers; it’s hard to make conclusions without all the facts. But am I suspicious? You bet I am! I’d like to highly recommend Emmanuela Marinelli’s article “The Setting of the Radiocarbon Dating of the Shroud” at http://www.shroud.com/pdfs/marinelliv.pdf and William Meacham’s book The Rape of the Shroud, available at http://www.amazon.com/Rape Turin Shroud William Meacham/dp/1411657691/ref=sr 1 1?s=books&ie=UTF8&qid=1380245688&sr=1 1&keywords=rape+of+the+shroud. No one can read these and not come away knowing the dating of the Shroud was a fiasco..","date":"2013-09-26","mins":"9:41 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45508","author":"joe_marino","post":"I don’t have time to respond at the moment but will later tonight..","date":"2013-09-26","mins":"7:24 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45855","author":"joe_marino","post":"David wrote, “If laboratories dated a patch that mixed tissues from different periods their work was well done but on a wrong sample. So, why the hell they needed any “machiavelianism”?” The 1988 testing was less than rigorous. Statistician Philippe Bourcier de Carbon presented 15 problems with the testing: 1. Absence of a formal report of the sampling; 2. Absence of a video archive on the final steps of the samples packaging; 3. In the official reports, contradictions about the cutting and the weight of the samples by people in charge of sampling; 4. Breaches of the protocols initially planned for the operation of dating; 5. Rejection of the usual procedure of double blind test; 6. Refusal of the interdisciplinary documentation, which is usual in the procedures for radiocarbon dating; 7. Exclusion of acknowledged specialists in the Shroud, particularly American scientists who participated in previous works of STURP; 8. Communication to the laboratories, most unusual, of the dates of the control samples prior to testing; 9. Intercommunication of results among the three laboratories during the job; 10. Disclosure to the media of the first results before the delivering of the findings; 11. Refusal to publish raw results of the measurements (requested also with insistence in its official statement by the Scientific Committee which prepared the Symposium in Paris in 1989); 12. Non explanation of the unique isolation of the confidence interval of the measures performed by the Oxford laboratory compared to those made by other laboratories; 13. Unacceptable value of 6.4 published in the journal Nature for the chi squared statistical test on the results of the radiocarbon dosage on the Shroud; 14. Rejection of any cross debate on the statistical measures performed 15. Rejection, absolutely uncommon, of the publication of the statistical expertise of this operation, officially entrusted to professor Bray of “G. Colonnetti” Institute of Turin (requested also with insistence in its official statement by the Scientific Committee which prepared the Symposium in Paris in 1989). Bourcier de Carbon concludes: “Such a remark of deficiencies remains completely unusual in the context of a truly scientific debate, and one can only deplore this exception to the usual ethics.” Given those points it would be mind boggling to believe that there was nothing Machiavellian going on. Regarding Mr. Erlich’s comment, it’s easy to find experts to say that certain things are impossible. Certain scientists said that it would be impossible for heavier than air machines to fly but they did. Cotton has been found in the Shroud, despite the fact that certain person say they didn’t see it or there’s no technique to put it there. From my book, quoting Paul Maloney’s presentation at the 2008 Ohio Shroud conference: It is now clear that the presence of cotton spun inside [bolding in original] linen yarns in the Raes’ Corner [i.e., the C 14 sample area] is supported by the findings of five separate and independent investigators: *Gilbert Raes, (1973 1974); *STURP’s own early analyses reported by STURP spokeswoman, Joan Janney, (1981); *Investigators at Precision Processes (Textile lab) Ltd. In England, 1988; *Ray Rogers’ 2004 investigations; *John Brown at Georgia Tech (2004). At that same conference chemist Robert Villarreal also presented a paper indicating that a 9 person team at Los Alamos National Laboratories also found cotton. The late Fr. Francis Filas, S.J. Used to say, “Against the fact there is no argument,” but we all know there will be..","date":"2013-09-29","mins":"5:34 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45720","author":"joe_marino","post":"With my problems with copying and pasting, I’m trying replying to the email in my in box rather than starting in the comments section. Since I don’t know if doing this will post Pakeha’s comment that I’m replying to, I’m going to reproduce it again here. Pakeha wrote, <> It’s scholarly with numerous footnotes and references, extremely detailed and dispassionate. Marinelli has been a sindonologist for decades and is renowned for her research. I’m astonished that you’re astonished that I recommended it. What is it in Marinelli’s article you question?.","date":"2013-09-28","mins":"9:14 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45191","author":"joe_marino","post":"From British Society for the Turin Shroud Newsletter No.22, May 1989: Dr. TITE TO SUCCEED PROFESSOR HALL AT OXFORD One ironical twist to the carbon dating story is that according to a report in The Times on 25 March, the Oxford carbon dating laboratory’s future has been secured by Professor Hall having recently raised £1 million in donations from 45 businessmen and “rich friends”. Professor Hall, who has his own private income, has been unpaid since he became founding director of the laboratory in 1954. But on his retirement this year his successor has to be paid,and since Oxford University’s already over stretched finances are unable to provide this, Hall raised independent finance to fund a perpetual Professorship. According to The Times”Professor Hall said he did not think publicity arising from his research into the authenticity of the Turin Shroud had anything to do with his success in raising the money.” But the even more ironical twist is that Professor Hall’s successor is to be … Dr. Michael Tite.","date":"2013-09-23","mins":"8:09 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45845","author":"joe_marino","post":"In response to pakeha’s #45 posting, Marinelli’s 1st sentence also footnotes 2 other medical doctors. The Heller Adler paper was in a scientific peer review journal. You say it’s been disputed repeatedly but give no names. Skeptics may dispute it repeatedly but that carries no weight. Practically any Shroud paper by proponent or skeptic alike is disputed repeatedly. I’m not familiar with the Mercator Projection. For Marinelli to state that the Shroud “bears the imprinted image of the corpse that was wrapped in it,” which has been a traditional observation by many for numerous years, is hardly a reason, in part or in full, to doubt her seriousness. I believe the scholarly nature of the paper is evident.","date":"2013-09-29","mins":"4:31 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45849","author":"joe_marino","post":"Marinelli responds to your comments: “My paper is an history of the facts around Shroud carbon dating and Kouznetsov is part of that history. If I am an historian and I write about the Second World War, I must mention Hitler. And mentioning Hitler, am I a nazist? A Hitler follower? In my article I don’t say that the Kouznetsov’s research is valid. But Kouznetsov participated in conferences and published in peer review magazines, as Journal of Archaeological Science, and I cannot ignore him in a chronicle of the events. I mentioned also the criticism against his work.”.","date":"2013-09-29","mins":"5:02 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45963","author":"joe_marino","post":"I’m dealing with a sick dog. Will get back when I’m able..","date":"2013-09-30","mins":"7:12 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-7860","author":"joe_marino","post":"I posted the following to an Internet group on 12/22: I recently saw a new book by Josh Mc Dowell, author of Evidence That Demands a Verdict. Mc Dowell has traditionally been skeptical of the Shroud’s authenticity. Ken Stevenson knows him and tried at one point to get Mc Dowell to reconsider all of the evidence. Mc Dowell’s new book is titled (as I remember) Evidences for Christianity: Historical evidences for the Christian Faith. The book is over 600 pages. And how much mention is made of the Shroud? ZERO. But I guess that since he usually makes a point to mention it to debunk it, maybe this is progress?.","date":"2012-02-02","mins":"12:21 pm","url":"https://shroudstory.com/2012/02/02/so-what-is-josh-mcdowells-take-on-the-shroud-of-turin-these-days/","cat":"books","title":"So what is Josh McDowell’s take on the Shroud of Turin these days?"},{"id":"comment-8413","author":"joe_marino","post":"I got my copy today. The book does not delve into the scientific aspects of the Shroud, but it is very lavishly illustrated and the black & white closeup of the negative (lifelike)of the face on page 13 is absolutely STUNNING. Every sindonologist should get this book, which is very reasonably priced for a book with so many great color pictures..","date":"2012-02-17","mins":"6:30 pm","url":"https://shroudstory.com/2012/02/17/the-book-the-true-icon-is-now-shipping/","cat":"books","title":"The book, The True Icon, is now shipping."},{"id":"comment-3621","author":"joe_marino","post":"Cayce isn’t listed as the author of the book. It says the foreword was written by the author of “Edgar Cayce’s Story of Jesus.” The late Frank Adams was the author of “A Scientific Search for the Face of Jesus.” I have a handwritten note from him saying that Elvis was reading that book when he died..","date":"2011-08-17","mins":"12:06 pm","url":"https://shroudstory.com/2011/08/17/what-book-was-elvis-reading-when-he-died/","cat":"books","title":"What Book Was Elvis Reading When He Died?"},{"id":"comment-192135","author":"joe_marino","post":"I found it disappointing that there was no treatment of why the C 14 dating could have been wrong. Gibson just saying that samples were not taken from the center of the cloth but rather the edge is woefully inadequate..","date":"2015-03-01","mins":"10:05 pm","url":"https://shroudstory.com/2015/03/01/open-discussion-about-episode-one-examining-the-shroud-of-turin/","cat":"television","title":"Open Discussion About Finding Jesus, Episode One: Examining the Shroud of Turin"},{"id":"comment-179895","author":"joe_marino","post":"O.K. You did some marvelous work in your articles. I’ve always been torn about it because visually it looks like a painting but it also seems to have characteristics not in keeping with it being a painting. I definitely agree more work is need..","date":"2014-12-29","mins":"9:17 pm","url":"https://shroudstory.com/2014/12/29/set-your-dvr/","cat":"video","title":"Set Your DVR"},{"id":"comment-202654","author":"joe_marino","post":"Louis, who is producing this report and when is it expected to be released?.","date":"2015-06-18","mins":"11:35 am","url":"https://shroudstory.com/2015/06/17/the-shroud-on-nbcs-today-show/","cat":"television","title":"The Shroud on NBC’s Today Show"}]
