[{"title":"Quick Reaction to In the Belly of the Beast","post":"Is that it? Picture postcards of little squiggles?  Where are these razor sharp lines at this size?\n\n","date":"October 20, 2014 at 7:04 am","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","id":"comment-163995","author":"Paulette","site":"shroudstory"},{"title":"Quick Reaction to In the Belly of the Beast","post":"What does “dumb s…” mean?\n\n","date":"October 20, 2014 at 8:01 am","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","id":"comment-164009","author":"John Klotz","site":"shroudstory"},{"title":"Quick Reaction to In the Belly of the Beast","post":"I thought it was one word. But who knows what it is below the equator or across the pond. Dictionary.com defines it as a stupid person. Of that, there is no dispute.\n\n","date":"October 20, 2014 at 9:09 am","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","id":"comment-164028","author":"Dan","site":"shroudstory"},{"title":"Quick Reaction to In the Belly of the Beast","post":"Good for the readers of this blog. I have now studied two ‘raking light’ photos, in Jackson’s paper and in the Rageh Omaar documentary referenced in the preceding post. I still can’t say I find the jack-in-the-box hypothesis convincing. The creases are not neat transverse foldlines, but a series of short curved creases which look very like the pattern you get when you roll a lined cloth round a pole. I believe Jackson is sincere in what he thinks he observes, but do not think the unecessarily elaborate mecanism he has devised to account for them actually bolsters his case; to me it only demonstrates a rather awkward attempt to make something out of nothing. Both Rageh Omaar and John Jackson suggest that linen has some sort of memory for creases thanks to permanent deformation of the linen fibres. Although this sounds possible, it is not borne out by the simple spreading out of the Shroud out in 2002, whereupon almost every one has become irretrievable.\n\n","date":"October 20, 2014 at 6:51 pm","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","id":"comment-164147","author":"Hugh Farey","site":"shroudstory"},{"title":"Quick Reaction to In the Belly of the Beast","post":"The question of the removal of fold marks during the 2002 intervention seems ambiguous and enigmatic.  I found two seemingly contradictory papers on the Shroud.com site.  [Search word was ‘Restoration’ yielding several links and titles of papers]  \nA summary of the Dallas conference yielded a series of Q&A dealt with by Mme Flury-Lemburg concerning her intervention.  She asserted there had been no ironing, nor laundering, nor steam cleaning, nor the use of weights to remove wrinkles; a weight had been used merely to keep a glass cover in place during the work.  \nConversely a paper: “SHROUD RESTORATION DATA”  First published in LINTEUM, the Spanish Centre for Sindonology magazine, 2002.  http://www.shroud.com/pdfs/n58part7.pdf includes the following:-\n“Aims: [includes –>]  ** Remove the organic remains, dust and dirt that had accumulated between the Shroud and the backing cloth;  ** Stretch the Shroud to iron out crease marks”\n“Effects: [includes –>]  **Crease marks have been taken out with a system consisting of small lead weights.  The Shroud has thus “grown”, and now measures 441.5 x 113.7 cm” \nThe two papers therefore seem to be mutually contradictory concerning the removal of crease marks.  I did not search for further information for corroboration one way or the other. \nDuring its history, it is evident that the Shroud has been kept for long periods of time folded or rolled in various ways.  This is evident from repeated / symmetrical patterns of water stains, the ‘poker hole’ pattern, the Chambery 1532 burn holes, and in recent centuries by being rolled on a baton or staff.  \nIn 2004, Aldo Guerreschi simulated a folding indicated by the ancient water stains.  The simulation was broadcast on British Television in presence of Ian Wilson who describes it in his 2010 book.  The cloth was folded twice lengthwise and then with 12 loose folds widthwise accordian style and placed in a replica of a jar used for storing the Dead Sea scrolls.  Guesrreschi succeeded in obtaining an identical pattern of water stains. \nThe poker hole pattern indicates that at this time it was folded with one fold lengthwise and one widthwise.  The Chambery burn holes indicate it was at that time folded once lengthwise and also widthwise to produce two symmetrical rows each of four holes.  In recent centuries it has been rolled on its staff.  In addition we have Wilson’s tetradiplon theory so folded to produce a landscape face.  There may have been other long term foldings which are now unknown.  Perhaps it was folded in particular ways for Byzantine displays as suggested by Jackson, or even storage in a casket.  \nThe retention of fold marks is said to occur because of the breakdown of the linen cellulose crystalline structure.  I suggest that this breakdown will not necessarily be as uniform as it might be in a modern machine-made product.  There will be variations in thread strength and texture resulting from hand-spinning and hand-loom weaving.  Perhaps it cannot be expected that residual fold marks will be clean straight lines across the cloth, but will pursue the line of least resistance determined by its hand-made heterogeneity, previous foldings, and such factors as edge distance discontinuities.  It would seem unlikely that the folds were ever ironed or pressed into place for permanence.\nJackson has attempted to rediscover the ancient methods used for folding, and each of us will have our own views of how successful or uncertain these might be.  Whatever, with the apparent, or at least possible, removal of wrinkling in 2002, any rediscovery or review of this work would seem to be a forlorn hope.\n\n","date":"October 20, 2014 at 11:07 pm","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","id":"comment-164204","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Quick Reaction to In the Belly of the Beast","post":"Dr. Jackson in the video above (@12:06) confirmed that the folders were there when he went to asses the repair work done in 2002. The fold marks are very clear in the BBC video referenced in the original Post (My comment on the Belly of the Beast thread), they are not simply the creases that’s we see all over the shroud. They are sharp and run through the whole length of the cloth.\n\n","date":"October 20, 2014 at 11:49 pm","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","id":"comment-164223","author":"Mike M","site":"shroudstory"},{"title":"Quick Reaction to In the Belly of the Beast","post":"Or was it “I think I see”?? Was the post-2002 viewing carried out with raking light?\n\n","date":"October 21, 2014 at 12:35 am","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","id":"comment-164241","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Quick Reaction to In the Belly of the Beast","post":"The BBC video was post 2002 and it was done in raking light.\n\n","date":"October 21, 2014 at 8:05 am","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","id":"comment-164319","author":"Mike M","site":"shroudstory"},{"title":"Quick Reaction to In the Belly of the Beast","post":"Sorry, Folders=fold marks\n\n","date":"October 20, 2014 at 11:50 pm","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","id":"comment-164224","author":"Mike M","site":"shroudstory"},{"title":"Quick Reaction to In the Belly of the Beast","post":"Mike’s referenced BBC video depiction of the creases was certainly done in raking light, but I do not see that they are “sharp and run through the whole length of the cloth.” I presume he mean width, actually, and this leads me to another idea. Roll marks and fold marks (if any) are hopelessly muddled together. Has anyone thought to look for fold marks with raking light from above, showing longitudinal rather than transverse foldlines? Another idea, which I have not pursued but which seems possible, is to distinguish between ‘mountain-folds’ and ‘valley-folds’ which can be seen because of the direction of the light.\n\n","date":"October 21, 2014 at 3:32 am","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","id":"comment-164270","author":"Hugh Farey","site":"shroudstory"},{"title":"Quick Reaction to In the Belly of the Beast","post":"Thanks Hugh for the correction, I did mean width. Please see the images below I captured from the video and marked the ones I was talking about","date":"October 21, 2014 at 8:02 am","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","id":"comment-164318","author":"Mike M","site":"shroudstory"},{"title":"Quick Reaction to In the Belly of the Beast","post":"That’s excellent Mike, just what I was thinking of. These are valley-folds with respect to the image-side of the cloth, while the others are mountain-folds, as we can see by the light and dark edges. They do not obviously connect in the middle, but the inference is clearly there. I shall certainly attempt to pursue this if I can.\n\n","date":"October 21, 2014 at 10:57 am","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","id":"comment-164352","author":"Hugh Farey","site":"shroudstory"},{"title":"Quick Reaction to In the Belly of the Beast","post":"Mike, refer to Ian Wilson’s book.\n\n","date":"October 21, 2014 at 11:16 am","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","id":"comment-164357","author":"Louis","site":"shroudstory"},{"title":"Quick Reaction to In the Belly of the Beast","post":"Thanks Hugh, they do look like valleys. The good thing is that this video was taken after the restoration (where weights were applied to flatten the creases/foldmarks.) which may have flattened the middle part of the line. I am happy the flattening job wasn’t perfect and the information is still there to investigate.\nLouis, will do, I do have the book at home.\n\n","date":"October 21, 2014 at 12:16 pm","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","id":"comment-164362","author":"Mike M","site":"shroudstory"},{"title":"Quick Reaction to In the Belly of the Beast","post":"Ian Wilson wrote the most balanced report on the folds.\n\n","date":"October 21, 2014 at 9:20 am","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","id":"comment-164338","author":"Louis","site":"shroudstory"},{"title":"Quick Reaction to In the Belly of the Beast","post":"Thanks Louis, will do\n\n","date":"October 21, 2014 at 12:03 pm","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","id":"comment-164361","author":"Mike M","site":"shroudstory"},{"title":"Quick Reaction to In the Belly of the Beast","post":"Folding and unfolding the centuries passed…\nI have four  question to pose :\nHow fast do linen fabrics age in the museum environment?\nHow fast do linen fabrics age in a sealed environment?\nHow fast do linen fabrics age in an argon environment?\nHow fast do linens age with ironing?\nIn a previous message I vaguely indicated the idea of CNC and AFM controls\non these celluloce crystals. But I think we have to work more seriously\nabout “signature of ageing”, cellulosic DP, CNC and inherent controls.\nUnfortunately today I have lost an entire message\n(about “signature of ageing” in linen and AFM controls).\nI am not a false prophet to persecute…\nI’m just a seeker of the truth about the age of the Shroud cloth\nand, until now, I have not  a graphene-based, carbon-layered\nelectrode array (CLEAR) device into my brain.\nLink:\nhttp://www.kurzweilai.net/transparent-graphene-based-sensors-open-new-window-into-the-brain\n(webpage retrieved with Google using “signature for aging”… without “AFM”…) \nPerhaps Kurzweil has become a false prophet with his interests\nand his proposals, however I would not want to interfere with\nhis research (as long as it is ethically correct … and here I have some doubt…).\nMy past post on Kurzweil and his ambitious (or perhaps vain) attempts to create\n“artificial consciousness” (do you remember?) was truncated because someone\ndisturbs me…\nUnfortunately I do not know the reasons for such incredible nuisance\nwhen I write (directly) on the blog by Dan.\nIs that a robotic control? A Kurzweil device??\n— —\nI have read that:\n>Rageh Omaar and John Jackson suggest that linen has some sort of memory\nfor creases thanks to permanent deformation of the linen fibres. \nThen, ironing a linen sheet, linen “memory for creases” can be changed …\nIf I well remember Eng. Fanti used an ironing treatment on some\nlinen sample submitted to CD.\n— —\nOther little things:\nI am curious to see what is the exact “scattering effect” of UV excimer laser.\nIs it possible to obtain a calibration using sand dusts and impurities\nwith different kind of granulation?\nIn other words:\nWhich kind of halo?\nWhat is the exact result from the UV light shining on linen ?\nThe differences in reflection due to the scattering effect can be detected\nusing optical and AFM controls.\nSo… we require new and adequate works …\n\n","date":"October 21, 2014 at 12:26 pm","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","id":"comment-164364","author":"piero","site":"shroudstory"},{"title":"Quick Reaction to In the Belly of the Beast","post":"Great, Mike. He has seen the Shroud from close twice. Now I’m not saying that nothing escaped his attention but the folds were easy to observe before 2002.\n\n","date":"October 21, 2014 at 12:29 pm","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","id":"comment-164365","author":"Louis","site":"shroudstory"},{"title":"Quick Reaction to In the Belly of the Beast","post":"Mike’s picture is excellent.  It’s plain enough that the residual marks are not the straight lines across the cloth that one might expect.  But maybe that’s because we’re more used to seeing machine-made linen products with uniform creases.  Hand-spinning of the threads, and hand-loom weaving would imply greater variability, and maybe the creases follow the path of least resistance. Yes, I know, I already said that.\n\n","date":"October 21, 2014 at 2:27 pm","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","id":"comment-164389","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Quick Reaction to In the Belly of the Beast","post":"Right! Some thorough investigation later. I’m sorry to rain on everybody’s parade, but Mike’s “valley-fold” creases date from 2002 and no earlier. They were not easy to observe before 2002 as they weren’t there at all. They are regularly spaced and do not meet in the middle, extending only as far as the longitudinal scorch lines about a quarter of the width in from the edges. They do not coincide with John Jackson’s supposed lines as sketched in his paper. What they do coincide with, all of them, exactly, without exception, are Mechtilde Flury-Lemberg’s new stitching of the new backing cloth to the shroud, whose threads are clearly visible on Shroud 2.0. Looking carefully at the BBC video at high magnification, you can even see zig-zag marks across these ‘folds’, showing a certain amount of ‘slumping’ as the Shroud was held in a vertical plane. There are ten such lines of stitching, irregularly spaced along the length of the cloth, and none of them crossing the cloth within the scorch-lines. They are nothing to do with any ancient lifting machanism.\nThat does not, of course, mean that I have discredited Jackson’s fold hypothesis entirely. He relied on different supposed creases, in different places. However, his creases still seem to me to be partial-width, curved, and most probably due to rolling up the Shroud, stitched to its backing, around a pole (where, obviously, the inside cloth would have to wrinkle, having a smaller radius of curvature).\n\n","date":"October 22, 2014 at 12:01 pm","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","id":"comment-164652","author":"Hugh Farey","site":"shroudstory"},{"title":"Quick Reaction to In the Belly of the Beast","post":"Good Job Hugh, you are right, they do coincide with stitches in Shroud2.0\n\n","date":"October 22, 2014 at 1:29 pm","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","id":"comment-164673","author":"Mike M","site":"shroudstory"},{"title":"Quick Reaction to In the Belly of the Beast","post":"Leaving no stone unturned…\nJackson’s elaborate jack-in-the-box hypothesis is thoroughly described, and depicted, in the ‘In the Belly of the Beast” post previous to this one. Folding a piece of paper to match his picture, the folds can be described, from the toe of the dorsal image to the toe of the ventral image, with the image facing us. Using Jackson’s letters as labels, and “M” or “V” to describe mountain or valley folds, we have: A-M, B-M, C-V, D1-M, D2-M, E-M, F1-V, F2-V, F3-V, F4-M, G-V. Now we can attempt to identify whether the creases he observes in the shroud actually are as described, both by using his own (Vern Miller’s) photos, and where available (as coverage is not complete) those on the video heretofore referenced. Sadly, Miller’s photos are not clear enough to be helpful. All the folds look like mountain-folds to me, but I would not swear to more than a few of them. However, we can use these as a reference for the video. In that, A-M, B-M and C-V are visible, and then there is no film until a still at F, where all the folds are all clearly mountain-folds (F1-M, F2-M, F3-M, F4-M) when three of them should be valley-folds.\nMike’s still above, incidentally, shows fold B, almost exactly half way between his boldly labelled ‘Fold marks.’ Given all this, and the fact that the creases are all short and mostly curved, I am satisfied that Jackson’s lifting-mechanism hypothesis is not confirmed by observation.\n\n","date":"October 22, 2014 at 1:20 pm","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","id":"comment-164671","author":"Hugh Farey","site":"shroudstory"}]
