[{"title":"John Jackson Presentation at a Roman Catholic in 2002","post":"Hi Dan! I look forward to your daily posts. I am currently engaged in an online “debate” with someone who insists on nothing less than a “peer review in a respected scientific journal.” I figure if anyone had such references at his fingertips it’d be you. Can you suggest one?\nKeep up the good fight!\nJoe Veneroso\n\n","date":"June 20, 2014 at 7:07 am","url":"https://shroudstory.com/2014/06/20/john-jackson-presentation-at-a-roman-catholic-in-2002/","cat":"presentation","id":"comment-131646","author":"Joe Veneroso","site":"shroudstory"},{"title":"John Jackson Presentation at a Roman Catholic in 2002","post":"Hi Joe, have a look at http://www.shroud.com/78papers.htm.\n\n","date":"June 20, 2014 at 11:03 am","url":"https://shroudstory.com/2014/06/20/john-jackson-presentation-at-a-roman-catholic-in-2002/","cat":"presentation","id":"comment-131706","author":"Hugh Farey","site":"shroudstory"},{"title":"John Jackson Presentation at a Roman Catholic in 2002","post":"Beautiful presentation, thanks Joe and Dan. John Jackson is a very honest scientist and Christian who has given, and continues to give, a lot to Shroud research.\n\n","date":"June 20, 2014 at 11:12 pm","url":"https://shroudstory.com/2014/06/20/john-jackson-presentation-at-a-roman-catholic-in-2002/","cat":"presentation","id":"comment-131941","author":"Mike M","site":"shroudstory"},{"title":"John Jackson Presentation at a Roman Catholic in 2002","post":"There’s quite an interesting comment at the end of Part 1, where Jackson demonstrates that the spectrographic data from the inage is indistinguishable from that of the scorches. He says (from 56:42): “What you find is that when you compare a reflectance curve for the body image … with the scorched areas from the 1532 fire, that within the precision of the experiment … the variation of those two curves compared to one another is basically indistinguishable. We even see the same hump repeated at about 425nm over here. This is very strong presumptive evidence that the chemistry of the body image is indeed like  … the linen of the Shroud when it is scorched, when it is thermally discoloured; like taking a hot iron and putting it on the cloth and discolouring it.” So, in 2004, Jackson thought the image chemistry was that of a scorch.\nHmm.\n\n","date":"June 22, 2014 at 12:31 pm","url":"https://shroudstory.com/2014/06/20/john-jackson-presentation-at-a-roman-catholic-in-2002/","cat":"presentation","id":"comment-132310","author":"Hugh Farey","site":"shroudstory"},{"title":"John Jackson Presentation at a Roman Catholic in 2002","post":"Hugh, the global evidence concerning the blood and serum stains contradict completely the idea of a human forgery done with an artistic technique (no matter if we think about a scorch technique or something else)…  If you really want to prove the Shroud to be the work of a forger, please start building a scenario involving someone who used the real corpse of a real crucified person in order to create a false Christian relic.  Other than this, any scenario do not match with the whole picture given by the data collected and analyzed during the 1978 investigation.\n\n","date":"June 22, 2014 at 7:03 pm","url":"https://shroudstory.com/2014/06/20/john-jackson-presentation-at-a-roman-catholic-in-2002/","cat":"presentation","id":"comment-132389","author":"Yannick Clément","site":"shroudstory"},{"title":"John Jackson Presentation at a Roman Catholic in 2002","post":"My personal opinion is that the blood stains are made of blood. I do not find them a problem for either the authenticity or the non-authenticity case. However the formation of the image from a dead body is at least as problematical, if not more so, that the formation of the image by artificial means. The trend among those who contemplate a 13th century possibility (even if they actually believe the Shroud to be authentic) seems to be towards a chemical scorch, possibly by the application of a hot object, although that hypothesis seems to be weaking, or by heat generated from a chemical reaction, currently being discussed, or by a long-term interaction between cloth and some applied substance (paint/glue or similar) which has since been removed.\nThe dead body proponents, such as yourself, not only have to produce a chemical explanation, such as the post-mortem gas or lactic acid emission and its reaction with something on the surface of the cloth, but also to explain how this gas moved exclusively in a vertical direction, and did not spread out having reached the cloth. This has never been satisfactorily addressed, even by Roger’s. whose attempt was, even by his own admission, somewhat speculative. Furthermore, the dead body proponents have to explain the contact/distance dichotomy, the pose of the dead man and the configuration of the Shroud over him. These have been addressed in some detail by various people, but not, so far, sufficiently coherently to provide a satisfactory demonstration that the image was in fact made by a dead body.\n\n","date":"June 23, 2014 at 3:38 am","url":"https://shroudstory.com/2014/06/20/john-jackson-presentation-at-a-roman-catholic-in-2002/","cat":"presentation","id":"comment-132465","author":"Hugh Farey","site":"shroudstory"},{"title":"John Jackson Presentation at a Roman Catholic in 2002","post":"“…possibly by the application of a hot object, although that hypothesis seems to be weaking, or by heat generated from a chemical reaction, currently being discussed, or by a long-term interaction between cloth and some applied substance (paint/glue or similar) which has since been removed…”\nMy italics.\nSo what do you reckon on my quicklime idea, Hugh? Realistic scenario? Think moisture-emanating imprint, captured as a thermochemical scorch on the OUTSIDE of the shroud.\n(email just arrived to say 1kg of quicklime has been dispatched)\n\n","date":"June 23, 2014 at 3:58 am","url":"https://shroudstory.com/2014/06/20/john-jackson-presentation-at-a-roman-catholic-in-2002/","cat":"presentation","id":"comment-132470","author":"Colin Berry","site":"shroudstory"},{"title":"John Jackson Presentation at a Roman Catholic in 2002","post":"Hugh, funny you just found this interesting and missed 27:01 when he can explains how a scorch is visible in transmitted light but the image isn’t.\n\n","date":"June 22, 2014 at 10:02 pm","url":"https://shroudstory.com/2014/06/20/john-jackson-presentation-at-a-roman-catholic-in-2002/","cat":"presentation","id":"comment-132431","author":"Mike M","site":"shroudstory"},{"title":"John Jackson Presentation at a Roman Catholic in 2002","post":"I didn’t find the earlier comment particularly new – it was typical of many things often said about the Shroud by the STURP team. However it adds to the interest of the later remark, don’t you think?\n\n","date":"June 23, 2014 at 3:20 am","url":"https://shroudstory.com/2014/06/20/john-jackson-presentation-at-a-roman-catholic-in-2002/","cat":"presentation","id":"comment-132463","author":"Hugh Farey","site":"shroudstory"},{"title":"John Jackson Presentation at a Roman Catholic in 2002","post":"John Jackson has always held that position, that is, The image looks like a scorch but doesn’t have all the characteristics of a scorch (re-image superficiality). It’s part of why he is inclined to a flash radiant image producing mechanism. I believe he also experimented with a hot scorch but found the exposure time required to achieve that depth extremely short (but I don’t have the reference to that study, I just heared him talk about it)\n\n","date":"June 23, 2014 at 8:10 am","url":"https://shroudstory.com/2014/06/20/john-jackson-presentation-at-a-roman-catholic-in-2002/","cat":"presentation","id":"comment-132495","author":"Mike M","site":"shroudstory"},{"title":"John Jackson Presentation at a Roman Catholic in 2002","post":"Mike, you can say that again.\n\n","date":"June 23, 2014 at 8:13 am","url":"https://shroudstory.com/2014/06/20/john-jackson-presentation-at-a-roman-catholic-in-2002/","cat":"presentation","id":"comment-132497","author":"Louis","site":"shroudstory"}]
