[{"title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)","post":"I cite the 945 AD coin, not the 692 AD coin:\n1.  The Constantine VII 945 AD coin had two unmistakeable signs of the Shroud:  the distinctive “Lock of Hair” (hair as seen by several artists), an exact match to the “3” blood-mark on the forehead of the Shroud man; and the swollen cheek.  Two other things add less convincing matching:  the similar beard and the hair parted in the middle.\n2. Constantine VII almost certainly had seen the Shroud image as full-length.\n3.  Constantine VII knew the Shroud body image was naked.\n4.  Therefore, Constantine VII knew the “wrinkles” below the neck on the Image were not part of a tunic.\n5.  Constantine VII commissioned the image of Christ as clothed, and merely added the wrinkles below the neck as a typical tunic feature, as used before on other images in other times.\n6.  The “3” mark plus the swollen cheek taken together are a sure lock that the Shroud was the model and therefore the Shroud existed well before the Middle Ages.\n7.  The wrinkles are probably a distraction in this whole argument.","date":"November 3, 2015 at 9:40 am","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","id":"comment-214140","author":"Nabber","site":"shroudstory"},{"title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)","post":"Personally I find the swelling pretty convincing. If you look at the 3-D images of the Shroud in the facial area the swelling is exactly the same in the two areas on the coin.\n\n","date":"November 3, 2015 at 2:17 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","id":"comment-214151","author":"Matthew L.","site":"shroudstory"},{"title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)","post":"It does look good, doesn’t it; but there are dozens of these coins about, and it is worth looking at them as a whole before deciding that any particular bump is more than wear and tear or an irregularity in the mould. This one: http://www.ancientresource.com/images/gold/christ-gold-18474b.jpg, has a bump on the other side, for example, but most of them have no bumps at all.\n\n","date":"November 3, 2015 at 3:24 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","id":"comment-214154","author":"Hugh Farey","site":"shroudstory"},{"title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)","post":"Well of course there is always other possibilities but on the coin in the left cheek there is this bump and then slightly diagonally from it there is the swelling under the right eye just like the Shroud. Is it really likely this is just a coincidence? I don’t think so. This is an image you can use to compare http://1.bp.blogspot.com/-y8rPtWSKPJs/UfeyoftSeAI/AAAAAAAAB0A/rUMNeCYxe0Q/s800/3D_faceMarioAzevedo.jpg Then of course its not just this coin that has swelling other Shroud-like coins have swelling in the facial area as well.\nThis is one of the main details that should tell you that the creator of these coins is using the Shroud as a model, not vise-versa.\n\n","date":"November 3, 2015 at 3:35 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","id":"comment-214155","author":"Matthew L.","site":"shroudstory"},{"title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)","post":"“An exact match to the “3” blood-mark on the forehead of the Shroud man.” I really cannot see such a match however hard I examine enlargements of the coins above. Can anyone help?\nAnd, is it perverse of me to think that Constantine himself probably did not design the coins personally?\n\n","date":"November 3, 2015 at 10:46 am","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","id":"comment-214143","author":"Hugh Farey","site":"shroudstory"},{"title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)","post":"Here’s an enlargement of a different gold solidus of Constantine VII:\nhttp://www.pbase.com/nabber/image/161767140\nIt’s amazing that the die-maker was able to portray such small features on the coin.  One can see that the “hairs” and the swollen-cheek and the eye are all similar in size, and that all were able to be captured by the die-maker.\n\n","date":"November 3, 2015 at 3:39 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","id":"comment-214156","author":"Nabber","site":"shroudstory"},{"title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)","post":"“And, is it perverse of me to think that Constantine himself probably did not design the coins personally?” \nIf one happens to be emperor, it is usually unnecessary to keep a dog and yet bark oneself!\n\n","date":"November 3, 2015 at 3:52 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","id":"comment-214157","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)","post":"I agree Hugh re: the “3” blood mark. It’s the kind of garbage that really undermines the authenticist case.\n\n","date":"November 4, 2015 at 2:13 am","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","id":"comment-214181","author":"Thomas","site":"shroudstory"},{"title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)","post":"And you’re one of those that deny the 4 L-shaped holes, herringbone weave, and blood mark on the forehead from the Pray Manuscript.  You folks really undermine the anti-authenticist case.  (and watch your manners….)\n\n","date":"November 5, 2015 at 12:42 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","id":"comment-214255","author":"Nabber","site":"shroudstory"},{"title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)","post":"Is this Thomas de Wesselow? Or…..?\n\n","date":"November 5, 2015 at 6:25 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","id":"comment-214274","author":"Matthew L.","site":"shroudstory"},{"title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)","post":"The Shroud-like similarity of the 692 solidus image is discussed at some length in Jack Markwardt’s St Louis paper.  Two other very similar images are the St Catherine’s Pantocrator and the Homs vase, all three distinctive as showing an upper body image, all from the first reign of Justinian II, and quite unlike any Edessan-based Mandylion image which more often usually terminate at the neck-line.  \nMarkwardt interprets the change in the post-exilic solidi to a younger beardless Christ as a result of Byzantine superstition.  Was it appropriate to use the “Image of God Incarnate” in this way?  Justinian did not have long to wait for his answer.  Overthrown, having his nose cut off, and sent into exile, he interpreted the defeat as a sign of divine disapproval of this use of the image.  Consequently when he was eventually reinstated the coin imagery was changed to an idealised youthful and beardless Christ.  \nIt is apparent that the Shroud image was known in Constantinople during Justinian’s reign, and in all likelihood was already there.  At this time the Mandylion was still in Edessa, but it was Ian Wilson’s contention that its purported full-length image did not become known until after it arrived in Constantinople in 945.  The weakness in the Wilson argument then becomes apparent.  The Shroud was never the Mandylion.  Even Mark Guscin in his PhD thesis seems to become confused by the prevalence of face-only images and reports of a pre-945 full-body image.  The two images are evidently quite distinctive from each other.  \nit is also Markwardt’s contention based on the Tarragon manuscript, that following a series of continuous earthquakes during the mid-8th century in Constantinople, the Shroud was hidden away in the imperial palace, only to be revealed by a later emperor Alexios around 1200.  He claims that this accounts for the apparent disappearance of the Image of Camuliana from the records after about 745 and which he asserts was actually the true Shroud.\n\n","date":"November 3, 2015 at 2:37 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","id":"comment-214152","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)","post":"The Shroud was never the Mandylion\nStrong disagreement.\nIt is apparent that the Shroud image was known in Constantinople during Justinian’s reign, and in all likelihood was already there.\nNot necessary. Edessa at that time was still a part of Byzantine Empire.\n At this time the Mandylion was still in Edessa, but it was Ian Wilson’s contention that its purported full-length image did not become known until after it arrived in Constantinople in 945. \nI disagree with Wilson at this point. I suppose that some privileged people knew the true nature of then Image of Edessa. But for some reason they tried to conceal the truth.\nAnd Byzantines after 944 tried to conceal the truth either. This is evident if you look at their expressions re Mandylion and the burial cloths (see the accounts of Constantine Porphyrogenitus and Nicholas Mesarites for example).\n\n","date":"November 3, 2015 at 3:57 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","id":"comment-214158","author":"O.K.","site":"shroudstory"},{"title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)","post":"Although Edessa was nominally part of the Byzantine empire, the Edessans were more oriented towards a Syriac tradition and somewhat resented their Byzantine subjection.  In 639, Edessa fell to the Moslems, whereas the Justinian II solidus is dated 692, when the Mandylion would not have been easily accessible to the Byzantine court.  \nMarkwardt in his paper summarises the several scholarly reasons against the Mandylion being the Shroud. \nO.K. will need to give a satisfactory explanation of the Tarragon manuscript description of the image that was locked away as a result of the earthquakes.  It certainly was not the Mandylion which was frequently displayed in public.\n\n","date":"November 3, 2015 at 4:39 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","id":"comment-214161","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)","post":"O.K. will need to give a satisfactory explanation of the Tarragon manuscript description of the image that was locked away as a result of the earthquakes. It certainly was not the Mandylion which was frequently displayed in public.\nFancy tale.It shows how Markwardt conveniently chooses details which fit him, ignoring other explanations.\nhttp://www.shroud.com/pdfs/stlmarkwardtpaper.pdf\nThere is in the same glorious city, the face of our Lord Jesus Christ on a linen cloth, made by Jesus himself in the following way, as the Greeks say. The above-mentioned King Abgar was in the city burning with a great desire to see the beautiful face of our Lord. Jesus knew of the king’s desire and so took a linen cloth and wrapped his face in it—the form and figure of his face was imprinted on to the cloth. The Saviour thus sent his face to King Abgar on the linen cloth, so that he might see what he looked like. This wonderful linen cloth with the face of the Lord Jesus, marked by direct contact, is kept with greater veneration than the other relics in the palace, and held in such esteem that it is always kept in a golden case and very carefully locked up. And when all the other palace relics are shown to the faithful at certain times, this linen cloth on which the face of our redeemer is depicted is not shown to anyone and is not opened up for anyone except the emperor of Constantinople. The case that stored the holy object used to be kept open once, but the whole city was struck by continuous earthquakes, and everyone was threatened with death. A heavenly vision revealed that the city would not be freed of such ill until such time as the linen cloth with the Lord’s face on it should be locked up and hidden away, far from human eyes. And so it was done. The sacred linen cloth was locked away in a golden case and carefully sealed up, and then the earthquake stopped and the heaven-sent ills ceased. From that time on nobody has dared to open the case or to see what might be inside it, as everyone believes and fears that if anyone tries to open it the whole city will be struck by another earthquake.\nThe reference of King Abgar clearly provides link to the Mandylion. And as to earthquakes -convenient excuse for keeping the Mandylion closed, and keep its true nature a secret….\nThere were probably many earthquakes in Constantinople, not only those that fit Markwardt…\n\n","date":"November 3, 2015 at 6:37 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","id":"comment-214165","author":"O.K.","site":"shroudstory"},{"title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)","post":"Between 745 and about 1200, only the emperor was permitted to open the casket in which the “Image of God Incarnate” was hidden from other eyes.  For a special purpose, he might show the image to others in private, but never publicly.  Hence it would seem that Constantine VII permitted his mint officials to view the image.  Likewise there would be good reason for Bela III of Hungary, then betrothed to the emperor’s daughter and so heir-apparent also to view the image, as appears evident from the HPM, which shows vestigial recollections of this viewing.\n\n","date":"November 3, 2015 at 4:09 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","id":"comment-214159","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)","post":"It does seem that the authorities in Constantinople were troubled in the year 944. See the response by one of the top Shroud scholars, where he talks about Edessa, Constantinople and why the preaching was changed:\n https://www.academia.edu/14795646/An_interview_with_Professor_Heinrich_Pfeiffer_SJ\n\n","date":"November 3, 2015 at 6:13 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","id":"comment-214163","author":"Louis","site":"shroudstory"},{"title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)","post":"Thanks Louis. \nAs I said:  Markwardt borrows heavily from Pfeiffer -but disregards the latter’s views on that matter (because they are inconvenient for him).\n\n","date":"November 3, 2015 at 6:21 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","id":"comment-214164","author":"O.K.","site":"shroudstory"},{"title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)","post":"Hi O.K.\nYou have understood the situation clearly, that is why I provided a link to Father Pfeiffer’s interview. It provides support for your views.\n\n","date":"November 3, 2015 at 6:44 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","id":"comment-214166","author":"Louis","site":"shroudstory"},{"title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)","post":"Following that logic it would therefore seem that Justinian II in the year 692 was able to produce a Shroud-like image on his coinage, inclusive of the upper body, despite the Mandylion having been inaccessible to him and under Moslem control for the previous 53 years!!??  One might wonder why he might show any interest in such a relic, unless he had a better alternative more readily available!\n\n","date":"November 3, 2015 at 7:16 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","id":"comment-214169","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)","post":"Ian Wilson wrote about the ‘loros’, a garment worn by the emperor and signifying the Shroud, on the reverse side of the coin. That was his interpretation.\n\n","date":"November 3, 2015 at 7:22 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","id":"comment-214170","author":"Louis","site":"shroudstory"},{"title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)","post":">The first representations of the loros\nare on coins from the reign of Justinian II\n(r. 685–695 and 705–711).\nIs that information right or wrong?\nProbably the work “Reconstructing\nthe Reality of Images:\nByzantine Material Culture and\nReligious Iconography 11Th-15th Centuries”\ncannot answer about that\nancient epoch of Justinian II …\n\n","date":"November 4, 2015 at 11:34 am","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","id":"comment-214200","author":"piero","site":"shroudstory"},{"title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)","post":"Subject: “The lock of hair on the forehead”.\nYes.\nI have to admit : this Face\n(on that ancient coin)\nhas not a strong evidence for “epsilon”\nsign, but there is a feeble trace about\na lock of hair, maybe a little bit as\nyou can see it in the image of the\nHoly Face of Manoppello…\nCan be the Holy Face of Manoppello\nthe “better alternative more readily available”\n(See also: the message by\n“daveb of wellington nz”)?\nBut observing the detail of “a hair lock\nin the middle of the forehead” of the\nHoly Face of Manoppello we can\nconclude this Face on the coin\nis not very similar to the Manoppello’s Veil.\nPerhaps the dimension of the area\nwas too little and then difficult\nto exactly work during the coinage\nfor this coin.\nAt the end I have some residual doubt…\nOn the image shown by Nabber\nthe Epsilon seems to be mislocated,\nonly the eyes seem interesting.\nBTW: Yesterday I saw a\nchild with red eyes and swollen …\n\n","date":"November 4, 2015 at 11:27 am","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","id":"comment-214198","author":"piero","site":"shroudstory"},{"title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)","post":"Piero, “the Epsilon seems to be mislocated” — on a coin of this size (or any size), the ability of the “artist” to precisely locate something like the Epsilon would have been difficult indeed.\n\n","date":"November 5, 2015 at 12:48 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","id":"comment-214256","author":"Nabber","site":"shroudstory"},{"title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)","post":"The wrinkle in the neck is a characteristic feature of many roman portraits. See some examples of FAyum here: https://sombraenelsudario.wordpress.com/2013/07/08/galeria-de-expertos-sindonistas-paul-vignon-el-biologo-historiador-del-arte/ \nI wonder why “experts” sindonists in Art are usually physicians, engineers and amateurs. (My wonder is rethorical).\n\n","date":"November 5, 2015 at 3:29 am","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","id":"comment-214242","author":"David Mo","site":"shroudstory"}]
