[{"id":"comment-104298","author":"jenx","post":"Amen.","date":"2014-04-27","mins":"1:08 am","url":"https://shroudstory.com/2014/04/26/report-on-barrie-schwortz-in-hamilton-ontario/","cat":"presentation","title":"Report on Barrie Schwortz in Hamilton, Ontario"},{"id":"comment-104595","author":"jenx","post":"I always hoped Barrie would write a book on the highlights of his site along with his experience. I really enjoy his presentations and respect his work..","date":"2014-04-27","mins":"10:59 pm","url":"https://shroudstory.com/2014/04/26/report-on-barrie-schwortz-in-hamilton-ontario/","cat":"presentation","title":"Report on Barrie Schwortz in Hamilton, Ontario"},{"id":"comment-85210","author":"jenx","post":"Fantastic points and comments. With religion being weaved into society and the artifact, it would be nearly impossible not to have subconscious biased theories even if they were suppressed. I’ve been thoroughly impressed with Barry Schwortz and his media presentations, even more so with this consideration..","date":"2014-03-05","mins":"2:27 pm","url":"https://shroudstory.com/2014/03/02/jones-the-turin-shroud-is-authentic-get-over-it/","cat":"other_blogs","title":"Jones:  The Turin Shroud is authentic. Get over it!"},{"id":"comment-97406","author":"jenx","post":"True Christians and false Christians are separated through love, tolerance and reaction to adversity. How do you act when you don’t get your way or when someone doesn’t agree with your beliefs? Newsflash Bigotry is NOT a Christian trait, in fact it’s an oxymoron. Remember folks, when you come online, the world is watching. It’s great to voice our individualism and thoughts, but IF you are a Christian it is your obligation to do so in a Christ like manner, regardless how right you THINK you are, or agitated you become. Why would anyone want to convert to a group of angry hypocrites spewing out condescending remarks faster than a new PEZ dispenser? It only encourages atheism..","date":"2014-04-07","mins":"12:04 pm","url":"https://shroudstory.com/2014/04/06/stephen-jones-is-even-questioning-my-beliefs-about-the-resurrection/","cat":"other_blogs","title":"Stephen Jones is even questioning my beliefs about the Resurrection"},{"id":"comment-86406","author":"jenx","post":"Or…. There would be a lot of scandals at the daycares. Ha!.","date":"2014-03-08","mins":"11:33 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"},{"id":"comment-86374","author":"jenx","post":"With all respect, I believe in this particular passage, Christ was praising God for the mysteries which had been revealed to the disciples (who were childlike) and not so for the Scribes and Pharisees (who rejected Christ’s teachings and the significance of His deeds). With a cross reference in Lk 8:10 and further in Mt 11:25 27. I can relate to this passage too. During my university years I began to think too deeply for scientific answers which made me question my original faith. Only when I submitted to my childlike state could I find the answers. Which in itself is another mystery! They’re everywhere! Lol. But too, this is just what “I” see in the scripture. I believe the Bible is a personal gift to each of us as individuals with different passions (and translations) to help us through our time on earth. And as followers in Christ we respect that individualism and unite through our actions and love..","date":"2014-03-08","mins":"9:44 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"},{"id":"comment-86331","author":"jenx","post":"Hello. I’m new to the site and enjoy your posts and debates! I heard a few years back where Schwortz commented about a financial benefit for the University if the Carbon 14 results were within the Window however, it wasn’t expanded due to the political repercussions. I think personally the sample was unintentionally tainted from prior restorations… and maybe it was meant to be, just like finding the missing factor in life, Christ’s existence, the Bibles authenticity, animals that defy physics and so forth. It’s amazing all of these unrelated mysteries coincide, pointing directly to the creator, but yet also leaves a gap to be filled with faith, by choice. Jen X, Ohio.","date":"2014-03-08","mins":"6:43 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"}]
