[{"id":"comment-41996","author":"jmarino240","post":"I wrote: “Just so the record is clear: when I referred to Shroud researchers who are more interested in making a name for themselves than finding out the truth about the Shroud, I was not including Wilson.” Yannick wrote: “Of course. He’s an intouchable in the Shroud world… Yannick, I find your comment offensive. By impugning my statement and not even allowing me the freedom to just express an honest opinion, you are apparently showing that you feel that everyone should simply agree with you. You are not going to win many converts with your M.O..","date":"2013-08-25","mins":"7:09 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-42010","author":"jmarino240","post":"I wrote: “Just so the record is clear: when I referred to Shroud researchers who are more interested in making a name for themselves than finding out the truth about the Shroud, I was not including Wilson.” Yannick wrote: “Of course. He’s an intouchable in the Shroud world… Yannick, I find your comment offensive. By impugning my statement and not even allowing me the freedom to just express an honest opinion, you are apparently showing that you feel that everyone should simply agree with you. You are not going to win many converts with your M.O. Yannick wrote:. . . “If my comment offended you, I’m sorry but I just can’t shut up about that. It’s very frustrating to see that, amongst Shroud researchers, there truly seem to be a kind of immunity that prevent any of them to criticize the bad antics of a “colleague”. Yannick, you didn’t need to put “if my comment offended you…” There is no “if.” I told you directly it did offend me. In another posting you compared Wilson to Dan Brown. I will give you an analogy for your “if my comment offended you.” That’s the sort of wording that politicians and celebrities use when they do something offensive and the heat is so great they have to say something. They rarely just outright apologize because they can’t be wrong. Their thoughts & behaviors are the gold standard and everyone else has to conform to them..","date":"2013-08-25","mins":"8:16 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-42017","author":"jmarino240","post":"Yannick wrote: “I don’t feel I need to go down on my knees for having told what I consider the truth. Of course, you can think something else than me. The main point is this: your reaction concerning the fact that “and by the way, I was not meaning Wilson” was very telling of the kind of politically correctness that goes on and on and on Inside the pro Shroud world… Expressing what you consider to be the truth is fine, but I resent you taking a statement of mine, which was simply a clarification, and thus chastise me because I didn’t join with you to criticize Wilson. What you consider to be the truth = your opinion. Other people have opinions, too. If you find someone willing to debate with you, fine. But don’t just try hitting everyone over the head with your opinion, especially when it wasn’t asked for. I assume you will post something in response but I am done..","date":"2013-08-25","mins":"9:01 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"}]
