[{"id":"comment-173953","author":"jmarino240","post":"Last sentence: “datring” should be “dating.”.","date":"2014-11-30","mins":"9:06 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-173659","author":"jmarino240","post":"Mario, You have some excellent points..","date":"2014-11-29","mins":"6:08 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-192997","author":"jmarino240","post":"There’s one other point worth making regarding the psychological aspect of clinging to a belief. Rogers was clearly convinced at first that he would be able to disprove the reweave theory. He was then clearly embarrassed that he had to agree with 2 people whom he considered to be in the “lunatic fringe.” I dare say that not all scientists would have shown the integrity that Rogers showed in changing his position..","date":"2015-03-09","mins":"6:48 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-34798","author":"jmarino240","post":"Regarding Giorgio’s question about Mc Crone’s statements and Yannick’s question regarding who now owns the Nitowski samples, I’ve been forwarding other comments to Paul and will let him address both areas..","date":"2013-05-25","mins":"7:25 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34817","author":"jmarino240","post":"Yannick wrote: “Can you confirm to me that both Mc Crone and Nitowski have only analyzed samples that were taken by STURP and not by Max Frei or Riggi?” Mc Crone analyzed samples of Frei’s but I don’t know if he incorporated them at all into the map that Paul attached. Mc Crone & Nitowski would not have been given access to any Riggi samples. I forwarded to Paul a 2nd time your suggestions about his research and also asked him to comment on the Frei samples vis a vis Mc Crone..","date":"2013-05-25","mins":"9:19 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34815","author":"jmarino240","post":"Giorgio wrote, “Joe can you and Paul give me your hypothesis what Dr. Mc Crone is stating with these remarks?…” Paul responded: “I would not be able to present the following as an hypothsis–rather, it would be more like a “personal guesstimate”. STURP learned early on that Mc Crone was heading toward a finding that the image was caused by iron oxide. This was disturbing to them. I called and talked with Dr. Robert L. Feller [paint chemistry and art conservation at the Carnegie Mellon University in Pittsburgh, PA] and he knew Mc Crone’s penchant for the light microscope (as opposed to other technological approaches like spectrometry and sophisticated chemical analysis). He told me that Mc Crone liked to identify things by using his eyes. Indeed, Mc Crone once said something similar to me when he hoped that his work (such as with the particle atlas) would “save” the light microscope. And, in fact, Mc Crone was famous for his ability to see things under the eye of the scope and proffer a professional opinion about it. But Feller believed that Mc Crone was old fashioned (that is not his word–that was simply how he felt about it) in his use of the microscope. Feller suggested that the microscope would be well served by supplementing it with other, high tech, approaches. In other words, Mc Crone was giving his “opinion” about things of which he had long experience. But Mc Crone had never heard of the compilation of work on the True Copies by Don Luigi Fossati in his earliest work so he developed the first thing that came to his mind, born of that long experience and the logic that emanated from it. But Mc Crone was not the only one to puzzle over the color of “blood” on the Shroud. Adler, himself puzzled over it and with experimentation told me that he could duplicate the “redness” of the blood by assuming that the Man of the Shroud was a victim of blood trauma where the billirubin was some 500 times concentrated. Dr. Gilbert Lavoie told me that he and Adler were working on this possibility and that Lavoie had, in his refrigerator, a sample of tramatized blood taken from a man who had suffered from a chain gang beating. To my knowledge, little further was done on this because Adler passed away from a severe brain hemmorage–a tragic loss to us all. One might ask Dr. Lavoie for input on this matter. But, to another question put to me by the late lawyer, Benjamin Wiech–why does the blood color appear to keep changing?–I responded that it will depend on the lighting that illumines it. The “true” color is not seen unless the full spectrum of light shines on it. (Sunlight is the best resource for this–but, of course, we do not wish UV rays to damage the Shroud and so that is usually filtered out). We must also remember that Mc Crone was limited in another way: He was not a direct on site participant scientist who could examine the fibers of the Shroud under the Wild M 400 microscope in it textile context in the way that Sam Pellicori and Mark Evans could. He could only see the fibers removed from the Shroud as a “remainder” after the fact on the sticky tapes that STURP (i.e. Ray Rogers) had removed from the cloth with the “torque applicator”. And these samples were truly from the surface because Ray and Joan Janey (later Mrs. Ray Rogers) designed the instrument to do exactly that–to remove only surface material. Mc Crone had no way to use a tungsten probe and part the crowns of the threads to examine them from side to side to draw conclusions while in Turin. He also did not have the value of discussing various ideas with other participants on site in Turin to help formulate a modulated hypothesis. Indeed, Mc Crone apparently did not even avail himself of some excellent technicians in his own employ at the Mc Crone Research Institute in Chicago–and unfortunately I have momentarily misplaced my copy of the book Barrie Schwortz edited for Ray Rogers so I cannot now remember the name of the technician (Anderson?????) who suggested to Mc Crone that his own Ramen Spectroscopy showed a blood signal–not iron oxide. Thus, it may have been a very personal thing–an inability to change his mind about his own initial belief that it was iron oxide because to do so would mean he could not “save face.” And, after all, the inorganic pigment–iron oxide–did not change color. But blood does not usually stay red–for it will turn brown then black with time. I know of many scientists who found themselves in this professional predicament. Forgive the following excursus as an example: The late Glenn Seaborg (for which the element “seaborgium” is named), tells the story that he became convinced that the periodic table should be changed and re formated. So he went to his doctoral advisor at the University of Chicago and suggested the idea. But his advisor, committed to the old way it was formated, said, “Well, I wouldn’t go public with that if I were you. It will ruin your reputation.” The old professor could not change from his commitment to the older view of the periodic table. But look in any modern book of chemistry and examine the periodic table–that is the way Glenn Seaborg had proposed it and now it is the accepted view. I cannot say that this was Mc Crone’s problem. And it will probably never be known with certainty since Mc Crone is no longer able to discuss the matter. I do know, from my own talks with him, that Mc Crone did seriously believe that what he saw on the Shroud tapes was largely iron oxide as the image pigment. I often agreed with him on the finding of iron oxide–but I told him that the True Copy issue was a major clouding of the answer and since, as I noted above that Mc Crone did not have the advantage of seeing the Shroud personally with his own eyeballs, he drew his conclusions and stated them publically based for the most part on light microscopy. He wanted to make a convert of Fr. Rinaldi and hoped that I, too, would eventually “see the light.” Science is often a personal thing. After all, we are all humans and it takes the voices and views of many and the accumulated data of scientific observation to get to the final objective truth.” Regards, Paul.","date":"2013-05-25","mins":"9:11 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34821","author":"jmarino240","post":"Paul Maloney wrote: Dear Yannick and Giorgio, About the use of spectroscopy and chemical analysis, I could not agree with you more! But I am not a physicist or an analytical chemist (I am an archaeologist) and I do not have access to the sophisticated equipment–often found only in well funded laboratories–needed to conduct such work. Moreover, I know from personal experience with the microscope that I have already spent more than a thousand hours just doing the photomicrography on the Max Frei tapes. The further work that would be needed by a physicist (using various types of spectroscopy) or an analytical chemist would involve the need for further extensive in depth funding and specialists in various forms of spectroscopy and other arenas to do what really needs to be done. But someone has to start somewhere. By compiling this photo visualization of the particles, fibers, and botanical traces on the Shroud, it provides other specialists with an “outline” whereby professionals can enter the picture and begin to flesh out the story of the Shroud in better and more illuminating detail than I ever could. Moreover, by stating that I am not using spectral analysis or chemical probing, I give a “heads up” to these other specialists to come to the fore and do what they do best. Additionally, if I tried to employ such equipment as a non professional, I would quite certainly engender the kind of criticism you hope I’ll be able to avoid. But, I am happy to work as an advisor with these scientists if they wish. I should, however, state that I no longer have direct access to the Max Frei Tapes–only to the some 7000 Kodak transparencies I made between Jan. 1986 and July 1993. The tapes are now curated by Dr. And Mrs. Alan D. Whanger, Prof. Emeritus at Duke University, in Durham, North Carolina. Naturally, I would wish to conduct much of this work in a non destructive fashion. Chemical analysis would, by its very nature, be destructive. Even doing proper palinology (as Max Frei did on the 1973 tapes) required him to cut tiny incisions in the form of a “T” in the tape to remove each pollen grain he selected and re mount it separately on a microscope slide. He did this many times. But it does do “damage” to the tapes. And if the pollen grains were coated with some sort of coating, as Giovanni Riggi di Numana told me many of his own pollen grains were coated, then an acid would be needed to remove that coating before proper pollen analysis could be done. And it would be important in that case to discover the composition of the coating BEFORE that coating was removed because it could contain a very important clue as to the original (tomb?) environ from which it had come. So many technicians and consultants would have to come together to plan carefully how to use the wealth of material on the Max Frei Tapes. With all best wishes, Paul.","date":"2013-05-25","mins":"9:28 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34793","author":"jmarino240","post":"Yannick wrote: “Now, I’ll wait patiently for your answers to my 2 other questions.” I did reply to the other questions in the next 2 sentences: “We referred to only one sample with madder rose based on the Nitowski map as opposed to 2 samples that Maloney and Mc Crone referred to on Mc Crone’s map” was in response to question 1 and “It’s not proven that gum arabic was on 1 FH–we just said it was plausible based on the Quad mosaic data and Rogers’ findings” was in response to question 3. It seemed to flow better to start with question 2 and when I originally responded I didn’t specify the other 2 questions..","date":"2013-05-25","mins":"6:54 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-46427","author":"jmarino240","post":"Daveb wrote “So who did the invisible weave? Pricess Clothilde of Savoy around 1868; Or as commissioned by Margaret of Austria, Duchess of Savoy at some time during 1508 1530, as asserted by Marino & Benford?” From: http://www.shroud.com/pdfs/benfordmarino.pdf The most famous tapestry worker of this period was Pieter van Aelst, who produced numerous tapestries for more than thirty years. Max wrote, “Absent the fact that such repairs in this particular area was anything but neutral as it was the very area the most handled with naked hands.” From Robert Buden, President of Tapestries & Treasures. Tapestries & Treasures ( http://www.tapestries4less.com), which produces, imports, exports, and distributes high quality, historical tapestries to clients throughout the world, including 16th Century pieces in article found at: http://www.shroud.com/pdfs/histsupt.pdf: Did weavers of the 16th Century possess the skill to ‘invisibly repair’ textiles? Most definitely. Would the restoration of a Holy Relic like the Shroud of Turin be assigned to a novice or the finest craftsmen in the land? I think the latter. Was budget a concern for the Church or its noble owner at the time? Most likely not..","date":"2013-10-07","mins":"10:16 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46104","author":"jmarino240","post":"I’ve been somewhat out of commission for a few days dealing with a sick dog. I was preparing a posting consisting of various responses made at the “Shreds of Evidence” posting of 23 September, which overlaps somewhat with this one. I was almost done when I somehow managed to lose all of the text of the posting. I’m not in the mood to try and reconstruct tonight. I’m going to be out of town this weekend. I might try to start to reconstruct tomorrow night and finish early next week..","date":"2013-10-03","mins":"9:39 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-197256","author":"jmarino240","post":"Louis wrote “Would you know the names of the institutes, both in the US and the UK?” Here is a quote from my Fidelity article of Feb 1989: “In April, Harbottle (personal communication, 1988) commented: ‘The experiment is to be performed by the same scientists who not three months earlier clearly and effectively objected to its terms. But Oxford is heavily supported by the British S.E.R.C. (Science Research Engineering Council) and Tucson equally so by N.S.F. (National Science Foundation); one will be very surprised if shroud dating is not prominently mentioned in heir next round of grant applications.'”.","date":"2015-04-22","mins":"9:33 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-74595","author":"jmarino240","post":"There were a couple of sentences I found most interesting in this paper: “In any case, the most important aspect of this work, from the point of view of physicists working in the field of AMS dating, is the methodological one concerning sampling strategy. First, sampling should always be done in agreement with and under the guidance of scholars and people involved in the historical or archaeological problem. In addition, whenever possible, collecting several samples from the object to be dated (as we did in the case of the two frocks) is definitely the right approach in order to reduce the possibilities of ambiguities.”.","date":"2014-01-25","mins":"6:49 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74574","author":"jmarino240","post":"Charles, The Chemistry Today article ends: The exact ratio of patch versus original threads is not determinable by photographic analysis alone; however, a well supported estimate, based upon weave pattern changes, has been posited (2) reflecting approximately 60 percent of the C 14 sample consisting of 16th Century threads while approximately 40 percent were 1st Century in origin. The radiocarbon date was calculated using the percentage of observed 16th Century (representative date used AD 1500) versus 1st Century (representative date used AD 75) weave types appearing in the Oxford sub sample. The radiocarbon calculations were derived using the following mathematical calculations and in consideration of the above hypothesis. The question asked was what percent cal AD 1500 + percent cal AD 75 radiocarbon would be required to derive an average age of cal AD 1210 (~Oxford results)? Using standard Measured Conventional Before Present equivalents, the formulas for calculation become 0.9003 = (x) (0.9558) + (1 x) (0.7851). Solving for X (where X ~ percent cal AD 1500 carbon present) X = 0.6749 ~ 67 percent. Dr. Thibault Heimburger posted recently that he would responding soon to Hugh’s BSTS article on the invisible reweave theory, so I’m looking forward to his post. Glad you liked Sue’s theory regarding the pyramid. She was a remarkable woman. I lost her almost 5 years ago and still miss her terribly..","date":"2014-01-25","mins":"4:03 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-15188","author":"jmarino240","post":"For some reason, in my previous email, the quote from Freeman, which was to follow “Freeman wrote,” did not appear. His quote was: Those of us who stick to the presumption of the 1988 dating standing do so a) because in relation to the three possible alternatives, a swapping over of samples by the Cardinal and Tite, some form of contamination ( many different contaminants, soot, sweat, carbon monoxide suggested) or an invisible rewoven patch selected as the sample, critics of the testing disagree so violently among themselves – e.g see Antonacci’s critique of Raymond Rogers’ 2005 paper that the independent observer cannot be convinced that a single clear refutation of the 1988 testing has been proposed by the critics b) There is not a hint in any of these critiques that resolution of the problems proposed would lead to a radio carbon 14 dating in the first century..","date":"2012-08-18","mins":"5:01 pm","url":"https://shroudstory.com/2012/04/29/carbon-dating-the-shroud-of-turin-again/","cat":"carbon_14_dating","title":"Carbon Dating the Shroud of Turin Again?"},{"id":"comment-74327","author":"jmarino240","post":"Dyes apparently work better with cotton than with flax..","date":"2014-01-23","mins":"10:22 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-105717","author":"jmarino240","post":"It was a hybrid: Wasserman! But “Jerry” was also mentioned, suggesting Wasserburg. But Rossman answered in the affirmative when Sue asked him on the phone if he had been involved. This is emblematic of the extreme confusion in this whole thing. I don’t believe this will get sorted out to anyone’s satisfaction..","date":"2014-04-29","mins":"8:15 am","url":"https://shroudstory.com/2014/04/28/did-a-single-thread-get-tested-in-1982-is-it-important-to-know-and-why/","cat":"carbon_14_dating","title":"Did a single thread get tested in 1982. Is it important to know? And why?"},{"id":"comment-74474","author":"jmarino240","post":"Charles, 2 good sources to check and/or recheck are: http://www.youtube.com/watch?v=Y Wyi Ztagx X8 at about the 26:00 mark and also http://www.shroud.com/pdfs/benfordmarino2008.pdf. Many thanks for all your insightful observations..","date":"2014-01-24","mins":"7:26 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-105721","author":"jmarino240","post":"See http://www.shroud.com/late02.htm. Another point of confusion is the fact that Wasserburg also studied moon rocks..","date":"2014-04-29","mins":"8:23 am","url":"https://shroudstory.com/2014/04/28/did-a-single-thread-get-tested-in-1982-is-it-important-to-know-and-why/","cat":"carbon_14_dating","title":"Did a single thread get tested in 1982. Is it important to know? And why?"},{"id":"comment-105724","author":"jmarino240","post":"I should also point out that at the time Sue talked to Rossman, we were unaware of Wasserburg’s existence..","date":"2014-04-29","mins":"8:26 am","url":"https://shroudstory.com/2014/04/28/did-a-single-thread-get-tested-in-1982-is-it-important-to-know-and-why/","cat":"carbon_14_dating","title":"Did a single thread get tested in 1982. Is it important to know? And why?"},{"id":"comment-104910","author":"jmarino240","post":"In this case, instead of saying yes to specific proposed possibility, I should say that given the extreme confusion, anything is possible..","date":"2014-04-28","mins":"10:02 am","url":"https://shroudstory.com/2014/04/28/did-a-single-thread-get-tested-in-1982-is-it-important-to-know-and-why/","cat":"carbon_14_dating","title":"Did a single thread get tested in 1982. Is it important to know? And why?"},{"id":"comment-209819","author":"jmarino240","post":"Dear Giorgio, I agree that the cultural aspect is huge but the phrase “ordained priests who had ownership of the Shroud” leaves a very bad taste in my mouth. In my view, the Shroud belongs to the world, not to just the Church and certainly just not to ordained priests. STURP was invited by Church authorities to try and find out the truth about the Shroud and there were some significant cultural “hindrances.” If the original plan of letting STURP II have 2 weeks for a multi disciplinary program with the Shroud, it is likely that it would have cemented the idea that the cloth is probably the burial cloth of Jesus (one can probably never get to 100% certainty). If that had happened, who knows how many people might have been brought to Catholicism or Christianity?.","date":"2015-09-07","mins":"10:32 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209824","author":"jmarino240","post":"Dear Giorgio, Thanks for the clarification. But I believe there was in 1978 some sense of ownership by the Church in the other interpretation of the word. Lest I sound like a broken record, if the Vatican is in the business of trying to save souls and is interested to find out the truth of the Shroud as they proclaimed in 1978, they would allow more than just public expositions..","date":"2015-09-07","mins":"11:04 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-210148","author":"jmarino240","post":"Although Sebastian Valfre was known to have worked on the Shroud in the 17th century, other repairs could certainly have been made earlier. Giulio Fanti believes a reweave could have been done in the 13th century. Sue and I suggested around 1530 for the major reweave..","date":"2015-09-11","mins":"5:36 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209747","author":"jmarino240","post":"The authors cite 2 follow up papers of ours but not the original one presented in Orvieto, Italy in August 2000. A shortened version of that paper appears on shroud.com. The quality of the illustrations on the online version is not as good as in the original, which were published in the official printed Orvieto proceedings, of which i have a copy. I’m not sure if they’re still available. The Proceedings have excellent reproductions from our paper of a very high resolution picture of the C 14 corner taken from “Shroud Guide” by Gino Moretto, secretary of the Shroud Museum in Turin, and a radiograph of that area by Dr. Larry Schwalbe of STURP. So it is not true to say our theory was based on low resolution photographs..","date":"2015-09-06","mins":"12:47 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209762","author":"jmarino240","post":"Louis, I’m unaware about your reference to “‘Shroudie’ presence at the Hampshire convention.” Please elaborate. Thanks..","date":"2015-09-06","mins":"4:46 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209767","author":"jmarino240","post":"Okay, I was aware of that–just didn’t realize it was called that..","date":"2015-09-06","mins":"5:31 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209779","author":"jmarino240","post":"Here are some thoughts as I come in hot and sweaty after cutting my lawn. The Church made some mistakes in the 1988 dating. Cardinal Ratzinger approved STURP II’s 1984 plan, which would have given them 2 weeks for a multidisciplinary program. Politics were allowed to rule. Chagas was unduly influenced by Gove. I can’t remember if it was in the “La notte della Sindone” documentary or a written source, but someone characterized Chagas words to the effect as being “in Gove’s back pocket.” If the original plan had been implemented, we would not be in the situation we are now. The Church said in 1978 they were only interested in the truth. They have allowed 4 full fledged exhibitions since 1978. They are looking for ways to promote ecumenism. Since the Shroud is not even an article of faith, it’s a good opportunity to facilitate some bonds between different faiths. The 1978 scientists spent much of their own time and money studying the Shroud. How much more could 21st century scientists, who probably would also invest much of their own time and money, tell us about the cloth. I would like to see the Church do more to back up their 1978 claim that they’re only interested in the truth and do more than just exhibit it periodically..","date":"2015-09-06","mins":"7:08 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209787","author":"jmarino240","post":"My reference to Cardinal Ratzinger was in reference to the 1988 time frame so I don’t know how his 1978 assignment enters into this. I can understand some concern about the sect’s approach but I don’t think a lecture to such a group by Shroudies holds–or should hold–that much weight with Rome. If Rome was overly concerned about people using the Shroud as proof they are right in their Christian faith, it would be counter productive to have allowed all of the public expositions. I think it is irrelevant to ask what if the Shroud didn’t exist. It exists and we have to deal with it. I agree, though, that even a veritable authentic Shroud wouldn’t answer all the questions. But I still think the Church should try to right the wrongs from the 1988 testing. That could eliminate some of the existing problems..","date":"2015-09-06","mins":"9:06 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-216002","author":"jmarino240","post":"This will be my last comment on this. What’s insulting is that you keep insisting I was attempting to post a new anonymous pseudonym when I’m telling you I did not. Why on earth would I do that in a string when i had already posted under my own name? I may have gotten things confused but I’m not trying to pull the wool over anyone’s eyes. Your comment about me saying you should look to miraculist explanations is not accurate portrayal of the exchange. Regarding the lack of a question and answer session, I’ve told you several times it was simply a matter of having too many presentations to have time for Q & A. We made provisions for a post conference online forum for people to ask questions to the speakers, through which much more could be accomplished than a 10 or 15 minute question and answer session. You may tell things the way you see them, but that doesn’t make them right..","date":"2015-12-09","mins":"10:27 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-215999","author":"jmarino240","post":"I find your comments insulting. When I reposted the 2nd time, I actually was going to insert “Apologies if this gets posted twice, I tried posting it before and it didn’t see it.” Then I removed those 2 sentences, figuring that the first one wasn’t going to go through, even though I didn’t know why, I didn’t even realize I had filled out the boxes wrong on the 1st one. You’re incredible. I’ll say it again–I made no intentional effort to adopt a new pseudonym..","date":"2015-12-09","mins":"9:52 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-216010","author":"jmarino240","post":"Pam Moon has asked me to post the following: “‘Thank you Dan for presenting the work so beautifully and drawing people’s attention to it. And thank you to those who have read the paper. I realise I have omitted one important thank you, which is to Donna Campbell. When I showed her Barrie’s Arizona images she said that the Shroud fibres looked “too orange.” It was that thought that allowed me to understand some of the problems of colour in Figure 1 (page 3) after Joe sent the image. The question why the Shroud was dyed is an interesting one. But it is the speculative end of the paper: at present I am waiting for bloggers and Shroud experts to find the hard science that refutes the dye theory; if such science exists. Thanks again to all who have taken the trouble to read the paper.’.","date":"2015-12-09","mins":"10:55 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-215974","author":"jmarino240","post":"I should also point out that the late Ray Rogers had a preconception that I and my late wife were part of the “lunatic fringe.” He thought he was going to disprove our theory in 5 minutes. In fact, he was embarrassed that he ended up agreeing with us. He changed his mind because that’s where the data led him. That’s the scientific method at work..","date":"2015-12-09","mins":"6:30 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-216379","author":"jmarino240","post":"Matthew, I agree..","date":"2015-12-13","mins":"8:24 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-216377","author":"jmarino240","post":"Pam Moon has asked me to post the following: “”The paper has been revised and is resubmitted: http://shroudofturinexhibition.com/Shroud of Turin exhibition/Dye and radiocarbon date files/Dye%208th%20 Dec%20spectroscopy.pdf. I would like to thank blog contributors for their helpful advice. I apologise for writing that there had once been a patch – thank you Hugh. I had omitted one of the key aspects of Ray Rogers’ work – spectroscopy. That is now included in the review of his findings.”.","date":"2015-12-13","mins":"8:22 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-216417","author":"jmarino240","post":"Pam Moon has asked me to post this: “Hi Hugh Thank you for your questions. Regarding the Holland cloth the possibility you suggested that the Holland fibres came from under the Raes sample where there was no dye makes sense. It would be easy, as the Raes sample was cut, to add fibres of Holland cloth. Dissolving in water: the section (page 6) was included to answer your previous question. I found it in Rogers’ emails circulated by Barrie and Joe. The gum dissolves in water but once the ‘water evaporates, a colorless, easily seen film of gum is deposited around the fibre.’ Perhaps it is something to do with the tenacious, adhesive qualities of gums. Gum arabic is a major component of chewing gum. It dissolves in water but when the water is gone it sticks. So the need for con H Cl. I found the following quote from wikipedia which seems to confirm that: ‘Gum arabic is used as a binder for water colour because it dissolves easily in water. Pigment of any color is suspended within the acacia gum in varying amounts, resulting in watercolor paint. Water acts as a vehicle or a diluent to thin the watercolor paint and helps to transfer the paint to a surface such as paper. When all moisture evaporates, the acacia gum binds the pigment to the paper surface.’ Thanks also for the question about the difference between dye in linen and cotton. Rogers is right that cotton is much easier to dye than linen: ‘the flax fibre is harder than cotton, and dyestuffs do not penetrate so readily into it.’ (Handbook of Textile Fibres J Gordon Cook pg 9). So some of the linen fibres are clean and have resisted dye whilst the cotton is overloaded on the surface. The depth of the dye through the fibre is referred to by Rogers. In the image top 6 cotton fibres are shown coloured on the outside and nearly colourless on the inside; Raes 14 is similar (see bullet point 18). Writing this I realise for the first time that Rogers wrote the following in bullet point 18: ‘The outside of the (Raes 14) thread showed the deepest encrustation of any of the samples, except one end of Raes 1 (the spliced thread).’ So the colour change in Raes 1 is definitely dye. However, I will ask Teresinha about the questions when she has time to see me. I suggested gum tragacanth because she had never used gum arabic for fabric. She said she was happy to experiment with gum arabic and she will answer these questions much better than me.”.","date":"2015-12-13","mins":"3:13 pm","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-75982","author":"jmarino240","post":"Here is Bill Meacham’s reply to Hugh’s question (#9): There are hundreds or even thousands of examples, but usually these aberrant dates are attributed to something, either “contamination” or “old wood” or “an intrusive sample” etc. . Almost always there is no proof of such, the only evidence being that the date doesn’t agree with the context so it must be due to something. But the “reasons” proposed are merely guesswork to justify dismissing the aberrant date. I quote lots of examples in the pre Shroud C14date article: http://www.shroud.com/meacham.htm Here’s one quote from that article regarding Late Minoan 1 B chronology: “Betancourt et a1(1978:202) also discuss several dates that are too early or too late in the expected historical chronology, and conclude: ‘One or two dates should never be used by themselves to establish a site’s chronology. So many dates have proven to be useless because of contamination and other causes that one can only establish a radiocarbon chronology with some degree of confidence if several dates from the same site fall into a consistent pattern that agrees with the stratigraphic sequence.’ ” Regarding Hugh Farey’s comment, the archaeologist or geologist is more interested in getting results that agree with the other data, so they will collect and submit more samples. The lab folks run their procedure and invariably attribute the “aberrant” date to some issue in the field..","date":"2014-02-02","mins":"10:57 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-76004","author":"jmarino240","post":"“If the 1988 Shroud dating had come out 1st century, the skeptics would have objected to the methodology (and probably still would be objecting).” Colin wrote “But on what grounds?” The 1988 dating did not follow the 2 points mentioned in the article about the St. Francis articles: “First, sampling should always be done in agreement with and under the guidance of scholars and people involved in the historical or archaeological problem. In addition, whenever possible, collecting several samples from the object to be dated (as we did in the case of the two frocks) is definitely the right approach in order to reduce the possibilities of ambiguities.” Although a planning meeting in Turin was held in 1986 that could have, if it had been followed, fulfilled the 1st point. But when it came time to actually take the sample, all of that was thrown out the window. And because only one sample was taken, there are, in fact ambiguities. Skeptics could object on the same grounds that pro authenticity researchers have: the whole dating exercise was not rigorous science..","date":"2014-02-02","mins":"1:57 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-76306","author":"jmarino240","post":"I think at a minimum, many people feel that because the exercise was so chaotic (down to getting versions of the sizes and weights of the samples, which should be basic and straightforward), why should the results be trusted? If a physician is sued for malpractice and loses, he/she may have a good track record otherwise, but the focus is going to be on where he/she currently messed up. And the best track in the world doesn’t negate the consequences of the malpractice..","date":"2014-02-03","mins":"9:34 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-76279","author":"jmarino240","post":"For those who aren’t aware, Harry Gove had sent a letter to Sir David Wilson of the British Museum, describing the Shroud C 14 dating as “a somewhat shoddy enterprise.” This is quoted on page 95 of Meacham’s book “The Rape of the Shroud.” There Meacham describes his own letter to the British Museum, which he had copied to Gonella and STURP, along with a copy of the complete letter that Gove had sent to the British Museum..","date":"2014-02-03","mins":"7:35 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-76475","author":"jmarino240","post":"I would say that STURP’s “conclusions established in favour of the authenticity of the shroud” was more in the sense that they didn’t find any concrete evidence that it was a medieval forgery. Barrie Schwortz has said he expected to find evidence of brush strokes in the 1st 30 minutes they were there and Ray Rogers said that if you gave him 15 minutes he would have it (the Shroud’s possible authenticity) shot full of holes (hence his reputation as a “gun slinger”). If, in fact, the Shroud was a forgery, one would expect that STURP would have found something major to indicate that but they didn’t. And all of this once again points towards the idea that the C 14 dating, which is often wrong and dispensed with when trying to determine the date of an object, was wrong for some reason in the case of the Shroud..","date":"2014-02-04","mins":"9:56 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-76608","author":"jmarino240","post":"I confined my comment to STURP because that was the only full scale study. The 1969 1973 Turin Commission study (published in 1976) was very limited in scope. It had some who believed the Shroud was a forgery and others who believed it could have come from the 1st century. Flury Lemberg believes she’s found something that she believes at least comes close to placing the Shroud in a 1st century context: Flury Lemberg had originally been approached back in the early 1980s to try to date the Shroud by analyzing the structure of the cloth. She refused, “because,” she says, “it is impossible to get a serious result dating a textile by textile analysis alone.” In 1988, the keepers of the Shroud permitted radiocarbon dating of the relic — with unanticipated results. The tests indicated that the cloth had been made sometime between 1260 and 1390 A.D., and thus was a medieval forgery rather than the actual burial shroud of Christ. And yet, when Flury Lemberg finally did agree to head the restoration and conservation of the linen in the summer of 2002, the Shroud had a far different story to tell her. She first noticed that the entire cloth was crafted with a weave known as a three to one herringbone pattern. “This kind of weave was special in antiquity because it denoted an extraordinary quality,” she says. (Less fine linens of the first century would have had a one to one herringbone pattern). That same pattern is present on a 12th century illustration that depicts Christ’s funeral cloth, which, she says, is “extremely significant, because it shows that the painter was familiar with Christ’s Shroud and that he recognized the indubitably exceptional nature of the weave of the cloth.” Flury Lemberg also discovered a peculiar stitching pattern in the seam of one long side of the Shroud, where a three inch wide strip of the same original fabric was sewn onto a larger segment. The stitching pattern, which she says was the work of a professional, is surprisingly similar to the hem of a cloth found in the tombs of the Jewish fortress of Masada. The Masada cloth dates to between 40 B.C. And 73 A.D. The evidence, says Flury Lemberg, is clear: “The linen cloth of the Shroud of Turin does not display any weaving or sewing techniques which would speak against its origin as a high quality product of the textile workers of the first century.” This can be found at: http://www.pbs.org/wnet/secrets/previous seasons/case shroudchrist/interview.html.","date":"2014-02-04","mins":"9:24 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-75958","author":"jmarino240","post":"I have emailed archaeologist Bill Meacham for a specific example..","date":"2014-02-02","mins":"9:30 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-76783","author":"jmarino240","post":"The quotation no doubt comes from her book “Sindone 2002” (Editrice ODPF, Torino, 2003)..","date":"2014-02-05","mins":"1:50 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-47240","author":"jmarino240","post":"2 other details to my previous posting. The page # that the quote appears on in the Marinelli/Petrosillo book is 141. “CPS” stands for Collagemento Pro Sindone,” which used to be print and is now totally online at http://www.shroud.it..","date":"2013-10-12","mins":"12:31 pm","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","title":"Low Level Fraud? and more"},{"id":"comment-33373","author":"jmarino240","post":"There are still a lot of people who believe the 1988 tests prove the Shroud to be a fake. Perhaps most of those people won’t change their minds because they’re happy for the Shroud not to be real. But some people might change their minds if they’re informed of all the pertinent facts. If nothing else but for the sake of those people, I think it’s worth discussing why the dating was unreliable. Gian Marco Rinaldi has posted some information from the Italian documentary “Night of the Shroud.” Below is some information I put together that also includes data from that documentary: We all know that Michael Tite, the overseer from the British Museum for the 1988 dating, took over for Teddy Hall when he retired and after some anonymous businessmen donated 1 million pounds to Oxford for ostensibly having proven the Shroud a fake. If nothing else, it just looks shady. I’ve discovered some other relationships that also appear to be alarming along with many indications of political maneuvering. The Italian Documentary “The Night of the Shroud” made the following observations: *On January 4, 1984, Teddy Hall wrote a letter to a member of the Academy, Prof. Porter to encourage the Vatican to allow C 14 testing. A copy of the letter was sent to the President of the Academy, Carlos Chagas and also to the Vatican. But the copy to the Vatican only contained the 1st page, which criticized STURP, but without saying why. *Chagas later wrote Cardinal Ballestrero that everything was going fine but then turned around and wrote the Vatican saying there were problems with Ballestrero. *In 1985, Harry Gove produced at the Trondheim C 14 conference a suggested protocol for the Shroud C 14 dating. Chagas let only another Academy member, NASA scientist Victor Canuto, to review the protocol. *One person in the documentary said that Gove had Chagas in his pocket. *In July 1985, after STURP submitted their test proposal, Chagas again had Canuto review it. Chagas reported as his own Canuto’s report, which criticized STURP’s proposal to do a C 14 in conjunction with 25 other tests. *On July 13, 1985 Cardinal Ratzinger approved for a 2nd time STURP’s 26 test proposal. *On July 22, 1985, Harry Gove met with Victor Canuto. *During the Turin workshop meeting in September 1986, Chagas asked Canuto to come up with a summary of proposals. According to William Meacham, the text did not reflect what everyone had agreed upon. Luigi Gonella, Cardinal Ballestrero’s advisor, requested corrections be made but that wasn’t done. The text was not signed by anyone but was presented by Chagas as the agreement with Church authorities. *Cardinal Ballestrero wrote a letter to the Vatican Secretariat of State regarding the strange behavior of Chagas. *On May 21, 1987, the Secretariat of State said that there would be 3 labs, 3 samples and 1 sample site. *On October 10, 1987, Cardinal Ballestrero made an official announcement regarding the number of labs and samples. *Gove, upset at not being 1 of the 3 labs, contacted the Papal Nuncio, American Senators and the Ambassador to the Vatican, but to no avail. *The 3 chosen labs all wrote letters to the authorities that were the exact wording of the letter that Gove had sent to the Nuncio, Senators & Vatican Ambassador. The letter from the Zurich lab was postmarked in Rochester, where Gove lived. *The Secretariat of State informed Cardinal Ballestrero that only the C 14 test should be done. *Only Cardinal Ballestrero and Michael Tite put the samples in the containers for the labs. (Although there was something like 22 hours of videotape, the putting of the samples into the containers was the only part of the procedures that wasn’t filmed.) *About 2 weeks after the dating, Chagas was removed as President of the Academy. (I learned from another source that the announcement was made by a Msgr Renato Dardozzo, who will come up again shortly.) *The late Professor Jerome Le Jeune, a member of the Academy, publicly stated that further analysis of the C 14 results needed to be made. This next part does not come from the Italian documentary. I discovered that Msgr. Renato Dardozzo was the Chancellor of the Academy (i.e, Chagas’ right hand man). According to June 3, 2009 article in “The Guardian” (UK) (http://www.guardian.co.uk/commentisfree/belief/2009/jun/03/vatican central bank) Dardozzo smuggled out more than 4,000 documents pertaining to the scandal racked Vatican Bank. The article says, “It is interesting to note that Dardozzi’s motive for turning whistleblower was not unalloyed disapproval of the IOR’s unethical conduct. His decision to smuggle his secret archive out of the Vatican was motivated, at least in part, by anger at the Institute’s refusal to pay him a commission on the sale of a valuable real estate property near Florence. The unusual monsignor wanted to leave the money to his adoptive daughter, who health condition required expensive treatment.” So, we have a financially needy monsignor, who was the right hand man to Chagas, alleged to be in Harry Gove’s pocket. If there was a million dollar pound donation available for the Oxford lab for ostensibly having proven the Shroud to be a fake, were there additional “donations” to pass around to key authorities to make sure that certain actions would take place for the C 14 dating of the Shroud? While there’s no hard proof, it once again looks suspicious. I know an ex NASA scientist who knows Victor Canuto. The scientist asked Canuto for the story about the C 14 dating–but Canuto wouldn’t tell him a thing. With all of the above circumstances, the last thing that should be done is to blindly accept the results of the 1988 dating..","date":"2013-05-09","mins":"9:45 pm","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?"},{"id":"comment-126117","author":"jmarino240","post":"I agree with Hugh and Thibault that this is a very fine paper. I look forward to additional writings by O.K. On this as well as from Thibault. I think it’s certainly possible that the other corner was rewoven as well. Two good sources pertaining to the question are “Some Details About the STURP Quad Mosaic Images” at http://www.shroud.com/pdfs/quad.pdf and “Digital image processing techniques demonstrating the anomalous nature of the radiocarbon dating sample area of the Shroud of Turin” at http://www.academicjournals.org/article/article1380798975 Morgan.pdf. One of the topics to be discussed at the St. Louis Shroud conference is Future Testing of the Shroud by Prof. Bruno Barberis. If testing is allowed, the whole question of reweaving and possible locations definitely need to be looked at more closely..","date":"2014-06-01","mins":"2:13 pm","url":"https://shroudstory.com/2014/05/31/were-both-ventral-and-dorsal-corners-of-the-shroud-rewoven/","cat":"carbon_14_dating","title":"Were both ventral and dorsal corners of the Shroud rewoven?"}]
