[{"id":"comment-216393","author":"jmarino240","post":"Kenneth Johnson also says, “You might better ask how red ochre and vermillion particles get on a real burial cloth.” Johnson is apparently unaware that many artists were allowed to touch their painted copies to the Shroud to sanctify them. My guess is that Johnson has done very little reading about the Shroud..","date":"2015-12-13","mins":"9:26 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","title":"Watertight Evidence"},{"id":"comment-216387","author":"jmarino240","post":"Kenneth Johnson has picked up another skeptic’s annoying habit of putting certain words in quotes when they shouldn’t be, like “The ‘scientists’ who refuted his work had no qualifications to perform the analyses on which they claimed to rely” and “One ‘scientist’ seriously theorized that holy radiation from the resurrection might have transferred the image of Jesus to the cloth.” STURP had chemists, blood experts and experts in many other disciplines, including from some of the most prestigious scientific institutions in the U.S. It’s highly improbable that Mc Crone’s judgments would be more accurate than the combined efforts of about 40 other highly scientists (without quotes). If Mc Crone is extrapolated to the story of the blind man and the elephant, he would say that his perspective is the only one worth considering..","date":"2015-12-13","mins":"9:05 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","title":"Watertight Evidence"},{"id":"comment-216421","author":"jmarino240","post":"I am rereading David Sox’s 1988 book “The Shroud Unmasked” (which incidentally was published and ready to go when the official announcement was made, despite the fact that the labs were supposed to have maintained confidentiality). In his introduction he says, “There were times when I thought I would never live to see the day the Turin Shroud faced its obvious test. The road to carbon dating has been long, contentious and convoluted. There are those who will not appreciate mine and others’ effort to have this test. That’s their problem. When you open Pandora’s box, you have to be prepared for whatever comes out. I have always wondered why many so fascinated with the Shroud mystery were afraid to see the end of the story.” Sox is right about the dating having been contentious and convoluted, and it’s for that very reason that many people feel that the 1988 results are not the end of the story..","date":"2015-12-13","mins":"4:36 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","title":"Watertight Evidence"},{"id":"comment-216442","author":"jmarino240","post":"Dan’s blog from June 8, 2012 had the following: “New York Film Academy graduate Francesca Saracino’s film, The Night of the Shroud, recently won Best Documentary, Best Director, and Best Visual Effects at the Los Angeles Movie Awards. The controversial documentary investigates the authenticity of the Shroud of Turin, a centuries old linen cloth that bears the image of a crucified man, believed by some to be the cloth in which Jesus was buried. The investigation is hosted by Italian actress Rosalinda Celentano, known for her role as Satan in Mel Gibson’s The Passion of the Christ. It uncovers previously unseen research papers, audio files, videos, and correspondence from researchers, cardinals, and Pope Benedict XVI..","date":"2015-12-13","mins":"8:15 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","title":"Watertight Evidence"},{"id":"comment-216429","author":"jmarino240","post":"Regarding the C 14 controversy, I recommend the documentary “Night of the Shroud,” which includes interesting revelations from Gonella’s correspondence files. It’s available at amazon.com for $13.38 but it won’t play on most DV Ds sold in the U.S. I think it will play on most computers. The link is: http://www.amazon.com/Shroud Sindone NON USA FORMAT Import/dp/B00 B67 CFMC. The description is: SYNOPSIS: THE NEW INVESTIGATION documentary THE NIGHT OF THE SHROUD produced by RAI and directed by Francesca Saracino, seeks to clarify, with new and unpublished documents, the mountain of doubt about the dating of the Shroud by the carbon 14. It was already known to the carelessness with which they were performed in the late 80s, but radiocarbon testing of this investigation brings to light, with the help of unpublished papers and interesting interviews in world premiere a voluntary controlled, almost fraudulent, in errors and approximations, To enrich the film, the presence of Rosalinda Celentano ( The Passion of the Christ) who read questions in search of answers. Lost among the columns of a medieval church, the actress stimulates the curiosity of the viewer less experienced, refresh his memory on one of the most fascinating topics of Christianity..","date":"2015-12-13","mins":"6:19 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","title":"Watertight Evidence"},{"id":"comment-195019","author":"jmarino240","post":"I agree that reverse engineering is a scientific methodology. But Colin does not seem to want to venture outside of the Shroud as medieval road. If his one way road is wrong, he is at a dead end..","date":"2015-03-31","mins":"9:29 pm","url":"https://shroudstory.com/2015/03/31/whats-to-like-over-on-colins-blog-right-now/","cat":"image_theory","title":"What’s to like over on Colin’s blog right now?"},{"id":"comment-195072","author":"jmarino240","post":"This is a blog about the Shroud. If you want to delve into those other scientific questions, I’m sure you can find other blogs to express your opinions. I never said that general opinion decides a scientific issue. I was merely saying that several factors indicate that there is a large number of people who don’t buy that the Shroud is a fake. Experiments and papers should and will continue to address various aspects of the Shroud. And there will continue to be disagreement about whether the Shroud is authentic or not..","date":"2015-04-01","mins":"6:15 am","url":"https://shroudstory.com/2015/03/31/whats-to-like-over-on-colins-blog-right-now/","cat":"image_theory","title":"What’s to like over on Colin’s blog right now?"},{"id":"comment-174589","author":"jmarino240","post":"Giulio had sent power point slides but the flash drive that I put it on failed..","date":"2014-12-04","mins":"5:34 am","url":"https://shroudstory.com/2014/12/04/paper-chase-the-second-face-defended/","cat":"paper_chase","title":"Paper Chase:  The Second Face Defended"}]
