[{"id":"comment-76423","author":"jmarino240","post":"What documentation do you have that Rogers “was clearly piqued when the radiochemical dating was announced?” I’ve always heard that he completely accepted the results. He didn’t get back into the Shroud scene until 2000, 12 years after the dating..","date":"2014-02-04","mins":"7:02 am","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","title":"Colin Berry on Rogers’ Thermochimica Acta Paper"},{"id":"comment-76593","author":"jmarino240","post":"You changed from “was clearly piqued when the radiochemical dating was announced” to “…I do think that Roger’s reactions on hearing the radiocarbon date would be one of pique.” You went from stating a fact to stating a speculation. And Rogers was biased? Nothing you quoted proves your initial statement of fact nor does it prove your subsequent speculation. He’s just stating a possible conclusion based on the evidence. You used the phrase “strikes me as evidence of systematic bias in his thinking about the Shroud’ s age,” which again is just speculation on your part. You never even met the man. You’re making assumptions about him with only your beliefs to back them up. Rogers was a man of integrity. When Sue and I made our hypothesis about the invisible reweave, Rogers considered us part of the “lunatic fringe.” How hard do you think it was for him to come out publicly to say he believed we were right? Very few scientists would have done that. It’s too bad he’s still not here to defend himself about the statements being made about him.. At this point, I think I’ve spent quite enough time on this exchange..","date":"2014-02-04","mins":"8:00 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","title":"Colin Berry on Rogers’ Thermochimica Acta Paper"},{"id":"comment-148386","author":"jmarino240","post":"Just noticed they did have hot links to the press release and also the conference site..","date":"2014-09-03","mins":"9:53 pm","url":"https://shroudstory.com/2014/09/03/you-might-think-st-louis-was-all-about-gary-habermas/","cat":"press_coverage","title":"You might think St. Louis was all about Gary Habermas"},{"id":"comment-191243","author":"jmarino240","post":"Stop me if you’ve heard this one–wait–it’s the Internet so you can’t stop me. I’ve told this before but it’s worth telling again, if nothing else for anyone recently new to the blog. For the 2005 conference in Dallas, Barrie was interviewed by a local reporter. Mc Crone’s name came up in the conversation. Barrie made it clear that Mc Crone was deceased (about 3 years at that point), but when the story came out the reporter mentioned him with the phrase, “…Mc Crone, who did not attend the conference…” I think it would have made some headlines if he had..","date":"2015-02-16","mins":"10:27 pm","url":"https://shroudstory.com/2015/02/16/walter-mccrone-art-experts-should-not-weigh-in/","cat":"uncategorized","title":"Walter McCrone:  Art Experts Should Not Weigh In"},{"id":"comment-191268","author":"jmarino240","post":"Giorgio, I knew you knew. Did you really sell copies of Mc Crone’s books at the conference? Can you tell us how many you sold?.","date":"2015-02-17","mins":"8:28 am","url":"https://shroudstory.com/2015/02/16/walter-mccrone-art-experts-should-not-weigh-in/","cat":"uncategorized","title":"Walter McCrone:  Art Experts Should Not Weigh In"},{"id":"comment-191278","author":"jmarino240","post":"I might as well retell my other Mc Crone story that is memorable. He gave a presentation at the 1986 Elizabethtown, PA conference. In the question and answer session, I asked him how his putative forger was able to incorporate details that weren’t even discovered for several more hundred years. His answer: “I’m not going to answer that. He just did it.” He just expected people to take his opinion on faith alone..","date":"2015-02-17","mins":"9:44 am","url":"https://shroudstory.com/2015/02/16/walter-mccrone-art-experts-should-not-weigh-in/","cat":"uncategorized","title":"Walter McCrone:  Art Experts Should Not Weigh In"}]
