[{"id":"comment-5110","author":"a_grotta","post":"Can you write that in English? I’d like to read what you wrote too..","date":"2011-11-30","mins":"4:59 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5106","author":"a_grotta","post":"They look emerald green to me. I don’t see any blue green, just green. I am SO enjoying reading all the replies to this article!!!.","date":"2011-11-30","mins":"3:57 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5188","author":"a_grotta","post":"That’s a lie..","date":"2011-12-03","mins":"2:29 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5191","author":"a_grotta","post":"Louie, “dead grandma the scarry ones are of getting sucked down to hell!”, my step grandfather died last year. I was blessed with the chance to see him while he was in the hospital before he died (we don’t live in their state). He wasn’t saved… His son, my guardian always would tell him that he needed Jesus (not sure what he would tell him or how). The grandfather always refused saying that he was learned man and relied on himself, that he always has. I never witnessed to him myself until that day, in the hospital. It was a rare visit when my husband, myself, and our son were all able to make it “home” for a visit. Grandfather was in the hospital again. My guardian finally told me that we could go take a very quick visit to see grandfather in the hospital. I was told that he was having nightmares and was afraid to sleep, that monsters were in his dreams. He was on strong antibiotics to fight sepsis because his body had started shutting down. When I went in, I felt sick to my stomach because I knew what his dreams were. He was very jovial, like his old self, even joked a little. But that was little consolation. I found a good spot to tell him that he could ask Jesus to take away the monsters and He would. This was what I felt led to say to him, the only thing I could say to witness to him of Jesus love. He gave me the reply above, I knew that he would say this, as he always seemed to say so in various ways. There’s not much you can say to witness to a man like that. I fully believe that if grandad had asked Jesus to take away the monsters, He also would have healed him. I fully believed even at that moment, that was Jesus, offering him one last chance. I left the room after giving him a hug, my love, and final farewell, hiding and choking back tears. As soon as I got out of the room, it all came out and I broke down in great sorrow and sobbing. I’m crying right now as I always do when I think about him, and where he is, and what could have been. This sorrow is worse than if he had died and gone to heaven. I will forever rejoice from now on when a saved loved one dies, because I know this sorrow. It cannot compare to a death of a brother and sister in Messiah, it just cannot. The death of brothers and sisters in Messiah are time of rejoicing, we will see them Again..","date":"2011-12-03","mins":"3:25 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]
