[{"title":"Full Shroud of Turin Episode of Finding Jesus Available on CNN Website","post":"This “Episode” went way off the tracks. It seems to be more Mel Gibson than Gospel.\nSome quick examples. As the the Gibson movie and virtually  all medieval art, Christ is shown carrying a complete cross. In reality, crucifixion victims carried “only” the cross-bar.\nBut insidious was the presentation of the carbon dating without any explanation of the reason why it has been widely discarded as bad science – the anomalous composition of the place from which the carbon samples were cut. \nThen  it presented without any serious critique the wildly off-the-track claims of Nicholas Allen that it was a medieval forgery created by a camera obscura. For it to have worked by his process would have required days of exposure in bright sun light. – of a rotting corpse. Yet no evidence of corruption appears on the Shroud. Not to mention the little problem of when was the blood added.\nStill the program spend precious minutes of air time reenacting medieval forgers working their camera obscura. Also, I believe the Allen “shroud” eventually had its image fade away. Photographically speaking to “fix” the image captured by an emulsion would have required  different chemicals. But neither emulsion nor fixers residue appear on the Shroud. \nThen again we have  crown of thorns that was a simple circlet of thorns instead of the cap revealed by the Shroud. More Mel Gibson although his circlet at least had two tiers.\nThis not a complete list. The presentation’s complete ignorance of Benford-Marino-Rogers and even Giulio Fanti was an tragic omission. \nI hope to blog on this at some point. Frankly, I have some legal papers to do today and maybe I should cool down. But to see all the resources and publicity wasted on this deeply flawed presentation really is a tragedy.\nI am reminded of Mark Twain. A falsehood circles the earth while truth is putting on its shoes.\n\n","date":"March 2, 2015 at 7:20 am","url":"https://shroudstory.com/2015/03/02/full-shroud-of-turin-episode-of-finding-jesus-available-on-cnn-website/","cat":"television","id":"comment-192174","author":"John Klotz","site":"shroudstory"},{"title":"Full Shroud of Turin Episode of Finding Jesus Available on CNN Website","post":"As the the Gibson movie and virtually all medieval art, Christ is shown carrying a complete cross. In reality, crucifixion victims carried “only” the cross-bar.\nThat’s not true, John. In fact, analysis of both the Shroud and the Tunic of Argenteuil show that Jesus most likley carried the whole cross. The sole patibulum theory has been in fact discredited as untenable\nSee:\nhttp://www.acheiropoietos.info/proceedings/GloriWeb.pdf\nMore later.\n\n","date":"March 2, 2015 at 7:34 am","url":"https://shroudstory.com/2015/03/02/full-shroud-of-turin-episode-of-finding-jesus-available-on-cnn-website/","cat":"television","id":"comment-192176","author":"O.K.","site":"shroudstory"},{"title":"Full Shroud of Turin Episode of Finding Jesus Available on CNN Website","post":"OK: “That’s not true, John. … ”  To make such an assertion requires evidence, which is not provided by the paper linked by O.K.  The paper addresses an issue raised by Ricci in the late 1950s that the cross-bar was carried on the shoulder blades (scapulae) because of blood-stains there, whereas that seems unlikely.  Barbet addressed the matter, and provides adequate evidence that it was indeed only the patibulum that was carried, but on the nape of the neck.  It was common in some areas for stipes to line main roads in Rome for mass executions, and also in the Colosseum.  Barbet: “Doctor at Calvary”, Ch 2, ‘Crucifixion and Archaeology’,  B – Instruments of Crucifixion, and also elsewhere.  OK’s frequent dogmatic contradictions of correspondents ought not be made on such slender evidence that he customarily offers.\n\n","date":"March 2, 2015 at 2:30 pm","url":"https://shroudstory.com/2015/03/02/full-shroud-of-turin-episode-of-finding-jesus-available-on-cnn-website/","cat":"television","id":"comment-192219","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Full Shroud of Turin Episode of Finding Jesus Available on CNN Website","post":"Dave, I will show you that Barbet was wrong on this matter -Jesus carried the whole cross, not just the patibulum (this is long-standing myth of sindonology). But later on, following days or rather weeks.\n\n","date":"March 2, 2015 at 3:50 pm","url":"https://shroudstory.com/2015/03/02/full-shroud-of-turin-episode-of-finding-jesus-available-on-cnn-website/","cat":"television","id":"comment-192227","author":"O.K.","site":"shroudstory"},{"title":"Full Shroud of Turin Episode of Finding Jesus Available on CNN Website","post":"And I say you cannot prove it, regardless!  You are too dogmatic, too narrowly focused, on matters for which there other possibilities that you close your eyes to.  You were not there!\n\n","date":"March 2, 2015 at 6:10 pm","url":"https://shroudstory.com/2015/03/02/full-shroud-of-turin-episode-of-finding-jesus-available-on-cnn-website/","cat":"television","id":"comment-192236","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Full Shroud of Turin Episode of Finding Jesus Available on CNN Website","post":"Me dogmatic? No, I take all possibilities (and impossibilities) into account.I am just uncompromising regards to the wrong things. And the hypothesis that Man of the Shroud carried just the patibulum is almost certainly wrong -when I have some time I will show why.\n\n","date":"March 2, 2015 at 6:29 pm","url":"https://shroudstory.com/2015/03/02/full-shroud-of-turin-episode-of-finding-jesus-available-on-cnn-website/","cat":"television","id":"comment-192241","author":"O.K.","site":"shroudstory"},{"title":"Full Shroud of Turin Episode of Finding Jesus Available on CNN Website","post":"Sadly this was just another media event to sensationalize a story, by omitting the scientific peer reviewed facts, in order to have a perpetual money making show.\nL.J.\n\n","date":"March 2, 2015 at 2:49 pm","url":"https://shroudstory.com/2015/03/02/full-shroud-of-turin-episode-of-finding-jesus-available-on-cnn-website/","cat":"television","id":"comment-192221","author":"L.J. Williams","site":"shroudstory"},{"title":"Full Shroud of Turin Episode of Finding Jesus Available on CNN Website","post":"http://cathnews.com/cathnews/20622-francis-calls-money-the-devil-s-dung\n\n","date":"March 2, 2015 at 7:53 pm","url":"https://shroudstory.com/2015/03/02/full-shroud-of-turin-episode-of-finding-jesus-available-on-cnn-website/","cat":"television","id":"comment-192252","author":"Louis","site":"shroudstory"},{"title":"Full Shroud of Turin Episode of Finding Jesus Available on CNN Website","post":"It is possible that Jesus carried the complete cross with the patibulum tied to his shoulders.\n\n","date":"March 2, 2015 at 7:05 pm","url":"https://shroudstory.com/2015/03/02/full-shroud-of-turin-episode-of-finding-jesus-available-on-cnn-website/","cat":"television","id":"comment-192244","author":"Louis","site":"shroudstory"},{"title":"Full Shroud of Turin Episode of Finding Jesus Available on CNN Website","post":"Fact check would have found out that Mary Magdalene was first to tomb to discover body was missing not Peter and John as stated in your tv show.\nSee Matthew 28:1 or Mark 16:1 or Luke 24:10 or John 20:1.\nDisappointing error for CNN not to discover.\n\n","date":"March 2, 2015 at 9:02 pm","url":"https://shroudstory.com/2015/03/02/full-shroud-of-turin-episode-of-finding-jesus-available-on-cnn-website/","cat":"television","id":"comment-192256","author":"Steve Magsig","site":"shroudstory"},{"title":"Full Shroud of Turin Episode of Finding Jesus Available on CNN Website","post":"I have given up on CNN since the Egyptian revolution because of the double standards and their selective reporting as I compared them to other sources. This program was nothing different, selective information & misleading conclusion.\n\n","date":"March 3, 2015 at 6:46 pm","url":"https://shroudstory.com/2015/03/02/full-shroud-of-turin-episode-of-finding-jesus-available-on-cnn-website/","cat":"television","id":"comment-192327","author":"MikeM","site":"shroudstory"}]
