[{"title":"Imagine taking Easter out and there just isn’t a story","post":"Hi, I am a Catholic Christian, this helps me to understand a portion of life after death for as it pertains to the human being but it is still full of mystery to me.  Many facets of the  topic are still out there in the ether.\n\n","date":"July 19, 2013 at 3:47 pm","url":"https://shroudstory.com/2013/07/19/imagine-taking-easter-out-and-there-just-isnt-a-story/","cat":"video","id":"comment-39285","author":"Emmett McMahon","site":"shroudstory"},{"title":"Imagine taking Easter out and there just isn’t a story","post":"I love listening to N.T. Wright and his perspectives. His thoughts of life, after life after death and the 1st century Jewish perspectives on life after death, is one very strong point to the authenticity and truthfulness of the Gospel writers and to the realism of the resurrection, as no one in that time actually ever contemplated a resurrection of the kind….awesome stuff :-)\nR\n\n","date":"July 21, 2013 at 3:00 am","url":"https://shroudstory.com/2013/07/19/imagine-taking-easter-out-and-there-just-isnt-a-story/","cat":"video","id":"comment-39370","author":"Ron","site":"shroudstory"},{"title":"Imagine taking Easter out and there just isn’t a story","post":"And most importantly Ron, no one in that time ever imagine that the Jewish Messiah would end up on the cross in desgrace between two thieves!!!  No human being from that period of time would have dare to proclaim him as the Messiah, the Son of God, if they were not truly convinced themselves that he was resurrected!!!  Also, no one of that time, especially in the Jewish world, would have ever imagine that God (the so-called Allmighty) was so merciful and loving than the Father presented by Jesus!  All this speak truth to me very loud…\n\n","date":"July 21, 2013 at 7:42 pm","url":"https://shroudstory.com/2013/07/19/imagine-taking-easter-out-and-there-just-isnt-a-story/","cat":"video","id":"comment-39443","author":"Yannick Clément","site":"shroudstory"},{"title":"Imagine taking Easter out and there just isn’t a story","post":"Here’s the way I understand the apparitions of Jesus after his resurrection :  these were only material SIGNS that he gave to his disciples so that they could believe that he was truly and already (not just “at the end of times”, as many Jews believed in that time) living a new eternal life (with a spiritual body); a new life that we all will experience one day (when we’ll die).  And, while doing so, he managed to preserved their liberty of faith by taking different appearances (at least 2 if not more), so that they never recognized him at first sight.  To me, these different appearances had an important secondary meaning:  they ment that now, we can find the Resurrected Christ in every one of our brothers and sisters in humanity no matter who he is and no matter his faith or non-faith.\nSo, along with the entrance of the tomb that was open, and the tomb and the shroud that were empty, I see the material apparitions of the resurrected Jesus as some more material signs of his spiritual resurrection; a resurrection that, of course, occured in eternity at the very moment he died on the cross on Good Friday and not just on Easter morning.  Unfortunately, because Jesus followers were all Jews and that the Jews of that time had very sadly (and very wrongly) a very materialistic view of the life after death, they took these few material apparitions of Jesus as granted and believed that life after death would be just like our present life on Earth but without pain, suffering or death…  They took Jesus saying before his death concerning the “new wine” he would drink with them in his Father’s Kingdom at the first level without understanding that it was a metaphor used by him to describe a new way to live in a communion of love with each other…  \nThe fact that our new body will never suffer again and never die again is true of course, but since we will experience this new life in eternity and not in our present space-time universe, it’s ludicrous to think that our own resurrection (I prefer by far to talk of our future life with a spiritual body because the word “resurrection” is way too much ambiguous because it can be easily understood as just a “re-animation” of the dead body, which is false) will look pretty much like our present life on Earth (or like the apparations of the resurrected Jesus eating fish with his disciples).  Sorry but in Heaven, we won’t have to eat no more!  We won’t have to drink no more!  We won’t have to sleep no more!  We won’t have any sexual desires no more!  These things are only part for our present material existence and will have absolutely no sense in eternity.  Heaven will be the liberation of all these physical needs that can be seen as chains for us…  \nLook…  Heaven is not even a “place” because it is not found in our space-time universe.  How can we believe that we will only get our present material body which will be somewhat “refurbished” by God?  It’s completely ludicrous, but sadly, many Christians see life after death exactly like this…  I think those people should read again what Jesus said one day to the Sadducees :  “They can no longer die (i.e. those who are in Heaven), for they are like angels.”  Now, as I know, an angel has a spiritual body and not a renewed material body!  How can we think the body we will get in Heaven will be somewhat close to the material body we have now?  Again, this is ludicrous and a very materialistic way to see eternity!\nIn conclusion, even if the material body of Jesus had go on and rot in the tomb like any other corpse, and if the tomb had remained closed with the rotting body inside of it, Jesus would have been already resurrected anyway!  But the thing is:  no one of his disciples would have been able to believe this!!!  They would have said something like this:  Ho… Jesus was a very good man and teacher but now, he’s in the Sheol with all the other dead men, waiting with them for the general resurrection of the deads at the end of time…  In other words, without these material signs (that include all the physical appations of the resurrected Christ), they would never have been able to believe that Jesus was already living a new eternal life and, consequently, that every human being is also living a new eternal life after he die.  Jesus resurrection must be understood as the physical sign “par excellence” of our own resurrection (again, I prefer to say: of our future life with a spiritual body in eternity).\nTruly, life after death is misunderstood by a lot of people, even by many Church leaders, for the simple reason that they took the resurrection accounts at the first level without trying to understand the profound and spiritual meaning of it…\n\n","date":"July 21, 2013 at 9:03 pm","url":"https://shroudstory.com/2013/07/19/imagine-taking-easter-out-and-there-just-isnt-a-story/","cat":"video","id":"comment-39452","author":"Yannick Clément","site":"shroudstory"},{"title":"Imagine taking Easter out and there just isn’t a story","post":"Well, we’re fortunate then to have you around to set the record straight. :)\n\n","date":"July 22, 2013 at 6:01 am","url":"https://shroudstory.com/2013/07/19/imagine-taking-easter-out-and-there-just-isnt-a-story/","cat":"video","id":"comment-39503","author":"David Goulet","site":"shroudstory"},{"title":"Imagine taking Easter out and there just isn’t a story","post":"I just share my thoughts that came from a long reflection on the subject in the light of my own experience of God…  Anyone is free to believe otherwise.\n\n","date":"July 22, 2013 at 8:29 am","url":"https://shroudstory.com/2013/07/19/imagine-taking-easter-out-and-there-just-isnt-a-story/","cat":"video","id":"comment-39515","author":"Yannick Clément","site":"shroudstory"},{"title":"Imagine taking Easter out and there just isn’t a story","post":"I was reflecting on Yannick’s thoughts about free will and signs. There are only two major characters in the Gospels who, on first glance, appear to have been given a proof rather than a sign: Paul and Thomas. Scholars have been debating whether Paul’s Damascus conversion is a literary device to express an inner transformation. In other words, was Paul already leaning in his heart and mind to accepting the Christ message and then it climaxed with a moment of revelation – after which he is given a sign of confirmation.\nThomas is less easy to reconcile. He alone demands a proof (not merely a sign) of Jesus resurrection. And he is given it. I’ve heard different interpretations of Thomas’ story. Some suppose that Thomas was not in cynical disbelief when he asked for his proof, rather he was ready beyond measure to believe, but needed to see it with his own eyes. He is granted this proof and then he is the first to proclaim Jesus’ divinity.\n\n","date":"July 22, 2013 at 11:48 am","url":"https://shroudstory.com/2013/07/19/imagine-taking-easter-out-and-there-just-isnt-a-story/","cat":"video","id":"comment-39525","author":"David Goulet","site":"shroudstory"},{"title":"Imagine taking Easter out and there just isn’t a story","post":"Here’s my idea versus Paul and Thomas’ experience of the Resurrected Jesus.  It’s only my own thoughts on the subject…\nFor Paul:  I truly believe Paul’s conversion to Christianism started at the exact moment he saw Stephen’s martyrdom.  I think the way Stephen died while asking God to forgive the sin of his executioners was the starting point of everything for Paul.  Then, his conversion on the road to Damascus is, for me, only the full achievement of the conversion that had started when he saw Stephen’s martyrdom some time before in Jerusalem.  And you know what I think?  I think this event on the road to Damascus was much more an interior and spiritual event in the life of Paul than a physical encounter with the Resurrected Christ, in the same way the disciples experimented it in Jerusalem on Easter morning and in the following days…  In the end, I see the different narrative stories of his conversion on the road to Damascus that we find in the Bible as stories written in a pure Middle Eastern style with a full package of imageries that are intend to explain with our poor words what was at the heart of Paul’s interior and spiritual experience of conversion (note that such interior expériences still happened every day or so in the world).  Here, it’s important for me to categorically state this: I have absolutely no doubt Paul’s interior experience of conversion really happened when he was on his way to persecute the Christians who were living in Damascus. In conclusion, I would say that, in my mind, we cannot at all see Paul’s conversion as being an event that was based on a sure proof of the reality of Jesus’ resurrection (at least, not in the scientific sense we usually use the word “proof”).\nFor Thomas:  If you read again very carefully the accounts of the encounters between the Resurrected Christ and his disciples that we found in John’s Gospel, you can conclude, like me, that Jesus’ physical appearance was not at all the same as it was before his death and you can also conclude that, at least for one occasion (during his last apparition on the shore of the Sea of Galilee), Jesus took another human form that was different than the previous one he had on Easter morning (and also probably 8 days later when he appeared to Thomas).  Then, I think it’s fair to conclude that, during all his apparitions to his disciples (including the apparition to Thomas), Jesus had a different body appearance than he had before his death but was still showing his crucifixion wounds in his hands and in his side (and probably also in his feet).  Important note about that:  when you read again the 2 accounts in John’s Gospel in which Jesus appeared to his disciples in the Upper Room in Jerusalem, it is pretty evident to understand that it is only after the disciples saw his crucifixion wounds that they came to the conclusion that this person who had a body they never saw before was really Jesus alive again!!!  That’s why I think it’s totally untrue to assume that Thomas received a full proof (in the scientific sense) of Jesus’ Resurrection when he meet him for the first time!  No…  For me, based on my understanding of the apparition accounts (especially the ones we found in John’s Gospel), I still think the disciples, including Thomas, had to make a leap of faith in order to recognize the Resurrected Jesus in this stranger they had in front of them…  Because of this, I still think that no one in all the Bible had such an experience of the Resurrected Christ that it can be call “a proof” (in the scientific sense of course).  I still think that all these physical apparitions of the Resurrected Christ were “only” material signs given by God to Jesus’ disciples, so that they could end up believing that, yes, Jesus was truly resurrected in the way he was describing it prior to his death (after 3 days, I will rise again) and not the way these Jews understood his words, i.e. as a pictorial way for Jesus to talk about his Resurrection at the end of times, along all the other “righteous” (which is the way the Jews of Jesus’ time were seeing the Resurrection of the deads).  In other words, the physical apparitions of the Resurrected Christ (including the fact that his unusual body was showing all his crucifixion wounds) was the way God choose to help Jesus’ disciples to believe in a spiritual reality (Jesus’ Resurrection and his “ascension” in Heaven) that was already real at the moment he died on the cross on Good Friday, while preserving the liberty of these disciples to believe or not in this spiritual reality (note that in Matthew’s Gospel, there is a very good clue that this is true when he reported that some disciples were still not sure if it was truly Jesus or not after they saw him in Galilee).  I’m truly convinced that if Jesus had not appeared physically to his disciples (with a different body appearance that was still showing his crucifixion wounds), each of them would have been able to believe that he was already resurrected and that he was now in Heaven, watching over us.  Each one of them would have ended up believing that he would only resurrect with them at the end of times and Christianism would never had born!\nI know this is not in total sync with the official teaching of the Church but I don’t care one bit!  You know why?  Because I know for a fact that this official teaching is not always infallible!!!  You want a proof of this (in the scientific sense !!!)?  Ok, here it is:  In the following years and decades following Jesus death and Resurrection, the apostles themselves were teaching that the end of the world was coming fast and the first Christians were truly believing that they would saw it coming during their lifetime!  We now know that it was a terrible mistake on their part (which probably came from a bad understanding of Jesus’ teaching about that, but which, at the same time, paid off well because I’m sure it persuade a lot of fearful people to become Christians).  So, let me ask you:  If it was possible for the apostles of Jesus to do some mistakes in their teaching, don’t you think it is also possible for today’s Church to also make some mistakes in it’s teaching and to not always understand correctly every aspects surrounding the Resurrection of Christ???  I truly think so!!!\n\n","date":"July 27, 2013 at 6:08 pm","url":"https://shroudstory.com/2013/07/19/imagine-taking-easter-out-and-there-just-isnt-a-story/","cat":"video","id":"comment-39875","author":"Yannick Clément","site":"shroudstory"},{"title":"Imagine taking Easter out and there just isn’t a story","post":"I tend to think very similar to you,based on what I’ve read from New Testament scholars and from my own lived experience. I think it is very telling that Jesus, himself, never wrote anything down — though he knew how to write for he is described as writing in the sand (a temporary medium) in the Gospels. Once you write something down on paper or stone, especially if you are a spiritual leader, it has a tendency to become dogma.\nThe Shroud, bringing us back to this blog, reminds me of Jesus writing in the sand. Or, as you have nicely described, appearing to his followers in a form that never quite dispels the question mark.\n\n","date":"July 27, 2013 at 11:32 pm","url":"https://shroudstory.com/2013/07/19/imagine-taking-easter-out-and-there-just-isnt-a-story/","cat":"video","id":"comment-39897","author":"David Goulet","site":"shroudstory"},{"title":"Imagine taking Easter out and there just isn’t a story","post":"All this to respect the freedom to believe in himself or not.  The fact that he appeared to his disciples in another human form than the own human form he had before his death and the fact that he never wrote down anything about is “doctrine” but let his disciples free to understand his words the way they could are two very good clues to believe that Jesus was truly God incarnate in our humanity and not just the Messiah the Jews were waiting for, and that he was more than what many Christians still believe today, i.e. a human being like you and me who would have been “deified” by God at the time of his baptism or at the moment of his Resurrection!  Note that in many books of the New Testament (most of St Paul and St Luke’s writtings in particular), the Christian authors seemed to have believed just that themselves…  This show one thing:  God always respect the freedom of every human being to conceive him as he wish!  That’s a great sign of his infinite love for each one of us.\n\n","date":"July 28, 2013 at 5:02 pm","url":"https://shroudstory.com/2013/07/19/imagine-taking-easter-out-and-there-just-isnt-a-story/","cat":"video","id":"comment-39976","author":"Yannick Clément","site":"shroudstory"}]
