[{"title":"Here We Go Again","post":"Maybe a Step-brother on the side of his Earth Step-father Joseph. The Mother of Jesus remained a virgin for her life.\n\n","date":"March 12, 2015 at 5:45 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193191","author":"Emmett McMahon","site":"shroudstory"},{"title":"Here We Go Again","post":"Scholars like Robert Eiseman would disagree with you on that. Also Josephus wrote that James was the brother of Jesus.\n\n","date":"March 12, 2015 at 6:32 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193196","author":"John Green","site":"shroudstory"},{"title":"Here We Go Again","post":"In Greek, the word adelphos can have a full range of meaning from blood brother to a member of the same tribe.  Please.\n\n","date":"March 12, 2015 at 7:10 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193200","author":"Andy","site":"shroudstory"},{"title":"Here We Go Again","post":"Robert Eisenman covered that in his book, “James the Brother of Jesus” and Bart D. Ehrman in his book, “Did Jesus Exist?” mades the point that the language Jesus skope was Aramaic not Greek. Having said that, your own words,”  full range of meaning from blood brother” means they may be correct. So Jesus, as Eisenman says Jesus may have a real brother. There is no evidence Joseph had kids outside of the ones with Mary.\n\n","date":"March 12, 2015 at 8:05 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193201","author":"John Green","site":"shroudstory"},{"title":"Here We Go Again","post":"James ossuary:\n“Yaakov bar Jehosef, Akhui d’yeshua”\nJames son of Joseph, brother of Jesus.\n1) Brother of Jesus was added later,two hands were involved\n2) “Akhui” (Aramaic) can mean brother, half-brother, stepbrother, cousin brother, even partner\n3) “brother of Jesus” can also mean that it was Joseph who was the brother of Jesus.\nWhat Discovery listed as one of the ten top hoaxes of the century was also used to support the so-called Jesus family tomb. There are no limits to sensationalism:  https://www.academia.edu/7471223/Jesus_was_not_buried_in_Talpiot_-_Part_III\n\n","date":"March 27, 2015 at 5:37 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-194644","author":"Louis","site":"shroudstory"},{"title":"Here We Go Again","post":"Oh and I think the writing on the ossuary was added by a fraud to sell it for a high price, it’s phony.\n\n","date":"March 12, 2015 at 8:31 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193202","author":"John Green","site":"shroudstory"},{"title":"Here We Go Again","post":"No doubt Jesus most likely spoke Aramaic.  Yet the Greek is the most common translation, hence it does come into play.  I have also read the ossuary of St. James was a fraud.\n\n","date":"March 27, 2015 at 5:24 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-194638","author":"Andy","site":"shroudstory"},{"title":"Here We Go Again","post":"haha…what a crock…..anyway Jesus  entrusted Mary to John….If Jesus had a blood brother, there would be no need for this….very simple\n\n","date":"March 12, 2015 at 9:47 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193208","author":"rick","site":"shroudstory"},{"title":"Here We Go Again","post":"Precisely.\n\n","date":"March 27, 2015 at 5:24 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-194639","author":"Andy","site":"shroudstory"},{"title":"Here We Go Again","post":"“…..and she brought forth her FIRSTBORN son.  And she wrapped Him in swaddling cloths and laid Him in a manger because there was no room for them at the inn.” (Luke 2:7)  When interpreting Scripture, if the plain text makes common sense, seek no other sense.  The CATHOLIC Bible declares that Jesus was Mary’s FIRSTBORN child.  At the cross, she was not entrusted to another sibling because they were not there with Him in His agony.  John and Mary were.  Therefore Jesus committed them to each other.  Both of whom were like-minded in their love and devotion to Him.\n\n","date":"March 12, 2015 at 10:03 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193210","author":"David O.","site":"shroudstory"},{"title":"Here We Go Again","post":"oh please…no true Catholic believes this….this happens when one gets to interpret the bible personally….which is different then the way the church that Jesus established (CATHOLIC)\nchurch teaches…also…you might want to take a look at what Mary says at fatima….oh…i forgot…..thats a CATHOLIC interpretation as well\n\n","date":"March 12, 2015 at 1:20 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193220","author":"rick","site":"shroudstory"},{"title":"Here We Go Again","post":"Firstborn does not imply other children.  You need to do a study of the Scriptural usage of this term to discover the argument does not hold water.\n\n","date":"March 27, 2015 at 5:25 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-194640","author":"Andy","site":"shroudstory"},{"title":"Here We Go Again","post":"Sometimes the most honest answer is “we don’t really know”.\n\n","date":"March 12, 2015 at 1:39 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193221","author":"David Goulet","site":"shroudstory"},{"title":"Here We Go Again","post":"I agree. No one knows what was in Jesus’s mind when he said that. He could have figured the others were put in jail, or killed. He could have felt he had other things for James to do. r James had his hands filled as the head of the Jerusalem Church and leadership of early Christianity. The best we can say it we don’t know.\n\n","date":"March 13, 2015 at 2:19 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193264","author":"John Green","site":"shroudstory"},{"title":"Here We Go Again","post":"Please, once again the same old story….\nAround three months before the IAA dismissed the claim that the James ossuary held the remains of James, the Just, the first Jewish-Christian bishop of Jerusalem, I published an article entitled “The James ossuary: much ado about nothing..”, which was online for a while. The point that was stressed was this:two hands were involved in the inscription.The owner of the ossuary had problems with the government for other reasons, also relating to antiquities.\nThere are two problems here:\n–Father James Martin is not an authority in biblical studies\n— Ben Witherington III apparently has an ulterior motive to promote the ossuary. And what is that? He wants to show that Catholics are wrong when it comes to the Virgin birth and he is not a palaeographer. \nJesus would not have asked disciple John to look after his mother after he had a brother.\nThis is a long story, and those who would like to read the points of view of the best biblical scholars and the happenings can read:\nhttps://www.academia.edu/7556467/Jesus_was_not_buried_in_Talpiot_-_Parts_I_and_II\nThere were more developments involving the ossuary when the so-called Jesus family tomb book was launched. It led to a Princeton Conference in Jerusalem. The results can be read here:\nhttps://www.academia.edu/7471223/Jesus_was_not_buried_in_Talpiot_-_Part_III\n\n","date":"March 12, 2015 at 1:47 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193222","author":"Louis","site":"shroudstory"},{"title":"Here We Go Again","post":"We have been here before!  \nMark 6:3 – “Is he not the carpenter, the son of Mary, and the brother of James and Joses and Judas and Simon? And are not his sisters here with us?” And they took offense at him.” \nThe doctrine of Mary’s perpetual virginity originated in the 4th century, but possibly from an earlier tradition, Jerome and other Church fathers offering various explanations for this verse.  These explanations have not been accepted by John P Meier in his “A Marginal Jew”. . \nMonsignor Meier’s credentials are excellent – a Catholic priest in good standing with his Church – professor of New Testament at the Catholic University of America in Washington D.C., who has been both president of the Catholic Biblical Association and the general editor of the Catholic Biblical Quarterly.  He is possibly the foremost biblical scholar of his generation.  His “A Marginal Jew” is cited in Jesus of Nazareth  by Pope Benedict XVI. \nMeier discusses the fourth century doctrines of Mary’s perpetual virginity, but considers that the “brothers” and “sisters” of Jesus mentioned in the gospels are in fact blood-brothers or sisters of Jesus – he refers to the typical use of the Greek word adelphos (brother or half-brother) rather than other terms (e.g. anepsios) in common use for relationships such as cousin or step-brother – thus he rejects Jerome’s and other patristic interpretations of these relationships.  \nThe on-line CCB version of Mark includes a note affirming the traditional doctrine and asserting that ‘adelphos’ may be extended to other relationships.  I think I would prefer Meier’s scholarship on the matter ahead of the CCB editors. \nHowever another explanation, not apparently considered by Meier is possible.  Adoption was much more common in the ancient world.  High mortality rates meant that there were very many orphans.  Under both Jewish and Roman Law, adoption gave precisely the same legal rights as birth, and in that case ‘adelphos’ would seem an appropriate term for adopted siblings.  Mary and Joseph may well have had such a generous spirit.  \nIt is even conceivable that Jesus himself may have adopted one of his “brothers”, and perhaps this was the “Disciple whom Jesus loved”;  such a relationship would have been a secret one for the lad’s own protection as natural heir to the “King of the Jews”.  A recurring theme in Paul is that we are all sons of God by adoption through baptism.\n\n","date":"March 12, 2015 at 2:00 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193223","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Here We Go Again","post":"No offense to Monsignor Meier of you, Dave, but I think your statement ” He is possibly the foremost biblical scholar of his generation” is a bit over the top.\n\n","date":"March 27, 2015 at 5:27 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-194641","author":"Andy","site":"shroudstory"},{"title":"Here We Go Again","post":"Gentlemen,\nPlease read my comment above, the result of professional, not amateur work. And, being in the profession for quite a long time I do know that John P.Meier is no longer the news, his quest is over before it finished and I am now working on this new line.\n\n","date":"March 12, 2015 at 2:14 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193225","author":"Louis","site":"shroudstory"},{"title":"Here We Go Again","post":"Louis may have his preoccupations with the Talpiot tomb.  I’m not aware that John P Meier ever showed much interest in it, even if he was aware of it.  Meier, certainly no amateur, raises legitimate challenges to received Catholic wisdom, and was highly thought of by Pope Benedict XVI, himself a biblical scholar of some note.  I see no connection with Meier’s hypotheses and the Talpiot tomb.  Adoption was common in the ancient world, and provides one credible explanation for the explicit verse of Mark 6:3, certainly an improvement on 4th century attempts, which would seem to place a strain.on the semantics of the Greek.  The expression “the disciple whom Jesus loved” would seem to be an exceptionally singular expression for a disciple, when Jesus would have had a care for each one of them.  It is conceivable that adoption might provide a resolution of this enigmatic expression.  I had been under the impression that Louis’ particular long-time profession, was in the field of quality Catholic journalism, rather than advanced biblical studies.         .\n\n","date":"March 12, 2015 at 5:16 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193237","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Here We Go Again","post":"Perhaps David is not aware that J.P.Meier was writing for Catholics, Protestants, Jews and Agnostics and that is a constraint. He is still the world’s foremost Jesus researcher but has been overtaken by other scholars who are approaching biblical studies from a different angle. They want to be even more “objective”, but judging from what I’ve seen so far prejudice is involved, good questions are asked sometimes, but of course nothing that can be considered definitive is seen.\nThe American priest John P.Meier, now a monsignor, was awarded two papal gold medals as a young student in Rome and it is true that Benedict XVI, a theologian and not a biblical scholar, appreciated his work.\nAs for the rest, I began with “general” journalism, that is writing on developments in paint, chemical and fertiliser industries, then went on to history, theology and finally biblical studies. The dedication to Biblical studies began in 1995 and it is now being merged with studies in existentialism.\n\n","date":"March 12, 2015 at 5:43 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193242","author":"Louis","site":"shroudstory"},{"title":"Here We Go Again","post":"Do you mean to say, Louis, professionals are never wrong?  The ossuary of St. James is a fraud.  Basing any conclusion on a fraud provides an erroneous conclusion.\n\n","date":"March 27, 2015 at 5:28 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-194642","author":"Andy","site":"shroudstory"},{"title":"Here We Go Again","post":"I do not wish to post publicly. But I will say that since when do we need proof of Jesus’ existence. History books, way outside the realm of religious context, contantly refer to the man Jesus. The real quetion is whether He did what they say and I have no reason to believe He didn’t. I enjoyyour blog and thank you for your work. I hope we canmeet one day. \nPeace. >\n\n","date":"March 12, 2015 at 3:49 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193227","author":"maryann","site":"shroudstory"},{"title":"Here We Go Again","post":"We already have proof of Jesus’ existence.  They are called the writings of his disciples now commonly called the New Testament.  This provides eyewitness accounts of the proof required and would be accepted in a court of law.\n\n","date":"March 27, 2015 at 5:30 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-194643","author":"Andy","site":"shroudstory"},{"title":"Here We Go Again","post":"I agree with John Green, David O., and daveb of wellington nz. The evidence suggests that Mary wasn’t a perpetual virgin. I’ll get to the New Testament evidence below, but I first want to note that most of the earliest extrabiblical sources to address the subject are opposed to the concept that Mary was a perpetual virgin: Josephus, Hegesippus, Irenaeus, Tertullian, Hippolytus, and Victorinus, for example. See the following for a discussion of the earliest sources:\nhttp://triablogue.blogspot.com/2007/03/perpetual-virginity-of-mary.html\nThe New Testament uses multiple phrases that are most naturally interpreted as inconsistent with perpetual virginity. The authors used those terms even though terms more consistent with perpetual virginity were available to them and were used elsewhere, sometimes even by the same author. Consider Luke, for example. How do you explain a document like Luke’s gospel, which repeatedly uses the term “relative”, even distinguishing between “brothers” and “relatives” (21:16), yet uses “brothers” to refer to Jesus’ siblings? Did Luke believe in the perpetual virginity of Mary, yet repeatedly chose to use terminology that would suggest the opposite while refraining from using terminology he does use elsewhere, terminology that wouldn’t be so misleading? Luke was willing to qualify his description of Joseph as “supposedly” the father of Jesus (3:23), even though the earlier references to the virgin birth made it obvious that Joseph wasn’t Jesus’ father biologically. Yet, Luke never adds such qualifiers regarding Jesus’ siblings. Again, did Luke believe in the perpetual virginity of Mary, yet repeatedly used terminology that suggested the opposite and repeatedly refrained from adding clarification that he did add when discussing a similar subject? Luke uses the term “firstborn” when discussing Jesus (2:7), even though he could have used “only born”, as he does of people other than Jesus elsewhere (7:12, 9:38).\n\n","date":"March 12, 2015 at 5:08 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193234","author":"Jason Engwer","site":"shroudstory"},{"title":"Here We Go Again","post":"By the way, in case Dan and others here aren’t aware of it, Antonio Lombatti has written a review of CNN’s Shroud program:\nhttp://bibleinterp.com/opeds/2015/03/lom398011.shtml\nIf anybody’s interested, I’ve written a reply to him:\nhttp://triablogue.blogspot.com/2015/03/antonio-lombattis-claims-about-shroud.html\n\n","date":"March 12, 2015 at 5:11 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193235","author":"Jason Engwer","site":"shroudstory"},{"title":"Here We Go Again","post":"I read what was posted about four hours ago. Many issues have not been addressed.\n\n","date":"March 12, 2015 at 5:21 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193239","author":"Louis","site":"shroudstory"},{"title":"Here We Go Again","post":"Since it’s mentioned above, I want to address John 19:26-7. Most likely, the reason why Jesus entrusts Mary to John in that passage is because Jesus’ siblings were still unbelievers at the time (e.g., John 7:5). Jesus’ brothers would become believers shortly afterward, but becoming a believer isn’t the same as being mature in the faith. Jesus repeatedly emphasized the point that spiritual relationships are more important than biological ones, though the latter do have some significance. He’s addressing that issue again in John 19. \nFor those who hold the position that the brothers of Jesus were cousins or relatives of some other sort, it still needs to be explained why Jesus chose John over those relatives. In other words, it’s not as though opponents of Mary’s perpetual virginity are the only ones who need to explain John 19:26-7. The best explanation for the passage is that Jesus was giving priority to spiritual ties over blood relations, as he does repeatedly elsewhere. Thus, the passage does nothing to advance the case for perpetual virginity.\n\n","date":"March 12, 2015 at 5:25 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193241","author":"Jason Engwer","site":"shroudstory"},{"title":"Here We Go Again","post":"Well, some good points have been made. But we must remember that they were Jews, not pagans, and although Jesus had a different point of view because of his emphasis on spiritual relationships, it would be left to James, if he was a brother, to look after their mother. That is where John comes in.\n\n","date":"March 12, 2015 at 5:51 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193244","author":"Louis","site":"shroudstory"},{"title":"Here We Go Again","post":"agree Louis…Jesus would not have to tell  John to take care of Mary if John was allready her son…from the link    http://www.catholic-pages.com/bvm/mother.asp:\nThis is not simply Jesus being a concerned son, even in His last agonizing moments before death, ensuring His mother would be well cared for. Jesus Himself during the years of His public ministry did not care for His mother, as it would appear He is literally commanding John to do. Rather, He left her in Nazareth while He travelled through Galilee and Judaea preaching the Good News. And He would later tell John and the others that they must go forth to all nations teaching them the Good News. He did not intend that John should spend the rest of his life caring for the Blessed Virgin. \nCertainly, John took on responsibility for the care of Mary, but relying strictly on such a literal translation is clearly insufficient. Throughout his gospel, John speaks in symbolic terms. The synoptic gospels do not record this detail in recounting the facts of that day. \nNo, rather, Jesus commissioned His mother to be the Mother of all Christians, and by giving her to John who personifies the Christian people, He commands us to accept her as our own mother. \nAt least that’s how most Catholics (and I) see it……even Benedict\n\n","date":"March 12, 2015 at 6:15 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193246","author":"rick","site":"shroudstory"},{"title":"Here We Go Again","post":"Disciple John took Mother Mary to Ephesus in Turkey. According to word of mouth John made a small house for Mother Mary on a top of a mountain and I was lucky to visit that place.Furthermore I believe that Jesus had step brothers and sisters or cousin brothers and sisters.\n\n","date":"March 12, 2015 at 6:33 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193247","author":"Sampath Fernando","site":"shroudstory"},{"title":"Here We Go Again","post":"good for you sampath…but that that’s not what my Church teaches…as far as step brothers and sisters at least….but your free to interpret it as you like…..again….at fatima…Mary commented on people who question her virginity…take a look at the reasons for the 5 first saturday devotions\n\n","date":"March 12, 2015 at 6:52 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193248","author":"rick","site":"shroudstory"},{"title":"Here We Go Again","post":"The Church has always understood these passages as not referring to other children of the Virgin Mary. In fact James and Joseph, “brothers of Jesus,” are the sons of another Mary, a disciple of Christ, whom St. Matthew significantly calls “the other Mary.” They are close relations of Jesus, according to an Old Testament expression. (CCC 500)\nThe Catechism here refers to the fact that 14 chapters after we find the “brothers” of the Lord listed as “James, Joseph, Simon and Judas,” we find “James and Joseph” mentioned again, but this time their mother is revealed as being named Mary, but not Mary, the Mother of Jesus. We can conclude that “James and Joseph” are “brothers” of Jesus, but they are not uterine brothers.\n\n","date":"March 12, 2015 at 7:02 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193249","author":"rick","site":"shroudstory"},{"title":"Here We Go Again","post":"at least that’s how i see it….good breakdown of both sides on this link:\nhttp://www.catholic.com/magazine/articles/the-case-for-mary%E2%80%99s-perpetual-virginity\nhowever….i know there are enough “experts” here allready\n\n","date":"March 12, 2015 at 7:04 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193250","author":"rick","site":"shroudstory"},{"title":"Here We Go Again","post":"Rick, since the topic is the James ossuary and the inscription reads:\nYaakov bar Yehosef, Akhui d’Yeshua\nJames son of Joseph, brother of Jesus\nthere are two problems:\n“Akhui” can mean brother, step brother, half-brother, cousin brother, even partner\n“James son of Joseph, brother of Jesus”  can also mean that Joseph was the brother of Jesus.\nDidn’t you read the view of Father Joseph A. Fitzmyer in the link: Jesus was not buried in Talpiot Part III above? He was specially requested to read the Aramaic inscription and flown from Washington to Toronto to see the ossuary.\n\n","date":"March 12, 2015 at 7:20 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193251","author":"Louis","site":"shroudstory"},{"title":"Here We Go Again","post":"could not get it to load…will try to get to it when i get home..thanks\n\n","date":"March 13, 2015 at 10:50 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193285","author":"rick","site":"shroudstory"},{"title":"Here We Go Again","post":"There is in my opinion no good reason to assert the perpetual virginity of the mother of Jesus except a 4th century doctrine based only on a tradition which had a peculiar preoccupation with what virtues there might be in virginity as such.  There is no other evidence worth the mention.  There is an early apocryphal tale about two midwives attending the birth of Jesus who are amazed that the hymen is not broken, obviously a fiction.  The “brothers and sisters” of Jesus identified in Mark 6:3 might well have been “in utero” siblings, or they may have been adoptees as a concession only. \nChasteness involves rather more than physical acts or biological physique, and is more properly attributed to an attitude in a person’s mind.  That in no way compromises any other doctrine concerning the purity, and piety of the Mother of Jesus, nor need it compromise the awe and reverence that the faithful can approach her as intercessor.  The doctrine of perpetual virginity reflects the physical preoccupations of a patriarchal society where virgins were considered to be chattels to be disposed of for the maximum number of camels or cattle which a suitor might be able to provide.\n\n","date":"March 13, 2015 at 2:35 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193266","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Here We Go Again","post":"Davidb…..guess it comes down to opinion…as for my Catholic opinion..and since Mary said it at fatima…she was a virgin….so it’s my opinon there are forces in this world that argue against it:\nGenesis 3:15 is the first verse that reveals to us how Mary would become the New Eve. The woman alluded to as being at enmity or hostility with the serpent is Mary. It was God who put this total opposition between Mary and Satan, and we believe it to be in the same likeness as Christ’s hostility with the seed of the serpent: sinful humanity. For Mary to be like Christ in His hostility with Satan and his offspring, it is reasonable to say that this passage implies Mary’s lack of sin and affinity with the devil. There is no surer way to be in total hostility with Satan than to be in the fullness of God’s constant grace (cf. Lk 1:28) and than to observe the will of God and abide by it. It was by the His grace, that God put Mary and Satan in a complete state of opposition and had the woman and the serpent become genuine enemies with hatred for each other, which the Hebrew word for enmity (eybah) denotes. Mary would be a friend of Satan if at any moment she had sinned and consequently be an unworthy mother of our Lord. Eve was at enmity with God at the time she mortally sinned against Him and did what was hateful in His sight.\n\n","date":"March 13, 2015 at 10:48 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193284","author":"rick","site":"shroudstory"},{"title":"Here We Go Again","post":"rick,\nIn a 1:20 P.M. post yesterday, you criticized the alleged dangers of “interpreting the Bible personally”. Yet, you’re giving us your personal interpretation of Fatima, your personal interpretation of Genesis 3:15, etc. There’s nothing wrong with personal interpretation. It’s unavoidable. How would you objectively determine that Roman Catholicism has the authority it claims to have, judge how to understand Roman Catholic documents, etc. without engaging in personal interpretation? Since there’s nothing wrong with personal interpretation, and it’s impossible to avoid engaging in it, you shouldn’t have criticized it.\nWith regard to the sinlessness of Mary, the Bible itself records some examples of Mary’s sins, and church fathers and Popes for hundreds of years denied that she was sinless:\nhttp://triablogue.blogspot.com/2006/09/some-early-sources-on-sinlessness-of.html\nhttp://triablogue.blogspot.com/2006/09/some-later-sources-on-sinlessness-of.html\nYou refer to Mary as a New Eve. There’s a sense in which she is a sort of second Eve. But the concept is vague enough to be interpreted in a lot of ways. Mary’s alleged sinlessness, for example, doesn’t logically follow from viewing her as a New Eve. For instance, Tertullian refers to Mary as a New Eve and a sinner within the same document (see sections 7 and 17 in his treatise On The Flesh Of Christ). As Hans von Campenhausen noted:\n“To how small a degree Mary as a holy person forms the centre of interest can be realized from the fact that the comparison with Eve must by no means be concentrated on her alone. ‘Generally speaking, every woman who plays a part in the salvation of God’s people can be understood exegetically as a type of the new Eve’. Even in Hippolytus, for example, the women who go to the grave on Easter morning are similarly contrasted with Eve – a kind of view that lasts into the fifth century – and Origen compares the two ‘holy women’, Elizabeth and Mary, with Eve. Ambrose parallelizes Eve and Sarah, and emphasizes that there were many Marys before the one Mary brought the great fulfilment….Again and again it is a question here of the ‘woman’ or ‘the women’ as such, who thus receive their due. Nothing like that would have been possible if the Eve-Mary typology had had only a ‘Mariological’ meaning from the outset.” (The Virgin Birth In The Theology Of The Ancient Church [Eugene, Oregon: Wipf & Stock, 2011], 45-6)\nRegarding Fatima, one problem with appealing to Marian apparitions is that they’re internally inconsistent. On the one hand, the latest apparitions supposedly support the latest Roman Catholic teachings on Mary. On the other hand, the same apparitions assume or assert a traditional, high Catholic view of scripture. Yet, scripture contradicts Catholic Marian doctrines, like her alleged sinlessness.\nAnother problem with Marian apparitions is that they’re outweighed by other evidence. Much as Moses outperformed the magicians of Pharaoh and Jesus outperforms the miracles of Satan and the Antichrist in the book of Revelation, the Marian apparitions can be outweighed by other miracles. The network of miracles surrounding Jesus as an individual and the Bible as a collection of literature is far more significant than the miracles surrounding Marian apparitions. If a Marian apparition contradicts Jesus and the Bible, then so much the worse for the apparition.\nIf anybody’s interested, here’s a place where I’ve made a case for the historicity of Christian miracles and how to judge between competing miracle claims:\nhttp://triablogue.blogspot.com/2012/11/a-christian-case-for-miracles_2.html\n\n","date":"March 13, 2015 at 11:44 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193294","author":"Jason Engwer","site":"shroudstory"},{"title":"Here We Go Again","post":"Jason..we believe the church that Jesus founded, is guided by the Holy Spirit and therefore interpret the gospel  correctly…..there are many other churches…with many different “personal interpretations”..i doubt Jesus meant many different interpretations of the same scripture (but that’s what happens with personal interpretation)\nas far as Mary in concerned…have heard it all before….thanks for your blog, but think i’ll stick with the Churches interpretations of miricles…not your personal interpretations….interesting blog though!\n\n","date":"March 13, 2015 at 5:29 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193305","author":"rick","site":"shroudstory"},{"title":"Here We Go Again","post":"rick,\nYour claims about Jesus, the Holy Spirit, and the church depend on your personal interpretation. Why do you believe that Jesus existed as a historical figure, that he was the Messiah, that he founded a church, etc.? Those are all historical judgments that you’re making, using your own fallible personal interpretation. In order to arrive at the (false) conclusion that there’s a church with the attributes you’re assigning to the Roman Catholic denomination, you have to engage in a series of personal interpretations. Every time you interpret a Roman Catholic document, you’re relying on personal interpretation.\n\n","date":"March 13, 2015 at 8:05 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193317","author":"Jason Engwer","site":"shroudstory"},{"title":"Here We Go Again","post":"I fail to follow how Rick’s homiletic on the virtues of Mary or significance as the Mother of Jesus relates to the question of Jesus’ relationship with his siblings, the subject of this posting, unless Rick envisages married sex as sinful, a gross error and heresy.   \nFrom Matthew’s gospel we have the following:\nMt 1:19-20 “19 Joseph her husband, since he was a righteous man,* yet unwilling to expose her to shame, decided to divorce her quietly. 20 Such was his intention when, behold, the angel of the Lord* appeared to him in a dream and said, “Joseph, son of David, do not be afraid to take Mary your wife into your home … ”\n‘Mary your wife’ implies something rather more than merely preparing his meals and keeping his house in order. \nSubsequently:\nMt 1:24-25 “24 When Joseph awoke, he did as the angel of the Lord had commanded him and took his wife into his home. 25 He had no relations with her until she bore a son, … ” \nCCB on-line version includes a footnote on v.25:\n“Until she bore a son: the evangelist is concerned to emphasize that Joseph was not responsible for the conception of Jesus. The Greek word translated “until” does not imply normal marital conduct after Jesus’ birth, nor does it exclude it.” \nI have already referred to Mark 6:3 where the brothers of Jesus are specifically named, and he has at least two sisters.  In Mt 12:46, his mother and his brothers appear but are not specifically named.  Luke is silent on the matter.  This is all consistent with a general trend from specificity to generality in the three synoptic gospels from the primitive Mark, through Matthew to Luke.  John seems to be silent on Jesus’ domestic arrangements until we come to the crucifixion where Mary stands at the foot of the cross.\n\n","date":"March 13, 2015 at 2:18 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193298","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Here We Go Again","post":"Hi Daveb – logically you are correct. Only thing I can’t understand is why Jesus asked John to look after Mother Mary after his death. Usually mother stays with daughters or sons. That is why I thought those brothers and sisters are children of Joseph but not of Mary. No one knows about whether Mary had sexual relationship with Joseph or not. it is a private thing which no one discloses.\n\n","date":"March 13, 2015 at 4:23 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193300","author":"Sampath Fernando","site":"shroudstory"},{"title":"Here We Go Again","post":"Mary did disclose this to one of the seer’s (Lucy)…..:: you can chose to believe this or not….we can get into the predictions regarding fatima, the fact that the athesitic press reported the miracle ot the sun, the fact that jean-paul was shot of may 13\nTHE DAY AND HOUR of the first appearance of Mary at fatima\n60 years before; predictions coming true etc;\nbut mary explained this herself:\nShe explained later that she had been given to understand that this related to the five main types of blasphemies and offences committed against the Immaculate Heart of Mary: that is against the Immaculate Conception; AGAINST MARYS VIRGINITY; against her Divine Maternity and her spiritual motherhood of mankind; for the offences of those who encourage in the hearts of children indifference, contempt and even hatred of her, and finally as reparation for those who outrage her in her holy images.\nguess it aint logical to you though!\nlets get back to the original subject…were not going to convince each other…\n\n","date":"March 13, 2015 at 5:45 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193309","author":"rick","site":"shroudstory"},{"title":"Here We Go Again","post":"It is a popular tradition that it was John who was standing with Mary and the other women at the foot of the cross, but the gospel evidence only identifies him as the “disciple whom Jesus loved”.  A possible and attractive inference is that this was the author of the gospel and there are a few clues that point to this, in that the author never otherwise identifies himself.  \nAs to the actual authorship of the gospel, there is some varied opinion.  “Irenaeus calls John the beloved disciple who wrote the Gospel in Ephesus. Papias mentions John the son of Zebedee, the disciple, as well as another John, the presbyter, who might have been at Ephesus. From internal evidence the Gospel was written by a beloved disciple whose name is unknown.”  \nWe need to ask ‘Is it likely that a Galilean fisherman, the son of Zebedee, would have the education and skill to write a Gospel of the quality and abstract thought that we find in John?’  The names of people in 1st century Palestine were limited in number, perhaps about 4.4% of the men were named John.  As to Ephesus, excavated ruins there have been claimed as the home John shared with Mary, but that might just be fancy.  There are other traditions.  One contributor even identifies the author as John Mark, but this has little other general support.   \nIt cannot be ruled out that the disciple standing there was indeed a family member.  For what it’s worth one Talpiot ossuary is inscribed as Yehuda bar Jeshua (Judah son of Jesus) in Hebrew, and Jude is named in Mark 6:3 as one of the brothers.  The limited number of names available, together with various popular local agendas to suit contemporary popular traditions, make more specific identifications a difficult hurdle to overcome.\n\n","date":"March 13, 2015 at 6:16 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193311","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Here We Go Again","post":"Hi Daveb – “disciple whom Jesus loved”. \nI don’t think that person is a family member. Jesus supported his disciples more than his brothers and sisters (read Matthew 12:46-50). Yes according to this passage Jesus supported his disciples more than his brothers and sisters (including the James the leader of church in Jerusalem). Jesus never asked James to look after his mother. Why? There must be a reason. Why mother Mary accepted that person as his son rather than her own children.\nDefinitely disciple whom Jesus loved is not a family member of Jesus. That person must be the person who wrote Gospel of John.\n\n","date":"March 13, 2015 at 6:42 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193314","author":"Sampath Fernando","site":"shroudstory"},{"title":"Here We Go Again","post":"All we can do on these matters is suppose unless any significant archeological discoveries are made.\nInteresting enough but ultimately of little importance.\n\n","date":"March 13, 2015 at 9:25 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193319","author":"Thomas","site":"shroudstory"},{"title":"Here We Go Again","post":"I see two possibilities.  Either a) the “disciple whom Jesus loved” is the author of the fourth gospel, and this is the particular way he chooses to identify himself. Or b) there is a special relationship between Jesus and a particular disciple, such as adoption, known by the author of the fourth gospel, and that disciple is not otherwise named for his own protection.  It was the routine custom in the ancient world that if a king pretender was to be executed, then it was also essential that any possible successor would also be executed.  We don’t know and you take your choice.\n\n","date":"March 13, 2015 at 10:22 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193323","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Here We Go Again","post":"I believe Gospel of John than other three Gospels as it is the only Gospel ention about the burial cloth of Jesus and as well as the face cloth.\nSo I am alinged to believe this author that Mother Mary did not have any other children and that is the reason Jesus asked the disciple he loved most to look after his mother after his death. Furthermore Mother Mary accepted Jesus advise and accepted this person as her son. If she had other children by her own she never accepted the advise of Jesus.\n\n","date":"March 15, 2015 at 4:58 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193444","author":"Sampath Fernando","site":"shroudstory"},{"title":"Here We Go Again","post":"So far I’ve seen no good counter-explanation to Mark 6:3\n – “Is he not the carpenter, the son of Mary, and the brother of James and Joses and Judas and Simon? And are not his sisters here with us?” And they took offense at him.”\nMark uses the Greek word “adelphos” which means ‘blood brother’ .  James the leader of the Church in Jerusalem was known as the brother of Jesus. \nCan we have some logical argument based on more than mere pietism and any notional virtues of celibacy?\n\n","date":"March 16, 2015 at 1:35 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193465","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Here We Go Again","post":"Dave.\nI am not specialist, but so far I know, Septuagint, New Testament and Josephus often uses the term “adelphos” for cousins and other close relatives who were not full brothers (Mt 14:3, Mk 6:17, Lk 3:1, Gen 13:8, 14:14, Gen 14:16).\nI base on the polemic of my friend from Apologetyka.info websites.\nhttp://lewandowski.apologetyka.info/kosciol-katolicki/maryja/dziewictwo-marii-cz3,99.htm\nThere is no evidence whatsoever that Mary ever lost her virginity. Nowhere. Despite hundreds years of attempts to challenge Mary’s perpetual virginity, no one has proven otherwise.\nThe only problem is shameful “white flag” policy of some modern “catholic” scholars.\n\n","date":"March 16, 2015 at 4:43 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193472","author":"O.K.","site":"shroudstory"},{"title":"Here We Go Again","post":"There is no evidence that Mary was always a virgin. It’s very clear what the NT says all over the place. He was not a cousin because the greek word for cousin or relatives is “syggenē.”\nPaul wrote: \nGal 1:19\nBut other of the apostles saw I none, save James the Lord’s brother.\nSo Paul did not use the word brother in the generic sense at all.\n\n","date":"March 16, 2015 at 6:11 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193481","author":"John Green","site":"shroudstory"},{"title":"Here We Go Again","post":"http://www.patheos.com/blogs/standingonmyhead/once-a-virgin-always-a-virgin\n\n","date":"March 15, 2015 at 7:09 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193446","author":"Louis","site":"shroudstory"},{"title":"Here We Go Again","post":"There is no evidence that Mary was always a virgin. It’s very clear what the NT says all over the place. He was not a cousin because the greek word for cousin or relatives is “syggenē.”\nPaul wrote:\nGal 1:19\nBut other of the apostles saw I none, save James the Lord’s brother.\nSo Paul did not use the word brother in the generic sense at all.\nThis has also been discussed by my friends at Apologetyka.info:\nhttp://lewandowski.apologetyka.info/kosciol-katolicki/maryja/czy-sowo-kuzyn-z-kol-410-przeczy-idei-jedynactwa-jezusa,382.htm\nThere is no evidence that Mary ever lost her virginity (nor otherwise). No matter what lingustic/semantic/interpretative approach you go, you have no conclusive proof of her defloration. You will not manage to rape the Virgin.\nSo as there is no conclusive evidence in either way, you have the right to believe whatever you want. But respect the same right for the Catholics. The oldest Church tradition maintained she was perpetual virgin, so Catholics have justifable right to believe so.\n\n","date":"March 16, 2015 at 7:42 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","id":"comment-193493","author":"O.K.","site":"shroudstory"}]
