[{"title":"New Video: Discovering Jesus in His Holy Shroud","post":"There are two books by atheists (The Sign: The Shroud of Turin and the Birth of Christianity and The Shroud Was the Resurrection: The Body Theft, the Shroud in the Tomb, and the Image that Inspired a Myth) that say the Holy Shroud is authentic in order to explain the historical events or event called the Resurrection of Jesus. The idea is that putrefaction did not destroy the naturally created image because Roman and/or Jewish officials stole the corpse. Donald Nohs, in this video, uses the authenticity of the Holy Shroud to argue that the corpse did not putrefy at all because of the Resurrection. Both analyses failed to mention the theory of Robert Drews that Gnostics in the 1st or 2nd century created the image on the Shroud with methods that have been lost to history. \nBoth atheistic historians and Christian historians make the mistake of asking: What caused the Resurrection of Jesus? This is not an intelligent historical question because there is no answer to the question. An intelligent question is to ask whether or not Jesus is alive in a new life with God.\n\n","date":"December 29, 2013 at 10:16 pm","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","id":"comment-69922","author":"David Roemer","site":"shroudstory"},{"title":"New Video: Discovering Jesus in His Holy Shroud","post":"I can understand why it may be claimed that the disciples stole the body ( although it is untenable because they all died for their faith in the resurrection, people don’t die for lies like this). But why would the Romans or Jewish leaders do that. It seems ultimately foolish to try to propagate the same faith they are trying to destroy by killing the leader of that faith and then stealing the body, they already knew that Jesus talked about coming back to life.\n\n","date":"December 29, 2013 at 10:50 pm","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","id":"comment-69929","author":"Mike Morcous","site":"shroudstory"},{"title":"New Video: Discovering Jesus in His Holy Shroud","post":"The atheistic authors had arguments to explain the motivation of the Jewish and Roman authorities for stealing the body. It had to do with preventing the burial place of Jesus from being honored. My point is that advocates of the authenticity of the Shroud are misrepresenting our salvation history. The motivation for this is to promote belief in Jesus. Atheists are using the authenticity of the Shroud to promote atheism. I don’t think it is an historical fact that Jesus predicted the Resurrection. Even if it was, why would the Romans know about this prediction?\n\n","date":"December 30, 2013 at 12:50 am","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","id":"comment-69967","author":"David Roemer","site":"shroudstory"},{"title":"New Video: Discovering Jesus in His Holy Shroud","post":"I don’t believe in the resurrection because I believe in the shroud. My interest in the shroud is mainly because it helps me realize how much Christ suffered as a man. It gives me a chance to “Behold the man” in the 21st century.  I don’t need the shroud to prove Jesus to me.\n\n","date":"December 30, 2013 at 5:00 pm","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","id":"comment-70246","author":"Mike Morcous","site":"shroudstory"},{"title":"New Video: Discovering Jesus in His Holy Shroud","post":"Mike M, David R: See Matt 27:62-66;\nJews & Romans knew about Jesus predicting the Resurrection:-\n“The next day, the one following the day of preparation, the chief priests and the Pharisees gathered before Pilate 63c and said, “Sir, we remember that this impostor while still alive said, ‘After three days I will be raised up.’ 64Give orders, then, that the grave be secured until the third day, lest his disciples come and steal him and say to the people, ‘He has been raised from the dead.’ This last imposture would be worse than the first.” 65Pilate said to them, “The guard is yours; go secure it as best you can.” 66So they went and secured the tomb by fixing a seal to the stone and setting the guard.” \nRe rumour about stealing the body: See Matt 28:11-15:\n“11While they were going, some of the guard went into the city and told the chief priests all that had happened. 12They assembled with the elders and took counsel; then they gave a large sum of money to the soldiers, 13telling them, “You are to say, ‘His disciples came by night and stole him while we were asleep.’ 14And if this gets to the ears of the governor, we will satisfy [him] and keep you out of trouble.” 15The soldiers took the money and did as they were instructed. And this story has circulated among the Jews to the present [day].”\nI fail to see how TS authenticity could ever be any kind of useful argument to an atheistic position!\n\n","date":"December 30, 2013 at 4:13 am","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","id":"comment-70011","author":"daveb of wellington nz","site":"shroudstory"},{"title":"New Video: Discovering Jesus in His Holy Shroud","post":"Matthew was written 40 or 50 years after the Resurrection and indeed is part of the Resurrection. I was grateful for de Wesselow’s book (The Shroud of Turin and the Birth of Christianity) for giving an expanded definition of the Resurrection: 1) The renewed fellowship of His disciples after the crucifixion.  2) Calling Jesus the Messiah even though he was dead. 3) Worshipping on Sunday. 4) Emphasis on the Jewish belief in life after death. 5) The growth of the church. The idea is that when the disciples saw the mysterious image, they interpreted it as meaning Jesus was alive. They argue that Paul went to Damascus to destroy the Holy Shroud, and when he saw the image he joined the Church.\n\n","date":"December 30, 2013 at 7:42 am","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","id":"comment-70073","author":"David Roemer","site":"shroudstory"},{"title":"New Video: Discovering Jesus in His Holy Shroud","post":"Where is your evidence for that? \nYour position is that the disciples touched a cloth, spoke with a cloth,and ate with a cloth that contained an as of yet unexplained image of Jesus. The apostle Paul converted when he was made blind by a cloth?\nThe disciples gave their lives believing the Shroud was the Risen Christ? \nThomas was poking his finger in the Shroud when he needed convincing of Christ being alive. \nThere is no factual basis for this belief. \nThink what you will about the authenticity of the Shroud, the disciples believed they saw, touched, and experienced a walking, talking Jesus.\nTheir actions post Crucifiction cannot be explained otherwise.\n\n","date":"December 30, 2013 at 7:45 pm","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","id":"comment-70286","author":"Dennis","site":"shroudstory"},{"title":"New Video: Discovering Jesus in His Holy Shroud","post":"De Wesselow’s theory is an interesting one. I find it more plausible than some atheist’s fanciful explaining away of the resurrection. But I still don’t buy it.\n\n","date":"December 30, 2013 at 8:55 am","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","id":"comment-70108","author":"Matthias","site":"shroudstory"},{"title":"New Video: Discovering Jesus in His Holy Shroud","post":"The Resurrection is an historical event that can’t be explained. The faith response to the Resurrection is that Jesus is alive in a new life with God and if you follow Jesus the same good thing can happen to you. One of the reasons I believe is that atheists and agnostics don’t understand or don’t know, or pretend they don’t understand or know the cosmological argument for God’s existence. Anyone calling himself an atheist or an agnostic doesn’t know what they are talking about. For proof of this read about the cosmological argument for God’s existence in Wikipedia or the Stanford Encyclopedia for Philosophy. Both sources don’t know what they are talking about.\n\n","date":"December 30, 2013 at 11:00 am","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","id":"comment-70139","author":"David Roemer","site":"shroudstory"},{"title":"New Video: Discovering Jesus in His Holy Shroud","post":"David R: “Matthew was written 40 or 50 years after the Resurrection … ”\nMatthew draws on Mark and common source “Q”. Mark was written ~65AD, before the Roman destruction of the Temple in 70AD, say 35 years after the Resurrection. About 95% of Mark is in Matthew. If David R ever had any acquaintance with indigenous peoples, he would know that they have a remarkable ability in oral memory, common to all illiterate peoples. It is certainly evident today among even literate Maori and Pasifika peoples in their recall of ancient chants and genealogy. Alex Haley gives recent African examples of it in his book “Roots”. \nThe stories attain a standard form quite early and it ill behoves any who err in their recitals, they are soon corrected. There is more accuracy in the recall of the stories of New Testament times than might be judged by a more literate society, a facility which they seem to lose by relying solely on the written word. A period of 35 or even 50 years is very short for those raised in such an oral environment.\n\n","date":"December 30, 2013 at 3:14 pm","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","id":"comment-70219","author":"daveb of wellington nz","site":"shroudstory"},{"title":"New Video: Discovering Jesus in His Holy Shroud","post":"Excellent point. My wife is Samoan and her oral memory is fantastic, as is her facial recognition and memory. Her brother is a traditional orator back in Samoa and I am amazed at what he can recall from memory, i.e. lineages. A couple of decades is nothing for those raised in oral cultures.\n\n","date":"December 31, 2013 at 8:02 am","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","id":"comment-70485","author":"David Goulet","site":"shroudstory"},{"title":"New Video: Discovering Jesus in His Holy Shroud","post":"Actually, I think De Wesselow calls himself an “agnostic” although the points of view offered in his book certainly read more like an atheist.\n\n","date":"December 30, 2013 at 8:56 am","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","id":"comment-70109","author":"Matthias","site":"shroudstory"},{"title":"New Video: Discovering Jesus in His Holy Shroud","post":"What an interesting video. If, like myself, you found the first half rather dull, and didn’t watch the rest, it is well worth while continuing to the end. For me, a number of interesting points were made:\n1) The absolute certainty with which the speaker introduced more and more speculative ideas about the walk to Calvary was interesting. I wonder how many of the less knowledgable of his audience assumed that what he said was archaeologically verifed. I appreciate that beginning every sentence with: “This is a tentative reconstruction based on very little” can be simply distracting, but as we got down to the precise details of how ropes were tied around Jesus’s legs, I did feel that he was pushing indisputablility further than was warranted.\n2) It made me wonder about “shroud lecture audiences” generally. How many people attend  who want to know all the information so that they can make up their own mind, and how many actually just want to be told what to think. I guess it may depend on the venue of the lecture. On this and other sites, we sometimes discuss the ‘argument from authority,’ and generally prefer an argument from evidence, but I fear there are many who not only accept that anything told them in a church must be true, but deliberately use their church as a way of not having to make up their own minds, but to have them made up for them.\n3) At the end of the lecture, Donald Nohs goes into a much more interesting discussion of the Byzantine Rite liturgy (alhough by now we have no idea how accurately), and the idea that the ‘body’ is resurrected during the mass from the ‘antimention’ which is an image of the burial of Jesus on a small cloth that every Orthodox priest gets given on his ordination. (Western Rites use a ‘corporal’ instead of an ‘antimention,’ which I think confuses things a little.) Nohs’ point is that the liturgy contrasts the cross, which received the live body of Jesus and gave back the dead one, and the shroud, which received the dead body of Jesus and gave back the live one. Naturally, he would derive this liturgy entirely from the existence of the Shroud, while I am inclined to derive the existence of the Shroud from the liturgy. In other words, to paraphrase Voltaire, even if the shroud did not exist, it would be necessary to make one. I don’t know how old the ‘antimention’ tradition is, but Wikipedia tells me that every Orthodox altar has a ‘shroud’ (Strachítsa) that covers it permanently. Were there hundreds of ‘shrouds’ all over Constantinople, did the bigger and more important churches have the most impressive or realistic ones? I’m in deep water here for me. Anyone any comments?\n4) Surely Donald Nohs hasn’t been saying ‘seplichre’ instead of ‘sepulchre’ all his life has he?\n\n","date":"December 30, 2013 at 9:09 am","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","id":"comment-70114","author":"Hugh Farey","site":"shroudstory"},{"title":"New Video: Discovering Jesus in His Holy Shroud","post":"Naturally, he would derive this liturgy entirely from the existence of the Shroud, while I am inclined to derive the existence of the Shroud from the liturgy. In other words, to paraphrase Voltaire, even if the shroud did not exist, it would be necessary to make one.\nAnyone any comments?\nYes. A little question to you and all those who believe the TS is a piece of liturgical art. What is easier to do: to derive the liturgy from the existence of the Shroud, or the existence of the Shroud (which no one has been able to faithfully reproduce yet) from the liturgy?\n\n","date":"December 30, 2013 at 9:51 am","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","id":"comment-70127","author":"O.K.","site":"shroudstory"},{"title":"New Video: Discovering Jesus in His Holy Shroud","post":"Hugh, I am Coptic orthodox myself. I find your assumption that the church would go into the effort of imprinting an image like that (pseudo negative, with 3d information, superficial at the fibre level..etc), and put real human blood with high levels of bilirubin on it for liturgical purposes absurd. A good piece of artwork with fibres that has real gold or real silver with precious stones is more likely what the Orthodox Church would do to honour a liturgical item like this.\n\n","date":"December 30, 2013 at 3:35 pm","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","id":"comment-70222","author":"Mike Morcous","site":"shroudstory"},{"title":"New Video: Discovering Jesus in His Holy Shroud","post":"Some years ago I was invited to attend a mass celebrated(in Aramaic, which is normal) by an Iraqi archbishop of the Syrian Orthodox Church and took some photographs, which I will have to look for. I know that the liturgy dates to the fourth century. As for the altar table, and the antimension, there is some information in the following link, to start with:\nhttp://orthodoxwiki.org/Antimension\n\n","date":"December 30, 2013 at 2:35 pm","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","id":"comment-70213","author":"Louis","site":"shroudstory"},{"title":"New Video: Discovering Jesus in His Holy Shroud","post":"Hugh F: “The absolute certainty with which the speaker introduced more and more speculative ideas … (etc)” \nI think part of the problem is the typically limited time available for such presentations, and usually the pro-authenticist motivation behind the presentation. The type of venue may also be a factor, (church or hall).  It is difficult to adequately cover the more contentious issues adequately, and the presenter is possibly overly-anxious to establish his pro-authenticist agenda. We are all human and carry our cultural baggage with us, and inclined to present cherished beliefs as facts, even when this might not be the case. \nI shall be presenting two 2-hour sessions on the TS to a group of seniors in March. We have some 430 members in our local U3A group, and they have already expressed some interest in this presentation. I hope that with the two sessions I shall be able to deal adequately with the more contentious aspects.\nRe Byzantine rite liturgies: Albert Dreisbach in his paper “Lazarus and Jesus” (Atlanta 2005) summarises several examples whereby the altar cloths are to be thought of as the burial cloths, or shroud of Christ, dating from the very early centuries. He makes the point that “Scripture influenced liturgy; Liturgy clarified scripture.”\n\n","date":"December 30, 2013 at 3:48 pm","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","id":"comment-70231","author":"daveb of wellington nz","site":"shroudstory"},{"title":"New Video: Discovering Jesus in His Holy Shroud","post":"Daveb, you are absolutely right .. Liturgy clarified scripture. The Orthodox Church uses iconography and liturgy to explain scripture to the public. I find very unlikely that they would create a burial cloth with an image that was only full appreciated after the invention of photography. The symbolism in liturgy and iconography is very clear and simple.\n\n","date":"December 30, 2013 at 4:13 pm","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","id":"comment-70239","author":"Mike Morcous","site":"shroudstory"},{"title":"New Video: Discovering Jesus in His Holy Shroud","post":"Mike M: Over 40 years ago I worked for six months with an American consultant from Chicago.  He was very knowledgable about Eastern Rite liturgies, as you would know there are many such churches in Chicago. He presented me with two authoritative texts by Donald Atwater which I still have, as well as a few examples of liturgies. So I’ve had some insight into Byzantine rite and other Eastern liturgies, such as Coptic, for very many years. It is a tragedy that the Coptic Church in Egypt, and other Eastern churches, the cradle of Christianity, are under such terrible persecution and oppression at present.\n\n","date":"December 30, 2013 at 5:35 pm","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","id":"comment-70257","author":"daveb of wellington nz","site":"shroudstory"},{"title":"New Video: Discovering Jesus in His Holy Shroud","post":"Thanks Dave, it is a tragedy indeed, we celebrate Christmas on the 7th of January and the Christians in Egypt are expecting a bomb to go of in a church at that time. Imagine going to a church knowing that you may not survive it. However, the Coptic Orthodox Church has survived periods like that, or even much worse, in the past. I personally have left Egypt 15 years ago because I saw this coming, my parents however refuse to leave. We try to preserve the Coptic culture in our satellite communities, even here in North America. If anything history proves, persecution serves to strengthen our faith.\n\n","date":"December 30, 2013 at 5:56 pm","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","id":"comment-70264","author":"Mike Morcous","site":"shroudstory"},{"title":"New Video: Discovering Jesus in His Holy Shroud","post":"So, bottom line, the video’s description of the condemned tied together is speculation.  OK, but where did the ‘reconstruction’ originate?  There has to be some source for this; did the guy in the video come up with it himself?\n\n","date":"January 3, 2014 at 11:52 am","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","id":"comment-71668","author":"Jeffrey Liss (@jeffliss)","site":"shroudstory"},{"title":"New Video: Discovering Jesus in His Holy Shroud","post":"The readers of this blog collectively must have read every word and seen every foot of film relating to the Shroud. This rope thing is a new one on me, but if it’s not original, someone can tell us where it came from, surely?\n\n","date":"January 3, 2014 at 1:29 pm","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","id":"comment-71706","author":"Hugh Farey","site":"shroudstory"},{"title":"New Video: Discovering Jesus in His Holy Shroud","post":"Regarding how the crucified was tied to the patibulum :\nOn the Physical Death of Jesus Christ :, JAMA 1986; 255:1455-1463\nHow the condemned were tied together, i didn’t know, but you can’t find any evidence on the Shroud. That it could have prevented the patibulum from hitting the head is speculation.\n\n","date":"January 4, 2014 at 5:40 am","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","id":"comment-72015","author":"anoxie","site":"shroudstory"}]
