[{"title":"New ‘Real Face of Jesus’ pages at the History Channel","post":"“In March 2010, researchers unveiled a revolutionary radiocarbon dating method that could allow scientists to safely establish accurate ages for precious artifacts like the Shroud of Turin. Unlike traditional carbon dating, the new process does not require samples; instead, the entire object is exposed to an electrically charged gas that gently oxidizes its surface without causing damage.”\nI would have thought that gently oxidising the surface of the shroud would be the single neatest way of entirely obliterating the image completely….\n\n","date":"May 6, 2013 at 4:58 am","url":"https://shroudstory.com/2013/05/06/new-real-face-of-jesus-pages-at-the-history-channel/","cat":"video","id":"comment-33026","author":"Hugh Farey","site":"shroudstory"},{"title":"New ‘Real Face of Jesus’ pages at the History Channel","post":"I just spilled a cup of coffee in my lap when I read that. How did I miss that? I’ll be amending the page. No, I’ll be doing that and bringing this to the top for the attention it warrants.\n\n","date":"May 6, 2013 at 6:02 am","url":"https://shroudstory.com/2013/05/06/new-real-face-of-jesus-pages-at-the-history-channel/","cat":"video","id":"comment-33030","author":"Dan","site":"shroudstory"},{"title":"New ‘Real Face of Jesus’ pages at the History Channel","post":"It’s déjà vu all over again:\nhttps://shroudstory.com/2010/03/24/new-dating-technique-might-help-with-the-shroud-of-turin/\n\n","date":"May 6, 2013 at 6:14 am","url":"https://shroudstory.com/2013/05/06/new-real-face-of-jesus-pages-at-the-history-channel/","cat":"video","id":"comment-33031","author":"colinsberry","site":"shroudstory"},{"title":"New ‘Real Face of Jesus’ pages at the History Channel","post":"Thanks, Colin. You beat me to it. It is still only 6am on this side of the pond. Quite a bit of discussion then; then forgotten for more than three years. Déjà vu all over again, indeed.\n\n","date":"May 6, 2013 at 6:32 am","url":"https://shroudstory.com/2013/05/06/new-real-face-of-jesus-pages-at-the-history-channel/","cat":"video","id":"comment-33033","author":"Dan","site":"shroudstory"},{"title":"New ‘Real Face of Jesus’ pages at the History Channel","post":"Checking out the 2010/03/24 Shroudstory reference, strong reservations were then expressed at the potential damage to the Shroud from a then untested method, notably by Stephen Jones as well as others. The discoverer is Marvin Rowe who has since built three such laboratories, including one in New Mexico and is apparently now building one in Australia. (Google on ‘Marvin Rowe radiocarbon dating’). Several artifacts have now been tested including various rock paintings, the gospel of Judas, various Egyptian mummy cloths and so on. Rowe claims there is no discernible damage to tested artifacts, and supports this with a few visual samples of tests done. The Shroud conservationist team were concerned at the possible effects of oxidation on the image, and coupled with electric plasma discharges the method sounds somewhat hair-raising. It is not clear to me whether the method would be effective on small samples which might be another option. I would think it unlikely that the authorities would be agreeable to even testing a small sample containing a partial image to see if it is obiterated or not. More is needed on the knowledge of the nature of the image and its chromophore, before the risk of employing a technique resulting in possible obliteration of even a small part of the image should be considered.\n\n","date":"May 7, 2013 at 7:59 pm","url":"https://shroudstory.com/2013/05/06/new-real-face-of-jesus-pages-at-the-history-channel/","cat":"video","id":"comment-33208","author":"daveb of wellington nz","site":"shroudstory"}]
