[{"title":"Plan to be bored: But don’t worry. Only the first six minutes of this lecture are about the Shroud.","post":"This garbage is hardly even worth a reply…except to say that some Baptist are apparently more hardwired against the Catholic church than others….and mostly for reasons of PRIDE whether they know it or not.The ignorance of some never ceases to amaze me.\n\n","date":"October 16, 2013 at 10:17 am","url":"https://shroudstory.com/2013/10/16/plan-to-be-bored-but-dont-worry-only-the-first-six-minutes-of-this-lecture-is-about-the-shroud/","cat":"video","id":"comment-47644","author":"jkenneth8@hotmail.com","site":"shroudstory"},{"title":"Plan to be bored: But don’t worry. Only the first six minutes of this lecture are about the Shroud.","post":"I tried but I guess that I’m impatient and could not handle 3 minutes of this drivel.\n\n","date":"October 16, 2013 at 2:25 pm","url":"https://shroudstory.com/2013/10/16/plan-to-be-bored-but-dont-worry-only-the-first-six-minutes-of-this-lecture-is-about-the-shroud/","cat":"video","id":"comment-47671","author":"ekmcmahon","site":"shroudstory"},{"title":"Plan to be bored: But don’t worry. Only the first six minutes of this lecture are about the Shroud.","post":"It is indeed boring and that is a pity because the time could be devoted to saying something more constructive. Unfortunately many evangelical churches suffer from a sort of “inferiority complex” because they are not of apostolic origin and therefore aim at the Catholic Church. Dialogue between the Catholic Church and the Lutherans has produced good results, seen at the meeting in Augsburg a few years ago and there is also a lot of cooperation with Anglicans, joint declarations signed with the Assyrian Church of the East, meetings with Coptic, Serbian, Syrian Orthodox, Greek Orthodox and other churches.\nBaptisms in the Baptist church in the US have fallen considerably and many anti-Christian books in the US have been authored by former Baptist ministers. This is the result of fundamentalism, expressing the view that “Everything is true or nothing is true”, the refusal to accept developments in science and to take part in the science-theology dialogue.\n\n","date":"October 16, 2013 at 11:47 am","url":"https://shroudstory.com/2013/10/16/plan-to-be-bored-but-dont-worry-only-the-first-six-minutes-of-this-lecture-is-about-the-shroud/","cat":"video","id":"comment-47662","author":"Louis","site":"shroudstory"},{"title":"Plan to be bored: But don’t worry. Only the first six minutes of this lecture are about the Shroud.","post":"The factors influencing religious adherence are many and complex.  In NZ remote from historic religious conflicts, interfaith relationships are now generally cordial, but it wasn’t always so, as many settlers had brought their religious baggage with them. Interfaith services are now quite common, particularly Lent, Easter & Christmas, and national memorial days such as Anzac Day. Most suburban areas would have active Minister Fraternals. \nI suspect adherence has a lot less to do with doctrinal positions, than more human aspects such as a sense of community. I’ve known young people who migrate to the city, find that the old historic parishes lack this, nobody speaks, all living their own little lives, not like the early Christians at all, who seemed to understand these things so much better.  \nSuch young people will soon find another church with a fresher outlook, where people are truly welcoming, caring and supportive. I know because I’ve had close-up experience of it. For some 10 years I produced a regular church magazine where parishioners could share their experiences, know what was going on, and mix it in with some religious aspects as well,and the result was the creation of a true parish community spirit. But it was time for me to move on. I hope someone else picks up the baton. \nThe inter-relationships are important at the top level, as they show what can be done.  But it is at the grass roots parish level where more can be accomplished, and what really counts in the long run.\n\n","date":"October 17, 2013 at 2:49 am","url":"https://shroudstory.com/2013/10/16/plan-to-be-bored-but-dont-worry-only-the-first-six-minutes-of-this-lecture-is-about-the-shroud/","cat":"video","id":"comment-47730","author":"daveb of wellingon nz","site":"shroudstory"},{"title":"Plan to be bored: But don’t worry. Only the first six minutes of this lecture are about the Shroud.","post":"I wonder if social media would be another way to go, i.e. a parish Facebook page for example. Many parishes have websites but rarely with an interactive forum. That sense of community, in urban areas, is so hard to create. Your magazine was a creative attempt, kudos to you for trying that.\n\n","date":"October 17, 2013 at 6:48 am","url":"https://shroudstory.com/2013/10/16/plan-to-be-bored-but-dont-worry-only-the-first-six-minutes-of-this-lecture-is-about-the-shroud/","cat":"video","id":"comment-47745","author":"David Goulet","site":"shroudstory"},{"title":"Plan to be bored: But don’t worry. Only the first six minutes of this lecture are about the Shroud.","post":"Thank you for your kind comments, David.  The last issue I produced was around Nov 2012, a new group is supposed to be picking it up, probably will be more webby than my hard copy style.  Issues are on-line back to World Youth day in Sydney 2008 when we had a large parish contingent of young people go there.\nhttp://tawacatholic.org.nz/tawa-catholic-news-2\nBear in mind that the natural seasons in NZ are reverse to those in northern hemisphere (E.g. Winter 2012 = ~June 2012).\n\n","date":"October 17, 2013 at 9:09 pm","url":"https://shroudstory.com/2013/10/16/plan-to-be-bored-but-dont-worry-only-the-first-six-minutes-of-this-lecture-is-about-the-shroud/","cat":"video","id":"comment-47832","author":"daveb of wellingon nz","site":"shroudstory"}]
