[{"title":"Recent Interview with Russ Breault","post":"Fantastic! I talked w/ New Testament Scholar Dr. Ehrman briefly on the shroud recently…\n(First)\nMe: Hey Bart, i’m wondering what your thoughts are on the shroud of turin? I’ve studied it for awhile, and I think its authentic. \nBart Ehrman: I’m afraid there is little doubt that it is a medieval forgery\n(Second)\nMe: Last question on the Shroud Mr. Ehrman. What If I told you there was real blood on the Shroud? What if it held a real human corpse at one point, and has forensically accurate wounds that match Jesus to the most shocking degree? Would you think about it again? Because this is exactly what the evidence shows on the shroud.\nBart Ehrman: Sorry– I think you should read scholarship on the Shroud, what the scientists actually say, not the popularizers .\nMe:  It is what the scientists actually say. Pathologist, Blood chemist, chemist etc. I’ll give you a list of some of them..Robert Bucklin, Frederick Zugibe, Ray Rodgers, Alan Adler, John Heller, Kelly Kearse, Yves Delarge, Pierre Barbet, Paul Vignon, Sebastiano Rodante, Pierluigi Baima-Bollone, Rudolf W. Hynek, Giovanni Battista, Judica-Cordiglia, Gilbert Lavoie, Pierre Merat etc. Atheist, agnostics, jews, and christian all within this list.\nIts an uphill battle when it comes to the shroud, but truth will come through sooner or later, and all I want is for people to do a thorough research on the shroud, and examine all the evidence not just dismiss it out of hand because the c-14 dating. Something Bart clearly hasn’t done, and has done. \nOn another note once you are a shroud proponent and you look back at Isaiah 53 and some other prophecies…..WOW.\n\n","date":"September 23, 2015 at 12:40 am","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-210971","author":"Matthew L.","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"Did he answer you after you mentioned all the research?\n\n","date":"September 23, 2015 at 4:34 am","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-210980","author":"O.K.","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"No, he doesn’t seem to have really researched the shroud much.\n\n","date":"September 23, 2015 at 12:01 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211000","author":"Matthew L.","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"Of course. \nIt would be very inconvenient for his position.\n\n","date":"September 23, 2015 at 12:08 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211001","author":"O.K.","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"Hi Matthew L:   You wrote  “Bart Ehrman: I’m afraid there is little doubt that it is a medieval forgery” \nLet’s think about that statement for a second,\nIf so that would mean that when the Shroud was exhibited in Lirey France in appx, 1350, they were displaying a relatively brand new fabric and attempting to pass it off as being nearly 1,300 years old.  This would be not unlike exhibiting a 2014 auto at a antique classic car auction and saying  “look at my antique car”    “It’s 100 years old”   “it was driven by Charles Chaplin in 1914”   “who wants to buy it?”     \nThere is actually little doubt that it is a medieval forgery,   No doubt in my mind what so ever  (for whatever that is worth which is not much) That is actually also a quote from Dr. Frederick Zugibe chief medical examiner of Rockland County New York in regards to whether or not he believed a genuine dead body made contact with the Shroud, which he did believe the linen made contact with a genuine human man and said, quote,\n “I have no doubt in my mind what so ever”  That does carry weight.   His yes was yes and his no was no.  Convinced.  Not lingering in doubt and uncertainty.  He made a decision, decision comes from a word that means “to cut off from any other possibility” The Latin meaning of the word decision literally means, “to cut off.” Making a decision is about “cutting off” choices – cutting you off from some other course of action. Now that may sound a little severe and limiting, but it’s not. It’s liberating  (as long as it is a decision not made in haste)\n  The Shroud being a medieval forgery  would also mean The Savoy family was involved with something they knew was not genuine,  as in a man made fabricated image and faced with the task of attempting to pass off a 100 year old fabric as being 1,400 years old?!   “I hope we don’t have any textile experts coming to today’s Shroud exhibition, if so we could be in big trouble if the word gets out we are really a group of deceiving liars”  “Is there any way you can make that cloth look older?”  “Don’t let anyone get to close to it, I would like to stay in my position as the King of Italy”\nI agree people are sometimes/often gullible, but not that stupid,  “Excuse me Sir, you can’t be serious about this cloth, it means it looks like it was made last week”   It would have destroyed their credibility as leaders of Italy if they were displaying what looked like a relatively new fabric they were informing people was 1,400 years old.   They would have been the laughing stock of Italy and not remained in power very long if they were involved in this kind of deception involving Jesus and the cloth he was buried in. I cannot in my wildest imagination picture the Savoy Family purchasing The Shroud without conducting a thorough investigation into it’s history and closely examining the linen before doing so.  Interesting to note everything I have seen in their collection of relics are all genuine things, no reproductions of any kind, fakes or forgeries.    Shroud of Turin was in their collection.    \nIf we applied the same “impossible to reach standards”  to all things in which authenticity was at question, as is being done with the Shroud nothing would ever be authenticated.   We would all forever be in doubt and uncertainty.   Lingering in the middle.   I cannot imagine anything  more utterly painful (with some exceptions) than not being able to make a decision and stuck in that grey twilight of uncertainty for all my life.       Jesus said,  “Let your  Yes be Yes and let your No be No, anything other than this shows something is wrong and comes from the Evil One”  \nMy Yes is Yes and my No is No.   Yes, The Shroud is authentic, and No, it is not a medieval forgery.    Lingering in doubt and uncertainty for a extended period of time in not healthy.  It creates fear within your body    The way to eliminate the fear is to make a decision.\n“To cut off from any other possibility”   Dr. Frederick Zugibe made that decision, a forensic pathologist.  In a court of law authenticity type setting, that would be the testimony that would carry the heaviest weight, second to none and greatly aid one in making “A decision” \nTake a good look at all the possibilities before cutting off from them.  \nGood luck.\n\n","date":"September 29, 2015 at 7:13 am","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211487","author":"Dave Hines","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"Professor Bart Ehrman is a good scholar, but he can also be a bit tendentious at times. He is troubled with the problem of evil and he cannot be blamed for that for he has not found the solution he is seeking. It is an old problem, one that led C.G. Jung and his closest friend Father Victor White to keep away from each other at the end of their lives. Naturally, the spiritual bond was not broken and both continued to be Christian:\n   https://www.academia.edu/7344691/C._G._Jung_Father_Victor_White_and_privatio_boni\nIt is a problem that people of all religions tend to sweep under the rug.\n\n","date":"September 23, 2015 at 7:57 am","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-210986","author":"Louis","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"It is only an apparent problem, for which there are many suggested answers -different by different religions. And only atheists seem to be omniscient on the matter of what is the “good” and “evil” in absolute manner.\n\n","date":"September 23, 2015 at 10:20 am","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-210993","author":"O.K.","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"What is your answer?\n\n","date":"September 23, 2015 at 10:59 am","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-210995","author":"Louis","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"We are the answer. The Universe inhabited by the imperfect entities, with tendency towards evil, cannot be perfect. The evil must be channelled somewhere in this world, whether in bad deeds or natural disasters and diseases. This world is just temporary -a kind of a test, an exam of whether people can be perfectly good or not. \nThe outcome is either perfectly good world (heaven) or perfectly corrupted (hell).\nThat’s the Christianity.\n\n","date":"September 23, 2015 at 11:10 am","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-210998","author":"O.K.","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"That does not answer the question of why should there be evil in the first place.\n\n","date":"September 23, 2015 at 12:14 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211002","author":"Louis","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"That does not answer the question of why should there be evil in the first place.\nYes.\nBut the problem is wrongly stated.\nThis is not the question for God, but for us, as conscious and free will entities.\n\n","date":"September 23, 2015 at 12:18 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211003","author":"O.K.","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"Even then, the question is not answered. It is not just a question of free will, or choices.  It cannot be explained away that easily, unless you agree with Leibnitz’ “best possible world”, which is no longer taken seriously. The mysterium iniquitatis is a big problem.\n\n","date":"September 23, 2015 at 1:17 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211005","author":"Louis","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"The mysterium iniquitatis is a big problem.\nI don’t think it is a “problem” (or better say “trouble”). In my opinion, it is better that it remains a mystery. Because it connects with the problem of the Fall of  Angels, and the Origin of Satan.\nThere is an excellent popular article (“The Fall of Angels: 7 hypotheses”) on this topic by demonologist Roman Zając:\nhttp://www.stacja7.pl/article/1927/Upadek+anio%C5%82%C3%B3w.+7+hipotez\nIt is in polish, unfortunately, but it is definitely worth reading (google translator should help).\nThe fact is that none of the 7 hypotheses presented gives a full answer. And that’s how it should be (contrary to Quran for example, which gives too simple answer). There are no simple answers . It is the matter between omniscient, omnipotent and omnibenevolent God who knows perfectly Good and Evil, and its free-will gifted Creation, in the person of Satan.\n\n","date":"September 23, 2015 at 1:34 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211007","author":"O.K.","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"Thanks, I will have a look and get back the soonest possible.\n\n","date":"September 23, 2015 at 1:48 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211008","author":"Louis","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"The paper dwells on an old debate and raises points that are not really new.\nTherefore, when you wrote, “it is better that it remains a mystery” in response to what I described as “mysterium iniquitatis”, you agree with me. Let us proceeed step by step:\nIn Islam there is “maktoub”, “it is written” and this is fatalism, which could correspond to some extent with determinism in philosophy and even with Calvin’s predestinatiom. \nYou also say that evil connects with the “Fall of Angels, and the origin of Satan.” We must ask, Who and What is Satan? Is it correct to capitalise “satan” when passages in the Bible do not have an individual in mind? It seems that in these passages it can mean “adversary” and can also be used of human beings.\nIn the Book of Job, Satan is not an evil entity, he has an errand given to him by Yahveh and ultimately the “serpent” of the Book of Genesis becomes “Satan”. There was a change in interpretation as time went by.\nIt must be remembered that Jesus referred to Peter as “satan” and therefore one is inclined to agree with Father Jerome Murphy-O’Connor’s contention that the saying ” I saw satan and the angels falling down from heaven” was as a meteor from Qumran that landed in the New Testament. This is possible because some Essenes are said to have joined the Christ movement and I think that they brought the idea of the battle between the “sons of light” and the “sons of darkness” with them.\nWas Judas an agent of Yahveh or a disciple tempted by Satan? The New Testament leads us to believe that the traitor acted on his own free will, and ultimately the crucifixion was also the will of God. \nThe problem of evil was something that appeared to have caused a division in Old Testament times:   https://www.academia.edu/12734802/Book_Review_Beyond_the_Essene_Hypothesis_The_Parting_of_the_Ways_between_Qumran_and_Enochic_Judaism\nAlthough he did not say it Freud, a pessimist, saw evil from close when he had to leave Vienna which was occupied by the Nazis, and it was a major factor that made him write “Moses and Monotheism” and question the Old Testament:  https://www.academia.edu/15308857/Freuds_incomplete_speculation_on_monotheism\nIt is not easy to interpret the Bible, but it does seem that the historical-critical method, when used together with other methods, is the best:\nhttps://www.academia.edu/12850351/Book_Review_The_Interpretation_of_Scripture_In_Defence_of_the_Historical-Critical_Method\nIt is the problem of evil and post-Nazi holocaust anguish that one detects in:\nhttps://www.academia.edu/12823419/Book_Review_Jesus_and_Yahveh_the_names_divine\nWith this amount of evil, and difficulties in interpreting the Bible, even renowned Biblical scholars were sometimes left with looking for the “liitle voice” called God:\nhttps://www.academia.edu/12851672/The_Historical_Jesus_The_view_of_Professor_Geza_Vermes\nThe above links were provided for a clear picture to emerge and understand why Professor Ehrman is not alone. He has just not found an answer in his quest and that his been coupled with what he judges to be the lack of any definitive study of the Turin Shroud.\nAnglican Archbishop Desmond Tutu, who has done a lot of good work, is of the opinion that we live on faith, not certainty. That is a bit of  exaggeration. Faith has to have a certain amount of certainty– and despite the mysterium iniquitatis.\n\n","date":"September 24, 2015 at 10:08 am","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211072","author":"Louis","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"Hi Louis:\nVery interesting discussion.\nWhat is Sin?\nDoing something against your consciousness?\nOr\nNot loving your neighbor as thyself?\nOr\nBreaking the New Commandment of Love?\n\n","date":"September 24, 2015 at 5:42 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211111","author":"Sampath Fernando","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"Hi Sampath\nThis is a complex topic. In Judaism and Chrsitianity sin is doing something against the laws of God, in Hinduism it is an action that is judged to be similar to the views held by Jews and Christians, except that it brings negative consequences, making it difficult to climb the karmic ladder. In Buddhism, where there is no deity — although in places like Nepal Hinduism and Buddhism are mixed and Buddhists worship deities —\nthere is no sin, what is there is simply wrongdoing, generally linked to desire, about which the Buddha warned. In this religion there is also no soul, just karmic matter. I also know of one Spiritualist religion where there is not only no sin, there is also nothing called “fault”. There are good and evil entities that live inside people and decide the behaviour.\nIt might interest you to know that there are consciousness studies being conducted by scientists which are leading them to believe that we humans are like puppets, like robots. What they say is that it is possible that we really do not make any decisions, these are made by the unconscious even before the matter reaches full consciousness.\nLest I be misunderstood, this second paragraph is just for your information.\nBest.\n\n","date":"September 24, 2015 at 6:08 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211112","author":"Louis","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"Thank you Louis.\nBut Jesus tells us “Spirit is willing but flesh is weak”\n\n","date":"September 24, 2015 at 6:38 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211116","author":"Sampath Fernando","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"Not really the right approach, Matthew, if I may say so. I’m afraid that a similar conversation with me may have ended the same way. If you have the opportunity to question Bart Ehrmann or someone similar again, might I suggest the following?\nFirstly, do not assume that non-authenticists have not read the scientific arguments thoroughly. In my experience they not only have, but have done so rather more thoroughly than most authenticists. \nSecondly, do not assume that people on either side of the authenticism debate necessarily accept all the evidence that supports their point of view, or rejects all the evidence against it. Your first two examples are a case in point, as they had contradictory opinions on some points, so it would be illogical to agree with both.\nThirdly, know your subject yourself, and do not expect the names of others, however eminent, to clear a path for you.\nFourthly, be very specific. Scholars like to check detail. If you had explained exactly how you knew that the Shroud had covered a body, or how you knew that the red marks were blood, Dr Ermann might have been more responsive – as I might myself, in similar circumstances.\nGood luck!\n\n","date":"September 23, 2015 at 9:28 am","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-210989","author":"Hugh Farey","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"Fourthly, be very specific. Scholars like to check detail. If you had explained exactly how you knew that the Shroud had covered a body, or how you knew that the red marks were blood, Dr Ermann might have been more responsive – as I might myself, in similar circumstances.\nHugh, I suppose you would be much more responsive than Ehrmann -because I suppose his knowledge on the Shroud is likely null. Like most other “authorities” in biblical (or similar) scholarship.\nThat’s how this field looks like.\n\n","date":"September 23, 2015 at 10:17 am","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-210992","author":"O.K.","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"The new Catechism of the Catholic Church asserts:\nIn sum, God created the devil as good, God punished him for his sin and God allows his present activity. The Catechism admits, “It is a great mystery that providence should permit diabolical activity, but ‘we know that in everything God works for the good with those who love Him” (No. 395).\nso greater minds than are present on the board wrestle with this question\n\n","date":"September 24, 2015 at 9:15 am","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211064","author":"rick","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"For some of us, the devil is in the detail. Charles Freeman please note…\n\n","date":"September 24, 2015 at 9:19 am","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211066","author":"Colin Berry","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"Noted Colin’s  belief that personal attacks take knowledge further.\n\n","date":"September 24, 2015 at 3:15 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211095","author":"Charles Freeman","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"Hi Mr. Russ Breault and Mr. Simon Brown.\nThan you very much for that interveiw.\nThis my understanding about the burial procedure.\nAccording to Gospels of Matthew, Mark and Luke, Joseph of Arimathaea and Nicodemus wrapped the body of Jesus with a clean linen cloth and Mary Magdalene and Mary the mother of Joses and also other women which came with him from Galilee were there. Furthermore those Gospels do not tell anything about applying spices.\nBut John who was not at the tomb tell us that Joseph of Arimathaea and Nicodemus wound the body of Jesus with the spices.\nFurthermore Gospels Matthew, Mark and Luke tell us that these ladies came to tomb at the end of the Sabbath (at dawn) with spices to anoint the body.\nI think John who was not at the tomb on Friday evening assumed that Joseph of Arimathaea and Nicodemus anoint the body of Jesus spices and wound the body of Jesus with linen clothes. Contrast to the other synoptic gospels John does not tell that women went to tomb to anoint the body with spices.\nSo what did John see at the tomb on the Sunday morning? He saw the face cloth, he saw the linen cloth which was used to wrap the body of Jesus and also he saw the other linen clothes which was not used but intend to use on Sunday, to wrapped the body of Jesus, after anointing the body with spices.\n\n","date":"September 24, 2015 at 6:17 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211113","author":"Sampath Fernando","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"Last night I quickly re-read through Kim Dreisbach’s paper on “Lazarus and Jesus”.  He expresses some quite profound thoughts on aspects relevant to the present discussion.  If you’re unfamiliar with his paper, it is certainly worth reading.  He suggests that the story of Lazarus’ raising from the dead was planted by the evangelist John in his gospel, for a specific purpose, seemingly with some possibly secret allusions to the Shroud.  Whether his interpretation is correct or not, it carries some fascinating material.  When he wrote the paper in 2005 for the Dallas conference, Kim still accepted the Edessa hypothesis, but I thought that was about the only negative in the paper. \n“LAZARUS” & JESUS”, ‘HOW THE FOURTH GOSPEL CLEVERLY REVEALS THE SURVIVAL AND SIGNIFICANCE OF BOTH THE SHROUD (SINDON) AND THE OVIEDO CLOTH (aka THE SOUDARION ) WHILE “SECRETLY” MAINTAINING THEIR RESPECTIVE MESSAGES’  “A Comparison of Jesus’ burial shroud in John 20:7 (i.e. one among the othonia) & testifying to His Resurrection and the face cloth of “Lazarus” (soudarion aka the Oviedo Cloth ) in John 11 – a didactic narrative in which the latter serves as a “spy clue” guaranteeing their own resurrection to members of the primitive Church. ” \nBy The Rev. Albert R. Dreisbach, jr., 2005\nhttp://shroudstory.files.wordpress.com/2012/03/dallasdreisbach.pdf\n\n","date":"September 29, 2015 at 2:32 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211506","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"I didn’t read the whole thing, but it seems to me like she is a proponent of the Thomas de Wesselow theory for the Turin Shroud, and the Resurrection which always makes me roll my eyes. Pretty interesting though, and why do you say her accepting the image of edessa hypothesis is a negative?\n\n","date":"September 30, 2015 at 2:25 am","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211538","author":"Matthew L.","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"Matthew, The Rev Albert (Kim) Dreisbach was a dedicated Sindonologist, founding the “Atlanta International Centre for the Continuing Study of the Shroud of Turin”.  Several of his papers are on Barrie’s shroud.com website.  He died on April 29, 2006, and was clearly regarded with deep affection by all who knew him.  An Episcopalian minister, theologian and biblical scholar, his papers reflect a deeply religious and spiritual approach, and he saw  implications in it for ecumenism and even for healing.  It’s worth going to the shroud.com site, search on “Dreisbach”, and you are bound to see something that will interest you.  At the time that he wrote, Ian Wilson’s Mandylion theory was still popular among many sindonologists, but that is now no longer the case.  A few yet adhere to it, but I think many no longer do so, as there are now better reconstructions.  I believe that the Mandylion was not the Shroud, but think it possible that the Shroud served as its template.\n\n","date":"September 30, 2015 at 4:46 am","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211546","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"Oh okay thanks, but what about the coins and pantocrators from the Byzantine era in like the 6th centuries? Maybe they are still based on the shroud, but more based on the Mandylion which was based on the shroud. Also, what about the Shroud in Constantinople? That wasn’t the Turin Shroud? I have spent most of my time on the forensics when it comes to the Shroud of Turin.\n\n","date":"September 30, 2015 at 1:01 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211568","author":"Matthew L.","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"*6th century\n\n","date":"September 30, 2015 at 1:02 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211569","author":"Matthew L.","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"Yes, they are still.\nAnd Mandylion theory is still the best explanation for the Shroud whereabouts before 1200s -although needs some modifications -no matter what uncritical fans of storyteller Markwardt think.\nBut we will discuss this other time, as this is long story.\nYou can still rely on Wilson -at least in the main outlines.\n\n","date":"September 30, 2015 at 1:13 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211570","author":"O.K.","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"I had the opportunity to meet and interview Ian Wilson for a leading daily. We had a very frank discussion about the Shroud and the Jospice Mattress Imprint. I still support his views, which can be found in his last Shroud book, which I recommend without hesitation.\n\n","date":"September 30, 2015 at 2:10 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211575","author":"Louis","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"Matthew:  The St Catherine’s Pantocrator dates to the 6th century, was likely commissioned by Justinian II who founded the monastery, and includes the upper body as does the Homs vase image and the Justinian II solidus.  All three have a striking resemblance to the Shroud image.  There are various references to a full body image, the “Image of God Incarnate” around this time, so it was known to the Byzantines.  By contrast, copies of the Mandylion only ever show a disembodied head, and the fatal flaw in Wilson’s theory is that the Mandylion’s supposed concealed image of the body was not known until after its arrival in Constantinople in 945.  \nThe Image of Camuliana was taken to Constantinople in 572 AD, and became the basis of military labara, and became known as the “Image of God Incarnate”.  Some have attempted to identify it with the Veronica or the Veil of Manoppello, but I’ve never seen any convincing argument for this.  Others have suggested it did not survive the iconoclasm periods.  The most likely explanation, due to Markwardt is that it was hidden away following a series of continuous earthquakes in 740, after which the earthquakes ceased.  The re-enactments of Christ’s resurrection in the Pharos chapel are reported in 1201, and so it is evident that the covenant of concealment had then been broken under Alexios III.  \nO.K may be curtly dismissive of Markwardt’s thesis, if it so suits him.  A note I have from Jack Markwardt includes the following observation:  “Curiously, however, neither Ian Wilson, nor any advocate of his ideas, nor any skeptic or critic of his Mandylion theory ( e.g., Andrea Nicolotti, Charles Freeman), nor, for that matter, any crazy blogger has,to the best of my knowledge, pointed out even a single historical error or flaw in reasoning regarding my detailed and lengthy St. Louis paper. “\n\n","date":"September 30, 2015 at 3:08 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211578","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"“Curiously, however, neither Ian Wilson, nor any advocate of his ideas, nor any skeptic or critic of his Mandylion theory ( e.g., Andrea Nicolotti, Charles Freeman), nor, for that matter, any crazy blogger has,to the best of my knowledge, pointed out even a single historical error or flaw in reasoning regarding my detailed and lengthy St. Louis paper. “\nPerhaps because it is too lenghty, and no one has time for that.\nWhat can I say now is that for example Markwardt borrows heavily on Pfeiffer ideas, but somehow he is restrained to analyse Pfeiffer’s main idea…\nMore another time.\n\n","date":"September 30, 2015 at 3:39 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211579","author":"O.K.","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"No reply button on your newest post so i’ll respond to this….\nThis was a helpful post. I had the impression that the Christ Pantocrators and coins etc. and their connection to the Shroud depended on the Image of Edessa, but your post seems to be saying there could have been a completely different cloth that is responsible for the Pantocrators, and coins. \nFor the Mandylion and it just being a face isn’t there an explanation for that? Wasn’t the Turin Shroud folded so just the face was visible? There does seem to be obvious folds on the turin shroud, and it can be folded in such a way to look like the Mandylion.\n\n","date":"September 30, 2015 at 4:12 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211583","author":"Matthew L.","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"For the Mandylion and it just being a face isn’t there an explanation for that? Wasn’t the Turin Shroud folded so just the face was visible? There does seem to be obvious folds on the turin shroud, and it can be folded in such a way to look like the Mandylion.\nYes, that’s Wilson idea. Fairly resistant to criticism (which usually try to conceal this idea, which makes any assertions that Mandylion was merely a face cloth irrelevant).\nBut the matter is far more complex, since you have several candidates for Mandylion (and the usually assumed idea, that Mandylion was just a single object, is just an assumption..).\nAnd you have to justify why the Shroud was folded in this way.\nAnd the matter of folds is also much more complex (here you have the article http://www.shroud.com/pdfs/ssi11part4.pdf ) as they alone do not prove anything yet.\n\n","date":"September 30, 2015 at 4:20 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211584","author":"O.K.","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"For anyone who might be inclined to pursue Markwardt’s challenge to “point out even a single historical error or flaw in reasoning” his paper can be found at:\nhttp://www.shroud.com/pdfs/stlmarkwardtpaper.pdf .\n\n","date":"September 30, 2015 at 5:05 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211587","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"There is no need to use me as a refuter of Wilson’s theory as far more distinguished scholars have rubbished it. In fact, when I had my article checked by one of the Byaantine scholars mentioned, I was asked why I bothered to respond to someone who had absolutely no academic qualifications in this field. Wilson admits that he cannot even read Byzantine Greek.\nMarkwardt’s thesis rests on. ‘an awesome icon’ he finds referred to in Antioch. By this period icons of Christ were quite common so there is no reason what this particular  one should have anything to do with the Shroud. In fact it would be very unlikely. As it was not until the eighth century that Christ was ever shown dead so this ‘awesome icon’, like the Image of Edessa, would be of Christ when alive.  So the basic plank in Markwardt’s theory collapses.\nAs many authenticists are only interested in the Shroud, they fail to recognise that images of Christ were common, in the Roman catacombs from c. 250, with the first bearded Christ’s recorded in Rome in about 300 and then in the east the images of Chirst in the Dura- Europus church of c. 240 ( assumed by some experts to be the earliest representations of all). If whenever an image of Christ is mentioned it is assumed to be the Shroud then we would have fifty or sixty alternative histories!\nWhy not start with some of the ones in Rome- you can easily construct a history in which Peter takes the Shroud with him to Rome and that is why the first images of the bearded Christ are seen there!! Even more so as we know that many relics from Rome were taken up to France. One can reconstruct any number of imaginary journeys for the Shroud if all you need to start with is ‘an awesome icon of Christ’.\n\n","date":"October 1, 2015 at 7:31 am","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211618","author":"Charles Freeman","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"In the interview with Professor Heinrich Pfeiffer, SJ he says that the preaching of the Eastern Church was changed when the Image of Edessa arrived in Constantinople. That means the folded, face-only Image of Edessa was revealed as the Turin Shroud when the relic arrived in Constantinople.\nThe fairly recent discovery of the Jesus mosaic in Sanliurfa ( ancient Edessa) makes the story convincing:\nhttps://www.academia.edu/14795646/An_interview_with_Professor_Heinrich_Pfeiffer_SJ\nDid the KnightsTemplar posess the relic after 1204? It is is possibility and I am working on another article that will go further than the one published in February, 2003, when the “Chinon Parchment” was found. The 2003 article is also on Joe Marino’s page on homestead.com:\nhttps://www.academia.edu/16338005/Shroud_Studies_bring_Good_News_-_February_2003\n\n","date":"October 1, 2015 at 9:06 am","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211619","author":"Louis","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"Well, you did ask…..\nThere is nothing like the phrase “The only possible logical conclusion…” to make me feel that almost certainly the author is stabbing wildly in the dark. ( ‘Fact’ spelt with capital letters and followed by exclamation marks has a similar effect. So does ‘proof’.)\nA logical conclusion is meaningless unless the assumptions upon which is based have some evidence to support them. If birds had gills, a logical conclusion would be that they could live underwater. But they don’t. In this case the assumption is that St Peter took the Shroud to Antioch in about 30AD, but there is not a shred of evidence to support this, and the merest circumstantial evidence to suggest that anything resembling the Shroud was ever there at all. In that case, “The only possible logical conclusion is that Ephraemius left Antioch in order to take the awesome image of Jesus to a safe haven…” is no more than a logical fantasy.\nAs for “Curiously, however, neither Ian Wilson, nor any advocate of his ideas, nor any skeptic or critic of his Mandylion theory ( e.g., Andrea Nicolotti, Charles Freeman), nor, for that matter, any crazy blogger has,to the best of my knowledge, pointed out even a single historical error or flaw in reasoning regarding my detailed and lengthy St. Louis paper. “ Well, I’m not surprised. There’s nothing wrong with the story of Little Red Riding Hood either – assuming wolves can talk…\n\n","date":"October 1, 2015 at 9:41 am","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211621","author":"Hugh Farey","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"Thank you Louis. \nQuestion to Historians – Which one came first?  Jesus mosaic in Sanliurfa ( ancient Edessa) or the Shroud of Turin?\n\n","date":"October 1, 2015 at 5:09 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211629","author":"Sampath Fernando","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"Hi Sampath\nIt is likely that the mosaic was based on the Image of Edessa. The city had a thriving Christian community, which was destroyed after the islamic invasion. Recent excavations have also uncovered churches and perhaps something more will be found.\n\n","date":"October 1, 2015 at 5:29 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211634","author":"Louis","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"For anyone who might be inclined to pursue Markwardt’s challenge to “point out even a single historical error or flaw in reasoning” his paper can be found at:\nhttp://www.shroud.com/pdfs/stlmarkwardtpaper.pdf \nOne thing, Daveb.\nMarkwardt certainly had read my posting “Wilson & Shroudies vs. Academia” on this blog https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/ where I gave several arguments for the Mandylion brought to Constantinople in 944 AD being the same cloth as the Shroud of Turin (see his footnote 58).\nMarkwardt ignored all of those (like many others), instead quoting from it only Charles Freeman’s tendentious comment. \nSo much for Markwardt’s honest and unbiased approach.\n\n","date":"September 30, 2015 at 5:54 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211593","author":"O.K.","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"I think you should be satisfied that your shroudstory posting was referenced at all, and even if your own expression of Scavone’s arguments were not specifically addressed, Markwardt dealt with the arguments in other ways in his Mandylion section as he had bigger fish to cook with.  It is known that there was some little debate about the Mandylion theory between Markwardt and Scavone at the St Louis conference, which Markwardt apparently considers was congenial and not at all hostile.\n\n","date":"September 30, 2015 at 10:03 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211603","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"Bearing in mind the large number of different images of Christ from the third century onwards, some of which achieved scared status, we would need to find one that is unequivocally a double image of the dead Christ to be able to even start reconstructing a pre-medieval past for the Shroud.\nAs, for various theological reasons, early Christians were reluctant to show Christ as dead, we have no representation of him, even on the Cross, as dead before the eighth century crucifixion image from St.Catherine’s Sinai,\nFor us historians, no references, no evidence, all that is left is speculation. Just don’t start with assuming that ‘An awesome icon’ of Christ in Antioch has anything to do with the Shroud. Why should it? Certainly Markwardt provides no evidence to suggest that it might be so why take anything that follows from this speculation seriously?\nI have recently been consulted over a proposed TV programme on the Holy Grail, the producer of which made the similar mistake of thinking any early cup mentioned must be the real thing!  So far there are two hundred contending cups!\n\n","date":"October 2, 2015 at 2:04 am","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211648","author":"Charles Freeman","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"The English Jesuit scholar Herbert Thurston wrote about a vessel preserved as the cup used at the Last Super at the Church of the Holy Sepulchre during the seventh century. The Spaniards believe that the cup preserved in Valencia is the true one:\nhttp://www.catedraldevalencia.es\nBut according to the late Father Jerome Murphy-O’Connor Jesus used  a clay cup like the ones that the Essenes made in Qumran.\nSee the “communal cups” on sale at amazon.com\n\n","date":"October 2, 2015 at 6:25 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211671","author":"Louis","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"I exchanged some views with good Father Albert “Kim” Dreisbach and it was he who encourged me to write about C. G. Jung. However, he made a serious mistake when judging gospel genre and by writing about the Shroud and its display at the cenacle. That would be tantamount to confusing resurrection and burial cloth, as Thomas de Wesselow did:\nhttps://www.academia.edu/10819998/Book_Review_The_Sign_by_Thomas_de_Wesselow\nThe post- Easter appearances were more important.\nJohn did not “plant” anything in the gospel and to believe that would be mean also giving credibility to the post-Enlightenment understanding of historical facts, with Hume and the rest. It is radical prejudice. If there is no accurate content there can be no distinction between ancient historiography and novels.The gospels are distinctive among “bioi”.\nFurther, John does not show sheer literary dependence, and in that sense it would be him against Matthew, Mark and Luke in the sense that he demonstrates knowledge of earlier tradition.\n\n","date":"September 30, 2015 at 9:20 am","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211554","author":"Louis","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"Very interesting article Daveb. Thank you.\n\n","date":"September 29, 2015 at 8:11 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211520","author":"Sampath Fernando","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"I note that as at the present time, none of the comments above point out “a single historical error nor any flaw in reasoning” in Markwardt’s St Louis paper, but merely consider it a little too speculative.   \nThere is rather more substance to Markwardt’s argument for Peter taking the Shroud to Antioch, than it merely being an “awesome icon”.  One also needs to refer to his 1999 and 2008 (Ohio) papers as well.  He refers there to written accounts which assert that the Shroud was given to Peter, he was the first bishop of Antioch and so that he took it Antioch seems a fair inference.  His 2008 paper expands on this, and although various church treasures were allowed to be confiscated by Julian the Apostate, the icon was concealed to be rediscovered at a later time.  In a similar way, when Antioch was besieged by Persian Chosroes, most of the church treasures were allowed to be pillaged, but Ephraim its warrior-bishop set out on a special mission to Anatolia and was allowed to be reinstalled on his return, so his abandonment of the city was not seen as an act of cowardice. \nSoon afterwards, the Image of Camuliana was discovered and paraded around Anatolia by Byzantine priests and then taken to Constantinople.  It is the very first image which was attributed to be “acheropoeitos”, not made by human hands.  It became the template for military labara, and subsequently there are references to a full-body image by various emperors and others in Constantinople well prior to the arrival of the Mandylion there in 945.  It is a reasonable inference that this was the icon that Ephraim had taken to Anatolia, but dying before he could retrieve it. \nContrariwise the only argument that Peter may have taken the Shroud to Rome, or that it subsequently found its way to France during the first millenium, are the third century Shroud-like images in the catacombs, which might merely indicate some known acquaintance with its likeness, and flagellation scenes such as in the Carolingian Stuttgart Psalter.  There is no dovcumentary evidence, not even a myth or a legend concerning a mysterious image in Rome or elsewhere, except the later Veronica images of a Byzantine provenance. \nThere is rather more to the story of Ms Hood than appears at first sight.  It is known that wolves roamed the Black Forest in medieval times, that they sometimes ate grandmothers and little girls, and that various woodsmen there might sometimes rescue them.  As for “talking wolves” certain Pharisees were once described as “wolves in sheep’s clothing” could clearly talk, and some of them no doubt indulged in cross-dressing.  The story is a factual archetype, and if Markwardt’s paper is to be likened to a fairy story, then a better tale is needed for an analogy.  Better to stick with test tubes and spectrographs!\n\n","date":"October 1, 2015 at 5:17 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211630","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"I note that as at the present time, none of the comments above point out “a single historical error nor any flaw in reasoning” in Markwardt’s St Louis paper, but merely consider it a little too speculative. \nAnd this is a flaw in Markwardt’s paper (not only this). It is too speculative.\nWhile some speculations about Shroud history before 1350s are necessary, due to the lack of sources (so we must fill gaps with hypotheses), basing everything on merely speculations is a fairy tale, or novel writing. How many hard facts are there in Markwardt’s paper? How many hard facts relevant to the Shroud (or any of its previous incarnations)? And how much of the story comes merely from Markwardt’s imagination? \nI don’t claim that Markwardt’s scenario is impossible. Simply there is no hard enough evidence for this. And I think he selects facts which suit him, while ignoring others pointing elsewhere, most likely to the classic Mandylion theory (as I have shown here https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/ ).\nI am under impression that Markwardt rejected classical Mandylion theory merely for the purpose of pleasing academic community, who looks on the Shroud (and its links with Mandylion) with disguise. But for the purpose in vain, I think. No matter what, the concrete will never look favorably to the Shroud.\n\n","date":"October 1, 2015 at 5:49 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211635","author":"O.K.","site":"shroudstory"},{"title":"Recent Interview with Russ Breault","post":"Your loyalty to Wilson’s Mandylion theory might be thought admirable by some classic authenticists, as it is still their favourite explanation, but I believe is now past its “use by” date.  Not only is the Mandylion theory much more speculative than the Markwardt explanation, but the flaws in it have now been laid bare.  A full body image was clearly known to the Byzantines well before the Mandylion arrived in Constantinople and an alternative explanation must therefore be sought.  The Image of Camuliana is a prime candidate for that.  You ask questions, but the answers can clearly be found in his paper, and to me they are positive.  No historical error and no flaw in reasoning, and certainly not a novel, but a coherent explanation which covers all the bases!\n\n","date":"October 1, 2015 at 7:49 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","id":"comment-211642","author":"daveb of wellington nz","site":"shroudstory"}]
