[{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"I agree that the Holy Shroud is a reason to believe in Jesus. However, the authenticity of the Shroud is not. Two books have been recently written by atheists using the authenticity of the Shroud to explain the Resurrection. The best explanation  is that the Holy Shroud was created by Gnostics in the 1st or 2nd century using a crucified victim and methods that have been lost to history. \nThere were also two scientific mistakes. 1) The body image does not appear only on one side of the cloth. Computer enhancement reveals a faint image on the other side. 2) There are two theories of what caused the discoloration of the fibrils. One is that the cellulose was oxidized, and the other is that the discoloration is caused by sugar and starch on the outer surface of the cloth.\n\n","date":"February 8, 2014 at 10:09 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77482","author":"David Roemer","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"Beautiful presentation, really enjoyed it. The “Receipt” concept is something I never really thought about before. Thanks Russ.\n\n","date":"February 8, 2014 at 11:12 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77495","author":"Mike M","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"David, the evidence for the image appearing faintly on the other side of the cloth is not well accepted.  It is very hard to discern, if at all.  And as Dan always points out, our mind is prone to play tricks on us causing us to “see” what is really not there.  However, if the image on the reverse side is really there, it is not because any substance soaked through to the other side as with the blood and water stains.  In fact it would lend support to Jackson’s collapse theory.\n\n","date":"February 8, 2014 at 1:52 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77518","author":"Russ Breault","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"What I would love to do is give my presentation of the Shroud of Turin (http://www.holyshroud.info) with you present to defend your ideas about the Holy Shroud and the way you present the relic. I just has a conversation with the chief of staff of the Vicar General of the New York Diocese. I mentioned your name and suggested that you be invited to any presentation that I give.\n\n","date":"February 8, 2014 at 5:43 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77560","author":"David Roemer","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"There is no full image on the other side of the Shroud, only what appears to be some faint signs of the face,as the paper published by Professors Fanti and Maggiolo demonstrate. Fanti said that this faint image is like an echo, and that the corona discharge hypothesis he defends provides the best explanation, in fact is the only explanation.\nUnfortunately while Turin rejected Fanti’s paper he, like others, was not granted access to the almost 2000 microphotographs of the Shroud, which he had requested to see in order to confirm his hypothesis. He was challenged verbally by Professor Bruno Barberis, but demanded a response in the form of a paper, which did not appear. My guess is that this year there should be further progress in this hypothesis.\nOne wonders what the gnostics would gain by crucifying someone to create the Shroud image in the first or second centuries AD. What would the intention be? Would it have something to do with docetism?There were many gnostic groups and they did not agree with each other. This story cannot be taken seriously.\n\n","date":"February 8, 2014 at 5:24 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77550","author":"Louis","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"The Gnostics were Christians. They believed that Jesus was sent by the true God in the disguise of a human to fool the Demiurge and archons that created and ruled Earth. While on Earth, Jesus gave humans knowledge that would enable them to avoid reincarnation and be re-united to the true God. The theory that Gnostics created the Shroud must be taken seriously because there is no other explanation for it. There is no need to come up with an explanation for the Resurrection because it is an historical event. But reason demands coming up with an explanation for an artifact.\n\n","date":"February 8, 2014 at 5:56 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77566","author":"David Roemer","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"Not all gnostics were inclined toward Christianity and I can say that with certainty because years ago an article I wrote to contest a Shroudie who had unnecessarily brought a gnostic group into the field of Shroud studies was appreciated by some top Shroudies, praised by one of the ten top New Testament scholars in the United States, posted on a website for Biblical Studies in Europe at their request, and, lastly, even uploaded by the online library of an apostolic church (without my permission).\nI didn’t quite understand what you said in #4. Will you be telling the parishioners in the New York Archdiocese that the Shroud is a gnostic creation?\n\n","date":"February 8, 2014 at 6:34 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77573","author":"Louis","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"I explain in #6 what I’ll be telling New Yorker’s if I am invited to give a presentation. I have a letter from Cardinal Dolan saying that I was “debunking” the Holy Shroud. I think the archdiocese has a duty to listen to my explanation of the science, theology, and history of the Shroud.\n\n","date":"February 8, 2014 at 7:06 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77582","author":"David Roemer","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"So did Cardinal Timothy Dolan like your “debunking” or not? I believe he didn’t, whatever his views of the relic may be. You of course have the right to make your presentations wherever people are willing to listen, but I don’t see why the New York Archdiocese is obliged to host your presentation.\n\n","date":"February 8, 2014 at 7:14 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77584","author":"Louis","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"The Holy Shroud is an official relic, and making misleading historical and scientific statements about it is dishonoring  the relic. For example, not mentioning that the blood marks are not smeared and hence a work of an artist is misleading.\n\n","date":"February 8, 2014 at 8:30 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77595","author":"David Roemer","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"There’s something wrong here because you are saying that the gnostics created the Shroud and yet you call it “Holy Shroud”. There is no need to go into the history of gnosticism to answer this.\n\n","date":"February 9, 2014 at 10:11 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77758","author":"Louis","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"What difference does it make whether the image was produced by natural means in the tomb, supernatural means in the tomb, or by a Gnostic craftsman using methods that have been lost to history. I agree that if someone could figure out how the Gnostic did it, it would be one less reason to believe in Jesus.\n\n","date":"February 9, 2014 at 11:46 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77778","author":"David Roemer","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"David, your website makes clear that the term “debunking” was not that of Cardinal Dolan but Jeff Mirus, of Trinity Communications. Mirus made the point that some people who are firmly committed to the authenticity of the shroud are not interested in theories that it is not authentic, and Cardinal Dolan agreed with him. Unfortunate, perhaps, but it is not a crime to have a fixed opinion, nor, given that the Catholic Church has no official opinion, a sin. Nor is there any moral or legal obligation for authenticists to listen to contrary opinions if they don’t want to.\nYou must not be disheartened by this attitude, nor feel that you labour in vain. If you have any evidence that “the theory that Gnostics created the Shroud must be taken seriously because there is no other explanation for it,” then why not present it here? Although most of this blog’s followers are believers in the shroud’s authenticity, they are on the whole prepared to listen to and discuss all sorts of contrary opinions, some of them quite eccentric, provided they are supported by evidence, or at least references.\nThe term “Gnosticism” seems to cover a very wide variety of ideas in a wide variety of contexts. It would be interesting to know a bit more specifically the who, when and where of your idea that Gnostics created the Shroud. The only evidence I can find on your website is a quotation from St Irenaeus’s book “Against Heresies” (Book 1:Ch 25), which is interesting, but far from conclusive. Is there more?\n\n","date":"February 8, 2014 at 8:28 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77594","author":"Hugh Farey","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"The evidence that the Shroud was created by Gnostics is that the blood marks are not smeared and the body image is a true detailed image, like a charcoal painting. Also, there is evidence that a lot of Gnostics lived in Edessa.\n\n","date":"February 8, 2014 at 8:35 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77598","author":"David Roemer","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"Have you attempted to reproduce the Shroud with charcoal or other such materials? Do we have precedent in Gnosticism for this kind of craftsmanship?\n\n","date":"February 8, 2014 at 9:57 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77616","author":"David Goulet","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"No. The methods used by the Gnostics have been lost to history. There is no other explanation for the Shroud. For the Resurrection of Jesus there is no explanation at all. The faith response to the Resurrection of Jesus is to believe that Jesus is alive in a new life with God. One of the reasons to believe Jesus is alive is the Shroud. It is a sign, or a reason to believe.\n\n","date":"February 9, 2014 at 1:50 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77656","author":"David Roemer","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"Thank you. Forgive us if we try to explore further.\n1) What evidence is there that there were Gnostics in Edessa, and when were they there? Do we know anything about them? St Irenaeus’s book Against Heresies was written in France, and specifically aimed at Gnosticism in France rather than Turkey.\n2) Any kind of manufacturing technology, understood or lost, is not the prerogative of a particular religious group. The fact that the blood is not smeared is not evidence of Gnosticism. It is sometimes used as evidence of authenticity.\n3) The accuracy or not of the body image is still debated, and is used as evidence both for and against authenticity.\n4) Your statement “there is no other explanation for the Shroud” is surely misleading. There are dozens of other explanations. Only one of them can be correct, and they may all be wrong and you may be right, but you have not provided sufficient evidence yet to establish your hypothesis’s credibility.\n\n","date":"February 9, 2014 at 4:38 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77685","author":"Hugh Farey","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"I understand that Bardesan, a notable Gnostic lived in Edessa and some credit him with having written or influenced the writing of the “Hymn of the Pearl” which is occasionally quoted by authenticists as evidence that the body image might well have been known as early as the second century.  Markwardt for instance has argued on this basis that Bardesan had seen the full body image at the court of Edessa!\n\n","date":"February 9, 2014 at 5:21 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77699","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"In my mind, the theory of Robert Drews (Gnostics did it) is the only explanation supported by evidence. There is no evidence it was produced in the middle ages by an unknown artist. The theory that it was in contact with Jesus conflicts with the evidence that it is a work of human ingenuity.\n\n","date":"February 9, 2014 at 11:24 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77771","author":"David Roemer","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"Bardesanes: born July 11, 154, Edessa, Syria, [now Urfa, Tur.]\ndied c. 222, , Edessa; Also called  Bardaisan, or Bar Daiṣān  a leading representative of Syrian Gnosticism. Bardesanes was a pioneer of the Christian faith in Syria who embarked on missionary work after his conversion in 179.\nHis chief writing, The Dialogue of Destiny, or The Book of the Laws of the Countries, recorded by a disciple, Philip, is the oldest known original composition in Syriac literature. Bardesanes attacked the fatalism of the Greek philosophers after Aristotle (4th century BC), particularly regarding the influence of the stars on human destiny. Mingling Christian influence with Gnostic teaching, he denied the creation of the world, of Satan, and of evil by the supreme God, attributing them to a hierarchy of deities.\nAided by his son Harmonius, Bardesanes wrote many of the first Syriac hymns to popularize his teachings. Their literary value earned for him renown in the history of Syriac poetry and music.\nOf the “Hymn of the Pearl” Markwardt writes: “Bardaisan (154-222), a Gnostic Christian, a philosopher, and the composer of numerous Syriac psalms, was born of nobility at Edessa. According to tradition, he attended school, as a youth, with the future Abgar the Great,and Segal concludes that ―certainly he frequented the court of Edessa. As the king’s life-long friend and a frequent visitor to his royal court, Bardaisan would certainly have viewed the Portrait of Edessa, perhaps when it was first presented to Abgar, and certainly after it had been placed in one of the royal palaces, and he is, no doubt, the source of the several obvious metaphorical allusions to the Shroud which appear in the Hymn of the Pearl.”\nHowever, the idea that some Gnostic artisan was able to create the Shroud image by some unknown means is utterly speculative and can have no supporting argument except speculation. There is only one case of a crucifixion victim being crowned with thorns, the random act of a Roman soldier with a perverse sense of humour. For any such Gnostic artisan to create the image from a crucifixion victim he would have to find another who had been so-crowned. The image itself contributes nothing to Gnostic argument, but on the contrary reinforces orthodox Christian belief. If the “Hymn of the Pearl” is intended to refer to the Shroud image, it is remarkable that one such as Bardesan was able to put it to such good purpose.\n\n","date":"February 9, 2014 at 6:19 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77712","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"My rudimentary understanding of Gnosticism was that they rejected the belief that Jesus came in the flesh because they considered the physical world to be evil.  That would have made Jesus evil too.  Consequently they believe that he only came in spirit thus denying the incarnation.  It seems that John wrote the book of First John to expressly confront some of these early Gnostic views.  So why in the world would a Gnostic artist create a burial shroud with the image of a crucified man when that only seems to confirm that Jesus did indeed come in the flesh.  I further believe that early iconographic representations of Jesus whether independent or based on the Shroud itself such as the Sinai Icon, were meant to be clear statements that Jesus did indeed come in the flesh…and here is a picture.\n\n","date":"February 9, 2014 at 9:42 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77753","author":"Russ Breault","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"Good observation, Russ. I would think the Gnostics them would have created an image of Christ alive — eyes open — making the statement that you can kill flesh, not spirit.\n\n","date":"February 9, 2014 at 11:19 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77768","author":"David Goulet","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"According to Wikipedia, some Gnostics believed Jesus was sent by the true God. Others thought he was a “false messiah.” The Gnostics who were against Jesus certainly did not go to the trouble of crucifying someone and using the body somehow to create the image. \nThere are two kinds of knowledge: faith and reason. In reasons we know something is true because we can see the truth of it. In faith, we know something is true because God is telling us. It is both a decision and a gift from God. When you argue that the Shroud is authentic, you are confusing faith with reason.\n\n","date":"February 9, 2014 at 11:35 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77774","author":"David Roemer","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"Monophysitism and Miaphysitism are issues well alive today, generally hidden beneath the surface, as not every church accepted the Council of Chalcedon. That is because gnosticism is an issue much more deeper than most people think, it was the cause of an argument between Jung and Buber.\n\n","date":"February 9, 2014 at 11:46 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77777","author":"Louis","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"#12 : David Roemer: “What difference does it make whether the image was produced by natural means in the tomb, supernatural means in the tomb, or by a Gnostic craftsman using methods that have been lost to history. I agree that if someone could figure out how the Gnostic did it, it would be one less reason to believe in Jesus.”\nThere are contradictions here. It doesn’t seem that the gnostics created the relic, and even if they did why would it be one less reason to believe in Jesus? It is evident that there is more than one doubting Thomas over here, basing belief in the authenticity of the Shroud to believe in the Resurrection, but that is not the position of the Catholic Church. The relic can be a prop, but it is certainly not a foundation for faith in Jesus.\n\n","date":"February 9, 2014 at 12:25 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77785","author":"Louis","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"It’s amazing how skeptics of the authenticity of the Shroud can advance speculation as fact. There is no known  method of reproducing the image on the Shroud, therefore it is proven that unknown Gnostic artists using unknown methods must have done it.\nI have to amend my usual suspects of history list and add Gnostics to the Templars, Jacques deMolay and Leonardo da Vinci. Leonardo not only created the world’s first photograph for the Shroud, he photo-shopped his face unto it. I read it in a book and saw it on a video. You want any further proof than that???? If I am not mistaken the claim has also been made that it is proven his was face on the Mona Lisa. You, or at least I, can not make this stuff up.\n\n","date":"February 9, 2014 at 12:25 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77786","author":"John Klotz","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"A “speculation” is a theory without evidence. A “fact” is a theory with a lot of evidence. It is a fact that the Shroud was created by Christians in the 1st or 2nd century. It is speculation to say, as the atheist Thomas de Wesselow says, the Shroud was the burial cloth of Jesus.\n\n","date":"February 9, 2014 at 1:04 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77798","author":"David Roemer","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"David:\nYou haven’t given any evidence to any of your claims. You claim as facts that are closer to fantasies than anything. If the shroud was an artifact of the Gnostics or the Vikings or aliens…. What is your evidence for that? How did they do it? Why would they do it? I can’t believe you keep beating around the bush and never addressing the elephant in the room here. Everyone is asking you for anything to substantiate your claims, you have given none so far…\n\n","date":"February 9, 2014 at 3:17 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77833","author":"Mike M","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"The last few comments have left me somewhat perplexed, David.\nWe scientists like to look at the evidence presented for an idea, and see if that evidence supports the idea or not. We do not want to question beliefs or convictions, only evidence. So far, you have not presented any evidence that Gnostics created the Shroud, other than St Irenaeus’s book describing an image made by Pontius Pilate. Is there more?\n\n","date":"February 9, 2014 at 1:15 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77803","author":"Hugh Farey","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"Good grief! It is certainly NOT a fact that the Shroud was created by Christians in the 1st or 2nd century. Second, a “theory” unsupported by data is nothing more than a hypothesis that may or may not have any merit.\n\n","date":"February 9, 2014 at 1:51 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77812","author":"Shroud Encounter","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"The evidence is that the blood marks  were not smeared and the image is a true image with shades of yellow, not an outline. Saying the Shroud is authentic is like saying the 3-D images of Presidents on Mount Rushmore was made by wind erosion.\n\n","date":"February 9, 2014 at 2:15 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77817","author":"David Roemer","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"I’m sorry, David, but can you not see that unsmeared blood marks and an image with no outline is not evidence of a Gnostic origin unless you can demonstrate that the Gnostics were in the habit of producing pictures with these characteristics? You may feel that unsmeared blood is evidence against the shroud being a burial cloth, but that does not make it evidence for Gnostics.\nA little earlier I asked for evidence of any Gnostics in Edessa, and daveb immediately found some. Whereas before I didn’t know if there were Gnostics in Edessa or not, now I do. That’s how evidence works. Russ Breault thinks that the Gnostics believed Jesus was wholly spiritual, and would be unlikely to forge evidence that he wasn’t. Have you any evidence about the Gnostics to suggest he may be mistaken?\nI am aware (painfully aware…) of the evidence which suggests the Shroud is authentic, and have spent years evaluating it. I am not aware of any evidence suggesting the Presidents of Mount Rushmore were produced by wind erosion. If there were any, you can rest assured that I would attempt to evaluate that too. As it stands, your last sentence is simply not true.\n\n","date":"February 9, 2014 at 2:39 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77822","author":"Hugh Farey","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"I remember reading a book about the Shroud being created by Pilate. It was by Professor Robert Drews, if I’m recalling correctly. I don’t remember his arguments for how the image was created.\n\n","date":"February 9, 2014 at 2:26 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77819","author":"Chesterbelloc","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"\nDavid Roemer :\nThe evidence is that the blood marks  were not smeared and the image is a true image with shades of yellow, not an outline. Saying the Shroud is authentic is like saying the 3-D\nimages of Presidents on Mount Rushmore was made by wind erosion.\n\nThe blood marks-I’m assuming this methodology was not lost(?)-blood was applied using a brush, cloth, or wooden applicator? Why use human blood (or perhaps you believe it isn’t, of is at least partially-a mix of human & animal blood-animal used first, human added later as a touch up)?  Not meant to be an interrogation, just curious as to your thoughts regarding the specifics of how this was done.\n\n","date":"February 9, 2014 at 2:44 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77824","author":"Kelly Kearse","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"I am not at all curious, Kelly.  David R is alone in his assertion, he is unable to cite one reputable authority who supports the idea, and he can provide no evidence.  “No blood-smearing” and “no outline” is all he can come up with, which argues more strongly for authenticity than it does for artistry. There are words for this such as ‘idee fixe’ and ‘ irrational obsession’. He is miffed as he can find no ecclesial authority to give his views an airing.  But he should not be surprised that he can find none, as his ideas have no traction.\n\n","date":"February 9, 2014 at 3:13 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77832","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"No one knows how this was done. That is why the Holy Shroud is a reason to believe in Jesus. It is a sign.\n\n","date":"February 9, 2014 at 4:34 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77852","author":"David Roemer","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"\ndaveb of wellington nz :\nI am not at all curious, Kelly.  David R is alone in his assertion, he is unable to cite one reputable authority who supports the idea, and he can provide no evidence.  “No blood-smearing” and “no outline” is all he can come up with, which argues more strongly for\nauthenticity than it does for artistry. There are words for this such as ‘idee fixe’ and ‘ irrational obsession’. He is miffed as he can find no ecclesial authority to give his views an airing.  But he should not be surprised that he can find none, as his ideas have no traction.\n\nLet’s just say I’m good friends with a man in a yellow hat…I’m inclined to agree, but I’ll hear anyone out if they bring some specifics\n\n","date":"February 9, 2014 at 3:36 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77836","author":"Kelly Kearse","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"There is something seriously wrong here, David is strangely ambivalent. He also has not answered the main question: were the gnostics he is referring to inclined toward Christianity or not, and what was the purpose in producing such an image.\n\n","date":"February 9, 2014 at 4:40 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77854","author":"Louis","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"The entry on the Shroud of Turin on the old Catholic Encylopedia was written by Thurston Davies who promoted the Pierre D’arcis memorandum hoax. This is the latest entry:\n“In short, while many unanswered questions still remain, not least that of how the images came to appear on the cloth in the first place, it is most unlikely that this object is the authentic burial shroud of Jesus.” (Shroud of Turin in the New Catholic Encyclopedia, Vol. 13, pp. 95–97, 2nd ed. Detroit: Gale, 2003.)\n\n","date":"February 9, 2014 at 4:45 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77856","author":"David Roemer","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"David R: “The entry on the Shroud of Turin on the old Catholic Encylopedia was written by Thurston Davies who promoted the Pierre D’arcis memorandum hoax.” \nI understand that the entry was written by Herbert Thurston, who with Ulysse Chevalier gave us their version of the D’Arcis memorandum.  Thurston was a well-known Jesuit Shroud skeptic.  It seems that both Thurston & Chevalier sought to follow a German trend in biblical studies, emphasising the mythic elements in the scriptures.  However Secondo Pia’s photographic negatives, and Vignon’s & Delage’s forensic analysis tended to corroborate the literal truth of the Passion story. The two worthy Churchmen therefore sought to discredit the authenticity of the Shroud by massaging the significance of the D’Arcis memorandum. It will be recalled that Pope St Pius X wrote agains the Modernist trend, which seemed to be manifest in the Thurston / Chevalier agenda. \nThurston’s & Chevalier’s conspiracy is well analysed in a paper by Jack Markwardt:  “THE CONSPIRACY AGAINST THE SHROUD”; By Jack Markwardt; 2001;\nhttp://www.shroud.com/pdfs/n55part3.pdf\n\n","date":"February 10, 2014 at 5:08 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77998","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"David, please answer my question, then we can go further.\n\n","date":"February 10, 2014 at 8:03 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-78022","author":"Louis","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"Yet, but that does not answer my question in # 38.\n\n","date":"February 9, 2014 at 5:20 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77860","author":"Louis","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"Gnostics venerated Jesus, and produced the Shroud for the same reason the gospel writers wrote about the Passion of Jesus.\n\n","date":"February 9, 2014 at 8:38 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77906","author":"David Roemer","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"Still not evidence, I’m afraid. Gnostics seem to have venerated Jesus as a God, not as a mortal, and denied his physical death and resurrection. They were unlikely to have produced an object attesting to something they denied. The Gospel writers were at pains to emphasise the physical reality of Jesus, which is why they wrote about his Passion.\nCan you try to clarify why you think Gnostics might have wanted a physical memento of Christ’s physical death?\n\n","date":"February 10, 2014 at 4:19 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77989","author":"Hugh Farey","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"I have a chapter on the Gnostics in my A New History of Early Christianity and this meant that I had to read widely, even trying to plough through translations of several of the bizarre Gnostic texts found in the Nag Hammadi library. I never came across a single reference to any kind of physical representation of Jesus and doubt whether the Gnostics, who believed that the material world was evil, would ever have expressed their beliefs in this way.(Incidentally if you come across a two programme documentary called The Bible Hunters, coming out in the UK on this 13th and 20th February on BBC 2, 9 pm, and apparently on the Smithsonian channel in the US, then you will see me being interviewed about these texts.)\nI think it is odd to say ‘there is no other explanation’ and therefore it follows that the Gnostics made it. I just don’t follow it-why them ?  I still think that so long as the Shroud is not allowed to be examined using the latest technology, its secrets are probably going to be revealed by someone working on other ancient linens in a conservation lab somewhere, who may never even have heard of the Shroud. That is often the way these so-called ‘mysteries’ are solved (as in the case of the dating of the four horses of St,Mark’s when other examples of similarly gilded copper could be dated and this knowledge was then applied back to the horses).\n\n","date":"February 10, 2014 at 4:29 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-77991","author":"Charles Freeman","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"David Roemer: forget about Catholic  Encyclopaedia, which took the debate to Thurston, Markwardt et al, they have been brought unnecessarily into this debate because you mentioned the encyclopaedia. We are talking about ancient gnosticism. like Charles above is.\n\n","date":"February 10, 2014 at 8:09 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-78025","author":"Louis","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"What follows is a quote from the 2nd century that connects the Holy Shroud with Gnostics. When atheists (not anti-Christian fanatics like de Wesselow and Locken)  look at the body image and the un-smeared blood marks they assume that the image was created by some craftsman. If you say it came from a burst of radiation when Jesus rose from the dead, they will think you are irrational and unintelligent. We have a duty to preach the gospel, not prevent people from believing. \nAgainst The Heresies, St. Irenaeus, 180 AD\nThey call themselves Gnostics and possess images, some of which are paintings, some made of other materials. They said Christ’s image was copied by Pilate at the time that Jesus lived among men. On these images the put a crown and exhibit them along with the images of the philosophers of the world, namely, with the image of Pythagoras, Plato, Aristotle, and the rest. Toward these [images] they observe other rites that are just like those of the pagans.\n\n","date":"February 10, 2014 at 8:28 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-78032","author":"David Roemer","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"That is a good quote, David but the position with Irenaeus is very complicated because one of the results from the  findings of the Nag Hammadi texts is that many people who Irenaeus labelled as Gnostics did not fit into that category at all and he seems to have  used the term for a wide variety of his rivals. This whole area is extraordinarily difficult because so few of the original texts survive ( see a programme called The Bible Hunters (!), though I have not seen it myself yet). The quote does make the point that many Gnostics saw Christ as just ONE of several philosopher figures who brought light into the darkness of the evil material world so the question of how far they were Christians in the normal sense of the word is debatable. This is a real academic minefield!!!\n\n","date":"February 10, 2014 at 1:10 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-78084","author":"Charles Freeman","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"That’s better, David, however Iranaeus appeared to have been referring to an image of Jesus as a Greek philosopher, which is what anyone could expect simply because neo-platonism was involved. Still, he made no mention of any Shroud-like image, something like what de Arcis mentioned in his letter to the Pope.\n\n","date":"February 10, 2014 at 8:57 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-78036","author":"Louis","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"Another sign, like the Shroud, was the 1960s discovery of the background microwave radiation produced when the universe began to exist 14 billion years ago. This proved that the theory of the Big Bang was true. It is a reason to believe in Jesus because Jesus was a Jewish prophet, and the Bible says God created the universe from nothing. \nThe Big Bang is not evidence that God exists. It is rather evidence that God does not exist because it is evidence that the universe is not intelligible. According to science, the hundreds of billions of galaxies each with hundreds of billions of stars was the size of a grain of salt 14 billion years ago. My guess is that people who think the Shroud is authentic think that the Big Bang is evidence of God’s existence.\n\n","date":"February 10, 2014 at 9:13 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-78039","author":"David Roemer","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"David Roemar, we have much to discuss about, later at my end. Creatio ex nihilo is not explicit in Genesis and, by the way, the Jewish atheist Gould was not against religion. He was always willing to discuss things, proposed NOMA at the Vatican, said that he could discuss philosophy in a comfortable manner with Pope John II, sang in church choirs.. In my view, although he was said to have been arrogant, he was also head and shoulders above Pinker, Dawkins, Harris as a person.\n\n","date":"February 10, 2014 at 9:24 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-78040","author":"Louis","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"Not explicit? (In the beginning, God created Heaven and Earth; In the beginning was the Word). In any case, the creation myths of all other religions involved pre-existing materials. This is one reason Jewish people are unique. The others are that they knew the right name for God (Yahweh, “I am who am”), their tribes always had prophets, not just priests and chiefs, and they wrote the first narrative histories.\nI don’t put Gould above Pinker and Dawkins. In the following quote he refers to “private beliefs about souls.” What he is saying in a dishonest way is that the human soul is not spiritual. He is smarter than Pinker et al because those clowns think the human soul is spiritual by definition.   \n“Catholics could believe whatever science determined about the evolution of the human body, so long as they accepted that, at some time of his choosing, God had infused the soul into such a creature. I also knew that I had no problem with this statement, for whatever my private beliefs about souls, science cannot touch such a subject and therefore cannot be threatened by any theological position on such a legitimately and intrinsically religious issue.” (Natural History, March 1997, 13th paragraph)\n\n","date":"February 10, 2014 at 9:56 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-78045","author":"David Roemer","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"If you read Genesis carefully you will notice that there is no explicit creatio ex nihilo, as I said, and in any case the creation story there is no longer accepted both by many theologians and scientists. John begins with the “Word”, which is God, makes no mention of creation because he is referring to the Incarnation.\nAs Wellhausen demonstrated, the JEDP theory makes sense in the study of the Pentateuch, it was even accepted by Yehezkel Kauffman. God says “we” in the beginning, because it is Elohim, not Yahweh, the concept of God being developed as time went by. Even in Jesus’ time, Baal was being worshipped, and so was Astarte, whose idol was kept in the Temple, polytheism was very much alive. True monotheism was established by the Council of Nicaea, with the creed, in AD 324. \nHave you read what the Jewish atheist Pinker says about the God described in the Old Testament? First read that, then tell me that Gould was not superior to him, at least in the wilingness to talk.\n\n","date":"February 10, 2014 at 10:53 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-78057","author":"Louis","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"In my opinion, the word “Word” in John’s prologue refers to the concept of the universe in God’s mind. \nPinker, Gould, and Dawkins have blind spots about the mind-body problem. They don’t even grasp the theory that humans are embodied spirits. The only theories they grasp are dualism and materialism. Their atheism is equally stupid. Gould does more harm than Dawkins and Pinker because he does not overtly attack religion. He is like a liberal Christian. Gould gives the impression that he is an intelligent person who has considered religious belief and in his judgment it is not true.\n\n","date":"February 10, 2014 at 11:26 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-78064","author":"David Roemer","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"Well, “In the beginning was the Word and the Word was with God and the Word was God” seems in my opinion to refer to God, not to the universe.\nThe mind-body problem is far from being resolved, therefore it is not difficult to understand why Gould, Pinker and Dawkins did not get far. I agree that Gould was like a liberal Christian, he even convinced Sagan to help him in the project he prepared for the Vatican. One could say that he considered religious belief, and in his judgment it was not true – but insofar as no one could prove the contrary, which explains his desire to discuss philosophy with Pope John  Paul II. That is a leap, something neither Pinker or Dawkins considered.\n\n","date":"February 10, 2014 at 11:50 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-78069","author":"Louis","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"The first step in resolving the mind-body problem is to grasp all of the possible theories of the mind. The next step is to marshal the evidence and decide which theory is true or just probable. These are the four theories with my comments about the evidence:\n1) dualism (no evidence at all)\n2) materialism ( more evidence than for dualism because material substances exists)\n3) idealism (more evidence than for materialism and dualism)\n4) It is a mystery. This is the theory with the most evidence, and is judged to be true by rational people.\n\n","date":"February 10, 2014 at 12:14 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-78073","author":"David Roemer","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"I wouldn’t say there is no evidence for dualism. If you delve into Jung and Parapsychology you will realise that. The mystery continues…. We are going off-track, so let’s leave it for now, but you are free to contact me by e-mail which Dan has.\n\n","date":"February 10, 2014 at 12:28 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-78078","author":"Louis","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"You can end the mystery by admitting it is a mystery. If you don’t, you might wind up howling.\n\n","date":"February 10, 2014 at 12:37 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-78079","author":"David Roemer","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"Well all this may be interesting, but it gets us no further with David’s ideas about the Shroud. I pointed out the St Irenaeus connection in my first post above, but we don’t seem to have progressed. I have looked carefully at your slide show, but it tells me nothing more. As it was I who suggested you would get a fair hearing if you presented your ideas on this blog (as opposed to the denial you have received from various church authorities) I’m a bit sorry that you don’t appear so far to have any after all.\n\n","date":"February 10, 2014 at 2:33 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-78093","author":"Hugh Farey","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"I have not been denied by Church authorities. The Pontifical Council for the New Evangelization suggested that I file my complaint against Cardinal Dolan with the Congregation for the Doctrine of Faith.\n\n","date":"February 10, 2014 at 3:18 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-78105","author":"David Roemer","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"David Roemer, I didn’t quite get you. The Pontifical Council for the New Evangelization probably directed you to the Congregation for the Doctrine of the Faith in view of the nature of the complaint, But what is your complaint against Cardinal Dolan?\n\n","date":"February 10, 2014 at 4:44 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-78125","author":"Louis","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"Cardinal Dolan is suppressing my slideshow/lecture about the Shroud on the grounds that I am “debunking” the Holy Shroud. It shows a lack of understanding of fundamental theology, and a lack of interest in our salvation history.\n\n","date":"February 10, 2014 at 8:44 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-78178","author":"David Roemer","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"David Roemer Re #62. If Cardinal Dolan will not allow you to present your slideshow (at Saint Patrick’s?) that is because of the Shroud Exposition in Turin in 2015 authorised by Pope Francis. How can the Archdiocese of New York contradict the Archdiocese of Turin or the Holy See? You are of course free to present your show, perhaps somewhere else in New York.\nThe Shroud is not a part of the Deposit of Faith, it can be a prop for those whose faith is weak, but it is certainly not the foundation of Faith. That would be ridiculous. Which is why it is strange that one Congregation passed your complaint on to another one, as you say. Cardinal Dolan is not Hans Küng, Leonardo Boff or Tissa Balasuriya, nor has he written a book saying things like Anthony de Mello, to which the Congregation for the Doctrine of the Faith took exception.\n\n","date":"February 11, 2014 at 8:18 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-78293","author":"Louis","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"“Cardinal Dolan is suppressing my slideshow/lecture about the Shroud on the grounds that I am “debunking” the Holy Shroud.” So you have been denied by church authorities, as I said. Suppress, deny, whatever.\nHave you given your presentation to anyone? What feedback have you had?\n\n","date":"February 11, 2014 at 9:14 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-78305","author":"Hugh Farey","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"I have not given the slideshow/lecture to anyone despite sending out hundreds of notices to churches and colleges. Fr. Daniel Gatti, the Alumni pastor of Fordham, where I graduated from, suggested that it would be good for adult education classes. In any case, it is on the internet at http://www.holyshroud.info.\n\n","date":"February 11, 2014 at 12:45 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-78340","author":"David Roemer","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"Yes, perhaps authorities was too strong a word. I meant the refusal to let you speak at the Church in New York. But never mind that, what about your evidence about the shroud?\n\n","date":"February 10, 2014 at 4:54 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-78130","author":"Hugh Farey","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"Gnosticism I believe was a not a single coherent religion, but comprised as many variant sects as there are sects which claim to be Christian today.  Perhaps the one thing they had in common was the claim to posession of a “Secret Knowledge” (Gnosis). Up until about 1945 with the discovery of the Nag Hammadi scrolls, practically all that was known of the gnostics was seond-hand from their enemies the early orthodox Church Fathers. The publication of Elaine Pagels’ book “The Gnostic Gospels”, based on the Nag Hammadi texts extended the general understanding of gnosticism, although few scholars accept Pagels’ interpretation of these texts.  \nThe only possible Gnostic reference to the Shroud image is that contained in the “Hymn of the Pearl” generally attributed to Bardaisan (154-222), a “Christian Gnostic”, the author of several Syriac hymns in Edessa, a contemporary and confidant of Abgar VIII the Great, the probable instigator of the Doctrine of Addai.  At the conclusion of the Hymn of the Pearl, the Prince protagonist, who seems to be a Christ-figure, sees his robe in a new light: \n“On a sudden, as I faced it,\nThe garment seemed to me like a mirror of myself.\nI saw it all in my whole self,\nMoreover I faced my whole self in (facing) it,\nFor we were two in distinction\nAnd yet again one in one likeness.\nAnd the image of the King of kings\nWas depicted in full all over it…” \nSome writers see in these verses the image of the Shroud. It would seem to indicate that Bardaisan may have been privy to viewing the full body mage of the Shroud at the court of Edessa. This is as close as one can get to any gnostic involvement in creating the Shroud image. However that it was a gnostic creation is a long stretch from Bardaisan’s merely viewing of the image!\n\n","date":"February 10, 2014 at 3:19 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-78106","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"Thank you for that connection between Gnostics and the Shroud. In addition to the quote in # 47, Robert Drews sites J. B. Segal’s quotation from a tomb stone in Edessa to show there were plenty of Gnostics in Edessa.\nWhoever despises\nthe expectations of [his] last [days]\nAnd mourns [his] first [days]—\nHe shall have a goodly latter end.\n“The sentiment, that only the man who scorns long life and repents of his youthful errors may deem himself worthy of life after death, is expressed skillfully.” (J. B. Segal, Edessa: The Blessed City, p. 34)\n\n","date":"February 11, 2014 at 9:02 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-78302","author":"David Roemer","site":"shroudstory"},{"title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud","post":"Bar Daisan was no true Christian, he was mixing things up with syncretism, possibly influenced by Hindu travellers in Iran and other sources, and it is also possible that he saw the Shroud, which must have been on the hands of Orthodox Christians. As for Elaine Pagels, she was debunked by Father Joseph A. Fitzmyer a long time ago.\n\n","date":"February 11, 2014 at 9:49 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","id":"comment-78314","author":"Louis","site":"shroudstory"}]
