[{"title":"Television:  An Italian Professor believes he has the answer.","post":"I guess the question is whether the Italian professor is Fanti or Garlaschelli.\n\n","date":"January 3, 2015 at 10:08 am","url":"https://shroudstory.com/2015/01/03/television-an-italian-professor-believes-he-has-the-answer/","cat":"video","id":"comment-181032","author":"Russ Breault","site":"shroudstory"},{"title":"Television:  An Italian Professor believes he has the answer.","post":"or Giovanni Fazio?\n\n","date":"January 3, 2015 at 1:07 pm","url":"https://shroudstory.com/2015/01/03/television-an-italian-professor-believes-he-has-the-answer/","cat":"video","id":"comment-181071","author":"Hugh Farey","site":"shroudstory"},{"title":"Television:  An Italian Professor believes he has the answer.","post":"I hope to be able to know something more about the ideas of this italian\nresearcher.  As you already know I have shown the way of SPM controls (= AFM, CFM, SNOM) in 1998 (International Conference, Turin), but then I could not accomplish much about positive results…\nUnfortunately I do not have my own analysis Laboratory …\nI suggested checking with the nano-mapping and then be able to know\nsomething about the true age of the material (= the old linen fibrils).\n… And see also: the three-point AFM bending tests (= nanomechanical tests), etc., etc.\n\n","date":"January 3, 2015 at 10:39 am","url":"https://shroudstory.com/2015/01/03/television-an-italian-professor-believes-he-has-the-answer/","cat":"video","id":"comment-181043","author":"piero","site":"shroudstory"},{"title":"Television:  An Italian Professor believes he has the answer.","post":"A great problem to overcome: I see a the lack of combinatory experiences\nin order to start with the “Evolution of Non-Destructive Dating” (= ENDD)…\nPerhaps Applied Technology is not, in itself, Invention…\nBut in our case …\nEvolution of Technology permitted to guess something about our dating problem …\nI have read some line (written by Brian W. Arthur, “The Logic of Invention”, 2005\nSee also : “The Nature of Technology: What It Is and How It Evolves”\nhttp://www.amazon.com/The-Nature-Technology-What-Evolves/dp/1416544062) about\nthe “old masters”:\n-William Fielding Ogburn\n-Abbott Payson Usher\n-Waldemar Kaempffert\nThey produced theories of Invention…\nBut these early theories were far from satisfactory.\nAnd it seems that moderrn research has shown that the actual process of invention varies greatly from historical case to historical case… and the universalities appear not to exist.\nFollowing Brian W. Arthur the process involved “is one of problem solving – recursive problem solving….” …and at the end of the paper by Brian Arthur we can see the short Glossary, where we can read the following explanations:\n– Recursiveness (as used here). = The property that a technology consists of sub-parts that are themselves technologies and that this statement repeats down to the simplest components.\n– Origination = The process by which a novel technology comes into being. (Invention, in common parlance).\n… Furthermore, it is strange to see the case where novel technologies are shaped by religious needs… … a strange case of “religious induced innovation” …\nWhat is being sought at the early stage is not a full design, not a full architecture …\nWhat is being sought is a base concept – a principle – the idea of some control …\nthat will fulfill the requirements of the problem, along with some conception of  the means needed to achieve this.\n— —\nAnd now I critique myself: a lot ‘of words, few (if any) however, are the facts …\nHow can we avoid becoming hypercritical and hypoactive in ous discussions?\n\n","date":"January 5, 2015 at 6:15 am","url":"https://shroudstory.com/2015/01/03/television-an-italian-professor-believes-he-has-the-answer/","cat":"video","id":"comment-181438","author":"piero","site":"shroudstory"},{"title":"Television:  An Italian Professor believes he has the answer.","post":"Errata corrige:\n>our discussions\nInstead of :\n>ous duscussions\n\n","date":"January 5, 2015 at 6:16 am","url":"https://shroudstory.com/2015/01/03/television-an-italian-professor-believes-he-has-the-answer/","cat":"video","id":"comment-181439","author":"piero","site":"shroudstory"},{"title":"Television:  An Italian Professor believes he has the answer.","post":"I see that I have been hidden some of my words in my message. But, unfortunately, I no longer have the original message ….\nAnyway … here’s a part of what I wanted to add:\nIn most cases of origination a group or team is at work, especially in the case of translating the concept into a working technology. …\nBut it seems to me that (sometimes) I am only a voice claiming into desert …\nSo it seems to me that I fulfill the required condition: a certain degree of obsession is required and cannot be generated in a diffuse group\nBringing a radically different principle to life requires some isolation from standard thinking … in order to be able to start with new thoughts…\nAt the end (…unfortunately) my discourse seems to assume tones a bit ‘paranoid and embarrassing, for this aspect I am certainly not happy. I like more clarity, I would like better show what you can get from the SPM analysis of linen fibrils in order to demonstrate the exact epoch for that ancient textile material (= Shroud and Sudarium of Oviedo).\n\n","date":"January 5, 2015 at 9:57 am","url":"https://shroudstory.com/2015/01/03/television-an-italian-professor-believes-he-has-the-answer/","cat":"video","id":"comment-181463","author":"piero","site":"shroudstory"},{"title":"Television:  An Italian Professor believes he has the answer.","post":"Here what I wrote (before to insert the link about a more recent work by Brian W. Arthur) :\n>I have read some line (written by Brian W.  Arthur, “The Logic of Invention”, 2005) about the old masters:\n-William Fielding Ogburn\n-Abbott Payson Usher\n-Waldemar Kaempffert\n*-*-*-*-*-*-*-*-*-\n>Despite its vast number of applications – … (omitted) … – the possibilities of AFM are not yet exhausted.\n>Future trends involve optimised tips and combinations with other techniques, for example to simultaneously determine surface structure and fluorescence or electrical properties (Müller et al., 2006).  …\n>Are you now itching to come up with your own applications for AFM? Then you might want to try and follow Philippe Jeanjacquot’s instructionsw for building your own instrument at school. It is a time-consuming project, but he and his students managed to create a feasibly low-cost microscope. There is one important catch though: you will need a vibration-free environment to set it up, such as a quiet cellar. If you can find that, your enthusiasm and ingenuity are the only limitations.\nA sharpened tungsten tip attached to a quartz tuning fork at resonance frequency is used to read out the\nsample’s surface height measurements …\nLinks:\nhttp://www.scienceinschool.org/2011/issue18/afm\nhttp://www.scienceinschool.org/repository/docs/issue18_afm_instructions.pdf\nHere other vague links:\nhttp://www.madcitylabs.com/spmmkit.html\nhttp://www.akiyamaprobe.com/\nhttps://www.youtube.com/channel/UC4SXZCm0CXLiilgjc6JIgNA?sub_confirmation=1\n*-*-*-*-*-*-*-*-\nPerhaps the Fourth Dimension guides you on a mind-expanding journey (… Is that a lucky travel? Is it unhindered ?).\nBut now I would like to propose to you two sentences that seem almost aphorisms:\n-New technologies are never created from nothing. They are constructed from components that previously exist; and in turn these new technologies offer themselves as possible components – bulding blocks – for the construction of further new technologies. …\n(Arthur and Polak, 2006)\n– A new invention consists of technologies, either new or already in use, brought together in a way not previously seen. … (Source: “Invention as a Combinatorial Process : Evidence from US Patents”\nby Hyejin Youn, Louìs M. A. Bettecourt, Deborah Strumsky and José Lobo, 2014)\n— — —\nIt does not seem to me to be in the case of violating copyrights for having prpoposto these two very short sentences.\nPerhaps our friend (and NY Attorney) John Klotz can say his opinion (or advice).\n\n","date":"January 5, 2015 at 10:47 am","url":"https://shroudstory.com/2015/01/03/television-an-italian-professor-believes-he-has-the-answer/","cat":"video","id":"comment-181468","author":"piero","site":"shroudstory"},{"title":"Television:  An Italian Professor believes he has the answer.","post":"Errata corrige:\n>for having proposed these two very short sentences.\nInstead of :\n>for having prpoposto these two very short sentences.\n— — —\nPiero = March 5, 2014 at 11:55 am wrote:\n>We have to try to be able to work using AFM controls on cellulosic chains and AFM measurements of elastic modulus (with feeble forces … perhaps … also less than 20 nN, roughly ten times the force needed to break a single atomic bond !) …\n\n","date":"January 5, 2015 at 10:58 am","url":"https://shroudstory.com/2015/01/03/television-an-italian-professor-believes-he-has-the-answer/","cat":"video","id":"comment-181470","author":"piero","site":"shroudstory"},{"title":"Television:  An Italian Professor believes he has the answer.","post":"I’ll be watching and recording.\n\n","date":"January 3, 2015 at 2:57 pm","url":"https://shroudstory.com/2015/01/03/television-an-italian-professor-believes-he-has-the-answer/","cat":"video","id":"comment-181091","author":"Emmett McMahon","site":"shroudstory"},{"title":"Television:  An Italian Professor believes he has the answer.","post":"Irritating that I live in the wrong country to watch this – though odds are it’s some already-dead theory.\n\n","date":"January 4, 2015 at 5:37 am","url":"https://shroudstory.com/2015/01/03/television-an-italian-professor-believes-he-has-the-answer/","cat":"video","id":"comment-181235","author":"Adam Crowl","site":"shroudstory"},{"title":"Television:  An Italian Professor believes he has the answer.","post":"Its Fantis!\n\n","date":"January 4, 2015 at 10:04 pm","url":"https://shroudstory.com/2015/01/03/television-an-italian-professor-believes-he-has-the-answer/","cat":"video","id":"comment-181376","author":"Stan Walker, MD","site":"shroudstory"},{"title":"Television:  An Italian Professor believes he has the answer.","post":"One wonders what Bible secret has been found that relates to the Shroud. It had better be convincing, given that Reza Aslan with his hidden agenda aiming at Jesus is making a loud noise in the US and has a lot of people listening to him or reading what he writes.\n\n","date":"January 5, 2015 at 7:50 am","url":"https://shroudstory.com/2015/01/03/television-an-italian-professor-believes-he-has-the-answer/","cat":"video","id":"comment-181452","author":"Louis","site":"shroudstory"},{"title":"Television:  An Italian Professor believes he has the answer.","post":"Shhh!  It’s a secret.\n\n","date":"January 5, 2015 at 8:11 am","url":"https://shroudstory.com/2015/01/03/television-an-italian-professor-believes-he-has-the-answer/","cat":"video","id":"comment-181454","author":"Andy","site":"shroudstory"},{"title":"Television:  An Italian Professor believes he has the answer.","post":"Problems also arise when there is no secret, just speculation, which paves the way for more rubbish, even in Biblical Archaeology:\nhttp://www.sltrib.com/home/2019854-155/story.html\nPilate was no friend of the Jews, the last thing he would do was to try Jesus in Herod’ palace. He only allowed himself to bend to pressure from Caiaphas because he was afraid that Tiberius would send him back to Rome. All the high priest had to do was to dispatch a letter to the emperor. The empire was more important, not any governor, be it in Palestine or elsewhere.\n\n","date":"January 5, 2015 at 8:32 am","url":"https://shroudstory.com/2015/01/03/television-an-italian-professor-believes-he-has-the-answer/","cat":"video","id":"comment-181459","author":"Louis","site":"shroudstory"},{"title":"Television:  An Italian Professor believes he has the answer.","post":"The video is now online:\n\n“Giulio Fanti and the Turin Shroud!\n\n","date":"January 8, 2015 at 6:31 am","url":"https://shroudstory.com/2015/01/03/television-an-italian-professor-believes-he-has-the-answer/","cat":"video","id":"comment-182031","author":"Gian Marco Rinaldi","site":"shroudstory"}]
