[{"title":"The Investigator:  New Film About the Death and Resurrection of Christ","post":"This movie and the true story that inspired it is a good portrait of our modern culture mainly based on the brain versus Jesus Christ.  Modern men seek solid evidences to be sure of the historical truth of Jesus resurrection but there is and will forever be none.\nThe only evidence that we can find is this:  2000 years ago, there really was a bunch of followers of Jesus of Nazareth, a Galilean prophet and teacher, who were convinced that, after his death on the cross, he was still alive (but in a different form than he was before his death) and they claim that he was the Messiah and the Son of God and that he was now living an eternal life in God’s Kingdom.\nThat’s all we can find as “proof” for our faith…  And it’s the very same thing for the Shroud.  The simple fact that this gruesome cloth was kept and preserved is a very good clue to think that, yes, there really was some followers of Jesus of Nazareth who were convinced that he was resurrected and that he was the prophetized Messiah and the Son of God.  \nBut this historical reality can never be considered as a sure proof of the true reality of their claim!  FAITH WILL FOREVER BE NEEDED in order to believe that they didn’t made an error in their understanding of the facts or that they were not victims of their imagination…\nTruly, the story of the doubting Thomas in the Gospel of John is really “on the target” for our time.\n\n","date":"July 17, 2013 at 10:48 am","url":"https://shroudstory.com/2013/07/16/the-investigator-new-film-about-the-death-and-resurrection-of-christ/","cat":"movie","id":"comment-39125","author":"Yannick Clément","site":"shroudstory"},{"title":"The Investigator:  New Film About the Death and Resurrection of Christ","post":"Complementary note :  When I talked about a potential error of understanding the facts on the part of the disciples, I mainly refer to their way to understand the empty tomb and the empty Shroud (which I consider to be 2 real historical facts) and also the few encounters they did after Jesus’ death with someone who looked somewhat different than him but which they considered anyway to be himself resurrected. Note that on an historical base, I have no problem to consider these few encounters as being probable facts.  But the thing is this :  All those historical facts (or probable facts) cannot be used as clear and solid pieces of evidence to prove Jesus resurrection.  That’s the main point of my argument.  For all the doubting Thomas out there (I know they are a wide group), I’m afraid you will have to trust the testimony of Jesus’ followers without having any sure and solid proof in front of you…  God wanted that way.\n\n","date":"July 17, 2013 at 11:44 am","url":"https://shroudstory.com/2013/07/16/the-investigator-new-film-about-the-death-and-resurrection-of-christ/","cat":"movie","id":"comment-39131","author":"Yannick Clément","site":"shroudstory"},{"title":"The Investigator:  New Film About the Death and Resurrection of Christ","post":"As long as nobody bleeds to death in the first five minutes…\n\n","date":"July 17, 2013 at 11:02 am","url":"https://shroudstory.com/2013/07/16/the-investigator-new-film-about-the-death-and-resurrection-of-christ/","cat":"movie","id":"comment-39128","author":"Hugh Farey","site":"shroudstory"},{"title":"The Investigator:  New Film About the Death and Resurrection of Christ","post":"This film seems to be preaching to the converted, based on the softie reviews. It reminds of the Lee Strobel books ‘the Case for…” which are filled with many strawmen. Not that there aren’t sound logical reasons for belief in Jesus, but as Yannick has pointed out, if it was all based on facts we’d have no reason for faith, would we?\n\n","date":"July 17, 2013 at 11:24 am","url":"https://shroudstory.com/2013/07/16/the-investigator-new-film-about-the-death-and-resurrection-of-christ/","cat":"movie","id":"comment-39130","author":"David Goulet","site":"shroudstory"},{"title":"The Investigator:  New Film About the Death and Resurrection of Christ","post":"Here’s a nice anecdote concerning my claim that the empty tomb of Jesus on Easter morning is really an historical fact :  I once told this to one of my friend who is an atheist and he was shocked!  It was like I was saying that the Resurrection of Christ is a proven historical fact, while this is not at all what I said to him!  True, the Resurrection of Christ is not and will never be an event that we can consider as being a true and proven historical fact, but the empty tomb is a different story!  And what can make me consider this story as being a true and solid historical fact:  simply because the enemies of the faith, whether it was the Roman or the Jews, never denied that event!  The only thing they denied was the understanding of this event…  For them, it was evident that the disciple came to the tomb and stole the corpse.  So, the simple fact that they never denied that the tomb had been found empty on Easter morning is well enough to understand that it was a true story.  When I explained this to my friend, he had no other choice than to agree with me (at least, saying that it was a probable fact).  And for the empty Shroud, I think it’s fair to say that it’s also a sure historical fact, based on the same account of the empty tomb, and this fact is reinforced by the very probable fact that the Shroud of Turin (which contained only for a short time the dead body of a crucified man who showed the same stigmatas than the Jesus of the Gospels) is really the true Shroud used to covered the body of Jesus of Nazareth after his crucifixion.  These 2 historical facts (the empty tomb and the empty Shroud) truly complement each other, while it’s important to say it’s impossible to consider them as being a solid scientific and historical proof of the reality of Jesus resurrection.  And concerning the encounters made by the disciples after the founding of the empty tomb, I say that it is a very probable historical fact for the simple and good reason that it doesn’t sound at all like an invented story, because if this would have been the case and that story would have been made up by the disciples of Jesus, it’s evident that they would have claimed having no problem at all to recognize him after his resurrection…  This is pure rational thinking!  But again, even if these stories of the disciples having encountered someone after Jesus death, while ending up believing that it was really him alive again, are most probably true, that doesn’t mean that the person they meet was truly the resurrected Jesus…  That only mean they ended up being sure that it was him, while having no proof (in the scientific sense of course) to show to back up their claims.  So, the door will be always left open for some mistakes on their part…  Concerning the resurrection of Jesus Christ, FAITH IS AND WILL FOREVER BE NEEDED!\n\n","date":"July 17, 2013 at 1:01 pm","url":"https://shroudstory.com/2013/07/16/the-investigator-new-film-about-the-death-and-resurrection-of-christ/","cat":"movie","id":"comment-39132","author":"Yannick Clément","site":"shroudstory"},{"title":"The Investigator:  New Film About the Death and Resurrection of Christ","post":"All the deep things of God are all mysteries.  Who can really understand the incarnation–much less the resurrection?  How does someone calm a storm with a command?  How does someone feed five thousand with a boy’s lunch?  All of these are mysteries beyond our human understanding. If the Shroud was an obvious work of art–we would have figured that out years ago.  So it stands to reason that the Shroud, if authentic, would defy explanation despite thousands of hours of scientific analysis.  In my view, one of the strongest arguments for the Shroud’s authenticity is that it remains a mystery.\n\n","date":"July 17, 2013 at 10:02 pm","url":"https://shroudstory.com/2013/07/16/the-investigator-new-film-about-the-death-and-resurrection-of-christ/","cat":"movie","id":"comment-39159","author":"Russ Breault","site":"shroudstory"},{"title":"The Investigator:  New Film About the Death and Resurrection of Christ","post":"Personally Russ, I think the most compelling evidence of the authenticity of the Shroud is related to the bloodstains.  But you already know this if you took time to read my paper on the subject : http://shroudnm.com/docs/2012-07-26-Yannick-Clément-The-evidence-of-the-bloodstains.pdf\n\n","date":"July 18, 2013 at 8:24 am","url":"https://shroudstory.com/2013/07/16/the-investigator-new-film-about-the-death-and-resurrection-of-christ/","cat":"movie","id":"comment-39194","author":"Yannick Clément","site":"shroudstory"},{"title":"The Investigator:  New Film About the Death and Resurrection of Christ","post":"When he see that more and more people in our modern world are desperately seeking to find some proofs of the existence of God, especially by trying to find solid evidences of the Resurrection of Christ, I say to myself that St Paul must turn over in his grave!  When I realize how much he focussed in his letters in the notion of Salvation by faith, I think he must be completely desperate to see this!  Note that there are a lot of persons who are interested by the Shroud of Turin exactly for this reason (i.e. finding some proofs of the Resurrection of Christ).  For me, this is by far the worst heresy of our time…  God and the Resurrection of Christ will never be provable (in the scientific sense) and faith will forever be the way to really find God and be in peace.  Conclusion:  if you really want to find God, listen to your heart instead of your brain.\n\n","date":"July 18, 2013 at 8:23 am","url":"https://shroudstory.com/2013/07/16/the-investigator-new-film-about-the-death-and-resurrection-of-christ/","cat":"movie","id":"comment-39193","author":"Yannick Clément","site":"shroudstory"},{"title":"The Investigator:  New Film About the Death and Resurrection of Christ","post":"Yes, Yannick, but our hearts are not detached from our minds. If one is interested in the Shroud as a witness to a real event, one that is outside normal human experience, this is not heresy – unless they claim that they can only believe if they can prove the Resurrection happened. That is like giving God an ultimatum – “show yourself and only then will I believe!” This is not actually heresy but the root of most atheism.\nJust because the Gospel tells us that ‘blessed are those who have not seen yet still believe’ we should not take that to mean it is wrong to want to see. Thomas was not wrong to demand a sign – for faith (which he had) without reason is mere superstition. The disciples all had faith but they also were blessed to witness the resurrected Jesus. This witness was essential or we wouldn’t be sitting here today talking about Jesus at all. God’s rule would appear to be: once you have faith, then you will be given your sign. It must be so with a God that respects free will.\nEvery generation seeks a witness. “How do I know what you say is true?” For the modern Thomas, the Shroud acts as such a witness. Not a proof, just a sign. Of course each of us, who professes Jesus, is to be a living sign. This is how the church spread in the beginning — people marveling at the love of these ‘Christians’ even in the face of suffering and death. That too is a powerful witness.\nSo yes, the heart of faith is the pillar of belief, but the mind and its desire for rational certitude is the hearts partner in the dance.\n\n","date":"July 18, 2013 at 9:38 am","url":"https://shroudstory.com/2013/07/16/the-investigator-new-film-about-the-death-and-resurrection-of-christ/","cat":"movie","id":"comment-39202","author":"David Goulet","site":"shroudstory"},{"title":"The Investigator:  New Film About the Death and Resurrection of Christ","post":"The heresy I mentioned is to use modern science to try to back-up a belief.  That’s what’s heretical…  Using the Shroud as a way to strengthen your faith is not problematic at all (I did it myself), but using it and pretending that we can find a sure scientific proof of the Resurrection on it, this is a totally different story.  Unfortunately, many “scientists” are doing just that.\n\n","date":"July 18, 2013 at 10:50 am","url":"https://shroudstory.com/2013/07/16/the-investigator-new-film-about-the-death-and-resurrection-of-christ/","cat":"movie","id":"comment-39206","author":"Yannick Clément","site":"shroudstory"},{"title":"The Investigator:  New Film About the Death and Resurrection of Christ","post":" Unfortunately, many “scientists” are doing just that.\nI would think they only way to prove resurrection is ‘possible’ is to replicate it. Outside of the scientists in horror movies, I don’t see anyone ever succeeding at that. They are free to try of course. Everyone needs a hobby. :)\n\n","date":"July 18, 2013 at 11:46 am","url":"https://shroudstory.com/2013/07/16/the-investigator-new-film-about-the-death-and-resurrection-of-christ/","cat":"movie","id":"comment-39208","author":"David Goulet","site":"shroudstory"},{"title":"The Investigator:  New Film About the Death and Resurrection of Christ","post":"I should have said “some christian scientists” because I still wait to see the first atheist scientist with that kind of religious motive about the Shroud (or a scientist from another religion than christian religion)…\n\n","date":"July 18, 2013 at 1:18 pm","url":"https://shroudstory.com/2013/07/16/the-investigator-new-film-about-the-death-and-resurrection-of-christ/","cat":"movie","id":"comment-39213","author":"Yannick Clément","site":"shroudstory"}]
