[{"title":"Set Your DVR","post":"The American Heroes Channel was formerly the Military Channel and is a History Channel spin-off. You get to watch the Battle of Midway, Pearl Harbor, the Battle of Gettysburg and the Battle of Bulge on a repetitive basis and I almost don’t get tired of those programs. Others, not so much.\nThey are also  into ancient aliens (or is that H2 another spin-off) and ancient history sometimes running programs with conflicting theories on the same topic. One example: where did Moses cross the Red Sea provided that you accept that as history. That is a “debate” I really am not into.\nIronically, I seldom watch the History Channel anymore. It’s into swamp people, truckers driving to Alaska and pawn brokers. I have  enough problems of my own without dumbing down to that level. On that other-hand I have a nephew who is an under-Secretary  official in the Obama administration who finds the pawn brokers stuff interesting because what they explore which is relics of Americana. He as an Oxford degree and interned twice at the White House so I maybe I am the dumb one.\n\n","date":"December 29, 2014 at 9:00 am","url":"https://shroudstory.com/2014/12/29/set-your-dvr/","cat":"video","id":"comment-179799","author":"John Klotz","site":"shroudstory"},{"title":"Set Your DVR","post":"I think that the Shroud is the greatest biblical mystery.\nBut, certainly, there are other biblical mysteries…\nThe mystery of the passage of the Red Sea by Moses and\nhis people on the run has always interested me.\nThe questions on the issue are many, perhaps too many :\nWhere the Jews fleeing from the Pharaoh passed the Red Sea ?, etc., etc.\n— —\nIt seems to me that we can reflect a bit on the news\nfirst believed to be true … but then later proved to be false …\nExamples:\n>Mineralized Bone – One of many found at the crossing site (above center). This one Tested by the Dept. of Osteology at Stockholm University, was found to be a human femur, from the right leg of a 165-170cm tall man. It is essentially ‘fossilized’ i.e. replaced by minerals and coral, hence cannot be dated by radiocarbon methods, although this specimen was obviously from antiquity.\nSource:\nhttp://www.preteristarchive.com/Ancient_Revelations/epigraphy/egypt_exodus-crossing.html\n— —\n>Wyatt’s name is well known on the internet for touting the Nuweiba location for the crossing the Red (Reed) Sea. It was in conjunction with this investigation that Wyatt allegedly found Egyptian chariot wheels under water in support of his theory.\n>Did Wyatt ever bring one of these out of the water?\n>The link below claims so, but (as is so common with paleobabble), no independent peer-reviewed examination by archaeologists and other specialists (to see if they were merely coral formations) was ever conducted and published. …\nLink:\nhttp://michaelsheiser.com/PaleoBabble/2011/12/ron-wyatt-egyptian-chariot-wheels/\n— —\nI am intrigued by the questions about these strange reperts,\nbut I have found some other strange ideas …\nSee. for example:\n>On 24 October 2014, the fake news site World News Daily Report\npublished an article claiming chariot wheels and  the bones of horses\nhad been discovered at the bottom of the Red Sea.\n>While the site framed the “discovery” as recent and newly announced,\nthe Red Sea chariot hoax has been circulating on the Internet for many years…\nAnd then, at the end, the following Conclusion:\n>… True to the site’s disclaimer, none of those massively popular stories\nturned out to be rooted in truth. \nLinks:\nhttp://www.snopes.com/religion/redsea.asp#4ZyFbF0hwqIo89de.99\nhttp://www.snopes.com/religion/redsea.asp\n— * — * —\nSee also:\nSir Colin John Humphreys.\nHe is the former Goldsmiths’ Professor of Materials Science …\nHere the title for the book by Colin J. Humphreys:\n“The Miracles of Exodus: A Scientist’s Discovery of the Extraordinary\nNatural Causes of the Biblical Stories”. HarperCollins, 2004\n(What is your opinion of this book?)\nLinks:\nhttp://en.wikipedia.org/wiki/Colin_Humphreys\nhttp://abcnews.go.com/Technology/story?id=99580\nOn the other side I remember having read the strange book:\nAct of God. Sidgwick & Jackson, 1998.\n= Investigations about the biblical accounts of the Exodus,\nconcluding that the plagues of the Egypt and\nthe parting of the Red Sea were real historical events\ncaused by a volcanic eruption (Thera explosion… links:\nhttp://en.wikipedia.org/wiki/Minoan_eruption\nhttp://en.wikipedia.org/wiki/Santorini) …\nhttp://en.wikipedia.org/wiki/Graham_Phillips_(author)\nSome scientist believes that the Ten Plagues – the ten calamities\ninflicted in Exodus upon the Egyptians for their treatment of the\nJews – could have been caused by a massive volcanic eruption …and\nI have read that\n>The survivors of a volcanic eruption on Martinique in 1901 were attacked\nby swarms of flying ants that consumed everything that was still growing,\njust like locusts…\nSo…\nI see that now the time is short and instead is required lot (… perhaps too much!)\ntime to solve in a good manner the question of the biblical passage of the “Red Sea” …\n\n","date":"December 29, 2014 at 9:56 am","url":"https://shroudstory.com/2014/12/29/set-your-dvr/","cat":"video","id":"comment-179810","author":"piero","site":"shroudstory"},{"title":"Set Your DVR","post":"Hi Joe!\nNice documentary.\nAnyway, about the links between Manoppello and the Shroud, see my two papers: \nhttps://shroudofturin.files.wordpress.com/2014/06/manopello-shroud-comparison3d.pdf\nhttps://shroudofturin.files.wordpress.com/2014/06/addendum-manopello-shroud-comparison3d.pdf\nI have much more in preparation, and I hope I will assemble the whole material at some time -because there is a lot to discuss about.\nWhat do you think?\n\n","date":"December 29, 2014 at 9:55 am","url":"https://shroudstory.com/2014/12/29/set-your-dvr/","cat":"video","id":"comment-179809","author":"O.K.","site":"shroudstory"},{"title":"Set Your DVR","post":"The particular issue of asymmetry for the shape of the hair (= Manoppello’s Veil)\nseemed to me very curious and very interesting.\nThen I believe that the study of the Shroud and the accurate observation\nof the Holy Face of Manoppello are actually more interesting\nthan the “Ancient Aliens” …\nAnd now …  I have some doubts:\n… but here do I really speak well (…in this manner)?\nSo…\nI think you can not compare different topics.\n— —\nBut do not get me wrong.\nHere I did not mean to speak of the Shroud and the Holy Face of Manoppello\n(both considered as evidence for the existence and death of Jesus Christ …\nand even of His Resurrection!). Instead I was referring to the alleged “ancient aliens” …\n…And who knows how is the face of the aliens (… if they really exist)?\nLast consideration (… because I’m getting boring): the painter Roger Basset perhaps\nhas changed my perception of the Face of Christ…\nRoger W. Bassett has “restored” (clarified) a portion of the shroud: the Face.\nWhat do you think of the particular “Face of Divine Mercy” (Kowalska =\nhttp://en.wikipedia.org/wiki/Divine_Mercy_image) … in the light of what it shows us the interesting painting of Roger Basset?\nWhere is the “crucial information”?\n— —\n>”I promise that the soul that will venerate this image will not perish,”\nJesus told Faustina …\n>A number of artistic renditions of the image have appeared since Faustina directed the painting of the first image in Poland.\n> Faustina stated that whilst she was in her cell on the night of Sunday, 22 February 1931, Jesus appeared to her as the “King of Divine Mercy”, robed in a white garment. …\nLink:\nhttp://en.wikipedia.org/wiki/Divine_Mercy_image\nSometimes streets, paths and intertwining of lives that happen in History are very interesting …\n= “Pope gunman Mehmet Ali Agca visits John Paul II’s grave”\nThe Turkish man who shot and injured former Pope John Paul II in 1981\nhas laid flowers on the late pontiff’s tomb in the Vatican …\nlinks:\nhttp://www.bbc.com/news/world-europe-30612677\nhttp://www.herald.co.zw/white-roses-for-the-pope/\nBut it is unlikely that a deranged man can be held up as an example …\nWhat matters in that story is the Holy Pope … and maybe even Saint Faustina.\nWhy not?\n\n","date":"December 29, 2014 at 10:50 am","url":"https://shroudstory.com/2014/12/29/set-your-dvr/","cat":"video","id":"comment-179814","author":"piero","site":"shroudstory"},{"title":"Set Your DVR","post":"O.K. You did some marvelous work in your articles.  I’ve always been torn about it because visually it looks like a painting but it also seems to have characteristics not in keeping with it being a painting.  I definitely agree more work is need.\n\n","date":"December 29, 2014 at 9:17 pm","url":"https://shroudstory.com/2014/12/29/set-your-dvr/","cat":"video","id":"comment-179895","author":"Joe Marino","site":"shroudstory"},{"title":"Set Your DVR","post":"“Searching for the truth…” The more you search for the truth, the less you find it.\n\n","date":"December 29, 2014 at 10:24 pm","url":"https://shroudstory.com/2014/12/29/set-your-dvr/","cat":"video","id":"comment-179908","author":"PHPL","site":"shroudstory"},{"title":"Set Your DVR","post":"The Manoppello veil is a mixed bag, it also contains paint, so someone may have touched it up to make the colour more vivid in some places. We can sure about something so far: the cloth is not byssus.\n\n","date":"December 30, 2014 at 7:18 am","url":"https://shroudstory.com/2014/12/29/set-your-dvr/","cat":"video","id":"comment-180006","author":"Louis","site":"shroudstory"},{"title":"Set Your DVR","post":"How is possible searching for the truth behind one of the Church’s most mysterious relics if you don’t use modern spectroscopical analyses ?\nI didn’t think that Raman analyses were feasible also for textile samples under glass and thus I was more inclined for others kind of spectroscopic analyses, but I have read that Raman spectroscopic analysis has been successfully performed …\nThen  I have searched and I have found the following study:\nComparative pigment analysis of six modern Egyptian papyri and\nan authentic one of the 13th century BC by Raman microscopy\nand other techniques.\nLink:\nhttp://www.researchgate.net/publication/229975800_Comparative_pigment_analysis_of_six_modern_Egyptian_papyri_and_an_authentic_one_of_the_13th_century_BC_by_Raman_microscopy_and_other_techniques\n>…Most of the pigments on the papyri were thus recognized to be modern, their syntheses or refinement processes not being known to the ancient Egyptians.\n>The above results have been compared with those obtained from the analysis of an authentic Egyptian papyrus belonging to the Petrie Museum and dating from the 13th century BC.\n>This papyrus had recently been conserved by the British Museum and placed under glass. >The Raman study, which was performed without removal of the glass, revealed the presence of pararealgar (yellow), which is a photodegradation product of realgar (red). Carbon and orpiment were also present on this papyrus, and possibly iron(III) oxide, malachite or Egyptian green, and Egyptian blue, but no modern pigments. \nI preferred the spectroscopic analysis for transparency.\nSee also my past intervention (in “Manoppello, Shroud and Durer:\nA Short Presentation by O.K.”. = September, 2014).\nRemember what I wrote (September 4, 2014):\n>First of all, as first step, we have to distinguish byssus from linen!\n… and typical spectrum of proteins is different with respect lignocellulosic materials !…\n>All protein fibres – and so all animal fibres – show a similar IR spectrum: at 3300 cm-1 and the amino and hydroxyl peaks at 2800cm-1 CH vibrations at 1650 cm-1, the characteristic vibrations of the amide groups of proteins.\n>In this they differ markedly from the natural fibres of cellulose,\nwhich do not have amide groups. \n… But how about the feasibility of this type of analysis Raman?\nI’m still a bit skeptical about the results obtained from the Raman analysis\nof a textile object preserved in a glass of a certain thickness.\nIn any case …\nI will wait (patiently) your feedback.\n\n","date":"December 30, 2014 at 8:57 am","url":"https://shroudstory.com/2014/12/29/set-your-dvr/","cat":"video","id":"comment-180024","author":"piero","site":"shroudstory"},{"title":"Set Your DVR","post":"Have you been able to solve my doubts about the results (obtained with the Raman analysis) of the textile object preserved in a glass of a certain thickness?\n… Excuse me, I am a bit impatient!\n… However I would like to stress that knowing how to indicate clearly\nwhat you could do is a good step, but it is not like having useful data\nalready in hand … to improve our long discussions.\nIn my opinion this is the right way to improve our discussions.\nTherefore I believe that we need an expert spectroscopist\nwho can say its authoritative word…\n\n","date":"December 30, 2014 at 9:16 am","url":"https://shroudstory.com/2014/12/29/set-your-dvr/","cat":"video","id":"comment-180029","author":"piero","site":"shroudstory"},{"title":"Set Your DVR","post":"The Manoppello veil is a mixed bag, it also contains paint, so someone may have touched it up to make the colour more vivid in some places. We can sure about something so far: the cloth is not byssus.\nLouis: where is paint here?\n\nAs to whether the cloth is, or is not a byssus (that means sea silk) we cannot be certain yet.\n\n","date":"December 30, 2014 at 12:40 pm","url":"https://shroudstory.com/2014/12/29/set-your-dvr/","cat":"video","id":"comment-180075","author":"O.K.","site":"shroudstory"},{"title":"Set Your DVR","post":"O.K.\nThe information I have is reliable and came from very serious sources. There is paint in at least one place. As for the cloth, whether it is byssus or not, you may find two questions about it here:\nhttps://www.academia.edu/8841978/Professor_Giulio_Fanti_discusses_the_controversies_in_the_realm_of_Shroud_studies\nAnother scientist agrees that it is not byssus.\nAs a matter of fact, when I had occasion to interview Father Heinrich Pfeiffer, SJ, who co-authored a book on the topic with fellow German Jesuit Father Werner Bulst, never did he say that it was byssus. What I heard was that the material was “very thin”.\nResearching relics is not easy, as you will read in Ian Wilson’s lavishly illustrated “Holy Faces, Secret Places”, and the Vatican continues to exhibit another piece of cloth with no image and just two stains as the “Veronica”. As far as I know, this object has not been examined by scientists.\n\n","date":"December 30, 2014 at 4:28 pm","url":"https://shroudstory.com/2014/12/29/set-your-dvr/","cat":"video","id":"comment-180110","author":"Louis","site":"shroudstory"},{"title":"Set Your DVR","post":"The information I have is reliable and came from very serious sources. There is paint in at least one place.\nThe fact that there is a bit of paint in one place (you can see it on the illustration above, left and little bit up the eye) is quite irrelevant here, as it is obvious that this is not a painting in any classical sense. Look at the photo I posted (a scan from Aszyk-Treppa monography). Remember that the average diameter of Manoppello threads is 120 micrometers, that is 0.12 mm. And here you have some sharp details (for example the contours of iris and pupil) marked on the boundary of 1-2 threads!!! I hardly can imagine that making such thing even by the most skilled artist is possible.\n\n","date":"December 30, 2014 at 7:13 pm","url":"https://shroudstory.com/2014/12/29/set-your-dvr/","cat":"video","id":"comment-180132","author":"O.K.","site":"shroudstory"},{"title":"Set Your DVR","post":"” I hardly can imagine that making such thing even by the most skilled artist is possible.”\nI never said that the entire work was done by an artist. All I can say now is that artists seemed to have thought that they could do a better job than God, assuming that supernatural agency is involved. This applies to the Guadalupe image as well, and in this case American scientist Dr. Phil Calahan was hindered by the paint applied over the original image by the Spaniards in Mexico.\n\n","date":"December 31, 2014 at 9:48 am","url":"https://shroudstory.com/2014/12/29/set-your-dvr/","cat":"video","id":"comment-180303","author":"Louis","site":"shroudstory"},{"title":"Set Your DVR","post":"The Roman triumph (triumphus) was a civil ceremony and religious rite of ancient Rome, held to publicly celebrate and sanctify the success of a military commander who had led Roman forces to victory in the service of the state, or originally and traditionally, one who had successfully completed a foreign war… … …\n>Nevertheless, the triumph is considered a characteristically Roman ceremony which represented Roman wealth, power and grandeur, and has been consciously imitated by medieval and later states in the royal entry and other ceremonial events.\nLink: http://en.wikipedia.org/wiki/Roman_triumph#The_vir_triumphalis\nWas the Shroud connected with a sort of  Roman triumph?\nWas the Manoppello’s Face another Veil connected with a sort of  “Roman triumph”?\nThis point of view seems to be very strange … and therefore could also be a diabolical temptation!\nSee also the other (ritual) hypothesis:\n> Only the most affluent people were able to afford it. According to one hypothesis it was Mary Magdalene who put the veil on Christ’s Face in token of reverence and honour.\nSource:  http://manoppello.eu/eng/index.php?go=bisior\nAlso read the following words:\n>Traces of the Roman triumph have been identiﬁed in the procession narratives in Mk 11 and 15, but how its themes should be understood to function in Mark’s telling has never achieved consensus.\n>Reading these narratives alongside evidence for the Roman triumph demonstrates how the ritual logic of the triumph allowed Mark to exploit the degradation of Jesus’ passion, undermine the performance of Roman power and portray Jesus as a king, and a threat to Rome.\n>The Roman triumph paradoxically magnified triumphal victims, presented kings as ideal victims, and drew a close parallel between the victim’s kingly status and the conqueror’s grande\nI think we can speculate and we can try to correlate the use of the veil of Manoppello in a ritual context. But before performing that study we could at least know something more of the mysterious Veil using spectroscopic controls that I already mentioned (transmission spectroscopy or Raman analyses).\nI am curious to read your opinions or comments.\n— —\nLouis,\nYou wrote:\n“… Another scientist agrees that it is not byssus. …”…\nIn my opinon you should be more specific with your vague references\nabout the issue of fine linen (= not byssus [why !!??]) …\nHow did you see I had shown (in a previous message) the system\n(= spectroscopic controls and not fairy tales!) in order\nto discern the silkmarine byssus from linen!\n\n","date":"December 31, 2014 at 10:52 am","url":"https://shroudstory.com/2014/12/29/set-your-dvr/","cat":"video","id":"comment-180323","author":"piero","site":"shroudstory"},{"title":"Set Your DVR","post":"Piero\n“Louis: Vague references”\nI am a journalist and so I am not bound to reveal sources who send me information relating to the topics on which I write, the TS being just one of them. If I get permission that is another story, and ethics are involved, it is like a confessional secret. What you call “vague references” has something to do with a source, who is serious, otherwise there would be no mention.\nDid you read the interview-article cited above (30th December) with a link? If you have conducted a similar examination on the image than I am willing to discuss it.\n\n","date":"December 31, 2014 at 11:10 am","url":"https://shroudstory.com/2014/12/29/set-your-dvr/","cat":"video","id":"comment-180326","author":"Louis","site":"shroudstory"},{"title":"Set Your DVR","post":"Mysteries in Catholicism go beyond Manoppello and Guadalupe, the topic of incorruption is also part of the story. Take the case of the body of the Basque saint Francis Xavier which is now being exposed in Goa, former Portuguese India, till January 2015:\nhttp://sfxexposition2014.com/\nIt has nothing to do with dark, humid medieval churches since he died in Nagasaki, Japan and his request was to be buried in Goa, where he had lived previously. The Portuguese sailors buried him in Japan, then dug up the body after a while, found it to be totally incorrupt, threw lime on it, but there was no decomposition. The body was taken to Goa and a letter sent to Rome, after which the Pope requested that one hand be cut off and sent to the Holy See. It is still there. The body is now partially incorrupt.\nThere are supposed to be 500 bodies of saints like this one, although only 10 to 15 are completely incorrupt. The smell of perfume surrounds some of them, called “the odour of sanctity” by the English Jesuit scholar Father Herbert Thurston.\nFrom what I know,the Church has asked scientists and scholars to investigate the matter.\nOther cases? See:\nhttp://www.mysticsofthechurch.com/2010/04/saints-that-are-incorruptable.html\n\n","date":"December 31, 2014 at 11:48 am","url":"https://shroudstory.com/2014/12/29/set-your-dvr/","cat":"video","id":"comment-180330","author":"Louis","site":"shroudstory"},{"title":"Set Your DVR","post":"good link….search padre pio incorrupt on youtube….fairly recent example\n\n","date":"January 11, 2015 at 11:50 pm","url":"https://shroudstory.com/2014/12/29/set-your-dvr/","cat":"video","id":"comment-182723","author":"rick","site":"shroudstory"}]
