[{"title":"Shroud Prompted Return to Faith for August Accetta","post":"Gus Accetta made some useful contributions to Shroud studies. His religious journey is not unlike the one made by Professor Francis Beckwith,now at Baylor, and author of “Return to Rome”. Beckwith was not exactly a fundamentalist, but as President of the Evangelical Theological Society his return to Rome caused an uproar. His statement to justify his decision made it clear that he was being honest, he just could not remain in his position after delving deeply into Church history and theology.\n\n","date":"May 20, 2015 at 8:54 am","url":"https://shroudstory.com/2015/05/20/shroud-prompted-return-to-faith-for-august-accetta/","cat":"video","id":"comment-199674","author":"Louis","site":"shroudstory"},{"title":"Shroud Prompted Return to Faith for August Accetta","post":"Wow, interesting.\n\n","date":"May 25, 2015 at 3:16 pm","url":"https://shroudstory.com/2015/05/20/shroud-prompted-return-to-faith-for-august-accetta/","cat":"video","id":"comment-200173","author":"Andy","site":"shroudstory"},{"title":"Shroud Prompted Return to Faith for August Accetta","post":"My summary notes on Dr Acetta’s personal experiment, where he injected a radio-active chemical into his own veins: \n“Dr Accetta’s experiment to explain the image formation on the Shroud:  Dr August Accetta is an American radiologist, and founder of the Shroud Center of Southern California, 8840 Warner Ave, Suite 200, Fountain Valley CA 92708, USA http://www.shroudcentersocal.com” \n“Dr Accetta injected into his own veins a solution of methylene diphosphate, containing radioactive technetium-99m, a radioisotope with a short half life. The radiation from the technetium atoms produced gamma rays, which could be detected by the VP8 Image Analysing Computer.  Dr Accetta produced an image on the VP8 computer similar, but with less definition, than the Shroud image.”\nhttp://www.freechristianteaching.org/modules/smartsection/item.php?itemid=159#axzz23OmNW7hE    {Haven’t yet checked to see if it’s still there)\n\n","date":"May 25, 2015 at 4:23 pm","url":"https://shroudstory.com/2015/05/20/shroud-prompted-return-to-faith-for-august-accetta/","cat":"video","id":"comment-200178","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Shroud Prompted Return to Faith for August Accetta","post":"“The radiation from the technetium atoms produced gamma rays, which could be detected by the VP8 Image Analysing Computer.” Really? I don’t believe this. Is there any more credible information regarding this experiment?\n\n","date":"May 25, 2015 at 5:08 pm","url":"https://shroudstory.com/2015/05/20/shroud-prompted-return-to-faith-for-august-accetta/","cat":"video","id":"comment-200181","author":"Hugh Farey","site":"shroudstory"},{"title":"Shroud Prompted Return to Faith for August Accetta","post":"I think Acetta’s original paper was presented at Dallas in 2010.  I found a paper from Barrie’s web-site, where it had been presented at Orvieto in Italy.\nhttp://www.shroud.com/pdfs/accett2.pdf\nIt includes images from his experiment, including some isometric 3-D images.  Details on carrying out the experiment in this paper seem somewhat sparse.  As the paper was presented in Italy, it may partially account for the Italian interest in radiation models, together with De Liso’s and others’ experiments with seismic effects (radon).  Using search keyword “Acetta” on shroud.com site, there were three other entries, at least two in BSTS newsletter, which you can probably access by consulting the editor. \nJust now, I checked the freechristianteaching web-page I cited above, it’s still live, and it seems to give a few more details.\n\n","date":"May 25, 2015 at 5:50 pm","url":"https://shroudstory.com/2015/05/20/shroud-prompted-return-to-faith-for-august-accetta/","cat":"video","id":"comment-200184","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Shroud Prompted Return to Faith for August Accetta","post":"Thanks, daveb, that makes a lot more sense. The shroud.com paper, that is. I would avoid the freechristian account, which is confused.\n\n","date":"May 26, 2015 at 1:43 am","url":"https://shroudstory.com/2015/05/20/shroud-prompted-return-to-faith-for-august-accetta/","cat":"video","id":"comment-200210","author":"Hugh Farey","site":"shroudstory"},{"title":"Shroud Prompted Return to Faith for August Accetta","post":"Thank you Daveb I like Acetta’s original paper.\n\n","date":"May 26, 2015 at 3:25 am","url":"https://shroudstory.com/2015/05/20/shroud-prompted-return-to-faith-for-august-accetta/","cat":"video","id":"comment-200211","author":"Sampath Fernando","site":"shroudstory"}]
