[{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"I was intrigued, in another extract, to see Barbara Frale still claiming that there is lettering on the Shroud. In her authoritative manner she claims that no one in the Middle Ages would have used the word Nazarene to relate to Christ. But if she had studied her medieval liturgical texts she would have known that the response  to the angel at the Quem Queritis ceremony ( the angel asks the Three Marys, Quem Queritis, ‘whom are you seeking’ when they come to the tomb ) is: ‘Ihesum Nazarenum crucifixum’. This is the standard response.\nI know Wilson has dropped her but she keeps on appearing as an authority!! and on the hitherto respectable Smithsonian too. Don’t they run  these things past experts on medieval texts before they are broadcast?\n\n","date":"January 13, 2015 at 4:10 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-182991","author":"Charles Freeman","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"Frale is on the second extract- the one  about the Vatican.\nI see they are recycling Garlaschelli too- he is still locked in the idea that the Shroud was created as it is now but at least he realises that the pigments were once there – he thinks they were deliberately removed in the Middle Ages but this would not explain the many seventeenth century depictions we have that suggest otherwise. Why rule out natural decay of the surface for which we have lots of evidence for other linens?\n\n","date":"January 13, 2015 at 6:02 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183004","author":"Charles Freeman","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"Sorry, Charles but this is not the Garlaschelli’s hypothesis. It seems an odd “recycling” of him.\nThis is the resum of his position by himself: \n“The most likely explanation, in our opinion, is that the image, as it can be seen nowadays, is achemical etching of the cellulose of the linen fibers. This degradation can be accounted for by non neutra limpurities contained in the ochre that a mediaeval artist used to generate the image by a simple frottage technique. The original pigment came off during the many years of the Shroud’s history, leaving the well-known ghostly weak image”.  “How was the Shroud made?” ( Bold is mine. You can see a longer report (in Italian) here: https://sites.google.com/site/luigigarlaschelli/shroudreproduction).\n\n","date":"January 13, 2015 at 6:31 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183011","author":"David Mo","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"David. I am happy to be corrected, especially as  this is close to my thesis that what we are left with on the Shroud is images after the pigments have fallen off.\nI am not sure why the frottage technique was needed.\nHow does he explain the images just being on the outer fibrils- does his theory cover that?\nAs you will know, I also believe that this was never intended to be a forgery. No one would have been taken in by a cloth with images on it when none are mentioned in the gospel sources. That is perhaps why the Cadouin Shroud, with its historical background in the Holy Land (actually an Islamic cloth), pulled in the pilgrims over centuries and outclassed the Shroud until the Savoys got it and (in my opinion) realised that with the images as they existed then, they could exhibit before mass audiences.\nThanks for your (Spanish) comments on my article.\n\n","date":"January 13, 2015 at 7:23 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183017","author":"Charles Freeman","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"P.S. Where I went wrong was to think that Garlaschelli argued that the pigments were removed by the original appliers of it and that he was showing in his oven how they did it!\n\n","date":"January 13, 2015 at 7:40 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183019","author":"Charles Freeman","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"Give it a rest, Charles. You are flogging a dead horse. The Lier copy of the Shroud, 1516, should be enough to dismiss your entire hypothesis that the body image was once much darker and more easily visible than the one we see now. \n\nAnd calcium does not necessarily equate to calcium carbonate (unless one has done the classic wet chemistry test – acid plus lime water). The calcium content of the Shroud is entirely consistent with the presence of pectins that survive retting. Oh, and  why was the major part of your thesis – the use as ‘prop’ for an Easter festival – relegated to the online supplement of History Today, and not part of the printed proceedings? In what way does that make it any more authoritative or ‘independently scruitinized’ than one of my blog postings?\n\n","date":"January 13, 2015 at 9:13 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183031","author":"Colin Berry","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"The article was submitted as a whole. Both parts were scrutinised by the HT advisers and both parts passed in front of a prominent Oxford professor of church history before they went up. The decision I made in discussion with the editor was, seeing the total length of the original article which he wanted to publish unshortened, whether to publish it in consecutive issues or to publish both parts simultaneously with the second in the digital edition and then the whole article (without the illustrations that were too expensive to buy for the www) freely online. As HT are pushing their digital edition we decided for the latter in the hope of bringing in new readers across the divide between print and digital. Judging by the large number of hits the article has had it looks as if we made the right decision.\nI am flogging a dead horse with you Colin but not with other specialists in this area who feel I am moving things on after a period of stagnation in Shroud studies. As you will know, the copies are not much use (although the ‘naked’ Lier copy is useful in providing yet more information that the loincloth was added in accordance with the 1563 decree of the Council of Trent), you need to look at the actual depictions, a whole range of them, to isolate the features originally on the Shroud that are now lost.\nI look forward to hearing of other examples of ancient linens that have calcium on them that can be traced back to the retting. It is a new one on me but I suppose one could have retting in a limestone area- even though flax was not always prepared by retting but by putting out in the sun. I do want to know of other known examples before I buy this one- otherwise it is just possible that it was dreamed up by someone . . ..\n It was STURP who suggested calcium carbonate but it is quite possible that they got it wrong. It can be calcium sulphate, of course- it varied from one part of Europe to another with the Alps the divide between c carbonate (north) and c. sulphate ( south). And there were other ways of sizing but ‘large’ quantities of calcium (STURP/Heller) did catch my eye.\nThe image is on the outer fibrils only. You either have an unsealed cloth  with a body that (?miraculously) transferred its liquids but knew when to stop and how to prevent them spreading further into the capllaries or a sealed one that locked out  the liquids, pigments, whatever that were applied to it. We have no known example of the former but lots of the latter as you will see from the postings I have put up.\nBut, thank goodness, I do not have to convince you of anything Colin- I am going for the specialists in these things and it is no disrespect to you that I have never seen any evidence that you have studied the specific ways of putting images on medieval ( or earlier) linens.There are people who have- these are the ones I have to convince!\n\n","date":"January 13, 2015 at 10:04 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183037","author":"Charles Freeman","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"There is no painted image on the TS, Charles. It is purely a pigment of your imagination.\nCalcium does not require retting. Indeed it would be reduced by retting. Calcium is simply one of the counteranions to negatively charged uronic acid groups of pectin that maintains electrical neutrality. It’s a natural constituent of flax fibres, some of which survives retting to remain in linen. Where’s the microscopic evidence for solid chalk or gypsum particles?\n\n","date":"January 13, 2015 at 10:18 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183039","author":"Colin Berry","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"Typo: Counterion, not counteranion, Ca++ being of course a cation .\n\n","date":"January 13, 2015 at 10:59 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183045","author":"Colin Berry","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"I agree that there IS no painted image on the Shroud today, although a new microscopic examination nearly forty years of technological advance on from 1978 might still find evidence of pigments. The question is whether there were originally painted images as the Benedictine monk of 1449 thought there were, ‘wonderfully painted’. That is where the research needs to focus and be carried out by people who actually work with these things in laboratories – so that rules ME out. \nAs everyone knows by now, it is the further research, some of which needs direct access to the Shroud and some, the relationship of the measurements of the Shroud to different kinds of loom, for instance, does not, that I am pushing for, especially the research which does not need direct access to the Shroud as we may actually be able to find a professional who can be brought in to do it now.\nTaking up Carlos’s point from below, I cannot see why you have to make any special study of the Shroud to relate its measurements to the range of looms that we know existed. It is the expertise of people who know about looms that we need!\n\n","date":"January 13, 2015 at 5:16 pm","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183096","author":"Charles Freeman","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"Charles:\nUsted puede ver la magnífica copia de la “Sábana de Torres de la Alameda” (España), una de las mejor conservadas y que tiene la siguiente inscripción:\n“ESTE ES EL VERDADERO RETRATO DEL SANTÍSSIMO SUDARIO, SACADO DAL ORIGINAL EN TURÍN Y TOCADO A ÉL EN 3 DE MAYO DE 1620 AÑOS.”\nEs monocromática, con similar aspecto “fantasmagórico” que la Sábana de Turin, y no se aprecia “perizonium”.\nhttp://fotos.lainformacion.com/fotos/torres-de-la-alameda-expone-estos-dias-una-de-las-copias-mejor-conservadas-de-la-sabana-santa_qNt1T2aaLy9b8mxEZwOYm6/\nCarlos\nPD: la opinión de “expertos” que no hayan estudiado la Sábana es IRRELEVANTE.\n\n","date":"January 13, 2015 at 1:31 pm","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183066","author":"Carlos","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"Carlos- your last sentence. I totally disagree- we need many more experts from outside with relevant skills and expertise, in fields such as weaving in ancient and medieval times, the iconography of images of the Passion, the way in which linens were painted, especially when images have decayed, how the the Shroud ,if medieval, need not have been designed as a forgery. Of course, they must do some study of the Shroud but it is vastly more important that the Shroud is compared with other cloths and relics and not treated as if it were somehow unique. Many features of the Shroud can be compared to similar ones found elsewhere but this is an area where the research has hardly begun.\nI was interested in an article I read on painted linens some time ago ( I think it was from the later 1980s or early 1990s) when the author just mentioned, in an aside, the Turin Shroud as a typical medieval painted linen as if there was no argument about it. She did not even think that she needed to say anything more.\n\n","date":"January 13, 2015 at 4:56 pm","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183093","author":"Charles Freeman","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"I have not been able to access the full programme, but only the clips, which illustrate three of the four ‘radical theories’ mentioned above; Guarlaschelli’s painting, Evans’s photograph and Frale’s death sentence. Can anyone tell me the fourth?\n\n","date":"January 13, 2015 at 4:27 pm","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183087","author":"Hugh Farey","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"Maillard reaction supported by Schwortz.\nSee also Barrie’s “behind the scenes” report:\nhttp://www.shroud.com/pdfs/behind.pdf\nIn the end, they artificilally equalized the worthiness of all 3 theories (Frale’s “death certificate” theory was featured only in the first part of the show).\n\n","date":"January 13, 2015 at 4:36 pm","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183089","author":"O.K.","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"Having talked to BBC History ( who make programmes directly for the BBC and not through an intermediary) about the Shroud I can see why this programme has not appeared on BBC. I was, quite rightly, grilled on everything I said, and this was when, so far as I know, no programme has even yet been commissioned and this was just preliminary research. They made it clear that they would check everything I said independently with an expert ( one or two of whom I had myself been in contact with). So Barbara Frale would, I hope , have been picked up for her misleading comments but I suspect  they soon spotted that this was not up to standard academically as soon as they peer reviewed it.\nStill there are BBC programmes that dumb down so one never can be sure which way it would go. I would hope that if a Shroud programme ever happens it is of equal standard to the forthcoming Wolf Hall series which promises to be the  BBC at its best.\n\n","date":"January 13, 2015 at 5:37 pm","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183099","author":"Charles Freeman","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"“I was interested in an article I read on painted linens some time ago ( I think it was from the later 1980s or early 1990s) when the author just mentioned, in an aside, the Turin Shroud as a typical medieval painted linen as if there was no argument about it. She did not even think that she needed to say anything more.”\nIs this supposed to be serious scholarship? Someone Charles comes across in reading describes the TS as a “typical medieval painted linen” despite the absence of paint, and considers ii sufficiently noteworthy to round off a comment, as if playing a trump card.\nThis is not just crankish. It is downright perverse and a travesty of scholarship.\nAdmit it Charles. You are not a genuine historian, are you? Where are your peer-reviewed papers published? Where did you do and/or publish your doctoral or other research thesis?\nAs for  your earlier comment about Shroud research having stagnated until you and your magazine article arrived on the scene, I find your presumption and arrogance totally nauseating. Goodbye. Good riddance.\n\n","date":"January 13, 2015 at 5:34 pm","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183098","author":"Colin Berry","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"well put!\n\n","date":"January 14, 2015 at 3:38 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183178","author":"Thomas","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"Thanks Thomas.\nWhere I’m concerned, there’s nothing more that needs to be said. Charles has failed abysmally to make a case. Indeed, his views on the TS are little more than a sneer at decades of research.  Something that looks like an imprint of a man left on an up-and-over sheet of linen,  with 3D-properties and other unusual characteristics, that is faint and diffuse even in the earliest copies, is hardly likely to be a painting. least of all when there are no obvious residues of artists’ pigments.\nQuite what Charles hopes to achieve with his empty theorizing is anyone’s guess. One thing’s for certain. He’ll get no further attention or interest from this blogger.\n\n","date":"January 14, 2015 at 4:01 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183187","author":"Colin Berry","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"Colin, you have ruined my day!\nWhat I am hoping to get is the odd free lunch as offered me today by yet another TV producer who gas enjoyed my article!\n\n","date":"January 14, 2015 at 4:30 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183189","author":"Charles Freeman","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"Colin, you can follow me up under ‘Charles Freeman Yale University Press’ easily available online and then access the Yale US website and look up my Holy Bones  and read the reviews.\nI then shall await your assessment as to whether I am a genuine historian or not.\nThe only point I was making is that this particular scholar did not see anything unique about the Shroud- it fitted into the SUBJECT of the article on medieval painted linens and she had far more interesting ones to discuss. For her it was obviously run of the mill, mentioned as a matter of interest. So far as I remember this article was just after the carbon dating and the Shroud had been defused as a serious academic subject.\n\n","date":"January 13, 2015 at 5:43 pm","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183102","author":"Charles Freeman","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"From the Telegraph. 19 April 2011 (my italics)\nhttp://www.telegraph.co.uk/culture/8450313/Holy-Bones-Holy-Dust-by-Charles-Freeman-review.html\n“To these contributions to cultural history Freeman adds one more, when he suggests that the soaring architecture of “Gothic” cathedrals was largely a consequence of the desire of abbots and bishops for a new kind of light and space in which to exhibit their relics.\nHe does not argue the case in detail; and otherwise his book, it should be said, is not so much a work of original research as a valuable summary of known facts. But if this rather novel claim is correct, it makes me think that those relics did perform a major miracle after all. \nHoly Bones, Holy Dust: How Relics Shaped the History of Medieval Europe\nby Charles Freeman\n306pp, Yale University Press, £25 \nOne published work, with no peer review outside of editorial scrutiny,  described above as “not so much a work of original research etc” doth not an academic historian make methinks…\n\n","date":"January 13, 2015 at 5:57 pm","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183104","author":"Colin Berry","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"We writers live in a free world and I have written many books and I have had everything from abuse to praise- but always continual work from respected sources, the last three publications by university presses.. Perhaps to balance Colin’s cherry picking you should go ,as I suggested, to the Yale University Press US site( they have kept the reviews up to date ), access Holy Bones and read the review extracts. You will see why I feel I have some reason for attempting to place the Shroud within the wider world of relic cults.\n\n","date":"January 14, 2015 at 2:40 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183171","author":"Charles Freeman","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"From Cambridge Journals Online, October 2014.\nhttp://journals.cambridge.org/action/displayAbstract?fromPage=online&aid=9409273&fileId=S0038713414001973\nReviews\nCharles Freeman , Holy Bones, Holy Dust: How Relics Shaped the History of Medieval Europe. New Haven: Yale University Press, 2011. Pp. 306; 16 black-and-white figures. £25. ISBN: 978-0-300-12571-9.\nDavid Perry\nDominican University \nQuote:\n“This is a popular work of history aimed at educated nonacademics and students.”\n\n","date":"January 13, 2015 at 6:30 pm","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183112","author":"Colin Berry","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"In the interview with Dr.Barbara Frale in the link below she uses the letters that are said to be seen on the Shroud as a means to authenticate the Shroud:\nhttps://www.academia.edu/7447446/Was_there_a_link_between_the_Knights_Templar_and_the_Turin_Shroud_An_interview_with_Dr._Barbara_Frale\nShe is not the first one to “see” such letters on the Shroud, as “Shroudies” know, and the claim it has its problems.\n1) Such identification requires paleography. She used the same method employed by Father Werner Bulst to confirm that an image — a coin minted during the time of Pilate — could be seen on one eye of the Man of the Shroud. He sent a photograph of just what he thought he “saw” to Ari Kindler of the Israel Museum, without telling him that it had anything to do with the relic.\n2) In one of my three interviews with Father Joseph Fitzmyer, one of the greatest New Testament scholars of the last century, I heard him tell me that there is no record of any group identified as “Nazarene”. Epiphanius wrote about “Nazarenes”, but that was in the fourth century and there is a big Christian community in the south of India called “Nasrani” because their origin can be traced to a Jewish-Christian group that landed in that part of the country (after doubting Thomas?).\n\n","date":"January 13, 2015 at 7:28 pm","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183118","author":"Louis","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"I think it’s important not to get too polarised in our opinions. If the Shroud was made in the 13th/14th century, then somebody made it, and for a reason, and within some kind of cultural context in terms of representation. Thomas de Wesselow pointed out how unnecessary, and how untypical, is the faint image we see on the Shroud, compared to other “miraculous images”, and on those grounds decided that the Shroud wasn’t medieval at all. Charles Freeman agrees with de Wesselow that culturally the image on the Shroud does not look like a forged relic, but seeks another possible context. Paradoxically, while a “miraculous relic” need not have looked “realistic” at all, a stage prop might have gained credibility by being so. Colin Berry’s argument, that the Shroud was meant to look as if it was derived from sweat etc., actually fits better into Charles’s Quem Quaeritis scenario than it does into the forged relic one.\nThere are problems. If the Shroud was much brighter and clearer than it is now, Charles needs to explain how such a uniform disappearance of pigment might have occurred, the apparent absence of any protein to bind the gesso, and the faint images that appear in copies. If the Shroud wasn’t much brighter and clearer than it is now, Colin needs to postulate a method of creating it. (To be fair, he has suggested several). I wonder if there isn’t a middle course – that the Shroud was created to look “realistic” by applying something which had the unexpected (or expected, if experiments had been carried out) effect of degrading the fibres, which when discovered, resulted in the Shroud being thoroughly washed clean of every other substance. Garlaschelli’s experiments with blue paint come to mind.\nDoes old linen contain calcium in “relatively large” proportions? How did the STuRP team know what sort of proportions to expect? Colin suggests that “the calcium content of the Shroud is entirely consistent with the presence of pectins that survive retting.” Am I right in supposing that all flax contains some calcium before retting? And that the retting process removes some or all of it, rather than adding to it as Heller and Adler seem to suggest? In that case, I would expect most pre-industrial linen to have a “relatively large” proportion of calcium compared to modern linen, which has sustained a more thorough retting. Is this in fact the case?\nAs for Charles being a Historian or Colin a scientist, I’m not too bothered about nomenclature. Thanks to Colin I know a lot more about bilirubin and hemicellulose (and much more besides) than I did before, not because I took his word as gospel, but because he gave me ideas to check on elsewhere and on which to build ideas of my own. Thanks to Charles I know a great deal more about the Quem Quaeritis ceremony and the Zittau fastentuch, again, not because his word is law, but because his researches open a door through which other people may pass to discover more about them for themselves. Over the past few years, there has been, in my opinion, an over-reliance on “experts” and a reluctance even to question them for clarification, let alone to disagree with them. To some people, Barbet, Bucklin, Heller, Adler, Rogers and/or several others have attained some kind of unassailable authority which renders any inquiry intio their work almost heretical. Thank goodness neither Colin nor Charles have joined them. Being alive and on the internet is very helpful too!\n\n","date":"January 14, 2015 at 8:03 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183206","author":"Hugh Farey","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"Here’s a thought. If it is medieval – whose to say it was crafted in medieval Europe? Might it have been crafted in Egypt or Syria or even farther afield, using methods unseen in Europe? There are many skills/knowledge that our forbearers had, which we have long forgotten — and this varied as well based on geography no doubt. If one believes in medieval provenance, the net needs to widen considerably for parallel technology…because right now the wheels they be a spinning in the mud of Europe.\n\n","date":"January 14, 2015 at 9:39 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183221","author":"David Goulet","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"There’s a sizeable literature on pectin/calcium/retting, Hugh. From my reading so far the general principles are reasonably well understood. Calcium plays an important role in the pith of flax stems, forming bridges between the pectin molecules, stabilising the structure. Retting, i.e. microbial or chemical breakdown, is greatly assisted in model systems by including a chelating agent (EDTA, oxalic acid etc) that ties up the calcium and makes it easier to digest the pectin, thereby separating the flax fibres. One finds at the end that there’s just a small proportion of the initial  calcium present, typically 25ppm, a sixth of the original (data and source available on request). So calcium goes down on retting, not up, but what’s left at the end may well account for the Ca that’s presently being attributed to added chalk or gypsum – with no good evidence that I can see.\n\n","date":"January 14, 2015 at 10:51 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183235","author":"Colin Berry","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"That’s really interesting, especially in the light of Heller & Adler’s comment: “During this process [retting] the natural ion exchange properties of cellulose operate and two ions found commonly in natural waters that most strongly bind in this way are Ca and Fe, with the former being more strongly bound, as reflected in the relative concentrations seen in the X-ray studies. Iron found deposited on linen this way is quite common … In fact, linen makers are specifically enjoined against using ferruginous waters for retting as it will stain the cloth.” Their references for this are Ott, Spurlin and Grafflin, Cellulose and Cellulose Derivatives, which you may already know, and Jahn, The Chemical Behaviour of Wood, in Wood Chemistry journal.\nIf you are correct about the calcium, it seems that iron works in a completely different way.\nFurther, if a “natural” proportion of calcium is 150ppm, and Heller and Adler found 1% by weight (and then only on the surface), then no wonder they referred to a “relatively large” proportion.\n\n","date":"January 14, 2015 at 11:42 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183245","author":"Hugh Farey","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"Good point. We have to find a 1400AD conjunction of technical and cultural probability. The 3/1 herringbone seems characteristic more of north-west europe than anywhere else, although any cultural characteristic both diffuses outwards from its heartland and also is occasionally simply carried elsewhere so crops up out of context. Otherwise, I have speculated on a Balkan heritage based on the epitaphios, or maybe an altar frontage or dossage, and Charles has suggested his mid-European Quem Quaeritis idea. If middle-eastern, then perhaps it is more likely to have been a deliberate forgery, maybe to feed the European ‘relic-frenzy’, although, as I have also suggested elsewhere, 1400AD was a little late in the day for that. I know nothing about the medieval Christian culture of Egypt or north Africa, but as you suggest, maybe that too would be worth investigating.\nRe Charles’s comment above:  “the author just mentioned, in an aside, the Turin Shroud as a typical medieval painted linen as if there was no argument about it. She did not even think that she needed to say anything more.” This was Joanna Cannon & Caroline Villers, in the introduction to “The Fabric of Images” compilation (p. ix), and the context in which they say it is worth reading.\n     “Convenience was not the only motive and the paintings discussed in this collection raise intriguing issues of relative status and value. Were these works [paintings on cloth rather than wood] always conceived of as second best, as more conveniently portable alternatives to panel paintings, or as cheap substitutes for tapestry or embroidery? Might there be a positive spititual, cultic, value to painting on linen in, for example, Perugia, where fixed linen altarpieces may have intentionally recalled, by their appearance, the powerful efficacy of plague banners? Might such miraculous associations stretch even further back, to the example of Veronica, an image believed to have been miraculously imprinted on textile, or (less far back) to the Turin Shroud, itself one of the best-known surviving medieval images on a textile-support? Could a presumed modesty and cheapness in the choice of a textile support also carry desirable connotations of poverty which made the technique especially suitable for the Mendicant Orders? Did the rising appreciation of painterly skill in relation to material value cause a shift in the relation between painting on textiles and embroidery?” Etc, etc. The answer to all these rhetorical questions is, of course, we don’t know.\n\n","date":"January 14, 2015 at 10:29 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183228","author":"Hugh Farey","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"Actually Hugh, it wasn’t this one, but very similar in that it mentions the Shroud as an aside. I remember reading it in an article in a journal I was not able to take out of the Cambridge University Library!\nThere were three-in-one herringbone silks in the third century AD – one was found as far east as Palmyra but they were all in silk and so very upmarket from humble linen. The V and A three -in-one is the only one I know in linen other than the Shroud. \nOn your earlier posting:\n‘If the Shroud was much brighter and clearer than it is now, Charles needs to explain how such a uniform disappearance of pigment might have occurred, the apparent absence of any protein to bind the gesso, and the faint images that appear in copies’ \nI don’t think the disappearance of the pigments would have been uniform. A clue to why not can be seen from the depiction of the exposition of 1868 by Ferdinando Perrin, reproduced on page 296 of Beldon Scott (I assume that all you keen Shroud researchers have got your copies of Beldon Scott by now!). Perrin shows the dorsal image pretty complete but the frontal image as virtually invisible from the waist down-in fact it begins to fade from the shoulders down. I take these depictions with caution- you really need to have several ones by different artists to compare against each other- but it is hard to know why Perrin painted so faded a frontal image but a much more intense dorsal image if this is not what he actually saw in 1868. It is also interesting that the 1868 exposition –the last for thirty years- was the first one in which they placed the Shroud in a frame and kept it within the cathedral. In 1842, the exposition before, it was still being held in the open by the clergy from the balcony at the Palazzo Madama. So what had changed? Had there been a marked deterioration of the pigments as apparently recorded by Perrin? Perhaps we can get into the cathedral archives for the mid-nineteenth century. . . .\nLots of further work to be done here.\n‘The apparent absence of any protein’. Below is what Mike Spyer said when he had read the Heller/Adler papers.\n‘The studies are all equivocal and would in my view fail to distinguish from the presence of other human or animal materials. There may well be proteins etc.’\nSo we certainly cannot rule out animal proteins. It is clear from what Kelly has said that there is a lot of confusion over this issue and certainly it seems difficult for anyone to be committed to the certainty of human blood any longer. Perhaps we have moved on here.\nFaint images in copies. Yes, but this is vastly outweighed in numbers by all the depictions and descriptions of the Shroud that remark on the intensity of a Shroud that seemed to attract very large audiences (compare today’s single file close-up). We MUST have a database of all these depictions, descriptions, copies, etc with open access to scholars, before we can move further on this one. We have to define the features of the Shroud that are seen again and again in past depictions but are now missing, the long hair at the back (not a pony tail), the gap between the elbows and sides of the dorsal image (making it impossible for these to be the same arms as those of the frontal image), the thumbs which are usually shown jutting out at the same angle by different artists, the Crown of Thorns (that is also mentioned in descriptions) . . .\nThe loincloth, probably added after 1563, is an interesting historical titbit. I was interested to read in Villers, ‘The Fabric of [medieval] Images’ that they did repaint linens that they valued.\nSerious research on the Shroud has scarcely begun- so much time has been wasted going down dead ends and ending up saying it is a mystery. Yet the more I talk to professional weavers, the more I hear that a cloth of this size, pattern and length is typical of a medieval treadle loom. (The sixth widths of the treadle loomed Zittau Veil make up 6.80 cms in total – do the maths for yourself to establish the average width of the linens and forget about Assyrian cubits! Even today one of the standard widths of a treadle loom is 45 ins.)  Remember we have to fix the origin of the weave before we need to worry about the origin of the images. On origin we also have to explain the Z twist in the yarn.\nBut at least we are debating relevant issues.\n\n","date":"January 14, 2015 at 11:31 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183243","author":"Charles Freeman","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"You’ve cost me a fortune Charles! First your own Bones, then Beldon, now Villers, with Schiller and one or two others thrown in for good measure…\n\n","date":"January 14, 2015 at 11:46 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183246","author":"Hugh Farey","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"I am sorry but there is so much material out there that needs to be brought into the debate!\n\n","date":"January 14, 2015 at 12:56 pm","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183257","author":"Charles Freeman","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"I should like to quiz Prof Spyer on the statement: “The studies are all equivocal and would in my view fail to distinguish from the presence of other human or animal materials. There may well be proteins etc.”\nHeller and Adler considered eight different protein tests: Ninhydrin, Amido Black (which had been used by Walter McCrone), Coomassie Brilliant Blues, Bromothymol Blue, the Biuret-Lowry Test, Bromcresol Green (selective for Albumin), Fluorescamine (selective for primary amino groups) and the application of proteases. Ninhydrin was rejected as its results were interfered with by the calcium and iron ions. The next two were rejected as they gave a positive test for pure cellulose, and therefore would have responded to the cloth as well as for any protein on it, and the next two were rejected as not sensitive enough. The last three produced visible changes to fibres associated with blood, but not with fibres from any other area.\nNone of the above demonstrates that the ‘blood’ areas are actually blood, but they do seem to demonstrate that there is no protein covering elsewhere on the Shroud. Can Prof Spyer explain why this finding is “equivocal”?\n\n","date":"January 14, 2015 at 4:31 pm","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183301","author":"Hugh Farey","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"This was a private communication to me- not a public one- but Mike Spyer agreed that his name  could be quoted in my footnotes to the article in relation to what he had found.  I think people who want to go further on this should get their own specialist to read the papers. All he was really saying was what he had read was ‘ totally unconvincing’ as to human blood and I see no reason why he should be asked to go any further to discuss proteins as I never asked him about them- the only thing  I asked  about was the presence of human blood and he tentatively mentioned proteins but this does not mean he ever made a proper study of them. Why should he reread all this stuff – and I sent him every page I could find- which he read several months ago after he had been one of my ‘students’ on one of my study tours.\nAlso Mike Spyer said he could pass everything on to a haematologist if I wanted although he could not see why this would come up with anything different.\nI take responsibility for what he said as part of my own research which I used for my article but this does not make him someone anyone else can access. He is a very busy man and did this for me as a special favour as he had enjoyed my tour. I don’ t think he should be involved ‘publicly’ any more than  he agreed to be, which was to have his name attached to the quotation he made.\nRemember he is a 2014 expert, Heller and Adler were working nearly forty years ago. There is really no comparison as things have moved on quite dramatically. I was talking to an elderly GP who said it was amazing what they know about blood know that they did not know when he started practising. Applying 2014 knowledge is quite likely to rule out what might have been unclear when Adler and Heller ( and their expertise in these matters is disputed by some) were working all that time ago.\n\n","date":"January 14, 2015 at 5:40 pm","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183310","author":"Charles Freeman","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"There are two issues regarding the presence of protein:\n1. The presence or absence of protein in non-image & image regions of the Shroud.\n2. The presence or absence of protein in blood areas of the Shroud.\nNo protein in 1. is a problem for gesso.  period.  This is what STURP found.  I don’t believe Dr. Spyer’s comments were in this context, they were related to the blood as pointed out (by Hugh)-naturally, these are capped (by Charles) with the all too prevalent know it all statement, such as: Remember, this is the opinion of a 2014 expert, and Heller & Adler were working 40 years ago-there is really no comparison…\nSTURP found protein in 2. This raises the issue of what proteins are there.  Hemoglobin, bilirubin, serum , immunoglobulin, ABO molecules (carbohydrates) are blood components.  \nWe know so much more about blood now than we did back then (here we go again).  Of course!!  But certain fundamental things haven’t changed.   Many such tests can be done more rapidly, more sensitively, but think about it: if these were detected using even such crude techniques, what would even more modern analysis show?  Is it even remotely possible it could go the other way?  It’s often the quantitation that improves with technology the most, the qualitativeness is the basis for many tests in the first place.  If it’s unequivocally shown to be human blood to any & all experts by all known modern space age tests, then that will take us to the next phase, which is it had to have been blood that was painted on…\nThe studies of Baima Bollone are markedly absent in this series of statements, it’s always Heller & Adler.  Garza-Valdes reported certain blood characterization studies as well.  Rogers did some experiments.  Baima Bollone openly discusses the negative findings of the 1973 commission, he found similar results initially as well.  We don’t hear much (none) about any of that, yet the 1973 has the spotlight shone on it.\nAll of it needs to be considered.\n\n","date":"January 14, 2015 at 8:57 pm","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183365","author":"Kelly Kearse","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"‘ All needs to be considered.’ Agreed. Obviously it is a muddle at present and little can be said with any certainty. . You will have noted my personal caution on this because of the large amount of cults involving blood of Christ and others in the fourteenth century. There was certainly a lot of blood associated with relics at that time. One monastery even had the actual liquid blood of Christ and they were one up on those who only had the dried variety. With bleeding hosts and crucifixes there was just a lot around.\n\n","date":"January 15, 2015 at 2:03 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183417","author":"Charles Freeman","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"Would you not agree Kelly that the chief difficulty as regards identifying the presence of ancient blood and distinguishing it from imitations (maybe more sophisticated than vermilion) is the organic nature of the constituents you list (proteins, carbohydrates) or their chemical instability (bilirubin). That’s why one needs to have an alternative marker or signature for blood that one can be certain does not degrade with time, or volatilize.  \nI did suggest one many moons ago, but fear I was misunderstood by you Kelly. I refer to mineral salts. You seemed to think I saw them as somehow trumping the ABO markers etc, that I was somehow failing to see they were non-specific to blood and therefore irrelevant. I’m not sure I ever managed to make you see the limited but crucial role I saw for mineral salts in answering the question: is it blood or a blood substitute?\nLet’s try again. Whole blood has a characteristic spectrum of metallic and non-metallic mineral ions. The chief cations of interest in the present context are sodium, potassium, calcium, magnesium and maybe some of the trace elements like zinc and copper. I’d include iron except it’s problematical for a variety of reasons. Then there’s the anions (chloride, sulphate etc).\nIf it’s whole blood on the TS, one expects a particular mix of cations and anions compared with blood-free areas which will be relatively potassium and magnesium rich. If the “blood” on the TS were a “serum exudate of retracted blood clots” then there would be proportionally (not absolutely, but proportionally note) less potassium and more sodium, less magnesium and more calcium. Nope, I’m not claiming those ions are specific markers for blood, which clearly they are not. I’m simply saying that when blood or blood serum is deposited on linen, then the characteristic mix of cations and anions should still be there centuries later, regardless of what has happened to the organic constituents by way of chemical and/or microbiological decomposition.\nI’ll say nothing for now about the ‘potassium’ controversy, and whether or not there’s sufficient potassium in TS blood stains to support a claim for whole blood as distinct from a serum fraction.\nWhat I do say is that any medieval forger minded to use vermilion as a substitute for real blood (whether of human or animal origin, whether whole or otherwise) would not have bothered or even been aware of its mineral composition. Surely a careful appraisal of mineral distribution, especially between blood v non-blood areas, can assist in deciding whether we are looking at blood versus a crude pigment substitute from an artist’s palette.It may even help distinguish between whole blood or a serum exudate where the organic constituents are extensively age-degraded. If consistent with whole blood (or even if not) then questions as to the origin or ABO-type of the blood then need more sophisticated analysis where mineral ions serve no further use.\nWas I misunderstood? Does this comment help to clear up any misunderstanding that may have existed?\nAfterthought: there’s a technical issue that I’ve omitted to mention, namely the (in)sensitivity of X-ray fluorescence detection, it being  suited to higher atomic number elements like potassium than to sodium. Any return by a STURP Mk2 to Turin should in my view include old-fashioned emission (‘flame’) or atomic absorption spectrophotometry even if destructive, or we risk having another 30 years of fruitless debate as to what the results mean. Many moons ago I proposed a comp0romise: harvesting soluble metal ions and other minerals by pressing a damp strip of de-mineralized fabric across the TS at one or more levels, causing minimal and probably unnoticeable damage, then dividing the strip into cm squares to get a mineral profile\n\n","date":"January 15, 2015 at 3:07 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183429","author":"Colin Berry","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"Typo: STURP found protein in 2. This raises the issue of what proteins are there. Hemoglobin, bilirubin, serum \nShould read serum albumin, immunoglobulin,\n\n","date":"January 14, 2015 at 8:59 pm","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183367","author":"Kelly Kearse","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"“Hailes Abbey became a site of pilgrimage after Richard’s son Edmund donated to the Cistercian community a phial of the Holy Blood, purchased in Germany, in 1270. Such a relic of the Crucifixion was a considerable magnet for pilgrimage. From the proceeds, the monks of Hailes were able to rebuild the Abbey on a magnificent scale.” (Wikipedia)\nSee what I mean about the importance of blood- this was later said to be duck’s blood refilled at regular intervals- but the incentive was there!\n\n","date":"January 15, 2015 at 2:53 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183426","author":"Charles Freeman","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"And there is the bloodstained corporal of Bolsena, traditionally dated to 1263 , and still a major  cult today. Some say that the face of Christ can be seen on the bloodstained cloth.\nSo with so much money to be made from these thirteenth/ fourteenth century blood cults, blood, real or alleged, human or animal,  on a relic of this period must always be viewed with caution as possibly added or created.  If there is blood on the Shroud it may only because it was following the trend of tHe day and have been embellished to give it greater impact. It may not even have been added to deceive  anyone as, although many early observers of the Shroud noticed the intensity of the blood ( quotes in my article) , it does not seem to be the blood as such that they venerated ( well, the sources could be interpreted differently on this).\nBut the incentive to associate blood with relics was certainly there.\n\n","date":"January 15, 2015 at 4:01 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183446","author":"Charles Freeman","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"“‘ All needs to be considered.’ Agreed. Obviously it is a muddle at present and little can be said with any certainty. . You will have noted my personal caution on this because of the large amount of cults involving blood of Christ and others in the fourteenth century…”\nThe only thing I’ve noticed from the beginning is scientific fumbling/confusion concerning the specifics, yesterday’s response being just one example.  It’s a pattern.  Finis.\n\n","date":"January 15, 2015 at 4:22 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183447","author":"Kelly Kearse","site":"shroudstory"},{"title":"Smithsonian Channel:  Is it the greatest prank ever pulled?","post":"Colin,\nI honestly don’t believe there was a misunderstanding. If so, it was unintentional-It may be just a matter of disciplines-biochemistry:immunology\nMy perspective (then and now) is one has to consider everything.  It’s all important.  I don’t believe one necessarily trumps the other.  But one has to consider the collective results.  I would be shocked if every box on the blood question could be perfectly checked, all black & white, no grey areas.This might raise the most suspicion for me-it’s old no matter which way you cut it, 700-2,000 years.  \nDegradation can be an issue, certainly.  But components, for example immunoglobulin, ABO have been reported to survive over time, or at least fragments of them, enough to detect them using immunological methods-If the result is negative, you don’t know, could be degradation or could never have been there to begin with.  If on the other hand, the result is positive and the controls are sound, how does one explain the results?  For me, this takes it past just paint, it takes it to at least primate.\nYes, mineral salts are (also) important.  I believe that if one considers the collective results on elemental analysis (STURP, Baima Bollone) as previously written with Thibault, the findings here are reasonable, potassium is not so much an issue. In the previous context, if a misunderstanding was there, it was the point that K+ alone cannot be looked at apart from the whole.  (Nor can it be ignored, either, but I believe-as written with TH-data show that the potassium isn’t lacking).\n  Whole blood, serum exudates, etc. In STL, I made the point that the most conservative (objective) scientific conclusion is that blood components are present.  I distinguished this from the conclusion that blood is present.  This is especially relevant to the issues of whole blood vs. serum exudate that you mention.  Yes, certainly a medieval forger would not have been aware of the mineral composition.  I think the same goes for addition of serum rings and presence of other blood constituents.  Perhaps a forger could have used real blood in his creation-I think it would be difficult-and would at minimum require the involvement of a body at some point as a template.  But that’s another question/set of questions.  \nColin, I appreciate the effort and time you put forth in writing this.  My apologies if there was a misunderstanding on my part.  And Thank you for mentioning wanting to use an old-fashioned technique…\n\n","date":"January 15, 2015 at 6:06 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","id":"comment-183466","author":"Kelly Kearse","site":"shroudstory"}]
