[{"title":"Discovery Promoting Shroud Video on Feature About Two New Saints","post":"Dan,\nAs far as I know this is old news. Ramsay tested Jackson’s theory and it didn’t pan out in terms of carbon in the atmosphere effecting the results. Rolfe committed himself to Jackson’s theory and never mentioned the work of Ray Rogers.\nThat was a terrible omission.\n\n","date":"April 28, 2014 at 9:28 pm","url":"https://shroudstory.com/2014/04/28/discovery-promoting-shroud-video-on-feature-about-two-new-saints/","cat":"news_&_views","id":"comment-105303","author":"John Klotz","site":"shroudstory"},{"title":"Discovery Promoting Shroud Video on Feature About Two New Saints","post":"Only time will tell.  Ray Rogers was undoubtably a brilliant chemist. He had little concept of the nature of complex, sizeable images.  If he had, he would never have suggested that putrefaction could account for the homogeneity of a 14ft dorsal and ventral image of a corpse.\n\n","date":"April 29, 2014 at 5:24 am","url":"https://shroudstory.com/2014/04/28/discovery-promoting-shroud-video-on-feature-about-two-new-saints/","cat":"news_&_views","id":"comment-105593","author":"David Rolfe","site":"shroudstory"},{"title":"Discovery Promoting Shroud Video on Feature About Two New Saints","post":"David,\nWhen it comes to image and image formation, I do not think that Rogers was ahead of Jackson. No one has made a convincing case for any process that does not ultimately point to the Resurrection. That certainly, on that issue,  puts me closer to Jackson than Rogers.\nHowever, Jackson’s theory which was expressed in the film as to carbon dating didn’t pan out. Unless, I am mistaken (and I think I am not) the clip was from an film several years old. .\nUnfortunately, Rogers published a critique of Jackson on image formation in the last century that as we would say in my old neighborhood, “Got Jackson’s dutch up.” \nAs a result, Jackson appears determined to claw at Rogers, and not altogether fairly. His hypothesis on atmospheric carbon didn’t pan out and now, as I understand it, he hypothesizes  some reaction caused by the Resurrection. As to the issue of the carbon dating we don’t have to go there. As to the issue of image formation I believe that ultimately we have to.\nBut the issue of carbon dating of a much abused corner of the Shroud  is distinct from the issue of image formation. Rogers work on carbon dating was peer reviewed and in the last two years of his life he sought opinions from colleagues and asked them to check his work. \nAt least one of those he asked to review was John Brown of Georgia Tech  was a giant in his field. He had a scanning microscope in his dinning room.\nAnd I am having a “duh” moment on the issue of image formation. Scattered here and there are references to concern that Shroud has to be protected from ambient light because it can accelerate the aging process that is darkening the whole cloth and may eventually swallow the image. Once upon a time the Shroud was a pure white linen cloth. Now it is not.\nWhen the Mona Lisa was subjected to a multispectral digital imaging process,  Lumiere Technology had to develop a unique source of light that did not damage the painting. They did so. But the problem of light and the Shroud is not dissimilar.\nNow what caused this image?  Could it be light from a unique source? Duh.\n\n","date":"April 30, 2014 at 7:47 am","url":"https://shroudstory.com/2014/04/28/discovery-promoting-shroud-video-on-feature-about-two-new-saints/","cat":"news_&_views","id":"comment-106696","author":"John Klotz","site":"shroudstory"},{"title":"Discovery Promoting Shroud Video on Feature About Two New Saints","post":"We know the outcome of these tests. I still don’t know wether Pr Ramsey genuinely thought CO could have shifted the dates.\n\n","date":"April 30, 2014 at 3:48 pm","url":"https://shroudstory.com/2014/04/28/discovery-promoting-shroud-video-on-feature-about-two-new-saints/","cat":"news_&_views","id":"comment-107096","author":"anoxie","site":"shroudstory"},{"title":"Discovery Promoting Shroud Video on Feature About Two New Saints","post":"Professor Christopher Ramsey, a practicing Christian, does not believe that the results of the 1988 carbon dating were skewed. He is willing to open the doors of the laboratory again if another test will be needed.\nThere can be no doubt that Ray Rogers was a very competent scientist, yet one gets the impression that his views on the image-formation process were coloured by his world-view, that is, some naturalistic explanation had to be obtained, in some way or the other. First there was a reference to a “lunatic fringe”, aimed at those who believed  in the authenticity of the TS. Then, after the possibility of authenticity was accepted, came the attempts to get rid of any hypothesis that smacked of the supernatural.\nThere is no complete theory of anything, even Hawking realises that and keeps changing his theories, certainly not dismissing altogether any possibility of talk about God. Would he have to be placed in the category “lunatic fringe”?\n\n","date":"April 30, 2014 at 6:22 pm","url":"https://shroudstory.com/2014/04/28/discovery-promoting-shroud-video-on-feature-about-two-new-saints/","cat":"news_&_views","id":"comment-107230","author":"Louis","site":"shroudstory"},{"title":"Discovery Promoting Shroud Video on Feature About Two New Saints","post":"“Professor Christopher Ramsey, a practicing Christian, does not believe that the results of the 1988 carbon dating were skewed.”\nDoes Pr Ramsey believe/grant the sampling has not been skewed ?\nThe interpretation of the dating should be multidisciplinar. \nThis leads to a question to modern archaeologists : what makes a C14 dating result meaningful ?\n\n","date":"May 1, 2014 at 1:48 am","url":"https://shroudstory.com/2014/04/28/discovery-promoting-shroud-video-on-feature-about-two-new-saints/","cat":"news_&_views","id":"comment-107583","author":"anoxie","site":"shroudstory"},{"title":"Discovery Promoting Shroud Video on Feature About Two New Saints","post":"Professor Ramsey signed the “Nature” paper, he worked on the sample brought to Oxford, that was his task, together with other scientists in the laboratory. I am not defending him, although I can understand his point of view, which is crystal clear in Ian Wilson’s last Shroud book.\nWho took care of the sampling was Dr. Michael Tite, together with Professors Gonella and Riggi, authorised by Cardinal Anastasio Ballestrero, a prelate who is said to have been influenced by his Carmelite background, which means is, “there are no material supports for faith.” Gonella and Riggi took a very long time to decide from which site the sample had to be cut, deciding on the dirtiest part of the relic. The rest is known. \nYes, the interpretation of the dating should be multidisciplinar, and there are several hypotheses on how it may have been skewed. The Church is willing to conduct a new C14 test, however it appears that the hesitation is due to mistakes made in the past. Now, what happens if the new dating gives a medieval date? Will the clerics feel like returning it to the di Savoia family? \nIt is always better, therefore, to refrain from cutting another piece of the precious relic unnecessarily, more studies and a fresh hands-on examination are needed. The papers, including the peer-reviewed ones, do not seem to have convinced Turin and Rome. Benedict XVI sent his message to the last Shroud conference held in Dallas, Francis is more bothered about serious issues, the relic is not an article of faith.\nPerhaps all Christian believers have to act like Carmelites when the need arises, almost all are “brought to the test” at some time or the other in their lives. God does turn down the blinds… the rest is a matter of faith.\n\n","date":"May 1, 2014 at 10:02 am","url":"https://shroudstory.com/2014/04/28/discovery-promoting-shroud-video-on-feature-about-two-new-saints/","cat":"news_&_views","id":"comment-107923","author":"Louis","site":"shroudstory"},{"title":"Discovery Promoting Shroud Video on Feature About Two New Saints","post":"I don’t think Benedict XVI or Francis see the shroud as a relic or an icon.\nRather as a heartbreaking reminder/gift/sign that “the darkest mystery of faith is at the same time the brightest sign of a hope without limits”.\nConcerning another C14 dating, it should be part of a new comprehensive round of scientific investigations, but there is no hurry.\n\n","date":"May 1, 2014 at 11:51 am","url":"https://shroudstory.com/2014/04/28/discovery-promoting-shroud-video-on-feature-about-two-new-saints/","cat":"news_&_views","id":"comment-107992","author":"anoxie","site":"shroudstory"},{"title":"Discovery Promoting Shroud Video on Feature About Two New Saints","post":"Critics of Rogers’ view on image formation keep rolling it into a critique of his work on he shroud samples. Rogers analysis included threads from the material held back FROM THE CARBON AREA that were retained by Luigi Gonella. His science in that regard was completely peer reviewed. He asked other scientists to double check his work. They did and they concurred.\nThat’s one issue.\nHis ideas on image formation were incomplete as even he realized.\nRogers work on the carbon test area was completely transparent. The fact is that  he had a hypothesis that even he realized was incomplete when it came to the image formation problem.\nIt is not logical to combine the critique of his incomplete image formation hypothesis with criticism of his documented and work on the threads from the carbon test area.\nIt’s really depressing that people who have an argument with his image hypothesis then feel it necessary to blow smoke about his work on the carbon test site threads. \nIt’s apple and oranges. Logically it is self-defeating for one faction to try to discredit another faction on an issue. We should be open to multiple view points. There is no conflict between the proof that the carbon testing area was subject to repairs and that the image formation process implicates the resurrection directly. One, the carbon testing, is directly resolvable by scientific testing of the physical threads. Rogers did that. The other is still a bit over the horizon.\n\n","date":"April 30, 2014 at 6:47 pm","url":"https://shroudstory.com/2014/04/28/discovery-promoting-shroud-video-on-feature-about-two-new-saints/","cat":"news_&_views","id":"comment-107250","author":"John Klotz","site":"shroudstory"},{"title":"Discovery Promoting Shroud Video on Feature About Two New Saints","post":"Anoxie says: May 1, 2014 at 11:51 am Quote\nI don’t think Benedict XVI or Francis see the shroud as a relic or an icon.\nRather as a heartbreaking reminder/gift/sign that “the darkest mystery of faith is at the same time the brightest sign of a hope without limits”.\nConcerning another C14 dating, it should be part of a new comprehensive round of scientific investigations, but there is no hurry.\nThe point is not clear: if the pontiffs do not see the Shroud as a relic or an icon, what is their explanation? I agree with what you quoted, it is indeed a heartbreaking reminder, but theology does not help here.\nThe rest is easy to agree with, it is what I said in the previous comment.\n\n","date":"May 1, 2014 at 12:13 pm","url":"https://shroudstory.com/2014/04/28/discovery-promoting-shroud-video-on-feature-about-two-new-saints/","cat":"news_&_views","id":"comment-108010","author":"Louis","site":"shroudstory"},{"title":"Discovery Promoting Shroud Video on Feature About Two New Saints","post":"Louis, I don’t think the pontiffs need an explanation at all. It is what it is. I’m a scientist and I want quantification and measurement and evidence, but theologians can look for meaning and interpretation without necessarily needing the same.\n\n","date":"May 1, 2014 at 12:27 pm","url":"https://shroudstory.com/2014/04/28/discovery-promoting-shroud-video-on-feature-about-two-new-saints/","cat":"news_&_views","id":"comment-108025","author":"Hugh Farey","site":"shroudstory"},{"title":"Discovery Promoting Shroud Video on Feature About Two New Saints","post":"Hugh,\nOn this point we may be agreement.\n\n","date":"May 1, 2014 at 12:41 pm","url":"https://shroudstory.com/2014/04/28/discovery-promoting-shroud-video-on-feature-about-two-new-saints/","cat":"news_&_views","id":"comment-108040","author":"John Klotz","site":"shroudstory"},{"title":"Discovery Promoting Shroud Video on Feature About Two New Saints","post":"Hugh writes:May 1, 2014 at 12:27 pm Reply | Quote\n“Louis, I don’t think the pontiffs need an explanation at all. It is what it is. I’m a scientist and I want quantification and measurement and evidence, but theologians can look for meaning and interpretation without necessarily needing the same.”\nSorry, Hugh, while it is possible to agree that the pontiffs need no explanation, the same cannot be said about many among the laity, sceptics,cynics, atheists and agnostics. There was pressure on Turin in 1988 and there still is today. For the pressure in 1988 see the interview with Father Heinrich Pfeiffer:\nhttp://holyshroudguild.org/uploads/2/7/1/7/2717873/an_interview_with_professor_heinrich_pfeiffer_sj.pdf\nThe pressure today can be seen in your query to Bishop Marcelo Sánchez Sorondo. What I mean is that if you, as a “Catholic to the core”, did apply some pressure now, what about the rest in the list?\nThe pontiffs are humans, like the rest of us, and it is hard to believe that their curiosity has not been aroused, although they do not mix up the relic with matters of faith. Good theology has to be based on Scripture, good Shroud theology on what you call “quantification and measurement and evidence.” If not, then it is guesswork and speculation, and that, as you know, living in England,where Prime Minister David Cameron, a practising Anglican who faced attacks last week, will simply not be swallowed.\n\n","date":"May 1, 2014 at 1:35 pm","url":"https://shroudstory.com/2014/04/28/discovery-promoting-shroud-video-on-feature-about-two-new-saints/","cat":"news_&_views","id":"comment-108078","author":"Louis","site":"shroudstory"},{"title":"Discovery Promoting Shroud Video on Feature About Two New Saints","post":"Louis,\nI think the point is, and you may agree, that the factual authenticity of the Shroud is not a matter of faith, but of science. The piece of linen called the Shroud of Turin  either covered the body of Christ at one time, or it did not. If it did not, there may be all kinds of beautiful things to say about the Shroud, but they arejust beautiful words, but not facts.\nI don’t mean to be obtuse, but if the Shroud is not the factual, authentic Shroud of Christ. than any other observations is just words.\nI believe that it is authentic by applying the standards of proof we use every day of our lives, not just in court. Perhaps also, we might apply e words of Christ rebuking the deliberate obtuseness of the Pharisees and priests:\n“When you see a cloud rise in the west, straight away, you say, ‘There is a shower coming’ and so it is that a shower comes. And when you see the westwind blow, you say ‘There will be heat’ and then that happens. You hypocrites, you can understand the face of the sky and the earth, but how is it that you can not understand the signs of the times?” Luke 12:54-56\nThe Shroud of Turin is a sign of OUR times brought to us not by scripture but by science. It’s authenticity can only be rebutted by facts, not theological musings.\nThe carbon dating by the labs is both scientifically and factually challenged, but that is a whole another debate. [back to the Chapter 17, the  Apocalypse of Selfishness]\n\n","date":"May 1, 2014 at 12:39 pm","url":"https://shroudstory.com/2014/04/28/discovery-promoting-shroud-video-on-feature-about-two-new-saints/","cat":"news_&_views","id":"comment-108036","author":"John Klotz","site":"shroudstory"},{"title":"Discovery Promoting Shroud Video on Feature About Two New Saints","post":"Hugh,\nOn this point we may be agreement.\n\n","date":"May 1, 2014 at 12:40 pm","url":"https://shroudstory.com/2014/04/28/discovery-promoting-shroud-video-on-feature-about-two-new-saints/","cat":"news_&_views","id":"comment-108038","author":"John Klotz","site":"shroudstory"},{"title":"Discovery Promoting Shroud Video on Feature About Two New Saints","post":"John, You quoted correctly, it is something similar to what Ian Wilson told me in an interview published in another language in a leading daily some years ago. Now, let me get back to my pdf. Take care when you come to the “Apocalypse of Selfishness”, it may lead you to confront — you thought right! — RD with heavier artillery than what he has come up with.\n\n","date":"May 1, 2014 at 1:45 pm","url":"https://shroudstory.com/2014/04/28/discovery-promoting-shroud-video-on-feature-about-two-new-saints/","cat":"news_&_views","id":"comment-108085","author":"Louis","site":"shroudstory"},{"title":"Discovery Promoting Shroud Video on Feature About Two New Saints","post":"RD refused to sign a document against Prime Minister David Cameron calling England a “Christian country”. As I wrote last year on the blog, he is still has a strong Anglican unconscious and we we see recent results. Well, good for him, at least he is being honest about what he thinks:\nhttp://www.catholicherald.co.uk/commentandblogs/2014/05/30/now-we-know-why-dawkins-refused-to-sign-that-letter-from-atheists-condemning-camerons-we-are-a-christian-country-could-he-be-on-the-way-to-belief/\n\n","date":"May 30, 2014 at 3:42 pm","url":"https://shroudstory.com/2014/04/28/discovery-promoting-shroud-video-on-feature-about-two-new-saints/","cat":"news_&_views","id":"comment-125767","author":"Louis","site":"shroudstory"}]
