[{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"This is intriguing to say the least. I can hardly wait.\n\n","date":"February 7, 2015 at 7:33 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-189994","author":"John Klotz","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"I wonder if these gentlemen have spent a bit of their time\nto consider the ancient oil lamps …\nAncient oil lamps are not terribly rare,\nbut try to read what Alan Whanger (= CSST News) and Phil Dayvault\n(*.pdf file) wrote… \nReference:\nshrouduniversity.com/docs/FACEoftheGOD-man-PDF-FINAL-LOC5-C1.pdf\n— * — * —\nIn one of the past messages Colin Berry wrote:\n>… surely the ‘idea’ would have leaked out and been sketched, painted, carved,\ncast by someone, somewhere, sooner or later…\nYes.\nHere a feeble trace: Jesus, during first centuries was never represented in cross\n(He was a different type of Person with respect the thieves)\nSee also the ampulla of Monza (VI century) coming from the Holy Land…\n— — —\nHere I want to submit a case.\nThere was something in Syria 1100 years before the medieval date assigned to the\nrelic of Turin (after an infamous radiocarbon test).\nYou can read what Dr. Alan Whanger indicated us several years ago\n(= “CSST News”, July 2000) …\n= Four carved stone oil lamps found in an archaeological site in Syria\n(and the site was dated to 200 AD).\nThe article by Whanger was titled “Further Light on the Mystery”.\nThe author received a new catalog from a well-established antiquities dealer…\nand his attention was drawn to a series of ten carved stone oil lamps,\nall with the head of a bearded individual.\nWhanger wrote that the suspicion that the lamp face image was inspired\nby the Shroud was correct because the letters I C (= Jesus, the first and\nlast letters of  the Greek spelling) and X C (= the first and last\nletters of the Greek word for Christ) are clearly carved on the lamp.\nThen we can guess something about the use of these lamps …\nPerhaps the lamps enlighted the souls centuries before\nthe black Madonna of Oropa and the Templar Knights…\nWhere is your rejection about these bearded lamps?\nWas Dr. Whanger a sort of Indiana Jones?\nAre the lamps a precious treasure?\nWere things surely and closely associated with the Shroud (for instance: a pilgrimage)?\nFor example:\nWhat kind of archaeometric-petrographic control (using adequate techniques,\nif possible…) was done?\nThank you in advance.\n— — —\nHere some vague word about Şanlıurfa Museum:\n>Urfa is rich for its history and historical works and finds.\n>Firstly, National Education Director Avni Günal offered\nthe construction of Urfa Museum in 1948.\n>In December 8, 1967 the museum construction used\nas museum management and displayed to society in 1969.\n>There are 3 archeological and 1 etnographic display halls in the museum.\n>It is in Şehitlik Neighbourhood in the city center.\n>Şanlıurfa Museum is the fifth, biggest museum in Turkey with its 74.000 works and finds.\nLink:\nhttp://www.stoneagetravel.com/en/turkiye/37/general-turkey/eastern-turkey.html\nDo you have perhaps found some news more specific,\nfocused on the oil lamps that I mentioned?\n\n","date":"February 7, 2015 at 9:41 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190017","author":"Piero","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"I’m flattered that you should have quoted words from a recent comment of mine, piero.  But the question I posed still awaits an answer, which your stone vases failed to provide, being face only. Why is there no evidence for the existence of the iconic TS double image pre-1355, given the anecdotal evidence for so many “sightings” of the Shroud?\nJust in case anyone’s unclear as to what I mean by “iconic” image, here are two graphics.\n\nThat above is the faint TS double image as it appears in medieval art, apparently a negative imprint.\n\nHere’s the essentials of that same image, stripped of detail, after cropping, whiting out with the eraser tool in MS Paint, and then converting to a black silhouette.\nI repeat: where in pre-1355 art do we see that iconic image, represented above by the black silhouette, representing a life-size double front-and-back image such as might be left by a naked man on a length of linen?\nIf the TS had really been stored in a series of safe locations, protected from insects, moisture etc., cared for by generations of sworn-to-secrecy custodians, surely the unique IDEA of that double image would have leaked out into the public domain and become reproduced somewhere, some place, some time, if only as graffiti.\n\n","date":"February 7, 2015 at 12:53 pm","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190036","author":"Colin Berry","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"Here the last point indicated by Colin:\n>If the TS had really been stored in a series of safe locations, protected from insects, moisture etc., cared for by generations of sworn-to-secrecy custodians, surely the unique IDEA of that double image would have leaked out into the public domain and become reproduced somewhere, some place, some time, if only as graffiti.\nBut why? …\n I do not think the back of the image body may have been significant as the front of the image. In short: the backside certainly not worth as the face …\n However, I admit that the lack of body images doubles (as in the case of the shroud) can be a negative element.\nBut you …\nDo you want to kiss the backside of a person?\nWhy?\nThis is always considered unseemly act, in fact, first of all is the face that is involved in emotions …\nI cannot believe that you prefer to consider the rear-end instead of the face.\nHere I’m getting too vulgar and then I ask excuse.\nSo, with your permission allow me to say that I would not even go too into vulgarity…\nIn fact, these arguments are not suited to our polite discussion.\n— — —\nI did not find what you want to seek (for example: I tried to see in the book : “The Magdalene: In Her Footsteps” by Diana Prince Phd. Then read the following claim: “In that church is also a reproduction of the shroud of Christ …” [church = Saintes Maries de la Mer] But I have not found the inherent page online… The same with Vézelay Abbey\nLink: http://en.wikipedia.org/wiki/V%C3%A9zelay_Abbey\n   And … about 1050 the monks of Vézelay began to claim to hold the relics of Mary Magdalene…).\nIt is probably impossible to find something and this is due to the fact that in their eyes this representation (front and back) was just an irreverence…\n— — —\nIn short, I believe more in the physical and\nchemical analyses rather than …\n… in things that we cannot find!\n\n","date":"February 9, 2015 at 10:42 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190390","author":"piero","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"Yeshu’a Shroud-like ‘left’ profile (aka the TS ‘left’ profile as if embedded in the reversed positive original face imprint) was reproduced at least twice as early as the 3rd century CE.\nComplete mapping of the TS man’s bloodied body can be made from Iconographic & Literary cryptoemblematic archaeoperceptions recorded in The Book of Revelation (and several Late Antique apocryphal books), Palaeochristian Roman mosaics and mural paintings, Late Antique and Medieval Hagiographic legends, Secret Coptic, Syriac and Byzantine Liturgies, Carolingian and Roman illustrations or miniatures, Medieval Arthurian Legends (from 1160s to early 13th c CE.\n\n","date":"February 7, 2015 at 1:52 pm","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190042","author":"Max patrick Hamon","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"Several Shroud-like features (nail in the wrist blood stain, particular shape of the side wound bloodstain etc) are also hidden in emblemic disguise in early 14th c. CE Knights Templar graffiti.\n\n","date":"February 7, 2015 at 2:03 pm","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190043","author":"Max patrick Hamon","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"Shall I repeat was i told David Goulet on February 5, 2015 at 2:13 pm?\n“In the first 1300 years or so of the CE, the Shroud of Christ was COVERTLY venerated then, from mid 14th c .CE onward it was OVERTLY venerated.”\n\n","date":"February 7, 2015 at 2:08 pm","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190046","author":"Max patrick Hamon","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"“Shall I repeat was i told David Goulet on February 5, 2015 at 2:13 pm?”\nI’m afraid you will in 50 post of 144 letters or less.\n\n","date":"February 7, 2015 at 3:06 pm","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190055","author":"John Green","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"To say that the Shroud was covertly venerated up until the 1300s, then overtly venerated post 1300s is merely a dodge, an evasion. All it does it restate the problem, albeit as a neat and plausible fix, one that masquerades as a solution. It should fool no one. It’s simply casuistry.\nThe proper response of those who seek positive supportive evidence – the  only kind that matters – instead of a tedious churned-out oh-so-clever play on words, should be to say: “Neat and superficially plausible, maybe. But if that’s the best you can do, then it’s almost certainly false”.\n\n","date":"February 7, 2015 at 2:33 pm","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190049","author":"Colin Berry","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"Colin, the reason is simple. The man is naked, here is quote from Wikipedia on nude art :\n“Christian emphasis on chastity and celibacy further discouraged depictions of nakedness, even in the few surviving Early Medieval survivals of secular art. Completely unclothed figures are rare in medieval art”.\nBefore it was incomprehensible to show the Shroud completely unfolded because of the nudity depicted. You want examples of the double image in art pre-1355 but how much naked art of Jesus is there?\n\n","date":"February 7, 2015 at 10:57 pm","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190151","author":"MikeM","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"But there was a simple solution to that, MikeM, which was to add a loin cloth to the TS image, even if/though one’s not present on the original. See the TS image in my earlier comment for a prime example.\nIn any case, it’s hardly likely that a TS image without loin cloth would frighten the horses, far less the ladies, given its faintness, the strategic placement of hands, the distracting nature of all those scourge marks, especially on the dorsal side such that the first thought was unlikely to be “Goodness gracious me, the buttocks are bare!”.\n “Oh, the poor dear” was more likely, at least where I come from.\n\n","date":"February 8, 2015 at 3:14 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190166","author":"Colin Berry","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"PS: …and I forgot to mention the most important aspect of the TS image, one that makes it iconic and wholly unique – namely the double-body, head-to-head configuration. That defining feature can or could easily have been conveyed with a simple outline or silhouette (see above) causing little or no offence to those finer sensibilities.\n\n","date":"February 8, 2015 at 3:39 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190171","author":"Colin Berry","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"Colin, how do you add a loin cloth to a cloth? Or do you mean to spoil an original by painting over it. The logical thing to do is to fold it so that the nudity would be covered, then expose the complete Shroud when it became more acceptable to see a naked Christ.\n\n","date":"February 8, 2015 at 9:52 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190232","author":"MikeM","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"What I’m asking you and others here to do, MikeM, is to focus on the crucial detail that makes the TS image “iconic” and instantly recognizable, and to forget for the moment all the other details like nudity etc etc that are just that – details. As I say, the unique and intriguing nature of the TS image, had it existed and cared for by generations of custodians, prior to  Lirey, 1355, could have been conveyed simply by means of line drawings, silhouettes etc without offending any sensibilities re the depiction of a man sans his clothing.\nHere’s a thought experiment for your consideration.\nShow the following images to folk who are reasonably-well informed. Tell them the rustic clothes pegs represent the human figure (or figures).\nShow this one first:\n\nAsk which well-known image from many centuries ago is represented.\nYour prediction? Mine: you’ll get blank looks.\nThen show this one:\n\nYour prediction?  Mine: the Shroud of Turin will start to trip off tongues.\nIt’s all to do with the configuration – head to head. The other details are largely irrelevant where identifying the unique iconic feature of the TS image is concerned.\nHad the iconic head-to-head double-TS image  existed centuries before 1355, we would surely have known about it – from word of mouth, from graphical art, no matter how lowly, or even monkish script. Imagery is a powerful thing. It cannot be easily suppressed.\n\n","date":"February 8, 2015 at 10:23 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190236","author":"Colin Berry","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"PPS: It’s a bit of a mouthful to be having to refer constantly to the defining aspect of the TS image as “double body, frontal and dorsal, head to head, nearly but not quite joined together”.\nIt’s just occurred to this ex-stamp collector (1950s era) that there’s a philatelic term that might be a useful shorthand. It’s “se tenant“,  French needless to say, meaning ‘keeping/kept together”.  Here are two British stamps that are “se tenant”:\n\nI choose this particular example, not for nationalistic reasons, but because the Queens’ heads are shown back-to-back, clearly intended to showcase the se tenant configuration, reminiscent of the top-to-top placement in the TS.\nWill my new nomenclature catch on, i.e. “stick”?  Or will there shortly be jokes about the propensity not only of ancient postage stamps to become unhinged, but their collectors too?\n\n","date":"February 8, 2015 at 4:43 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190183","author":"Colin Berry","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"Colin’s insistence that there are few if any signs of the double image before the Shroud appeared in Lirey ~ 1355, is I think fair comment, but only if one ignores the various clues which take some searching to find. \nThere are many reasons for this obscurity, dating from the times of the apostles with its Jewish tradition of what was or was not kosher, the many early persecutions of Christianity, the avaricious depredations of tyrants in confiscating church treasures, the need for concealment of things most precious, the history of iconoclasm, the initial reluctance to display Christian imagery, Byzantine superstition and its whole secretive approach towards liturgy in general, the concealment of Passion relics in the Emperor’s palace, Byzantine prudery when it came to displaying nudity, and so on.  For example, there was uncertainty in displaying images of Christ for purposes of battle standards; a series of defeats determined that such displays were contrary to the divine will.  The Shroud itself displays an abject defeated Christ, and is not the stuff to inspire confidence as a protective device in the defence of cities.  Following 12 months of continuous earthquakes in Constantinople, the Image of Camulliana, the Image of God Incarnate, was kept concealed in a box for some hundreds of years, and was only opened towards the end of the first millenium. \nNevertheless there are clues.  They might be found in Galatians 3:1, the inscription of Abercius alluding to his being accompanied in his travels by an image of a “large fish”, the Edessan Bardesanic Hymn of the Pearl, the discovery of the Image of Camuliana and its parading around Cappadocia, hinits in the Mozarabic rite, the references to images “not being made by human hands”, the development of epitaphioi displaying a Shroud-like Christ, Western visitors’ reports of the burial cloths being held in Constantinople showing an image, the report of Robert de Clari, and various others. \nHowever the whole approach is one of secrecy, and there was often the underlying belief that such imagery was not for the public gaze.  This seems only to have been relieved towards the end of the Byzantine era.  This is what makes it so difficult to be specific about such evidence as there is.  It is also obvious that there was often confusion and misunderstandings in the record, with many false trails.  Our modern more open western society can hardly appreciate the secrecy towards the sacred, seemingly typical of Byzantine culture, which added to the confusion. \nOver the next day or so, I hope to put a more coherent posting together, which I hope may make a better case.\n\n","date":"February 8, 2015 at 2:46 pm","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190257","author":"daveb of wellington nz","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"You’ve mentioned several ‘hints’ there that stretch credibility. Galatians 3:1….really? Abercius and the image of a large fish?\nThis is getting towards Stephen Jones territory.\n\n","date":"February 9, 2015 at 3:00 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190326","author":"Thomas","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"Is it any wonder that even the battle-hardened knight (Geoffroi de Charny) did not dare to display the Shroud in his lifetime. It was his widow (Jeanne de Vergy) who, for reasons we can only guess at, decided  the time was ripe to cut through that veritable Gordian knot. How odd that the local Troyes bishop immediately declared the TS a fake, given that the real “crime” was ‘premature’ display of a problematical relic, still needing a few more centuries of quiet and very private reflection if daveb’s explanation is to be believed.\n\n","date":"February 8, 2015 at 4:28 pm","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190261","author":"Colin Berry","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"PS  Have now said all I wanted to say on the subject. But let me stress once again (final time) that the question being addressed is not why the TS took so long to appear if it really was 13 centuries old at the time of the Lirey display. The issue being addressed is why the distinctive double head-to-head image did not emerge either in art or the written record until after the Lirey display.\n Keeping the existence and whereabouts of the physical TS a secret is one thing. However, that should not have necessitated having to keep the general shape and character of the image a secret as well, especially if displayed as diminutive motifs, insignia etc. Indeed, given the somewhat mesmeric nature of the TS image, it’s hard to see how with the best will(power) in the world, it could have been kept a secret, even if the physical custodianship had been perfect.\nFinis.\n\n","date":"February 8, 2015 at 6:18 pm","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190268","author":"Colin Berry","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"It was a very, very long way from Constantinople to Lirey in the diocese of Troyes in France, in more ways than one!\n\n","date":"February 9, 2015 at 3:46 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190331","author":"daveb of wellington nz","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"I have just taken a quick glance at Galatians 1:3, daveb.\nSilly me. What else could it be other than a clear and unambiguous reference to the Shroud?\nI can see that Thomas and I are going to have to work hard to improve our synthosindonoperceptive skills. \nI’m going out now, and may be gone for some time.\n\n","date":"February 9, 2015 at 3:55 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190333","author":"Colin Berry","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"I don’t really blame you Colin…there’s some gems on this site but also a fair bit of silliness…\nsee you around again some time\n\n","date":"February 9, 2015 at 5:12 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190347","author":"Thomas","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"The “disciplina arcana” was the the ‘discipline of the secret’. which prevailed until the time of Constantine and his Edict of Milan, and was essential to the survival of early Christianity.  It had its origins in the biblical injunction not to cast one’s pearls where they might be trampled on.  In view of recent comments made, I see that it is still good advice which I now intend to follow.\n\n","date":"February 9, 2015 at 4:06 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190335","author":"daveb of wellington nz","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"Pearls you say daveb? Peanuts of expanded polystyrene more like it (with plenty of bubble wrap too).","date":"February 9, 2015 at 5:05 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190345","author":"Colin Berry","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"One person’s trash is another person’s treasure!\n\n","date":"February 10, 2015 at 1:53 pm","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190582","author":"daveb of wellington nz","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"\n\n","date":"February 10, 2015 at 2:18 pm","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190586","author":"Colin Berry","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"Re Gal 3:1:  The JV doesn’t do it.  “Has someone put a spell on you, in spite of the explanation you have had of the crucifixion of Jesus Christ?”  The translation is a poor one.  It was more than an explanation.  The original Greek refers to “eyes”, something visual that was shown to the Galatians.  What could it have been? \nLat Vulg: “o insensati Galatae quis vos fascinavit ante quorum oculos Iesus Christus proscriptus est crucifixus”\nKJV: “O foolish Galatians, who hath bewitched you, that ye should not obey the truth, before whose eyes Jesus Christ hath been evidently set forth, crucified among you?” \nASV: “O foolish Galatians, who did bewitch you, before whose eyes Jesus Christ was openly set forth crucified?”\nDerby’s: “O senseless Galatians, who has bewitched you; to whom, as before your very eyes, Jesus Christ has been portrayed, crucified among you?” \nDouay-Rheims: “O senseless Galatians, who hath bewitched you that you should not obey the truth, before whose eyes Jesus Christ hath been set forth, crucified among you?” \nAnd so on … Other translations convey similar meanings.\nGalatia is in Greece, and clearly few if any of the converts there would have been witnesses to the crucifixion in Jerusalem.  The meaning seems to be that they were given some visual evidence.  I said it was a clue, a hint.  There are very many more as I mentioned previously.  Now go check out the inscription of Abercius.  You can find an interpretation of it in Markwardt’s Antioch paper.  I’m done with spoon-feeding.\n\n","date":"February 10, 2015 at 6:20 pm","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190615","author":"daveb of wellington nz","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"\n\n","date":"February 11, 2015 at 2:38 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190659","author":"Colin Berry","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"garbage. sorry for being frank. but that really is garbage Daveb. Are you being serious or taking the mickey?\nOn balance I side with authenticity, but this sort of desperate nonsense does the case no favours….\n\n","date":"February 11, 2015 at 4:42 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190673","author":"Thomas","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"I can agree with Colin’s inference that Gal 3:1 is only a mole-hill, is probably one of the weakest, but it’s also one of the first hints and clues we have.  But there are also many other clues much stronger than this and certainly more specific, particularly when we consider the Byzantine evidence.  \nI should like Thomas to suggest his own interpretation of Gal 3:1 as to what else it might be if not the burial cloths that was visually demonstrated to the Galatian converts, before their very eyes as evidence of Christ crucified.  Paul evidently considered It sufficiently persuasive that he was perplexed by their apostasy.  What was it?  \nWe also have the Edessan Bardesanic “Hymn of the Pearl” of about 200 AD, with a fairly specific reference to the double image.  Another clue.\n\n","date":"February 11, 2015 at 2:19 pm","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190724","author":"daveb of wellington nz","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"\n\n","date":"February 12, 2015 at 3:05 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190774","author":"Colin Berry","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"Is the Trickster at work here?\n\n","date":"February 12, 2015 at 3:17 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190775","author":"John Klotz","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"Colin, congratulations, I take it you found it and that’s a picture of you celebrating your success at discovering an early reference to the double image. \nI first came across the “Hymn of the Pearl” in the 1980s when doing a Stage III in Ancient Religions at Massey University in Palmerston North under Professor Brian Colless.  He was highly skilled in ancient languages, and translations from the original Cuneiform, Phoenician, or Syriac were no trouble to him.  He had provided us with many of the translations we used.  My own seminar papers were on Baal Hadad and Gilgamesh.  \nWe discussed the Pearl in class, but it is only in the last few years that its possible connection with the Shroud image was brought to my attention.  Brian had made a particular study of the Pearl, and I’d recently corresponded with him about this.  \nHis own translation and detailed analysis can be found at:   https://sites.google.com/site/collesseum/pearlhymn\nNo, you won’t find a reference to the Shroud image in his analysis, but I think it’s yet another clue in the enigma.\n\n","date":"February 12, 2015 at 4:19 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190779","author":"daveb of wellington nz","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"\n\n","date":"February 12, 2015 at 4:30 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190783","author":"Colin Berry","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"Galatia is in modern Turkey not Greece. The Galatians were originally Celts who were defeated by the Attalid dynasty of Pergamum and later settled under Roman rule in central Anatolia. I can’t see any reference to a burial shroud here but if so it would presumably have been in one of the cities visited by Paul so one would need to follow that up. Is the suggestion that the Shroud was in central Anatolia in the middle of the first century?\n\n","date":"February 12, 2015 at 4:24 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190781","author":"Charles Freeman","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"Charles, I have before me a map of Paul’s journeys, and I can see that Galatia is on the north-east of Anatolia.  There are problems with the hypothesis that Paul was travelling with the Shroud to assist his mission. \nEarly traditions place the burial cloths in Peter’s possession, Paul had yet to earn the trust of the Jewish apostles, and so it would seem unlikely that they would release it to him.  Paul’s first journey about 40 AD took him only as far as Iconium and ‘Antioch’ in Pisidia.  \nAdrie vd Hoeven has postulated that the Shroud was originally John Mark’s temple garment, so it is possible that Mark had it in his possession.  Mark was a kinsman of Barnabas and accompanied them only as far as Perga when he left them.  \nPaul’s second journey 45-49 AD took him further north into Galatia.  Barnabas had proposed taking Mark with them, but Paul refused in view of Mark’s earlier desertion.  They quarreled, and Paul took Silas instead.  If Paul had the Shroud on this journey, it could only have been allowed by Peter.  Subsequently Paul and Mark were reconciled.  \nAs I said, there are problems.  Nevertheless Galatians 3:1 (not pseudonymous, but written by Paul) may be thought highly suggestive, and a solution of what visual impact was given to the Galatians begs for an answer.  \nIt is Markwardt’s recent assertion that Bishop Ephraim took the Shroud to Cappadocia from Antioch in Syria in the 6th century to save it from the Persian Chosroes, when it became known as the Image of Camuliana.\n\n","date":"February 12, 2015 at 3:13 pm","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190853","author":"daveb of wellington nz","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"One hopes the James ossuary is not among the “holy objects” used to “find” Jesus in this CNN series. BAR editor Hershel Shanks took Father Joseph A.Fitzmyer, SJ to Toronto in order to read the Aramaic inscription, on the whole correct. Except for one problem: two different hands were involved. That is what I had to tell the great biblical scholar, now retired, and although he believed that the ossuary was genuine he also made it clear that there was no evidence that the “James” was the one called “James the Just”, Paul’s “the brother of the Lord’, first of the twelve Jewish Christian bishops of Jerusalem.\nOne also wonders what the “theological insights” in the series will be like and how far they are grounded in Scripture. Father Fitzmyer employed the historical-critical method in exegesis, together with the other heavweights, Fathers Raymond E. Brown and Roland E. Murphy, producing the “Jerome Biblical Commentary”.\nBut what we most need today is a theology that can be grounded both in Scripture and Science:\nhttps://www.academia.edu/4700001/What_do_we_know_about_the_Bible_An_interview_with_Joseph_A._Fitzmyer_SJ\n\n","date":"February 8, 2015 at 4:30 pm","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190262","author":"Louis","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"Colin wrote (in reply to daveb referring to the “disciplina arcana” and the NT injunction not to cast one’s pearls where they might be trampled on): “Pearls you say daveb? Peanuts of expanded polystyrene more like it (with plenty of bubble wrap too).” \nMethinks the still unenligtened oldbod still mistakes cryptology for “casuistry” and is totally blind to his own sophistry. A SHAME!\n\n","date":"February 9, 2015 at 7:08 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190361","author":"Max patrick Hamon","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"To Colin: Re “casuistry” in terms of clever but unsound reasoning. Your talk is just talk about the pot calling the kettle black!\n\n","date":"February 9, 2015 at 9:11 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190377","author":"Max patrick Hamon","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"Reminder for Colin: The Christianised Black Madonna or Black Virgin (depicted in conjunction with the TS)  is the impersonation of the Mysteries and Hidden Secrets of Life and Nature (death and resurrection/regeneration). Her natural  abode is a crypt.\n\n","date":"February 9, 2015 at 7:33 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190364","author":"Max patrick Hamon","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"Before the present Basilica of Oropa existed a cave (which was then destroyed to make way for the construction of the church)…\nSorry …\nIs that a linea bifurcata ???\n\n","date":"February 9, 2015 at 10:59 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190396","author":"piero","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"I apologize for the “linea bifurcata”…\nBut I just found a strange book:\nAnd Did Those Feet…?\nby Michael Goldsworthy [= Discovering the Tombs of Jesus and Joseph of Arimathea and resolving the mystery of the Turin Shroud (Google eBook)]\n>The book will appeal to those interested in religion and religious history, the Glastonbury legend, material concerning the Shroud of Turin, Templar treasure, and Leonardo Da Vinci’s connection to the Isle of Avalon.\nIs that book is for those who are interested in the archeology and history of England and ancient Shroud?\nSee also:\nhttp://templartreasure.blogspot.it/\n[= The Holy Grail and the Templar treasure are buried in Avalon …]\nor\nhttp://melkinsprophecydecoded.blogspot.it/2012/06/lile-davalon-et-lile-de-sarras-nont.html\nHowever Oropa is situated in the mountains and does not have to do with Leonardo \nSo…\nWe entered into a legendary world, where perhaps we risk losing the compass …\n\n","date":"February 9, 2015 at 11:17 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190402","author":"piero","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"Re L’ILE “LINCOLN” as a anagrmmatic reference to the Turin Shroud  as LINeN CLOth in light of its four series of shaped-like letters spelling L’ILE, “The Island”, cryptologoliclly speaking, it is quite relevant to note that:\na) the day president Abraham Lincoln was murdered was a Good Friday that is the very day Jesus Chist” died and was buried in shrouds.\nb) the expression “the Bosom of Abraham” is found only in two verses of St. Luke’s Gospel (16:22-23). Iconographicaly speaking it features souls as human  figures ‘lying’ in a large cloth. See for instance The Bosom of Abraham, Romanesque capital from the former Priory of Alspach, Alsace. (Unterlinden Museum, Colmar) 12th c. CE at: \n \n\n","date":"February 9, 2015 at 3:16 pm","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190434","author":"Max patrick Hamon","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"Thus what are the odds Abraham Lincoln can be associated both with YeShU’s,  a burial LINeN CLOth and Resurrection? \nWhat are the odds too for Cyrus Smith (the very name of a man that dies and literally resurrected in chapter 8 of The Mysterious Island aka LINCOLN ISLAND) codes as perfect anagram, M(aran) Y(e)ShU CHRIST, ‘Our Lord Jesus Christ”?\nBTW in Bible numerology number 8 is related to/codes the resurrection of the DEAD…\n\n","date":"February 9, 2015 at 4:43 pm","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190448","author":"Max patrick Hamon","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"Chapter 8, you can read: (…) “Nab ended his account by saying what had been his grief at finding the inanimate body, in which he vainly sought for the least sign of life. Now that he had found him Cyrus Smith) dead he longed for him to be alive. All his efforts were useless! Nothing remained to be done but to render the last duties to the one whom he had loved so much!”\n\n","date":"February 9, 2015 at 4:49 pm","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190450","author":"Max patrick Hamon","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"The scene takes place in a GROTTO. Reminder: In 1st c. CE Jerusalem Hebrew, Ha-Notsry can mean “The Troglodyte” and also refer to a Christian (“The Christian”).\n\n","date":"February 9, 2015 at 4:52 pm","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190452","author":"Max patrick Hamon","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"Hi Max\nRe: CNN’s “Finding Jesus”\nKlausner’s influential “Jeshu ha Notzri”, (Jesus the Nazarene”) did not really mean that Jesus was referred to that way in the first century AD and you are quite correct when you say that “ha notzri” could refer to a Christian. That was probably the origin of the name “Nasrani”\n for the Jewish Christians who reached India in the 1st century AD. There is no evidence of any group or sect called “Nazarenes”, so it is likely that some people referred to the early Christians as “ha notzri” or “Nazarenes” when what they meant was “Christians”.\nCuriously the Kashmir tomb theory makes reference to an early document in India that refers to Jesus as “Issa” and that it evidently a forgery since Islam only reached India in the fourteenth century and the Hindus refer to Jesus as “Yesu”, sometimes “Yeshu”:\nhttps://www.academia.edu/7893085/The_Quest_for_Jesus_in_Shroud_research\n\n","date":"February 9, 2015 at 6:06 pm","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190469","author":"Louis","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"Hi Louis,\nAccording to the Babylonian Talmud (Sanhedrin 43a) the name YeShU (woth the finll ‘ain) is generally believed to be an acronym for י = Yimaḥ ש = Shĕmo ו = Wezikhro = meaning, “May his name and memory be stricken out”, which is cryptologicaly relevant in light of the name Nemo, “No-one”, “No-body” both implying a name that is “no name”.\nPrior to Klausner, Jewish distinguished scholar Jacqueline Genôt-Bismuth refer to Jesus of Nazareth as Yeshu’a Ha-Notsry. \nThe fact is, In the first c. CE, the name Yehoshua was abridged in Yeshu’a and Ha-Notsary in Ha-Nostry.\nMy own etymological research on Ha-Nostry lead me to conclude it could mean “The Hidden (Prince)” and “The Troglodyte”, “The Cryptic (Rabbi)”. \nOn October 26, 2012 at 9:26 am, I alreday wrote:\n“Jesus of Nazareth = (in Hebrew) Yeshu’a ha-Notsry\n‘Yeshua’ in Hebrew means “[providential] Salvation]”. To ancient Hebrews the very symbol of salvation was the brass SNAKE…\nBeside ‘Ha Notsry’ in Hebrew means “the Hidden [Prince]”, “The man of the grotto(es)”, “The Troglodyte”… The facts are he said to born in an unsused cave tomb, mostly lived/slept in grottoes all his life long and was buried in a newly hewn cave tomb in which no-one had been buried before him (to abide by the Talmwd Babli, Sanhedrin tractate).”\n\n","date":"February 9, 2015 at 7:54 pm","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190479","author":"Max patrick Hamon","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"Re: CNN’s “Finding Jesus”\nMax, that’s right, Klausner’s book only drew more attention to the name “Jeshu ha Notzri” because of the title of his book. As for the acronym you mention, it is always possible given the fact that wordplay was common then. While Schaefer accepts what the Talmud has to say, Maier does not find any reference to Jesus in it. See Schaefer’s views in:\nhttps://www.academia.edu/7471223/Jesus_was_not_buried_in_Talpiot_-_Part_III\nIn this context, please provide me with the verse in the Babylonian Talmud that refers to a newly hewn cave tomb.\nYou know something? We are both digging the same tunnel when it comes to the Knights Templar, you at one end and I at the other. Other priorities have obliged me to lay this research aside for a while, but, who knows, we may both meet when the tunnel digging comes to an end?\n\n","date":"February 10, 2015 at 9:04 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190561","author":"Louis","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"http://www.bbc.com/news/uk-31360903\nFood for thought:\nNot long ago there was a discussion about evil on this blog and I pointed out that most of us are involved with evil, consciously or not, and the fact is swept under the carpet. There was silence as response.\nIt is attitudes like these that drove Freud to deny the existence of the (Biblical) God and challenge the “created in His image” belief.\nNow archbishop Rowan Williams has done his best to respond to Stephen Fry, who called the biblical God “stupid”, however the argument will convince few today. People are asking a lot more questions than Job did and answers are not easy. The mysterium iniquitatis continues as it is.\nCNN’s ”finding Jesus” on this thread is, deep down, an attempt to make sense of this mysterium, to understand why it exists, and to find out more about Jesus in order to justify faith in such a situation.\n\n","date":"February 11, 2015 at 6:20 pm","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190743","author":"Louis","site":"shroudstory"},{"title":"More Press Coverage of the Upcoming CNN Series About Jesus","post":"Finding god:\nhttp://www.aljazeera.com/news/asia/2015/02/indian-officials-demolish-temple-dedicated-modi-150212185454264.html\n\n","date":"February 12, 2015 at 6:08 pm","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","id":"comment-190874","author":"Louis","site":"shroudstory"}]
