[{"title":"The Shroud on NBC’s Today Show","post":"Typo in the first line, Dan: ‘show’ – not ‘shoe’. Though watching it may be good for one’s sole. ;)\n\n","date":"June 17, 2015 at 10:57 am","url":"https://shroudstory.com/2015/06/17/the-shroud-on-nbcs-today-show/","cat":"television","id":"comment-202517","author":"David Goulet","site":"shroudstory"},{"title":"The Shroud on NBC’s Today Show","post":"Ouch and well bowled.\n\n","date":"June 17, 2015 at 2:06 pm","url":"https://shroudstory.com/2015/06/17/the-shroud-on-nbcs-today-show/","cat":"television","id":"comment-202534","author":"Richard Arthur","site":"shroudstory"},{"title":"The Shroud on NBC’s Today Show","post":"“at this explosive moment a burst of neutron is released”\nAnd you swallow this crap for your breakfast? Aren’t these italian scientists the real masters of comedy?\n\n","date":"June 18, 2015 at 2:56 am","url":"https://shroudstory.com/2015/06/17/the-shroud-on-nbcs-today-show/","cat":"television","id":"comment-202601","author":"anoxie","site":"shroudstory"},{"title":"The Shroud on NBC’s Today Show","post":"People should listen to other italian scientists (experts in radiation) like Fazio and Mandaglio instead…  But of course, their idea about the Shroud is not as attractive for those who love the supernatural as the idea of people like Fanti, Di Lazzaro, Jackson, etc.\n\n","date":"June 18, 2015 at 9:43 am","url":"https://shroudstory.com/2015/06/17/the-shroud-on-nbcs-today-show/","cat":"television","id":"comment-202640","author":"Yannick Clément","site":"shroudstory"},{"title":"The Shroud on NBC’s Today Show","post":"I’m not talking about the shroud, in the video “this explosive moment” refers to the explosion of concrete being compressed…… The idea of neutrons being released by such a ridiculous mechanical compression should be appalling for any scientist, even at 6 am before any coffee.\nThe only question would be: who are these freaks?\n\n","date":"June 18, 2015 at 12:11 pm","url":"https://shroudstory.com/2015/06/17/the-shroud-on-nbcs-today-show/","cat":"television","id":"comment-202657","author":"anoxie","site":"shroudstory"},{"title":"The Shroud on NBC’s Today Show","post":"Same thing apply for the idea of a dead body that would release a suddent burst of energy that would color the topmost fibers of a linen cloth at 4 cm of distance but not at 5 cm or beyond…\n\n","date":"June 19, 2015 at 9:51 am","url":"https://shroudstory.com/2015/06/17/the-shroud-on-nbcs-today-show/","cat":"television","id":"comment-202801","author":"Yannick Clément","site":"shroudstory"},{"title":"The Shroud on NBC’s Today Show","post":"Interesting presentation and conclusion by the host.\n\n","date":"June 18, 2015 at 7:07 am","url":"https://shroudstory.com/2015/06/17/the-shroud-on-nbcs-today-show/","cat":"television","id":"comment-202617","author":"Dcn Andy","site":"shroudstory"},{"title":"The Shroud on NBC’s Today Show","post":"A balanced report that will make people aware that research is still underway, meaning that 1988 was not the last word.\n\n","date":"June 18, 2015 at 8:48 am","url":"https://shroudstory.com/2015/06/17/the-shroud-on-nbcs-today-show/","cat":"television","id":"comment-202637","author":"Louis","site":"shroudstory"},{"title":"The Shroud on NBC’s Today Show","post":"Louis, who is producing this report and when is it expected to be released?\n\n","date":"June 18, 2015 at 11:35 am","url":"https://shroudstory.com/2015/06/17/the-shroud-on-nbcs-today-show/","cat":"television","id":"comment-202654","author":"Joe Marino","site":"shroudstory"},{"title":"The Shroud on NBC’s Today Show","post":"Hi Joe\nI was referring to the NBC report and unfortunately I did not hear anything more after Daniel Raffard de Brienne told me that CIELT was preparing a “dossier” and that was years ago. I have received bits of information and complaints about what is going on in the realm of Shroud studies from here and there but gaps have to be filled and this is not an easy task since cooperation among “Shroudies” is yet to be seen.\nLet me take this opportunity to tell you something, where I will not have to mince words since you are a theologian and will grasp what is meant easily.\nEveryone wants to know whether it is Jesus — who played the central role in history — who is the man seen on the Shroud.\nIf it really is Jesus, what is the message of the Shroud? If the image was formed in a natural manner, what will it tell us? We know what was done to Jesus. It is in the Gospels. Mahatma Gandhi literally broke into tears the first time he saw a crucifix, when he left London, where he was studying law at the Inner Temple, and went to Rome on holiday and visited the Sistine Chapel. It is doubtful if he knew something about the Shroud.\nIf supernatural agency was involved will it answer all our questions? It doesn’t seem so because science is telling us some things that clash with what is written in the Bible. There are things beyond the purview of the Bible and systematic theologians have not been able to answer questions that have been raised so far. We have to “rethink” what is meant by Monotheism. Is that heresy? No it is’nt. We must remember that Jesus said things that made people who heard him realise that he was presenting himself as someone different from the rest of mankind. He has his own views about God, Moses and Scripture. If the Shroud image was produced by supernatural means it will have to conform to these views.\nLife in the world is getting to be very uncomfortable, more people are now wondering if God exists and where he can be found. It has left even great biblical scholars thinking:\nhttps://www.academia.edu/12851672/The_Historical_Jesus_The_view_of_Professor_Geza_Vermes\nBut is not enough to just think of Jesus in terms of an existential spiritual legacy.\nYou can contact me by email whenever you need.\n\n","date":"June 18, 2015 at 12:52 pm","url":"https://shroudstory.com/2015/06/17/the-shroud-on-nbcs-today-show/","cat":"television","id":"comment-202663","author":"Louis","site":"shroudstory"},{"title":"The Shroud on NBC’s Today Show","post":"When Jesus was here on Earth 2000 years ago, he performed many miracles-raising of Lazarus, turning water into wine, cured the sick and blind, sudden abundance of bread and fish  Did these miracles happened naturally? No. I believe the Resurrection was one of his many miracles. The image was not created naturally. Do we know how He turned water into wine? Do we know how He raised Lazarus from the dead? No, we don’t know. I don’t think we’re ever going to know how the image was formed either. Its a miracle!\n\n","date":"June 18, 2015 at 5:32 pm","url":"https://shroudstory.com/2015/06/17/the-shroud-on-nbcs-today-show/","cat":"television","id":"comment-202689","author":"don","site":"shroudstory"},{"title":"The Shroud on NBC’s Today Show","post":"Yes Don radiation emitted from the dead body of Jesus and creating an image on the burial cloth is a miracle. No scientist can re-enact the resurrection process.\n\n","date":"June 18, 2015 at 7:50 pm","url":"https://shroudstory.com/2015/06/17/the-shroud-on-nbcs-today-show/","cat":"television","id":"comment-202705","author":"Sampath Fernando","site":"shroudstory"},{"title":"The Shroud on NBC’s Today Show","post":"A must read for anyone interested in learning what has been going on in the field of NT studies, by one of the US’ highly respected NT scholars:\nhttp://www.amazon.com/exec/obidos/ASIN/0060641665/peterkirby\n\n","date":"June 18, 2015 at 6:22 pm","url":"https://shroudstory.com/2015/06/17/the-shroud-on-nbcs-today-show/","cat":"television","id":"comment-202697","author":"Louis","site":"shroudstory"},{"title":"The Shroud on NBC’s Today Show","post":"I believe that the radiocarbon test, a destructive test,\nhas something to do with the hate against the Shroud…\nHere a recent example of hate:\n>Israeli extremists burn the church where Jesus multiplied loaves and fishes.\nThursday June 18, 2015\nauthor =y Celine Hagbard – IMEMC News Report post\n>Early Thursday morning, right-wing Israelis set on fire the Church of the Multiplication, where Christians believe that Jesus multiplied loaves and fishes, and wrote graffiti in Hebrew on the walls that read, “False idols will be smashed” and “Pagans”.\n>The fire was set at about 3 am in the early hours of Thursday morning, severely damaging church offices and storage rooms.\n>The entire church was saturated with smoke damage.\n>In addition, Hebrew graffiti was spraypainted all over\nthe front entrance to the church reading “Pagans” in red paint. …  …\nLink:\nhttp://www.imemc.org/article/71984\n— *** —\nI think that the scientist (and here I don’t speak against Fanti,\nthe case is more general) who wants to burn a piece\nof the Shroud (…especially if that piece has been involved\nwith the Body Image!) with a C14 test shows a certain affinity\nwith the mentality of the gestures of hate.\nIn my opinion we can burn only what is not an\noriginal piece of the Holy Shroud (for example:\na mending truly certified through previous\nAFM-Raman analyses!).\n— —\nThe true Science has nothing to do with violence.\nSee the case of Einstein that waited until 1939 to communicate\nwith a letter to Roosevelt about the atomic bomb…\nEinstein and the possibility of constructing “extremely powerful bombs of a new type”:\nLinks:\nhttps://en.wikipedia.org/wiki/Einstein%E2%80%93Szil%C3%A1rd_letter\nhttp://hypertextbook.com/eworld/einstein.shtml\n\n","date":"June 19, 2015 at 9:09 am","url":"https://shroudstory.com/2015/06/17/the-shroud-on-nbcs-today-show/","cat":"television","id":"comment-202795","author":"piero","site":"shroudstory"},{"title":"The Shroud on NBC’s Today Show","post":"Errata corrige:\n>See also the case of Einstein, the famous scientist who loved the Peace, who waited until 1939 to communicate\nInstead of:\n>See the case of Einstein that waited until 1939 to communicate\n— —\nSorry, I wrote under an emotional trouble (also because, this morning,\nonly one tooth was cured, instead of four teeth…).\n\n","date":"June 19, 2015 at 9:17 am","url":"https://shroudstory.com/2015/06/17/the-shroud-on-nbcs-today-show/","cat":"television","id":"comment-202796","author":"piero","site":"shroudstory"}]
