[{"title":"The Top Ten Relics of Christ?","post":"If you weren’t so quick to reach a conclusion and dismiss this as the burial cloth of Jesus, you would do well to watch all the documentaries and the statements made by other researchers attesting that upon closer examination that the garment had been repaired.  More recent testing/research has authenticated the bulk of the linen to be from the time of Christ and pollen specimens from the Holy Land. I am convinced that the thing is real, having heard from both sides!\n\n","date":"September 6, 2014 at 5:55 pm","url":"https://shroudstory.com/2014/08/11/the-top-ten-relics-of-christ/","cat":"video","id":"comment-149148","author":"Vernon Weathers","site":"shroudstory"},{"title":"The Top Ten Relics of Christ?","post":"Who are all these people who have been “so quick to reach a conclusion and dismiss this as the burial cloth of Jesus?” I don’t know any of them….\n\n","date":"September 7, 2014 at 3:28 am","url":"https://shroudstory.com/2014/08/11/the-top-ten-relics-of-christ/","cat":"video","id":"comment-149204","author":"Hugh Farey","site":"shroudstory"},{"title":"The Top Ten Relics of Christ?","post":"This is rubbish, relics are secondary. As I wrote here recently, the first disciples did not carry relics in their handbags or pouches, it was the kerygma that spurred the Jesus movement. Relics probably began to gain importance as the impact of the Christ event was being understood as the movement gained more adherents.\n\n","date":"September 6, 2014 at 6:39 pm","url":"https://shroudstory.com/2014/08/11/the-top-ten-relics-of-christ/","cat":"video","id":"comment-149156","author":"Louis","site":"shroudstory"},{"title":"The Top Ten Relics of Christ?","post":"Relic cults only really began in the fourth century, three hundred years after the Crucifixion, and even then major figures such as Basil of Caesarea felt they were a diversion from the true worship of Christ. His view re- emerged in the iconoclasm of the eightH century and the Protestant Reformation when relics were bundled up and burned. We would not have the Turin Shroud if it had been housed in England.\n\n","date":"September 7, 2014 at 4:43 am","url":"https://shroudstory.com/2014/08/11/the-top-ten-relics-of-christ/","cat":"video","id":"comment-149210","author":"Charles Freeman","site":"shroudstory"},{"title":"The Top Ten Relics of Christ?","post":"CF: “Relic cults only really began in the fourth century, three hundred years after the Crucifixion, … ” \nI suggest that it would be more accurate to state that is not known whether or not a relic cult had developed before the 4th century, the reason being that prior to Constantine’s Edict of Milan, the regular policy of imperial persecution of Christians would necessarily have made such practices secretive.  Certainly in the first few centuries of the church, the catacombs give witness to the practice of the eucharist being celebrated there.  The current use of saints’ and martyrs’ relics being included in church altar stones can be traced to this tradition.  We have recently discussed the presence of very early icons being discovered in the catacombs.  \nI should think that the mind-set which places value on relics very likely finds its origins in burial rites which go back as far as prehistoric times and can be found in most ancient civilisations.  To some extent it finds expression in the various forms of ancestor veneration, and the respect shown to the remains of the dead.  In its mildest form, the earthly remains become a sign of the value of the person’s earthly life, respect is to be shown to them, and where there is a belief in an after-life they connect us with their spirit. \nIf Charles had ever spent any time at all in the Pacific area, he would only be too well aware of the sacredness that Polynesian and Maori peoples place on their burial grounds and the human remains of ancestors, which go well beyond any Eurocentric concepts or ideas.  He may not consider this to be relevant.  On the contrary, it is a very natural and human practice indeed, and it reflects deep-seated values in the human psyche, which are more universal than one might admit. \nWhat was it that drove Saint Helena on her mission of retrieving early Christian relics from Jerusalem?  At the very least she realised how the value of such relics would add to the prestige of imperial authority, because of the natural human awe placed on such tangible objects.  There may be elements of ‘contagious magic’ associated with the cult of relics, but there are also honest motives of true piety as well.\n\n","date":"September 7, 2014 at 6:32 am","url":"https://shroudstory.com/2014/08/11/the-top-ten-relics-of-christ/","cat":"video","id":"comment-149220","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Top Ten Relics of Christ?","post":"Charles Freeman is cynically lying (like always). The relic cult has been developed long before 4th century. In fact, it has been since the very begining of Christianity.\n The Martyrdom of Polycarp (2nd century):\nhttp://en.wikisource.org/wiki/Ante-Nicene_Christian_Library/Volume_I/The_Martyrdom_of_Polycarp\nChap. xviii.—The body of Polycarp is burned.\nThe centurion then, seeing the strife excited by the Jews, placed the body[49] in the midst of the fire, and consumed it. Accordingly, we afterwards took up his bones, as being more precious than the most exquisite jewels, and more purified than gold, and deposited them in a fitting place, whither, being gathered together, as opportunity is allowed us, with joy and rejoicing, the Lord shall grant us to celebrate the anniversary of his martyrdom, both in memory of those who have already finished their course, and for the exercising and preparation of those yet to walk in their steps.\nActs 19:11-12 (NIV)\nGod did extraordinary miracles through Paul, so that even handkerchiefs and aprons that had touched him were taken to the sick, and their illnesses were cured and the evil spirits left them\nI mentioned this to Charles before. Nevertheless, he still repeats his lies.\n\n","date":"September 7, 2014 at 8:35 am","url":"https://shroudstory.com/2014/08/11/the-top-ten-relics-of-christ/","cat":"video","id":"comment-149238","author":"O.K.","site":"shroudstory"},{"title":"The Top Ten Relics of Christ?","post":"I am not sure what I have done to deserve the reputation of being a compulsive lie-er!\nThere were certainly attempts to preserved the bodies of martyrs for veneration but I do not know of a single case where they caused miracles or were used as an intercession to Christ as the normal relic cults did from the fourth century onwards. One must also remember, as I do recount in my book Holy Bones, that there were indeed pagan ceremonies of veneration of the bodies of heroes and Christians followed pagan rituals here ( see Ramsay MacMullen’s The Second Church).  I would certainly not see these as uniquely Christian relic cults in the way that such cults developed from the fourth century onwards.\nThe earliest relics from the life of Christ and the Virgin Mary are not recorded until the fourth centurY and even then were contested as relevant means of worshipping Christ. The earliest mention of Helena’s discovery of the True Cross is 395. All the fourth century legends/ accounts talk of relics hidden since the Christian Era being discovered for the fIrst time then. There were later legends giving relics of the Passion,,etc, an earlier history but scholars see these as legends. It is interesting to read how Augustine at first rejected miracles through relics but over thirty years came to accept  them .\nMany ChristIan churches, including the early church, have survived without relics. They have not been seen by many Christians as relevant to Christian worship and at the Reformation were actively derided as objects of superstition.\nI have no problems with OK disagreeing with me but I cannot see why I should need to tell lies!\n\n","date":"September 7, 2014 at 3:00 pm","url":"https://shroudstory.com/2014/08/11/the-top-ten-relics-of-christ/","cat":"video","id":"comment-149293","author":"Charles Freeman","site":"shroudstory"},{"title":"The Top Ten Relics of Christ?","post":"Good evening, Charles\nYou are right about Christian churches surviving without relics. There are even non-Christians who are led to the faith without the need for miracles or relics in their lives.\nBirmingham-born Rev. Arun Arora, of Indian origin, with a Hindu father and Sikh mother became an Anglican, then a priest, and is now Head of Communication of the Anglican Church, based in Canterbury\n  \n\n","date":"September 7, 2014 at 4:22 pm","url":"https://shroudstory.com/2014/08/11/the-top-ten-relics-of-christ/","cat":"video","id":"comment-149309","author":"Louis","site":"shroudstory"},{"title":"The Top Ten Relics of Christ?","post":"What I can say is that the relics listed above in Dan’s posting are different from the handkerchiefs used to touch Paul. We do not how many of the Christ relics are authentic, the “holy prepuce” sounds like a feather from Saint Michael\nIn order of precedence, first came the kerygma, then the healing and curing, and relics came later. Peter and the rest of the first disciples had been preaching (kerygma) before Paul appeared on the scene.\nThe Catholic Church today does uses relics and blessed objects when they are needed. In the following case Professor Anil Dhawan, an Indian-born surgeon at Queen Mary College Hospital in London believed that a relic led to a cure. He was not obliged to do so because of any Church pressure, being a Hindu by religion, and he began to look into the matter deeply on his own, later reading books about Mother Teresa. He went to Malta and Rome to  answer the questions raised by the Church authorities and was present at the canonisation in Rome. In fact, his report was crucial in the canonisation process:\nhttp://www.catholicnews.com/data/stories/cns/0702902.htm\n\n","date":"September 7, 2014 at 3:33 pm","url":"https://shroudstory.com/2014/08/11/the-top-ten-relics-of-christ/","cat":"video","id":"comment-149299","author":"Louis","site":"shroudstory"},{"title":"The Top Ten Relics of Christ?","post":"Further to the above, canonizations are not easy, they can take time and each case is carefully studied, with loads of papers and the presence of a devil’s advocate.\nhttp://www.catholicherald.co.uk/news/2014/09/04/archbishop-fulton-sheens-cause-is-suspended/\n\n","date":"September 7, 2014 at 3:56 pm","url":"https://shroudstory.com/2014/08/11/the-top-ten-relics-of-christ/","cat":"video","id":"comment-149303","author":"Louis","site":"shroudstory"},{"title":"The Top Ten Relics of Christ?","post":"As I previously pointed out it is not at all surprising that there are few if any records of the earliest relics before the fourth century, because of self-imposed secrecy due to imperial persecutions, which was only relieved by the Edict of Milan.  The lack of such records is therefore an inadequate argument to assert there was no such relic cult.  \nIt is plain enough that Helena did in fact pursue her pilgrimage to Jerusalem, regardless of the timing of the earliest records of her journey.  She clearly saw value in retrieving these relics.  It would make little sense to pursue such logistics if it were unlikely to result in a popular response from the imperial subjects. \nThe Reformation iconoclastic rejection of relics can be seen as a reaction against the excesses and commercial exploitation of relics by a financially strapped medieval church.  However such rejection is out of tune with the natural human impulses to put value on the tangible material signs of an otherwise invisible and  elusive spiritual realm.\n\n","date":"September 7, 2014 at 4:03 pm","url":"https://shroudstory.com/2014/08/11/the-top-ten-relics-of-christ/","cat":"video","id":"comment-149305","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Top Ten Relics of Christ?","post":"Whether the linking of the finding of the True Cross was linked to Helena in the 320s or 390s, I agree that relics and imperial prestige were linked from the fourth century onwards and this continued for centuries. The use of the Shroud by the Savoy family to maintain their prestige is, in fact, a classic example. This is one of the reasons why relics, especially of objects, the Cross, nails, Crown of  Thorns, and further down the hierarchy ,shrouds, rather than bones became prominent after the integration of Christianity with the imperial authorities.\nI used the example of Thomas Becket in my introductory chapter of Holy Bones to show how a martyrdom led to miracles and to a pilgrimage shrine.\n\n","date":"September 8, 2014 at 2:53 am","url":"https://shroudstory.com/2014/08/11/the-top-ten-relics-of-christ/","cat":"video","id":"comment-149389","author":"Charles Freeman","site":"shroudstory"},{"title":"The Top Ten Relics of Christ?","post":"The tomb of Saint Edward the Confessor is like the “holy of holies” in Westminster Abbey. Benedict XVI and Archbishop Rowan Williams prayed there together. Before Henry VIII the faithful used to go there, looking for cures. I have seen dozens of pleas for prayer, cures and more pinned to the door of the (Anglican) Church of Saint Martin in the Fields in London  \nKing Richard III will be reburied shortly, with the participation of high-ranking Anglican and Catholic clergy:\nhttp://www.bbc.com/news/uk-england-leicestershire-29100207\n\n","date":"September 7, 2014 at 4:57 pm","url":"https://shroudstory.com/2014/08/11/the-top-ten-relics-of-christ/","cat":"video","id":"comment-149311","author":"Louis","site":"shroudstory"},{"title":"The Top Ten Relics of Christ?","post":"The tomb of the martyr Thomas Becket, archbishop of Canterbury during the reign of Henry II, was also a place of pilgrimage as recounted in Chaucer’s Canterbury Tales, until the time of Henry VIII, son of the usurper Henry Beaufort of Richmond, who had little legal claim on the English throne, but defeated Richard III at the battle of Bosworth.  Henry VIII’s Lord Chancellor, Sir Thomas More misrepresented Richard III as a monster, that in fact he was not, to shore up the questionable authority of the Tudor House, so that it became the received wisdom as portrayed in the Bard’s play, but More himself had good cause to relent this error in the course of time, himself becoming a martyr under the Tudor monarch’s ambitions.  It is gratifying that both Anglican and Catholic high-ranking clergy are participating in the internment of King Richard III.\n\n","date":"September 8, 2014 at 12:09 am","url":"https://shroudstory.com/2014/08/11/the-top-ten-relics-of-christ/","cat":"video","id":"comment-149360","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Top Ten Relics of Christ?","post":"St. Edward the Confessor, King of England, who also has an Anglican shrine dedicated to him, and Our Lady of Walsingham, shared by both Catholics and Anglicans make more sense in the context of the discussion.\n\n","date":"September 8, 2014 at 8:33 am","url":"https://shroudstory.com/2014/08/11/the-top-ten-relics-of-christ/","cat":"video","id":"comment-149431","author":"Louis","site":"shroudstory"}]
