[{"title":"This Unbelievable Claim","post":"Maybe she should sit and look into the Face of the Image on the Shroud of Turin saying to herself “I am Mollie Jameson, who are you ?”.\n\n","date":"April 7, 2015 at 2:16 am","url":"https://shroudstory.com/2015/04/07/this-unbelievable-claim/","cat":"video","id":"comment-195556","author":"Emmett McMahon","site":"shroudstory"},{"title":"This Unbelievable Claim","post":"Atheism is a religion itself — one that takes far more belief than Christianity…..\n\n","date":"April 7, 2015 at 7:21 am","url":"https://shroudstory.com/2015/04/07/this-unbelievable-claim/","cat":"video","id":"comment-195598","author":"Nabber","site":"shroudstory"},{"title":"This Unbelievable Claim","post":"Good golly, Miss Mollie.  Are you the devil with a blue dress on?\nI hope you can dance.\n\n","date":"April 7, 2015 at 7:25 am","url":"https://shroudstory.com/2015/04/07/this-unbelievable-claim/","cat":"video","id":"comment-195600","author":"Stan Walker, MD","site":"shroudstory"},{"title":"This Unbelievable Claim","post":"That doesn’t even sound like a real human voice. Sounds like a synthesized woman’s voice.\n\n","date":"April 7, 2015 at 10:23 am","url":"https://shroudstory.com/2015/04/07/this-unbelievable-claim/","cat":"video","id":"comment-195613","author":"Matt K","site":"shroudstory"},{"title":"This Unbelievable Claim","post":"This does not come as a surprise, to me at least. I mentioned such reactions a few days ago, which can be read in paragraphs 3 & 4 of the introduction:\nhttps://www.academia.edu/11355553/Dr._Paolo_Di_Lazzaro_explains_his_research_on_image_formation_on_the_Shroud_of_Turin\n\n","date":"April 7, 2015 at 2:14 pm","url":"https://shroudstory.com/2015/04/07/this-unbelievable-claim/","cat":"video","id":"comment-195637","author":"Louis","site":"shroudstory"},{"title":"This Unbelievable Claim","post":"Well, as a believer in the authenticity of the Shroud of Turin as the real burial cloth of Jesus, I can’t get too upset with young Mollie’s conclusions.  However, when she starts off asserting her belief that Jesus never even existed, she loses all credibility.  Other prominent atheists, such as Bill Mahar, have suggested the same thing.  Honestly.  This seems about as ignorant as one can get.  Besides the extensive details in the New Testament, several other secular historians, such as the Jewish Josephus and Roman Tacitus, mention Jesus.  And how dumb is it to believe that a group of Jesus’ contemporaries (apostles, disciples) made the whole story up and then went out and spread it in the face of brutal mistreatment and cruel martyrdoms.  Why would any group of people do such a thing?  The whole notion is idiotic.  It’s one thing to argue that Jesus wasn’t God as he claimed to be (though the evidence is powerful, indeed); another to say that he didn’t even exist.  \nHow can anyone take these people seriously?\nAs for the “earthquake” explanation for the erroneous carbon-14 dating, I don’t believe this theory has any credibility among the primary scientific community.  \nAll in all, Mollie has nothing to contribute to the Shroud discussion worth taking 5 minutes to listen to.\n\n","date":"April 7, 2015 at 2:48 pm","url":"https://shroudstory.com/2015/04/07/this-unbelievable-claim/","cat":"video","id":"comment-195640","author":"Jim Carney","site":"shroudstory"},{"title":"This Unbelievable Claim","post":"In my opinion, both believers and non-believers\ncan work together to seek the truth about the true age\nof that ancient Linen.\nI believe that Nicolotti has hit a point (in his favor) denigrating\nsome strange Shroud studies …\nBut I admit that I’m interested in the research of De Liso.\nAt same time I have several doubts regarding the “earthquake” explanation\nfor the erroneous carbon-14 dating…\n— —\nIn any case, if a researcher wants to do the mapping of the entire Shroud,\nI believe there is a past starting point:\n“A project to get the Shroud image by scanning”\nby\nGuido Belforte, Carlo Ferraresi, Nello Balossino and Sergio Rabellino\nAbstract\n>The paper deals with a system able to perform a single uniform scan\nacquisition of the Shroud.\nLink:\nww.shs-conferences.\norg/articles/shsconf/abs/2015/02/shsconf_atsi2014_00006/shsconf_atsi2014_00006.\nhtml\n— — —\nYesterday, in an interview to a local newspaper\n(of Biella, Piedmont), prof. Bruno Barberis said that\n“it would be desirable for a new campaign of direct studies on the Cloth”\n(to be able to collect more data in order to build a complete map\nof physical, chemical and biological characteristics) and\nthat “need a laboratory for the Shroud” …\nBut how much does such a laboratory dedicated to the Shroud?\nWhere is the provisional cost estimate?\nWould not it be better to start with the analysis of what\nhas already been taken (in the past) before launching\ninto adventures not yet well defined?\n— — —\nToday I have read that the new film “Ben Hur”\n(director = Timur Bekamambetov) start after 56 years\nand with the use of 15 cameras …\nInstead “Ben-Hur” (1925) was the most expensive film of\nthe silent-era, possibly holding the record for over twenty years…\nA “laboratory dedicated to the Shroud” cost much,\nbut (maybe) it can cost less than the movie “Ben Hur” …\nwho knows …?\n\n","date":"April 8, 2015 at 11:34 am","url":"https://shroudstory.com/2015/04/07/this-unbelievable-claim/","cat":"video","id":"comment-195741","author":"piero","site":"shroudstory"},{"title":"This Unbelievable Claim","post":"A “Laboratory dedicated to the Shroud” can cost much.\nBut.. how it costs ?\nHow to share the costs for studies, analyses, etc. ?\nDo You have a credible model to indicate?\nSo: how you should start ?\n\n","date":"April 8, 2015 at 11:48 am","url":"https://shroudstory.com/2015/04/07/this-unbelievable-claim/","cat":"video","id":"comment-195744","author":"piero","site":"shroudstory"},{"title":"This Unbelievable Claim","post":"It looks like President Obama would be interested to learn more about the Shroud. Unlike UK Prime Minister David Cameron, a practicing Anglican, he has openly declared his faith:\nhttp://www.catholicherald.co.uk/news/2015/04/08/obama-cites-pope-francis-at-white-house-prayer-breakfast/\n\n","date":"April 8, 2015 at 8:55 am","url":"https://shroudstory.com/2015/04/07/this-unbelievable-claim/","cat":"video","id":"comment-195729","author":"Louis","site":"shroudstory"}]
