[{"title":"The Real Face of Jesus Still a Top Rated Production","post":"One of the best documentary about the Shroud, except, as I said before, all the part where they make a very bad link with the Gnostic philosophy of the Universe which is completely heretic and non christian.  \nAnd Dan, Mario Latendresse said it rightly the other day, you were great in this documentary !  And I appreciate the fact that you said nothing about the Gnostics !!! ;-)\n\n","date":"December 12, 2011 at 9:33 am","url":"https://shroudstory.com/2011/12/12/the-real-face-of-jesus-still-a-top-rated-production/","cat":"video","id":"comment-5459","author":"Yannick Clément","site":"shroudstory"},{"title":"The Real Face of Jesus Still a Top Rated Production","post":"I’ve watched this documentary a multiple of times, as I enjoy pausing it at certain points and with the exceptional picture quality many details can be viewed nicely. Anyways I agree with Yannick, the whole Gnostic thing seems ‘OUT THERE’ and actually to me the whole thing is confusing with statements like ” the whole universe was severed in two, so we don’t actually see the whole picture”! Like I said, I don’t understand completely what they were trying to say, and how it can relate to the Shroud. Otherwise it is a fine documentary. I just wonder who wrote the script?, if you pay attention they use the word ‘actually’ about twenty times in the first 10 minutes or so. Also some of the details where flawed or not explained properly which could lead to ‘misconception’ by the layperson of the Shroud, pertaining to it’s history and details. But, also like as I’ve said it was a good doc, probably one of the best out there so far. The History channel should air it more often, that is one of my beefs. Although slightly flawed, it is a good product to get to the masses.\nR\n\n","date":"December 12, 2011 at 7:21 pm","url":"https://shroudstory.com/2011/12/12/the-real-face-of-jesus-still-a-top-rated-production/","cat":"video","id":"comment-5465","author":"Ron","site":"shroudstory"},{"title":"The Real Face of Jesus Still a Top Rated Production","post":"I think the guy who did Jesus face (Ray Downing) just wanted to add his own theological beliefs into the program, which was a very bad decision in my mind…  But anyway, the rest of the show was pretty good.  But as i said also the other day, we have to take this face of Jesus with a grain of salt because there’s some data that we cannot extract from the Shroud…  So the door is always open to imagination.  We would give this task of reconstructing the face of Jesus from the Shroud to 10 different expert in imagery and we would get 10 different faces !!!  So, please, don’t take this face 100% for granted.  It’s a very good try but there’s nothing to prove that it was really Jesus face.  Just an example of that : When I compare it to the portrait made by Agemian, it’s not exactly the same.  For example, the beard of Downing is much more shorter.  Who is right ?  It’s not evident at all to say !  But anyway, it was a good show !\n\n","date":"December 13, 2011 at 9:33 am","url":"https://shroudstory.com/2011/12/12/the-real-face-of-jesus-still-a-top-rated-production/","cat":"video","id":"comment-5477","author":"Yannick Clément","site":"shroudstory"},{"title":"The Real Face of Jesus Still a Top Rated Production","post":"I don’t think anyone viewing the program would accept the face which Downing and company created as being a perfect likeness, close maybe. Fact is, even Downing states in the program, he had to take some “liberties”, but that it is ‘in all probability’ the closest portrait ever created to date,  and I’d have to agree with him. This is of course if one believes the image on the Shroud is the actual Jesus of Nazareth. As a matter of coincidence, back in the 90s I had a neighbor, he was a Jewish gentleman and actually a veteran of the 67′ war, anyways I noticed immediately when first seeing the ‘face’ on the program, an uncanny resemblance to my friend. The bone structure, eyes, even the beard, hair and eyebrows!…it was alittle weird to say the least, almost sent a chill up my spine, thats’ how close the resemblance was. I wonder if he’s ever seen the program….anyways, just thought I’d share that little tidbit. ;-)\nR\n\n","date":"December 13, 2011 at 12:06 pm","url":"https://shroudstory.com/2011/12/12/the-real-face-of-jesus-still-a-top-rated-production/","cat":"video","id":"comment-5484","author":"Ron","site":"shroudstory"}]
