[{"title":"Update on the Movie, The Shroud Conspiracy","post":"An “intense” explosion? Is there such a thing as a non-intense explosion?\nEdessa (now Urfa) 1000 miles from Turin? Nope. It’s more like 2000.\nThe Secretary-General of the UN handily right next door to where the Shroud is housed,  injured in the same explosion? How convenient for compressing a story line, but then one has to maintain pace at all costs, notwithstanding considerations re credibility.  \nGabriel Messenger Films of Florida? I thought Florida was supposed to be the Sunshine State (or is it now moonshine)?\nLet’s hope the popcorn is better than the authenticity-promoting corn.\n\n","date":"August 14, 2014 at 5:27 am","url":"https://shroudstory.com/2014/08/14/update-on-the-movie-the-shroud-conspiracy/","cat":"movie","id":"comment-143859","author":"Colin Berry","site":"shroudstory"},{"title":"Update on the Movie, The Shroud Conspiracy","post":"PS: Anyone who suspects as I did that a storyline based on the Shroud was simply a vehicle for pushing an essentially RC-oriented pro-authenticity message can have their suspicions confirmed by visiting this site.\nhttp://variety.com/2013/film/reviews/film-review-the-investigator-1200672458/\nIt’s a review of Gabriel Messenger Inc’s previous offering, “The Investigator” (2013).\nHere’s just the intro, which gives a flavour:\n“The “homicide” of Jesus goes to trial in this hokey but surprisingly watchable Christian evangelical production. The investigation at the center of “The Investigator” is a classroom inquiry into the “homicide” of Jesus Christ as conducted by a former NYC cop turned high school teacher. But this odd duck of a Christian evangelical production, written by Rich Romano (brother of Ray) and drawn from events in his own life is also, by turns, an underdog sports pic, a “Dangerous Minds”-style classroom drama, and a sledgehammer (but not unaffecting) tragedy about one man’s loss and gradual rekindling of faith. Playing on 11 screens since Sept. 13, the self-distributed indie has grossed a respectable $100,000 and should continue to play well to its target demo as it expands.\nThe key word would seem to be “evangelical”, albeit played-down sotto voce evangelism. Bit like this site really… \nPS to Dan: Am intrigued by your start-up “Best of shroudstory.com”.  Let me know if you need any help in planning a “Worst of shroudstory.com”. \nOne could start with “The carbon dating, once seemingly proving it was a medieval fake, is now widely thought of as suspect and meaningless. Even the famous Atheist Richard Dawkins admits it is controversial”   See blog margin. .\nControversial: “giving rise or likely to give rise to controversy or public disagreement.”\nSo what’s that got to do with his views on the credibility or otherwise of the radiocarbon dating? Link?\nOh, and  “atheist” does not have an upper-case A, and in any case I suspect that RD is not really atheist, more anti-theist, dismissive, contemptuous even, of those who claim to know the mind and design of God.\n\n","date":"August 14, 2014 at 6:37 am","url":"https://shroudstory.com/2014/08/14/update-on-the-movie-the-shroud-conspiracy/","cat":"movie","id":"comment-143868","author":"Colin Berry","site":"shroudstory"},{"title":"Update on the Movie, The Shroud Conspiracy","post":"PPS:  OK, it did not take long to track down what Richard Dawkins really said, and its sense, needless to say,  was the exact opposite from that of Dan Porter’s truncated quote.\nWhat’s more, the correct, non-truncated quote appeared on this very site back in 2009 (the omitted portion in my italics).\n“The dating of the shroud remains controversial, but not for reasons that cast doubt on the carbon-dating technique itself.”\nhttps://shroudstory.com/2009/10/20/richard-dawkins-on-the-shroud-of-turin/\nRD, that famous “Atheist”, not to be confused with a “Theist”,  admits nothing. Controversial simply means what it says, i.e. “giving rise or likely to give rise to controversy or public disagreement”.\nIf there’s any lingering doubt as to RD’s position re the radiocarbon dating, then read these words of his that appeared on his own site in 2011:\n“… the carbon-14 evidence that the shroud’s linen is much too young to be the shroud of Jesus is rock solid. Three independent labs, in Arizona, Zurich and Oxford, were each given four samples, making 12 datings in all. The dates varied within expected margins of error, but all put the linen as younger than 600 AD. The shroud may or may not bear the genuine imprint of a body, but that body is not the body of Jesus or of anyone who lived before 600 AD.”\nWhat possible justification can there be for implying that Dawkins has – or had – doubts as to the dating result when, right or wrong, he expressed total confidence in its ballpark accuracy,. He conceded NOTHING  WHATSOEVER to those who would have us believe it was a bum result.\nMethinks that reference to Dawkins should be excised forthwith from Dan’s margin comments. (That’s not because I have a soft spot for RD and his blogging style, having had more than one of MY comments appear and then disappear in short order from HIS site!).\n\n","date":"August 14, 2014 at 11:46 am","url":"https://shroudstory.com/2014/08/14/update-on-the-movie-the-shroud-conspiracy/","cat":"movie","id":"comment-143898","author":"Colin Berry","site":"shroudstory"},{"title":"Update on the Movie, The Shroud Conspiracy","post":"I agree with Colin. Please strike Dawkins comments from the site as they are misrepresentative. His use of the phrase ‘rock solid’ is laughable but he still is entitled to be honestly represented.\n\n","date":"August 14, 2014 at 1:21 pm","url":"https://shroudstory.com/2014/08/14/update-on-the-movie-the-shroud-conspiracy/","cat":"movie","id":"comment-143905","author":"David Goulet","site":"shroudstory"},{"title":"Update on the Movie, The Shroud Conspiracy","post":"Actually, Colin, I relied on Dawkins’, “The Greatest Show on Earth,” which just incidentally is a wonderful book that I enjoyed very much. I take my statement about the shroud being controversial from pp. 105-106 of the Free Press Paperback reprint. Note in the quotation the phrase “carbon-dating technique.” And I agree. It is good science. And in the case of the shroud it was good science done poorly. If Dawkins had been well informed about the objections to the radiocarbon dating – not fire caused contamination but evidence of material intrusion probably from reweaving – he could have given a better account. Notice he avoids the question of sampling altogether. Is there no one other than you with the courage and/or the comprehension of good scientific practices to proclaim that each and every one of the 1988 scientists should have walked away from the single sample. Dawkins comes out looking dull. \nDavid Goulet suggests striking it. I probably will. Or I may expand upon it to show how imprecise Dawkins is. (I’ll probably strike it). Maybe I should change it to even Colin Berry thinks the scientists should have walked away from a single sample (just kidding, but yeah!).\nHere is the quote from the book:\n“. . . When mass spectrometry made it possible to date a tiny sample of the shroud, rather than the substantial swathes that would have been needed before, the Vatican allowed a small strip to be cut off The strip was divided into three parts and sent to three leading laboratories specializing in carbon dating. in Oxford, Arizona and Zurich. Working under conditions of scrupulous independence — not comparing notes — the three laboratories reported their verdicts on the date when the flax from which the cloth had been woven died.\nOxford said AD 1200, Arizona 1304 and Zurich 1274. These dates are all — within normal margins of error — compatible with each other and with the date in the I 350s at which the shroud is first mentioned in history. The dating of the shroud remains controversial, but not\nfor reasons that cast doubt on the carbon-dating technique itself. For example, the carbon in the shroud might have been contaminated by a fire, which is known to have occurred in 1532. I won’t pursue the matter further, because the shroud is of historical, not evolutionary,\ninterest. It is a nice example, however, to illustrate the method, and the fact that, unlike dendrochronology, it is not accurate to the nearest year, only to the nearest century or so.”\nLet’s look at the important part of the above. “The dating of the shroud remains controversial, but not for reasons that cast doubt on the carbon-dating technique itself,” He is talking about the technique, the science, ‘to illustrate the method.”  But the dating remains controversial. Why?  Because of poor quality use of the otherwise good technique. \nAs for capitalizing Atheist, I am much convinced by a good friend, an Atheist himself, who generally prefers that the word be capitalized in the same way that Christian is capitalized – a member of a class of people. I understand your comparison to theist. I also understand that the an ample majority of writers do not capitalize atheist.  I believe the Chicago Tribune Style Guide allows both. We could toy with many words like Catholic, Orthodox, Evangelical. When I do capitalize atheist, I do it out of respect as I do for someone who is Muslim or Jewish or an Epicurean.  We have bigger issues.\nAs for my experiment with the Best of, it is just that, an experiment. Feel free to launch a counterpoint.\n\n","date":"August 14, 2014 at 4:29 pm","url":"https://shroudstory.com/2014/08/14/update-on-the-movie-the-shroud-conspiracy/","cat":"movie","id":"comment-143927","author":"Dan","site":"shroudstory"},{"title":"Update on the Movie, The Shroud Conspiracy","post":"Thank you for the considered answer Dan. But I still don’t accept that your reference to RD has any place in your sidebar credo, and that is after trying I hope successfully to get my mind round your highly nuanced  defence. You see, even if it was remiss of Dawkins to have made no mention of the invisible re-weave scenario, that does not mean that he was unaware of it. Maybe like me, he did a quick mental calculation, and asked himself what the likelihood was that a sample would comprise just the right proportions of 1st and 16th century threads to produce a answer of 1325 +/- 65, that midrange value being just 30 years short of the first recorded appearance of the TS in W.Europe. \n RD could be forgiven for not wishing to pay lip service to so improbable, or some might say contrived scenario whereby a precise and fortuitous mix of two inputs 15 or 16 centuries apart ends up so close to the anti-authenticity bulls-eye. Maybe he considered the ‘repair’ hypothesis scarcely more realistic than those ‘bioplastic’ explanations, and wished to say nothing that might give it undeserved publicity. Whatever was in his mind, he chose to say nothing that would detract either from the methodology OR anything that would detract from the reliability of the answer it yielded. \nThat being the case, I do hope you see the rightness of removing all mention of RD from your sidebar (a long-standing source of irritation to this blogger, and now David Goulet too (thanks!) regardless of what RD himself might think re being dragooned as a radiocarbon sceptic, thanks to a few slick words of Madison Avenue copy writing. Speaking of which… nope, best we don’t go there…\n\n","date":"August 14, 2014 at 5:52 pm","url":"https://shroudstory.com/2014/08/14/update-on-the-movie-the-shroud-conspiracy/","cat":"movie","id":"comment-143937","author":"Colin Berry","site":"shroudstory"},{"title":"Update on the Movie, The Shroud Conspiracy","post":"The way I read Dan’s RD quote is that it seems to suggest RD accepted the carbon dating result but acknowledged – if not agreed with – theories for why the real age of the shroud might have been older than the dating results suggested eg. 1500s fire\n\n","date":"August 15, 2014 at 6:39 am","url":"https://shroudstory.com/2014/08/14/update-on-the-movie-the-shroud-conspiracy/","cat":"movie","id":"comment-144024","author":"Thomas","site":"shroudstory"},{"title":"Update on the Movie, The Shroud Conspiracy","post":"Fair point, Thomas.  But RD only referred to it briefly in passing as one suggested source of contamination (i.e. the 1532 fire, largely discounted I might say on chemical grounds).  There’s no suggestion that it was his idea, or that he considered it might make a 1st century item date as if 1300 years younger. How could it, without the radiocarbon specimen looking as though it had fallen soot-laden out of a chimney?\nIn short, he was just flagging up that he was au fait with some of the ‘controversy’, while not wishing to become personally involved, and certainly not subscribing to one or other attempt to write off the entire dating exercise as “suspect and meaningless”.\n\n","date":"August 15, 2014 at 7:28 am","url":"https://shroudstory.com/2014/08/14/update-on-the-movie-the-shroud-conspiracy/","cat":"movie","id":"comment-144033","author":"Colin Berry","site":"shroudstory"}]
