[{"title":"‪An invitation to discuss the Shroud of Turin. You’ve got to be kidding.","post":"What I’ve noticed is there’s a whole bunch of young men in the current generation who want to style themselves as agnostics or athiests and think of themselves as philosophers. And they are incredibly BAD at it. They don’t have their facts straight. They are not actually interested in learning anything, they mostly like to swagger. That’s the way it seems to me, anyway. \nThey think of themselves as superior because they question everything. However, they don’t have anything to offer. What they offer is a lot of Doubts about anything they don’t like. They’re skilled in offering criticisms and blasphemous doubts and that’s about all they’re good at.  They’re not builders, they are destroyers. \nCatherine Marshall wrote an interesting phrase in her book, Christy. “Any fool can destroy but it takes a real man to build.” \nI think such young men should settle down and get real. If they are TRULY interested in finding TRUTH, then join those who are digging for it instead of scoffing and mocking on the sidelines.  IMO.\n\n","date":"July 26, 2011 at 2:53 pm","url":"https://shroudstory.com/2011/07/26/%e2%80%aaan-invitation-to-discuss-the-shroud-of-turin-youve-got-to-be-kidding/","cat":"video","id":"comment-3429","author":"AnnieCee","site":"shroudstory"},{"title":"‪An invitation to discuss the Shroud of Turin. You’ve got to be kidding.","post":"Annie, you’re so right.  \nI have noticed that particularly on YouTube there seems to be a critical mass of these young air heads.  They’re so abysmally unprepared for any intelligent discussion, yet they immediately jump on any pro-faith videos that are posted, antagonizing the believers and inciting arguments.  I think they’ve assumed that all people of faith are dumb and that there is no need to know anything to prove their superiority of intellect.  \nI recently did engage in a sort of argument with a couple of them.  I’m not prone to wasting my time like that but the blasphemy they were spouting was so offensive.  They immediately proved they had nothing of substance to argue.  I gave up and left them to work their way out of the wet paper bag they’d willingly climbed into. But some people do get really worked up by them and I guess that’s what they’re after.  Sigh. I will not click on that link and give them the satisfaction.\n\n","date":"April 10, 2012 at 12:46 pm","url":"https://shroudstory.com/2011/07/26/%e2%80%aaan-invitation-to-discuss-the-shroud-of-turin-youve-got-to-be-kidding/","cat":"video","id":"comment-10261","author":"Susana","site":"shroudstory"},{"title":"‪An invitation to discuss the Shroud of Turin. You’ve got to be kidding.","post":"Haha “air-heads” …well said Susana, I haven’t heard that expression in awhile. Nowadays I think the term most widely used is dumb-***.  ;-)\nR\n\n","date":"April 10, 2012 at 4:45 pm","url":"https://shroudstory.com/2011/07/26/%e2%80%aaan-invitation-to-discuss-the-shroud-of-turin-youve-got-to-be-kidding/","cat":"video","id":"comment-10266","author":"Ron","site":"shroudstory"},{"title":"‪An invitation to discuss the Shroud of Turin. You’ve got to be kidding.","post":"Dan, you wrote : “Why are they attacking me for much of an hour?”.\nI guess it’s probably because you’re one of the most known Shroud speaker these days…  Take this like kind of a compliment ! ;-)\n\n","date":"July 26, 2011 at 3:33 pm","url":"https://shroudstory.com/2011/07/26/%e2%80%aaan-invitation-to-discuss-the-shroud-of-turin-youve-got-to-be-kidding/","cat":"video","id":"comment-3430","author":"Yannick Clément","site":"shroudstory"},{"title":"‪An invitation to discuss the Shroud of Turin. You’ve got to be kidding.","post":"I’ll give you another example. These wannabe skeptics wanted to complain about the Real Face of Jesus. But lacking any substantive arguments all they could do was ridicule the History channel for making so many ridiculous show. That is true. The History channel can be insane at times. But it also produces some great award winning series like the Universe,  America the Story of Us  and How the Earth Was Made. Are these to be ridiculed simply because the are from the History channel? Do you think they are aware that the Real Face of Jesus was nominated for two prestigious awards, the Banff World Media Festival Non-Fiction Rockies in Science and Technology and the Factual Entertainment Awards?  These guys are way out of their league when it comes to the Shroud. Why did they go on for an hour. Because it bugs them that there is no real argument against it. And they know it.\n\n","date":"July 26, 2011 at 4:31 pm","url":"https://shroudstory.com/2011/07/26/%e2%80%aaan-invitation-to-discuss-the-shroud-of-turin-youve-got-to-be-kidding/","cat":"video","id":"comment-3431","author":"kris herbert","site":"shroudstory"},{"title":"‪An invitation to discuss the Shroud of Turin. You’ve got to be kidding.","post":"Holy Geez, I couldn’t watch more then 8 minutes of that youtube video, those guys are just plain retards.”I’m willing to listen to any credible evidence” why not search and ‘READ’ for yourself? These guys did not even research a single ‘credible’ thing before their no.3 episode let alone any peer-reviewed papers.Typical of alot of the new generation growing up now, they want everything handed to them and too lazy to do the work themselfs.Personally I would just ignore them, last count they had 70 hits on thier latest video, can anyone say FAIL.\nThey are not worth your time Dan.Or even anymore mention.\nRon.\n\n","date":"July 26, 2011 at 11:47 pm","url":"https://shroudstory.com/2011/07/26/%e2%80%aaan-invitation-to-discuss-the-shroud-of-turin-youve-got-to-be-kidding/","cat":"video","id":"comment-3437","author":"Ron","site":"shroudstory"},{"title":"‪An invitation to discuss the Shroud of Turin. You’ve got to be kidding.","post":"I agree with Ron. Seventy pitiful hits. Some of those are click ins from YouTube’s automatically generated suggestions. Some are probabably links from this blog. I would be surprised if anyone watched the show from beginning to end. It is really awful. It is so obvious that they have not done any real research. Unable to really criticize the shroud, they spend their time ridiculing others.\n\n","date":"July 27, 2011 at 2:53 am","url":"https://shroudstory.com/2011/07/26/%e2%80%aaan-invitation-to-discuss-the-shroud-of-turin-youve-got-to-be-kidding/","cat":"video","id":"comment-3438","author":"kris herbert","site":"shroudstory"},{"title":"‪An invitation to discuss the Shroud of Turin. You’ve got to be kidding.","post":"I wonder how many hits Dan gets.\n\n","date":"July 27, 2011 at 2:54 am","url":"https://shroudstory.com/2011/07/26/%e2%80%aaan-invitation-to-discuss-the-shroud-of-turin-youve-got-to-be-kidding/","cat":"video","id":"comment-3439","author":"kris herbert","site":"shroudstory"},{"title":"‪An invitation to discuss the Shroud of Turin. You’ve got to be kidding.","post":"Nickell  is a real hypocrite.\nFrei “made a fool of himself authenticating the notorious Hitler Diaries.”?\nNickell never remember when speaks or writes about the Shroud that to authenticate the diaries was also Ordway Hilton who was according NYT “One of the nation’s foremost authorities on detecting forged documents”.\nhttp://www.nytimes.com/1998/05/10/us/ordway-hilton-84-authority-who-detected-forged-papers.htmll\nLet’s read as NYT justify Hilton’s mistake: “Given what he was told were photostatic copies of pages from the diaries and examples of Hitler’s writing, Mr. Hilton said that both sets of documents had been produced by the same hand. Indeed, they had, though the common hand turned out not to have been Hitler’s but the forger’s.”.\nIt is evident that the same justification should be given to Frei if someone is honest!\nBut there is other. Nickell is very very hypocrite because in his book “Detecting forgery: forensic investigation of documents”  writes; “in 1983 three examiners declared the diaries genuine. Unforunatley they had allowed Stern magazine, who commissioned them, to supply the alleged standards; it turned out that some of those were also Kujau forgeries”.\nSo Nickell knows the thruth but when he needs to attack Max Frei forget it!\nAnd Ordway Hilton is one of the handwriting expert most quoted in Nickell’s books about forensic science!\n\n","date":"July 27, 2011 at 3:41 am","url":"https://shroudstory.com/2011/07/26/%e2%80%aaan-invitation-to-discuss-the-shroud-of-turin-youve-got-to-be-kidding/","cat":"video","id":"comment-3440","author":"domenico","site":"shroudstory"},{"title":"‪An invitation to discuss the Shroud of Turin. You’ve got to be kidding.","post":"Dominico, your so right.AND the worst part is the audacity of Nickell’s to claim Frei was “a-jack-of-all-trades”, when he alone is A Jack of All Trades AND a ‘Master of NONE’.Frei was an expert, a pioneer in his field and highly regarded by many of his peers.Can Nickell’s claim the same? I think NOT…Personally I give no credance to anything the man says and anyone who does should really do a re-think.\nRon\n\n","date":"July 28, 2011 at 4:22 am","url":"https://shroudstory.com/2011/07/26/%e2%80%aaan-invitation-to-discuss-the-shroud-of-turin-youve-got-to-be-kidding/","cat":"video","id":"comment-3454","author":"Ron","site":"shroudstory"},{"title":"‪An invitation to discuss the Shroud of Turin. You’ve got to be kidding.","post":"I’ll bet bearded guy told skinny guy what to say ensuring that neither one knows what they are talking about. It is obvious that they have been fooled by reading and believing Nickell. I don’t know about silent guy. Watch him. He seems embarrassed by his buddies.\n\n","date":"July 27, 2011 at 4:29 am","url":"https://shroudstory.com/2011/07/26/%e2%80%aaan-invitation-to-discuss-the-shroud-of-turin-youve-got-to-be-kidding/","cat":"video","id":"comment-3441","author":"kris herbert","site":"shroudstory"},{"title":"‪An invitation to discuss the Shroud of Turin. You’ve got to be kidding.","post":"Dan,\nI figured it out.  A little late, but better than never.\nBack on 2/7/11, I claimed on your blog that I had a way to expose (to the world) the “wrongheadedness” of the notable detractors of the Shroud — and that such would be a very good thing.  I went on to say that I would happily explain my approach if anyone was interested…\nYou were the only one interested, but clearly that was plenty, so I wrote back trying to explain.  You didn’t respond, so I figured that you weren’t particularly impressed, but that you were too kind, and busy, to explicitly say so.  Or maybe, you just don’t have time to personally read all your email…\nIn truth, you’ve always been especially rational and friendly, so I figured that I just wouldn’t bother you for awhile.\nBut then, I have continued to think about what seems to me an excellent opportunity for helping people with their Christian faith.  (I don’t think that faith needs to be blind.)  And, while showing up the skeptics to the world wouldn’t necessarily prove anything, it would surely help.\nSo anyway, my approach was to challenge any, and all, notable detractors of the Shroud to a public (on-line) written debate.  I figured that our side would surely win an EFFECTIVE debate — and most importantly, that I KNEW HOW TO HOLD SUCH A DEBATE.  \nAnd the first step in developing such debate would be putting it into writing.\nSo anyway, I think that we (you, with us fans helping) should accept a debate, but not in an oral format.  You should tell your adversaries that you would WELCOME a live, on-line, debate, but that it has to be in writing — as, ORAL debates tend to be little more than side shows…\nI’ll try again to lay out the parameters of my alleged solution in a minimal way, and put it on this blog.  If I can’t abstract it sufficiently, I’ll send my best effort by email.\nIf anyone is interested, one of my “treatises” regarding this plan can be found on my website at http://www.MessiahOrNot.com/Treatise.php. \nTo see that I’m probably not a kook, you can check out my brief autobiography at http://www.MessiahOrNot.com/Biography2.php. \nOtherwise, I’ve been arguing with a bunch of atheists re the Shroud beginning with http://debate.atheist.net/showthread.php?t=3891.  That’s Part I — I’m now on Part IV.\nI’m probably forgetting something critical.\n\n","date":"July 29, 2011 at 6:59 am","url":"https://shroudstory.com/2011/07/26/%e2%80%aaan-invitation-to-discuss-the-shroud-of-turin-youve-got-to-be-kidding/","cat":"video","id":"comment-3467","author":"Jabba","site":"shroudstory"}]
