[{"title":"While awaiting the CNN Documentary","post":"The Shroud of Turin could be real because it was put on the cloth photographically, God’s Spirit removed my heart and gave me another, and in the process the Spirit was a light with the power of God behind it, which the same Spirit could have put the image on the cloth photographically. mrmullen@vcn.com\n\n","date":"February 28, 2015 at 6:40 pm","url":"https://shroudstory.com/2015/02/23/while-awaiting-the-cnn-documentary/","cat":"television","id":"comment-192055","author":"mickeymullen","site":"shroudstory"},{"title":"While awaiting the CNN Documentary","post":"The Shroud of Turin show on CNN is irresponsible journalism and bad science.  Where have you people been?  This issue was resolved a long time ago, shortly AFTER the first carbon dating tests.  There was a 2 part series (on PBS maybe? I’ve seen it twice) that first reported, like you just did, a 14th century dating.  The part 2 show (perhaps a year or so later), resolved the issue for good.  Most of the interviews were with one of the scientists who conducted the original carbon dating at the Arizona lab.  He admitted that the original results ignored basic science logic and protocols (probably because they were scientists and WANTED the shroud to be a forgery).  He indicated the 3 labs that ran the tests had returned dramatically different results, which should have been a BIG red flag.  Carbon dating cannot be that inaccurate, but they ignored it and took an AVERAGE (how stupid and unscientific) of the results to come up with the 14th century date.\nThen two university professors (Midwest husband and wife I think) suspected an error and submitted a paper on it.  The wife was an expert in medieval fabrics.  Her conclusions turned out to be correct.  It was a common medieval practice to repair fabrics by weaving in new fabric.  Carbon dating COUNTS carbon atoms.  Since we scientifically know at what rate carbon atoms decay, we can mathematically figure out a material’s age.  So each lab’s dramatically different results simply meant the swatch each one tested had varying amounts of original fabric versus repair fabric.\nThe Arizona lab first said they had scanned the shroud and didn’t see different fabrics, but oops, bad science again.  The scientist interviewed on the show realized they had only scanned the IMAGE, not the borders of the shroud where the swatches were cut from (Duh!).  They luckily had enough material to test again and showed a microscopic shot of the two fabric materials weaved together.  When the older fabric was separated it was dated at the time of Jesus. \nThe show also reported a previous challenge for anyone to recreate the shroud.  Artists, scientists, and doctors tried.  The only one who came remotely close was an artist.  We saw footage of how it looked similar to the naked eye, but under an electron microscope it was flat, while the real shroud clearly showed dimensional contours of the body.\nIf you consider yourself an ethical journalistic news source, to repair the incomplete/inaccurate conclusions implied in your telecast that perpetuates the falsehood of an important religious issue, you should air the Part 2 show I described.\n\n","date":"March 2, 2015 at 11:49 am","url":"https://shroudstory.com/2015/02/23/while-awaiting-the-cnn-documentary/","cat":"television","id":"comment-192199","author":"Steve Vitale","site":"shroudstory"},{"title":"While awaiting the CNN Documentary","post":"Almost nothing of the comment above is true, and little is even close to the truth.\n\n","date":"March 2, 2015 at 12:56 pm","url":"https://shroudstory.com/2015/02/23/while-awaiting-the-cnn-documentary/","cat":"television","id":"comment-192207","author":"Hugh Farey","site":"shroudstory"}]
