[{"title":"Environmental Study of the Shroud in Jerusalem Videos","post":"I have been attempting to post this comment about 12 times in the last 24 hours, into the thread on “Social Encyclopedia-ing” of 24 Nov unsuccessfully.  I seem to have been blocked from posting on that thread, else told it’s a duplicate comment.  I’ll try posting it out of context here instead.  Here goes: \nConcerning the D’Arcy memorandum alleging that the image was painted: \nThe position is clearly set out in Markwardt’s 2001 paper “Conspiracy against the Shroud”, and Wilson 1978 also comments on it.  \nIn 1900 Ulysse Chevalier apparently had available to him a near-finished Latin draft from the Troyes diocesan archives addressed to a Scribe, which would imply that the alleged memorandum was never even sent to the Scribe, let only to Anti-pope Clement VII.  However rather than producing this draft, Chevalier cobbled together a text from prior separate notes, which included editing marks such as marginal notes, cross-outs, and substitute wording, and manufactured for it an end of 1389 date; as by its archival retention it would be clear from the near-finished draft for the scribe that the memorandum had not in fact been sent to Clement.  \nMarkwardt refers to the two source documents: “In 1993, Hilda Leynen discovered that two distinct drafts of the D’Arcis Memorandum were maintained in the Champagne collection of the Bibliothèque Nationale de France, one very rough and containing bracketed words, and the other a relatively neat and polished product.”   \nFrom Chevalier’s cobbled Latin text, Herbert Thurston published an English translation in the Catholic periodical “The Month” in 1903.  Wilson 1978 provides the full text of Thurston’s translation as Appendix B, the fraud apparently even escaping Wilson’s attention.   \nThe relevant text cited by Markwardt is included in his Note 6:\n‘6  The memorandum refers to an alleged investigation conducted, in about 1355, by Henri\nde Poitiers, Bishop of Troyes. “Eventually, after diligent inquiry and examination, he\ndiscovered the fraud and how the cloth had been cunningly painted, the truth being\nattested by the artist who had painted it, to wit, that it was a work of human skill and not\nmiraculously wrought or bestowed.” ‘ \nWilson makes the point that Latin lacks a definite article, and that the verb used was not “pingere” (to paint) but “depingere” (to copy).  Thus the key phrase can be just as easily translated as: “… by an artist who had copied it … ”  which sheds rather a different light on the whole bizarre episode.  Thus relying on a questionable translation of a fraudulent memorandum may be the stuff by which art historians might make a living, but to others it may seem rather slender grounds for asserting that the origin of the Shroud image was ever an artist’s paint-brush! \nVery likely, D’Arcis’ alleged copy assuming it existed, may have been commissioned by Jeanne de Vergy to replace the original she had taken from St Stephen’s at Besancon for safe-keeping and the venerable cleric was confused about the matter.  The 1880 assertion that both the Besancon and Piedmont Shrouds were authentic burial cloths beggars belief, would seem to be based on no more than an excessive piety, by 1880 the French Revolution would already have deposed of the Besancon icon, the reverend gentleman would no longer have had access to it, nor would he have had access to the 1898 Pia photography.\n\n","date":"November 26, 2014 at 4:54 am","url":"https://shroudstory.com/2014/11/25/environmental-study-of-the-shroud-in-jerusalem-videos/","cat":"video","id":"comment-173071","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Environmental Study of the Shroud in Jerusalem Videos","post":"I am not sure how Daveb’s comment wound up on this thread, but it is welcome non-the-less and I will tie it to the video and Charles Freeman.\nTomorrow, I will dine with an individual who as a PhD in History from Princeton and a relationship with my family. She has published and hopefully will not perish. I asked her about History Today and it turns out that History Today is not peered reviewed. Given Charles Freeman’s blather about his research and the attention to the History Today article, I ask Charles a question: Was your article in History Today vetted by a formal peer-reviewed process? Yes or no.\nSecond, Daveb’s comment is thorough (as usual) and confines not only the D’Arcis memorandum and the Chevalier-Thurston screeds to the dust bin of history but repeats a rather obvious speculation (that Ian Wilson proposed) that whatever D’Arcis was told, the artist was talking about a copy of the Shroud. And as we know, from a very early time after the first exposition, artists started to copy the Shroud.\nThe history of the Shroud after the first exposition indicates the distinct possibility that Shroud had been withdrawn from public view and it is quite possible that the cannons of the Lirey Church were displaying a copy of the Shroud which was after all their bread and butter. But I may hypothesize the wheel. In fact, see the following article by Luigi Fossati published in Shroud Spectrum in 1983: http://www.shroud.com/pdfs/ssi08part5.pdf\nThe point is, as Daveb (and earlier Wilson and then Fossati) points out, the Chevalier-Thurston hypothesis was itself a hoax. \nThe video posting of the film narrated by Sr. Damien like the STURP report before it and every other peer reviewed publication that I am aware of, annihilates any painting thesis and actually ties together some loose ends. For example why did Nicodemus produce such a large amount of material for the entombment? It wasn’t all meant for the body but to also coat the tomb in a manner that was common to tombs at the time. Watch the video as the mystery is unraveled. (And the Gospel account of Nicodemus’s action substantiated). Also, The Ray Rogers hypothesis on the image formation process is generally supported.\nSad to say, the latest victim of the D’Arcis hoax was Charles Freeman.\n\n","date":"November 26, 2014 at 7:54 am","url":"https://shroudstory.com/2014/11/25/environmental-study-of-the-shroud-in-jerusalem-videos/","cat":"video","id":"comment-173093","author":"John Klotz","site":"shroudstory"},{"title":"Environmental Study of the Shroud in Jerusalem Videos","post":"Take out my mention of the D’Arcis memorandum and my argument remains the same.\nI passed my article through a prominent Oxford professor of church history and individual parts of it( on the weaving, ‘ human blood’ thesis ,etc) to specialists before I even submitted the the article to HT.\nI cannot believe that in the two months between submission and acceptance , the editor of HT did not pass it though some members of the very prestigious advisory committee of History Today. What else are they there for?\nI would have known by now if there had been any serious academic challenges to my article by fellow professionals. But, as I have said before, it will take a year to assess the academic credibility of my article. So far, so good, 20,000 hits virtually no hostile reactions apparently.  If anyone from this website wishes to mount an academic challenge to it in an equivalent journal to History Today, please do.\n\n","date":"November 26, 2014 at 9:36 am","url":"https://shroudstory.com/2014/11/25/environmental-study-of-the-shroud-in-jerusalem-videos/","cat":"video","id":"comment-173108","author":"Charles Freeman","site":"shroudstory"},{"title":"Environmental Study of the Shroud in Jerusalem Videos","post":"You already have had serious challenges here.\n\n","date":"November 26, 2014 at 9:54 am","url":"https://shroudstory.com/2014/11/25/environmental-study-of-the-shroud-in-jerusalem-videos/","cat":"video","id":"comment-173114","author":"John Green","site":"shroudstory"},{"title":"Environmental Study of the Shroud in Jerusalem Videos","post":"Yes,what would one expect?, but I have not found them convincing and if only posted  here they won’t affect my standing in the wider academic world which is why I added the final sentence of my last posting. It’s there where the debate is going to be won or lost.\n\n","date":"November 26, 2014 at 10:02 am","url":"https://shroudstory.com/2014/11/25/environmental-study-of-the-shroud-in-jerusalem-videos/","cat":"video","id":"comment-173117","author":"Charles Freeman","site":"shroudstory"},{"title":"Environmental Study of the Shroud in Jerusalem Videos","post":"Charles,\nYou apparent think the the “academic world” is the beginning and end of the human knowledge. It isn’t. The Should is not an academic construct. It is a real object existing here and now. \nLet me state here and now. If the Shroud is authentic, with the possible exception of nuclear weapons, it is the most important object on the face of the earth. Do you have another nominee?\nAn authentic Shroud confirms the reality of Jesus Christ, his horrible torture and his crucifixion. It also offers circumstantial evidence that support the account of his Resurrection as told in the Gospels.\nThose are matters of more than “academic interest.” I don’t know what that phrase means on your side of the Pond, but on this side it is more or less synonymous with “hypothetical” or “theoretical.” \nThis is why I think Jesus Christ and his Shroud are of more than hypothetical importance. We are facing the threat of an apocalypse that I have dubbed the “The Apocalypse of Selfishness.” It is the selfishness exploitation of the environment that causes many scientists to project the effective extinction of  humanity within 100 years. \nJesus Christ is the example of selfish love martyred by the disciples of selfishness.\nLet me give you a freebie. The last four paragraphs of my book;\n“The power of the selfish conduct which drove humanity forward\nthrough evolution is now driving humanity to extinction. It is in our power to\nresist that, but our resistance must be through acts of selfless love both\ncollectively and individually.\n“Humanity may survive another 100 years or perhaps another 100\nmillion. Because of the triumph of selfishness, it may end when the world\nbecomes a poisonous, toxic rock unsuitable for any habitation. Or, humanity\ncould be extinguished when a massive meteorite or asteroid plummets to\nearth starting a chain of events that will render human life untenable.\nWhether we, collectively or individually, find our lives overwhelmed by\nselfish power, we can survive no matter how beleaguered we may feel or\nbecome, remembering always that God is love.\n“Every human being is gifted with that reflective consciousness that\nremoves us from the mundane and opens the path to the eternal\nconsciousness. That will never change. And we have the Shroud that in the\nwords of Fr. Delessi, is “God’s love letter in linen to all mankind.” In this\ntime of peril, let us embrace it.\n“Joyfully!”\nIf you want to read more.\nKINDLE  is linker here: http://www.amazon.com/dp/B00O3KFY0E\nNOOK is linked here: http://www.barnesandnoble.com/w/the-coming-of-the-quantum-christ-john-klotz/1120459275?ean=2940150520318\n\n","date":"November 26, 2014 at 1:05 pm","url":"https://shroudstory.com/2014/11/25/environmental-study-of-the-shroud-in-jerusalem-videos/","cat":"video","id":"comment-173143","author":"John Klotz","site":"shroudstory"},{"title":"Environmental Study of the Shroud in Jerusalem Videos","post":"As I’ve said before I was in academia and it can have a very limited world view.\nIn my experience there was a strong left-wing atheistic streak. It often seemed if you didn’t subscribe to this world view then you would always be on the outer.\n\n","date":"November 26, 2014 at 6:33 pm","url":"https://shroudstory.com/2014/11/25/environmental-study-of-the-shroud-in-jerusalem-videos/","cat":"video","id":"comment-173171","author":"Thomas","site":"shroudstory"},{"title":"Environmental Study of the Shroud in Jerusalem Videos","post":"The Freeman hypothesis fails to explain the symmetrical pattern of water stains unconnected with the Chambery fire of 1532, and as discussed by Aldo Guerreschi and Mme Flury-Lemburg.  From the symmetry of the pattern it is evident that the cloth was then folded into some 52 segments of about 1 foot square.  It had been folded twice lengthwise and then with 12 loose folds concertina fashion.  The pattern is discussed in Wilson 2010, his Chapter 6 and Fig 12.  The looseness of the folding suggests storage in an earthenware jar similar to those used for the storing of the Dead Sea scrolls.  Guerreschi and Wilson simulated the folding and storage on British Television in 2004 obtaining an identical water stain pattern. \nPerhaps the water stain pattern was incurred during a journey by camel train from Afghanistan, or from hiding it from imperial authorities in Antioch by monkish custodians of the Syriac Church, or even by a few of the apostles, or conceivably even ‘en route’ from Athens to Besancon.  I think it doubtful that the De Charnay family would have considered that Dead Sea earthenware jars would be a suitable method of storage, as they had other means available.  I wonder what Charles Freeman’s explanation for them might be and how he would reconcile them with a 14th century painted provenance?\n\n","date":"November 26, 2014 at 3:58 pm","url":"https://shroudstory.com/2014/11/25/environmental-study-of-the-shroud-in-jerusalem-videos/","cat":"video","id":"comment-173161","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Environmental Study of the Shroud in Jerusalem Videos","post":"One has to marvel too at the flexi-paint pigments that were available in ancient times, ones that allowed the TS to be repeatedly folded up for storage after each display!\nThe mere fact that the TS could be treated (abused?) in this fashion should surely be conveying a message to those who study surviving centuries-old images. That would include historians who specialize in allegedly “painted” religious relics…\n\n","date":"November 27, 2014 at 2:52 am","url":"https://shroudstory.com/2014/11/25/environmental-study-of-the-shroud-in-jerusalem-videos/","cat":"video","id":"comment-173240","author":"Colin Berry","site":"shroudstory"},{"title":"Environmental Study of the Shroud in Jerusalem Videos","post":"Image you owned a life-size photo of someone you respected, say a sporting, musical or political icon, printed on thickish cloth. Nothing miraculous, just a photo, just a single image, just a cloth. How would you store it? Rolled up? Folded across the waist, chest? Folded lengthways bisecting the face and then across the waist? Folded lengthways twice and then zig-zagged into squares? Would the position of the image make a dfference? If it were mine, only the first two would make a lot of sense; one, as the Shroud was in fact kept for most of the last two centuries, and the other, as the Shroud is purported to have been kept while maquerading as the Mandylion of Odessa. Even if it had to be crammed into a smallish silver box, I would treat the image of the face with particular care – maybe fold the sides in first and then roll it up. Wouldn’t you? And if, rather than a nice picture of Abraham Lincoln giving a speech, you knew it was a miraculous image of the face of God, wouldn’t that make you think all the more carefully? Strange…\n\n","date":"November 27, 2014 at 3:27 am","url":"https://shroudstory.com/2014/11/25/environmental-study-of-the-shroud-in-jerusalem-videos/","cat":"video","id":"comment-173248","author":"Hugh Farey","site":"shroudstory"},{"title":"Environmental Study of the Shroud in Jerusalem Videos","post":"It’s not only the watermarks that point to a history of the TS having been stored folded. So too do the L-shaped poker holes. Their symmetry implies a lengthwise fold down the centre line of the face! \nSome might think it’s an exceptional image that allows such cavalier treatment. Some pigments, some painting (to paraphrase Winston Churchill) !\n\n","date":"November 27, 2014 at 3:40 am","url":"https://shroudstory.com/2014/11/25/environmental-study-of-the-shroud-in-jerusalem-videos/","cat":"video","id":"comment-173251","author":"Colin Berry","site":"shroudstory"},{"title":"Environmental Study of the Shroud in Jerusalem Videos","post":"If the cloth was on its way for sale in Jerusalem, then you’d be concerned about conserving its sale value and you wouldn’t be folding it into 52 squares with 1 foot sides.  There are more convenient ways of camel transport than putting your wares into an earthenware jar.  And I don’t think Othon sent it to Besancon that way either.  Margaret de Charnay used a donkey to transport it across the hills to the Savoy castle, and held her precious relic in such high regard, that she’d be careful about such matters as folding.  They wouldn’t be storing it that way in the imperial collection at Constantinople either.  The solution that cries out as the most likely explanation, is that it was stored that way, perhaps hurriedly, to conceal and hide it from those who would pillage it, somewhere in the Middle East, perhaps by a custodian monk in Antioch, or even perhaps by a few of the apostles in a time of persecution.  I see it as adding one more piece in the jigsaw supporting the authenticity argument.\n\n","date":"November 27, 2014 at 4:10 am","url":"https://shroudstory.com/2014/11/25/environmental-study-of-the-shroud-in-jerusalem-videos/","cat":"video","id":"comment-173258","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Environmental Study of the Shroud in Jerusalem Videos","post":"Outside of the fact that I don’t accept Colin Berry’s latest non-authenticity theory, I do believe he is making interesting, provocative,  and at times,  constructive comments. Particularly when I agree with him.\nWith the exception of Charles Freeman how many other skeptics still bang the drum for a painting?\n\n","date":"November 27, 2014 at 6:33 am","url":"https://shroudstory.com/2014/11/25/environmental-study-of-the-shroud-in-jerusalem-videos/","cat":"video","id":"comment-173281","author":"John Klotz","site":"shroudstory"}]
