[{"id":"comment-96274","author":"don","post":"You know, I’m just a regular guy here. As I sit here looking at the portrait of Jesus (a negative image of just the face I purchased 10 12 years ago from Barrie Schwortz with the caption that read “Contemporary Insights To An Ancient Paradox”), the image’s so vivid, real, anatomically accurate. Everything I see of the image is perfect, Its a photographic snapshot of a scourged, beaten body. I can’t believe some of you are hanging on to ‘scorch theory’. Its ridiculous. If you look at the image long enough, you would be shaking your head thinking “no way its a scorch because its too REAL! ..","date":"2014-04-03","mins":"7:49 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","title":"Am I the only one?"},{"id":"comment-203953","author":"don","post":"Question would flour have been detected on the shroud? I know that Colin’s flour imprint theory would not hold water because there are too many other questions he would need to answer especially the blood..","date":"2015-06-28","mins":"7:59 am","url":"https://shroudstory.com/2015/06/28/extreme-blogging/","cat":"other_blogs","title":"Extreme Blogging"},{"id":"comment-171283","author":"don","post":"Eventually we will know if the carbon dating was flawed or not (I believe it is flawed) because it was done by man but we will not know how the image was created because it was done by God. John 9:5 ‘As long as I am in the world, I am the light of the world.’ The image was created by supernatural light! Scientist Di Lazarro so far have the best hypothesis..","date":"2014-11-14","mins":"8:26 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","title":"God in his lab"},{"id":"comment-144578","author":"don","post":"Please Colin, I’m begging you, create one exactly like the TS. I’m losing my patience..","date":"2014-08-18","mins":"12:52 pm","url":"https://shroudstory.com/2014/08/18/into-a-world-not-cut-off-from-reality/","cat":"other_blogs","title":"Into a World Not Cut Off from Reality?"},{"id":"comment-153603","author":"don","post":"“simple, uncomplicated man made contact one I favour” Simple? Uncomplicated? C’mon Colin really. Lol.","date":"2014-09-22","mins":"10:12 am","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","title":"Samuel Johnson Meets His Match"}]
