[{"id":"comment-169396","author":"don","post":"I find it hard to believe that most of the paint flaked off the shroud. A shroud thread contain many fibers (I don’t know the approximate number of fibers per thread), there would have been paint residues between fibers. It would have been very difficult to remove the all residues even if you try. If it did flake off, wouldn’t there be damage to the fibers at microscopic level? Like a slight pull from the body of the thread?.","date":"2014-11-06","mins":"8:10 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169299","author":"don","post":"I’m still waiting to see an exact replica of the shroud. What’s taking so long? Come on, with all the technology we have today, should have had the replica by now. But seriously, that’s not going to happen. This blog will be the oldest, longest continuous blog on the internet..","date":"2014-11-06","mins":"12:59 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-208486","author":"don","post":"It will be interesting to see how Colin will add the actual blood, blood image and serum onto the linen..","date":"2015-08-18","mins":"8:54 am","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"id":"comment-170181","author":"don","post":"I mostly read the blog and rarely comment because I’m not a scientist but a postal worker! I’m starting to lose interest in this blog because of this ridiculous painting theory that just goes on and on. Charles is not a scientist, so can we just please move on to something more plausible?.","date":"2014-11-09","mins":"5:43 pm","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-195438","author":"don","post":"Then why did Jesus leave a likeness of Himself on the shroud? I was a non believer until I saw a picture of a photographic negative, my first thought was that’s impossible. After 30 years of following the shroud research, it changed my life completely. I think Jesus left an imprint because he knew there was going to be many Doubting Thomases..","date":"2015-04-05","mins":"3:32 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","title":"Easter Ink"},{"id":"comment-193156","author":"don","post":"Tell me folks, which question will finally get answered during future shroud research? 1988 Carbon dating? Or how image was formed? Of course, the carbon dating! It was done by man. Humans makes mistakes. There will be another STURP like research project down the road. Vatican will give in to pressure from researchers/scientists from around the world..","date":"2015-03-11","mins":"7:40 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"id":"comment-197489","author":"don","post":"Proven as a fake?? Couldn’t careless about Joe Nickel. He’s not even a scientist. Just another Charles Freeman with no background in science..","date":"2015-04-25","mins":"5:34 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-199120","author":"don","post":"The first nineteen hundred years, the positive image didn’t look too great not to be a work of art. After Secundo Pia photograph, suddenly its too great to be a work of art!.","date":"2015-05-14","mins":"4:19 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","title":"Too Great to Be a Work of Art"},{"id":"comment-199121","author":"don","post":"Typo positive image didn’t look too great to be a work of art. Got a little confused there!.","date":"2015-05-14","mins":"4:23 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","title":"Too Great to Be a Work of Art"},{"id":"comment-202689","author":"don","post":"When Jesus was here on Earth 2000 years ago, he performed many miracles raising of Lazarus, turning water into wine, cured the sick and blind, sudden abundance of bread and fish Did these miracles happened naturally? No. I believe the Resurrection was one of his many miracles. The image was not created naturally. Do we know how He turned water into wine? Do we know how He raised Lazarus from the dead? No, we don’t know. I don’t think we’re ever going to know how the image was formed either. Its a miracle!.","date":"2015-06-18","mins":"5:32 pm","url":"https://shroudstory.com/2015/06/17/the-shroud-on-nbcs-today-show/","cat":"television","title":"The Shroud on NBC’s Today Show"}]
