[{"id":"comment-60257","author":"david_rolfe","post":"You have to remember when viewing banding that – as far as I am aware – the backlit images are taken with the backing cloth in place and it is difficult to determine what is Shroud and what is not..","date":"2013-12-16","mins":"9:06 am","url":"https://shroudstory.com/2013/12/15/disappearing-shaded-bands/","cat":"carbon_14_dating","title":"Disappearing Shaded Bands"},{"id":"comment-6536","author":"david_rolfe","post":"We should be wary of any slur on Christopher Ramey’s position on the Shroud. He showed himself to be completely openminded in taking on the lab work involved in checking out the carbon monoxide hypothesis. His position is made clear in the extended interview at http://www.shroud enigma.com/c14/turin shroud carbon dating test.html I have no doubt that if anything “material” should come to light he would be the first to recognize it. The fact is, it is the Shroud’s custodians and those who have had unrestricted access to the cloth who have stated categorically that there is no contaminant present in the sample area..","date":"2012-01-04","mins":"9:57 am","url":"https://shroudstory.com/2012/01/04/what-did-christopher-ramsey-know/","cat":"carbon_14_dating","title":"What did Christopher Ramsey Know"},{"id":"comment-6543","author":"david_rolfe","post":"Dan, I welcome the clarification. Personally, I find the “Ambergate” document intriguing and potentially very damaging. It demonstrates the rather haphazard approach to the testing that I am sure the labs would normally want to distance themselves from. It would appear there was no documentation of this particular episode which suggests, at the very least, a lack of professionalism. I am not certain what it is we disagree on. I remain open minded about the reweave theory. What we all have to live with is the fact that the one person who should know, Ms Flury Lemburg, refuses to countenance it. Professor Ramsey can hardly be expected to contradict the only person who has had the opportunity to examine the shroud as a textile at close quarters..","date":"2012-01-04","mins":"11:37 am","url":"https://shroudstory.com/2012/01/04/what-did-christopher-ramsey-know/","cat":"carbon_14_dating","title":"What did Christopher Ramsey Know"}]
