[{"id":"comment-16586","author":"david_rolfe","post":"I make no apology for having an agenda. It is to try and get to the bottom of as much of the mystery of the Shroud as it is humanly possible to get. Proponents of the Maillard reaction as an explanation for the image have, so far, as far as I can see, done nothing experimental to substantiate it. The proposal for an experiment as set out by Denis Mannix is designed to get the ball rolling towards some kind of methodology. IT IS AN OPENING SUGGESTION!!! Read the source carefully and not just Dan’s filleted version and that will be obvious as he should have pointed out before publishing this coy, stirring “A Reader Writes”.. Piece. The tendency for the supporters of Maillard to bleat about it rather than substantiate it tells you a lot about its viability. Just show me a meaningful image of anything created in this way and I will have a lot more respect for the idea. Meanwhile, join in the discussion of how best to test the idea or abandon it..","date":"2012-09-20","mins":"10:32 am","url":"https://shroudstory.com/2012/09/20/agenda-driven-shroud-science-what-a-pity/","cat":"image_theory","title":"Agenda Driven Shroud Science?  What a pity."},{"id":"comment-183465","author":"david_rolfe","post":"It is very easy to make a negative image both now and at anytime in history. All you need to do is create a positive image, preferably monochrome, but not essentially. You then place it on a frame with a plain backing and hang it somewhere where it catches the sun. Over time, and depending on just how much light it is exposed to, a perfect negative of the original will be created on the backing. I have seen a very impressive example made by an etching hanging in a Cotswold cottage south facing hallway for several years. When the engraving was sent for reframing the backing parchment had become a negative as perfect as anything Mr. Eastman at Kodak could have created. Not least, because it was a contact image and no lens was required..","date":"2015-01-15","mins":"5:57 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-3789","author":"david_rolfe","post":"Yes. If anyone would like to take advantage of this offer please email me at info@performancefilms.co.uk. David.","date":"2011-09-05","mins":"7:11 am","url":"https://shroudstory.com/2011/09/05/more-about-blu-ray-disk-with-hd-images-of-the-shroud-of-turin-available/","cat":"news_&_views","title":"More About Blu-Ray Disk with HD Images of the Shroud of Turin Available"}]
