[{"title":"Some Questions About Mark Antonacci’s Petition","post":"But you have to hand it to him: Mark Antonacci’s neutron-bombardment  C-14 generating thesis is devilishly clever, as is his diagnostic-testing proposals via isotope scanning, especially as he’s a lawyer, not a nuclear physicist.\nIf I ever found myself accused of a crime I had not committed, one that hung on forensic evidence, I’d pay Mark $1000 an hour to represent me. If it were for a crime I had committed, I’d pay him $5000 per hour.  ;-)\n\n","date":"November 7, 2013 at 11:26 am","url":"https://shroudstory.com/2013/11/07/some-questions-about-mark-antonaccis-petition/","cat":"news_&_views","id":"comment-50308","author":"colinsberry","site":"shroudstory"},{"title":"Some Questions About Mark Antonacci’s Petition","post":"Dan, the petition has always described the testing as minimally invasive (except for a one day typo).  Other statements such as press releases may use similar, but not always identical language such as minimally invasive or non-invasive.  The only changes made to the petition were a) to identify the pope by name after a successor to Pope Benedict XVI was named, and b) to ask Pope Francis to include the tests and experiments that I have described extensively on the web site and elsewhere in any future testing.\nMark Antonacci\nP.S. Colinsberry, thanks for the “compliment.”  (I’ll be looking for a check soon.)  Thanks also for an initial look at the scientific merits behind the testing.\n\n","date":"November 7, 2013 at 3:54 pm","url":"https://shroudstory.com/2013/11/07/some-questions-about-mark-antonaccis-petition/","cat":"news_&_views","id":"comment-50334","author":"Mark Antonacci","site":"shroudstory"},{"title":"Some Questions About Mark Antonacci’s Petition","post":"Mark, thanks for the clarification.\n\n","date":"November 7, 2013 at 4:06 pm","url":"https://shroudstory.com/2013/11/07/some-questions-about-mark-antonaccis-petition/","cat":"news_&_views","id":"comment-50335","author":"Dan","site":"shroudstory"}]
