[{"id":"comment-101270","author":"dr_tibor_szarvas","post":"Once again on radiocarbon dating of the Shroud Wrong radiocarbon dating of the Shroud in the consequence of biological isotopfractionation It is well known that the cellulose molecules of the linen can change seriously, particularly after a long time. The following chemical processes are responsible for these changes: 1) Oxidation 2) Depolimerisation 3) Substitution of hydroxyl radicals with organic or inorganic radicals 4) Hydrolysis 5) Replacement of alcoholic hydrogen 6) Graft addition reaction with free radical sites, generated via various free radical reaction initiators 7) Base exchange reactions. Fundamental glucose units liberates from the cellulose macromolecules (depolimerisation) 8) Addition reaction with free radicals (effect of UV radiation) These chemical reactions can proceed in the presence of bacteria and fungi, which were clearly identified on the Shroud. A thick komplexum of Lichenotelia, which consists of bacteria and fungi was verified by Leoncio Garza Valdes on the Shroud. The aldehyde and carboxyl groups produced in the above mentioned reactions resulted in a stable bond of fresh 14 C on the Shroud (e.g. Chambery fire in 1532). The exchange reactions of different – COOH and – CHO groups containing organic molecules with 14 CO2 support the probability of this phenomenon. Nevertheless, these fresh impurities were not more than 1 % which could not removed by the 3 laboratories in the cleaning process before the AMS measurements. There is a further significant factor. It was verified that the end product of decomposition reaction caused by microorganism (bacteria, fungi) is glucose. They produce CO2 and H20 during their glucose metabolism. Taking into account the isotopic effect in the splitting of 14 C – 12 C bond, the microorganisms could build 12 C from cellulose (glucose) of the Shroud into their organism as energy substrate to a higher degree than 14 C. 12 C was then metabolised and emitted as 12 CO2 in higher amount than 14 CO2. It is also known, that the discrimination against 14 C in biological systems can achieve more than 15 %. Many scientific publications supported this phenomenon. This isotopfractionation could cause a relative increase of the 14 C in the Shroud during the centuries resulting in the change of isotope ratio and the “rejuvenation” of the Shroud. This enrichment could not be affected by any of the cleaning procedures applied. Although the 3 laboratories (Zürich, Oxford, Arizona) carried out precise measurements, there was no chance to accomplish the radiocarbon dating of the Shroud correctly due to the effects discussed above. Calculations Theoretical 14 C/12 C ratio in 1988. Presumed isotopfractionations (linen was produced 1 year befor Christ’s death) 11 %, 12 %, 13 % 0.7885 Calculated 14 C/12 C ratio owing to isotopfractionation 0.8752, 0.8831, 0.8910 Normalised ratio for inorganic world (Stuivert Pollack) 0.9154, 0,9184, 0.9266 Radiocarbon age Calendar age 728, 700, 666 1260,1288,1322 Results of the 3 laboratories Zürich : pooled radiocarbon age : 676, calendar age :1312 Oxford : pooled radiocarbon age : 689, calendar age : 1299 Arisona :pooled, radiocarbon age : 642, calendar age : 1346 It is highly probable, that the 3 laboratories measured like 14 C/12 C ratio owing to mentioned and presumed microbiological isotopfractionation. Consequently, the real age of the Shroud cannot be exactly determined when we ignore this phenomenon. It is well known that normalization of the measured values of – d 13 C is necessary because there is a differences between the concentration of 13 C and 14 C in the inorganic world (atmosphere) and biological world (living matter). The relationship is: d14 C/(2x d13)/%. It is important, that the value of d13 C assumed to be constant. Recent 13 C measurements in plants indicate that the concentration in 14 C is not constant as it was assumed in Libby’s time. Conclusions There is a possibility to measure of this isotopfractionation factor on the Shroud.First : it would be necessary to identify microscopically the real thickness of the bacteria and fungi colony. Second : collect more microbiological samples from the Shroud particularly in the neighbouring of the location of the previous sampling for the correct determination of the main factor: microbiological isotopfractionation. The microbiological sampling would be not at all harmful for the Shroud. 14 C radioisotope labeled glucoses can be use for the determination of isotopfractionation..","date":"2014-04-19","mins":"11:03 am","url":"https://shroudstory.com/2014/04/10/ray-schneider-why-is-the-carbon-dating-wrong-i-dont-know-that-it-is-wrong-i-am-quite-certain/","cat":"carbon_14_dating","title":"Ray Schneider: Why is the carbon dating wrong? I don’t know. That it is wrong I am quite certain . . ."}]
