[{"id":"comment-25870","author":"paul","post":"Assume the shroud is the burial cloth of Jesus then it is the object that was in physical contact with the body of Jesus at the instant of ressurrection. The question then becomes would this intimate physical object be affected by this unique event; taking into account the unique image on the shroud I would say it is a witness to the ressurection..","date":"2013-02-27","mins":"10:41 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral"},{"id":"comment-27040","author":"paul","post":"Yannick Clément : Quote: “One of the reasons I have for believing is that there is no explanation for how the image got on the Holy Shroud.” My answer: Ray Rogers and some other true scientists have proposed some interesting explanations over the years that can well be very close to the truth regarding the image on the Shroud and these explanations (Maillard reaction, Volckringer pattern, etc.) are completely resting on natural mechanisms. Of course, since these hypotheses are very complex and hard to reproduce in a lab, we still got no confirmation yet that one of these can really be apply to the Shroud, but nevertheless, in the present state of our knowledge, no one can really discard them, except THOSE WHO DESPERATELY WANT TO USE THE SHROUD TO PHYSICALLY PROVE THE RESURRECTION (i.e. To back up their religiously biased ideology)… Question: What would happen to your faith in the Resurrection if a 100% natural hypothesis for image formation would be proven right in the future??? Personally, I can say that since my faith has grown and is getting a little bit stronger and stronger over the years, my need to rely on the Shroud as some kind of insurance have constantly decrease. I think that if this continue that way (I sure hope so!), then I won’t need the Shroud for my faith no more before the end of my time on Earth. I hope that one day, this relic will only be an helpful tool for me in my meditation about the Passion and death of Christ and nothing else… In sum, the more I advance in my life and in my faith, the more I tend to focus on the Shroud man instead of focusing on his burial cloth. Sure I still love to exchange on that passionate subject, but the more my faith is growing strong, the more the Shroud is becoming secondary. I hope it is the same for all of you! As Christians, we should not “venerate” or focusing too much on Jesus burial Shroud but much more on the God man who came on Earth to show us the real face of love and mercy of the Father! A face of course that we can see on the Shroud (with the eyes of faith). Forget how the image was made the question is how did the body get out of the shroud without the cloth being unwrapped.","date":"2013-03-10","mins":"9:38 pm","url":"https://shroudstory.com/2013/03/08/pope-benedict-says-shroud-of-turin-authentic-burial-robe-of-jesus-it-doesnt-matter-what-science-says-about-its-authenticity/","cat":"event","title":"Pope Benedict says Shroud of Turin authentic burial robe of Jesus & it doesn’t matter what science says about its authenticity"}]
