[{"id":"comment-211700","author":"paul","post":"Just to throw something out,not that I understand the technical aspects of this post but at one point in my life I took a severe whack on the forehead by a cement side walk and had egg shaped bump that was a good one inch high.Could this cause the discontinuity next to the blood stain on the forehead?.","date":"2015-10-03","mins":"9:19 am","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-15964","author":"paul","post":"Think of a gymnest doing an iron cross on the still rings as he slowly lowers his body to a hanging straight down position, the rings will come from an extended position to shoulder width at the hanging postion. On a cross with the arms nailed where there is no GIVE of the arms against the nails the arms have to stretch to have any slouching of the body. The amount of lenghtening of the arms is in direct proportion to the degree of slouching of the body. Remember the shortest distance between 2 points is a straight line (between the 2 nails) any degree of slouching will cause the distance to increase. Since the nails can not move the arms must get longer no if ands and buts..","date":"2012-09-06","mins":"10:42 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","title":"A different approach to what some see as problems with the image on the Shroud of Turin"},{"id":"comment-15908","author":"paul","post":"Here is a comment i made before that might answere some questions .the mechanics of a crucifixation. Relying on a statics class from a long time ago here are some thoughts on the forces in play on the body of crucified man.To put maximum pain on the body the arms need to be nailed straight out with no slack at all and where the nails have no give towards the end of the hand. . I am sure the Romans were aware of this since they were experts in pain. Assume the body weighs 160 lbs a fbd (free body diagram) of the forces on the nail in the wrist at an angle 15 degrees with the crossbeam and the arms caused when the body slouches would be 80 lbs straight down and a force pulled by the arm of 309 lbs which equals 80 lbs divided by the sine of 15 degrees or .2588. So each arm is feeling a pull of 309 lbs, also assuming a 72 inch arm span each arm would be stretched 1.22 inches which equals 1minus the cosine of15 degrees times 36 inches assuming no stretch in the shoulders but all in the arms. Note as the body slouches more, the force pulling on the arms decreases but the stretching has to increase. This may explain why some people have commented that the arms seem too long; for normal arms are not long enough to cover the genitals which I seemed to have read somewhere.","date":"2012-09-05","mins":"8:46 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","title":"A different approach to what some see as problems with the image on the Shroud of Turin"},{"id":"comment-8755","author":"paul","post":"Man has not been able to create life; so evolution is used as an answer of starting life over a very long period of time that no scientist can replicate becase of the long time procees.. The shroud is said to be a fake that was created over a short period of time by a middle ages man with little scientifiic knowledge; but no scientist has fully replicated it in over the past 100 years which is longer than the productive lifespan of any human being. What am I missing.","date":"2012-02-26","mins":"11:44 am","url":"https://shroudstory.com/2012/02/25/bertrand-russell-comes-to-mind/","cat":"image_theory","title":"Bertrand Russell comes to mind"},{"id":"comment-207720","author":"paul","post":"All I can say is must have been truckloads of linen cloths available in the 13th century..","date":"2015-08-07","mins":"8:38 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-207800","author":"paul","post":"I am saying with all the ways that have been tried to replicate the shroud that have not suceeded has required a lot of material so apparanly it would have been required by the original forger. Then my next question is why would the forger been satisfied with such a terrible representation of a human body?.","date":"2015-08-09","mins":"9:02 am","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-207819","author":"paul","post":"Does the shroud look like a human body as on the order of Michelangelo’s David ?.","date":"2015-08-09","mins":"5:54 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-207824","author":"paul","post":"Louis that is why I believe the shroud is not the work of a forger.","date":"2015-08-09","mins":"7:09 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-16492","author":"paul","post":"A mess.","date":"2012-09-18","mins":"9:24 pm","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","title":"Latest on David Rolfe’s Site on Maillard Reaction"},{"id":"comment-23279","author":"paul","post":"Is there a possibilty that something was made “naturally “that can not be made now or has not been made by any known human in the history of mankind.","date":"2013-02-02","mins":"11:02 pm","url":"https://shroudstory.com/2013/01/31/how-could-a-medieval-mind-create-an-image-such-as-the-one-on-the-shroud/","cat":"uncategorized","title":"How could a medieval mind create an image such as the one on the shroud?"},{"id":"comment-33905","author":"paul","post":"The only way that you would have a similar image as on the shroud is if the pig rose from the dead.","date":"2013-05-17","mins":"5:55 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"},{"id":"comment-183656","author":"paul","post":"I would believe that a space alien made the shroud before believing that a positive painting decayed into a negative image..","date":"2015-01-16","mins":"1:07 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-23128","author":"paul","post":"We could duplicate any cathedral today with our technology. We can not duplicate the shroud enough said..","date":"2013-01-31","mins":"10:42 pm","url":"https://shroudstory.com/2013/01/31/how-could-a-medieval-mind-create-an-image-such-as-the-one-on-the-shroud/","cat":"uncategorized","title":"How could a medieval mind create an image such as the one on the shroud?"},{"id":"comment-92029","author":"paul","post":"There is no image on the shroud and there was not one until it was photographed. No person would have made the shroud in the 13 th. Century and expected it to be accepted as from the death of Christ. It would be like Leonardo painting the Mona Lisa in the same manner and presenting it and expecting payment from whomever commissioned it. To me this shows that the shroud had a continuous verifiable history from the time of Christ that was accepted by everyone who had possession of it starting from the beginning. Just my opinion..","date":"2014-03-22","mins":"5:32 pm","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","title":"So then, why is there an image?"},{"id":"comment-23193","author":"paul","post":"Why not take a rat and scourge it then kill it and wrap it in linen and see what image you get in three days. You could give the rat a pain killer to ease your concerns. I will lay a million to one odds that you would use up all the rats in new york city and get nothing but a mess on the cloth..","date":"2013-02-01","mins":"8:13 pm","url":"https://shroudstory.com/2013/01/31/how-could-a-medieval-mind-create-an-image-such-as-the-one-on-the-shroud/","cat":"uncategorized","title":"How could a medieval mind create an image such as the one on the shroud?"},{"id":"comment-92106","author":"paul","post":"Well to be specific and blunt it is a crappy image of a human being in its natural state. All the images that were on engravings and paintings look nothing like the shroud only their unreal idea of the shroud. It is like at a blue print, and a very bad one, and saying its a finished picture of a building..","date":"2014-03-22","mins":"9:48 pm","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","title":"So then, why is there an image?"},{"id":"comment-132303","author":"paul","post":"The church is in the faith business which needs a place and structure that presents and converts and reinforces that faith on a ongoing basis. That is why the church is not interested in proving genuineness of the shroud..","date":"2014-06-22","mins":"11:37 am","url":"https://shroudstory.com/2014/06/22/until-man-can-explain-how-the-image-got-on-the-shroud-using-his-own-technology-he-really-wont-believe-it-wasnt-his-technology/","cat":"news_&_views","title":"Until man can explain how the image got on the Shroud using his own technology, he really won’t believe it wasn’t his technology."}]
