[{"id":"comment-39848","author":"paul","post":"Here is a very good website on NDE http://www.nderf.org/.","date":"2013-07-27","mins":"8:57 am","url":"https://shroudstory.com/2013/07/23/a-point-now-where-science-and-religion-are-in-fact-treading-on-the-same-ground/","cat":"news_&_views","title":"A point now where science and religion are in fact treading on the same ground"},{"id":"comment-39682","author":"paul","post":"To get another perspective read about near death experiences.","date":"2013-07-24","mins":"9:30 pm","url":"https://shroudstory.com/2013/07/23/a-point-now-where-science-and-religion-are-in-fact-treading-on-the-same-ground/","cat":"news_&_views","title":"A point now where science and religion are in fact treading on the same ground"},{"id":"comment-1223","author":"paul","post":"Thank you for that Ayaz it is really funny. Assuming that you are not from the Indian tourist board the only other conclusion is serious delusion..","date":"2010-04-02","mins":"3:40 pm","url":"https://shroudstory.com/2008/08/20/dates-for-2010-exhibition-of-the-shroud-of-turin/","cat":"2010","title":"Dates for 2010 Exhibition of the Shroud of Turin"},{"id":"comment-14150","author":"paul","post":"If an object can not be reproduced in over a 500 year period was it ever made.","date":"2012-07-24","mins":"12:42 am","url":"https://shroudstory.com/2012/07/23/argumentum-ad-ignorantiam-mea-natibus/","cat":"news_&_views","title":"Argumentum ad Ignorantiam, mea natibus"},{"id":"comment-56873","author":"paul","post":"I have a question for anybody who can answer. How were bodies taken down from the cross? Did Roman nails grip with such force that a tool such as a crowbar was needed to pry the nails out? Did they have such tools ? It seems to me that using such a tool would mangle the flesh of the hands and feet to an extent that it would be visible to the eye. Does any thing on the shroud show this? If not why not?.","date":"2013-12-05","mins":"11:10 pm","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes"},{"id":"comment-2967","author":"paul","post":"I watched this last night. It was horrible and pointless. Nothing was said about what Jesus did during those 40 days that was not already known from the gospel accounts..","date":"2011-04-21","mins":"11:05 am","url":"https://shroudstory.com/2011/04/21/jesus-the-lost-40-days-at-amazon/","cat":"news_&_views","title":"Jesus – The Lost 40 Days at Amazon"},{"id":"comment-20490","author":"paul","post":"You don’t need 50 IQ points to see what is depicted on the shroud and 500 IQ points will not explain nor duplicate the shroud.","date":"2012-12-15","mins":"10:18 pm","url":"https://shroudstory.com/2012/12/13/livescience-goofs-again/","cat":"uncategorized","title":"LiveScience Goofs Again"},{"id":"comment-26477","author":"paul","post":"The sex crimes scandel and hush money pay off shows that the primary goal of any bureaucracy is self preservation above all else. This applies to any organization religious or otherwise. Religion is manmade christianity is not..","date":"2013-03-05","mins":"12:25 am","url":"https://shroudstory.com/2013/03/03/lisa-miller-on-american-catholics/","cat":"news_&_views","title":"Lisa Miller on American Catholics"},{"id":"comment-57807","author":"paul","post":"Reproduce it now using anything; might have to wait another 2000 years.","date":"2013-12-10","mins":"10:44 pm","url":"https://shroudstory.com/2013/12/10/maybe-vermeer-made-the-shroud-of-turin/","cat":"humor","title":"Maybe Vermeer Made the Shroud of Turin"},{"id":"comment-204200","author":"paul","post":"Just remember the primary objective of any bureaucracy and I mean all of them is self preservation. They are composed of humans..","date":"2015-06-30","mins":"7:53 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"id":"comment-44370","author":"paul","post":"Question why was the stone rolled back from the tomb of Jesus. Answer the physical body of Jesus was resurrected in its physical form and for the body to leaves the tomb the stone needed to be moved. Maybe there was no great burst of energy or radiation or any visible event that could be detected at the instant of resurrection but just the movement of the body coming back to life..","date":"2013-09-15","mins":"11:40 pm","url":"https://shroudstory.com/2013/09/15/more-scientific-research-on-the-shroud-of-turin-why/","cat":"uncategorized","title":"More scientific research on the Shroud of Turin? Why?"},{"id":"comment-214683","author":"paul","post":"If you pay the tax you don’t die if you are a Christian or Jew according to the Koran.","date":"2015-11-16","mins":"4:32 pm","url":"https://shroudstory.com/2015/11/14/paris/","cat":"news_&_views","title":"Paris"},{"id":"comment-173396","author":"paul","post":"Correction If our eyes had the ability to see in the third line.","date":"2014-11-27","mins":"11:16 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173395","author":"paul","post":"I believe the 2nd law of thermodynamics proves that the shroud has always been a negative image. The law states entropy in a system always goes from order (low entropy) to disorder (higher entropy). If our eyes had the to see in the negative then at the time the shroud was made it would have been a realistic image of a human body either 700 or 2000 years ago.The image would be at least clear or probably clearer than it is now as the entropy of the image would have been lower than now thus the order higher. As time passes and as entropy increases the disorder of the image would increase and the image would become less clear to our negative capable eyes. We need to understand that the shroud actually is a negative image with all information intrinsic in itself (low entropy) at the time of formation(order) of the image. As time passes the image entropy will increase thus disorder increases causing a loss of information and a less clear negative image. Entropy can never decrease over time. Consider racked balls on a pool table; they are at low entropy(ordered) then they are hit by cue ball and scattered entropy increases (disordered) They then will not ever roll back to their racked positions at the end of their motion back to original entropy (ordered state). It is not a matter of probabilities it is impossible. In the case of a painting it is also impossible because looking at a painting with our negative capable eyes we will see a very blurry not realistic human form (high entropy)disorder. Over time as paint flakes off our negative capable eyes will see a human form coming into shape becoming more realistic( entropy decreasing)order increasing.This is a violation of the 2nd law of thermodynamics.As a matter of fact the final entropy of the image that our negative capable eyes would see has a lower entropy than the original image our negative capable eyes would see..","date":"2014-11-27","mins":"11:13 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-95481","author":"paul","post":"Modern man can not duplicate the 1 percent (?) negative image that we can see. The real positive hidden image was only revealed when photographed. This is a miracle in itself..","date":"2014-04-01","mins":"8:37 am","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","title":"The Shroud that Defies Scientific Explanation (Part 2)"},{"id":"comment-2968","author":"paul","post":"Horrible Documentary that revealed nothing at all about Jesus during the 40 days in question that was not already known from the Gospel accounts. Completely pointless show, that continued to be pointless for 2 hours. Utter waste of time..","date":"2011-04-21","mins":"11:10 am","url":"https://shroudstory.com/2011/04/21/twitter-traffic-about-the-lost-40-days/","cat":"news_&_views","title":"Twitter Traffic About the Lost 40 Days"}]
