[{"id":"comment-170120","author":"paul","post":"If you took a photograph of the rubbing would the negative of the photograph look like the original coin but do the rubbing without any coin.","date":"2014-11-09","mins":"11:12 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-208376","author":"paul","post":"My question is why would a forger make such a unreal looking Christ?.","date":"2015-08-16","mins":"1:24 pm","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"id":"comment-170122","author":"paul","post":"So if a took a photo of the faded photo than that negative would look like the unfaded original photo.","date":"2014-11-09","mins":"11:16 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-170098","author":"paul","post":"What are the odds that a13th century person made a completely NEGATIVE image of back and front human crucified body that is photographic quality before photography was invented versus a relic surviving from the first century that shows a crucified man very blurry but when run through newly discovered technology 1900 years latter yields a image that was not apparent to human senses. I am no expert in statistics but would guess it’s billions to one. I would say this would make the 13 century fabricated object more spectacular than one surviving from the first century made by natural? means..","date":"2014-11-09","mins":"10:00 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-170164","author":"paul","post":"Can anybody post negative pictures of any painting that clearer than the original painting.","date":"2014-11-09","mins":"3:11 pm","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-170115","author":"paul","post":"Negative image is not a problem only if you don”t have to reproduce it.","date":"2014-11-09","mins":"10:42 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-210237","author":"paul","post":"I was reading an article about how life was formed from the elements on earth that came from stars but no scientist can explain how the spark of life originated from these elements. This reminded me of the shroud in that we can list all the elements of the shroud but can not explain how the elements came together to explain its existence..","date":"2015-09-12","mins":"9:41 pm","url":"https://shroudstory.com/2015/09/12/new-angle-on-the-supernatural/","cat":"article","title":"New Angle on the Supernatural?"},{"id":"comment-170119","author":"paul","post":"If you took a photograph of the rubbing would the negative of the photograph look like the original coin but do the rubbing with any coin.","date":"2014-11-09","mins":"11:09 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-197108","author":"paul","post":"Educate yourself about the teachings of Islam. One which is that lying to spread Islam is appropriate..","date":"2015-04-21","mins":"8:44 pm","url":"https://shroudstory.com/2015/04/21/the-imams-who-came-to-see-the-shroud/","cat":"press_coverage","title":"The Imams Who Came to See the Shroud"},{"id":"comment-172714","author":"paul","post":"Models are not all encompassing such as global warming models that have failed to predict the no change in global temp. For the last 18 years even though carbon dioxide has been increasing each year..","date":"2014-11-23","mins":"5:04 pm","url":"https://shroudstory.com/2014/11/17/quote-for-today-historical-criteria-do-not-fall-from-the-sky/","cat":"article","title":"Quote for Today:  Historical criteria do not fall from the sky"},{"id":"comment-209502","author":"paul","post":"This is the first book I read on the shroud in in 1982..","date":"2015-09-02","mins":"6:21 pm","url":"https://shroudstory.com/2015/09/02/ian-wilsons-1978-book-for-a-penny/","cat":"books","title":"Ian Wilson’s 1978 Book for a Penny"},{"id":"comment-20669","author":"paul","post":"I know of no one that says the body was unwrapped or started decomposing as shown by blood stain non smears so how did the body come out of the shroud before decomposition and not be unwrapped.","date":"2012-12-18","mins":"9:51 pm","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"id":"comment-21099","author":"paul","post":"The shroud is only significant if it shows the resurrection; image plus body was not unwrapped and only in the shroud for less than 3 days.","date":"2012-12-25","mins":"3:32 pm","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"id":"comment-20767","author":"paul","post":"Lets see;1 the odds of making a duplicate of the shroud i would guess a billion to one since no one has done it yet since the shroud has become known to the public. Now consider the cloth wrapped a bloody body but it was taken out before decomposition but not physically disturbed. I would say impossible but put the odds at a billion to one. The combine odds that one piece of cloth went thru these 2 events are 1 billion times 1 billion or1x10to the 19 power which i think is more than the number of atoms making up the earth..","date":"2012-12-20","mins":"12:05 am","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"id":"comment-75296","author":"paul","post":"Does not anybody in the whole wide world want to be famous? all he would have to do is duplicate the shroud and he would also be a hero to all the atheists..","date":"2014-01-30","mins":"11:10 pm","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"id":"comment-11024","author":"paul","post":"I womder if they would sit in a empty room and wait for food to appear from nothing of course i realize they are thinking on a much higher level than me.","date":"2012-04-30","mins":"8:42 pm","url":"https://shroudstory.com/2012/04/30/krauss-i-dont-really-give-a-damn-what-nothing-means-to-philosophers-i-care-about-the-nothing-of-reality/","cat":"books","title":"Krauss:  I don’t really give a damn what \"nothing\" means to philosophers; I care about the \"nothing\" of reality.\""},{"id":"comment-3001","author":"paul","post":"This would be pretty much why the blow by: “Jesus answered and said to them, “Destroy this temple, and in three days I will raise it up.” 20 The Jews therefore said, “It took forty six years to build this temple, and will You raise it up in three days?” 21 But He was speaking of the temple of His body,” (John 2:19 21). “And He said to them, “Why are you troubled, and why do doubts arise in your hearts? 39 “See My hands and My feet, that it is I Myself; touch Me and see, for a spirit does not have flesh and bones as you see that I have.” (Luke 24:38 39). “When therefore it was evening, on that day, the first day of the week, and when the doors were shut where the disciples were, for fear of the Jews, Jesus came and stood in their midst, and said to them, “Peace be with you.” 20 And when He had said this, He showed them both His hands and His side. The disciples therefore rejoiced when they saw the Lord,” (John 20:19 20)..","date":"2011-04-22","mins":"2:59 pm","url":"https://shroudstory.com/2011/04/20/what-really-happened-during-lost-40-days/","cat":"books","title":"What really happened during ‘Lost 40 Days’?"},{"id":"comment-3000","author":"paul","post":"Why would anyone complain? Oh yeah, it’s a horrible documentary!.","date":"2011-04-22","mins":"2:52 pm","url":"https://shroudstory.com/2011/04/22/jesus-the-lost-40-days-in-now-on-youtube-for-how-long/","cat":"video","title":"Jesus, the Lost 40 Days in now on YouTube (for how long?)"},{"id":"comment-2990","author":"paul","post":"Why are you people so excited about this horrible show? A computer generated Jesus doesn’t amount to much, but the rest of the show was even more worthless. It didn’t even have clever speculation..","date":"2011-04-22","mins":"10:08 am","url":"https://shroudstory.com/2011/04/22/jesus-the-lost-40-days-is-now-available-on-itunes/","cat":"news_&_views","title":"History Channel’s Jesus: the Lost 40 Days & The Real Face of Jesus Available on iTunes"},{"id":"comment-2930","author":"paul","post":"This program was written by John Marks, a self proclaimed atheist. There is nothing in any of the documents that the program claims to use which shed light on the 40 days in question. John, along with a college friend produced a obscure movie a few years ago called “Purple State of Mind”, in which John claims you cannot see the real world until you put the Bible down, and stop having your world view seen through it’s pages. In the film, John is shown going to a protestant church in NY, first time ever in his life, for he’s more likely to be found on a Sunday morning at the “church” of Vincent’s BBQ. John, claims he’s happy to go to hell, for there will sure be BBQ! The film is sure to be a mind bender bolstering agnostics. We shall see..","date":"2011-04-18","mins":"1:56 pm","url":"https://shroudstory.com/2011/04/06/updated-jesus-the-lost-40-days-the-history-channel-april-20/","cat":"news_&_views","title":"Updated: “Jesus, the Lost 40 Days” the History Channel April 20"}]
