[{"id":"comment-45084","author":"shroud_encounter","post":"I agree, when looking at the 1516 copy, the poker holes are extremely prominent probably because the image itself is so faint as to create a striking contrast. We see in later copies of the Shroud after 1532, the various artists make a point of painting the burns and patches. So it stands to reason that artistic renderings of the Shroud prior to 1532 would include the poker holes which is why we see it on the HPM and therefore proof of the HPM’s genesis. Those holes are not random..","date":"2013-09-22","mins":"9:49 am","url":"https://shroudstory.com/2013/09/21/so-is-that-the-shroud-of-turin-depicted-in-the-hungarian-pray-codex/","cat":"history","title":"So is that the Shroud of Turin depicted in the Hungarian Pray Codex?"},{"id":"comment-45020","author":"shroud_encounter","post":"Also consider that Jesus is shown with only four fingers and no thumbs as we see on the Shroud. If you look at the other panels of this codex series, all the other cast of characters show their hands with thumbs. Why no thumbs for Jesus? Yet another similarity between the HPM and the Shroud. John is right about the fingerprint analogy. How many points of congruence do we need to have a probable match? I think we already have more than enough..","date":"2013-09-21","mins":"8:32 pm","url":"https://shroudstory.com/2013/09/21/so-is-that-the-shroud-of-turin-depicted-in-the-hungarian-pray-codex/","cat":"history","title":"So is that the Shroud of Turin depicted in the Hungarian Pray Codex?"},{"id":"comment-10149","author":"shroud_encounter","post":"I had an interesting thought regarding the significance and meaning of the Shroud. The scripture says, “You were bought with a price.” That Jesus gave his life as a “ransom.” That we were “purchased”. The Shroud is a the RECEIPT demonstrating the PRICE that was paid, not in dollars but in blood. However the image represents the PROMISE of future glory. So the Shroud reveals both the price paid and the promise of transformation for all who believe. Here is the future promise: But our citizenship is in heaven. And we eagerly await a Savior from there, the Lord Jesus Christ, who, by the power that enables him to bring everything under his control, will transform our lowly bodies so that they will be like his glorious body. Philippians 3:20 21 This is a future event…I hope its soon! Happy Easter!.","date":"2012-04-08","mins":"8:43 am","url":"https://shroudstory.com/2012/04/08/the-lord-is-risen-he-is-risen-indeed/","cat":"history","title":"The Lord Is Risen! He is Risen Indeed!"},{"id":"comment-14324","author":"shroud_encounter","post":"I always thought this story would make a fantastic book. Think Indiana Jones beating the Nazis to the Ark of the Covenant. I read an article that told how Hitler’s storm troopers came to this monastery looking for the Shroud…no doubt after applying some enhanced interrogation techniques on authorities in Turin. The story goes that the Shroud was kept in a special space hidden inside the altar. When the troops arrived, all the monks gathered around the altar to pray. The troops ransacked the monestary but decided not to bother the monks praying around the altar…the exact place where the Shroud was hiding covered by the altar and the prayers of the monks. Somebody please turn this into a book!.","date":"2012-07-30","mins":"9:34 am","url":"https://shroudstory.com/2012/07/30/why-was-the-shroud-hidden-in-a-monastery-during-wwii/","cat":"history","title":"Why was the Shroud hidden in a monastery during WWII?"},{"id":"comment-14341","author":"shroud_encounter","post":"Dave, Thanks for that bit of history and perspective. I found the original articles online but would love to read the entire interview given to Diva e Donna magazine by Rev. Andrea Davide Cardin, the librarian at the Abbey. He was also interviewed by Le Stompa newspaper around that same time. The online articles are all published around April 8, 2010..","date":"2012-07-30","mins":"6:36 pm","url":"https://shroudstory.com/2012/07/30/why-was-the-shroud-hidden-in-a-monastery-during-wwii/","cat":"history","title":"Why was the Shroud hidden in a monastery during WWII?"}]
