[{"id":"comment-11149","author":"shroud_encounter","post":"I agree with you Dan. To not spell out with clarity the superficiality of the image is ludicrous. It is a key attribute of the image. We all know the story of the camel–a horse designed by committee….","date":"2012-05-05","mins":"12:09 pm","url":"https://shroudstory.com/2012/05/05/colin-berry-and-luigi-garlaschelli-may-have-already-won-the-prize-with-different-solutions/","cat":"image_theory","title":"Colin Berry and Luigi Garlaschelli may have already won the prize with different solutions."},{"id":"comment-150927","author":"shroud_encounter","post":"BTW, excellent article Yannick. I just think Maillard reaction alone cannot explain all the attributes of the image..","date":"2014-09-14","mins":"8:48 am","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level"},{"id":"comment-48555","author":"shroud_encounter","post":"Paint…I meant blood. Mc Crone says its vermilion..","date":"2013-10-23","mins":"4:42 pm","url":"https://shroudstory.com/2013/10/23/is-the-shroud-of-turin-a-medieval-photograph/","cat":"image_theory","title":"Is the Shroud of Turin a Medieval Photograph?"},{"id":"comment-10304","author":"shroud_encounter","post":"What baffles me about all these attempts to reverse engineer the shroud image and claim they have found how it was fabricated in the middle ages, is that only historical reference from that era asserting the shroud to be a fake is the D’Arcis Memorandum which claims the shroud was “cleverly painted.” We also know that this document was never sent to the pope and had clear economic and political motives. But the question remains…who was the artist? How did he “paint” the image when there is no visilbe trace of paint or pigment on the shroud? The critics all start with this document but then ignore the fact that it was alleged to be a painting..","date":"2012-04-12","mins":"6:19 am","url":"https://shroudstory.com/2012/04/10/onion-skins-and-dawkins/","cat":"image_theory","title":"Onion skins and Dawkins"}]
