[{"id":"comment-11817","author":"carlos","post":"No puede encontrarse en la iconografía cristiana ni “antecedentes” ni “consecuentes” que muestren, al igual que lo hacen el Códex Pray y la Sábana de Turín, la figura de un Cristo muerto, desnudo, con los brazos cruzados (derecho sobre izquierdo) alcanzando la altura de la región pubiana y cuyas manos no muestren los dedos pulgares. Lo que hace altísimamente probable que el ilustrador del Códex Pray hubiera visto la Sábana Santa o tuviera una muy buena información sobre ella..","date":"2012-06-02","mins":"5:08 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11860","author":"carlos","post":"Se sigue usted CONFUNDIENDO. La obra es de la 15th Century.","date":"2012-06-03","mins":"5:55 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11858","author":"carlos","post":"David, no debe usted sacar mis palabras del contexto del debate, centrado en la posible relación del Codex Pray con la Sábana de Turín. Mi afirmación: “No existe en la iconografía medieval NINGÚN otro ejemplo de Jesús yacente totalmente desnudo.” ……está limitada obviamente por el año 1355 aprox., cuando la Sábana de Turín aparece en Lirey. Es una afirmación totalmente VÁLIDA y usted NO ha podido mostrar ningún ejemplo que la invalide. Sus ejemplos son POSTERIORES a la aparición de la Sábana en Lirey. SÓLO el Codex Pray muestra un Jesús muerto TOTALMENTE desnudo……además de mostrar la posición de brazos y ausencia de pulgares como se muestra en la sábana de Turín..","date":"2012-06-03","mins":"5:29 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11881","author":"carlos","post":"El texto COMPLETO que escribí es: “No puede encontrarse en la iconografía cristiana ni “antecedentes” ni “consecuentes” que muestren, al igual que lo hacen el Códex Pray y la Sábana de Turín, la figura de un Cristo muerto, desnudo, con los brazos cruzados (derecho sobre izquierdo) alcanzando la altura de la región pubiana y cuyas manos no muestren los dedos pulgares. Lo que hace altísimamente probable que el ilustrador del Códex Pray hubiera visto la Sábana Santa o tuviera una muy buena información sobre ella.” Es obvio que: 1. Antecedentes y consecuentes se REFIEREN al Códex Pray, 1192 1195 2. Antecedentes significa ANTES del Codex Pray 3. Consecuentes significa DESPUÉS del Codex Pray HASTA la Sábana de Lirey, 1192 95 a 1355 57 4. ¿O acaso supone que con la palabra CONSECUENTES me refiero hasta el año 2012 ? 5. El “entombment” de la catedral de Lübeck, que usted propone fechándolo erróneamente en el siglo XIV, es de principios del siglo XV, posterior a la Sábana de Lirey y CLARAMENTE inspirado en ella. 6. Usted NO puede proponer ningún ejemplo iconográfico ANTERIOR a la Sábana Santa, de Cristo DESNUDO muerto que no sea el Códex Pray. 7. Usted NO puede proponer ningún ejemplo iconográfico ANTERIOR a la Sábana Santa, de Cristo DESNUDO muerto, con los brazos CRUZADOS sobre el pubis y con las manos que NO muestren los pulgares, que no sea el Códex Pray. 8. Creo que está suficientemente CLARO y que resulta lícito establecer una estrecha relación entre el Códex Pray y la Sábana Santa. 9. La presencia de los 2 grupos de agujeros (holes) hacen ALTÍSIMAMENTE PROBABLE que el ilustrador del Códex Pray hubiera visto la Sábana Santa o tuviera una muy buena información sobre ella. 10. Le agradezco SU INSISTENCIA que permite REFORZAR mis argumentos..","date":"2012-06-04","mins":"5:05 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11844","author":"carlos","post":"El artista del Codex Pray NO intenta copiar la Sábana, probablemente no la ha visto, pero SI tiene alguna información que es RELEVANTE. 1. El cuerpo de Jesús yacente (muerto) está TOTALMENTE DESNUDO. No existe en la iconografía medieval NINGÚN otro ejemplo de Jesús yacente totalmente desnudo. 2. Si a ello le añadimos la posición de los brazos y la ausencia de pulgares ( de los que si hay otros ejemplos en la iconografía) la COHERENCIA con la Sábana de Turín es EVIDENTE. 3. El artista del Codex Pray es un mal dibujante, pero muestra INTENCIONALIDAD en sus dibujos. No existe en la iconografía medieval NINGÚN SARCÓFAGO con ese tipo de decoración TAN ENORMEMENTE cargado, NO tiene ningún parecido con un sarcófago, no tiene parecido con una sábana….. El dibujo tiene una INTENCIÓN de difícil solución artística. La presencia de los 2 grupos de agujeros, “holes”, de gran similitud con los de la Sábana de Turín es DECISORIA para entender que el artista ha querido representarla. El anverso tiene un dibujo lineal que representa el hilado del tejido, el reverso tiene cruces representando el contacto con el cuerpo de Jesús. El artista NO puede mostrar la impronta del CUERPO porque NO tiene solución técnica ¿ representaría el artista la espalda y el culo de Jesús en el lugar de las cruces?. Porque la impronta FRONTAL del cuerpo quedaría en el reverso de la parte que muestra el dibujo lineal del hilado del tejido, NO PUEDE SER VISIBLE. 4. El arcángel, NO pisa la Sábana, su pie NO CORTA la línea que dibuja la Sábana. Pero además, si la pisara sería irrelevante. 5. El notable escéptico Paul Eric Blanrue, creo que fue el primer crítico con el Codex Pray, interpreta los agujeros (holes) como ¡DIAMANTES! que evocan la naturaleza divina de Cristo y el fenómeno milagroso de su resurrección y que conforman las letras P y X, monograma de Cristo. ( ¡le faltan diamantes para conformar la X del monograma!). Está claro que NO puede eludirse la presencia de los 2 grupos de agujeros (holes) y que todo ello es COHERENTE con la Sábana de Turín. 6. El Codex Pray NO demuestra la existencia de la Sábana de Turín, pero es MUY SUGERENTE de su existencia..","date":"2012-06-03","mins":"9:11 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11931","author":"carlos","post":"David ¿por qué modifica las fechas? No es 14th 15th century. Es 15th century. Hamra kyrka (Gotland). Passionsfries (15.Jh.) La Sábana era bien conocida en Europa ( en “todo el mundo” según el obispo Pierre D´Arcis) y prueba de ello es la medalla conmemorativa que muestra su primera ostensión en Lirey en 1355 57. La infuencia de la Sábana Santa en las obras que usted ha mostrado del SIGLO XV, Lübeck y Gotland es CLARA..","date":"2012-06-05","mins":"3:56 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11977","author":"carlos","post":"Usted tiene que entender cúal es el TEMA de la obra que realiza el artista. El tema NO es la Sábana Santa. El tema SI es “The Three Marys at the Sepulchre”. (“Until around 1100, the discovery of the empty tomb was the moment normally chosen to represent the Resurrection of Jesus in art, rather than showing the risen Christ himself.” Wikipedia.) Los actores del drama son el Angel y las 3 mujeres (The Three Marys). Jesús ha RESUCITADO y no está allí. ¿Cómo va el artista a pintar el Angel señalando a la figura de Jesús e indicando a las 3 mujeres que NO ESTÁ ALLÍ porque ha resucitado? Sería ININTELIGIBLE señalar a la figura de Jesús para decir que ALLÍ NO ESTÁ. ( ¡además LA FIGURA sería DORSAL, mostrando espalda y culo, NO puede verse la imagen FRONTAL que estaría en el reverso de la Sábana!). ¡Escena de MUY DIFICIL solución técnica para un gran artista!. Imposible para el mediocre artista del Codex Pray que tiene que recurrir a los SIMBOLOS! Intente usted dibujar el tema “The Three Marys at the Sepulchre” y además mostrar la figura de Jesús en la Sábana. El dibujo será ININTELIGIBLE. ( lamento no poder expresarme en ingles, por lo que es muy probable que usted no entienda mi comentario…… ).","date":"2012-06-06","mins":"2:31 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12030","author":"carlos","post":"Mate, estoy de acuerdo con sus comentarios. La obra está llena de símbolos. Observe que la mano del Angel tiene 6 dedos, 5 se ven y el pulgar queda oculto. David, sus argumentos son de enorme FRAGILIDAD. Y como apunta Mate, un EXPERTO AUTÉNTICO como Thomas de Wesselow acepta el carácter excepcional del Codex Pray y su relación con la Sábana Santa. Tengo criterio propio porque conozco bien el arte medieval, y comprenderá que de MÁS VALOR a la opinión de Wesselow que a la opinión suya o a la de colinsberry..","date":"2012-06-07","mins":"6:44 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12663","author":"carlos","post":"Cuando se trata de establecer la posibilidad de una relación entre la Sábana de Constantinopla y la Sábana de Turín, AMBAS CON IMAGEN, es una FALACIA permanente de los escépticos ( siempre la utilizan) el hacer referencia a los 40 sudarios (?) existentes en la Edad Media, sin que puedan DOCUMENTAR mínimamente ninguno de esos INEXISTENTES sudarios ( CARENTES DE IMAGEN)..","date":"2012-06-18","mins":"4:19 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12665","author":"carlos","post":"Colins y Mario: “Otras anomalías, especialmente en trama, son debidas a la habilidad o experiencia del tejedor, dando lugar a zonas más o menos tupidas. Anomalía también, para nosotros ahora, es observar que algunos hilos de trama ROTOS dentro del cuerpo del tejido, fueron anudados durante la tejedura, cosa que no se haría hoy por el más alto precio de la mano de obra.” Hay un magnífico estudio TEXTIL, en español, de F.López Amo: “ESTUDIO TÉCNICO TEXTIL DE LA SÍNDONE DE TORINO Y EL SUDARIO DE OVIEDO”, en que se estudia las IRREGULARIDADES del hilado. Creo que es único. Http://upcommons.upc.edu/revistes/bitstream/2099/1630/1/116 7.pdf http://upcommons.upc.edu/revistes/bitstream/2099/1644/7/articulo boletin 117.pdf.","date":"2012-06-18","mins":"4:47 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12678","author":"carlos","post":"Menedemo, no confunda la velocidad con el tocino. La opinión que tenga Wesselow sobre el hecho de la Resurrección, su interpretación, NO tiene nada que ver con su condición de EXPERTO en arte. El que Wesselow no le guste a usted es otra cosa..","date":"2012-06-18","mins":"1:37 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12685","author":"carlos","post":"David, su comentario es una generalización que no tiene ninguna relación con mi comentario. Yo hablo de la Sábana de Turín ( la conocemos bien) y su muy probable relación con la Sábana de Constantinopla ( conocemos documentalmente que se mostraba a los fieles para que vieran la IMAGEN de Cristo). ¿Conocemos documentalmente de la existencia SIMULTANEA, en la misma época, de 2 SÁBANAS que pretendieran ser MORTAJA (lienzo funerario) de Cristo y que mostraran su IMAGEN? ¡NOOOOOOOO! Mantener que hayan existido y se hayan destruido otras mortajas similares es una PURA FICCIÓN. Igualmente podría mantenerse la FICCIÓN de que hayan existido documentos que demostraban la autenticidad de la Sábana y que al igual fueron destruídos…… Así que las 2 UNICAS SÁBANAS que pretendieran ser MORTAJA y mostraran IMAGEN de Cristo, y que no siendo documentalmente simultáneas SI SON cercanas en el tiempo, son la Sábana de Constantinopla y la Sábana de Turín. Y que bien cabe la posibilidad, con mucha probabilidad, de que ambas Sábanas fueran LA MISMA, pues la de Constantinopla fue ROBADA y tras siglo y medio aparece la de Turín en Lirey. ¿Alguien puede demostrar documentalmente la existencia de alguna OTRA Sábana con esas características de ser mortaja y mostrar la imagen entre 1200 1350?. ¡NOOOOOOOOO! Hablar de 40 sudarios medievales al tratar sobre la Sábana de Turín es una FALACIA que pretende DESINFORMAR o CONFUNDIR al lector poco conocedor del tema..","date":"2012-06-18","mins":"4:16 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12695","author":"carlos","post":"David, sus “seven specific claims” son generalizaciones, con excepción de la 2 ( existencia de la Sábana de Constantinopla con la IMAGEN de Cristo), porque no son precisas ni son necesarias para HACER UNA RELIQUIA FALSA o para FALSIFICAR UNA RELIQUIA. Hacer una reliquia FALSA no precisa de ANTECEDENTES. Su hipótesis de que la Sábana de Turín sea una RELIQUIA FALSA es MUY IMPROBABLE. No tiene el mínimo sentido teniendo en cuenta las ENORMES DIFICULTADES de su realización que hoy siguen SIN SOLUCIÓN. Una Sábana con manchas de sangre, por ejemplo, hubiera obtenido los mismos resultados…… FALSIFICAR UNA RELIQUIA precisa de la existencia de un ORIGINAL (auténtico o falso), que es lo que se falsifica. ¿Admitiría usted que sus “falsificadores” pretendieron FALSIFICAR la Sábana de Constantinopla desaparecida hacia el año1200?.","date":"2012-06-19","mins":"6:42 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-13496","author":"carlos","post":"Davor: Pues cree usted respecto a la pintura IGUAL que creían los científicos y los expertos del STURP que realizaron el estudio de 1978: “No pigments, paints, dyes or stains have been found on the fibrils. X ray, fluorescence and microchemistry on the fibrils preclude the possibility of paint being used as a method for creating the image. Ultra Violet and infrared evaluation confirm these studies. Computer image enhancement and analysis by a device known as a VP 8 image analyzer show that the image has unique, three dimensional information encoded in it. Microchemical evaluation has indicated no evidence of any spices, oils, or any biochemicals known to be produced by the body in life or in death. It is clear that there has been a direct contact of the Shroud with a body, which explains certain features such as scourge marks, as well as the blood. However, while this type of contact might explain some of the features of the torso, it is totally incapable of explaining the image of the face with the high resolution that has been amply demonstrated by photography. The basic problem from a scientific point of view is that some explanations which might be tenable from a chemical point of view, are precluded by physics. Contrariwise, certain physical explanations which may be attractive are completely precluded by the chemistry. For an adequate explanation for the image of the Shroud, one must have an explanation which is scientifically sound, from a physical, chemical, biological and medical viewpoint. At the present, this type of solution does not appear to be obtainable by the best efforts of the members of the Shroud Team. Furthermore, experiments in physics and chemistry with old linen have failed to reproduce adequately the phenomenon presented by the Shroud of Turin. The scientific concensus is that the image was produced by something which resulted in oxidation, dehydration and conjugation of the polysaccharide structure of the microfibrils of the linen itself. Such changes can be duplicated in the laboratory by certain chemical and physical processes. A similar type of change in linen can be obtained by sulfuric acid or heat. However, there are no chemical or physical methods known which can account for the totality of the image, nor can any combination of physical, chemical, biological or medical circumstances explain the image adequately. Thus, the answer to the question of how the image was produced or what produced the image remains, now, as it has in the past, a mystery. We can conclude for now that the Shroud image is that of a real human form of a scourged, crucified man. It is not the product of an artist. The blood stains are composed of hemoglobin and also give a positive test for serum albumin. The image is an ongoing mystery and until further chemical studies are made, perhaps by this group of scientists, or perhaps by some scientists in the future, the problem remains unsolved.” Octubre 1981.","date":"2012-07-05","mins":"9:26 am","url":"https://shroudstory.com/2012/07/05/davor-aslanovski-is-right-for-once/","cat":"art","title":"Davor Aslanovski is right for once"},{"id":"comment-14087","author":"carlos","post":"“Más espectacular es el Aer Epitaphios del monasterio de Stavronikita. Mide 91,5 x 113 cm, y parece consistir en dos bordados distintos que se juntaron. Las fechas más probables de los bordados son los siglos XIV y XV. Igual que con el epitaphios de Pantokrator, el icono de Cristo lleva un taparrabos y se aprecian claramente los pulgares. El cuerpo está cubierto de sangre de un color bastante oscuro, salvo la sangre de la herida del costado, que es mucho más roja. Las manchas de sangre del antebrazo son parecidas a las de la Síndone. Hay otro detalle de este epitaphios muy difícil de explicar a menos que se relacione con la Síndone. En cadáver yace en un lino del mismo color que la reliquia turinesa, pero lo que es más significativo que el color y el tejido del lino son idénticos al color y tejido de la Síndone. La fecha del bordado hace improbable que ésta fuese el modelo directo, pero la influencia es innegable. Parece ser una tradición en varios epitaphioi que refleja conocimientos de la reliquia, probablemente de cuando estuvo en Constantinopla.” Mark Guscin.”LA SÍNDONE Y LA IMAGEN DE EDESA .Investigaciones en los monasterios del Monte Athos (Grecia)”. Linteum 34 (enero junio de 2003), 5 16 http://www.redentoristas.org/sabanasanta/archivosiconos/sindoneedesamarkguscin.pdf Carlos.","date":"2012-07-22","mins":"6:00 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)"},{"id":"comment-145114","author":"carlos","post":"David Hines: ¡Magnífico trabajo! El dibujo del “Callistus fresco of Jesus” fue realizado por el artista Thomas Heaphy (1813 1873) y se encuentra probablemente en el British Museum. [At Rome he made careful drawings of everything illustrating the subject to which he could obtain access in the Catacombs and Vatican Library. He has given an interesting account of his difficulties in procuring the necessary permissions for this purpose. His last journey to Rome was made in 1860, and in the following year he published the result of his labours in a series of eight articles in the ‘Art Journal.’ The papers with the necessary illustrations were not reissued till 1880, seven years after his death, when they were brought out in a folio volume under the editorship of his friend Mr. Wyke Bayliss, F.S.A., with the title ‘The Likeness of Christ; an Enquiry into the verisimilitude of the received Likeness of our Blessed Lord.’ A cheap reprint has since been issued by the Society for Promoting Christian Knowledge. The original drawings are now in the print room of the British Museum.] Está recogido (Plate VII) junto a otros magníficos dibujos de Heaphy en el libro de Sir Wyke Bayliss “Rex Regum”,1898. “Rex Regum” (on line) ediciones de 1898 y 1902 http://www.unz.org/Pub/Bayliss Wyke 1898?View=Read It http://www.unz.org/Pub/Bayliss Wyke 1898?View=Read It2 Carlos.","date":"2014-08-20","mins":"10:06 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145131","author":"carlos","post":"Dave B: No confundas Thomas Heaphy “the elder” (1775 1835) con su “eldest son” Thomas Heaphy “the younger” (1813 1873). [HEAPHY, THOMAS, the younger (1813–1873), portrait and subject painter, eldest son of Thomas Heaphy the elder [q. V.], by his first wife, Mary Stevenson, was born at St. John’s Wood, London, 2 April 1813. In 1831, when a lad of seventeen, Heaphy accompanied his father on a visit to Italy, where he acquired a knowledge of the language and cultivated a taste for religious art, for which he always retained a strong predilection. Adopting his father’s profession, he commenced life as a portrait painter, and for many years enjoyed an extensive patronage. He exhibited for the first time at the Royal Academy in 1831, and in 1850 sent his first subject picture, ‘The Infant Pan educated by the Wood Nymphs.’ Among his most successful works which followed were ‘Catherine and Bianca’ (1853), a series of peasant girls of various countries (1859–62), ‘Kepler mistaken for an Astrologer’ (1863), ‘Palissy the Potter taken for a Coiner’ (1864), ‘Lord Burleigh showing his Peasant Bride her new Home’ (1865), and ‘Lizzie Farren, afterwards Countess of Derby, waiting at the Prison Bars with her Father’s Breakfast’ (1872). In 1867 he sent to the exhibition of the Society of British Artists ‘General Fairfax and his Daughter pursued by the Royal Troops,’ and in that year was elected a member of the society. In 1844 he was commissioned to paint an altar piece for the protestant church at Malta, erected at the expense of Queen Adelaide, and he also executed one for a church at Toronto, Canada. He devoted much time to investigating the origin of the traditional likeness of Christ; in the pursuit of this inquiry he travelled widely. At Rome he made careful drawings of everything illustrating the subject to which he could obtain access in the Catacombs and Vatican Library. He has given an interesting account of his difficulties in procuring the necessary permissions for this purpose. His last journey to Rome was made in 1860, and in the following year he published the result of his labours in a series of eight articles in the ‘Art Journal.’ The papers with the necessary illustrations were not reissued till 1880, seven years after his death, when they were brought out in a folio volume under the editorship of his friend Mr. Wyke Bayliss, F.S.A., with the title ‘The Likeness of Christ; an Enquiry into the verisimilitude of the received Likeness of our Blessed Lord.’ A cheap reprint has since been issued by the Society for Promoting Christian Knowledge. The original drawings are now in the print room of the British Museum. Heaphy possessed considerable literary ability, and contributed articles on various subjects to the periodical press; among them ‘A Night in the Catacombs’ (‘St. James’s Magazine,’ 1861), ‘The Beggar Saint’ (‘Once a Week,’ 1862), and ‘Mr. H——’s Own Narrative’ (‘All the Year Round,’ 1861); the last tale attracted great attention, and was subsequently republished in a separate form under the title ‘A Wonderful Ghost Story,’ with letters from Charles Dickens to the author on the subject. During the last four years of his life, when ill health kept him much indoors, he painted a series of types of foreign beauty, and wrote accounts of them in various publications. At an early period Heaphy assumed the additional christian name ‘Frank,’ with the view of thereby distinguishing his works from those of his father, but dropped it before 1850. He died in South Belgravia, 7 Aug. 1873. In 1842 he married Eliza Bradstreet, daughter of Joseph Bradstreet, of the family of Little Wenham, Suffolk, by whom he had many children.] Dictionary of National Biography, 1885 1900, Volume 25 http://en.wikisource.org/wiki/Dictionary of National Biography, 1885 1900 Carlos.","date":"2014-08-21","mins":"12:57 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145171","author":"carlos","post":"Hugh: La FIDELIDAD al original era esencial en un artista de enorme experiencia como retratista y que dedicó años a la copia de frescos y dibujos en las Catacumbas y en la Vatican Library. Sir Wyke Bayliss, también artista y President of the Royal Society of British Artists, no dudó de la fidelidad de la copia de Thomas Heaphy con el original, y creo que David Hines, también magnífico artista NO tendrá ninguna duda respecto a la fidelidad de la copia de Heaphy. ¿No cree maravilloso ¡”quasi” milagroso! que en ausencia de material fotográfico de la Sábana de Turín, Thomas Heaphy consiguiera la enorme concordancia entre el retrato Callistinus y el rostro de Jesús en la Sábana?. Soy “perro viejo”. Creo que Thomas Heaphy cumplió con su deber de ser fiel al copiar el original, y creo que usted cumple con su deber de intentar “torpedear” todo aquello que pueda ir demostrando inexorablemente la autenticidad de la Sábana y su pertenencia a Jesús. Carlos.","date":"2014-08-21","mins":"4:36 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145181","author":"carlos","post":"Collin: ¡Te equivocas! Las congruencias entre los 2 positivos son aún MÁS IMPRESIONANTES La coincidencia de las sombras a ambos lados de la cara (y otras muchas) son realmente ASOMBROSAS. Carlos.","date":"2014-08-21","mins":"5:26 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145685","author":"carlos","post":"David Hines: “The Likeness of Christ, an enquiry into the verosimilitude of de received likeness of our Blessed Lord”. Thomas Heaphy https://ia600408.us.archive.org/28/items/likenessofchrist00heap/likenessofchrist00heap.pdf Creo que su lectura te será interesantísima. (desafortunadamente mi inglés es pésimo) Los dibujos originales de Heaphy están en el British Museum y no creo que sean accesibles. Su actividad tuvo que ser coincidente con la del arqueólogo Giovanni Batista de Rossi (“padre” de la moderna arqueología del cristianismo), pero es muy probable que el “retrato en cuestión” ya hubiera sido descubierto mucho tiempo atras, por los comentarios que hace Heaphy. Carlos.","date":"2014-08-23","mins":"3:30 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-191795","author":"carlos","post":"Los únicos trabajos que se hicieron incluyendo la experimentación (sobre 12 brazos recién amputados), las radiografías y la disección fueron los del cirujano Pierre Barbet, posteriormente repetidos y corroborados con iguales resultados por Doménico Tarantini, cirujano del “Ospedal Generale di Trani”. “J’ai mesuré, sur ces photographies et sur d’autres clichés directs de dimensions cotées, la distance entre le trou et la tête du troisième métacarpien : elle dépasse un peu huit centimètres.” Sobre la mano de Hugh muestro la situación aproximada que tendría el punto de salida de un supuesto clavo atravesando el espacio de Destot en la muñeca (wrist), a 8 cm de distancia de la cabeza del tercer metacarpiano Carlos.","date":"2015-02-25","mins":"7:44 am","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","title":"Maybe the Nails Didn’t Go Through the Wrists"},{"id":"comment-145703","author":"carlos","post":"David Hines: Escríbe un comentario en mi blog (no lo publicaré) http://lasabanaylosescepticos.blogspot.com.es/ si te parece oportuno, dándome una dirección de e mail a la que yo pueda escribirte. Creo que es preciso que conozcas “cosas” muy importantes si vas a proseguir tu línea de investigación. Carlos.","date":"2014-08-23","mins":"5:32 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-191826","author":"carlos","post":"Con “chichón o sin “chichón” mi supuesto es correcto y el rectángulo inferior marca la ARTICULACIÓN “RADIOCARPAL” en donde se inicia la muñeca, no (negación) el cúbito que para las mediciones es AQUÍ INDIFERENTE. Mi error ha sido el no prolongar el rectángulo sobre su mano creyendo que usted lo entendería. Sus puntos N1 N2 están en el carpo, en la muñeca (wrist) y su punto N3 está a más de 2cm del espacio de Destot. Carlos.","date":"2015-02-25","mins":"2:59 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","title":"Maybe the Nails Didn’t Go Through the Wrists"},{"id":"comment-123960","author":"carlos","post":"Thank you very much, Dan¡ Carlos.","date":"2014-05-24","mins":"6:38 am","url":"https://shroudstory.com/2014/05/24/more-on-the-dislocated-shoulder/","cat":"art","title":"More on the Dislocated Shoulder."},{"id":"comment-11911","author":"carlos","post":"Yannick, el “altar detail, cathedral in Lübeck” es una obra del siglo XV..","date":"2012-06-04","mins":"5:03 pm","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-11932","author":"carlos","post":"Este paseo iconográfico por la Edad Media tiene el interés añadido de HACER EVIDENTE que la imagen de la Sábana Santa no tiene NINGÚN parecido en el arte medieval. Es comparar las pinturas de Leonardo con los dibujos de los Simpsons. ¿Dónde están los “entobments” medievales en los que SE INSPIRÓ el artista falsario que creó la Sábana? Los escépticos dicen que la imagen de la Sábana tiene convencionalismos medievales, como por ejemplo las manos cruzadas sobre el pubis para ocultar los genitales ( cosa que NO es cierta pues hay pinturas medievales del Bautismo de Jesús en las que se muestran los genitales). ¿Dónde están los “entobments” que INSPIRARON al artista falsario?.","date":"2012-06-05","mins":"4:21 am","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-11937","author":"carlos","post":"¡Realmente unica! Le felicito sinceramente, David. Una maravillosa obra del siglo XV. Yo le entiendo perfectamente, ahora usted debe intentar entenderme a mí. Advertirá que es completamente FALSO que la postura de los brazos cruzados sobre el pubis ocultando los genitales en la imagen de la Sábana de Turín se deba a convencionalismos medievales .¿ Lo entenderán los ESCÉPTICOS? Advertirá que la ÚNICA imagen de Jesús MUERTO y DESNUDO que ha podido mostrar (también le felicito sinceramente por ello) que sea ANTERIOR a la Sábana Santa es la procedente de un pintor español del siglo XIII en la “Cloister Collection” que se conserva en The Metropolitan Museum of Art. Si la datación es correcta es una imagen EXCEPCIONAL por lo ATÍPICA. [Personalmente DUDO de su datación correcta porque no se indican datos sobre su procedencia, está muy restaurada y hay zonas “confusas” pictóricamente hablando]. Advertirá que en la imagen que usted muestra de Jesús muerto y desnudo del Maestro Rohan, obra del siglo XV, el dedo pulgar de la mano izquierda está retraido sobre la palma y el dedo pulgar de la mano derecha está ausente. Advertirá que en la imagen que usted muestra del “entombment” de la catedral de Lübeck, obra del siglo XV con Jesús muerto, desnudo y con los brazos cruzados sobre el pubis, los dedos pulgares están ausentes. INTENCIONALMENTE AUSENTES. Y están ausentes los dedos pulgares porque están retraidos sobre las palmas de las manos, como muestra el propio artista en el “Descenso de la Cruz”, obra del mismo panel del altar. ¿No le parece lícito pensar que el Jesús muerto desnudo, con los brazos cruzados sobre el pubis y los pulgares ausentes esté inspirado en la Sábana de Lirey? En el Codex Pray el tema fundamental son los agujeros (holes). Pero se da la circunstancia que aparece Jesús con esos detalles que no puedo considerar como ARBITRARIOS pues todos ellos son y han sido objeto de DEBATE con los ESCÉPTICOS: desnudez de Jesús, brazos cruzados sobre el pubis y ausencia de pulgares. La CASUALIDAD puede haber hecho concurrir en el Codex Pray todos esos detalles…….. Y además los 2 grupos de agujeros (holes). Pero es más lógico pensar que el artista? tenía información privilegiada..","date":"2012-06-05","mins":"7:20 am","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-11963","author":"carlos","post":"Totalmente de acuerdo, Yannick, es lo que he estado manteniendo. Existen MUCHAS obras de arte con Jesús desnudo en el BAUTISMO anteriores a 1350, yo guardo una COLECCION de ellas. [La que muestra David Mo se conserva en en la Capella Palatina di Palermo y es del siglo XII.] Pero obras de arte que muestren a Jesús MUERTO desnudo anteriores a 1350 SON TOTALMENTE EXCEPCIONALES ( 2 obras si aceptáramos además del Codex Pray la obra del pintor español del siglo 12 de la Clouster Collection, cuya datación me parece muy dudosa). Y obras de arte que muestren a Jesús muerto desnudo, con los brazos cruzados sobre el pubis y los pulgares ausentes, como en la Sábana Santa, SOLO conocemos 1 obra, la del Codex Pray..","date":"2012-06-05","mins":"5:55 pm","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-11964","author":"carlos","post":"Colinsberry, creo que usted de arte medieval NO ENTIENDE NADA..","date":"2012-06-05","mins":"5:58 pm","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-11991","author":"carlos","post":"¡Ja,ja,ja,ja….! ¡Me va a convencer, David! Las muñecas en la imagen de la Sábana Santa NO se cruzan. Pero muchas copias de la Sábana Santa realizadas a TAMAÑO NATURAL confunden la posición de las manos cruzando los brazos por encima de las muñecas o por las muñecas, e incluso algunas confunden los brazos y es el brazo izquierdo el que está debajo del brazo derecho ,etc, etc, etc Incluso la copia atribuida a Albrecth Dürer comete ese tipo de error. ¿Estarán esas copias NO inspiradas en la Sábana santa? ¿En qué obra de arte estarán inspiradas? ¿Estarán inspiradas en el Codex Pray?.","date":"2012-06-06","mins":"9:14 am","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-11982","author":"carlos","post":"¿Abdomen? No he escrito nunca abdomen en este debate. El abdomen es un territorio extenso y es habitual que las manos del muerto descansen sobre el abdomen. Hay MUCHOS ejemplos en la iconografía. He escrito PUBIS o REGION PUBIANA de manera que las manos alcancen los genitales. Es esa postura que los ESCÉPTICOS dicen que es IMPOSIBLE ( falso) y que es un convencionalismo medieval para no mostrar los genitales. Ya hemos visto que ese convencionalismo medieval es FALSO como muestran los MUCHOS ejemplos del BAUTISMO de Jesús desnudo. Sin embargo es EXCEPCIONAL la iconografía que muestre a Jesús MUERTO desnudo. Seguro que han existido y existen muchas obras de arte que muestran a Jesús muerto desnudo, yo CREO en la autenticidad de la Sábana y su influencia en el Arte……¡ pero esas obras que muestran o mostraban a Jesús muerto desnudo NO LAS CONOCEMOS! Conocemos SOLO 2 obras anteriores a la Sábana Santa que muestren a Jesus muerto desnudo, y una de ellas es de datación dudosa ( la de la Clousters Collection). Los detalles que tienen similitud en el Codex Pray y la Sábana Santa no son de elección ARBITRARIA. [ y como ha indicado Mario Latendresse se daban las condiciones óptimas para que el artista del Codex Pray tuviera información sobre la Sábana] TODOS esos detalles han sido objeto de DEBATE con anterioridad al conocimiento del Códex Pray. Simbolismo y Arte son CONSUSTANCIALES desde el Pleistoceno….y la Edad Media es muy rica en Símbolos en todas las manifestaciones artísticas..","date":"2012-06-06","mins":"4:28 am","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-11898","author":"carlos","post":"En el arte medieval hay muchas escenas del BAUTISMO de Jesús mostrándolo desnudo. Las relacionadas con su MUERTE son sin embargo excepcionales..","date":"2012-06-04","mins":"12:00 pm","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-135291","author":"carlos","post":"The sarchofagus of stone was an INVENTION of the artists. Jesus WAS NOT buried in a sarchofagus, Jesus was buried in a cave. The artist of the Códex Pray does not represent a SARCHOFAGUS that is NON EXISTENT in the Gospel, and is not an exception: http://www.metmuseum.org/toah/works of art/1993.19 http://collections.vam.ac.uk/item/O137853/the maries at the sepulchre panel unknown/ The artist of the Códex Pray represents to the seated angel sat in a bank, as says O.K, ó well in the stone that was covering the entry of the cave, and is not an exception: http://www.artbible.net/3 JC/ Mat 28,01 Women Resurrection Femmes/2nd 16th Siecle/slides/08 18%20 IVORY%20 EMPTY%20 TOMB%20 MAT%2028.html Why do sceptics want that the Sheet is a sarchofagus? They know badly the History of the Art. (en español) El sarcófago de piedra fue un INVENTO de los artistas. Jesús NO FUE sepultado en un sarcófago, Jesús fue sepultado en una cueva. El artista del Códex Pray NO representa un SARCÓFAGO que es INEXISTENTE en el Evangelio, y no es una excepción: http://www.metmuseum.org/toah/works of art/1993.19 http://collections.vam.ac.uk/item/O137853/the maries at the sepulchre panel unknown/ El artista del Códex Pray representa al angel sentado sentado en un banco, como dice O.K, ó bien en la piedra que tapaba la entrada de la cueva, y no es una excepción: http://www.artbible.net/3 JC/ Mat 28,01 Women Resurrection Femmes/2nd 16th Siecle/slides/08 18%20 IVORY%20 EMPTY%20 TOMB%20 MAT%2028.html ¿Por qué quieren los escépticos que la Sábana sea un sarcófago? Conocen mal la Historia del Arte. Carlos.","date":"2014-07-04","mins":"7:40 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134276","author":"carlos","post":"O.K.: There is a brand in the “forehead” in the Jesus of the entumbamiento who is own of the image of the Shroud of Turin. (en español) Hay una marca en la “frente” en el Jesús del entumbamiento que es propia de la imagen de la Sábana de Turín. Carlos.","date":"2014-06-29","mins":"5:27 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135506","author":"carlos","post":"David: You say: “We are not discussing how the Jewish tombs actually were in the First Century but how was represented the Jesus’ tomb in the last medieval art. ” NOT. We are discussing if the artist of the Códex Pray drew the Shroud of Turin or if the artist of the Códex Pray drew a NON EXISTENT sarchofagus in the Gospels. In the Codex Pray the SARCHOFAGUS is NON EXISTENT, as in 4 examples that I propose the SARCHOFAGUS it is NON EXISTENT. You say: “But I am surprised because in the examples you put here the angel is seated on the lid or on the sarcophagus.” ¡¡¡¡¡¡¡???????? What sarchofagus?. In 4 examples that I propose the SARCHOFAGUS it is NON EXISTENT. 1 “Three Holy Women at the Sepulcher”, early 10th century Northern Italy (Milan?) The Cloisters Collection and Lila Acheson Wallace. The SARCHOFAGUS it is NON EXISTENT. 2 “The Maries at the Sepulchre”, St Gall, Switzerland (probably´ca. 900 950) The SARCHOFAGUS it is NON EXISTENT. 3 “Ascension of Christ” ca.400, Bayerisches Nationalmuseum in Munich. The SARCHOFAGUS it is NON EXISTENT. 4 “08 Ivory empty tomb Mat 28”, scenes from the Life of Christ, Victoria and Albert Museum The SARCHOFAGUS it is NON EXISTENT. (en español) David: Usted dice: “No estamos discutiendo cómo eran las tumbas judías del siglo I, sino cómo se representaba la tumba de Jesús en el arte medieval tardío.” NO. Estamos discutiendo si el artista del Códex Pray dibujó la Sabana Santa o si el artista del Códex Pray dibujó un sarcófago INEXISTENTE en los Evangelios. En el Codex Pray el SARCÓFAGO es INEXISTENTE, al igual que en los 4 ejemplos que propongo el SARCÓFAGO es INEXISTENTE. Usted dice: “…lo que me extraña es que incluso en los ejemplos que pones el ángel está sentado sobre la tapa del sarcófago o sobre el mismo sarcófago.” ¡¡¡¡¡¡¡¡¡¡¡???????? ¡Yo soy el sorprendido! ¿Qué sarcófago? En los 4 ejemplos que propongo el SARCÓFAGO es INEXISTENTE. 1 “Three Holy Women at the Sepulcher”, early 10th century Northern Italy (Milan?) The Cloisters Collection and Lila Acheson Wallace El SARCÓFAGO es INEXISTENTE 2 “The Maries at the Sepulchre”, St Gall, Switzerland (probably´ca. 900 950) El SARCÓFAGO es INEXISTENTE 3 “Ascension of Christ” ca.400, Bayerisches Nationalmuseum in Munich. El SARCÓFAGO es INEXISTENTE 4 “08 Ivory empty tomb Mat 28”, scenes from the Life of Christ, Victoria and Albert Museum El SARCÓFAGO es INEXISTENTE Carlos.","date":"2014-07-05","mins":"12:31 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132207","author":"carlos","post":"O.K: – there are 2 “thin” crosses on the ABDOMEN of the Virgin Mary (the central figure of 3 Marias whose “halo” is similar to that of the ” archangel 6 fingers “). – there are the same “thin” crosses on the “supposed” LEAF of the Shroud identifying HIS CONTACT with the body of dead Jesus conceived in the abdomen of the Virgin Mary. – it is a question evidently of the Shroud. Very good work, O.K Carlos (en español) O.K: Hay 2 cruces “finas” sobre el VIENTRE de la Virgen María ( la figura central de las 3 Marias cuya “aureola” es similar a la del “arcángel 6 dedos”). Hay esas mismas cruces “finas” sobre la “supuesta” HOJA de la Sábana identificando SU CONTACTO con el cuerpo de Jesús muerto concebido en el vientre de la Virgen María. Se trata evidentemente de la Sabana Santa. Muy buen Trabajo, O.K Carlos.","date":"2014-06-21","mins":"9:45 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132209","author":"carlos","post":"Mi ordenador ha introducido unos links INDESEABLES en las palabras “CONTACT” y “Trabajo”. Ruego disculpas. Carlos.","date":"2014-06-21","mins":"9:50 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-180186","author":"carlos","post":"Estimado Dan: Iba a escribir en mi blog un post sobre el escultor Juan Manuel Miñarro….¡ y te me has adelantado!. El Prof. Miñarro es un gran experto en la imagen del Hombre de la Sábana y en el Sudario de Oviedo. Posee un profundo conocimiento de la Anatomía y es asesorado por médicos especialistas en distintas disciplinas (medicina forense, dermatología, traumatología, etc), si bien tiene un criterio propio gracias al estudio durante varios años de todo lo que se ha escrito desde la patología forense sobre el Hombre de la Sábana. Reune así dos condiciones que hacen su trabajo realmente excepcional, la de ser un gran artista y la tener un gran conocimiento científico. En estas magníficas fotografias puede observarse su manera de trabajo: http://www.lahornacina.com/noticiasminarro39 II.htm Y en este artículo con extraordinarias fotografías: “Explicación médico forense del Hombre de la Sábana”. Juan Manuel Miñarro López. Http://www.lahornacina.com/articulosminarro.htm ¡No dejes de verlos! Carlos.","date":"2014-12-30","mins":"10:31 pm","url":"https://shroudstory.com/2014/12/30/the-awesome-shroud-based-art-of-juan-manuel-miarro-lopez/","cat":"art","title":"The Awesome Shroud-based Art of Juan Manuel Miñarro Lopez"},{"id":"comment-187002","author":"carlos","post":"Cloruro de magnesio. Carlos..","date":"2015-01-28","mins":"2:30 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-191754","author":"carlos","post":"Todos los expertos médicos,TODOS sin excepción, están de acuerdo en que el clavo atravesó la muñeca (“wrist”), atravesó los huesos del carpo. Carlos.","date":"2015-02-24","mins":"6:58 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-187016","author":"carlos","post":"La utilización del cloruro de magnesio en las artrosis, y procesos similares, carece de base científica…..pero “funciona” en muchos casos, tras largos periodos de administración. Se lo administro a mi esposa en forma de polvo cristalino una cucharadita al día (es muy amargo y puede tener algún efecto laxante) y se lo he indicado a algunos de mis mejores amigos, siempre con muy buenos resultados que la medicación usual es incapaz de obtener. Con esa dosificación carece de efectos adversos. Carlos.","date":"2015-01-28","mins":"3:48 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185253","author":"carlos","post":"RECTIFICATION! My comment is erroneous. The wound of the side is placed correctly in 2 copies and the texts in 2 Shrouds of Noalejo they are read correctly (en español) ¡RECTIFICACION! Mi comentario es erróneo. La herida del costado está situada correctamente en las 2 copias y los textos en las 2 Sábanas de Noalejo se leen correctamente Carlos.","date":"2015-01-21","mins":"9:17 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185230","author":"carlos","post":"The image is very interesting and is evidently a copy of the ORIGINAL realized using A MIRROR. The artist, Gir, gives the key putting the TEXT of way to speculate. The image and the text must be seen with a mirror. It is probable that Gir was finding a better way of being able to copy of this curious way. Carlos (traducción mecánica) En español: La imagen es muy interesante y es evidentemente una copia del ORIGINAL realizada utilizando UN ESPEJO. El artista, Gir, da la clave poniendo el TEXTO de manera especular. La imagen y el texto deben ser vistos con un espejo. Es probable que Gir encontrara una mejor manera de poder copiar de esa curiosa manera. Carlos.","date":"2015-01-21","mins":"7:14 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185266","author":"carlos","post":"It is very difficult to find good photographies of the POSITIVES of the Shrouds of Noalejo (typical Spanish! …… will be necessary to hope that some japanese or korean tourist realizes them …), specially of the Shroud of better quality. But they are seen the wounds of the side in the correct side (en español) Es muy difícil encontrar buenas fotografías de los POSITIVOS de las Sábanas de Noalejo ( ¡típico español!……habrá que esperar a que algún turista japonés o coreano las realice… ), especialmente de la Sábana de mejor calidad. Pero se ven las heridas del costado en el lado correcto Carlos.","date":"2015-01-21","mins":"10:34 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185650","author":"carlos","post":"“The Shroud of Turin and its ancient copies” César Barta and Alfonso V. Carrascosa. “Scientific Research and Essays” Vol. 7(29), pp. 2526 2544, 30 July, 2012 Accepted 12 July, 2012 Available online at http://www.academicjournals.org/SRE DOI: 10.5897/SRE12.384 ISSN 1992 – 2248 ©2012 Academic Journals Carlos.","date":"2015-01-23","mins":"5:47 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185846","author":"carlos","post":"“My fundamental points in commenting above were: Prevalence of wide spread ignorance concerning basic forensics until modern times, leading to faulty and unrealistic representations in depictions of Christ’s crucifixion and burial and hence faulty popular conclusions; Based on forensics from the TS, it is unlikely that Joseph of Arrimathea’s shroud was used for transport purposes.” Totally in agreement. Carlos.","date":"2015-01-23","mins":"9:04 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185909","author":"carlos","post":"“Charles should reconsiderer some points of this article” Totally in agreement. Las copias de Noalejo MANTIENEN los pigmentos pictóricos. La Sábana de Turín CARECE de pigmentos pictóricos. “The components of the pigments used for these copies appear without difficulty when analyzed in the laboratory. The images on the Noalejo copies were painted with some kind of soil pigment. A preliminary analysis of the samples identified the presence of tin (Sn), lead (Pb), calcium (Ca), aluminium (Al), iron (Fe), and other heavy elements. Figure 25 shows an example of a spot analysis. For more representative results, microanalysis on eight particles found in the image sample CE1 were performed and the sum of the atomic percentages of the elements determined by EDX (Energy Dispersive X ray Spectroscopy) is shown in Figure 26. Nickel (Ni) may be another component in the pigment. There was no previous preparation for the cloth and no oil was used. The binding substance must be diluted gum (Opinion of Juan Manuel Miñarro. University of Seville. Sculpture department. Personal communication). The text is printed in gold leaf.” Figure 23. Photograph with optical microscope of the pigments of one copy of Noalejo. Figure 24. Photograph with scanning electron microscope of the pigments of one copy of Noalejo Figure 25. Spectrum of dispersive energy analysis made on the pigments of one copy of Noalejo. Presence of Tin (Sn) and Lead (Pb). Figure 26. Sum of atomic percentages for each element determined by EDX for eight particles found in the image sample CE1. Aluminium (Al), tin (Sn), iron (Fe) and nickel (Ni) may be the main components of the pigments. Carlos.","date":"2015-01-24","mins":"3:39 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-184379","author":"carlos","post":"Charles: “….you will find examples of enormous sophistication which make the artist of the Shroud look like an amateur. Just look at the linen processional banner of the Intercession of Christ and the Virgin ,attr, to Lorenzo Monaco, c.1400, explored in the article by Charlotte Hale, p.31 onwards.” ¿Es usted consciente de la “barbaridad” que expresa?. ¿Tiene usted problemas visuales?. La bellísima obra de Lorenzo Mónaco sería desde el punto de vista anatómico una CARICATURA, y usted jamás encontraría un médico que avalara en ella un carácter REALISTA. Carlos.","date":"2015-01-18","mins":"9:37 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185921","author":"carlos","post":"La Sábana de Sanlúcar de Barrameda, excepcional y única porque interpreta la imagen de la Sábana Santa en POSITIVO, carece de corona de espinas y de “perizonium”, tiene el cabello largo……. Y fue ¡REGALO DEL PAPA! al embajador español en Roma, Conde de Olivares*. La Sábana de Sanlúcar mantiene perfectamente los pigmentos pictóricos. El Conde de Olivares regaló la Sábana al Duque de Medina Sidonia, señor de Sanlúcar, quien la donó junto a otras reliquias al Santuario de la Virgen de la Caridad (que él fundó) en el año 1613 mediante “carta de donación”. Creo que la hipótesis (?) de Charles Freeman tiene “agujeros” por todas partes. * Enrique de Guzmán y Ribera, embajador en Roma (1582 1591) y posteriormente fue nombrado virrey de Sicilia y virrey de Nápoles. Carlos.","date":"2015-01-24","mins":"4:36 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"}]
