[{"id":"comment-181633","author":"carlos","post":"¡Genial! Carlos.","date":"2015-01-06","mins":"10:41 am","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181634","author":"carlos","post":"Me refiero a la fotografía que muestra O.K. Creo que es un “problema” resuelto muy brillntemente….. Lo agregaré a mi blog…. Carlos.","date":"2015-01-06","mins":"10:45 am","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181585","author":"carlos","post":"Impossible? Michael Baden: 1 “If I had to go into a courtroom, I could not say there was rigor, whether the man was alive or dead, or that this picture was a true reflection of injuries. In no way do I hold myself out as an expert on the shroud, but I do know dead bodies. Human beings don’t produce this kind of pattern.” (Rhein, R.W. Jr., The Shroud of Turin: Medical Examiners Disagree, Medical World News, 21:40 50, Dec. 22, 1980.) 2 ” From my knowledge of dead bodies, and the wrapping of dead bodies, this kind of transfer never occurs. And blood never oozes in nice neat rivulets, it gets clotted in the hair. The anatomic accuracy is more what Michelangelo would have done in a painting than actually happens to a body”. (quoted by Angier 1982.60) 3 “When the scalp bleeds, it doesn´t flow in rivulets; the blood mats on the hair. To me, this makes the image less real. It´s all good to be true”. (Relics of the Christ”, Nickell, p 174, 2007). 4 “Whatever did this doesn´t speak for severe scalp lacerations”.(Relics of the Christ”, Nickell, p 174, 2007). 5 “..if the Shroud is genuine, the body must have been washed”, “..if the body was washed there might be some oozing from the wounds”. “The Man of the Shroud was washed”. Zugibe, Frederick.T, 1989. Carlos.","date":"2015-01-06","mins":"4:31 am","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181635","author":"carlos","post":"“brillantemente”.","date":"2015-01-06","mins":"10:47 am","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-182078","author":"carlos","post":"David: A/¿En qué frase utiliza Michael Baden la palabra “impossible”? 1 “If I had to go into a courtroom, I could not say there was rigor, whether the man was alive or dead, or that this picture was a true reflection of injuries. In no way do I hold myself out as an expert on the shroud, but I do know dead bodies. Human beings don’t produce this kind of pattern.” (Rhein, R.W. Jr., The Shroud of Turin: Medical Examiners Disagree, Medical World News, 21:40 50, Dec. 22, 1980.) 2 ” From my knowledge of dead bodies, and the wrapping of dead bodies, this kind of transfer never occurs. And blood never oozes in nice neat rivulets, it gets clotted in the hair. The anatomic accuracy is more what Michelangelo would have done in a painting than actually happens to a body”. (quoted by Angier 1982.60) 3 “When the scalp bleeds, it doesn´t flow in rivulets; the blood mats on the hair. To me, this makes the image less real. It´s all good to be true”. (Relics of the Christ”, Nickell, p 174, 2007). 4 “Whatever did this doesn´t speak for severe scalp lacerations”.(Relics of the Christ”, Nickell, p 174, 2007). 5 “..if the Shroud is genuine, the body must have been washed”, “..if the body was washed there might be some oozing from the wounds”. “The Man of the Shroud was washed”. Zugibe, Frederick.T, 1989. ¿Encuentra la palabra “impossible”? B/ Michael Baden duda: “..if the Shroud is genuine, the body must have been washed”, “..if the body was washed there might be some oozing from the wounds”. C/ Su error principal, David, es el suponer: “Hair is hair in the front and the back of the head. What is impossible in the front is also impossible in the back.” Porque son muchos los factores que inciden en el comportamiento que va a tener la sangre. D/ ¿”Rivulets” en el cabello? ¿Son realmente “rivulets? Me estoy refiriendo a las manchas de sangre que aparecen a ambos lados de la cabellera a la altura de la rotura de la nariz. Las manchas de la nuca no merecen ese nombre. La palabra “rivulets” sugiere continuidad y esa continuidad es inexistente. Los supuestos “rivulets” son discontínuos, manchas separadas, mucho más en el lado izquierdo que en el lado derecho. Y Gilbert Lavoie las ve como una serie de manchas separadas (yo tambien). “Rivulets” son los que muestra la magnífica fotografía que nos ha enseñado O.K. [8 ó 9 “rivulets”, quizás más, que nacen en la mancha de sangre que señala la lesión y van descendiendo por el cuero cabelludo sin inundarlo (¡ah Baden!); los “rivulets” han iniciado la coagulación en su periferia, algunos se “agotan” en el cuero cabelludo, pero otros, actuando como “tuberías” siguen recibiendo sangre líquida y alcanzan la zona de piel que rodea a la oreja, ahí la sangre líquida inunda la piel y otra serie de “rivulets” se inician avanzando por la piel del cuello y de la cara. ¡Es difícil encontrar fotografías que muestren estas cosas!] E/ Pero es que esas manchas separadas a las que me estoy refiriendo no están en el cabello…..están en la cara. O.K. Mide (magníficamente) 9 cm entre la punta de la nariz y el supuesto rivulet derecho. Yo medía, después de corregirme un amable lector, 17,1 cm entre los supuestos rivulets derecho e izquierdo : ¿Natural o Sobrenatural? (“La Sábana y los escépticos”. Mayo del 2012) http://lasabanaylosescepticos.blogspot.com.es/2012/05/natural o sobrenatural.html Medidas que parecen incompatibles con que esas manchas de sangre estén sobre el cabello. Carlos.","date":"2015-01-08","mins":"2:42 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181803","author":"carlos","post":"David: Do not invent! Baden made by rainwater does not speak about the nape, and the streams are seen perfectly in the hair. (en español) ¡No inventes! Baden no habla de la nuca, y los regueros se ven perfectamente en el pelo. Carlos.","date":"2015-01-07","mins":"6:56 am","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-182846","author":"carlos","post":"David: ¿Por qué insistes en “engañarte”? 1 “Dónde ves un reguero de sangre en el cabello del hombre herido como éste? (Aquí la imagen)” Has dado una apariencia de continuidad , que es INEXISTENTE en la Sábana, a esa imagen que sitúas en una esquina de la nuca. Te lo expliqué y te lo explicó O.K (“..rather some largue, dense drops or puddles trapped between wounds and hair.”) 2 “¿Dónde están en el sudario las marcas de los mechones empapados en sangre que cubren toda la parte alta de la cabeza junto a la herida?” EN NINGÚN SITIO. En la imagen frontal de la Sábana las manchas de sangre están sobre la piel del rostro, no en el cabello. Te lo expliqué, también te lo explicó O.K., pero tu no quieres entenderlo porque es contrario a tus intereses. 3 “¿Por qué puedes ver regueros de sangre (?) y no las marcas de los mechones?¿Tienes una explicación racional para esto (no vaguedades, por favor)? Yo veo las “marcas de los mechones” pero las nombro correctamente como lo que son, “regueros de sangre”. De la herida, que es una herida lineal de unos 4cm. Aproximadamente (pues su cierre necesitó posteriormente de 4 grapas) la sangre “eligió” 8 ó 9 caminos que tú no quieres llamar “rivulets” o regueros de sangre (y lo son) y quieres llamarlos “marcas de los mechones” (para eludir el nombre de regueros, “rivulets”) Esas “marcas de los mechones” es sangre vehiculizada por el cabello (y no por la piel del cuero cabelludo) que ya ha iniciado la coagulación en su periferia, y varios de ellos han “alimentado”, como regueros, riachelos o “rivulets que son, la sangre que aparece en torno de la oreja y que al acumularse forma nuevos regueros sobre la piel del cuello y de la cara en los que no pueden formar “marcas de mechones” ……..entre otras varias “cosas” por carencia de mechones. 4 “Si, tengo un problema. Que estoy hablando con gente que “ve cosas”.” Creo que el “súmumm” de “ver cosas” es gloria que deben ostentar con pleno derecho los escépticos, capaces de ver en el Hombre de la Sábana una imagen del medievo tardío o del inicio del gótico….(¡con la gran cantidad de imágenes que en general habéis visto!. Me parece “inconcebible”. (“Son of man, thou dwellest in the midst of a rebellious house, which have eyes to see, and see not; they have ears to hear, and hear not: for they are a rebellious house”. Ezequiel 12:12). Michael Baden, al menos, la asociaba más bien a Miguel Angel (Michelangelo Buonarroti, 1475 1564.) Carlos.","date":"2015-01-12","mins":"2:42 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-182531","author":"carlos","post":"David: Usted es INCAPAZ de ver los 8 ó 9 “rivulets” que se inician en la zona lesionada (y algunos llegan hasta la oreja en la fotografía), y sin embargo ve INEXISTENTES “rivulets” en la nuca del Hombre de la Sábana. ¡Un problema! Carlos.","date":"2015-01-11","mins":"5:24 am","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"}]
