[{"id":"comment-168223","author":"carlos","post":"“There is an engraving of one such exposition of 1613 by Antonio Tempesta. He was celebrated for his panoramic view of Rome (1593), which shows the individual buildings of the city in meticulous detail, and he was brought to Turin to work for Duke Carlo Emanuele I (1580 1630). It is an exposition from the height of the Counter Reformation, when the concentration was on drama, with fusillades and the singing of choirs as the Shroud was unfurled before an enthusiastic crowd. My research began with this engraving, as it demonstrated that the original images of the Shroud were much more prominent than they are now. The Shroud would not have made an impact on such large crowds if they had not been. There are features – the Crown of Thorns, the long hair on Christ’s neck, the space between the elbows and the body, the loincloth – that can no longer be seen today. The marks from the fire of 1532 are also clearly evident. Texts describing the Shroud confirm the accuracy of the Tempesta engraving. Two features that are less obvious are the extent of the blood on the body images and the marks of Christ’s scourging or flagellation. We have evidence that these were once prominent. ” Charles Freeman. 1. The engraved “INSPIRATOR” of Antonio Tempesta demonstrates his great ignorance of the Shroud and of the proportions: – the arms cross in the FOREARMS in Tempesta’s engraving. (In the Shroud the arms cross to level of the HANDS). – the legs are separated and the feet DIVERGE in Tempesta’s engraving. (In the Shroud the legs come closer and the feet CONVERGE). – Antonio Tempesta’s “Shroud” that “inspires” Charles Freeman is a very bad copy of the Shroud. Antonio Tempesta made a very bad sense of the proportions: – he was a giant the Man of the Shroud who proves to be Tempesta ó there were dwarf 7 clergymen who were doing the Ostensión?. – all the figures of the first plane are ” anatomical disproportionate “. 2. 2 magnificent copies of Noalejo (1527, Spain) they demonstrate the ” phantasmagoric character “, similar to the current one, of the image of the Shroud. 3. Charles Freeman did not understand Cennini. Cennini’s “gesso” is is a calcium sulfate mineral (Ca SO4·2 H2 O).(Cennini’s “gesso” is not a carbonate of calcium). (en español) 1. El “INSPIRADOR” grabado de Antonio Tempesta demuestra su gran desconocimiento de la Sábanay de las proporciones: Los brazos se cruzan en los ANTEBRAZOS en el grabado de Tempesta. (En la Sábana los brazos se cruzan a nivel de las MANOS). Las piernas están separadas y los pies DIVERGEN en el grabado de Tempesta. (En la Sábana las piernas se aproximan y los pies CONVERGEN). La “Shroud” de Antonio Tempesta que “inspira” a Charles Freeman es una muy mala copia de la Shroud. Antonio Tempesta tenía un sentido de las proporciones muy malo: ¿ Era un GIGANTE el Hombre de la Sábana que muestra Tempesta ó eran ENANOS los 7 clérigos que hacían la Ostensión?. TODAS las figuras del primer plano son “anatómicamente desproporcionadas”. 2. Las 2 magníficas copias de Noalejo (1527, España) demuestran el “carácter fantasmagórico”, similar al actual, de la imagen de la Sábana. 3. Charles Freeman no entendió a Cennini. El “gesso” de Cennini es sulfato de calcio (Ca SO4·2 H2 O).(El “gesso” de Cennini no es carbonato de calcio ). Carlos.","date":"2014-11-03","mins":"9:57 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-13309","author":"carlos","post":"Ante la santa inocencia la…. ¡ la santa ignorancia !. Yo me he referido a que cualquier médico que haya ESTUDIADO la Sábana RECONOCE que se trata de la impronta de un ser humano. Que no se trata de una pintura u otro artefacto. – Y con ESTUDIAR me refiero a que haya visualizado la imagen a TAMAÑO NATURAL, positivo y negativo, y haya dedicado a ello al menos unos cuantos minutos. – El tema de la Sábana Santa, como otros muchísimos diversos temas, no es de conversación habitual en los medios profesionales. En varias ocasiones la casualidad me ha hecho conocer, después de muchos años de ignorarlo, que colegas con los que había trabajado durante muchos años eran magníficos conocedores del tema…. – Si pongo una lista es simplemente porque esos médicos lo han explicitado PÚBLICAMENTE a través de sus escritos. – La especialización y la super especialización son hechos muy recientes en la Historia de la Medicina. Un médico foniatra o un médico pediatra son ante todo MÉDICOS. – Todos los médicos, al menos en España, han estudiado medicina forense. – Los forenses y los anatomistas, en la práctica diaria suelen ser anatomo patólogos, cirujanos o clínicos. Pero la cosa es mucho más SIMPLE y SENCILLA. He querido decir que en los tiempos de HIPÓCRATES un médico griego o un médico egipcio, por poner ejemplos, NO CONFUNDIRÍA una impronta similar a la de la Sábana Santa con una pintura o artefacto similar por muy bien que estuviera realizada. ¿Está clara mi propuesta? Usted es buen conocedor del idioma español castellano, ¿confundiría un texto escrito en OTRO idioma distinto con un texto escrito en español castellano? ¿ tendría usted que ser LINGÜISTA para no confundirse? ¿ se confundiría aunque hubiera errores ortográficos o de sintaxis?..","date":"2012-07-02","mins":"7:40 am","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"id":"comment-13345","author":"carlos","post":"1. Mi propuesta no será clara para usted, pero seguramente será muy clara para muchísimos lectores, sobre todo los de habla hispana, que lean el blog de Dan. 2. He dicho que NO hay que ser médico forense para RECONOCER que es una impronta humana y no es una obra de ARTE u otro artefacto. 3. Su “forense disidente”, Michael Baden, dijo: “From my knowledge of dead bodies, and the wrapping of dead bodies, this kind of transfer never occurs. And blood never oozes in nice neat rivulets, it gets clotted in the hair. The anatomic accuracy is more what Michelangelo would have done in a painting than what actually happens to a body.” – “From my knowledge of dead bodies, and the wrapping of dead bodies, this kind of transfer never occurs.” Cierto, el hecho es tan EXCEPCIONAL que ha justificado precisamente el que muchos científicos y expertos en diferentes disciplinas se hayan interesado por la Sábana de Turín. “The Jospice Mattress Cover Image” es un ejemplo de esa EXCEPCIONALIDAD que seguramente nunca vió Michael Baden. Para Baden es un obstáculo insalvable que condiciona su criterio, para otros muchísimos médicos NO es un obstáculo insalvable y buscan la explicación. – “And blood never oozes in nice neat rivulets, it gets clotted in the hair.” No hay “rivulets” sobre el cabello en las zonas alejadas del cuero cabelludo. Esos “rivulets” sobrepuestos a la imagen frontal corresponden a las MEJILLAS. Las manchas de sangre SÓLO pueden producirse por contacto directo, y la distancia entre los “rivulets” del lado derecho y los “rivulets” del lado izquierdo NO es compatible con la distancia entre el cabello del lado derecho y el cabello del lado izquierdo. – “The anatomic accuracy is more what Michelangelo would have done in a painting than what actually happens to a body.” (debieran tomar nota los que pretenden ver una imagen medieval. La PRECISIÓN ANATÓMICA de la imagen NO es compatible con el arte medieval) Estoy de acuerdo con Michael Baden, se ven en la Imagen más cosas de las que debieran verse en la imagen de un cuerpo humano real, por ejemplo la impronta del ESQUELETO ÓSEO DE LA MANO. 3. He dicho que NO hay que ser médico forense para RECONOCER que es una impronta humana y no es una obra de ARTE. ¡Seguro que usted podrá MOSTRAR alguna pintura medieval que pueda ENGAÑAR o CONFUNDIR a algún médico……..! ¡MUÉSTRELA! 4. ¿Bibliografía? ¿ Confunde usted una relación o listado con una bibliografía? No he puesto ninguna bibliografía. He puesto una relación o listado de médicos que PÚBLICAMENTE reconocen la autenticidad y algún escrito de ellos que facilite al lector interesado su búsqueda en el Google….. 5. La “historia” de los pulgares NO AFECTA al reconocimiento de si “estamos” o “no estamos” frente a una impronta humana, sino a la práctica de la crucifixión. La opinión médica mayoritaria (me refiero obviamente a la de los médicos interesados en el estudio de la Sábana) es la de aceptar la hipótesis de Barbet por muchos motivos, entre ellos el soporte experimental del que es carente la hipótesis de Zugibe. ( carlos, corneliotel, co, el editor es el que hace los cambios, yo me limito a hacer click en el post comment).","date":"2012-07-02","mins":"6:22 pm","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"id":"comment-13365","author":"carlos","post":"¡Su comentario me es ININTELIGIBLE!.","date":"2012-07-03","mins":"4:22 am","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"id":"comment-13385","author":"carlos","post":"Pruebe usted a ENGAÑAR a algún amigo mostrando una imagen medieval ( mejor en blanco y negro para que el color no le haga sospechar el engaño) y dígale que es un ser humano REAL ¡verá la risa que le da!……. He estudiado MUY BIEN a Zugibe y a Barbet. Las hipótesis de Barbet siguen siendo MAYORITARIAMENTE aceptadas, Zugibe NO hizo experimentos REALES de crucifixión, sus simulacros de crucifixión son realmente ridículos, y NO hizo experimentos en cuanto a la introducción del clavo en la mano se refiere. Decir, como dice usted en la Wikipedia que Zugibe “demostró que es imposible que un clavo pasara por el espacio Destot” es una ABERRACIÓN que debiera corregir. Zugibe NO HA DEMOSTRADO NADA…… ¡más que su mala intención hacia Barbet!. Http://lasabanaylosescepticos.blogspot.com.es/2012/02/sobre el espacio de destot y algunas.html y http://lasabanaylosescepticos.blogspot.com.es/2012/03/sobre el espacio de destot y algunas.html (llevo meses resistiéndome a publicar la parte III, lo tendré al final que hacer, porque forzosamente es una crítica muy dura hacia Zugibe) – La explicación de Lavoie es la ÚNICA posible para una Sábana que ha estado en contacto con un cuerpo. Las manchas de la NUCA no ofrecen ningún problema pues la sangre está en contacto inmediato con el cuero cabelludo y sus heridas. La sangre en un cadáver se desplaza hacia la periferia ( los cadáveres pueden “sangrar” pasivamente) y su acúmulo y por lo tanto su presión es mayor en la zona dorsal por efecto de la gravedad. – Yo diría que NADIE ha demostrado que la sangre sea una pintura. Es sorprendente la CARENCIA de crítica al respecto de los escépticos. – Decir que la posición de los pulgares no tiene nada que ver con la crucifixión es un GRAN EXCESO. Si hubiera leído bien a Barbet ( Zugibe NO lo hizo) sabría que la posición retraída de los pulgares la imputa al DOLOR y su posterior fijación por el rigor mortis. – Le agradezco su atención, pero es que su comentario me parecía ininteligible..","date":"2012-07-03","mins":"8:06 am","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"id":"comment-13399","author":"carlos","post":"“Toujours les nerfs des court abducteur, opposant et court fléchisseur, qui se détachent en dehors à ce niveau du médian, étaient intacts. La contraction de ces muscles thénariens, encore vivants comme leur nerf moteur, s’expliquait facilement, par excitation mécanique du nerf médian. Il ne peut donc s’agir de paralysie de ces muscles, comme on l’a prétendue Au contraire, le nerf médian, tendu, dans sa partie externe, motrice, intacte, sur le clou, en recevait une excitation mécanique à chaque mouvement. Le Christ a donc dû agoniser et mourir et se fixer dans la rigidité cadavérique, avec les pouces opposés dans les paumes. Et voilà pouquoi, sur le Linceul, les deux mains vues d’en arrière ne présentent que quatre doigts, pourquoi les deux pouces sont cachés dans les paumes” y “Mais, hélas, les médians ne sont pas seulement des moteurs, ce sont aussi de grands nerfs sensitifs. Blessés et tendus sur les clous, dans ces bras étirés, comme des cordes de violon sur leur chevalet, ils ont dû provoquer des douleurs atroces. Le nerf, partiellement coupé, tendu sur le clou par sa portion intacte, en recevait aussi à chaque mouvement une violente excitation sensitive.” Mi alusión al DOLOR es una crítica a Zugibe, que pretende que el pulgar no podía flexionarse. Pierre Barbet demuestra en sus experimentos que la parte motora del nervio mediano está INDEMNE ( de ella depende el que el pulgar pueda flexionarse) y la parte sensitiva del nervio mediano gravemente LESIONADA ( de ella depende el intensísimo dolor). Con INDEMNE me refiero a que no está SECCIONADA, no a que no esté “excitada” por las graves lesiones contiguas. Con respecto a la sangre, Baden no dijo que fuera imposible, sino que tenían que haber sido lavadas…. Es decir que Baden admite que hay FACTORES que pueden modificar su criterio. Usted no ha podido ver casos similares a los acontecidos en el Hombre de la Sábana.","date":"2012-07-03","mins":"1:28 pm","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"id":"comment-207602","author":"carlos","post":"¡Muy interesante, Max! Carlos.","date":"2015-08-06","mins":"1:41 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"},{"id":"comment-207613","author":"carlos","post":"Max: En las traducciones de Juan: 20 basadas en la Vulgata Latina aparece 3 veces la palabra “VIÓ”. Pero el original griego utiliza 3 verbos distintos: béplei, theórein, eíden Juan 20:5 béplei Juan 20:6 theórein Juan 20:8 eíden ¿Cual es su opinión? Carlos.","date":"2015-08-06","mins":"2:36 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"}]
