[{"id":"comment-208327","author":"carlos","post":"Bueno, Colin, es natural que haya “ojos” por todos los sitios…. Carlos.","date":"2015-08-15","mins":"2:10 pm","url":"https://shroudstory.com/2015/08/15/3d-of-the-day-imprinted-in-a-contact-only-mechanism/","cat":"image_theory","title":"3D of the Day:  Imprinted in a Contact-Only Mechanism?"},{"id":"comment-208361","author":"carlos","post":"Garlaschelli’s hypothesis uses necessarily the red ocher ….. Does he think to add it to the flour in some moment? (en español) La hipótesis de Garlaschelli utiliza necesariamente el ocre rojo…..¿piensa añadirlo a la harina en algún momento? Carlos.","date":"2015-08-16","mins":"5:40 am","url":"https://shroudstory.com/2015/08/15/3d-of-the-day-imprinted-in-a-contact-only-mechanism/","cat":"image_theory","title":"3D of the Day:  Imprinted in a Contact-Only Mechanism?"},{"id":"comment-57627","author":"carlos","post":"Buscar en Google: Sobre el espacio de Destot y algunas cosas más (1) Sobre el espacio de Destot y algunas cosas más (2) Salen los primeros, son post míos con muy buenas radiografíasy otras imágenes (hacer clik para agrandar). Carlos.","date":"2013-12-10","mins":"7:09 am","url":"https://shroudstory.com/2013/12/10/barbets-vs-zugibes-exit-points/","cat":"image_theory","title":"Barbet’s  vs   Zugibe’s Exit Points"},{"id":"comment-208409","author":"carlos","post":"Colin: Conozco bien algunos aspectos de la incidencia de la luz y de la angulación sobre la imagen de la Sábana. Si usted tiene un ordenador portátil que sea “antiguo” podrá observar un fenómeno muy curioso, la transición paulatina de la imagen positiva a la imagen negativa cuando va desplazando (angulando) la pantalla del ordenador hasta la HORIZONTAL. O bien con una “pantalla antigua” de un ordenador de sobremesa, desplazando la pantalla hacia la HORIZONTAL o bien girándola paulatinamente en la VERTICALIDAD. La imagen de la Sábana debe ser en COLOR. Es un ESPECTÁCULO ver como el positivo del rostro se va transformando en negativo….y hay detalles que se hacen más patentes. Las intensidades de los tonos se van modificando gradualmente hasta invertirse, “como si” se cortara la imagen por planos de intensidades….. En las pantallas “modernas” el funcionamiento es distinto y la imagen no ( negación) se altera con las angulaciones. Carlos.","date":"2015-08-17","mins":"4:18 am","url":"https://shroudstory.com/2015/08/15/3d-of-the-day-imprinted-in-a-contact-only-mechanism/","cat":"image_theory","title":"3D of the Day:  Imprinted in a Contact-Only Mechanism?"},{"id":"comment-191548","author":"carlos","post":"Collin: Estoy de acuerdo con su interpretación de las densidades de la imagen TS como IMPRONTAS en su más amplio sentido, señal, marca o huella, y que pueden incluir el mecanismo de una “radiación” desconocida. Son 2 los factores principales que se combinan para producir la IMPRONTA: 1. DISTANCIA entre cada “zona” del cuerpo humano real (soy autenticista) y la Sábana. 2. DENSIDAD de la masa corporal “radiante” en cada zona del cuerpo humano real. Generalizando, las zonas corporales más DENSAS corresponden a las estructuras del esqueleto óseo más cercanas a la Sábana y a las formadas por el pelo (cabello y barba) y las zonas corporales menos DENSAS corresponden a la parte superior de la cavidad torácica hiperextendida y llena de aire por el pneumotorax secundario a la perforación pleural producto de la herida del costado y en el abdomen a los órganos “huecos” llenos de aire (todo el “marco cólico” o sea colon ascencente, transverso y descendente) y al hipogastrio. Carlos.","date":"2015-02-22","mins":"6:25 am","url":"https://shroudstory.com/2015/02/21/colin-berry-stop-calling-the-faint-image-a-faint-image/","cat":"image_theory","title":"Colin Berry:  Stop Calling the Faint Image a Faint Image"},{"id":"comment-199841","author":"carlos","post":"Solamente puede ser lavada, según el ritual judío, la sangre PRE MORTEM. La sangre POST MORTEM, sangre de VOLCADO retenida en las “cavidades” producidas por los clavos, la lanzada o las espinas, y que sale al exterior durante la manipulación del cadáver, y la sangre que REZUME de heridas superficiales pre mortem al ser lavadas, NO (negación) puede ser lavada. En caso de duda de si la sangre es pre mortem o post mortem se permite el lavado de una determinada cantidad de sangre, la contenida en “una copa”….. De la que ignoro la medida exacta. La sangre es muy “aparatosa, y TODA la cantidad de sangre que se observa en la Sábana Santa es MUY POCA, unos pocos mililitros. Carlos.","date":"2015-05-22","mins":"2:57 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199847","author":"carlos","post":"A/ En las heridas que fueron sangrantes de la mayor parte de la superficie corporal, como las debidas a la FLAGELACION, era clara su naturaleza PRE MORTEM. La sangre ya estaba SECA sobre las heridas y “manchaba” la piel “integra” cercana, FUERON PUES LAVADAS. Si rezumaba algo de sangre al lavar alguna de esas heridas era ya sangre POST MORTEM y esa sangre NO (negación) PODÍA SER LAVADA b/ Las heridas PRE MORTEM de las manos habían producido regueros de sangre, ya coagulados, en los brazos. Al ser “desclavadas” las manos volcaron sangre líquida (POST MORTEM) SOBRE los regueros de sangre pre mortem ya coagulada. Los regueros pre mortem coagulados de los brazos, HUMEDECIDOS con esa sangre volcada post mortem NO (negación) PODÍAN PUES SER LAVADOS. C/ La herida POST MORTEM del costado produjo ya en la Cruz el volcado de sangre líquida, coágulos y suero. Al manipular el cuerpo en posición horizontal se produjo un nuevo volcado de sangre líquida que es lo que se observa en la Sábana. Carlos.","date":"2015-05-22","mins":"4:56 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-200051","author":"carlos","post":"“Carlos, ¿puedes explicar la dirección de los regueros de sangre si el cadáver reposaba en “posición horizontal”? Tu punto “c”. Ver https://www.youtube.com/watch?t=227&v=S Nz Vc1 Mq J2s , 2:23ss and 2:34ss. Simplemente imposible.” David: Yo decía en el punto “c” de mi anterior comentario: “c/ La herida POST MORTEM del costado produjo ya en la Cruz el volcado de sangre líquida, coágulos y suero. Al manipular el cuerpo en posición horizontal se produjo un nuevo volcado de sangre líquida que es lo que se observa en la Sábana.” El experimento de Borrini Garlaschelli muestra un profundo desconocimiento de la fisiopatología más elemental. 1. ¿Qué representa o significa esa ENORME ESPONJA empapada de sangre?. La herida de lanza en el costado atravesando el quinto espacio intercostal es una PEQUEÑA apertura “ojival” en comparación con el tamaño ENORME de la superficie “cuadrangular” de la ESPONJA. 2. Cuando Borrini aprieta la ESPONJA contra el costado del “simulador”, proporciona a la sangre una PRESIÓN inexistente en un cadáver en el que la sangre sólo puede “rezumar” (si se humedece) o “volcarse” al exterior de acuerdo con: – la fuerza de la gravedad. Las características del punto/s por las que la sangre encuentre una vía de salida. La vía de salida al exterior de la sangre, la herida de la lanza, puede estar “libre” o puede estar parcialmente “obstaculizada” por coágulos que no han salido al exterior. Dada la diferencia de tiempo que existió entre el momento en que el cadáver recibió la lanzada (en la Cruz) y la manipulación del cadáver (cuando se produjeron los regueros hacia la espalda) se produjeron más y mayores coágulos que dificultarían el “volcado” de la sangre a través de la herida “ojival” de la lanzada. La sangre está presente en la Sábana Santa en cantidades “mínimas”. – El cadáver “no (negación) ha reposado en posición horizontal”, el cadáver “se ha manipulado en posición horizontal”, que son 2 cosas muy diferentes. Y fue en alguna maniobra de esa manipulación cuando se produjo el “volcado”. David, la palabra “imposible” bloquea el intelecto y usted es muy inteligente, en mi modesta opinión debiera prescindir de “ella”. Carlos.","date":"2015-05-24","mins":"5:05 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-200063","author":"carlos","post":"David: Si mi respuesta es irrelevante (usted ME PREGUNTABA sobre el punto “c” de mi comentario) debe ser porque su pregunta es entonces ININTELIGIBLE. Ahora me dice que es sobre la “tesis de que los regueros de sangre se produjeron durante o después del lavado (Zugibe)”. A eso ya respondí en los puntos a y b del comentario de referencia: “May 22, 2015 at 4:56 am Reply a/ En las heridas que fueron sangrantes de la mayor parte de la superficie corporal, como las debidas a la FLAGELACION, era clara su naturaleza PRE MORTEM. La sangre ya estaba SECA sobre las heridas y “manchaba” la piel “integra” cercana, FUERON PUES LAVADAS. Si rezumaba algo de sangre al lavar alguna de esas heridas era ya sangre POST MORTEM y esa sangre NO (negación) PODÍA SER LAVADA b/ Las heridas PRE MORTEM de las manos habían producido regueros de sangre, ya coagulados, en los brazos. Al ser “desclavadas” las manos volcaron sangre líquida (POST MORTEM) SOBRE los regueros de sangre pre mortem ya coagulada. Los regueros pre mortem coagulados de los brazos, HUMEDECIDOS con esa sangre volcada post mortem NO (negación) PODÍAN PUES SER LAVADOS. C/ La herida POST MORTEM del costado produjo ya en la Cruz el volcado de sangre líquida, coágulos y suero. Al manipular el cuerpo en posición horizontal se produjo un nuevo volcado de sangre líquida que es lo que se observa en la Sábana.” ASÍ QUE NINGÚN REGUERO HA FLUIDO HACIA ARRIBA. Carlos.","date":"2015-05-24","mins":"6:41 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-207957","author":"carlos","post":"David: Totalmente de acuerdo. Las manchas de la sangre y la imagen del Hombre corresponden a 2 eventos diferentes en los que la Sábana estaba en 2 posiciones muy diferentes. Por ello la imagen de la Sábana es IRREPRODUCIBLE, porque a nivel de lo sobrenatural las puertas de la Ciencia están cerradas. El Dr.Gilbert Lavoie lo mostró de manera muy fácil y sencilla: http://www.shroud.com/pdfs/ssi20part4.pdf Carlos.","date":"2015-08-11","mins":"6:37 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","title":"It is really, really time to rethink what we think about 3D"},{"id":"comment-207645","author":"carlos","post":"Es muy común entre los escépticos tener graves problemas de INTERPRETACIÓN VISUAL…..y Colin NO (negación) escapa a ello. Las malas imágenes de Broch, Nickel, Garlaschelli presentadas como “casi indistinguibles” de la Sábana de Turín, con el APLAUSO escéptico, es una buena muestra. Colin nos muestra una posición de manos “..roughly as seen on the “Shroud” body image.” ¡Que barbaridad! ¿No verá Colin que en “Hombre de la Sábana” la mano izquierda cruza a la mano derecha a la altura prácticamente de la muñeca y que en su fotografía las 2 muñecas están totalmente “libres”? Se entiende perfectamente su “auto aquiescencia” al resultado de sus experimentos…… Carlos.","date":"2015-08-06","mins":"7:03 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-208030","author":"carlos","post":"Colin: Dr.Judica Cordiglia Prof.Ruggero Romanese Dr.Sebastiano Rodante Father Gaetano Intriguillo El POLVO (de aloe y de mirra) fue utilizado por Judica Cordiglia, Ruggero Romanese y Sebastiano Rodante (todos autenticistas), pero al parecer el POLVO bloquea la transferencia de los coágulos de sangre, por lo que Rodante se decidió por utilizar “cloths soaked in a watery aloe and myrrh solution” obteniendo mejores resultados con la sangre. Http://www.sindone.org/the holy shroud  english /science/00024815 Contact theory.html Carlos PD: Sebastiano Rodante terminó optando por el flash de luz. Trata en este video el tema de la sangre y es probable que su experiencia te sea interesante, yo no(negación) entiendo el inglés hablado..","date":"2015-08-12","mins":"5:19 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","title":"It is really, really time to rethink what we think about 3D"},{"id":"comment-207928","author":"carlos","post":"La propiedad 3 D fue ya descrita por Yves Delage (con Vignon y Colson) en 1902. « Un examen attentif de l’image du linceul permet de reconnaître la loi de sa formation. La voici : l’image est une projection à peu près orthogonale, un peu diffuse, et l’intensité de la teinte en chaque point varie en sens inverse de la distance de ce point au point du cadavre correspondant ; cette intensité décroît très rapidement à mesure que la distance augmente et devient nulle quand celle ci atteint quelques centimètres. « Lettre à M. Charles Richet » “Revue scientifique”, n° 22 du 31 mai 1902, pp. 683 687 http://blog dominique.autie.intexte.net/blogs/index.php/2006/04/21/lettre d yves delage a charles richet Carlos.","date":"2015-08-10","mins":"11:15 pm","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","title":"It is really, really time to rethink what we think about 3D"},{"id":"comment-208063","author":"carlos","post":"Colin, tengo una curiosidad. Crees que podrías realizar tus experimentos sin tener como “muestras” (que te permiten hacer las correcciones oportunas) las fotografías del positivo y negativo de la Sábana Santa? Carlos.","date":"2015-08-12","mins":"9:58 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","title":"It is really, really time to rethink what we think about 3D"},{"id":"comment-208301","author":"carlos","post":"¡Excelente imagen, Colin!.","date":"2015-08-15","mins":"4:00 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","title":"It is really, really time to rethink what we think about 3D"},{"id":"comment-208035","author":"carlos","post":"Hugh: ¿Utiliza el mismo software para la Sábana y para la máscara? Carlos.","date":"2015-08-12","mins":"6:22 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","title":"It is really, really time to rethink what we think about 3D"},{"id":"comment-157372","author":"carlos","post":"Pathetic! Cennini’s “gesso” is not a carbonate of calcium. Cennini’s “gesso” is is a calcium sulfate mineral (Ca SO4·2 H2 O). The gesso was traditionally composed by sulfate of mineral calcium mixed to an animal tail (leather tail). Fragile, it was reserved for the boards and it was revealed little adapted for the painting on fabric. “Modern “acrylic gesso” is a widely used ground[ that is a combination of calcium carbonate with an acrylic polymer medium latex, a pigment and other chemicals that ensure flexibility, and increase archival life. It is technically notgesso at all and its non absorbent acrylic polymer base makes it incompatible with media that require traditional gesso such as egg tempera.” Carlos.","date":"2014-09-28","mins":"2:00 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-207919","author":"carlos","post":"La imagen del post es ABERRANTE, un FALSO 3 D. Parece que la experiencia acumulada sea INÚTIL. Thibaul Heimburger ya publicó en 2005 el magnífico trabajo del ingeniero C.Mignot sobre la verdadera y la falsa 3 D. “De l’aspect tridimensionnel comparé du Linceul de Turin et des faux suaires réalisés expérimentalement” Auteur: Christophe Mignot (ingénieur en sciences physiques, spécialiste du traitement d’image et analyse tridimensionnelle) Date : 22 Août 2005 “L’image du Linceul est une vraie image tridimensionnelle, les deux faux expérimentaux analysés ne le sont quasiment pas. L’image du Linceul de Turin est une vraie image tridimensionnelle. Sa qualité apparaît naturellement, et sans manipulation sur les hauteurs, pour peu qu’on se donne les moyens de supprimer localement les taches, et qu’on retire la trame du tissu par les filtrages linéaires appropriés. Au contraire, les deux faux élaborés présentent une grande pauvreté de niveaux, car leur procédé de fabrication est basé à un moment donné sur une information binaire : soleil OU ombre, contact de la toile OU absence de contact de la toile. Dans le cas de Science et Vie, l’exemple est même navrant. On se donne les moyens de créer un bas relief, c’est à dire une vraie représentation tridimensionnelle, pour en tirer une image qui ne l’est quasiment plus (voir image en 3 D composée presque exclusivement de deux niveaux). Toutefois, CELA NE PROUVE RIEN quand à la capacité de faire un faux 3 D. Le fait que le Linceul soit un vrai 3 D, et les imitations des 3 D médiocres ne prouve rien. Il reste tout à fait possible de faire une VRAIE représentation 3 D à partir d’un bas relief. Il suffit pour cela que l’impression réalisée sur le tissu ne contienne pas une information binaire (contact/absence de contact avec le tissu) mais la distance réelle entre le bas relief et le tissu, une condition qu’ont oublié nos deux faussaires. Http://www.suaire science.com/documents/3 D mignot.pdf Carlos.","date":"2015-08-10","mins":"6:41 pm","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","title":"It is really, really time to rethink what we think about 3D"},{"id":"comment-183558","author":"carlos","post":"“I asked Kitzinger the following question: ‘Can you show me some works of artists who have painted of Turin.’ His response was: ‘The Shroud of Turin is unique in art. It doesn’t fall into any artistic category. For us, a very small group of experts around the world, we believe that the Shroud of Turin is really the Shroud of Constantinople. You know that the crusaders took many treasures back to Europe during the 13th century and we believe that the Shroud was one of them. As for the bloodmarks done by artists, there are no paintings that have blood marks like those of the Shroud. You are free to look as you please, but you won’t find any.’ ” .G.Lavoie [Ernst Kitzinger (1912 2003)] Carlos.","date":"2015-01-15","mins":"3:21 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-157902","author":"carlos","post":"Cennini’s “gesso” is to CALCIUM mineral SULFATE (Ca SO4 · 2 H2 O). It seems that the correct information is not valid for you, Charles. Cennini’s “gesso” is NOT a carbonate of calcium. Carlos.","date":"2014-09-30","mins":"4:29 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-183707","author":"carlos","post":"Charles: ¡Estoy realmente sorprendido de las “barbaridades” que está usted escribiendo! “In his study of the Quem Queritis ceremonies , Karl Young in the 1930s found four hundred accounts of these ceremonies all involving the display of the grave clothes before the congregation ( so there must have been very many more). So we know that at one time hundreds of these clothes existed. But the attrition rate is high. We know of hundreds of documented painted linen cloths in medieval England we do not have a single survivor. So the painter of the Shroud would have had lots of models to draw on. It is is a major mistake to think that because the Shroud is a unique survivor t Hat it was the only one ever made!! The painter would have lots of models, perhaps even a template to copy from. He may even have been making a replacement of one that had decayed.” Vendas, vendas (Clothes, clothes)…..o es que cree que las vendas y las sábanas con imagen (clothes and shrouds) son la misma cosa. Imagino la sorpresa y estupefacción de las asistentes a “su” Quem Queritis”: Angel: “He is not here, He has arisen as He foretold: Go, announce that He has arisen from the grave.”…y el ángel muestra una sábana con la imagen del CUERPO MUERTO DE JESÚS……. [unas vendas (clothes) sugiere AUSENCIA, una sábana (shroud) SIN imagen sugiere AUSENCIA, pero una sábana (shroud) CON imagen sugiere PRESENCIA ] Su propuesta parece más propia de Woody Allen que de Charles Freeman, y creo que está “jugando” con su prestigio. Carlos.","date":"2015-01-16","mins":"5:50 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-184159","author":"carlos","post":"David: Como sé de lo que estoy hablando estuve tentado de “ampliar” el comentario para explicarlo mejor…….. Pero seguiría siendo inútil. El traductor automático de Google Chrome a veces da signos de “inteligencia”, se opone al “desvarío” de Charles Freeman, y tradujo “vendas”. “En su estudio de las ceremonias Quem Queritis, Karl Young en la década de 1930 encontró cuatrocientos cuentas de estas ceremonias todos los que implican el despliegue de las vendas antes de la congregación (lo que debe haber sido muy muchos más). Así que sabemos que en algún momento existieron cientos de estas prendas. Pero la tasa de deserción es alta. Sabemos de cientos de documentados lienzos pintados en Inglaterra medieval no tenemos un solo sobreviviente. Así que el pintor de la Sábana Santa habría tenido un montón de modelos para dibujar. Es es un gran error pensar que debido a que la Sábana Santa es un sobreviviente único que era el único que jamás se ha hecho !! El pintor tendría un montón de modelos, incluso una plantilla tal vez para copiar. Puede que incluso han estado haciendo un reemplazo de uno que había decaído.” Freeman “The International Standard Bible Encyclopedia” expresa: “Greek othonion (diminutive of othone) refers to a linen cloth or bandage used in preparing a corpse for burial (John 19:40; 20:5 7). (deja claro que acepta como correcta la interpretación de “vendas”, bandage) Las Biblias en idioma inglés traducen el giego ὀθόνια del Evangelio de Juan como “linen clothes”. Las Biblias en español traducen generalmente como “lienzos” Pero la “Biblia de Jerusalén”, creo que con excelente criterio, lo traduce como “VENDAS”: (19:40)”Tomaron el cuerpo de Jesús y lo envolvieron en vendas, con los aromas, conforme a la costumbre judía de sepultar”. (20:5)”Se inclinó y vió que estaban las vendas en el suelo; pero no entró”. (6)”Llega tras él Simón Pedro, entra en el sepulcro y ve las vendas en el suelo,(7) y plegado en un lugar aparte, no junto a las vendas, el sudario que cubrió su cabeza”. Siendo tanto en inglés como en español términos plurales (“linen clothes”, “lienzos”, “vendas”) me sorprende que usted, notable escéptico, acepte la interpretación de que las “linen clothes” del Evangelio de Juan fueran piezas de lino alguna al menos con un tamaño suficientemente grande como para contener la doble impronta de Cristo (frontal y dorsal), puesto que Charles Freeman nos cuenta el montón de modelos que el pintor de la Sábana Santa podía haber tenido como modelo. Yo acepto la traducción de vendas, y aunque “el sudario que cubrió su cabeza” pudiera ser una “vaga” referencia a la Sábana Santa, creo que no son precisos 2 milagros (“Resurrección” y “Vestimenta del resucitado”) cuando con 1 milagro es suficiente. Jesús resucitado cubrió su desnudez con la Sábana hasta devolverla al “criado del sacerdote” como traduce San Jerónimo (342 420 d.C): “17. También el evangelio llamado según los Hebreos, traducido recientemente por mí al griego y al latín, del que Orígenes se sirve con frecuencia, después de la resurrección refiere los siguiente: Mas el Señor, depués de haber dado la sábana al criado del sacerdote, se fue hacia Santiago y se le apareció. (Pues es de saber que éste había hecho voto de no comer pan desde aquella hora en que bebió el cáliz del Señor hasta tanto que le fuera dado verle resucitado de entre los muertos). Y poco después: Traed, dijo el Señor, la mesa y el pan. Y a continuación se añade: Tomó un poco de pan, lo bendijo, lo partió y se lo dio a Santiago el Justo, diciéndole: hermano mío, come tu pan, porque el Hijo del hombre ha resucitado de entre los muertos. (De viris ill. 2).” Carlos.","date":"2015-01-17","mins":"9:25 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-184248","author":"carlos","post":"David: Yo conozco perfectamente el Evangelio de Juan, y por lo tanto que la traducción como vendas era la correcta. Ustedes, los escépticos, han repetido hasta la saciedad la inexistente mención de una Sábana en ese Evangelio, manteniendo que eran VENDAS lo que Juan refería. ¿Lo ignora o ha cambiado de opinión para atenerse a la traducción inglesa que proporciona el diccionario de Oxford?. Carlos.","date":"2015-01-18","mins":"5:57 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-184266","author":"carlos","post":"Charles : “Quote from Karl Young, The Drama of the Medieval Church, Oxford, 1933, pp. 134 5. Young was aware of some four hundred different accounts of these Easter ceremonies and the following is based on that: ‘ The dramatic ceremonies at the sepulchre followed the Gospel traditions with considerable freedom, using sometimes a single cloth, called sindo or linteum,sometimes a cloth called sudarium, sometimes several pieces called linteamina, and again both a sudarium and linteamina. These dramatic images may have been in part responsible for the production of painted sudaria which have sometimes been mistaken for authentic relics of the Passion.’” Usted ha interpretado con mucho “exceso” las palabras de Karl Young….. Mostrar un lienzo mortuorio con la imagen de Jesús en el drama litúrgico “Quem Quaeritis”, como usted mantiene, sería el MEJOR TESTIMONIO de que se conocía y aceptaba la existencia de una auténtica Sábana mortuoria con la imagen de Jesús……. Carlos.","date":"2015-01-18","mins":"7:46 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-184167","author":"carlos","post":"Colin: El texto francés es: “C´est la rice syndont et noble Suaire acheté par Joseph d´Arimathie, long de seize à dixsept pieds, large de sept pieds ou environ, où il l´ensepvelist avec Nycodesme quand ils le eurent ostet de la croix. On le voidt clérement ensanglenté du trés précieux sang de Jhesus, nostre Rédempteur, comme se la chose avoit esté faicte aujourd´hui. On y voidt l´imprimure de tout son trés sainct corpz, teste, viaire, bouce, yeulx, nez, corps, mains, pieds et ses chinq playes: espécialement celle du costé, longue environ d´ung bon demi piedt, est fort ensanglentée; et de l´autre part, comme il estoit couvert et redoublé dudict linchoel, on voidt le vestige et figure de son dos, teste, chevelure, coronne et espaules. Et pour esprouver se c´est la mesme, on l´a boulit en huile, bouté en feu et buet par pluseurs fois; mais on n´a peut affachier ne oster la dicte imprimure et figure.” (Texto tomado de La Sábana Santa de Turín. Estudio científico histórico crítico. Modesto Hernández Villaescusa. Ed: Imprenta de Henrich y Ca. Barcelona, 1903. Págs. 229 230) Carlos.","date":"2015-01-17","mins":"10:11 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-186101","author":"carlos","post":"“Manos negras”? Los investigadores de la Sábana (pro autenticidad y anti autenticidad) debieran tomar el acuerdo de hacer un documento público dirigido al Papa en aras de “clarificar” la reliquia más importante de la cristiandad. Carlos.","date":"2015-01-25","mins":"3:43 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers"}]
