[{"id":"comment-40009","author":"carlos","post":"No se necesita un telar de 4 pedales para realizar la sarga 3:1, sino de 4 “lizos” o “lisos”, Los lizos o lisos eran manejados manualmente por varios operarios independientes del “tejedor”. La introducción de los pedales supuso la mejora “mecánica” del telar pues permitía manejar los lizos por el “tejedor” sólo, sin necesitar el trabajo de otros operarios. Carlos Otal.","date":"2013-07-29","mins":"4:31 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","title":"And the problem is a four-pedal loom?"},{"id":"comment-47452","author":"carlos","post":"Dr. Diaz: Le felicito por su valentía y estoicismo al defender sus trabajos pese a su “apariencia ficcional”, en exclusiva relación con la Sábana Santa. ¿Conoce las magníficas imágenes 3 D de la Sábana del geofísico Thierry Castex? http://thierrycastex.blogspot.com.es/ Las imágenes de sangre y las imágenes de hematomas consecuentes a la flagelación parecen tener unos patrones morfológicos que se me hacen “extraños”. Soy médico. Un cordial saludo Carlos Otal.","date":"2013-10-14","mins":"4:49 am","url":"https://shroudstory.com/2013/10/12/in-a-peer-reviewed-scientific-journal/","cat":"news_&_views","title":"In a peer-reviewed scientific journal"},{"id":"comment-40014","author":"carlos","post":"El experto textil F. Lopez – Amo, de la Universidad Politécnica de Catalunya, escribe en “ESTUDIO TÉCNICO TEXTIL DE DOS PIEZAS SINGULARES DE LA ARQUEOLOGÍA PALEO CRISTIANA: LA SINDONE DE TORINO Y EL SUDARIO DE OVIEDO [Parte 1ª] ·)” “Su textura o ligamento es una sarga de cuatro (3e1), como se representa en el histograma de la Figura 4, en unas semi fajas longitudinales, y otra sarga de cuatro en sentido inverso (1e3), Figura 5, en semi fajas alternadas con las anteriores, de manera que forman la sarga a punta y retorno de la Figura 6, generalmente conocida como “espiga” (“chevron” en francés, “spina di pesce” en italiano, y “brokentwill”o “herring bone” en inglés).” “Estos tejidos de sarga en espiga y sus derivados a cuadros o rombos (“losange” en francés) son conocidos desde la Edad del Hierro (5000 a 2000 a. J.C.) cuando menos, aunque casi siempre los más antiguos son tejidos de lana.” Carlos Otal.","date":"2013-07-29","mins":"4:54 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","title":"And the problem is a four-pedal loom?"},{"id":"comment-24795","author":"carlos","post":"Ron: The Prophecy of the Popes (Latin: Prophetia Sancte Malachiae Archiepiscopi, de Summis Pontificibus) is a series of 112 short, cryptic phrases in Latin which purport to predict the Roman Catholic popes (along with a few antipopes), beginning with Pope Celestine II. The alleged prophecies were first published by Benedictine monk Fra Arnold de Wyon in 1595. Wyon attributes the prophecies to Saint Malachy, a 12th‑century Irish Archbishop of Armagh. 112. “Peter the Roman, who will pasture his sheep in many tribulations, and when these things are finished, the city of seven hills will be destroyed, and the dreadful judge will judge his people. The End”. Carlos Otal.","date":"2013-02-19","mins":"5:33 am","url":"https://shroudstory.com/2013/02/17/in-the-running-for-pope/","cat":"news_&_views","title":"In the running for pope?"},{"id":"comment-202380","author":"carlos","post":"“If you lie on the ground and hold that position you will not also be able to cross your hands in the front. “ Es la cosa MÁS ESTÚPIDA que se haya escrito sobre la TS y su gran éxito entre los escépticos abre muchos interrogantes mentales. La leí por vez primera en artículo del escéptico Hernán del Toro en la revista del CSICOP “Pensar” hace varios años: “ Cualquier persona que quiera simular la posición del supuesto”cadáver”, puede hacer lo siguiente: acostarse en el SUELO boca arriba, dejar reposar los codos sobre el suelo, tomar una de las muñecas con la otra mano, Y SIN DESPEGAR LOS CODOS DEL SUELO, tratar de ocultar los genitales… lograr esta posición es tan imposible como morderse el codo.” (las mayúsculas son mías) Como todos los “mortales” (sin malformación del brazo) pueden alcanzar sus genitales cuando están tumbados sin el mínimo problema, las condiciones SINE QUA NON para realizar la estúpida propuesta son: 1. Estar sobre una superficie totalmente PLANA. 2. REPOSAR y FIJAR los codos sobre dicha superficie PLANA. Es sorprendente que Charles Freeman la exprese. Carlos.","date":"2015-06-16","mins":"1:59 pm","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","title":"Of People Who Drink Medicinal Wine from a Teaspoon"},{"id":"comment-96119","author":"carlos","post":"“…….but if the blood was simply applied by a forger, why is it so red?” This it is a MAGNIFICENT question! Carlos.","date":"2014-04-03","mins":"7:37 am","url":"https://shroudstory.com/2014/04/03/more-on-the-y-crucifixion-with-pictures/","cat":"news_&_views","title":"More on the “Y” Crucifixion with Pictures"},{"id":"comment-184510","author":"carlos","post":"Creo que las generalizaciones son muy peligrosas. Juntar en un mismo paquete el “Quem Quaeritis” (un tropo cantado, en gregoriano generalmente) con sus derivados, “Dramas sacros” y “Misterios” da lugar a confusiones. La ceremonia descrita en ” Dissertation sur le Saint Suaire de Besançon” pertenece a los “MISTERIOS” (“Ce ne fut bientót qu´un spectacle frivole et de pure curiosité”, escribe Bergier). Y falta justamente en esa ceremonia “teatral” el texto esencial que da el nombre al “Quem Quaeritis”: “Quem quaeritis in sepulchro, o Christicolae? Jesum Nazarenum crucifixum, o caelicolae. Non est hic; surrexit, sicut praedixerat. Ite, nuntiate quia surrexit de sepulchro” El texto que cita Bergier en el “Misterio” que describe es: “Dic nobis, María,quid vidisti in viá? Sepulcrum Christi viventis et gloriam vidi resurgentis, angelicos testes, sudarium et vestes Surrexit Christus spes mea, etc” “Innocent III in 1210, if he did not condemn them altogether, condemned their abuse, her synods forbade priest holding “theatrical plays” in the church buildings.” History of the Christian Church, Volume V: The middle Ages. A.D. 1049 1294. Philip Schaff. Así que es MUY DUDOSO que la Sábana de Besançon fuera alguna vez utilizada en el “Drama litúrgico”, en el “Drama sacro” o en los “Misterios” y MUY PROBABLE que fuera utilizada SOLAMENTE para las ostensiones, según la iconografía que de ella tenemos con la presencia de clérigos. Carlos.","date":"2015-01-19","mins":"7:28 am","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","title":"Ponderable for Today"},{"id":"comment-206795","author":"carlos","post":"Max: Y luego leemos que las imágenes obtenidas por Nickel, Garlaschelli, etc,etc, son CASI INDISTINGUIBLES de las de la Sabana Santa. ¿Pareidolia o “empanada mental”? Carlos.","date":"2015-07-28","mins":"2:31 pm","url":"https://shroudstory.com/2015/07/28/posting-for-a-slow-news-day/","cat":"uncategorized","title":"Posting For a Slow News Day"},{"id":"comment-123844","author":"carlos","post":"Dan: I asked him that was publishing the image of Sanlucar de Barrameda’s Shroud: http://lasabanaylosescepticos.blogspot.com.es/ ….which shows in positive what it appreciates in the Shrouds of Noalejo (does it know them?), Xabrega and Lier. Is not he interested in them? Carlos.","date":"2014-05-23","mins":"11:11 pm","url":"https://shroudstory.com/2014/05/23/upcoming-shroud-com-update-mailing-list-reminder-as-well/","cat":"news_&_views","title":"Upcoming shroud.com Update. Mailing List Reminder As Well."},{"id":"comment-184558","author":"carlos","post":"Hugh: Está muy claro que fueron OSTENSIONES las que se realizaron en Saint Etienne. “Encore un coup telle fut la première ostention de notre saint suaire. Elle attiroit pourtant les regards du peuple qui aime naturellement les représentations, et celle ci excitoit tellement sa dévotion qu´on dit que l´église de Saint Etienne se trouva par la suite trop étroite pour le tout contenir. Cependant cette repréentation fut supprimée par la suite. Cést même quelques uns disent que le saint suaire a été quelque temps inconnu, et ce ne fut que pour suppléer à cette cérémonie et pour satisfaire à la dévotion des peuples, qu´en l´an 1522 on bâtit prés de légise Saint Etienne une estrade de bois, d´oú on le montroit seulement le jour de Pâques. Et l´an 1549, e chaitre assemblé fit un nouveau réglement pour le montrer encore le dimanche dans l´octave de l´Ascensionn. Cést tout ce qui est resté dès lors de la représentation de Pâques.” Bergier Carlos.","date":"2015-01-19","mins":"11:43 am","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","title":"Ponderable for Today"},{"id":"comment-123847","author":"carlos","post":"(en español….¡mi inglés es deprimente!) Dan: Le pedí que publicara la imagen de la Sábana de Sanlúcar de Barrameda: http://lasabanaylosescepticos.blogspot.com.es/ ….que muestra en positivo lo que se aprecia en las Sábanas de Noalejo (¿las conoce?), Xabregas y Lier. ¿No está interesado en ello? Carlos.","date":"2014-05-23","mins":"11:23 pm","url":"https://shroudstory.com/2014/05/23/upcoming-shroud-com-update-mailing-list-reminder-as-well/","cat":"news_&_views","title":"Upcoming shroud.com Update. Mailing List Reminder As Well."}]
