[{"id":"comment-114548","author":"piero_as_piezonuclear_zealot","post":"I have read the interesting intervention and the wrong phrases written by Yannick : I tried to expressed In my opinion this is an incorrect English language instead of : “I tried to express” – to proved the image was not the result … In my opinion this is an incorrect English language instead of : “to prove the image was not the result …” — — But the ideas on energy of our dear friend Napo Yannick are clearly expressed … (Sorry… I nicknamed Yannick Napoleon because, often, several errors appear in my messages on this blog and then I tried to undramatize …). Then (in my opinion) a careful control about the heat transfer on linen fibrils is of paramount importance. And a COMSOL model will be useful. Do you agree on that very simple remark/suggestion ? — — In any case I don’t believe that Rogers was able to prove the lack of supernatural process. He had very few linen material at disposal… The questions about the lack of image behind the knees and feet area worth to be deepened. B.T.W. : What are the exact ideas about the linen draping over the corpse laid in rigor mortis ? Where is the (presumed) heat flux discontinuity ? If we have the human body model (like the remarkable sculpture by Mattei) at disposal these missing parts will be more simple to discuss and (perhasps) to understand … Post mortem temperatures and Computer Model. The bio heat transfer problems can be solved using the bio heat transfer model. Do you know the bioheat equation, the Fourier’s law and the different kind of thermal conductivity of tissues ? Thermal infrared images obtained using a plastic dolly /mannikin (= corpse model) filled with relatively hot water (20 14 Celsius ???) can be used to verify the inherent claims … Then see also the question about the improved body segmentation (with detailed segments and temperature profiles). Verify what wrote Arpad Vass in the past about the decomposition chemistry and the bacterial metabolism (metabolic heat source in a dead body… hmmm … perhaps this is very low) and the possible news (measurements about the exact amount of heat transfer rate at skin surface expressed as W/[squared m], evaporative heat transfer rate expressed as W/[squared m], evaporative heat loss, etc. …) … — — And at the end … here a vague reference : COMSOL – Introduction to Heat Transfer Module (VERSION 4.3) Copyright 1998–2012 COMSOL The Medical Technology section in the Model Library introduces the concept of bioheating… See at page 9 (of 38) of that document. Http://www.comsol.com/model/download/142935/Introduction To Heat Transfer Module.pdf >The Bioheat Transfer interface is a dedicated interface for heat transfer in living (!!!!) tissue. The bioheat model described in this interface has been verified for different types of living (!!!!) tissue.. (at page 12 (of 38) of that document)..","date":"2014-05-08","mins":"7:59 am","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","title":"To Yannick on Science and Philosophy"}]
