[{"id":"comment-103192","author":"piero_as_piezonuclear_zealot","post":"Discussing on Earth’s Crust… Geologic events and Steno : “… he became fascinated with the layered limestone strata of Italy. He made major discoveries in crystallography, particularly quartz. Steno was the first to realize that the Earth’s crust contains a chronological history of geologic events … etc. …” So … in our times… What is the new idea ? Have you read the article by Carpinteri, Lacidogna, Manuello and Borla on Earth’s Crust ? Evidence of piezonuclear reactions: From geological and tectonic transformations to neutron detection and measurements Experimental Mechanics on Emerging Energy Systems and Materials, Volume 5 Conference Proceedings of the Society for Experimental Mechanics Series 2011, pp 41 48 Link : http://link.springer.com/chapter/10.1007%2 F978 1 4419 9798 2 6 Abstract >Neutron emission measurements, by means of helium 3 and neutron bubble detectors, were performed on solid specimens during three different kinds of mechanical tests: compression tests under displacement control, under cyclic loading, and by ultrasonic vibration. The material used for the tests was Green Luserna granite. Since the analyzed material contains iron, our conjecture was that piezonuclear fission reactions involving fission of iron into aluminum, and of iron into magnesium and silicon, should have occurred during compression damage and failure. It is also interesting to emphasize that the present natural abundances of aluminum (~8%), and silicon (28%) and scarcity of iron (~4%) in the continental Earth’s crust should be possibly due to the piezonuclear fission reactions considered above. And then, see also : Geomechanical and Geochemical Evidence of Piezonuclear Fission Reactions in the Earth’s Crust A. Carpinteri, A. Manuello Politecnico di Torino, Department of Structural Engineering & Geotechnics, Corso Duca degli Abruzzi 24, 10129 Torino, Italy Strain 11/2011; 47(s2):267 – 281. Abstract >Piezonuclear reactions, which occur in inert and non radioactive elements, are induced by high pressure and, in particular, by brittle fracture phenomena in solids under compression. These low energy reactions generally take place in nuclei with an atomic weight that is lower or equal to that of iron (Fe). The experimental evidence, obtained from repeatable measurements of neutron emissions [Strain 45, 2009, 332; Strain (in press); Phys. Lett. A. 373, 2009, 4158], can be also recognised considering the anomalous chemical balances of the major events that have affected the Earth’s crust, oceans and atmosphere, over the last 4 billion years. These anomalies include (i) abrupt variations in the most abundant elements in correspondence with the formation of tectonic plates; (ii) the ‘Great Oxidation Event’ (2.7–2.4 billion years ago), with a sharp increase in atmospheric oxygen and the subsequent origin of life; (iii) the current climate acceleration partially because of ‘carbon pollution’. Natural piezonuclear reactions are induced by fault sliding and plate subduction phenomena. Here another title : Reply to “Comments on ‘Geomechanical and Geochemical Evidence of Piezonuclear Fission Reactions in the Earth’s Crust’ by A. Carpinteri and A. Manuello” by U. Bardi and G. Comoretto It was the answer by Alberto Carpinteri and Amedeo Manuello … Abstract >In the paper entitled “Comments on ‘Geomechanical and Geochemical Evidence of Piezonuclear Fission Reactions in the Earth’s Crust’ by A. Carpinteri and Manuello” by U. Bardi and G. Comoretto, the authors criticise the hypothesis based on piezonuclear reactions for the interpretation of the compositional evolution of the Earth’s crust. We report a detailed reply of how the traditional theories, used by the authors of the comments, are obviously inadequate to describe this new kind of nuclear phenomena. Only very recently, independent authors proposed a theoretical model explaining the anomalous energy emissions in the form of neutrons, involved in piezonuclear reactions, during fracture of nonradioactive rocks. It is also known how the evidences that Bardi and Comoretto claim to be non existent could be found in many independent works that appeared in most important journals about unexplained questions of the Earth’s crust and environment. The data reported in the original work and the details included in this reply show that it is incorrect to consider impossible or simply to ignore the existence of unexplained phenomena only because they cannot be described by traditional models and conventional theories. Link : http://www.researchgate.net/publication/259556161 Reply to Comments on Geomechanical and Geochemical Evidence of Piezonuclear Fission Reactions in the Earth%27s Crust by A. Carpinteri and A. Manuello by U. Bardi and G. Comoretto Unfortunately, until now, I have not yet see the use of SSNTD (= solid state nuclear track detector) during the experiments … or the AFM images of stones before and after piezonuclear reactions … Carpinteri used only FESEM = Field Emission Scanning Electron Microscope. Link : http://staff.polito.it/alberto.carpinteri/papers/CARPINTERI 2012 N.683 EM.pdf See at p. 11 of 21 (= FESEM for quantitative elemental analyses) and see also at p. 13 (of 21). Then, here the possible title about the inherent study : Atomic force microscopy study of several stone surfaces, before and after piezonuclear reactions. But we have to investigate two ideas 1) that neutron emissions from an ancient earthquake that rocked Jerusalem could have created the iconic image, 2) … and messed up the radiocarbon levels ….","date":"2014-04-24","mins":"8:47 am","url":"https://shroudstory.com/2014/04/24/ridiculous-quote-for-today/","cat":"quotations","title":"Ridiculous Quote for Today"}]
