[{"title":"\nFour proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)\n","post":"\n\nHi Steve,I've been having a look at your articles on the Shroud, which are highly persuasive. I just have one question. Over at http://subversivethinking.blogspot.jp/search/label/Shroud%20Of%20Turin there's a reconstruction of Jesus' face (from the History Channel) which looks very different from yours. Which one's right?Best wishes,Vincent Torley\n\n","author":"vjtorley","date":"March 20, 2012 at 6:51 AM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","site":"moore"},{"title":"\nFour proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)\n","post":"\n\nVincent,>I've been having a look at your articles on the Shroud, which are highly persuasive. Thanks.>Over at http://subversivethinking.blogspot.jp/search/label/Shroud%20Of%20Turin there's a reconstruction of Jesus' face (from the History Channel) ...Thanks for the link.>which looks very different from yours.The face of the Shroud I posted above is from ShroudScope (Face Only Vertical) which is based on high resolution digital photgraphs of the Shroud in 2002.>Which one's right?The ShroudScope image I posted is an actual photograph of the Shroud, what a visitor would have seen when the Shroud was last exhibited in 2010.The Discovery Channel image appears to be an artistic reconstruction, which is based on earlier photographs of the Shroud. So its like asking \"Which one's right\" between a photograph of a person and a painting of the same person. Personally I would always prefer an actual high-resolution photograph of a person over a painting of the same person, no matter how skilled the artist was.Stephen E. Jones\n\n","author":"Stephen E Jones","date":"March 20, 2012 at 4:40 PM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","site":"moore"},{"title":"\nFour proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)\n","post":"\n\nHi Steve!I'd never been able to make out the square with open top or the triangle underneath it before, but I just realized that's because I've always been looking at the contrast-enhanced negatives of the Shroud, which actually obscure those details. On the original image (which of course is what 6th to 12th century artists would have seen) they're as clear as day!And you're right. The repeated, uncanny reproduction of such details, which are the result of flaws in the cloth rather than part of the actual image that's on it, demonstrates, all by themselves and beyond a reasonable doubt, that the Shroud existed at that time.\n\n","author":"The Deuce","date":"March 21, 2012 at 9:43 PM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","site":"moore"},{"title":"\nFour proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)\n","post":"\n\nThe Deuce>I'd never been able to make out the square with open top or the triangle underneath it before, Same for me.>but I just realized that's because I've always been looking at the contrast-enhanced negatives of the Shroud, which actually obscure those details. I had been trying to get a picture of the Shroud's \"topless square\" zeroing in on it using ShroudScope in high magnification, when I realised I could see it better just looking at the Face Only Vertical image.  >On the original image (which of course is what 6th to 12th century artists would have seen) they're as clear as day!And if the Shroud background colour is slowly catching up with that of the Shroud image as the Shroud's linen ages (since the image is due to accelerated aging of some topmost fibrils), then the image would have been even clearer in the past.>And you're right. The repeated, uncanny reproduction of such details, which are the result of flaws in the cloth rather than part of the actual image that's on it, demonstrates, all by themselves and beyond a reasonable doubt, that the Shroud existed at that time.Agreed. People get convicted, or have civil damages awarded against them, in courts of law all over the world, every day, on the same sort of circumstantial evidence.So my point which I posted in my first post of this series is that:\"... the AD 1260-1390 medieval radiocarbon date of the Shroud simply has to be wrong. The only question now is: how did the three radiocarbon laboratories get it so wrong? The ball is now in the Shroud anti-authenticist court to try to find a face-saving answer. The The pro-authenticity side no longer have to provide an answer since it no longer is (if it ever was) their problem. The 16th century invisible reweave theory is a possible explanation, among many, of how the radiocarbon labs got it wrong. If ... and his Shroud anti-authenticist ilk don't like that explanation, then let him/them find another. It's now his/their problem, not ours!\"Stephen E. Jones\n\n","author":"Stephen E Jones","date":"March 22, 2012 at 4:25 AM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","site":"moore"},{"title":"\nFour proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)\n","post":"\n\nHow can people cling on too and repeatedly use the 1988 c14 dating as proof or evidence for the Shroud being medieval?The anti-authenticists cling to it because it's pretty much the only thing they have to cling to. Everything else about the Shroud presents only problems for them.\n\n","author":"The Deuce","date":"March 22, 2012 at 8:10 PM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","site":"moore"},{"title":"\nFour proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)\n","post":"\n\nAnonymous>Zeroing in on the radiocarbon dating ... How can people cling on too and repeatedly use the 1988 c14 dating as proof or evidence for the Shroud being medieval? The answer is simple: because they don't personally want Christianity to be true. Therefore like a drowning man clutching at a straw to stop him going under, the Shroud `sceptic' (i.e. true believer in the Shroud's inauthenticity) clings to whatever shreds of evidence he can find, that the Shroud is a fake.>When it is common knowledge (or I thought), that raidocarbon dating is not only NOT infallible but actually prone to errors??. To paraphrase the agnostic, but pro-Shroud, Prof. Yves Delage, \"If, instead of Christ, there were a question of some [other] person\":\"If, instead of Christ, there were a question of some person like a Sargon, an Achilles or one of the Pharaohs, no one would have thought of making any objection ... I have been faithful to the true spirit of science in treating this question, intent only on the truth, not concerned in the least whether it would affect the interests of any religious party ... I recognize Christ as a historical personage and I see no reason why anyone should be scandalized that there still exist material traces of his earthly life.'\" (Walsh, J.E., \"The Shroud,\" 1963, p.107).the 1988 \"medieval\" radiocarbon date of the Shroud would have been set aside as unlikely to be correct, because  of all the other evidence that the Shroud dates back to at least the sixth century.>Also when one considers the 'assumptions' that are made in the process of the dating such as assuming c14 production has been relatively equal over periods of time. The main problem of C14 dating is the assumption that no new carbon has been gained and no original carbon has been lost. But the C14 labs have no way of knowing that. The three C14 labs did check that the C13/C14 ratio was constant but that only tells them there has been no C14 only added and/or lost. It does not tell them if there has been new carbon (i.e. C12, C13, and C14 together) added and/or old carbon lost.For example, if a medieval repair was part of the cloth dated, the C14 labs could not tell that, because it would contain C12, C13 and C14 in the same proportion as a 2,000 year old linen Shroud.>Furthermore the fact that actually only one test was performed, not actually three as the sample was from one area of the cloth and not from various locations as it should have been. When I did Ecology in my Biology degree, we were told that samples from an area were not statistically valid unless they were taken randomly from different parts of that area and in sufficient quantity. A tiny postage-size sample taken from a deliberately chosen bottom corner of a 1.4 x 1.1 metre cloth, because it was already damaged there, is not a statistically valid sample.[continued]\n\n","author":"Stephen E Jones","date":"March 22, 2012 at 9:20 PM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","site":"moore"},{"title":"\nFour proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)\n","post":"\n\n[continued]>Point is are people so gullible or ignorant of the limitations of RC dating or have they been 'duped' into believing so? I am at a loss in understanding this ignorance.See above on clinging to faith that Christianity is not true. The alternative would require a major upheaval of their lives, with the likely loss of non-Christian family and friends.Here is a quote from Joe Marino's book that I was read a few days ago, on, which points out that \"in a real sense, the Shroud is more important for skeptics than it is for Christians\":\"Skeptics who deny the authenticity of the Shroud are often atheists, and many of these atheists are in the forefront of Shroud opposition. They are not willing to acknowledge the possibility of the supernatural and find it safer to dismiss the Shroud as a forgery, even when it flies in the face of all the evidence. Quite simply, the reality of the Shroud and its possible ramifications scares them. They know that an authentic Shroud of Turin puts their atheism on shaky ground. A comment by a bishop to one such skeptic really puts the whole significance of the Shroud in perspective. The bishop told him, `If the Shroud turned out to be 2,000 years old, it wouldn't really affect my faith, but it might affect yours'. Thus in a real sense, the Shroud is more important for skeptics than it is for Christians. It penetrates to their deepest philosophical levels.\" (Marino, J.G., \"Wrapped up in the Shroud,\" 2011, p.272). Stephen E. Jones\n\n","author":"Stephen E Jones","date":"March 22, 2012 at 9:20 PM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","site":"moore"},{"title":"\nFour proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)\n","post":"\n\nHi again Steve,I don't know why my post on C-14 didn't show up in full, anyways no matter I've noticed alot of gremlins lately when posting...back to the subject of carbon-dating; I was aware of Delage's quote and I find it one of the best ever, so thanks for posting it. My point on the RCdating also goes a little further in that I very rarely hear Shroud defendings using it in defense of the Shroud when it is an important question. That is what bothers me I guess, that it is a good question to ask the skeptics on RDdating and to hear their response...They seem to believe RDdating is infallible, and cannot be questioned, even from the more educated of the bunch. Yet 20 some years later it is still being used as 'evidence', truly it is disheartening to see this kind of disillusion. Thanks for listening.\n\n","author":"Anonymous","date":"March 23, 2012 at 4:31 AM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","site":"moore"},{"title":"\nFour proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)\n","post":"\n\nThe Deuce>The anti-authenticists cling to it because it's pretty much the only thing they have to cling to.That and Bishop of Troyes Pierre d'Arcis' 1389 draft memorandum to the Pope claiming that his predecessor 34 years ago knew the artist who had \"cunningly painted it.\" However: 1) the Shroud image is not painted; 2) there is no other evidence that d'Arcis' predecessor, Bishop Henri of Poitiers, claimed the Shroud was a painting; and 3) d'Arcis' memo is just a draft-no original of it has ever been found in either the Troyes diocesan archives or the Pope's, so it may never have been sent. >Everything else about the Shroud presents only problems for them.Agreed, and even those two items in the `sceptics' favour have major problems.Which only goes to show that the Shroud anti-authenticity case is extremely weak, and only is kept on life-support because the alternative, that the Shroud is what the overwhelming preponderance of the evidence points to it being: the very burial sheet of Jesus, bearing the image of His crucified and resurrected body is unacceptable to the `sceptics' because it would mean they would have to change their personal non- (or even anti-) Christian philosophy and lifestyle.Stephen E. Jones-----------------------------------Comments are moderated. Those I consider off-topic, offensive or sub-standard will not appear. Each individual will usually be allowed only one comment under each post. Since I no longer debate, any response by me will usually be only once to each individual under each post.\n\n","author":"Stephen E Jones","date":"March 23, 2012 at 7:47 AM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","site":"moore"},{"title":"\nFour proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)\n","post":"\n\nAnonymous>I don't know why my post on C-14 didn't show up in full, anyways no matter I've noticed alot of gremlins lately when posting...I just realised that your comment did not appear. I must have hit the Delete button instead of Publish by mistake. I get emailed a copy of proposed comments, whether they get published or not, so I probably copy and pasted that to Comments and used it as the basis of my reply. My apologies.>back to the subject of carbon-dating; I was aware of Delage's quote and I find it one of the best ever, so thanks for posting it. Yes. It is very significant because it shows that even back in the 1900s the objective, scientific evidence that the Shroud is authentic was so strong that Yves Delage, an agnostic Professor of Anatomy at the Sorbonne, France's leading university, read a paper in favour of the Shroud being Jesus' before the French Academy of Science!  >My point on the RCdating also goes a little further in that I very rarely hear Shroud defendings using it in defense of the Shroud when it is an important question. I don't seem to have blogged specifically on the many problems with the  radiocarbon dating of the Shroud. But there are Web pages on it, e.g. \"The Story Behind The Shroud of Turin And the Carbon Dating Debacle.\" In a  message to my now shut down CreationEvolutionDesign Yahoo discussion group, I had only just read Stevenson & Habermas' 1981 book, \"Verdict on the Shroud\" and I had not before then heard  that the Shroud had been radiocarbon dated as \"medieval\" in 1988. But I responded with arguments that occurred to me, some of which I have not yet read elsewhere in the Shroud literature:[continued]\n\n","author":"Stephen E Jones","date":"March 23, 2012 at 9:05 AM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","site":"moore"},{"title":"\nFour proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)\n","post":"\n\n[continued]-----------------------------------Re: 1. Turin shroud older than thought -- NOTFri Jan 28, 2005 4:48 am Stephen E. Jones[...]It seems to me that there are at least three essential assumptions of radiocarbon dating this Shroud: 1) that the sample originally contained the normal background ratio of C-14 to C-12; 2) it has not been contaminated by younger material; and 3) there has been no additional neutron source that would be creating C-14 from N-14 in the Shroud.But all three assumptions seem problematic: 1) the original flax could have come from an area of higher background radiation, meaning there was a higher ratio of C-14 over C-12 than normal; 2) it his highly likely that over hundreds if not thousands of years, the linen has been invaded by bacteria, nematodes, fungi and other microorganisms that were themselves younger than the original linen and so would make the sample appear younger. Organic preservatives applied to the linen and absorbed by it would also reduce the radiocarbon age; and 3) Stevenson & Habermas mention that the Shroud has been for much of its history stored in vaults in castles and monasteries. If those vaults were stone and those stones contained uranium and uranium decay products (which is likely), then they would be a source of neutrons that would have had the effect of reducing the Shroud's radiometric age.This is not to discredit radiocarbon dating generally, but it is to point out the precariousness of relying on radiocarbon dating of *one* sample (i.e. the Shroud), and then using it to trump all other evidence.[...]-----------------------------------Maybe at the end of my current series I will write a blog post outlining problems with the \"medieval ... AD 1260-1390\" radiocarbon date of the Shroud. >That is what bothers me I guess, that it is a good question to ask the skeptics on RDdating and to hear their response...They seem to believe RDdating is infallible, and cannot be questioned, even from the more educated of the bunch. Yet 20 some years later it is still being used as 'evidence', truly it is disheartening to see this kind of disillusion. It doesn't dishearten me when I see that opponents of the Shroud's authenticity resort to weak evidence and arguments such as the 1988 \"medieval\" radiocarbon dating! To the contrary, I am heartened by it, because it shows they have nothing better!Stephen E. Jones\n\n","author":"Stephen E Jones","date":"March 23, 2012 at 9:09 AM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","site":"moore"},{"title":"\nFour proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)\n","post":"\n\nHi Steve,Well I guess your right in a way, but I was thinking more in the line of it being disheartening that so many people's hearts can be so 'Blackened' that such an obvious sign from the Big Guy staring them right in the face cannot open thier hearts to him.It must be really frustrating for him, it is for me and I've only been dealing with it for a fraction of time compared to him.Thanks for listening.\n\n","author":"Anonymous","date":"March 25, 2012 at 6:35 AM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","site":"moore"},{"title":"\nFour proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)\n","post":"\n\nAnonymous>... I was thinking more in the line of it being disheartening that so many people's hearts can be so 'Blackened' that such an obvious sign from the Big Guy staring them right in the face cannot open thier hearts to him.Thanks for the clarification. After 45 years a Christian, including over 10 years debating atheists/agnostics on Internet Creation/Evolution forums, I am used to what Paul says of the pagans in Rom 1:21:\"For although they knew God, they did not honor him as God or give thanks to him, but they became futile in their thinking, and their foolish hearts were darkened.\"That is, as individuals continue to deny the evidence of God's existence and Christianity being true, that God graciously presents to them, their minds and hearts become progressively \"darkened\" so that they eventually cannot see that truth anymore and so cannot \"call upon the name of the Lord and be saved\" (Acts 2:21; Rom 10:13)-which were `quiet time' verses this morning! That is, I believe, what Jesus meant by the unforgivable sin, the \"blasphemy against the Holy Spirit\" (Mt 12:31; Mk 3:28-29), wilful refusal to believe, until one becomes so hardened, that one cannot believe and be saved.>It must be really frustrating for him, it is for me and I've only been dealing with it for a fraction of time compared to him.I regard it as all part of God's plan. Even the bogus \"medieval\" 1988 radiocarbon dating. God could make the evidence for Christianity so strong that even the most hardened atheist would have to accept it, but He doesn't. Jesus could have appeared after His resurrection to everyone to prove He had risen from the dead, but He didn't:Acts 10:40-41 \"but God raised him on the third day and made him to appear,  not to all the people but to us who had been chosen by God as witnesses, who ate and drank with him after he rose from the dead.\"To paraphase Pascal: \"there is enough evidence for Christianity being true, that those who want to believe it have rational grounds for their belief; but there is not enough evidence to force those who don't want to believe that Christianity is true, to have to believe against their will. There is not enough evidence so as to keep Christians humble; but there is enough evidence that unbelievers will have no excuse for their wilful unbelief, on the Day of Judgment.\"Stephen E. Jones\n\n","author":"Stephen E Jones","date":"March 25, 2012 at 9:08 AM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","site":"moore"},{"title":"\nFour proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)\n","post":"\n\nHi Steve,Really look forward to your blog on problems with the radiocarbon dating. If you decide to go forward with it. May I suggest when doing so to list all assumptions made in RCD and also archaeological expectations of the same.Thanks again.\n\n","author":"Anonymous","date":"March 26, 2012 at 4:11 PM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","site":"moore"},{"title":"\nFour proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)\n","post":"\n\nAnonymous>Really look forward to your blog on problems with the radiocarbon dating. Thanks for the encouragement.>May I suggest when doing so to list all assumptions made in RCD and also archaeological expectations of the same.Will do.Stephen E. Jones\n\n","author":"Stephen E Jones","date":"March 26, 2012 at 5:28 PM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","site":"moore"},{"title":"\nFour proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)\n","post":"\n\nI have just scanned page 14 of the British Society for the Turin Shroud Newsletter 14, September 1986, as part of my project of having back issues of that Newsletter webbed on Shroud.com.This quote from archaeologist William Meacham's 1986 (two years before the 1988 C14 dating of the Shroud) paper, \"On Carbon Dating the Shroud,\" is relevant:\"We must bear in mind that C14 will not prove or disprove the Shroud's authenticity or its true age, because radiocarbon dating rests upon a number of assumptions which cannot be subjected to laboratory proof-the most important assumption in this instance being that the carbon now present in the sample is indeed the carbon present at the time the sample died (i.e., the harvest of the flax used in making the linen). As a method of dating, C14 is usually accurate, but there are exceptions.\"Stephen E. Jones-----------------------------------Comments are moderated. Those I consider off-topic, offensive or sub-standard will not appear. Each individual will usually be allowed only one comment under each post. Since I no longer debate, any response by me will usually be only once to each individual under each post.\n\n","author":"Stephen E Jones","date":"March 27, 2012 at 5:27 AM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","site":"moore"},{"title":"\nFour proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)\n","post":"\n\nGood post and to note even Alan Adler said himself said there was a 97.7% chance of the radiocarbon sample having disreprencies and having a different composition than the main area of the shroud. Oh and a side-note for anyone whose interested it seeems like Dan Porter has finally taken action and blocked ScienceBod from posting comments on his blog.C\n\n","author":"Anonymous","date":"March 28, 2012 at 3:57 AM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","site":"moore"},{"title":"\nFour proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)\n","post":"\n\nAnonymous>... even Alan Adler said himself said there was a 97.7% chance of the radiocarbon sample having disreprencies and having a different composition than the main area of the shroud. Thanks. Do you have a reference or link to where Adler stated that?Stephen E. Jones\n\n","author":"Stephen E Jones","date":"March 28, 2012 at 5:15 AM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","site":"moore"},{"title":"\nFour proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)\n","post":"\n\nJust to add to the problems of the Shroud radiocarbon dating; One must remember this Shroud has been 'around', meaning it has not sat in a sealed tomb or buried for 2000 or more years. Archaeologists usually deal with items that have been 'secluded', not carried all over, handled, mended or exposed to outside influences/contaminations. Even in the cases of 'secluded' RCD testings there have been anomolies! I have read that up to 50% of tests must be redone because of anomolies. Where does that put the Shroud in the error percentage scale? I'd say it's up there; Like a 95% chance of error from from a 'single' reading, possbly.F3\n\n","author":"Flagrum3","date":"April 3, 2012 at 5:39 AM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","site":"moore"},{"title":"\nFour proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)\n","post":"\n\nFlagrum3>Just to add to the problems of the Shroud radiocarbon dating; One must remember this Shroud ... has not sat in a sealed tomb or buried for 2000 or more years.Agreed. The Shroud has had a unique history, having been handled by countless hands, and a large part of that history is unknown. Yet that unknown history could be very important in assessing how much new carbon has been added to the linen. E.g. if the Shroud had been kept in granite castles/monasteries by the Templars and/or the Savoys, it may have been subject to a prolonged neutron flux from radon gas (a decay product of uranium and thorium which is in granite and accumulates in granite rooms-see \"Radon: Accumulation in houses,\" Wikipedia), which could have converted Nitrogen 14 in the Shroud to Carbon 14.Remember that there only is a very tiny amount of C14 in carbon:\"Donahue ... offered an analogy to illustrate it. `Let's say the shroud material is 1,000 acres of green marbles piled three feet deep, and in there somewhere is one blue marble,' he said in a telephone interview from his Tucson laboratory. `We've got to find the blue marble. It's daunting, but we can do it.' \" (Kenneth R. Clark, \"Shroud of Turin Controversy Resumes,\" Chicago Tribune, January 17, 1988.)so it would not take much new C14 added and/or original C14 lost to give a misleadingly young radiocarbon date.A part of the Shroud's history which is known is that it has been in a major fire in 1532 in which molten silver (which melts at 962ºC = 1571ºF) has burned through multiple layers of the cloth. And water used to douse the fire would have created superheated steam. The effects of  962ºC heat and superheated steam in an enclosed box could have forced new carbon deep into the linen, and even becoming a part of it, where it could never be removed by pre-treatment. C14 labs warn against mere tobacco smoking near a sample to be C14 dated! >Archaeologists usually deal with items that have been 'secluded', not carried all over, handled, mended or exposed to outside influences/contaminations. Agreed. See above.>Even in the cases of 'secluded' RCD testings there have been anomolies! I have read that up to 50% of tests must be redone because of anomolies. Where does that put the Shroud in the error percentage scale? I'd say it's up there; Like a 95% chance of error from from a 'single' reading, possbly.Agreed. If it was any other linen artifact the C14 labs would have been much more cautious in claiming that an artifact which has historical evidence that it existed at least from the sixth century, and has such a known  contamination history, and  unknown history, can be \"conclusively\" proved to be \"medieval ... AD 1260-1390.\"The AD 1260-1390 date, i.e. 1325 +/- 65 is just too good to be true, considering all the problems AMS dating had had up to then, and yet the Shroud would have been one of the most problematic artifacts to carbon-date, given its history.Yet the middle date, 1325, `just happened' to be about 20 years before the Shroud first appeared in documented European history, at Lirey France in about 1355.Therefore I suspect that the actual C14 dates may have ranged from 1st to 16th century AD, the former being the true date of  the Shroud and the latter that of the medieval invisible repair, but the C14 labs had too much prestige at stake (let alone the anti-Christianity of their leaders, Gove, Damon, Hall and Wolfli) to admit publicly that their new AMS method (or rather they) had failed, and what's more the Shroud could have been Jesus'. So out of their range of dates they chose those which averaged just before 1355, and ignored the rest.Stephen E. Jones\n\n","author":"Stephen E Jones","date":"April 3, 2012 at 9:22 PM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","site":"moore"},{"title":"\nFour proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)\n","post":"\n\nHi Steve,May I suggest before you get around to doing a more detailed post on c14 dating. You read all papers by Remi Van Healst on RC Dating. If you haven't already. There is some surprising first hand facts that prove the c14 result was in error....I'm amazed actually with all of his study and findings that they are not mentioned more often in defence of the SHroud. Here is one little bit I learned from his close scrutiny of the 'supposed' peer-review of the '89 Nature paper for the 1988 RCD. It was required that a minimum size of samples be 5g, however close scrutiny showed all samples from all labs used for the testing were well below this threshold, basically nullifying any results on a very basic level.Curious as to your thoughts on these findings.F3\n\n","author":"Flagrum3","date":"April 4, 2012 at 7:48 PM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","site":"moore"},{"title":"\nFour proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)\n","post":"\n\nFlagrum3>May I suggest before you get around to doing a more detailed post on c14 dating. When I get to my series on the flaws in the 1988 C14 dating of the Shroud as \"medieval ... AD 1260-1390,\" I will try to consider all the relevant information, including those you menation.But the literature on that subject is huge and would require a book to do it justice. So inevitably on a blog I will have to summarise.Can we leave any further discussion of C14 dating until then? Although the title of this post has \"the AD 1260-1390 radiocarbon date of the Shroud\" in it, it is more specifically about the Vignon markings.Stephen E. Jones-----------------------------------Comments are moderated. Those I consider off-topic, offensive or sub-standard will not appear. Each individual will usually be allowed only one comment under each post. Since I no longer debate, any response by me will usually be only once to each individual under each post.\n\n","author":"Stephen E Jones","date":"April 4, 2012 at 9:42 PM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","site":"moore"},{"title":"\nFour proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)\n","post":"\n\nHi Steve,Sorry I got stuck off topic. Look forward to your c14 blog.F3\n\n","author":"Flagrum3","date":"April 5, 2012 at 8:19 AM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","site":"moore"}]
