[{"title":"The Vignon Markings Issue:  A Promoted Comment","post":"I repeat here my question.\nMay 20, 2014 at 3:18 am Reply\nYou had written in other thread: \n“Most of the ancient Byzantine representation of Christ are showing great similarity with the face on the Shroud”. [Implied: some features of the Byzantine art were copied from the Shroud].\nHere my question: \n“The face on the Shroud is showing a great similarity with most of the ancient Byzantine representations of Christ”. [Implied: some features of the Shroud were copied from the Byzantine art].\nWhy not?\n\n","date":"May 20, 2014 at 6:02 am","url":"https://shroudstory.com/2014/05/20/the-vignon-markings-issue-a-promoted-comment/","cat":"art","id":"comment-121902","author":"David Mo","site":"shroudstory"},{"title":"The Vignon Markings Issue:  A Promoted Comment","post":"already asked myself the same question David (which is like : is it the chicken or the egg?) and I came up convinced that the first option (i.e. the Byzantine icons of Christ were based directly or indirectly on the Shroud image) was much more probable than the second option.\n Why? Simply because we know for a fact (thanks to the STURP team) that the image on the Shroud comes from some kind of interrection (still undetermined) between a real crucified corpse and the surface of the cloth. So, because of this fact, if the second option would be true (i.e. the Shroud image is based on the Byzantine icons of Christ), that would mean a forger would have needed to find a victim that looks almost exactly like the bearded man we find in most Byzantine icons and then, tortured and crucified him in order to produce a false relic of the Shroud of Christ (not only of the bloody stigmata of Christ but also with an image naturally produced by the corpse or by some product placed on the corpse, like burial spices or something like that). \nThis scenario seem so ludicrous and unrealistic that it is not hard for me to trust in the other one!\n\n","date":"May 21, 2014 at 2:08 pm","url":"https://shroudstory.com/2014/05/20/the-vignon-markings-issue-a-promoted-comment/","cat":"art","id":"comment-122742","author":"Yannick Clément","site":"shroudstory"},{"title":"The Vignon Markings Issue:  A Promoted Comment","post":"What about copies of copies of the Shroud in Byzantine Christ face iconography, which could account for the apparent chicken or the egg causality dilemma? What about  Byzantine Shroud copyists having been the victims of illusive patterns/pareidolia in the Shroud face image (teeth, skewed nose etc)? What about copies with neck and neckless/symetrical and asymmetrical hair fall merging both the Holy Face of the Holy Mandylion (aka today’s Holy Face of the Manoppello Veil) and the Holy Face of the Holy Sindon (aka today’s Holy Face of the Turin Shroud)?\n\n","date":"May 20, 2014 at 7:46 am","url":"https://shroudstory.com/2014/05/20/the-vignon-markings-issue-a-promoted-comment/","cat":"art","id":"comment-121948","author":"Max patrick Hamon","site":"shroudstory"},{"title":"The Vignon Markings Issue:  A Promoted Comment","post":"Iconologically speaking and things are far more complex than David Mo “thinks”. What about an ancient reliquary keeping two relics: a Holy Face on a transparent byssus veil (aka the Holy face of the Manoppello Veil) placed over the Holy Face of the Turin Shroud?\n\n","date":"May 20, 2014 at 7:51 am","url":"https://shroudstory.com/2014/05/20/the-vignon-markings-issue-a-promoted-comment/","cat":"art","id":"comment-121952","author":"Max patrick Hamon","site":"shroudstory"},{"title":"The Vignon Markings Issue:  A Promoted Comment","post":"The Shroud looks like pictures of Jesus because by the time it came to be made everybody knew what Jesus looked like.\nOR\nPictures of Jesus look like the Shroud because the Shroud came first and was the model for the pictures.\nI don’t think it is as easy to discriminate between these two points of view as Yannick, Meacham or Philip McNair claim. Pictures of John the Baptist or most of the apostles are also often easily recognisable. Jesus’s image is not as consistent as often quoted, and I wonder if the image above, as reproduced by Dan, would be as obvious as it is without its massive halo. Context is often as much a guide as physiognomy, which is how most of the less bearded Jesus’s are also instantly recognisable.\n\n","date":"May 20, 2014 at 7:52 am","url":"https://shroudstory.com/2014/05/20/the-vignon-markings-issue-a-promoted-comment/","cat":"art","id":"comment-121953","author":"Hugh Farey","site":"shroudstory"},{"title":"The Vignon Markings Issue:  A Promoted Comment","post":"Yannick’s comment is right on the mark.  Perhaps not everything Vignon identified can be considered unique to the Shroud image but there is a global pattern that allows everyone in the world, whether they believe or not, to see a picture of the Shroud face and know it is Jesus.  Regarding comments as to which one came first…the Shroud or the icon, keep in mind that the earliest descriptions of the Mandylion/Image of Edessa are “The True Likeness” and “Not Made by Human Hands.”  I think even in the 6th century, people were smart enough to know whether something was made with paint or not.  Seeing that the Shroud conforms exactly with the “True Likeness” as depicted in various icon images and we know today from science that it is not the result of artistic substances, ie…”Not Made by Human Hands.”  It is both logical and certain that the Shroud is in fact the original True Likeness discovered or perhaps rediscovered in 525.\n\n","date":"May 20, 2014 at 8:36 am","url":"https://shroudstory.com/2014/05/20/the-vignon-markings-issue-a-promoted-comment/","cat":"art","id":"comment-121981","author":"Russ Breault","site":"shroudstory"},{"title":"The Vignon Markings Issue:  A Promoted Comment","post":"You seem forget  the countless absurd relics that were going round in the Middle Age.\n\n","date":"May 20, 2014 at 10:52 am","url":"https://shroudstory.com/2014/05/20/the-vignon-markings-issue-a-promoted-comment/","cat":"art","id":"comment-122038","author":"David Mo","site":"shroudstory"},{"title":"The Vignon Markings Issue:  A Promoted Comment","post":"Most alleged relics were small pieces of bone, hair, clothing, etc. Nothing on the order of the Shroud.  And most alleged relics were associated with various saints.\n\n","date":"May 20, 2014 at 1:15 pm","url":"https://shroudstory.com/2014/05/20/the-vignon-markings-issue-a-promoted-comment/","cat":"art","id":"comment-122103","author":"Russ Breault","site":"shroudstory"},{"title":"The Vignon Markings Issue:  A Promoted Comment","post":"Quote: “I think even in the 6th century, people were smart enough to know whether something was made with paint or not.”\nReply: Not necessarily in the context of a Church who tell them what to believe or not! So, if the Edessan Church of the 6th Century have created a false relic of Christ (as a teaching tool and also in order to fight the few heretical groups of Christians present in that city at that time in history), of course they would have make believe the image was not painted and of course many Christians would have followed blindly what the Church was telling them! This kind of blind religious following happen all the time throughout history and even today.\nAnd think about that: Why many Christians seem to be certain that the image on the Guadalupe Tilma is not painted? BECAUSE THE MEXICAN CHURCH HAS TOLD THEM SO FOR ALMOST 500 YEARS!!! To me, there are some stricking similarities between the two relics and the most obvious is the fact that both relics have been used by the local Church who owns it in order to convert and teach people and also in order to fight heretical groups (in the case of the Tilma, the heretics were of course not some other Christians, but the indians who were following their pagan gods of nature)…\n\n","date":"May 21, 2014 at 2:09 pm","url":"https://shroudstory.com/2014/05/20/the-vignon-markings-issue-a-promoted-comment/","cat":"art","id":"comment-122743","author":"Yannick Clément","site":"shroudstory"},{"title":"The Vignon Markings Issue:  A Promoted Comment","post":"I find it striking that even absent the halo, the few sketchy lines of the posted picture gives a recognisable picture of Jesus.  In fact I would say it is the rudimentary picture of him.  The mental processes involved in perception and recognition are not yet fully understood.  If the picture rudiments could be quantified, we might then have a better measure for comparing icons with the Shroud image.  But not yet …\n\n","date":"May 20, 2014 at 8:04 pm","url":"https://shroudstory.com/2014/05/20/the-vignon-markings-issue-a-promoted-comment/","cat":"art","id":"comment-122326","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Vignon Markings Issue:  A Promoted Comment","post":"What I find striking in this one is the blood stain on the forehead.\n\n","date":"May 20, 2014 at 9:59 pm","url":"https://shroudstory.com/2014/05/20/the-vignon-markings-issue-a-promoted-comment/","cat":"art","id":"comment-122372","author":"Mike M","site":"shroudstory"},{"title":"The Vignon Markings Issue:  A Promoted Comment","post":"De wesselow mentions that in his book. As he says could be a random mark. But it would be quite a big coincidence.\n\n","date":"May 21, 2014 at 2:51 am","url":"https://shroudstory.com/2014/05/20/the-vignon-markings-issue-a-promoted-comment/","cat":"art","id":"comment-122452","author":"Thomas","site":"shroudstory"},{"title":"The Vignon Markings Issue:  A Promoted Comment","post":"Seen in high resolution, the blood stain on the forehead in the HPM is a copy of THE TAIL (or lower half) of the tailed epsilon on the TS forehead area.\n\n","date":"May 21, 2014 at 3:57 am","url":"https://shroudstory.com/2014/05/20/the-vignon-markings-issue-a-promoted-comment/","cat":"art","id":"comment-122473","author":"Max patrick Hamon","site":"shroudstory"},{"title":"The Vignon Markings Issue:  A Promoted Comment","post":"This is a coincidence that makes sindonological sense.\n\n","date":"May 21, 2014 at 4:01 am","url":"https://shroudstory.com/2014/05/20/the-vignon-markings-issue-a-promoted-comment/","cat":"art","id":"comment-122476","author":"Max patrick Hamon","site":"shroudstory"},{"title":"The Vignon Markings Issue:  A Promoted Comment","post":"The marks on the chest are also somewhat reminiscent of the scourge marks on the chest of the man on the shroud\n\n","date":"May 21, 2014 at 4:02 am","url":"https://shroudstory.com/2014/05/20/the-vignon-markings-issue-a-promoted-comment/","cat":"art","id":"comment-122477","author":"Thomas","site":"shroudstory"},{"title":"The Vignon Markings Issue:  A Promoted Comment","post":"Russ Breault\nMost alleged relics were small pieces of bone, hair, clothing, etc. Nothing on the order of the Shroud. And most alleged relics were associated with various saints.\nWhat matters the size? A lot of evident artefacts have been considered authentic relics in the past. The Shroud of Besançon was considered as the actual Shroud of Christ.  It was a big cloth and evidently painted. Credulity of man has not boundaries.\n\n","date":"May 21, 2014 at 2:32 am","url":"https://shroudstory.com/2014/05/20/the-vignon-markings-issue-a-promoted-comment/","cat":"art","id":"comment-122444","author":"David Mo","site":"shroudstory"},{"title":"The Vignon Markings Issue:  A Promoted Comment","post":"David Mo wrote: “Credulity of man has not boundaries.” \nNeither has Incredulity of archsceptics.\n\n","date":"May 21, 2014 at 4:05 am","url":"https://shroudstory.com/2014/05/20/the-vignon-markings-issue-a-promoted-comment/","cat":"art","id":"comment-122480","author":"Max patrick Hamon","site":"shroudstory"}]
