[{"title":"The Vignon markings: More evidence against the radiocarbon date for the Shroud of Turin","post":"Vignon led a small biology team at the Sorbonne Paris which began an analysis of Secondo Pia’s negative (1898) as early as 1900.  He subsequently became Professor of Biology at the Institut Catholique, Paris.  The team’s results were presented to the Paris Academy of Sciences on April 11, 1902 by Yves Delage Sorbonne professor of anatomy and a well-known agnostic.  He pointed out the wounds and other data were so anatomically flawless that it seemed impossible they could be the work of any artist.  He considered that the image was caused by some physiochemical process in the tomb.\nAlthough the paper was favourably received elsewhere, the Academy was so dominated by “rationalists” and “free-thinkers” that the Secretary refused to publish the full text, and Delage was warned that he was putting his career in jeopardy.  So much for the objectivity of Science! They also have their share of fanatics!\nReaders are probably aware of Wilson’s detailed comparisons of the Vignon markings with various icons appearing after the sixth century, in his endeavours to show the Mandylion of Edessa and Shroud were actually one and the same object.  I also made some comment concerning the.coins that appeared recently on this site, where many of the Vignon markings were readily apparent or had been stylized.\nBut such persuasive evidence will continue to be ignored by the skeptics, merely because it does not match with their preconceived notions and agenda, their preference for reductionism, and they will no doubt continue to fiddle with heating metal bas reliefs, and scorching countless ironing boards.\n\n","date":"February 14, 2012 at 7:06 am","url":"https://shroudstory.com/2012/02/14/the-vignon-markings-more-evidence-against-the-radiocarbon-date-for-the-shroud-of-turin/","cat":"art","id":"comment-8227","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"The Vignon markings: More evidence against the radiocarbon date for the Shroud of Turin","post":"“But such persuasive evidence will continue to be ignored by the skeptics, merely because it does not match with their preconceived notions and agenda, their preference for reductionism, and they will no doubt continue to fiddle with heating metal bas reliefs, and scorching countless ironing boards.”\nIf I were in the business of replicating the Shroud with ironing boards, nope, with a heated bas relief and a bed of sand, I’d avoid using sifted sand. A few bits of flint or gravel strategically placed here and there might do wonders for added ‘authenticity’ – like creating conduction hot spots that replicate some or all of those 15 or 20 “unique” features.\n Yup, all it would take in the sand bed model is a bit of stone or fragment of twig to produce a  “swollen” cheek (the latter being so “anatomically flawless” as to be in advance of the Gospel account  ;-)\n\n","date":"February 14, 2012 at 10:30 am","url":"https://shroudstory.com/2012/02/14/the-vignon-markings-more-evidence-against-the-radiocarbon-date-for-the-shroud-of-turin/","cat":"art","id":"comment-8230","author":"colinsberry","site":"shroudstory"},{"title":"The Vignon markings: More evidence against the radiocarbon date for the Shroud of Turin","post":"And here’s what Vignon thought about the great similarities he found between the Shroud image and the Mandylion’s copies or between the Shroud image and the Pantocrator :\nA special feature of this iconographic evidence is the evident likeness of the isolated head of the Shroud to the Mandytions. With long hair, staring eyes and absence of neck, it almost seems to be their negative. Could this similarity, coupled with the anomalies common to both, give us the moral certainty that the Shroud was the unique acheiropoietos, kept, as Vignon believed, in some monastery easily accessible to the theologians and artists of Edessa? For centuries it was a holy, but mysterious and embarrassing relic; suddenly, under pressure from the Monophysites, the Orthodox Clergy realise the role that could be played by a copy of the Face of the Shroud, if turned into a living portrait of Christ. The climate was right in the sixth century with the decline of relics in favour of icons. The Abgar legend with Ananias5 role as painter was to hand. All that had to be done was to have a copy made on cloth, “process” it by incubation, give it a plausible miraculous origin and the desired weapon was there to confound the Monophysites (Note : this was an heretic group that was present in the Middle East from the 5th to the 7th century, and that doesn’t believe in the humanity of Christ.  In fact, they just believe in his devine nature), put the Persians to flight and become in course of time the most holy Mandylion. Have we here then the unique source of all “true likenesses”, Veronicas, Epitaphioi and the “figured shrouds” of the West?\nThis came from an excellent paper written in 1969 by Maurus Green, an historian monk.  So, you can see that Vignon never thought one second that this Mandylion could have been the Shroud !  On the contrary, the high level of similarities was for him a proof that the Mandylion was a false relic made from the Shroud !!!\nEXACTLY WHAT I WAS TRYING SO HARD TO MAKE YOU UNDERSTAND DURING THE PAST WEEK !!! I HAVE NOTHING MORE TO SAY THAN :  I AGREE COMPLETELY WITH VIGNON’S POINT OF VIEW !  If the Pantocrator is an icon made by an artist from the Shroud image, why not also the Mandylion ???  Because the Church proclaim it an image not made by hand ???  COME ON !!!  Sadly, history prove that it would not have been the first time that some people from inside the Church would have create a false relic for “not so catholic” purpose !!!  Indeed, what better than a picture of the human face of Christ that he supposedly created himself in a miraculous way, to reinforce the orthodox doctrine which he had in himself the two natures, human and divine?  At least in this case, it would have been created, not to make money, but to fight heresies…  It’s not a very nice way to do so, but it was done at least to defend a Catholic truth, namely the reality of both human and divine nature of Jesus-Christ…  \nSo, if you want an advice from me, I would say : forget this Mandylion hypothesis and look for something else that got more solid arguments and facts instead of a bunch of speculations and extrapolations.  I think the hypothesis of Vignon is just that because it really on the real historical context of the 6th century when the Mandylion suddenly appeared in Edessa (and when the first Pantocrator was also created).  This hypothesis, historically speaking, is MUCH MORE CREDIBLE.  If we use Ockham razor, this one reach a much higher level on a probabilistic scale than the one of Ian Wilson… Of course, this information is present in the paper I’m currently writing because I want people to realize that there are other solid options beside the hypothesis of Wilson…  Sadly, most people only focus their attention on Wilson’s ideas and drop all the rest !  \nOf course, Vignon’s hypothesis doesn’t answer all the questions for the Shroud’s ancient history, but if we are able to read between the lines, it is possible to understand that this relic was considered problematic and even scandalous for the Church of that time (because of all the BLOOD on it and also, because it present a DEAD and NAKED body of Christ).  So, in that regard, it is possible to postulate the idea that this relic was known at least from the 6th century on but, during all those years before the sack of Constantinople, it was probably kept inside a reliquary and never publicly showed because of his very particular aspect.  On the contrary, because the Mandylion was showing a living Christ without any injuries or blood stains, it was a much more interesting “tool” for the Church to use against any heresies of that time !  Vignon talk about the Monophysites, but it was the exactly the same thing between 726 and 843, when the Church was fighting against the Iconoclasts.  Effectively, during that time, the Mandylion was often used by the defenders of the sacred images to prove that Christ himself agreed with the veneration of sacred images because he had created one himself !!!  During all those wars against heresies, the Church never used the Shroud and his image to fight heretics.  In fact, the Church probably created and used the Mandylion, simply because it was a relic much more “presentable” for the time than the Shroud…  We have to look at this subject with the eyes of that time and not our modern eyes !  The historical context is the most important aspect to keep in mind…  Sadly, most people don’t do that and think the Church of that time would have used the Shroud to “prove” the resurrection !  This way of thinking is modern and out of context…  The Church wouldn’t even had this possibility during that time because the Shroud aspect was simply scandalous for most people !\nP.S. :  I know everyone’s here (beside maybe Dan) will completely disagree with me (Wilson’s propaganda have sadly worked marvelously well in the Shroud world) but I DON’T CARE.  I bring you good information about the subject and you do what you want with it…\n\n","date":"February 14, 2012 at 10:44 am","url":"https://shroudstory.com/2012/02/14/the-vignon-markings-more-evidence-against-the-radiocarbon-date-for-the-shroud-of-turin/","cat":"art","id":"comment-8232","author":"Yannick Clément","site":"shroudstory"},{"title":"The Vignon markings: More evidence against the radiocarbon date for the Shroud of Turin","post":"Little correction :  You should read that : I think the hypothesis of Vignon is just that (meaning : an hypothesis that got solid arguments) because it rely (and not “really”) on the real historical context of the 6th century when the Mandylion suddenly appeared in Edessa (and when the first Pantocrator was also created).  \nSorry for this error…\n\n","date":"February 14, 2012 at 11:38 am","url":"https://shroudstory.com/2012/02/14/the-vignon-markings-more-evidence-against-the-radiocarbon-date-for-the-shroud-of-turin/","cat":"art","id":"comment-8235","author":"Yannick Clément","site":"shroudstory"},{"title":"The Vignon markings: More evidence against the radiocarbon date for the Shroud of Turin","post":"Some may be tempted to ask me why I think the hypothesis of Vignon should reach a higher point on a probabilistic scale than Wilson hypothesis ?  Simply because the hypothesis of Vignon fits much better with the general depiction of the Mandylion we can find in the documentary and artistic ancient sources (i.e. :  a small cloth showing only the living face of Christ, without any blood or clear signs of injuries).   Also, it doesn’t need the use of a bunch of speculations and extrapolations to work…\n\n","date":"February 14, 2012 at 12:37 pm","url":"https://shroudstory.com/2012/02/14/the-vignon-markings-more-evidence-against-the-radiocarbon-date-for-the-shroud-of-turin/","cat":"art","id":"comment-8236","author":"Yannick Clément","site":"shroudstory"},{"title":"The Vignon markings: More evidence against the radiocarbon date for the Shroud of Turin","post":"Last comment for today :  If Vignon is not off-track with his hypothesis (and I think he’s not), then we have to realize that it is almost impossible that the Shroud, on the contrary of the Mandylion, was a false relic made by an artist or a forger before the 12th or 13th century !  Exact…  Since the appearance of the cloth would have been totally scandalous for that period of time, no way a forger would have want to offend his public by producing a relic with that level of horrific details and with a naked body of Christ…  NO WAY.  So, unless the C14 dating is correct and the Shroud was really produced during the 13th or 14th century (of course, I don’t believe this one second), then we have to realize that it is almost certain that it is a real burial cloth of someone.  I don’t say this for Ron or guys like that who already know that.  I say this to all the skeptics out there.  Historically speaking, the Shroud could not have been forged before the 12th century.  His aspect is simply not consistent with the religious art of that time.  It is simply a relic too much horrific and crude for that period of time.\n\n","date":"February 14, 2012 at 5:27 pm","url":"https://shroudstory.com/2012/02/14/the-vignon-markings-more-evidence-against-the-radiocarbon-date-for-the-shroud-of-turin/","cat":"art","id":"comment-8245","author":"Yannick Clément","site":"shroudstory"},{"title":"The Vignon markings: More evidence against the radiocarbon date for the Shroud of Turin","post":"Yannick’s persistent assertion that the Mandylion and Shroud were two separate objects is a lone voice.  There are several arguments against it.  I have previously referred him to Daniel Scavone’s 1996 paper examining this issue in considerable depth, with all the documented evidence he offers, some 28 pages including notes.  I found that Scavone appears to have updated his paper a number of times, the most recent edition I found was dated in 2006.  It can be found and downloaded as a *.doc file at:\nhttp://www.shroudstory.com/scavone/scavone.doc\n\n","date":"February 14, 2012 at 8:28 pm","url":"https://shroudstory.com/2012/02/14/the-vignon-markings-more-evidence-against-the-radiocarbon-date-for-the-shroud-of-turin/","cat":"art","id":"comment-8252","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"The Vignon markings: More evidence against the radiocarbon date for the Shroud of Turin","post":"But wasn’t someone just the other day here saying that one has to stand back several feet from the Shroud to be able to see what the image represents, such is its faintness? What price then for a framed head to serve as a conventional portrait? That Mandylion must have come as a bitter disappointment to some, especially the short-sighted in days before spectacles were commonplace.\nI suppose one could argue that the image was far more intense in centuries past, and that most has subsequently flaked off.That being the case, what price all the current marvelling at its superficiality and thinness (200nm) if all we see today is a pale shadow of its former glory.\n\n","date":"February 15, 2012 at 4:01 am","url":"https://shroudstory.com/2012/02/14/the-vignon-markings-more-evidence-against-the-radiocarbon-date-for-the-shroud-of-turin/","cat":"art","id":"comment-8262","author":"colinsberry","site":"shroudstory"},{"title":"The Vignon markings: More evidence against the radiocarbon date for the Shroud of Turin","post":"I see absolutely no problem considering one would easily expect most ‘viewers’ would not be allowed within several feet of the “portrait”. Unlike today where one cannot get within meters of the Shroud. So basically the image would ‘show’ quite reasonably to most.\nIt has been mentioned in some ancient writings, in the discriptions of the image, as being faint or as being like the ‘secretion of sweat’ but always viewable. So any argument that the image has faded over time (to any considerable amount) is strickly conjecture. \nR\n\n","date":"February 15, 2012 at 7:04 am","url":"https://shroudstory.com/2012/02/14/the-vignon-markings-more-evidence-against-the-radiocarbon-date-for-the-shroud-of-turin/","cat":"art","id":"comment-8276","author":"Ron","site":"shroudstory"},{"title":"The Vignon markings: More evidence against the radiocarbon date for the Shroud of Turin","post":"Colin, I have no idea whether you’ve bothered to read Scavone’s paper or not.  If you had, you would see that unlike some scientific fanatics I’ve come across, he’s not at all dogmatic about his conclusions that they were one and the same object but he weighs the evidence and gives his measured opinion on the matter.  As to the apparent clarity of the image, I imagine it may very well depend on the angle of the lighting.  In 944 AD, the Mandylion image was clear enough to the future emperor Constantine Porphyrogenitus, but his corrupt brothers Stephen & Constantine Lecapenus found the image very blurred.  Perhaps it requires a pure heart to see the truth of such matters.\nRegardless of the clarity of the Mandylion image, it nevertheless gave rise to countless icons as it was believed to be the true image of Christ not painted by human hands, all of them meticulously copying the Vignon markings, whether they made artistic sense or not.\nFrankly, I would like to see you lift your game by adopting a more scientific attitude, but that requires more of an open mind that you seem prepared to adopt,  For example you could use your chemistry skills to look more closely at such processes as outlined in Mouraviev’s paper: “The Image Formation Mechanism on the Shroud of Turin: A Solar Reflex Radiation Model (the Optical Aspect)”  It can be found at: http://www.shroud.com/pdfs/mouraviev.pdf.\nA closed mind is not uncommon among scientists, one writer makes a living from writing a series of books on the various feuds that have occurred, but it is hardly something to be admired, even though it may suggest loyalty to one’s convictions.\nErnst Mach was convinced that atoms did not exist as recently as 1895, with the result that Boltzman committed suicide because of Mach’s influence with the establishment.  A year or two later Einstein proved the existence of atoms from his Brownian movement experiments and calculations.  Nicolaus Steno, founder of modern geology, was so disenchanted with the bickering among his scientific colleagues, that he abandoned science, converted to Catholicism and entered the church.  So you see you are not alone in your single-mindedness.\nIncidentally, I believe it was Niels Bohr whose response to Einstein was: “Stop telling God what to do with his dice!”\n\n","date":"February 15, 2012 at 7:17 am","url":"https://shroudstory.com/2012/02/14/the-vignon-markings-more-evidence-against-the-radiocarbon-date-for-the-shroud-of-turin/","cat":"art","id":"comment-8278","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"The Vignon markings: More evidence against the radiocarbon date for the Shroud of Turin","post":"@DaveB\nFor you to be telling a published scientist to “lift his game” without making any effort to see how his work has been received in the scientific community is quite simply laughable – not to say insulting. It is you who needs to get down off that high horse of yours, DaveB. And I do not need any pompous half-baked lectures from you on the history of science either.\n\n","date":"February 15, 2012 at 7:26 am","url":"https://shroudstory.com/2012/02/14/the-vignon-markings-more-evidence-against-the-radiocarbon-date-for-the-shroud-of-turin/","cat":"art","id":"comment-8279","author":"colinsberry","site":"shroudstory"},{"title":"The Vignon markings: More evidence against the radiocarbon date for the Shroud of Turin","post":"Thanks for the knuckle-rap Colin, I needed that.  I apologise that offence was taken.  I may have been taking too many horse-riding lessons recently.  My instinctive reactions to comments made might have been better expressed.\nHalf-baked history lessons:  Scientific feuds: check series by Hal Hellman – John Wiley &,Sons – “Great Feuds in … (Mathematics, Technology, Science, Medicine);  Mach-Boltzman: check “Boltzmann’s Atom” David Lindley – Simon & Schuster 2001;  Nicolaus Steno: – “The Seashell on the Mountaintop” Alan Cutler – Heineman 2003 (“The summit of Mount Everest is marine limestone!”).  Recurring themes are establishment close-mindedness coupled with manipulation.\nI’m still interested in informed professional comment on Mouraviev’s paper, although there seem to be some questionable assumptions in his description of the burial work.  But I wonder if there may have been some other similar chemical process involved.\n\n","date":"February 15, 2012 at 6:44 pm","url":"https://shroudstory.com/2012/02/14/the-vignon-markings-more-evidence-against-the-radiocarbon-date-for-the-shroud-of-turin/","cat":"art","id":"comment-8327","author":"Daveb of Wellington NZ","site":"shroudstory"}]
