[{"title":"How Valid are the Vignon Markings?","post":"I suggest a small tournament: how many Vignon marks can be found on the old Christ icons compared to unrelated images (like Aristotetle, Hugh Laurie or Clint Eastwood). \n2-3 Vignon marks are quite common, and can be attributed to coincidence. But 5-6 are more than coincidence.\nBesides one should also take into account the differences. Neither of the unrelated images of Plato, Clint Eastwoo d or Russian peasant has long hair for example. Almost every portrait of Christ made after 6th century (not taking into account culturally isolated regions like Ethiopia) has long hair.\nThe simple kid’s question: why?\nWhy every child recognizes this face, while there is nowhere in the Scripture (or early tradition, before medieval Letter of Lentulus, see http://en.wikipedia.org/wiki/Publius_Lentulus ) written how he looked like?\n\n","date":"April 26, 2014 at 10:31 am","url":"https://shroudstory.com/2014/04/26/how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104037","author":"O.K.","site":"shroudstory"},{"title":"How Valid are the Vignon Markings?","post":"Some of the Vignon markings may be arbitrary, but there are some that just don’t make sense without the Shroud, or something like it, being a guide to the artist. Also, it’s strange that most of these markings are unknown in portraits of Christ until the Mandylion was discovered in the 6th century. Just my unqualified and amateur 2 cents.\n\n","date":"April 26, 2014 at 10:40 am","url":"https://shroudstory.com/2014/04/26/how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104039","author":"Chesterbelloc","site":"shroudstory"},{"title":"How Valid are the Vignon Markings?","post":"Fair enough. I agree. But which marks are unique and which are not? To carelessly say that the open-topped square makes no artistic sense is wrong and it calls into question good arguments for using Vignon’s markings.\n\n","date":"April 26, 2014 at 11:22 am","url":"https://shroudstory.com/2014/04/26/how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104051","author":"Dan","site":"shroudstory"},{"title":"How Valid are the Vignon Markings?","post":"Fair enough. I agree. But which marks are unique and which are not? To carelessly say that the open-topped square makes no artistic sense is wrong and it calls into question good arguments for using Vignon’s markings.\nThere are no unique marks, as each of them can find some ‘naturalistic’ (non-Shroud) interpretation. Only the combination of several of them makes the valid case + some other features, like analysis of proportions, some common traits of overwhelming majority of Jesus portraits (like long hair for example).\nSee http://en.wikipedia.org/wiki/Depiction_of_Jesus \nWe can say that there is in general a single model for mature Christ, basing on some archetype. On the contrary, there is no single model for Mary, St. Peter, Moses, Abraham, or even infant Jesus -they usually share the traits of artist’s cultural background. The reneissance or baroque portaits of Virgin Mary are very different than Black Madonna for example. But the mature Jesus always have long hair, for example.\n\n","date":"April 26, 2014 at 11:43 am","url":"https://shroudstory.com/2014/04/26/how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104066","author":"O.K.","site":"shroudstory"},{"title":"How Valid are the Vignon Markings?","post":"Jones said he wants Dan to ignore his blog. This is why Dan must not do so.\n\n","date":"April 26, 2014 at 11:27 am","url":"https://shroudstory.com/2014/04/26/how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104054","author":"Paulette","site":"shroudstory"},{"title":"How Valid are the Vignon Markings?","post":"We had a look at this last December (The Sciatica Effect, Dec 28 2013), and I queried the existence specifically of the celebrated “double crease” under the chin, said to be the source of so many of those Byzantine portraits of Christ with a double line at the top of his tunic. I now have a copy of Paul Vignon’s 1903 book Le Linceul Du Christ, in which he makes no remarks at all about markings. He includes, however, several good reproductions of Pia’s photos, and the double crease simply isn’t there. It must have arrived as a consequence of the rolling up of the shroud between 1898 and the 1931 Enrie photography.\nAs for the two strands of hair, they do not appear at all on the shroud, and I am not at all persuaded that they are representations of the epsilon blood-drip ‘translated’ into hair.\nThree of the Vignon markings, which appear to exist on the shroud, are really only one, namely the open square, the shallow V inside it and the droopy V below it. The square is easily the most visible, but apart from the Roman catacomb painting (what was the shroud doing in Rome, one wonders?) most of the paintings which are claimed to have derived from the shroud seem to have omitted the square altogether in favour of the V-markings. How odd.\nAs for the nose and cheeks, there is, very properly, no sign of any bruising or battering on the Byzantine portraits. They nearly all show their subject turned slightly towards, and illuminated by, light from the right. Not only does this reduce the area of cheek visible on the right, but also means that there is a greater area of cheek, and more shadow, on the left. I do not feel this establishes that this asymmetry in the depiction of the nose and cheeks is derived from the shroud.\nAs for the moustache and beard, it is obvious that the general shape of a Byzantine moustache looks nothing like that of the man in the shroud. His is quite bushy and bulges around the nostrils; theirs consists of two long straight diagonals with a little tuft in the middle. If anything, this style of moustache clearly shows that these portraits are not derived from the shroud. Byzantine depictions of beards, surely the most prominent and distinctive of features (I have a beard myself, dear reader) are split about 50/50 forked or pointed. Not a clear derivation from the shroud, in my opinion.\n\n","date":"April 26, 2014 at 1:47 pm","url":"https://shroudstory.com/2014/04/26/how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104104","author":"Hugh Farey","site":"shroudstory"},{"title":"How Valid are the Vignon Markings?","post":"Always looking for troubles, even where there are none (or very minor).\nWe had a look at this last December (The Sciatica Effect, Dec 28 2013), and I queried the existence specifically of the celebrated “double crease” under the chin, said to be the source of so many of those Byzantine portraits of Christ with a double line at the top of his tunic.\nAs it was discussed, the “double crease” is visible under appropriate conditions. Besides, one should decide what is more important, the “double” or “crease”, which is very often represented as low collar on Christ’s tunic. The neck is alos often emphasized, another common trait with the Shroud, just see http://commons.wikimedia.org/wiki/File:Meister_von_Daphni_002.jpg\nAs for the two strands of hair, they do not appear at all on the shroud, and I am not at all persuaded that they are representations of the epsilon blood-drip ‘translated’ into hair.\nBut they appear here: http://pl.wikipedia.org/wiki/Ca%C5%82un_z_Manoppello#mediaviewer/Plik:Volto-Santo_01.jpg \nAnyway, it is one of the most characteristic features on the majority (but not all) of the Byzantine icons. Whether they are derived from the Shroud aka Mandylion or Manoppello aka Camuliana (it could be from either of them) is a secondary issue.\nThree of the Vignon markings, which appear to exist on the shroud, are really only one, namely the open square, the shallow V inside it and the droopy V below it. The square is easily the most visible, but apart from the Roman catacomb painting (what was the shroud doing in Rome, one wonders?) most of the paintings which are claimed to have derived from the shroud seem to have omitted the square altogether in favour of the V-markings. How odd.\nThere is no icon with all 15 markings. Those three are not one and the same, instead one of them is usually picked. On Daphni Pantocrator there are all 3. The Rome pantocrator is likely based on some other icon derived directly from the Shroud -most of those paintings are copies of copies, second or third generation from the Shroud.\nAs for the nose and cheeks, there is, very properly, no sign of any bruising or battering on the Byzantine portraits.\nOn the glorius Pantocrator? Are you crazy? Nevertheless, look at the Sinai painting: http://en.wikipedia.org/wiki/File:Spas_vsederzhitel_sinay.jpg It is a face of a boxer, isn’t it?\nThey nearly all show their subject turned slightly towards, and illuminated by, light from the right. Not only does this reduce the area of cheek visible on the right, but also means that there is a greater area of cheek, and more shadow, on the left. I do not feel this establishes that this asymmetry in the depiction of the nose and cheeks is derived from the shroud.\nAgain, this is artistic interpretation, based on.. what? How do you think, what was the origin of this tradition?\nAs for the moustache and beard, it is obvious that the general shape of a Byzantine moustache looks nothing like that of the man in the shroud. His is quite bushy and bulges around the nostrils; theirs consists of two long straight diagonals with a little tuft in the middle. If anything, this style of moustache clearly shows that these portraits are not derived from the shroud\nYou should be happy that there is even a mustache separeted from the beard! Demanding that the mustache must be ideally copied from the Shroud is just splitting hairs. But look again on the Sinai Pantocrator.\nByzantine depictions of beards, surely the most prominent and distinctive of features (I have a beard myself, dear reader) are split about 50/50 forked or pointed. Not a clear derivation from the shroud, in my opinion.\nI would say it is more than 50/50 for forked than pointed. But you should look also for other characters, and I think in their case it is far less than 50/50 forked to pointed.\nAnd finally, leaving aside all the markings, once again the basic question:\nWhy every child recognizes this face, while there is nowhere in the Scripture written how he looked like?\nThis is the very basic question, most academic (pseudo)scholars never asked!\n\n","date":"April 26, 2014 at 2:44 pm","url":"https://shroudstory.com/2014/04/26/how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104122","author":"O.K.","site":"shroudstory"},{"title":"How Valid are the Vignon Markings?","post":"And one has also take into account the argument by Paul Zanker in his The Mask of Socrates that the earliest representations of Christ with a beard are from Rome c. AD 300 and that the origin of the beard/long hair iconography of Christ is western rather than Eastern and much earlier than the sixth century. Zanker’s study can tracked down in full online.\n\n","date":"April 26, 2014 at 2:29 pm","url":"https://shroudstory.com/2014/04/26/how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104119","author":"Charles Freeman","site":"shroudstory"},{"title":"How Valid are the Vignon Markings?","post":"Yes, Charles, but as they are minority until the 6th century, they matter little. Nevertheless tracing back their origins  (oral tradition? very early copies of the Image of Edessa?) would be interesting.\n\n","date":"April 26, 2014 at 2:50 pm","url":"https://shroudstory.com/2014/04/26/how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104123","author":"O.K.","site":"shroudstory"},{"title":"How Valid are the Vignon Markings?","post":"Zanker relates them to iconography of philosophers,Christ is the first true philosopher. One has to remember that in Roman catacomb art all kinds of pagan precedents were integrated into the early iconography of Christ and this appears to be one of them. But there is no substitute for reading Paul Zanker – the work is on line for free. As you will see if you google him,he is one of the most respected art historians of this period.\n\n","date":"April 29, 2014 at 7:46 am","url":"https://shroudstory.com/2014/04/26/how-valid-are-the-vignon-markings/","cat":"art","id":"comment-105697","author":"Charles Freeman","site":"shroudstory"},{"title":"How Valid are the Vignon Markings?","post":"Well I’ve now looked in enormous detail at Pia’s photos (try these for size! http://www.shroud-of-turin.org/images) and there is no crease. Not a smidgin. The crease is modern. No old painting can be based upon it.\nI don’t understand your reference to the Manopello painting, which probably dates to the late middle ages. \nNow, why don’t paintings show a uniform collection of abnormalities? Are we to suppose that every pantocrator painter had personal experience of the shroud, and they each picked out their own selection of imperfections? Some went for forked beards, some didn’t notice that the beard was forked but did spot a minutely visible imperfection in the weave between the eyes? The arbitrary selection of this or that characteristic is, I think, the main argument against these Vignon markings having credibility.\nThe St Catherine’s Pantocrator is one of the earliest. It seems to come from Constantinople in the 6th century. It shows no sign of having been derived from the shroud. The major features, the droopy moustache, the long pointed beard, the round shape of the hair around the head, and so on, bear no resemblance to the shroud. Even the asymmetric eyebrows and the bag under the left eye owe nothing to the shroud.Dozens of Pantocrators seem to be derived from this model. Christ wears a blue robe, carries a bible in his left hand and blesses with the right.\nThe other Pantocrator you link to is in Delphi, in Greece. This one is also typical of its group which represent a more graphic and sylised art form, with lots of well defined lines on the forehead and neck. There is possibly a greater case to be made here for derivation from the shroud, but I still don’t think the case holds water. You make the interesting comment that copying the facial hairstyle of a holy image is “splitting hairs.” This seems strange when artists are supposed to have studied the shroud in such detail as to copy minute imperfections of the weave as if they were essential parts of their reproductions.\nAll in all, I’m still not persuaded that the “Vignon markings” have any cogency.\n\n","date":"April 26, 2014 at 3:51 pm","url":"https://shroudstory.com/2014/04/26/how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104149","author":"Hugh Farey","site":"shroudstory"},{"title":"How Valid are the Vignon Markings?","post":"Well I’ve now looked in enormous detail at Pia’s photos (try these for size! http://www.shroud-of-turin.org/images) and there is no crease. Not a smidgin. The crease is modern. No old painting can be based upon it.\nI would not depend on a single photo, no matter Pia, Enrie, Miller, Schwortz, as the visibility of the crease may depend on lighting parameters. Nevertheless, the crease is (although barely) visible on the ShroudScope’s Durante photos.\nI don’t understand your reference to the Manopello painting, which probably dates to the late middle ages.\nThat means you know very little about Manoppello Image.\nNow, why don’t paintings show a uniform collection of abnormalities? Are we to suppose that every pantocrator painter had personal experience of the shroud, and they each picked out their own selection of imperfections? Some went for forked beards, some didn’t notice that the beard was forked but did spot a minutely visible imperfection in the weave between the eyes? The arbitrary selection of this or that characteristic is, I think, the main argument against these Vignon markings having credibility.\nThis seems strange when artists are supposed to have studied the shroud in such detail as to copy minute imperfections of the weave as if they were essential parts of their reproductions.\nHow should I make more clear to all those sceptics, that most of those images are copies of the copies of the images derived from the Shroud? That’s why the choice is arbitrary in several cases. Those are paintings, not photocopies. Besides, as we noted, even photographs may differ basing on their parameters, so what to say about paintings.\nThe St Catherine’s Pantocrator is one of the earliest. It seems to come from Constantinople in the 6th century. It shows no sign of having been derived from the shroud. The major features, the droopy moustache, the long pointed beard, the round shape of the hair around the head, and so on, bear no resemblance to the shroud. Even the asymmetric eyebrows and the bag under the left eye owe nothing to the shroud.\nLook carefully.\nThe other Pantocrator you link to is in Delphi, in Greece. This one is also typical of its group which represent a more graphic and sylised art form, with lots of well defined lines on the forehead and neck. There is possibly a greater case to be made here for derivation from the shroud, but I still don’t think the case holds water.\nAgain, look carefully. Count the number of similarities to the Shroud.\nAll in all, I’m still not persuaded that the “Vignon markings” have any cogency.\nThey have. But they are not everything. Every icon is specific and has its own similarities to the Shroud. \nBeside no one gave the better answer for sudden apperance of a single model of portraying Christ, that dominates Christian art since the 6th century. There must have been some archetype.\n\n","date":"April 26, 2014 at 4:09 pm","url":"https://shroudstory.com/2014/04/26/how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104154","author":"O.K.","site":"shroudstory"},{"title":"How Valid are the Vignon Markings?","post":"I agree Hugh.\n\n","date":"April 26, 2014 at 5:13 pm","url":"https://shroudstory.com/2014/04/26/how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104187","author":"Thomas","site":"shroudstory"},{"title":"How Valid are the Vignon Markings?","post":"Hugh refers to Vignon’s 1903 work “Le Linceul Du Christ”. This was the work following his studies of Pia’s negative photos, under Yves Delage, which Delage presented to the Paris Academy, and which concentrated on the anatomical aspects. Its antagonistic reception by the Academy led Vignon to look into comparisons of the various icons.  These results were not published until 1938 under the imposing title ““Holy Shroud of Turin: Science, Archaeology, History, Iconography, Logic”; It seems to have been sufficient for the French Academy to have relented and they awarded Vignon their prize.  \nWilson lists the markings claimed by Vignon as: Vignon Markings: 1) streak across forehead; 2) open square between brows; 3) ‘V’ shape at bridge of nose; 4) second ‘V’ within 2; 5) raised right eye-brow; 6) & 7) accentuated left & right cheeks; 8) enlarged left nostril; 9) accented line between nose & lower lip; 10) heavy line under lower lip; 11) hairless area between lower lip & beard; 12) forked beard; 13) transverse line across throat; 14) heavily accented owlish eyes; 15) Two strands of hair at forehead.  \nThe markings have often been debated, and have been parodied on Davor Aslanonovski’s web-site for instance.  Nevertheless it is apparent that many claim to recognise these marks. \nRecognition of facial likenesses is a highly subjective matter, and artists will all have their own interpretation of what constitutes likeness. It may be salient that it is unlikely that any computer software would be successful in matching a variety of artistic likenesses of the same subject for instance. \nIt may be more relevant to rely on subjective perceptions of recognition of the likeness of icons to the Shroud face, than trying to develop a systematic method as Vignon apparently attempted to do.  I personally consider that many of the icons do in fact show a close likeness to the Shroud face.  But that is a subjective interpretation for which each of us is entitled.\n\n","date":"April 26, 2014 at 4:35 pm","url":"https://shroudstory.com/2014/04/26/how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104167","author":"daveb of wellington nz","site":"shroudstory"},{"title":"How Valid are the Vignon Markings?","post":"ah… and I was determined not to say it again… wise words, daveb…\n\n","date":"April 26, 2014 at 5:18 pm","url":"https://shroudstory.com/2014/04/26/how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104190","author":"Hugh Farey","site":"shroudstory"},{"title":"How Valid are the Vignon Markings?","post":"The team of Ray Downing did perfectect work, be sure of that!\n\n","date":"April 27, 2014 at 9:00 am","url":"https://shroudstory.com/2014/04/26/how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104372","author":"Angel Wynton","site":"shroudstory"},{"title":"How Valid are the Vignon Markings?","post":"What does this have to do with the topic at hand?\n\n","date":"April 27, 2014 at 10:38 am","url":"https://shroudstory.com/2014/04/26/how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104401","author":"Dan","site":"shroudstory"},{"title":"How Valid are the Vignon Markings?","post":"Dan,, my gallery already sent…\n\n","date":"April 27, 2014 at 10:40 am","url":"https://shroudstory.com/2014/04/26/how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104403","author":"O.K.","site":"shroudstory"},{"title":"How Valid are the Vignon Markings?","post":"Charles:\nZanker relates them to iconography of philosophers,Christ is the first true philosopher. One has to remember that in Roman catacomb art all kinds of pagan precedents were integrated into the early iconography of Christ and this appears to be one of them. But there is no substitute for reading Paul Zanker – the work is on line for free. As you will see if you google him,he is one of the most respected art historians of this period.\nHere is link: http://publishing.cdlib.org/ucpressebooks/view?docId=ft3f59n8b0&brand=ucpress\nI used function ‘Search within this book’ to check the content. Here are the results: \nJesus: 2 hits in the Chapter VI\nChrist 104 hits, mostly (82) in chapter VI\nShroud: 0 hits of course.\nI checked all the phrases with ‘Jesus’ or ‘Christ’. Nothing significant. \nTruly saying, I think the theory that the well-known single model of portrayal of Jesus can be attributed to the portrayal of classical long-hair bearded philossopher is nothing but a pure nonsense. There are no evidence for this whatsoever. The portayals of Christ are radically different than Plato, Aristotle or Pythagoras, as you can see above (and in Zanker’s own book as well). One could equally claim that the image of Christ is derived from long-haired Merovingian kings (on the basis that Jesus was also a king, the King of the Kings).\nSorry but this is not worth a broken penny. On the contrary, the theory that the image of Christ is derived from the Shroud is based on incomparably much more solid basis. But Zanker “one of the most respected art historians of this period” seems to be completely unaware of it. That destroys is credibility whatsoever. That is just another argument for my theory that academic authority correlates with ignorance and stupidity.\n\n","date":"April 29, 2014 at 3:28 pm","url":"https://shroudstory.com/2014/04/26/how-valid-are-the-vignon-markings/","cat":"art","id":"comment-105976","author":"O.K.","site":"shroudstory"},{"title":"How Valid are the Vignon Markings?","post":"I know nothing of Zanker’s theory and and am disinclined to look into it.  If it gathers enough support and he is able to persuade others, it may survive, otherwise it will become just another discarded hypothesis that disappears into the dustbin of so many other rejected ideas, and there are very many such. \nI have noted that academic authority often does seem to correlate with ignorance and stupidity, and I think there are good reasons for it.  The Renaissance men seem to have been more enlightened, having an adequate generalist background.  Not only did each have his particular gifts, but they were able to engage in an informed way on a large variety of topics. Today life is more complicated, and there is a tendency to specialise far too early in one’s career.  The ancient Greeks, no matter what their calling were all trained in geometry, an excellent disipline in critical thinking.  Euclid’s “Elements” survived some 2000 years, but modern educators thought they knew better and discarded it from the curriculum around the 1960s, in favour of post-modernist theories, which contribute little to intelligence. \nEven the last 500 years in the history of Science have any number of anecdotes of students with brilliant insights, at first rejected by their mentors and professors, often resulting in severe mental anguish for the innovator, but which later proved to be more enduring than the received wisdom.  The Galois’ mathematical theory of Groups is only one such example, but there are very many other instances.  \nThe aspiring academic, could do no better than once having been trained in his particular discipline, he should secure for himself a wider background and be prepared to study in much broader fields to fit himself for intelligent discourse.\n\n","date":"April 29, 2014 at 4:35 pm","url":"https://shroudstory.com/2014/04/26/how-valid-are-the-vignon-markings/","cat":"art","id":"comment-106015","author":"daveb of wellington nz","site":"shroudstory"}]
