[{"title":"More on How Valid are the Vignon Markings?","post":"I had sent updated paper with Vignon marks count, have you received it Dan?\n\n","date":"April 27, 2014 at 3:45 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104458","author":"O.K.","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"There it is. I missed it. I’ll update it sometime this evening. I’m not home right now.\n\n","date":"April 27, 2014 at 3:59 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104460","author":"Dan","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"I have already sent an updated version with Novogrod Mandylion (so now there are 20 icons) and some basic descriptions from Wikipedia.\n\n","date":"April 27, 2014 at 5:08 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104475","author":"O.K.","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"Good job OK. I think it takes a lot of Faith in skepticism to deny the connection\n\n","date":"April 28, 2014 at 7:29 am","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104802","author":"Mike M","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"Thanks to O.K. and also to Dan for the posting.  I mentioned the Vignon markings in a recent presentation to my local U3A group. I intend sending them a reference to the file. It would enhance the file and perhaps assist more widespread distribution, if O.K. could also find the time to add a subtitle to each of the icons and also their likely dates of provenance, as well as the URLs of the sources he has already shown.\n\n","date":"April 27, 2014 at 3:47 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104459","author":"daveb of wellington nz","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"In the original post, Hugh said, “Well I’ve now looked in enormous detail at Pia’s photos (try these for size! http://www.shroud-of-turin.org/images) and there is no crease. Not a smidgin. The crease is modern. No old painting can be based upon it.”\nI agree, there may be no crease there. It is possibly an oval object that is even clear in Pia’s images. The lower edge of that object is more apparent, but the whole thing is not shaped like a crease would be. Please refer to Vernon Miller’s images in this link\nhttp://shroud3d.com/findings/solid-oval-object-under-the-beard\n\n","date":"April 27, 2014 at 5:32 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104479","author":"Mike M","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"Breaking news: One of the oldest images of Jesus found by Spanish archaeologists in Egypt? It is said to show a curly-haired Jesus, however no image is available, and the inscriptions are yet to deciphered. It is dated to the sixth century.\n http://www.thelocal.es/20140425/spanish-team-finds-hidden-tomb-of-jesus\n\n","date":"April 27, 2014 at 7:17 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104518","author":"Louis","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"I checked the item. I note that one of the archaeologists said “We could be dealing with one of the earliest pictures of Jesus” so the identity is still a little speculative, and as Louis says the inscriptions have still to be deciphered.  Saint Mark is sometimes credited with early missionary activity in Egypt. Possibly it might even be him or some other??\n\n","date":"April 27, 2014 at 7:33 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104528","author":"daveb of wellington nz","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"Daveb, we seem to have been struck with the same thought, I was also thinking about a saint.\n\n","date":"April 27, 2014 at 7:38 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104531","author":"Louis","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"According to Coptic tradition, St. Mark walked till Alexandria (Northern Coast of Egypt)  where his sandals were damaged from the long trip. He went to Ananias (a cobbler) to fix them, that’s when he shared the Gospel with him. He became the first Coptic Christian, and the coptic church started then (later became Bishop).\n\n","date":"April 27, 2014 at 7:42 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104533","author":"Mike M","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"Perhaps the ancient Copts looked at Jesus through an Egyptian filter:\nhttp://www.dreamstime.com/royalty-free-stock-images-head-bust-egyptian-man-isolated-image28240039\n\n","date":"April 27, 2014 at 7:34 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104529","author":"Louis","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"Note that Paul Vignon published his main work on iconography in 1938.  Guiseppe Enrie, a professional photographer produced results much superior to those of the pioneer amateur Pia’s of 1898, in 1931.  Presumably Vignon worked from Enrie’s photographs rather than Pia’s.  I think this would negate some of Hugh’s criticisms that some of the marks do not show on Pia’s photographs which are generally acknowledged as inferior to Enrie’s.\n\n","date":"April 27, 2014 at 7:22 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104521","author":"daveb of wellington nz","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"I agree, Pia was working under extremely difficult lighting conditions, a glass cover to the shroud and photography was not well developed. But the oval object can even be seen in Pia’s photograph (albeit very faintly). The point I was trying to make is that it could be part of the image. If that’s the case then it predates Pia’s image and would be seen by Byzantine artists.\n\n","date":"April 27, 2014 at 7:59 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104540","author":"Mike M","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"Personally I think the Vignon markings are absurd.\nHow artists could get detailed features such as these out of the faint and indistinct Shroud image is beyond me.\nThat’s not to say the Shroud image could not have influenced this artistic tradition in a more general manner. General features such as the facial shape (long face, long nose), hair length, and facial hair features are shared between the two.\nAlthough the artistic tradition could easily have developed in the way it did without the shroud too.\n\n","date":"April 28, 2014 at 12:21 am","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104619","author":"Thomas","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"I have updated the posting. O.K. sent a newer version of the file with markings.\n\n","date":"April 28, 2014 at 12:25 am","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104621","author":"Dan","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"Good work, O.K.\nIan Wilson included a very comprehensive display of examples of icons and copies of the mandylion in a slide-show for his paper he presented at the Valencia conference in 2012.  Of some interest is his display of various classifications of the various types of mandylion presentations: rectangular plain or with roundels, decorative lattices; large billowing types. Both the text and slide-show files can be found at:\nhttp://www.shroud.com/pdfs/wilsonvppt.pdf\nunder heading title “Discovering more of Shroud’s Early history”, Valencia Conference 2012.\n\n","date":"April 28, 2014 at 1:31 am","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104633","author":"daveb of wellington nz","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"Nice slide show Dave, the best I’ve seen on the Mandylion so far. Thanks for sharing.\n\n","date":"April 28, 2014 at 7:15 am","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104786","author":"Mike M","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"Fantastic collections of images, but I’m afraid the Vignon markings are simply not as convincing to me as they are to others. Maybe it’s the flowers thing all over again. OK lists the famous 15 marks, two of which, as I have clearly established, weren’t present on the Shroud at all. (To claim that just one of the three distinctive creases of the Enrie photo, as bright as the two big ones bracketing the face, was somehow omitted by Pia because of the lighting conditions is really not justified. and there is no reason to claim that all the blood trickles were somehow converted into two little wisps of hair).\nThe point about the Vignon markings is that they appear on images and “cannot be artistically justified except with reference to the shroud.” And there’s no doubt that the Roman catacomb portrait does have a big meaningless square between the brows. It is, however, the only instance of that in all the images I have seen (It is not one of OK’s examples). All the others, and every instance of the supposed “forehead streak” and most of the “V”s, are perfectly reasonable deliniations of the supra-orbital ridges and bulge of the forehead, and need owe nothing to any supposed imperfections on the shroud.\nA very few images, it is true, have well defined, and apparently meaningless well defined curvy lines, loops and triangles drawn across the brows, and these, I agree, need explaining, but they look nothing like the faint imperfections on the shroud. OK, like most “Vignon spotters” somewhat arbitrarily assigns these to “topless squares,” and the two supposed V’s within and below them.\nA single casual glance at the image on the shroud shows a roughly rectangular face with no visible ears, a bushy moustache and a short, stubby, split beard. Astonishingly, in spite of their alleged study of minute differences between single threads, not a single one of OK’s images can be so described. Even more surprising, perhaps, is the fact that Vignon’s own sketch (if so it be; it seems the most reproduced) of his markings looks nothing like the shroud face either! A simple overlay test, such as is much beloved by the Leonardo da Vinci, Albrecht Durer and Akiane Kramarik schools of thought, shows no comparison at all.\n\n","date":"April 28, 2014 at 3:38 am","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104662","author":"Hugh Farey","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"There are a number of issues here.  Firstly I think that there can be little question that the markings are present to varying degree on very many icons and on representations claimed to be based on the mandylion. Vignon and Wuenschel together deduced some 20 of them, Wilson has reduced them to 15. The second issue is what is the original source of these markings? Vignon was persuaded that it was the Shroud image, and Wilson echoes this.  Vignon apparently considered there were markings on the Shroud corresponding to the common elements that he had found on the icons. An explanation is needed as to why the various markings are repeated on so many of the icons.  Clearly there was some template on which they were based.  The various icons are generally claimed to be based on the image of Edessa, whatever that was.  Syriac monks dispersed copies of the image and it circulated around eastern christendom from about the sixth century following the emergence of the original in Edessa. \nHugh is setting himself up as a more authoritative observer than Vignon, Wuenschel and Wilson and is denying that he can perceive these markings on the Shroud image.  Whether he is justified in doing so might be argued.  Certainly other Byzantine art authorities have questioned the relevance of the markings and few of them seem willing to accept the significance of the markings. Why they do not consider them significant seems somewhat astonishing to myself, as they are readily apparent to me and to others and seem to demand explanation. \nThe third issue is whether after setting the markings aside, one can assert a subjective likeness exists between the iconic representations and the Shroud image.  In his last paragraph above, Hugh has gone as far as denying that even this is possible.  My own subjective interpretation is quite different, and I consider that there is a likeness.\n\n","date":"April 28, 2014 at 7:41 am","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104813","author":"daveb of wellington nz","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"Not bad but.\n1) Of course I’m a more authoritative observer than Vignon. So is anybody else. Vignon would have given his eye-teeth for shroudscope or Shroud 2.0. His 1938 book was based on Enrie’s photographs, which, however good for their time, are nothing like as good as the ones we have today.\n2) I do not deny that all these marks (apart from the hairstrands and the crease) are distinguishable in one form or another on the shroud. What I deny is that perfectly natural depictions of the contours of the brow, on the one hand, or precisely delineated wavy lines with loops and triangles, on the other, are obviously derived from these markings.\n\n","date":"April 28, 2014 at 9:45 am","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104896","author":"Hugh Farey","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"I don’t think the 1st point is Valid. Vignon was comparing the Shroud to what Byzantine artists were observing. Since Byzantine artists didn’t have high definition images of the shroud then Vignon would have no disadvantage there.\n\n","date":"April 28, 2014 at 12:34 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-104992","author":"Mike M","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"Byzantine artists probably never got close enough to see any of the alleged weave imperfection markings at all.\n\n","date":"April 28, 2014 at 2:35 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-105065","author":"Hugh Farey","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"How did you know?\n\n","date":"April 28, 2014 at 6:09 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-105184","author":"Mike M","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"Wild guess!\n\n","date":"April 28, 2014 at 6:39 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-105207","author":"Hugh Farey","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"So Hugh, it is time for my response:\nTo claim that just one of the three distinctive creases of the Enrie photo, as bright as the two big ones bracketing the face, was somehow omitted by Pia because of the lighting conditions is really not justified.\nSee http://www.shroud.com/shroudfr.gif and compare with http://upload.wikimedia.org/wikipedia/commons/9/9b/Full_length_negatives_of_the_shroud_of_Turin.jpg Where is the upper crease just above the head, for example?\nThe point about the Vignon markings is that they appear on images and “cannot be artistically justified except with reference to the shroud.” And there’s no doubt that the Roman catacomb portrait does have a big meaningless square between the brows. It is, however, the only instance of that in all the images I have seen (It is not one of OK’s examples). All the others, and every instance of the supposed “forehead streak” and most of the “V”s, are perfectly reasonable deliniations of the supra-orbital ridges and bulge of the forehead, and need owe nothing to any supposed imperfections on the shroud.\nA very few images, it is true, have well defined, and apparently meaningless well defined curvy lines, loops and triangles drawn across the brows, and these, I agree, need explaining, but they look nothing like the faint imperfections on the shroud. OK, like most “Vignon spotters” somewhat arbitrarily assigns these to “topless squares,” and the two supposed V’s within and below them.\n\nThis means that either you, or those who maintain this, does not understand what’s going on. There are no unique Vignon markings. All of them can find some non-Shroud explanation. But the key is  that they, even if stylishly incorporated as either “supra-orbital ridges and bulge of the forehead” or anything else (which is just artistic interpretation) are present on those portraits (along with several other marks). Why? Isn’t it an attempt to “naturalize” some barely visible signs on the Shroud which origin they didn’t understand? They are not always visible at first glance but they are, even if just symbolically marked. But one needs to carefully and patiently observe those icons -what, I suppose, you do not, instead judging from the first impression.\nRemember, 2-3 marks means nothing -they may be accidental. But 5-6 are significant.\nA single casual glance at the image on the shroud shows a roughly rectangular face with no visible ears, a bushy moustache and a short, stubby, split beard. Astonishingly, in spite of their alleged study of minute differences between single threads, not a single one of OK’s images can be so described.\nByzantine artists probably never got close enough to see any of the alleged weave imperfection markings at all.\nHugh, I want to underline this : those are not exact photocopies of the image on the Shroud. Instead, they are usually  copies of copies of images derived from the Shroud Most of the artists that painted those, never saw the Shroud. But they saw some other similar icons (derived from the Shroud) with some strange, unexplained markings on them, which they dutifully marked on another copies. Without asking unnecessary questions: why. It is not about reproducing photographically the shape of the nose or bird, symbollism and mystery are much more important in the icon business. There is a forked beard, so let there be forked beard, there is a small traingle between eye, or two little strands of hair, so let it be. They don’t have to look exactly the same, but they must be represented in some way, because it is some “theological mystery”, to say at least. \nEven more surprising, perhaps, is the fact that Vignon’s own sketch (if so it be; it seems the most reproduced) of his markings looks nothing like the shroud face either! A simple overlay test, such as is much beloved by the Leonardo da Vinci, Albrecht Durer and Akiane Kramarik schools of thought, shows no comparison at all.\nThat’s no truth at all Hugh! What about this https://shroudofturin.files.wordpress.com/2011/11/image44.png\nOr this: http://www.theanimationacademy.com/an/JesusShroud7a.jpg\nor this paper of Resch (of whom I have not a high opinion, truly saying) http://www.acheiropoietos.info/proceedings/ReschWeb.pdf\n1) Of course I’m a more authoritative observer than Vignon. So is anybody else. Vignon would have given his eye-teeth for shroudscope or Shroud 2.0. His 1938 book was based on Enrie’s photographs, which, however good for their time, are nothing like as good as the ones we have today.\nAnd what have I used – isn’t it 2002 Durante from Shroud Scope? \n2) I do not deny that all these marks (apart from the hairstrands and the crease) are distinguishable in one form or another on the shroud. What I deny is that perfectly natural depictions of the contours of the brow, on the one hand, or precisely delineated wavy lines with loops and triangles, on the other, are obviously derived from these markings.</I.\nSo Hugh, let me ask a rhetorical question, if those are not derived from the Shorud, than from what?\nLook more carefully, Hugh. The similarities are astonishing, one just doesn’t have to turn own eyes away.\n\n","date":"April 28, 2014 at 4:35 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-105123","author":"O.K.","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"Hugh’s objections do not discover the reason why the various markings on iconography regularly occur. The likenesses also show on coinage, gold solidi of Justinian II of 692AD, and Constantine VII of 945AD, Homs vase 6th-7th century Louvre (Emesa, Syria). Constantine’s solidus appeared within a year after the mandylion’s arrival in Constantinople, and he was known to have closely inspected it on its arrival there. He describes it as ‘extremely faint, a moist secretion without pigment or painter’s art’; others saw it as blurred. This certainly matches the indistinct image of the Shroud cloth. That such a close similarity to the Shroud image appeared on his coinage is quite remarkable. \nWe do not know how the mandylion image was copied and conveyed to the various iconographic artists, whether there was one or more templates made from the original, or how a standard Christ-like portrait came to be.  There may have been only one or perhaps merely a few artists involved in making the templates from the original.  There was clearly scope for artistic interpretation in creating the templates from the original. It seems likely that only a few artists would have access to the original mandylion. However that such a standard form appeared with repetition of particular features seems clear enough and argues for a common origin. That at least some of these features can be found on the Shroud image, is at least reasonably suggestive that the common source was in fact the Shroud image, however remote from it, subsequent copies came to be.\n\n","date":"April 28, 2014 at 4:45 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-105132","author":"daveb of wellington nz","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"Fair enough.\n\n","date":"April 28, 2014 at 5:33 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-105158","author":"Hugh Farey","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"I have at last located and bought a copy of Le Saint Suaire de Turin, and will comment further when it arrives. Until then, I have to say I think OK and I have differing ideas about what the point of the Vignon markings is. He implies (forgive me if I misunderstand) that adding any natural texture to the brow is a subconscious reference to some misunderstood marks on the shroud, while I disagree and think that it is simply what it appears to be and nothing more. The whole point about ghe Vignon markings, as I understand it, is that by making no artistic sense,  they prove that they must have derived from some other tradition which the artist didn’t understand. And I have already agreed that the style of pantocrator with the distinct wavy lines and triangles is one such anomaly. What I don’t agree in that case is that these designs are obviously derived from the shroud.\nI’m afraid I’m not taken in by any of OK’s superpositions. All faces have eyes and mouths, and any two full face portraits can be related so that these features coincide. The fact remains that the most obvious and easiest to copy features of the face on the Shroud are not reflected in any of the Byzantine portraits, with their ovoid faces, with narrowed chins or beards, droopy moustaches and visible ears. I don’t expect them to be photocopies, and no doubt most of them were copies of copies, but it is disingenuous to claim on the one hand that the copiers were only vaguely accurate about what they were depicting en large, but fanatically careful to include minute details – for mystery’s sake. I’m afraid I don’t think OK’s post has refuted any of my previous comment, and I don’t retract a word of it.\n\n","date":"April 28, 2014 at 6:39 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-105205","author":"Hugh Farey","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"Hugh:\nThe whole point about ghe Vignon markings, as I understand it, is that by making no artistic sense, they prove that they must have derived from some other tradition which the artist didn’t understand. And I have already agreed that the style of pantocrator with the distinct wavy lines and triangles is one such anomaly. What I don’t agree in that case is that these designs are obviously derived from the shroud.\nIf not from the Shroud, than from what? I cannot find any better model, and the number of similarities between those icons and the Shroud is striking. They are not direct proof, but the number and frequency of Shroud similar points (not only Vignon marks, which have some flaws, but no one suggested better set) is also far above what one could expect from simply random occurences.  \nI’m afraid I’m not taken in by any of OK’s superpositions. All faces have eyes and mouths, and any two full face portraits can be related so that these features coincide.\nYou are inconsistent. You claimed before that  A simple overlay test, such as is much beloved by the Leonardo da Vinci, Albrecht Durer and Akiane Kramarik schools of thought, shows no comparison at all. and I showed that it is exactly opposite. Overlay tests are useful, but they are frequently overused as proof for some strange ideas (Leonardo or Good Shepherd examples), so they cannot be considered conclusive. It is a combination of those + some minute details like Vignon markings + some general similarities + some common sense (it is absurd to look for Vignon marks on the Virgin Mary icons for example, because even if they appear sometimes, they are obviously not derived directly from the Shroud) to make a good case.\nThe fact remains that the most obvious and easiest to copy features of the face on the Shroud are not reflected in any of the Byzantine portraits, with their ovoid faces, with narrowed chins or beards, droopy moustaches and visible ears.\nHugh, those are exactly the features of the Shroud face, and they are reflected on those Byzantine portrait. Strange you can’t see it. Watch the Durante photo in my paper carefully, it is exactly ovoid face, with very (even pathologically) narrowed chin and jaw, especially on the right (from the viewers perspecitve) side! Compare it with Sinai Pantocrator. Have you even read my remarks about that face? See also the droopy mustache and compare it with the Shroud, it ends abruptly on the right side much closer to the centre than on the left side, exactly the same as on the Durante’s photo. What about right-skewed nose? What about scar on the neck, just in the very similar place like on the Durante’s photo? Haven’t you noticed that?\nAs to the ears, they were simply added by Byzantine artists. Jesus, as being fully human, obviously had to have both ears.\nI don’t expect them to be photocopies, and no doubt most of them were copies of copies, but it is disingenuous to claim on the one hand that the copiers were only vaguely accurate about what they were depicting en large, but fanatically careful to include minute details – for mystery’s sake.\nSee above.\nAnd one another thing -see the gallery of painted Shroud copies. http://www.acheiropoietos.info/proceedings/MarinelliWeb.pdf\nThey were certainly derived from the Shroud, nevertheless they have often far greater differences from the original than all those Byzantine icons.\n\n","date":"April 29, 2014 at 4:51 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-106023","author":"O.K.","site":"shroudstory"},{"title":"More on How Valid are the Vignon Markings?","post":"Your last point is very well taken, copies of the shroud are often fairly grotesque and indeed look nothing like the shroud image (at least as far as the face is concerned). As for the rest, I’m afraid we’ll simply have to differ. My own opinion is that the man on the Shroud looks very like most of the philosophers illustrated in Zankar’s book (which you link to elsewhere: http://publishing.cdlib.org/ucpressebooks/view?docId=ft3f59n8b0&brand=ucpress), and not much like the Byzantine icons often said to be derived from it. For the benefit of those who may be following this conversation without taking part, I ask them to compared the image of the Shroud with, say, the early Byzantine icon now at St Catherine’s monastery (http://www.graceiseverywhere.net/category/praise/, the entry for 3 Feb 2013 is an enlargeable version), and Figure 9 from Zankar. To me the Shroud is far more reminiscent of the Homeric ideal than it is of the droopy moustached Byzantine, and no doubt OK thinks the opposite. What do the rest of you feel?\n\n","date":"April 29, 2014 at 6:26 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","id":"comment-106080","author":"Hugh Farey","site":"shroudstory"}]
