[{"title":"New Posting by Joe Nickell at CFI","post":"About three or four hours ago, my eye is accidentally\ndropped on a page of a modern “general encyclopedia”\nthat claimed it was 10 or 12, the value for the “maximum\nnumber of components on mass spectrometry analysis” …\nIs that fact an example of “significative coincidence”?\n\n","date":"October 8, 2015 at 10:01 am","url":"https://shroudstory.com/2015/10/08/new-posting-by-joe-nickell-at-cfi/","cat":"other_blogs","id":"comment-212047","author":"piero","site":"shroudstory"},{"title":"New Posting by Joe Nickell at CFI","post":"I think that, obviously, the encyclopedia\nwas referring to the numbers 10 or 12\nas the maximum number of identifiable\nsubstances IN A MIXTURE of ten or twelve chemicals …\nAnd now I ask:\nWhere are the opinions of real experts of mass spectrometry?\n\n","date":"October 8, 2015 at 10:19 am","url":"https://shroudstory.com/2015/10/08/new-posting-by-joe-nickell-at-cfi/","cat":"other_blogs","id":"comment-212051","author":"piero","site":"shroudstory"},{"title":"New Posting by Joe Nickell at CFI","post":"This seems to be “a banal problem of Materials Science”…\nIn any case the presence of Squalene on “1EB” sample\ncan be a possible “interesting fact” (but this has few [or nearly nothing] to do not with the “strange claims” by Bella, Garlaschelli and Samperi…on “polyethylene oligomers”) because the main component of human sebum is squalene, an unsaturated lipid …\nIn human sebum there are unique lipids, such as squalene and wax esters not found anywhere else in the body nor among the epidermal surface lipids. \n>Human sebum consists of squalene, esters of glycerol, wax and cholesterol, as well as free cholesterol and fatty acids.\nLink:\nhttp://www.ncbi.nlm.nih.gov/pmc/articles/PMC2835893/table/T1/\n— —\nSee also: the squalene and cholesterol content of sebum and the possible function of squalene in human sebum…\nHere it is not my intention to enter in particular\n“Photobionics speculations” (on Squalene and UV role)…\nAnd it is not my Intention to intimidate or frighten you with possible “goofy ideas”…\n\n","date":"October 8, 2015 at 10:46 am","url":"https://shroudstory.com/2015/10/08/new-posting-by-joe-nickell-at-cfi/","cat":"other_blogs","id":"comment-212055","author":"piero","site":"shroudstory"},{"title":"New Posting by Joe Nickell at CFI","post":"CSI has the right to be sceptical about many things in our world if the number of hoaxes, legends and the rest are taken into account. Their mistake is to ignore psi and the fact that genuine parapsychological phenomena are spontaneous and can therefore not be tested in a laboratory. They appear as though by accident.\nBut, coming to the topic of the Shroud, their point of view is the result of unfinished work in the realm of Shroud studies. The “greats” in the field published their papers and took it for granted that what they proffered would be unchallenged. They are now silent. Why? Because only chummies/buddies were allowed to publish what they wanted in newsletters or websites and get away with it and not all those who were writing papers were professionals in the field. The result is that Turin has turned down requests for a a new hands-on examination of the relic.\nScepticism is growing as each day passes by and the Judaeo-Christian worldview is becoming unconvincing because of some discoveries in science. The Genesis creation story was borrowed from Mesopotamian mythology, and written between the 7th and 5th centuries BC. Sean Freyne preferred the 5th century. There are two creation accounts because there are two sources: Jahvist and Priestly. Mythology was adapted to suit monotheist ends.\nThis does not mean to say that the Bible is myth. The science-theology dialogue has to continue:\nhttps://www.academia.edu/16566394/An_introduction_to_chaos_theology\n\n","date":"October 8, 2015 at 11:22 am","url":"https://shroudstory.com/2015/10/08/new-posting-by-joe-nickell-at-cfi/","cat":"other_blogs","id":"comment-212058","author":"Louis","site":"shroudstory"},{"title":"New Posting by Joe Nickell at CFI","post":"It is true that contamination by microbial coating is unconvincing as the reason why the 1988  carbon dating results may have been skewed. Ian Wilson wrote in favour of this theory because of the surface sheen he had detected on the Shroud. Whatever, it is important to stress that no examination was made of the chemical composition of the sample. My guess is that since the body images are getting to be very controversial more attention will have to be devoted to the bloodstains.\nSo we are left with some chaos in the field of Shroud studies and stuck in the quest for transcendence that even the godless Jew Freud believed was what humans were looking for. In more recent times, the English Catholic historian Paul Johnson has been looking for a  “superior form of monotheism”. Freud was right:\nhttps://www.academia.edu/12823419/Book_Review_Jesus_and_Yahveh_the_names_divine\n\n","date":"October 8, 2015 at 3:25 pm","url":"https://shroudstory.com/2015/10/08/new-posting-by-joe-nickell-at-cfi/","cat":"other_blogs","id":"comment-212079","author":"Louis","site":"shroudstory"}]
