[{"title":"\"Just the facts, ma’am.\"","post":"I have been authorised to post an interview with Professor Giulio Fanti of the University of Padua, which became ready this week, and can be accessed using the link below.\nIt is being posted on this blog to defend Professor Fanti, who has been doing painstaking  research on the Turin Shroud for the past seventeen years, from unjust attacks.\nI regret to say that the Church, although moving slowly, with enough time to learn from mistakes, like the ones committed by Cardinal Anastasio Ballestrero and Professor Luigi Gonella, has not formed a committee of scientists to advise the archdiocese of Turin about future research on the Shroud. It does seem that poor Pope Francis, struggling to put his Church in order, is not aware that the leprosy has spread beyond the Curia.\n https://www.academia.edu/8740927/Professor_Giulio_Fanti_discusses_the_controversies_in_the_realm_of_Shroud_studies\n\n","date":"October 12, 2014 at 10:59 am","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-161668","author":"Louis","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"Stalling for time?\nWhat the ‘shroudology’ morass  demonstrates to perfection are the hazards of an incomplete database, one in which the gaps are filled in by exercise of imagination, nay fantasy. One has to ask: who is pushing for those gaps to be filled, and who is not?\nI came across a pertinent analogy recently from an entirely different context while travelling in Georgia (eastern Europe). Mr. Putin is being accused there of engineering what have been called ‘frozen conflicts’ on his borders with territories (like Georgia, Ukraine, Latvia etc ) that used to be part of the Soviet Union, but have since had the temerity to break free from the embrace of Mother Russia. \n“Frozen conflict”? Like that in which the C-14 dating is routinely referred to as a “fiasco” and the C-14 scientists as a dodgy bunch of co-conspirators?  But when one suggests that a repeat determination  with more sampling sites is all that’s needed to clear the air, there are instantly cries that ALL C-14 dating of ancient linen, especially that bearing images of the crucified Jesus, are inherently unreliable. There are insuperable problems of contamination, or exposure to earthquake radiation, bla bla, didn’t you know? \nYeah, right. Keep the “frozen conflict” going as long as possible, eh?\nIs everybody booked in for the not-to-be-missed 2015 Shroud exposition?  Make hay while the sun shines…\n\n","date":"October 12, 2014 at 12:00 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-161690","author":"Colin Berry","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"Oh, dearie me. Although I deplore any vicious personal attacks and obscene language directed towards anyone, I fear that Louis’ paper is unlikely to rehabilitate Prof. Fanti in the eyes of those who think him discredited. \nLet’s start with the task of demonstrating the truth of the Resurrection. ” It will have to be demonstrated beyond doubt that the image formation was near-instantaneous, if not instantaneous, a task that can be easily handled by both Professor Giulio Fanti and Professor Paolo di Lazzaro.” A task that can be easily handled? Hmmm. The reason given for near-instantaneousness being that all Jesus’s miracles were instantaneous. Really? What about the feeding of the five thousand? Or walking on water? Hmmm.\nThen we move on to demonstrating that the Shroud has been reliably dated to the 1st century AD by three different dating methods. These were publicised in his book ‘Il Mistero della Sindone,’ and soundly criticised to such an extent that the paper based on it later submitted for peer review did not mention the Shroud of Turin at all, and excluded the multi-parametric mechanical analysis entirely. The Shroud has certainly not been “reliably dated” to the 1st century AD.\nNext we find that criticism about the provenance of his Shroud fibres was unjustified because “I made it clear that that the samples were among those taken by STURP in 1978 and considered authentic by the previous papal custodian, Cardinal Giovanni Saldarini, who encouraged me in my Turin Shroud studies,” and in the paragraph below Louis says, “You received the fibres from the same sample in the possession of Shroud scientist Ray Rogers.” In fact of course Fanti’s own book makes it perfectly clear that he was testing “le polveri aspirate nel prelievo ufficiale del 1978 sul lenzuolo torinese dalla zona dell’immagine dei glutei” and (although I could have missed it) I find no mention of Rogers’ fibres at all. STuRP, of course, disassociated themselves from Giovanni Riggi’s vacuum cleaner experiments, and neither considered them nor mentioned them in their subsequent investigations. The samples taken by STuRP were tape extractions directly from the surface of the Shroud. Riggi’s hooverings came from between the Shroud and the backing cloth.\nThen we move on to the idea that the entire radiocarbon sample, and a larger area around it, was part of a 13th century patch, which consequently dated to the 13th century when radiocarbon tested. Mechtilde Flury-Lemberg did not notice any such patch. “Perhaps Dr. Flury-Lemberg was looking possible discontinuities, some traces of workmanship, caused by the  junction between the main Shroud and a possible patch in an area very close to the location from where the 1988 sample was cut. It appears that she did not go beyond that area.” No, it doesn’t. It appears that there is no evidence for a large patch.\nNow we wander off track, discussing the Bari conference and digressing briefly into the theory of evolution. “Evolution is frequently referred to as though it is something that can explain why Man is on Earth, especially by some biologists, but that is not true. It involves huge problems and explanations are needed. It is the means used by atheists to “demonstrate” that God is not necessary, but they fail when it comes to many points, which are frequently hidden from the public.” Oh, dear. Here we go again. The implication, of course, being that anybody who believes in evolution is an atheist. Including the previous two popes, I suppose, so it puts me in good company. Once again (see an earlier post) not believing that the Shroud is authentic is prima facie evidence for atheism.\nBack to the Shroud, and DNA. Especially from 24 identified plants (listed on page 183 of Il Mistero della Sindone). Guess how many of these were identified by Max Frei on his pollen tapes. Just two. And where are Scheuermann’s Chysanthemum, or Avinoam Danin’s “continuous carpet” of Matricaria, or Anthemis, or Gundelia, or Zygophyllum, or Thomas Litt’s Carduus? Is this evidence of anything? What does Prof. Fanti say? “The recent results of dusts vacuumed from the TS confirm the data obtained by Frei Sulzer; the fragments of pollen grains on the relic detected by me match the results published by him.” Well, they don’t, do they.\nWandering off again, we visit the Jospice mattress and a handkerchief with paintings of Padre Pio on one side and Jesus on the other that I am not familiar with. “According to Professor Pietro Baraldi of Modena University the image is made of no substance known on earth.” Wooo.\nSorry for the length. I was accused yesterday of not being rigorous enough with my investigations into evidence, a claim that will return to haunt the accuser, I fear…\n\n","date":"October 12, 2014 at 2:08 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-161719","author":"Hugh Farey","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"I wish Hugh would post his comments in the proper way,avoiding writing “Hmmm’, “wooo” and what not. That is a sign of disrespect. \nProfessor Giulio Fanti has not been discredited, he presented papers in Bari and the rest were read in Saint Louis. The University of Padua does not belong to Ted Turner, it has no money to throw down the drain.\nHugh has called himself a “core Catholic” but does not understand miracles, not exactly current discourse among those who consider themselves “enlightened”, but accepted by many Christians and the Church of which he is a member.\nAnyone who reads the New Testament carefully will notice that the miracles are divided into categories, and so we have healing and curing and nature miracles and so on. Nature miracles — like the feeding of the five thousand — did not have to be instantaneous, only the healing and curing miracles and the last miracle had to be so. In the last miracle Jesus did not wake up and wait for someone to bring him a stretcher. God is not subject to time, we are, or does someone who believes in God also believe that He was created after the big bang?\nRegarding the book and the paper authored by Professor Fanti, it is the method that is important, the author leaves it to the reader to accept or reject it. The fibres he has in his possession are authentic, that is why Archbishop Cesare Nosiglia wanted them back.\nIf Hugh had read the interview-article carefully he would notice that Professor Fanti is still working on the thirteenth-century patch hypotheses, no paper has been published, so one must wait.\nProfessor Fanti did not say that he identified all the pollen grains listed by Max Frei-Sulzer. The important thing here was to stress, as I did, that Ray Rogers was wrong when he felt that they could not be used in Shroud research. One must remember that Professor Litt never said anything about the state of the grains,he merely questioned the identification of Gundelia tornefortii.\nPadre Pio is revered in Italy and in many places around the world. Around eight hundred thousand people flocked to see his body when it was exposed and one can be sure that Graham Greene would be in the queue if he were alive. The article mentions what was the English liberal Catholic novelist’s reaction after attending his mass. Greene also carried two “holy pictures” of the priest in his wallet for the rest of his life. Professor Pietro Baraldi is a respected scientist, he teaches Applied Chemistry and Geology at the University of Modena.\nI knew Hugh would have nothing to say about the Jospice Mattress Imprint, and that is because Professor Fanti’s findings confirm, to a certain extent, my own point of view, written in an article that was published years ago. Hugh prefers to support the view, expressed in England recently, that someone, thinking that Les looked like Clark Gable(?!) painted that imprint. And what was Father Francis O’Leary doing meanwhile? Having a nice English breakfast, complete with coffee, eggs and sausages? No. The good priest, with whom I had some contact, was an intelligent and highly spiritual man. He knew that the imprint was not the work of an artist, in fact no one in the team brought by the BBC, none of the medical practitioners in England, Dr. Philip Calahan and Dr.Frederick Zugibe thought so. The only difference I had with Father O’Leary was that I refused to accept the imprint as a spiritual phenomenon.\nI would like to see some artist, preferably someone trained in Courtauld, provided with bilirubin or some other body fluid, and asked to paint an imprint exactly like what we see on the Jospice Mattress.\nIt is unlikely that good Pope Francis will bother about testing the TS now. He has more important things to worry about and would not like the faithful to carry copies of the Turin Shroud around and preaching, “Look here, Jesus was resurrected’ or “God exists”. He knows that the primitive Christians did not carry any burial cloth to prove what they were saying, although the Jesus movement was a Resurrection Movement, not an Empty tomb movement.\nThere is only one thing Hugh and I have in common in this topic. Our faith does not depend on the authenticity of the Shroud.\n.\n\n","date":"October 12, 2014 at 4:12 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-161753","author":"Louis","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"One more thing I forgot to add: Hugh does not say anything about the DNA studies, or is that also rubbish?\n\n","date":"October 12, 2014 at 4:29 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-161759","author":"Louis","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"Along with the few items Bruno Barberis said that must be re-examined in a future direct study of the Shroud, I would also underline the crucial question of the image chromophore (which is still debated) and the also crucial question of the banding effect and what seems a very close relationship with the image density.\nI think these two things should be placed on-top of the next test plan, over all the things Mr. Barberis mentioned (even if I agree with him that these things too must be checked out again)…\n\n","date":"October 12, 2014 at 4:58 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-161765","author":"Yannick Clément","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"When Mr. Barberis say “Oxidation and dehydration origins and characteristics”, I think he is referring to the question of the chemical composition of the color chromophore (which Rogers concluded to be ONLY coming from a dehydration process, without the help of any oxidation process).  That’s a very important issue to settle of course, but what I have in mind when I talked about the image chromophore is more to determined one and for all the exact location of that chromophore, i.e. in a thin and uneven layer of carbohydrate impurities resting over the fiber, as described by Rogers, or inside the primary cell wall of the fiber itself, which is its most superficial part, as described by Fanti et al.\nTo me, when it comes to determine the most probable mechanism that yield the body image on the cloth, the question of the exact location of the image chromophore is as important (and maybe even more important) as the question of its exact chemical composition…\n\n","date":"October 12, 2014 at 6:07 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-161781","author":"Yannick Clément","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"It’s true that I did not expect a wholly congratulatory response from Louis, but he might have made more of an attempt to support Prof. Fanti, or point out my errors, than he actually did.\n1) Demonstrating an instantaneous image-forming mechanism by a dead body on a cloth is a task that can be easily handled by Profs. Fanti and di Lazzaro. True or False?\n2) Prof. Fanti’s samples were collected by members of the Shroud of Turin Research Project. True or False?\n3) Prof. Fanti’s samples were given him by Ray Rogers. True or False?\n4) Prof. Fanti’s three methods of dating old textiles were sufficiently reliable to be written up in peer-reviewed papers. True or False?\n5) The Shroud has been reliably dated to the 1st century AD. True or False?\n6) Anybody who believes in evolution is an atheist. True or False?\n7) Prof. Fanti’s plant identifications “confirm the data obtained by Frei Sulzer.” True or False?\n9) “Wooo” is an inappropriate response to anybody claiming to have found “no substance known on earth.” True or False?\nI have no disrespect for Prof Fanti. I wish him and his endeavours every success. But, as I said above, Louis’ paper is most unlikely to rehabilitate Prof. Fanti in the eyes of those who think him discredited. My reasons for this are above. Is there something wrong with them?\nTrue, I did not comment on the Jospice Mattress, the Padre Pio handkerchiefs, or the DNA findings. I don’t know enough about them to say anything worthwhile, so I didn’t. So what?\nAs for the miracle thing, do you recognise this statement, “It would be in keeping with all of Jesus’ miracles as described in the New Testament, all of them instantaneous”? I spot a bit of wriggling here: your further elucidation is plain contradictory as well as theologically unsound: “Nature miracles — like the feeding of the five thousand — did not have to be instantaneous, only the healing and curing miracles and the last miracle had to be so. … God is not subject to time.” Is he not? Then why do some miracles “have to be” instantaneous? And why only healing and curing miracles? Asserting that the Resurrection “had to be” instantaneous, or, more peculiarly, “near-instantaneous”, is wholly unjustified.\n“Hugh has called himself a “core Catholic” but does not understand miracles.” Are you sure you do?\n\n","date":"October 12, 2014 at 6:13 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-161783","author":"Hugh Farey","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"This is what I have to say:\n1) Professor Giulio Fanti and Dr. Paolo di Lazzaro are the only scientists in the realm of Shroud studies who can conduct the research needed because they are already working on it. They did not buy their Ph.Ds, and more Shroud scientists may contribute with their own research. It seems that Hugh has, also in this instance, not read the interview-article carefully. I used the words “beyond doubt”, in fact italicised them, and this has something to do with experiments and the depth of the image.\n2) and 3) Here again, Hugh has not read the article carefully. Professor Fanti stated that the fibres, both his and those which were with Ray Rogers, are genuine. I can go further and state that even those with Dr. Leoncio Garza-Valdès were genuine, so much so that Cardinal Giovanni wanted them back in Turin, much in the same way that Archbishop Cesare Nosiglia wants Professor Fanti to return the fibres that are with him.\nProfessor Fanti states in the interview that the samples with Rogers were given to him by the archdiocese of Turin.\n4) Peer-review does not mean that what is stated is gospel truth. It only means that the paper is worthy of consideration. In any case, academicians have no monopoly on truth.\n5) No, the Shroud has not yet been reliably dated to the first century.\n6) Once again — for God’s sake! — Professor Fanti’s words are being distorted. He did not say that all evolutionists are atheists and neither do I think so. The context of his reply has to be read carefully.\nPope John Paul II had said that evolution is more than a theory and even the Vatican referred to Père Pierre Teilhard de Chardin around two years ago, when Benedict XVI was the pontiff. I personally do not believe that the Bible was dropped from heaven in King James English. I have said it once and say it again: fundamentalism is dangerous to faith. Why? Because we see examples of fundamentalists, many pastors included, who think that “Everything is true or nothing is true” when it comes to the Bible. When they realise they are wrong, they leave their respective churches and become anti-Christian. Jesus himself was not a fundamentalist when he referred to Scripture! The last line in my article says that to understand Jesus one has to read between the lines. Christians do not have to be scholars like Schnackenburg or Harnack to understand that, it is a question of opening the heart.\nJesus uttered one sentence that made such an impact on the Hindus, that it made him inextricable in Hinduism, where he is avatar, God incarnate. Swami Vivekananda, the father of modern Hinduism wrote that “Blessed are the pure in spirit. They shall see God” was enough to understand salvation, doing away with the need for Scripture and prophets. \n7) Professor Fanti’s findings have only partially confirmed Max Frei Sulzer’s findings, much more is needed. That will depend on the availability of the rest of the collection, what remains of Frei Sulzer’s tapes and what was vacuumed from the Shroud during the restoration.\n9) It betrays the unconscious. Do I have to dwell on Freud here?\nHugh says, “True, I did not comment on the Jospice Mattress, the Padre Pio handkerchiefs, or the DNA findings. i don’t know enough about them to say anything worthwhile, so I didn’t. So what?”.\nHere is what I have to say when it comes to these:\na) Jospice Mattress: He defended the view, recently expressed in England,that the imprint was the work of an artist — on this blog itself some months ago. What he was trying to say was that both the imprint and the image on the TS are the works of artists. He had no arguments to present because Professor Fanti’s findings came close to what I have always said:\nhttps://www.academia.edu/8740927/Professor_Giulio_Fanti_discusses_the_controversies_in_the_realm_of_Shroud_studies\nIt is easier to believe in telergy than in ghosts and one does not have to have be like Frederick Myers to understand that. \nb) Hugh did comment on the Padre Pio handkerchiefs above, although he says he did not. He wrote “wooo”.    \nc) He also did not comment about Professor Fanti’s DNA findings because they go against his argument that the Shroud is fake.\nSince he couldn’t find answers to a,b, and c, he writes “So what?” He will not admit defeat.\nLastly, his last paragraph is pure redactio ad absurdum, and here is the reason: Why would Jesus have to wait for the disciples to bring the fishes and loaves of bread and then, say, with a gesture, fill the bellies of the 5000 hungry mouths without waiting for them to eat? That would be funny wouldn’t it? They waited for him to preach, so they could wait a little more to eat. A “core Catholic” should know the criteria his Church adopts when declaring what is or is not a miracle. There is no reference to the hungry 5000. I will not indulge in spoon feeding. \nHugh apparently doubts that God is not subject to time. That is his viewpoint, but then he should subscribe to Hindu belief, which can be contradictory. He also says that the Resurrection did not have to be an instantaneous process. He apparently says that because he is afraid what Professor Fanti and Dr. di Lazzaro will discover.\n\n","date":"October 12, 2014 at 8:08 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-161802","author":"Louis","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"Well, thanks, Louis, I think that’s as clear as we’re going to get. Readers are invited to review our conversation and decide for themselves.\n\n","date":"October 13, 2014 at 2:33 am","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-161881","author":"Hugh Farey","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"Final Score : Hugh Farey :  9 – Louis : 0\n\n","date":"October 13, 2014 at 3:14 am","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-161890","author":"PHPL","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"I generally don’t like to respond to anonymous commenters because they are generally hiding behind masks and comment whatever they feel like commenting, even using four-letter words. I will make an exception this time and have the following to say;\nThanks for the rating and hope you subscribe to the BSTS newsletter, which Hugh edits, also hoping what you read is correct. Editor Hugh was unable to answer some of the important questions I asked him. There was even a challenge: Get hold of an artist, preferably trained in Courtauld, give him some bilirubin or other body liquid or some kind of paint and tell him to paint, on a mattress, what he sees on a photograph of the Jospice Mattress Imprint:\nhttps://www.academia.edu/4691379/Can_the_Jospice_Mattress_imprint_be_compared_to_the_Image_on_the_Shroud\n\n","date":"October 13, 2014 at 3:17 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-162067","author":"Louis","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"Professor Fanti gave Louis the courtesy of a professional interview despite what must be his personal priorities as a busy departmental head of a University School of Engineering.  He extended the courtesy of allowing the interview to be published in the public forum of the reputable academia web-site.  Louis was courteous enough to bring it to the attention of correspondents on this blog-site.  Louis has correctly pointed out that Professor Giulio Fanti and Dr. Paolo di Lazzaro are the only scientists in the realm of Shroud studies who are currently dedicating their professional resources to working on the Shroud.  Prof Fanti has graciously shared some of the details of that work and given some of his personal perspectives on the matter.  Notwithstanding, some of his work has prompted critical comment, some consider the directions of such work ill-judged.  He also seems to be a somewhat flamboyant character, if that can be a criticism at all.  He would not be the first investigator subject to such criticism, but nevertheless persisting despite it all. Of such are the cutting edge of new discoveries made!  \nI suggest that Professor Fanti is no less well-informed concerning the properties of the Shroud than any retired chemist working away in his spare time in the family kitchen pursuing his latest novel hypothesis, nor that of any science teacher at a secondary boys high school, who can apparently spare the time away from his charges to indulge in his favourite hobby.  The perspectives are merely different!\n\n","date":"October 13, 2014 at 4:51 am","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-161907","author":"daveb of wellington nz","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"Good morning, David. Thanks for those remarks, you have understood the situation clearly.\n\n","date":"October 13, 2014 at 8:58 am","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-161985","author":"Louis","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"I think Fanti (even if he is not head of any departament, and cannot be it) is a sindonologist very useful and necessary. When I need to explain what is sindonology, I tell what Fanti believes and all understand immediately.\n\n","date":"October 13, 2014 at 2:17 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-162045","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"I don’t understand, may I ask you for explanation, Andrea?\n\n","date":"October 13, 2014 at 2:23 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-162052","author":"O.K.","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"Basic Ad hominem OK. I think Prof. Fanti must be doing something right since he draws the ire of so many shroud haters.\n\n","date":"October 13, 2014 at 2:45 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-162058","author":"Mike M","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"I suppose, but let Andrea speak, if he has courage to do so.\n\n","date":"October 13, 2014 at 3:04 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-162063","author":"O.K.","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"Or if he is man enough.\n\n","date":"October 13, 2014 at 3:59 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-162077","author":"Max patrick Hamon","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"To Mike M: Maybe it’s precisely the opposite…  And this hard critic of his “science” started when Ray Rogers analyzed his Corona discharge hypothesis and saw that THIS CANNOT BE the answer to the Shroud image…\n\n","date":"October 13, 2014 at 4:17 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-162081","author":"Yannick Clément","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"Courage? Shroud haters? Be man? :-)))))\nMah….\n\n","date":"October 13, 2014 at 5:10 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-162095","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"Mr Nicolotti why worry about a speck in Fanti’s eye when you have a log in your own?\nActually there are two types of Shroudsciences: genuine sindonology and sindonoNOlogy. What is praticed by BOTH authenticists AND anti-authenticists is mostly sindonoNOlogy. On december 2012 I wrote the TS was not only the most studied ancient object in history but also the most badly studied. Mr. Nicolotti is a sindonNOlogist in essence as he just ignores or totally overlook suffice it to syntactically piece together several corroborating 944-1207 CE testimonies and eyewitness descriptions, from Gregory Referendarius’ (Archdeacon of Hagia Sophia), to Nicholas Mesarites’ (overseer of the treasuries in the Pharos Chapel of the Boucoleon Palace of the emperors) via Robert de Clari’s (Fourth Crusade Picard knight), and a few others, to build a strong if not crucial evidence the Turin Shroud and Constantinople Sindon could be one and the same object.\n\n","date":"October 14, 2014 at 8:30 am","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-162317","author":"Max patrick Hamon","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"I thank Andrea for the correction concerning the position of Professor Fanti.\nAccording to web-site information he is Associate Professor of Mechanical and Thermal Measurements in the Department of Industrial Engineering at the University of Padova (Padua).  His teaching courses are given as ‘Mechanical and Thermal Measurements’ and ‘Industrial Instrumentation’.  There may be more recent information.\n\n","date":"October 13, 2014 at 4:45 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-162091","author":"daveb of wellington nz","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"Just reviewing Louis last two comments, it appears that he thinks I have “defended the view, recently expressed in England,that the imprint was the work of an artist — on this blog itself some months ago. ” This is untrue. I have never defended such a position, and do not think the Jospice mattress was the work of an artist.  Perhaps he was thinking of someone else.\nHe also says I “did not comment about Professor Fanti’s DNA findings because they go against his argument that the Shroud is fake.” This is untrue. I did not comment on Fanti’s finding because I do not know enough about them. As I said.\nHe also says that “Hugh apparently doubts that God is not subject to time.” This is untrue. It is precisely because God is not subject to time that it is absurd to insists that this or that miracle “has to be” instantaneous. A true miracle worker could surely make it happen as quickly or as slowly as he wished.\nHugh “also says that the Resurrection did not have to be an instantaneous process. He apparently says that because he is afraid what Professor Fanti and Dr. di Lazzaro will discover.” This is untrue. The Resurrection does not have to be an instantaneous process because, not being subject to time, God could have made it last as long as he wished.\nAnd, in his later post, “Editor Hugh was unable to answer some of the important questions I asked him.” This is untrue. Louis did not ask me any important questions. Shall I list them?\na) Does someone who believes in God also believe that He was created after the big bang?\nb) And what was Father Francis O’Leary doing meanwhile? Having a nice English breakfast, complete with coffee, eggs and sausages?\nc) [Are the DNA studies] also rubbish?\nd) Do I have to dwell on Freud here?\ne) Why would Jesus have to wait for the disciples to bring the fishes and loaves of bread and then, say, with a gesture, fill the bellies of the 5000 hungry mouths without waiting for them to eat? That would be funny wouldn’t it?\nThat’s five somewhat blatant untruths in two comments. Coupled to the nine I listed earlier, none of which have been denied, I wonder whether Louis’ support for Prof. Fanti’s work isn’t proving a bit of a two-edged sword.\nI have no doubt that as Daveb has suggested, Prof. Fanti is no less well-informed concerning the properties of the Shroud than a science teacher, and I wish his endeavours every success. But being represented by fourteen untruths in two days is surely no way of establishing his credibility.\n\n","date":"October 13, 2014 at 5:32 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-162103","author":"Hugh Farey","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"Here is my response to Hugh. Note that he does not address me directly, he addresses the readers, betraying his intention to impress them. After all, he is the editor of the BSTS newsletter, where, unfortunately, standards began to fall after Ian Wilson ceased to be the editor. \nHere we go now:\nI will not address him directly, because he is asking for this sort of exchange, and it is not my intention to impress anyone.\nHe says he did not dwell on Professor Fanti’s DNA findings because he  does not know enough about them and that sounds strange. He normally makes some research to contest what other commenters are saying on this blog. He is now invited to do some research and contest Professor Fanti here, on this blog.\nWhen Hugh has no arguments he becomes desperate and takes the path of redactio ad absurdum. He rejects the argument that Jesus’ healing and curing miracles were instantaneous. “A true miracle worker”, he writes “could make it happen as quickly or slowly as he wished”. Since the context is Jesus I will stick to it.\nSo I will ask Hugh if he believes that Jesus loved to watch people suffering. Did he, when people asked him to perform a miracle, make them wait, say, for half an hour, sipping a glass of wine meanwhile? We must remember that Jesus, unlike John the Baptist, ate and drank well. Hugh should read the NT carefully,or if he is unwilling to do that, ask his parish priest or some biblical scholar within easy reach what is the criteria of the Catholic Church when it comes to miracles. \nHe also says that the Resurrection did not have to be an instantaneous process. Know why he says that? Because he is afraid that Shroud research will point in that direction and it will be a step forward in favour of authenticity and he is anti-authenticity. It will not be something new because it has been dwelt upon before in the USA, and Professor Fanti has gone a bit further, but more is needed, as stressed by me in italics in the interview-article.\nI would like Hugh to answer a,b,c,d,e above. I am afraid he is unable to answer them.\n\n","date":"October 13, 2014 at 8:01 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-162150","author":"Louis","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"Professor Fanti is a scientist who appears to believe that science can only get you so far and there is much that remains unknown . Most scientists would agree, but the vast majority, looking at the progress of science over the past years, are convinced that some but perhaps never all of the unknown will be discovered by science. Fanti prefers to insert the miraculous at an early stage.  However, the manifest problems  over his dating methods, the vast range of dates, the lack of validity in his methods, the adjustment of the most awkward of his dates but not the other two, the mysterious averaging process of three disparate dates, has meant that he could not be taken very seriously. That is why his dates that caused so much publicity even in mainstream sources  when he first published them, then vanished quickly without trace.\n\n","date":"October 14, 2014 at 12:30 am","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-162215","author":"Charles Freeman","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"The problem with Fanti is that he obviously let his faith in the Resurrected Christ (and his idea of what the Resurrection must have produced) interferred into his science.  By doing so, he commit the same “sin” as many pro-Shroud historian who let their imagination goes much too wild while doing their researches.\n\n","date":"October 14, 2014 at 8:29 am","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-162316","author":"Yannick Clément","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"No, no, and no. Shroudscope is a debating forum, where opinions and ideas are presented and discussed, for all the world to read. I rarely address any correspondent directly, precisely because my views are addressed to all the readers of this forum, not simply to the individual whose views I am debating. Nor do I try to guess what is going on in the minds of those I respond to; I reply to their words, not to their thoughts.\nLouis does make one sensible point above, which is that he is quite correct that I like to examine, in extreme detail, any evidence regarding the Shroud, and am usually prepared to go to some length to do so. I did buy Il Mistero della Sindone, and Prof. Fanti’s subsequent paper in Vibratonal Spectroscopy, and have commented on them at length, but must confess I have not shelled out the necessary for Sindone: Primo Secolo Dopo Cristo! as I really don’t know that it will be worth it. Like the previous book, it appears to be aimed at a popular market and as such will probably present conclusions rather than a good account of the research that led up to them. If a more detailed paper on the DNA findings can be found anywhere I will be pleased to review it for this forum.\nMeanwhile, we have Prof. Fanti’s quoted replies to Louis’ questions above. “When it comes to human mitochondrial DNA, distinct haplogroups have been identified, including R0, U2 and U5, and several H haplotypes. Haplogroup R0 occurs frequently in the Arabian plateau, especially in the local  populations of Saudi Arabia and Pakistan with its highest frequency in Yemen (30%), whereas the highest frequency of haplogroup R8 is found mainly towards East India. U sub-groups are widely distributed across Western Eurasia, North Africa and South Asia. The human mitochondrial haplogroups we found are compatible with the proposed temporal and spatial paths of the TS and the findings and additional clues present difficulties to those who postulate a Central European origin of the relic.”\nThis statement in itself explains why I can honestly say I don’t know much about it. Among the mitochondrial haplotypes identified, some are thought to originate from the Middle East 60000 years ago. This tells us nothing. A huge proportion of Europeans and Americans would have the same. In order to comment sensibly, one would need a complete list of the haplotypes discovered, and the proportions in which they were found. Suppose, to set an extreme example, 90% of the haplotypes were H1b, and 10% from R0, U2 and U5 – that would be a good indication that the Shroud had never been handled by Hebrews or Turks at all, and is not ruled out by the statement quoted. The final clause: “additional clues present difficulties to those who postulate a Central European origin of the relic,” is interesting. I wonder what the ‘additional clues’ are. Perhaps they are indicative, perhaps not. I simply don’t know.\n\n","date":"October 14, 2014 at 3:12 am","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-162245","author":"Hugh Farey","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"I must tell Hugh that he has addressed by people with a “Hi” on this blog, and so would like to know from him why I am not in this group. I know why this is so, but want an explanation coming from him.\nHugh has correctly raised some questions, which I am unable to answer right now. All I can say now that is that just a few basic points in the research were mentioned and the rest will indeed have to be addressed shortly. After all, it was an interview, not a peer-reviewed paper. \nI always keep an open mind, willing to listen to the objections of those who do not believe that the Shroud is authentic. My background is not science, so I have to listen more than say, but at the same time, as one who also writes on the science-theology dialogue, Bible, Biblical Archaeology, Biblical studies, Parapsychology and so on I also prefer to see scientists like Hugh listening to what I have to say when it comes to the Bible and theology.\n\n","date":"October 14, 2014 at 9:35 am","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-162331","author":"Louis","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"Hi, Louis! You’re quite right. Although I do I “rarely address any correspondent directly,” there are occasions when I do; sometimes this is in answer to a particular request (such as ‘ Where can I find a copy of this paper or that’ or ‘I want an explanation’ as above) which is probably known to other readers, sometimes to welcome someone who I do not remember having responded to before, and sometimes to make it clear to whose post I am responding, when there have been several commenters over a short space of time. I expect there are exceptions, but that’s my general practice, it seems.\nAs for your theology, Louis, I have indeed read it carefully, and it has tangled itself up into such a muddle that you might do well to re-read it yourself. First you claimed that all Jesus miracles were instantaneous, not qualified by saying “only cures,” except for two blind men, who were kept waiting. When I mentioned the loaves and the fishes, you realised how absurd the sudden production of 5000 lunches appears, and said the ‘nature’ miracles didn’t count, and when I asked why any miracles ‘had to be’ instantaneous, you took refuge in asking whether I thought Jesus liked people to suffer. Did he make them wait? Well, yes, he did. Not only the two blind men you yourself quoted previously, but in the case of Lazarus, to the extreme distress of his relatives, for four days. Louis, my friend, I am a scientist to the core, and a Catholic to the core, educated largely by Benedictine monks, and will not be caught out by trivial theological sophistry. Go back to your ideas about miracles and clarify them to yourself, and when you know what you want to say, you may be able to explain clearly why the Resurrection “had to be” instananeous. I sincerely wish you every success in your endeavours, and look forward to changing my mind.\n\n","date":"October 14, 2014 at 2:19 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-162379","author":"Hugh Farey","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"Hugh, Thanks for the response. I am not taking refuge in anything simply because the rationale behind the feeding of the five thousand is clear in previous comments and so is the question of the blind men. Jesus must have taken a few seconds to increase the intensity of the power that was leaving his body in the first case, in the second one I mentioned why it was so in a previous comment. As I said, there is a lot of subtlety involved when it comes to Jesus, be it the riddles that are the parables and so on. \nI did not study with Benedictines, but mainly with Jesuits from about about eight countries. In school I learnt from German lay brothers who had fought in the reichswehr or luftwaffe, got fed up of war, pondered about the destruction and hatred and decided to join a religious order. In college I played volleyball every evening, from Monday to Sunday, with Jesuit priests and seminarians, learning a lot about theology from them. Do you think that is where the “sophistry” came from? No,there is no sophistry.\nLet me know how long you think the Resurrection event lasted.\n\n","date":"October 14, 2014 at 2:42 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-162383","author":"Louis","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"Thanks, Louis. So the Resurrection “had to be” not quite instantaneous because Jesus “must have taken a few seconds” to power up. Perhaps you are correct. The God I believe in does not have to take any time at all. He may have allowed himself to revive over 36 hours, individual cells reawakening in succession until he simply got up as from a bed, or he may have vanished in an instant, the space he occupied being as instantly filled with air, or left as a vacuum, or he may have exploded in a burst of radiation, which was just enough to have an effect on the Shroud. He may have caused the dead of Jerusalem to do any of the same, and then sent them all back to their graves, or he may have made the people of Jerusalem think they had seen their forebears when in fact they had remained peacefully in their ossuaries. He may have reconstituted himself instantly, and sat in the garden for the rest of the night waiting for Mary Magdalene to turn up, or he may have not reappeared until just before she arrived. Somewhere along the way he provided clothes for himself. Perhaps while he was still in the tomb, perhaps after he re-materialised. \nHe may have done any, all or none of these things. That’s who God is. From a scientific point of view, none of them is open to inquiry. I do not know what the Resurrection was scientifically, or how long it took. Nor does anybody else, nor does it matter. In 1984 the Anglican Bishop of Durham attempted to explain this in describing the resurrection as “so much more than a conjuring trick with bones” and a few years ago Pope Benedict showed a similar lack of enthusiasm for “the mere resussitation of a corpse.” Frankly, in the opinion of most modern theologians, all as orthodox as the Pope, the measurable, physical events of the morning of the first day of the week after the crucifixion are trivial compared to the meaning of the Resurrection and the effect it had on the disciples, whatever actually occurred.\nBest wishes,\nHugh\n\n","date":"October 14, 2014 at 5:37 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-162409","author":"Hugh Farey","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"The comment by Charles on just how much science will ever be able to know is excellent. It is also one of the things that was mentioned by me in the interview-article.\n\n","date":"October 14, 2014 at 12:49 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-162354","author":"Louis","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"Before discussing in terms of molecules the discussion should go to the material/layer level first.\n\n","date":"October 14, 2014 at 2:01 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-162374","author":"Louis","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"Hugh, I fully agree with what you said and now we are speaking the same language. I believe in the Resurrection because it had to happen, not only because it explains the growth of the Jesus movement, that became the Church, but also due to the question of existence. As I have stated more than once, even if the Shroud is “proved” to be authentic it will still not answer many questions, but this is for another article.\nMeanwhile, you will be my “scientific advisor”, though you are anti-authenticity and I am in the opposite camp, but keep an open mind as the Church does. The Church also calls some qualified devil’s advocate when it comes to a canonisation process. Who knows, perhaps Rome will call you when needed!\nAll the best.\nLouis\n\n","date":"October 14, 2014 at 6:41 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-162417","author":"Louis","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"Hugh, Louis:  How long did Jesus take for the resurrection?  Check 1 Peter 3:19. \n“18 For Christ also suffered* for sins once, the righteous for the sake of the unrighteous, that he might lead you to God. Put to death in the flesh, he was brought to life in the spirit.g 19 In it he also went to preach to the spirits in prison,* 20 who had once been disobedient while God patiently waited in the days of Noah during the building of the ark, in which a few persons, eight in all, were saved through water.” \nUSCCB Note on v 18:\n” [3:19] The spirits in prison: it is not clear just who these spirits are. They may be the spirits of the sinners who died in the flood, or angelic powers, hostile to God, who have been overcome by Christ (cf. 1 Pt 3:22; Gn 6:4; Enoch 6–36, especially 21:6; 2 Enoch 7:1–5). \nCheck Apostle’s Creed:  “He descended into [Hades]”.  \n1 Peter is generally accepted as authoritative. “The work is pseudonymous, attributed to Peter through Silvanus, whose name constitutes a part of the pseudepigraphic device that strengthens the authority of the epistle.”   \nThe work thus reflects an early teaching that after his death, Christ descended to the abode of the dead, and “released them from their prison there”.  His first subsequent reappearance on earth is to Mary Magdalen early on the morning after the sabbath.\n\n","date":"October 14, 2014 at 8:44 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-162431","author":"daveb of wellington nz","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"David, thanks for reminding us of this. I have thought about it, but very rarely. When did Jesus descend to the abode of the dead? After the resurrection, before he appeared to Mary Magdalene? What was the purpose? Why were those in the abode of the dead “released from prison there”? Because they preceded Jesus and the gospels did not exist? What about those who have never heard of Jesus or the gospels? Will they go to another abode, not hell, but the so-called limbo?  \nThe problem with the Noahide laws is that they are not unique, similar teachings can be found in other religions. They were promoted by Maimonides, for whom “Jesus is punished in hell for eternity, being made to sit in a cauldron of boiling excrement”, and Menachem Mendel Schneerson, known for some peculiar teachings, rejected by the open-minded Reformed Jewish synagogue members.\n\n","date":"October 14, 2014 at 9:22 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-162437","author":"Louis","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"Fair bit of symbolism inherent in this I suspect.\n\n","date":"October 15, 2014 at 2:22 am","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-162491","author":"Thomas","site":"shroudstory"},{"title":"\"Just the facts, ma’am.\"","post":"Some information I received obliged me to make small changes in the introduction to the interview with Professor Giulio Fanti:\n https://www.academia.edu/8841978/Professor_Giulio_Fanti_discusses_the_controversies_in_the_realm_of_Shroud_studies\n\n","date":"October 18, 2014 at 5:35 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","id":"comment-163585","author":"Louis","site":"shroudstory"}]
