[{"title":"John Jackson to Moderate Future Testing Discussions in St. Louis","post":"Where future research on the TS image is concerned, it’s time to discriminate between, on the one hand,  the STURP view that saw the image as pyrolysed carbohydrates and, on the other, the idea of it being some kind of Maillard reaction product. (That’s whether or not one buys into Rogers’ putrefaction vapour model (it not being the only means of ending up with a Maillard product).\nThe problem one is up against, from a chemical standpoint, is the superficiality of the image and its chemistry, relative to the bulk carbohydrates of flax fibres. It’s a tall order, analytically-speaking, to distinguish image signal (or should that be signature?) from substrate background noise.\nThere is a possible way it might be done, though it’s admittedly a bit of a long shot.\nRay Rogers employed the technique of pyrolysis mass spectrometry, which basically fragments a specimen and then collects and measures those fragments according to their m/e (mass to charge) ratios. It was that technique that allowed him to pick up a signal for hydroxyproline in the “blood”, an important finding, even if his conclusions were open to differing  interpretations.\nSo how might that technique be refined to discriminate between pyrolysis and Maillard products? The crucial difference is the small amount of  additional Maillard-reacted nitrogen in the image  compared to the non-image areas. \nIf one simply took image and non-image areas and performed pyrolysis-mass-spec, looking for differences in fragmentation pattern that could be related to known chemistry, there would almost certainly be a signal/noise problem, as already stated. But there’s  a possible way of filtering out some of that noise, or at any rate pinpointing the crucial fragments. \nAdler and Heller discovered that the TS image is bleachable with diimide (N2H2), which is a powerful reducing agent. The latter can be reasonably assumed to decolorise chromophores by adding hydrogen atoms across double bonds. So the trick is to do difference spectrums, before and after diimide treatment, and look for all those fragments that differ by m/e =2, corresponding to addition of two hydrogen atoms per molecule or fragment thereof. Having located those key fragments, one then looks up their m/e values, giving preference  (where any ambiguities might exist) to those which contain the element nitrogen, bearing in mind there can be no Maillard reaction without a source of that element in the form of amino (-NH2) groups.\nIf one finds nitrogen in the key diimide-reducible fragment, then one should think Maillard reaction. If one does not, then think simple pyrolysis.\n\n","date":"October 11, 2014 at 10:55 am","url":"https://shroudstory.com/2014/09/28/john-jackson-to-moderate-future-testing-discussions-in-st-louis/","cat":"st_louis_2014","id":"comment-161334","author":"Colin Berry","site":"shroudstory"},{"title":"John Jackson to Moderate Future Testing Discussions in St. Louis","post":"PS: I see from googling that one can purchase deuterated and tritiated diimide (N2D2 and N2T2 respectively). Those reagents would greatly simplify the task of spotting the reduced fragments on mass spectrographs, given they contain heavier isotopes with m/e ratios 2 and 3 times greater than hydrogen.\n\n","date":"October 11, 2014 at 11:24 am","url":"https://shroudstory.com/2014/09/28/john-jackson-to-moderate-future-testing-discussions-in-st-louis/","cat":"st_louis_2014","id":"comment-161341","author":"Colin Berry","site":"shroudstory"}]
