[{"title":"New Paper by Pam Moon","post":"This is typical of Pam’s expertise; thoroughly researched (Who knew about Valfré’s black thread insistence?), clearly explained and well illustrated. I commend it to everyone.\nWith only one caveat. Both the black and white “threads” illustrated are little thicker than a single fibre, and I do not think would have sufficient strength to be used as ‘thread.’ However, they could be fibres left behind from whole threads which have been unpicked at a later date, leaving only traces behind.\n\n","date":"December 18, 2014 at 11:52 am","url":"https://shroudstory.com/2014/12/18/new-paper-by-pam-moon/","cat":"st_louis_2014","id":"comment-177555","author":"Hugh Farey","site":"shroudstory"},{"title":"New Paper by Pam Moon","post":"Now world know that corners were contaminated.\nMay God Bless all the people who discarded the results of Carbon Tests. Without these brave people world would have think Shroud of Turin is another fake artifact.  \nWhy foolish scientists who tested a contaminated sample confirmed to the world that Shoud of Turin is made only in 14th Century?\n\n","date":"December 18, 2014 at 4:51 pm","url":"https://shroudstory.com/2014/12/18/new-paper-by-pam-moon/","cat":"st_louis_2014","id":"comment-177590","author":"Sampath Fernando","site":"shroudstory"},{"title":"New Paper by Pam Moon","post":"Well, steady on, Sampath. Pam’s excellent paper has elegantly demonstrated how little contamination there is, and therefore how unlikely it is that any reweaving has had any effect on the C14 dating.\n\n","date":"December 18, 2014 at 5:02 pm","url":"https://shroudstory.com/2014/12/18/new-paper-by-pam-moon/","cat":"st_louis_2014","id":"comment-177595","author":"Hugh Farey","site":"shroudstory"},{"title":"New Paper by Pam Moon","post":"Threads aside, some of the rest can be questioned. For example the claim that the Jospice Mattress Imprint was the work of an artist. A scientist’s findings have lent support to my own view (telergy – Kirlian effect) and more work is being done on both the contamination and reweaving hypotheses:\nhttps://www.academia.edu/8841978/Professor_Giulio_Fanti_discusses_the_controversies_in_the_realm_of_Shroud_studies\nWe will have to wait to see what the research being done can tell us. It will come in peer-reviewed papers.\n\n","date":"December 18, 2014 at 6:00 pm","url":"https://shroudstory.com/2014/12/18/new-paper-by-pam-moon/","cat":"st_louis_2014","id":"comment-177602","author":"Louis","site":"shroudstory"},{"title":"New Paper by Pam Moon","post":"?????\nPam’s paper doesn’t even mention the Jospice mattress.\n\n","date":"December 18, 2014 at 6:36 pm","url":"https://shroudstory.com/2014/12/18/new-paper-by-pam-moon/","cat":"st_louis_2014","id":"comment-177610","author":"Hugh Farey","site":"shroudstory"},{"title":"New Paper by Pam Moon","post":"I agree with Hugh: the paper written by Pam Moon\nhas nothing to do with Jospice Imprint.\nI also would like to write a brief explanation here\nabout my position on the debate: “Jospice Imprint [problem to solve]” …\nI do not say that Jospice Imprint is the work of an artist,\nbut I just do observe that we can obtain a cold dyeing on polyamide 6.\nAt this point it seems to me that no one has seriously discussed the issue.\nAm I wrong?\n— —\nIn any case I never claimed that the Shroud of Turin (on linen)\nand the imprint of that poor man Lierpool (on polyamide…) really\nhave the same characteristics!\nOften people talk too much …\nSo:\nAm I right with this annoying message?\n— —\nA careful control on linen fibrils from the Shroud (and Jospice Imprint)\nwill be a feat of Textile Engineering.\nThe writings of Pam Moon are very interesting but\nwe should also work with appropriate experiments to show that\nwe can achieve a modern, non-destructive testing.\nWe require to follow a method (SPM controls) based on straightforward proofs.\nThis would be a nice gift for the New Year 2015!\nIt’s near impossible to work only with spare time.\nWe need a full-time work-team.\nWhat we want to do?\n\n","date":"December 19, 2014 at 9:59 am","url":"https://shroudstory.com/2014/12/18/new-paper-by-pam-moon/","cat":"st_louis_2014","id":"comment-177770","author":"piero","site":"shroudstory"},{"title":"New Paper by Pam Moon","post":"Errata corrige:\n>the imprint of that poor man of Liverpool (on polyamide…)\ninstead of :\n>the imprint of that poor man Lierpool (on polyamide…)\n— — *** — —\nHere some suggestion:\nThe color strength (K/S) values of the dyed fabrics (= samples obtained from preliminary experiments) can be instrumentally determined by reflectance spectrophotometer with Kubelka-Munk equation. Where are the useful inherent evaluations?\nThe color strength of the dyed fabrics can be  measured by using a spectrophotometer for D65 illuminant and an observer located at  10º…\n(Link: http://www.ihara-us.com/theory.php?page=4 )\nIn order to evaluate the wettability of the polyamide woven fabrics, a water-drop test can be applied by measuring the time for  its complete absorption into the material.\nIf you want to treat the surface of the polyamide samples with plasma (and you have to perform this operation before to do the dyeing process!), then you can see that there is a significant change due to chemical etching, which tends to create oxidized species on the surface of the polyamide fibers.\nThen the polyamide fiber changes the nature from hydrophobic to hydrophilic which is key point for the adsorption of aqueous dye solutions. But I do not believe this was the phenomenon involved for the Imprint generation, what happened in Jospice Hospital is (probably) another thing…\nThe increase in roughness (for plasma treated samples) can be better understood when AFM images are compared with the polyamide material treated (with “cold dyeing” process) without plasma discharge.\nWe can also proceed toward the Identification of Coloring Compounds.  In my opinion there are three main ways to work, thus in order to observe:\n-Chemical structures from spectroscopic analyses\n-Chemical structures of the samples controlled using AFM techniques.\n-Chemical structures of the extracted dye. But this way should be avoided…\nThe morphological and topographical characteristics of the polyamide surface before and after dyeing treatment can be investigated with multimode SPM microscope controls.\n — —\n… And, for the moment, I think this should be enough to trigger your response…\n— —\nRegards,\nPiero\n\n","date":"December 19, 2014 at 10:58 am","url":"https://shroudstory.com/2014/12/18/new-paper-by-pam-moon/","cat":"st_louis_2014","id":"comment-177784","author":"piero","site":"shroudstory"},{"title":"New Paper by Pam Moon","post":"Now it came to my mind the term: “Pyrrhic victory” …\nLink:\nhttp://en.wikipedia.org/wiki/Pyrrhic_victory\nSo …  I am not a starter on the rink.\nAlso ice skating has nothing to do with microscopy.\nFurthermore, a common problem with outdoor skating areas, ponds, lakes, etc. Is that the surface is often marginally skatable … and then snow falls…\nBut pride of place goes to the paper by Pam Moon !\nStop.\n\n","date":"December 19, 2014 at 11:16 am","url":"https://shroudstory.com/2014/12/18/new-paper-by-pam-moon/","cat":"st_louis_2014","id":"comment-177789","author":"piero","site":"shroudstory"},{"title":"New Paper by Pam Moon","post":"Piero, you refuse to pick up the gauntlet. Why is that so? Can you answer my question? If not, then please put an end to this rubbish about the dye. What you must do is to provide convincing arguments about why the dye had something to do with the partial head image seen on the Jospice Mattress. If you do that I will withdraw my paper. Here it is again:\nhttps://www.academia.edu/4691379/Can_the_Jospice_Mattress_imprint_be_compared_to_the_Image_on_the_Shroud\nLook at the partial head image carefully and ponder about about what Father Francis O’Leary had to say.\n\n","date":"December 19, 2014 at 7:03 pm","url":"https://shroudstory.com/2014/12/18/new-paper-by-pam-moon/","cat":"st_louis_2014","id":"comment-177861","author":"Louis","site":"shroudstory"},{"title":"New Paper by Pam Moon","post":"Naturally.\nI was referring to:\nhttps://shroudstory.com/2014/01/08/wonderful-pam-moons-new-shroud-of-turin-exhibition-website/\nThe response is in the interview, the link to which is given in the comment above. There should be another Shroud article soon, after which I can write to say why the imprint is not the work of an artist.\n\n","date":"December 18, 2014 at 7:01 pm","url":"https://shroudstory.com/2014/12/18/new-paper-by-pam-moon/","cat":"st_louis_2014","id":"comment-177614","author":"Louis","site":"shroudstory"},{"title":"New Paper by Pam Moon","post":"HF: “Pam’s excellent paper has elegantly demonstrated how little contamination there is, and therefore how unlikely it is that any reweaving has had any effect on the C14 dating.”  \nThat is not a fair assessment of Pam Moon’s paper at all, but is consistent with the correspondent’s persistent attachment to a type of scientism, which conveniently ignores and fails to take into account findings that validly challenge the reliability of the 1988 C14 fiasco.\n\n","date":"December 19, 2014 at 4:49 am","url":"https://shroudstory.com/2014/12/18/new-paper-by-pam-moon/","cat":"st_louis_2014","id":"comment-177725","author":"daveb of wellington nz","site":"shroudstory"},{"title":"New Paper by Pam Moon","post":"I do apologise, daveb, for my misunderstanding. In the photographs of the actual radiocarbon samples, we can spot two minute black fibres and a few stands of white fluff. This does not appear to me to be evidence that over half the material tested was contaminent. I stand to be corrected, of course.\n\n","date":"December 19, 2014 at 5:43 am","url":"https://shroudstory.com/2014/12/18/new-paper-by-pam-moon/","cat":"st_louis_2014","id":"comment-177733","author":"Hugh Farey","site":"shroudstory"},{"title":"New Paper by Pam Moon","post":"What is black and so thin?  Monofilament by DuPont? Did someone mend something in 1973? Did they not wonder about this strange fiber in 1988? A judge in a court of law would have no choice but to throw out the C14 dating.\n\n","date":"December 19, 2014 at 6:31 am","url":"https://shroudstory.com/2014/12/18/new-paper-by-pam-moon/","cat":"st_louis_2014","id":"comment-177745","author":"Paulette","site":"shroudstory"},{"title":"New Paper by Pam Moon","post":"No, Paulette. I think I could persuade your judge that there is no reason to dismiss the C14 dating. The samples were indeed contaminated, but, as we can see, the vast majority of such contamination was easy to see and easy to remove.\n\n","date":"December 19, 2014 at 6:58 am","url":"https://shroudstory.com/2014/12/18/new-paper-by-pam-moon/","cat":"st_louis_2014","id":"comment-177749","author":"Hugh Farey","site":"shroudstory"},{"title":"New Paper by Pam Moon","post":"Hugh,\nPam’s paper follows this one, which is more detailed:\nhttp://www.shroudofturinexhibition.com/Shroud_of_Turin_exhibition/Home_files/Updated_report_on_the_Consideration_to_the_Uniformity_and_Effects_of_the_Fabric_in_the_Shroud_of_Turin-5-1.pdf\nI do not understand your sentence: “Pam’s excellent paper has elegantly demonstrated how little contamination there is, and therefore how unlikely it is that any reweaving has had any effect on the C14 dating.”\nWhat about the “stain”, the shrinkage (” Shrinkage is possible but the distortion within this area is so localized and acute that interference of a different kind such as mending maybe\nworth considering (Fig 20)”), the possible stitches, the differences in the spaces of the warp and weft interlacement (Fig.16), this strange black fiber …\nI agree that none of these observations necessarily imply  reweaving.\nBut they possibly suggest reweaving and in this case why do you think that this reweaving would have had any effect on the C14 dating.\nWhy are you speaking of “little contamination” in this context ???\n\n","date":"December 19, 2014 at 4:15 pm","url":"https://shroudstory.com/2014/12/18/new-paper-by-pam-moon/","cat":"st_louis_2014","id":"comment-177833","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"New Paper by Pam Moon","post":"The contamination I was speaking of was the very few extraneous fibres. As for the distortion of the threads, Donna Campbell’s paper clearly suggests that this is typical of the cut edges of any cloth, particularly one which has been moved about (for storage, for photography, for microscopic examination). There is also evidence of some abrasion, not just on these samples but all over the cloth. The stain outlined as area B on page 4 of Ram’s paper is a shadow caused by the raking light over a fold in the the cloth, not a stain, although its reverse (the reddish brown coloured photo bottom right of the same page) does seem to show both stain and abrasion. None of this evidence suggests reweaving of any kind.\n\n","date":"December 19, 2014 at 4:57 pm","url":"https://shroudstory.com/2014/12/18/new-paper-by-pam-moon/","cat":"st_louis_2014","id":"comment-177837","author":"Hugh Farey","site":"shroudstory"},{"title":"New Paper by Pam Moon","post":"Demand a jury trial!\n\n","date":"December 20, 2014 at 11:10 am","url":"https://shroudstory.com/2014/12/18/new-paper-by-pam-moon/","cat":"st_louis_2014","id":"comment-177998","author":"John Green","site":"shroudstory"},{"title":"New Paper by Pam Moon","post":"” I think I could persuade your judge … ”  You would have a tough task doing so if I was opposing counsel.  The verdict would be “Not proven!”\n\n","date":"December 19, 2014 at 2:53 pm","url":"https://shroudstory.com/2014/12/18/new-paper-by-pam-moon/","cat":"st_louis_2014","id":"comment-177823","author":"daveb of wellington nz","site":"shroudstory"},{"title":"New Paper by Pam Moon","post":"Investigating a Dated Piece of the Shroud of Turin\n“RADIOCARBON, Vol 52, Nr 4, 2010, p 1521–1527 © 2010 by the Arizona Board of Regents on behalf of the University of Arizona1521\nINVESTIGATING A DATED PIECE OF THE SHROUD OF TURIN\nRachel A Freer-Waters\nArizona State Museum, University of Arizona, Tucson, Arizona 85721, USA.\nA J Timothy Jull\nNSF Arizona AMS Laboratory, University of Arizona, Tucson, Arizona 85721, USA; Also: Department of Geosciences, University\nof Arizona, Tucson, Arizona 85721, USA. Corresponding author. Email: jull@email.arizona.edu.”\n“Figure 5 High-magnification image of a fiber bundle, showing the presence of a cotton fiber, unidentified fibers, and debris. This area appears to have been exposed to more contamination than other samples.”\nhttp://digitalcommons.arizona.edu/objectviewer?o=http%3A%2F%2Fradiocarbon.library.arizona.edu%2FVolume52%2FNumber4%2F33737617-d6e4-4797-ba23-fb8e0f303abe\nUNIDENTIFIED FIBERS?\nARIZONA STATE MUSEUM\n\n11:46\n“……the picture above is of fibers pulled out of that small piece of textile, again photographed in cross polarized light. The purpose of doing that is to actually identify what  fiber this particular textile was made from, whether it´s cotton or linen or wool. Different fibers can be.”\n¡OOOOOOHHH!\nCarlos\n\n","date":"December 19, 2014 at 11:21 am","url":"https://shroudstory.com/2014/12/18/new-paper-by-pam-moon/","cat":"st_louis_2014","id":"comment-177791","author":"Carlos","site":"shroudstory"},{"title":"New Paper by Pam Moon","post":"The curator, David Killick, made several erroneous statements when describing the Shroud of Turin. First, he mentions the Shroud because he shows a photograph of the shroud sample that the Arizona radiocarbon dating lab received in 1988. \nBut then he goes on to try to describe the Shroud. Among other statements, he made a definitive statement as to how the image was formed on the Shroud: from oil coming from the body. He appears as if he made up this claim to fill up some explanation for the formation of the image to make the presentation more complete and coherent with the result of the radiocarbon dating. He went on to add more dubious explanation (e.g., pay an enormous price, which is not the case for the Shroud of Turin) trying to back up the result of the Arizona lab. This is not a good approach from a curator where every curated fact must be verified. So, perhaps an email to the university of Arizona is in order to correct this video.\nCarlos, the curator is not really saying that there are cotton and linen fibers in the photograph but that the fibers can be verified through a microscope to detect different types. No confirmation of different types is given. \nBut I find the erroneous statements about the Shroud more alarming.\n\n","date":"December 19, 2014 at 6:06 pm","url":"https://shroudstory.com/2014/12/18/new-paper-by-pam-moon/","cat":"st_louis_2014","id":"comment-177851","author":"Mario Latendresse","site":"shroudstory"}]
