[{"title":"Put St. Louis on the Map","post":"Russ Breault will be recording the talks and they will be eventually be on   his shrouduniversity.com site.  There will a dedicated site for the texts   of the papers.  Regarding “nut job” papers, just remember that,   historically, some accepted mainstream science was originally considered  ridiculous.\n\n","date":"July 6, 2014 at 7:51 am","url":"https://shroudstory.com/2014/07/06/put-st-louis-on-the-map/","cat":"st_louis_2014","id":"comment-135628","author":"jmarino240","site":"shroudstory"},{"title":"Put St. Louis on the Map","post":"Joe, may I have a question for you?\nYou once mentioned that you and Sue took the photo of Zurich sample (which you gave the textile experts for analysis) from Gino Moretto’s book. Can you confirm that? Because it seems I have this book within sight.\n\n","date":"July 6, 2014 at 8:16 am","url":"https://shroudstory.com/2014/07/06/put-st-louis-on-the-map/","cat":"st_louis_2014","id":"comment-135637","author":"O.K.","site":"shroudstory"},{"title":"Put St. Louis on the Map","post":"O.K.  Yes, that is correct.\n\n","date":"July 6, 2014 at 9:25 am","url":"https://shroudstory.com/2014/07/06/put-st-louis-on-the-map/","cat":"st_louis_2014","id":"comment-135642","author":"Joe Marino","site":"shroudstory"},{"title":"Put St. Louis on the Map","post":"Joe, that is wonderful for starters.  Russ’s site is great.  Archive the videos there but use YouTube to make them public.  WMV files was probably the way to go in 2008. Not now. They need to be downloaded. I had to buy a special app to view an Ohio 08 presentation from Russ on my iPad. It took 30 minutes to get started. On my Dell laptop it took several minutes to download the file from Russ. Then I had to fire up the Windows Media app. What is your goal? Are you trying to drive traffic to Russ or share the videos with the public. Either way, your best strategy is to use YouTube and a good about write up with links to Russ. Set up a YouTube channel if you want to make it easy for users. Do it the easy way. Anyone can learn how in five minutes. Do it the effective way and put St. Louis on the map. Ask yourself why the Vatican, Vatican Radio, the Southern Baptist Convention, the United Methodist Church and all the others have YouTube channels. Look at http://tinyurl.com/k9kleka. It explains why to use YouTube for church media and not to use Vimeo or your own website. And it is free to do. No bandwidth issues. And look how good YouTube videos look in this blog. For the papers use academia.edu. Set up a Follow page like Emanuela Marinelli did. Call it St. Louis Shroud of Turin Conference 2014.\n\n","date":"July 6, 2014 at 4:55 pm","url":"https://shroudstory.com/2014/07/06/put-st-louis-on-the-map/","cat":"st_louis_2014","id":"comment-135730","author":"Sal T","site":"shroudstory"},{"title":"Put St. Louis on the Map","post":"Sal,   My main goal is to share the videos with the public.   Russ wrote to me:  “Don’t know about YouTube yet.  My plan will  be to  upload everything to Vimeo and then link to them from  ShroudUniversity.com.  I  will have to hire a student to assist me but the  goal will be to have  everything live on the site by the end of the year.”\n\n","date":"July 6, 2014 at 5:11 pm","url":"https://shroudstory.com/2014/07/06/put-st-louis-on-the-map/","cat":"st_louis_2014","id":"comment-135736","author":"jmarino240","site":"shroudstory"},{"title":"Put St. Louis on the Map","post":"Sal, you are right about the videos on Shroud University.  They were originally encoded with WMV and hosted on my server site.  At the time in 2008, Youtube only allowed 10 minute videos.  After I upload the 2014 conference to Vimeo, I will link everything to Shroud University.  I may then also create a YouTube Channel for broader distribution.  Its a good idea.  I have a channel for Shroud Encounter but I would want to keep them separate.  I also plan, God willing and a student I can hire for cheap, to re-upload to Vimeo all past conferences which include Ohio-2008, Rome-1993 and St. Louis 1991.  I will then terminate the link to my own server so anyone with any computer should be able to stream all the content.  That is the goal.  Pray it happens!  Its a lot of work!\n\n","date":"July 6, 2014 at 5:25 pm","url":"https://shroudstory.com/2014/07/06/put-st-louis-on-the-map/","cat":"st_louis_2014","id":"comment-135739","author":"Russ Breault","site":"shroudstory"}]
