[{"title":"St. Louis, Friday Morning","post":"Sounds interesting, Dan. Thanks.\n\n","date":"October 10, 2014 at 1:42 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161087","author":"Andy","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"It’s not really carbon dating methodology that is in the frame, is it? It’s the question as to how one takes test samples from a treasured religious icon for  sadly destructive testing such that any authenticity-supporting answer, let’s say 33 AD +/- 100 years, would not have left the then “authenticated relic” irreversibly damaged. \nThe 3 radiocarbon labs were no doubt conscious not merely of their technical responsibilities for producing accurate and roughly concordant answers but also of the weight of opinion had they turned up a answer that supported authenticity. That is the only reason I can think of for their agreeing to work on a single sample from an inconspicuous corner (“let’s be content with a ranging shot exercise for starters”). Is that so heinous a crime on their part, acquiescing to what appears to have been arm-twisting eleventh hour appeals for minimally-intrusive sampling?\nPersonally. I’ d have walked away, but that’s easy to say when there are two other competitor labs still in the running, able to grab some kind of publicity and kudos, whatever the answer, making one’s own behaviour seem prima-donna like and ungracious.\nWhy appoint three labs, when all were to be fobbed off with a single strip for subdividing? A clever game of divide and rule on the part of the nervous Shroud custodians? Solution: divide (single snipping) and play safe, covering all bets, all outcomes? Leave oneself a escape route, where others could be confidently expected to point out the all-too-obvious methodological flaw, and more besides?\n\n","date":"October 10, 2014 at 2:08 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161097","author":"Colin Berry","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"A valid point. In general I don’t like when people presume to know other people’s motivations. \nBut if the C-14 had produced a date of AD 30, I’d expect skeptics would now be doing the exact same thing — pointing out the methodology flaws. “The linen may be first century but how do we know the image area is?”\nFinger pointing back in time is useless as this stage. Eyes forward folks, lets keep those fingers holstered.\n\n","date":"October 10, 2014 at 3:03 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161104","author":"David Goulet","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"“But if the C-14 had produced a date of AD 30, I’d expect skeptics would now be doing the exact same thing — pointing out the methodology flaws. “The linen may be first century but how do we know the image area is?””\nMaybe. But I personally would not have been one of them.\nOne does not lightly impugn motives, without some kind of independent supporting evidence, preferably involving actions. \nThere was no shortage of furtive actions behind closed doors in Turin to feel fully justified in impugning motives, like the clandestine stripping out and retaining of one or more threads from the centre of the C-14 sample, only to  conveniently and shamelessly reappear later as part of a C-14 debunking exercise.\nCertain of the more shrill pro-authenticity propagandists  talk about the C-14 “fiasco”, in a shabby attempt to incriminate the scientific integrity of the labs and their personnel. Some of us have little doubt as to where the real blame lies, pointing to a wholesale abandonment of integrity, and it was upstream of the 3 testing labs.\n\n","date":"October 10, 2014 at 3:37 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161113","author":"Colin Berry","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"I believe there was motivation on both sides of it. Real blame? Only those involved know where it lies. We can only hope that any future tests are carried out with more forethought, transparency and diligence by all stakeholders. The morass we have now is beyond sad.\n\n","date":"October 10, 2014 at 4:00 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161119","author":"David Goulet","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"Even if the C14 dating would have been done on one sample that would have been taken elsewhere than the highly questionable corner that was chosen, the dating result would still need to get a valid scientific confirmation, because that particular dating only involved one single sample divided in 3. In such a context, another C14 dating on at least another sample taken elsewhere on the cloth is truly needed for comparison, no matter what people can think concerning the potential validity of the first dating.\n\n","date":"October 10, 2014 at 4:39 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161127","author":"Yannick Clément","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"“…the highly questionable corner that was chosen”.\nFollowing the 2002 major restoration , did the church make any comments concerning the discovery of  patches (or anything special that was previously not noticed ) near the “highly questionable corner” ?  The 2002 restoration should have erased any ambiguities.\n\n","date":"October 11, 2014 at 3:18 am","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161255","author":"PHPL","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"That’s a very relevant question. I do hope somebody knows the answer. The Benford/Marino patch hypothesis was well discussed for the two years prior to the restoration, and surely cannot have been unknown to the people who examined and handled the shroud during the unpicking and reattaching of backing cloths. Had it been me I would have examined it extremely carefully, back and front, with a handlens and camera, in an earnest attempt to confirm irrefutably that the radiocarbon corner was unrepresentative. There were surely no sceptics around to try to confirm the opposite.\nYet I have never read any evidence that this was done. Either it didn’t occur to anybody (is this credible?), or it did, but nothing that could challenge the radiocarbon date was found.\n\n","date":"October 11, 2014 at 5:46 am","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161278","author":"Hugh Farey","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"I remember reading that Madam Flury-Lemburg, who did part of the restoration in 2002 stated she did not find traces of stitching in the area….but I may be mistaken.\nRon\n\n","date":"October 11, 2014 at 11:09 am","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161337","author":"Ron","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"I think you’re correct – I’ve read that too; but did she specifically look for interpolation with the interweaving hypotheseis in mind, or was it more of a general observation?\n\n","date":"October 11, 2014 at 11:45 am","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161344","author":"Hugh Farey","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"Mechtild  Flury-Lemberg wrote an article  on the reweaving – I haven’t got the reference as I am in Greece- that showed her full examination showed no sign of any reweaving. She insisted that it would have been impossible to do a reweave without it being visible at least from the back. She took Rogers, Benford, Marino to task for failing to explain where they thought the reweaving might actually be- presumably it had to stop somewhere but they provided no evidence where. She certainly could not find it anywhere unless it was completely within the sample area. I don’t think I am misrepresenting her but she came across as very dismissive of Rogers.\n\n","date":"October 11, 2014 at 12:07 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161353","author":"Charles Freeman","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"Mechtild Flury-Lemberg wrote an article on the reweaving – I haven’t got the reference as I am in Greece- that showed her full examination showed no sign of any reweaving.\nhttp://www.shroud.com/pdfs/n65part5.pdf (and illustrations: http://www.shroud.com/mechthild.htm ).\nBut her conclusions seem to be completely wrong, for several reasons -the latest reprot by Donna Campbell seems to be one of them:  http://www.shroudofturinexhibition.com/Shroud_of_Turin_exhibition/Home_files/Updated_report_on_the_Consideration_to_the_Uniformity_and_Effects_of_the_Fabric_in_the_Shroud_of_Turin-5-1.pdf  But later on.\nShe took Rogers, Benford, Marino to task for failing to explain where they thought the reweaving might actually be- presumably it had to stop somewhere but they provided no evidence where.\nI am currently quite certain where the approximate border between patched and non patched area were -but this would require writng a long presentation to show that, and I am currently too busy for that.\n\n","date":"October 11, 2014 at 12:43 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161360","author":"O.K.","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"Most of the “suspicious” material found by Rogers and later confirmed by John Brown were so tiny that it took a microscopic backed-up by a chemical analysis.  It’s evident that Flury-Lemberg never did those things and, therefore, it’s not that surprising that she didn’t find any traces of an invisible reweaving…\n\n","date":"October 12, 2014 at 4:04 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161750","author":"Yannick Clément","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"you should read “it took a microscopic analysis backed-up by a chemical analysis”.  Now, that’s better…\n\n","date":"October 12, 2014 at 6:08 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161782","author":"Yannick Clément","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"“I am currently quite certain where the approximate border between patched and non patched area were ”\nWere you a member of the 2002 restoration team ? Were you or are you in contact with the people who performed the restoration ?\n\n","date":"October 11, 2014 at 12:58 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161367","author":"PHPL","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"There is nothing in Donna Campbell’s paper that suggests that any of the visible threads are not integral to the cloth. There is a thin black ‘hair,’ about the same thickness as a single fibre, which she thinks is integral to the cloth. It is not a thread, and not even part of a thread, and cannot have had any structural or load bearing function. It may be a hair from the orginal weaver.\n\n","date":"October 11, 2014 at 1:13 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161373","author":"Hugh Farey","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"Were you a member of the 2002 restoration team ? Were you or are you in contact with the people who performed the restoration ?\nNo -I just watched some photographs and read some papers on the C-14 -the same photographs and papers that you have read, as they are publically available -and I used some reasonable analysis of all the facts +some gut feelings. I can guess with great probability where the patch began and went through, and where it ends. \nThere is nothing in Donna Campbell’s paper that suggests that any of the visible threads are not integral to the cloth.\nThere is a phrase: “However, there are signs in the Shroud sample that direct the notion of\nmending or reweaving of the actual woven fabric.” (pg. 16)  and there is a list of notions, suggesting this sample is anomalous. It does not prove alone that the new material was added, of course, however combining with direct examination of the threads (performed by Adler, Rogers, Villareal , Heimburger and others), we can be 99 % certain that there is somehow interpolated material there. Add to this the statistical and regression analysis -it all makes sense. Contrary to Flury-Lemberg theories about dirt, sweat and oil -which we can say have been conclusively discredited.\n\n","date":"October 11, 2014 at 1:40 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161379","author":"O.K.","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"“reasonable analysis” … “gut feelings” … “I can guess” … “we can be 99 % certain” … Woah! Hold it there. You may be 99% certain of reweaving, but in the absence of any actual reweaving being apparent, I am 99% (well, 90%) certain there is no re-weaving at all.\nArguments against: The only textile expert to have examined the Shroud in search of reweaving says there isn’t any. The textile expert who was present when the sample was taken says there wasn’t any. Shroud 2.0 shows none. The back-lit photos and X-rays show none. The London sample examined by Ms Campbell shows none. The Arizona sample photographed by Barrie Schwortz shows none. Gilbert Raes, another textile expert with hands on knowledge, didn’t consider it.\nArguments for: But never mind the textile experts or photos of the weave, let’s go for three or four microscopists who have spotted some cotton fibres but can’t decide how many, some anomalous vanillin content, and some utterly discredited quad mosaic photos.\nMaybe I am 99% certain there is none afer all.\n\n","date":"October 11, 2014 at 2:22 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161386","author":"Hugh Farey","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"Maybe I am 99% certain there is none afer all.\nSo how can you explain the failure of significance tests and the presence of gradient among the samples?\nThe estimation of where the borders of the patch were, is pretty simple, trust me. I’ll try to show it to you this evening, so please wait.\n\n","date":"October 11, 2014 at 2:28 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161387","author":"O.K.","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"The estimation of where the borders of the patch were, is pretty simple, trust me. I’ll try to show it to you this evening, so please wait.\nUnfortunately not today. Maybe tomorrow, maybe later.\nAnyway, Poland 2:0 Germany.\n\n","date":"October 11, 2014 at 6:00 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161426","author":"O.K.","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"We all know Hugh’s viewpoint on the 1988 C-14 dating.  He seems to have come to the conclusion that the waiving of the 1985 agreed protocols is acceptable, that results from a single sample whose representative provenance has been seriously questioned is acceptable, that failing a chi square test and the presence of a gradient is acceptable, that Rogers’ examination of the thread and his discovery of dyes and other extraneous matter can be set aside, that there is no such thing as invisible reweaving despite the evidence of the Benford-Marino investigations, that the presence of vanillin in the samples counts for nothing, that there is no need for representative sampling, that the differences discovered by Gilbert Raes in 1975 do not demonstrate heterogeneity, etc, etc.  His much vaunted scientific rigour he claims is essential to demonstrate the object’s authenticity is to say the least highly selective when it comes to evaluating the contrary viewpoint!\n\n","date":"October 11, 2014 at 5:18 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161418","author":"daveb of wellington nz","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"Well, that’s not entirely true, as you know. Few of these remarks are as black and white as they are represented here, and the weight attributed to their relevance is indeed somewhat subjective. So, the conclusions I seem to have come to:\n1) Yes, the waiving of the protocols was a pity, and caused a lot of bother, but it has no relevance to the actual dating procedure.\n2) Results from a single sample are satisfactory as long as it is representative. It is true that this has been seriously questioned, but it not true that it has been discredited. On the whole, I find insufficient reason to doubt that the sample was indeed representative.\n3) The chi-squared test is a measure of similarity, it not something you pass or fail. If there is a 95% or greater chance that two results are of the same provenance, the hypothesis that they are is, by convention, considered established. If the chance is is less than 95%, then the hypothesis is not considered formally established. This is not the same as saying that it has been disproved. The figure for the Shroud is 94%.\n4) Riani and Atkinson’s chronological gradient is significant, and indicates some discrepancy along the length of the radiocarbon sample strip. It does not discredit a medieval date at all, nor demand any interweaving, although some contamination may be possible.\n5) Rogers’s discovery of various contaminents may contribute to an understanding of the chronological gradient described above, but is not in itself any evidence of an interweave. Some of his conclusions, such as the use of a water-soluble gum, lack credibility.\n6) The reasons I do not believe in the reweaving are described above and in detail elsewhere. It has not been demonstrated at all.\n7) The presence or absence of vanillin could be significant, as I have already said.\n8) Gilbert Raes discovered no differences between his sample and the Shroud. Later studies on the Shroud itself have attempted to show that the cotton content, if any, of the rest of the Shroud does not match that of the Raes sample. Whether the cotton is relevant or not is, as I have said above and many times before, dependant on rather better estimations of its quantity and location than have been determined so far.\nIn conclusion, I wholly deny that I am the slightest selective in my collection of evidence. I would go so far as to say that I am the least selective of anybody commenting on this site. If there is a shred of evidence that I have not examined with true scientific rigour I challenge anybody to produce it, and shall do my best to have the fault corrected.\n\n","date":"October 11, 2014 at 6:29 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161428","author":"Hugh Farey","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"There is much there I could comment on.  It’s all something of a circular argument.  The waiving of the protocols determined that there could be no validation of whether any sampling was representative or not.  So there is no reason for saying that the single sample was not representative!!??  Likewise there is no reason for saying that it was!  So the waiving of the protocols is only a pity!!??   \nAs the laboratories all did their testing from this single sample, it might have been expected that more or less uniform results were obtained, but this didn’t happen. \nThe Gilbert Raes results (Shroud Spectrum #39/40):\nNo. of threads / cm:  Warp (piece 1 only) 15.6;  Weft (both pieces) 25.7;\nSize of thread in tex (gm / km):  Piece 1 – warp 16.3, weft 53.6;  Piece 2 – warp 18, weft 73.1;\nPiece 1 – cotton traces;  Piece 2 – no cotton.  \nDespite the number of weft threads / cm being identical in both pieces, there is a major difference in the size (mass) of the threads.  Likewise there is a small difference in the size of the warp threads.  \nTherefore it cannot be argued that the Raes samples demonstrated homogeneity!\n\n","date":"October 11, 2014 at 11:34 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161499","author":"daveb of wellington nz","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"You miss my point. Gilbert Raes provided the data you quote himself, from personal familiarity with a piece of the Shroud. It did not apparently constitute any evidence to him that he was not dealing with a representative piece of the Shroud, and he is widely touted as one of the world’s great experts on textiles. Similarly, two other textile ‘experts’ handling the material itself, found no evidence that the radiocarbon sample was not representative. Anybody scanning Shroud 2.0 can see that the cloth is far from homogeneous; it is pulled and tugged, and there are obvious stitch holes and extraneous material. None of this, to the eyes of any textile ‘experts’ demonstrates that the radiocarbon samples were unrepresentative. Now it is well known that I have no truck with the ‘my expert is better than your expert’ argument, and insist that they do not pronounce, but explain their pronouncements. In this case, however, it is not apparent that any ‘textile expert’ who has looked at the Shroud has suggested that it might be a patchwork, and their justification for their pronouncements is surely that they have actually held the cloth in their hands and looked at it closely.\nWas that rigorous enough? What else would you like?\n\n","date":"October 12, 2014 at 4:17 am","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161567","author":"Hugh Farey","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"Hugh:\n2) Results from a single sample are satisfactory as long as it is representative. It is true that this has been seriously questioned, but it not true that it has been discredited. On the whole, I find insufficient reason to doubt that the sample was indeed representative.\nAs you will see, it has been discredited -even in the Nature report itself!\nhttp://www.shroud.com/nature.htm\n3) The chi-squared test is a measure of similarity, it not something you pass or fail. If there is a 95% or greater chance that two results are of the same provenance, the hypothesis that they are is, by convention, considered established. If the chance is is less than 95%, then the hypothesis is not considered formally established. This is not the same as saying that it has been disproved. The figure for the Shroud is 94%. \nNot true! The Chi-square for Shroud, as stated in Nature, is 6.4 for 2 degrees of freedom. The critical value for 5 % significance (we can than state that for a random there is only 5 % chance for obtaining higher values than critical) is 5.99, that is LOWER than 6.4 The significance for 6.4 value, 2 d.f. is only about 4 %. The results stated in Nature fail this (and as Remi van Haelst has shown several others) significance test, which means that there is a systematical error -the results are BIASED and cannot be considered credible.\nSee http://calculus-calculator.com/statistics/chi-squared-distribution-calculator.html\n4) Riani and Atkinson’s chronological gradient is significant, and indicates some discrepancy along the length of the radiocarbon sample strip. It does not discredit a medieval date at all, nor demand any interweaving, although some contamination may be possible. \nAs it is significant, we can throw out 1260-1390 AD date! And as we have no further reliable data, in theory any othere date + later contamination/interpolated material is possible, both medieval and 1st century.\nAnd we can say there is no external contamination (I mean oil, dirt, sweat etc.) that may account for a chronological gradient (assuming those contaminants are not uniformly distributed). In the ‘Supplemetary information’ recently released from Oxford (http://c14.arch.ox.ac.uk/embed.php?File=preprints.php ) we can read ‘Yields are very good and higher than is usually found by for similar processed by the manual method’ i.e. meaning that the samples were very little contaminated!. Neither Rogers was able to observe any significant contamination, which he should have spotted , had it been there!\nThe only reliable explanation for the chronological gradient is the reweave hypothesis -the presence of interpolated material in different ratio along the sample.\n5) Rogers’s discovery of various contaminents may contribute to an understanding of the chronological gradient described above, but is not in itself any evidence of an interweave. Some of his conclusions, such as the use of a water-soluble gum, lack credibility.\nNo -he wrote “In any case, this watersoluble,\neasily-hydrolyzed gum would have been removed\ncompletely by the cleaning procedures used on the dated samples” (http://www.shroud.it/ROGERS-3.PDF pg. 193). And how can you say that his conclusion lacks credidibility -on what basis?\n7) The presence or absence of vanillin could be significant, as I have already said.\nSo how do you cope with that?\n8) Gilbert Raes discovered no differences between his sample and the Shroud. Later studies on the Shroud itself have attempted to show that the cotton content, if any, of the rest of the Shroud does not match that of the Raes sample. Whether the cotton is relevant or not is, as I have said above and many times before, dependant on rather better estimations of its quantity and location than have been determined so far.\nDaveB answered that.\n\n","date":"October 12, 2014 at 6:54 am","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161605","author":"O.K.","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"My humble apologies, OK; I don’t know what came over me. As the Nature paper, and you, have correctly pointed out, my last sentence in this section should read “The figure for the Shroud is considerably less.” (I’m guessing about 85%).\nHowever, my principle point remains the same. Assuming the same sample was being tested, the probability of obtaining the Shroud results by chance is only 1 in 20. This is not a very high probability, and it falls below the chi-squared 0.05 value of 5.99 (95% sure that the values are from the same sample). As I say, this means that the hypothesis that the measurements are from the same sample is not considered formally established. This is not the same as saying that it has been disproved. As I say above, there is still a good chance that they are.\nI cannot agree with your next point, which is that the Riani/Atkinson findings mean that the medieval date must be rejected altogether. A row of dates along a plank of wood, for example, also show a chronological gradient, but are not, on that basis, rejected altogether. The reasons for the gradient along the wood are different, and better understood, but the principle is the same. Riani and Atkinson’s findings say nothing about the overall accuracy of the date of the Shroud.\nI do agree that the reason for the chronological gradient is not understood. It may be due to minor contamination, such as a water-fast red madder dye added to the Holland cloth to make it match the Shroud. Why Rogers’ water-soluble gum would have been applied I can’t understand. As you say, that would have been washed off by the cleaning process. It would also have been washed off by a shower of rain. What was it for?\nHow do I cope with the vanillin findings? Well I don’t. It may be a determinant factor. I wish I knew more about it. Don’t you?\n\n","date":"October 12, 2014 at 9:26 am","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161651","author":"Hugh Farey","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"Hugh:\nmy last sentence in this section should read “The figure for the Shroud is considerably less.” (I’m guessing about 85%).\nDo not guess, use calculator instead: http://calculus-calculator.com/statistics/chi-squared-distribution-calculator.html\nHowever, my principle point remains the same. Assuming the same sample was being tested, the probability of obtaining the Shroud results by chance is only 1 in 20. This is not a very high probability, and it falls below the chi-squared 0.05 value of 5.99 (95% sure that the values are from the same sample). As I say, this means that the hypothesis that the measurements are from the same sample is not considered formally established. This is not the same as saying that it has been disproved. As I say above, there is still a good chance that they are.\nIt’s not that. One should be extremely careful in understanding what all those terms mean.\nGenerally we can say, that SIGNIFICANCE is the probability of OBTAINING the result of TEST STATISTICS as stated value or above, ASSUMING (this is the key here) the random scatter. That is if all scatter is random, what is a chance that the result will be x or higher.\nThe point is that if the obtained value is higher than critical value (which is a little bit arbitrary, depenent on significance level we choose as critical), we should reject the ASSUMPTION that there is nothing but random scatter. In short: 5 % is NOT a probability that there is only a random scatter -but the probability of obtaining value higher than critical, if there is ONLY random scatter. \nI cannot agree with your next point, which is that the Riani/Atkinson findings mean that the medieval date must be rejected altogether. A row of dates along a plank of wood, for example, also show a chronological gradient, but are not, on that basis, rejected altogether. The reasons for the gradient along the wood are different, and better understood, but the principle is the same. Riani and Atkinson’s findings say nothing about the overall accuracy of the date of the Shroud.\nThis is apples and oranges. We know that there is a row of dates along a plank of wood, because trees grow for several years -contrary to the Shroud. \nAnd Riani/Atkinson do not say that medieval date must be rejected -only that 1260-1390 is unreliable. The Shroud may be from 12th, 7th, 1st century, or 3rd century BC -we don’t know its true age. But what we know, we cannot consider 1260-1390 as reliable, as there is a mix of older and newr material, of unknown relative ages and ratio!\nWhy Rogers’ water-soluble gum would have been applied I can’t understand. As you say, that would have been washed off by the cleaning process. It would also have been washed off by a shower of rain. What was it for?\nIt is a nonsense revealing your purpose. You try to imply that manipulator deliberately used some water-resistant materials, so that dye would have not been removed during pretreatment-cleaning process. It makes no sense. And what rain shower? the Shroud was carefully protected from any rains.\n\n","date":"October 12, 2014 at 1:17 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161707","author":"O.K.","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"Yes, OK, I agree with your exposition of the meaning of the statistical data and results. What I am querying is the convention of the 95%/5% pass/fail criterion. The 0.05 border between acceptability and rejection is a sensible, if conservative, way of deciding whether a hypothesis should be accepted or rejected. If rejected, of course, that does not mean it is wrong, simply that it has not been confirmed to be right, by this convention. This is exactly the case with the Shroud, and presumably the reason why the peer reviewers of the article in Nature did not reject the results out of hand. [Semi-relevant illustration. My father was a quality assurance officer for Royal Naval ordnance. For him, the 0.05 convention was far too lax, given the possible outcome of an unpredicted explosion. I have a feeling that his pass/fail criterion was 99.9%/0.01%, or 0.001. It may have been tighter still.]\n“We know that there is a row of dates along a plank of wood, because trees grow for several years – contrary to the Shroud.” Yes, of course. My point is that three furniture dates of 500, 505 and 510 years, found from samples along the length of a piece of wood, are not rejected out of hand as the ‘contamination’ of more recent C14 is well explained. Further investigation into the Shroud might permit one to assess (oh, alright, guess) the maximum level of contamination (rather less than the 60% required to make a 1st century cloth give a 13th century date), and therefore the youngest possible age of the youngest section, from which, given the date spread, the age of the other two sections could be calculated. I would be happy to give a worked illustration of this if anyone thought it worthwhile. \nBut your last bit is not reasonable. Rogers identified a water-soluble gum, which does not, to me, make sense. I do not know why anybody would put water based paint on an area he knew would be held by many hands. What, I ask myself, was the gum for? I confess that this area of speculation was brought on by pondering on Roger’s discovery of red madder and this gum. He thought that the madder was a dye on interpolated threads, to make them look more like the Shroud. I can’t find any interpolated threads, so I speculated that the madder was a dye on the Holland cloth, to make that look more like the Shroud. Certainly a photo of the area after the radiocarbon sample has been removed is much paler than the exposed part – although some have suggested that this is due to a light-induced darkening of the Holland cloth with age. I do not know how the dye would have been applied, but I don’t think a water soluble gum would be a suitable agent.\n\n","date":"October 12, 2014 at 2:53 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161733","author":"Hugh Farey","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"Rogers identified a water-soluble gum, which does not, to me, make sense.\nIt doesn’t matter that it makes no sense to you. As Rogers was professional, I trust, he he was capable of establish what was actually (and what was not) on the C14 threads he received from Gonella. And if he claimed it was plant gum with alizarin dye, I have a good confidence that it actually was plant gum with alizarin dye, with no evidence to contrary. And no sweat, oil, dirt, as he mentions none. Thus the apparent gradient shouldn’t be attributed to contamination of that form, as does Flury-Lemberg -which is one of the several nonsense in her article.\n\n","date":"October 12, 2014 at 3:35 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161739","author":"O.K.","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"What I am querying is the convention of the 95%/5% pass/fail criterion. The 0.05 border between acceptability and rejection is a sensible, if conservative, way of deciding whether a hypothesis should be accepted or rejected. If rejected, of course, that does not mean it is wrong, simply that it has not been confirmed to be right, by this convention.\nhttp://www.shroud.com/nature.htm Table 2.\nThe Control 1, Chi-square value 0.1, significance 90 %\nThe Control 2,  Chi-square value 1.3 significance 50 %\nThe Control 3, Chi-square value 2.4  significance 30 %\nThe Shroud, Chi-square value 6.4  significance 4 % !!!\nIt definitely should have ring the alarm bell. But they instead chose to pretend that nothing happened. That all was fine -and Shroud conclusively proved medieval.\n\n","date":"October 12, 2014 at 3:45 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161743","author":"O.K.","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"“But they instead chose to pretend that nothing happened.” They mentioned the anomaly, and attempted to explain it by suggesting that the errors quoted by the laboratories did not reflect the overal scatter. They even entertained the notion that that there were uncertainties in the three dates relative to one another (science speak for ‘from different samples’) but “in the absence of any direct evidence on this” they proceeded on the assumption that the dates were from the same sample. I think I would agree with you that, given the above, the words “conclusive evidence” were a little over-confident. “Substantial evidence” might have been better.\n\n","date":"October 12, 2014 at 6:28 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161788","author":"Hugh Farey","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"I suppose that’s true!\n\n","date":"October 12, 2014 at 3:39 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161741","author":"Hugh Farey","site":"shroudstory"},{"title":"St. Louis, Friday Morning","post":"HF, Oct 12, 4:17 am: “It did not apparently constitute any evidence to him (Raes) that he was not dealing with a representative piece of the Shroud, and he is widely touted as one of the world’s great experts on textiles.”  \nIn 1973, Raes, together with a few others, replaced former members of Cardinal Pellegrino’s Commission 1969-76.  This was prior to the 1978 STURP project, and clearly well before the 1988 C-14 sampling was projected.  So the question of whether or not the samples were representative was not so much of an issue.  It was clearly a pilot investigation, not intended as a dating exercise.  It so happened that the the C-14 samples were eventually taken from the same area.  Raes was rather more fortunate with his samples, than were the others who among them received only individual threads, perhaps 16 or so, the longest being only 28 mm.  In addition to his two threads Raes was given two pieces, Piece 1 (main corner) 40mm x 13mm;  Piece 2 (side strip) 40mm x 10mm.  So he was fortunate indeed, and would hardly quarrel that they were not representative. \nIn commenting on Raes’ report, Ian Wilson notes:\n“But, as Raes observed, the size of the threads in Piece 2 certainly seems to be different from that of those in Piece 1.  He qualified this by saying that due to the very short length of the threads examined it would be impossible to be sure that they are from fabrics of different manufacture.  But the inference is undoubtedly there.  And it is strengthened by the fact that Raes was unable to find in Piece 2 any of the cotton traces of the main body of the cloth.” \nWilson had his own agenda in distinguishing the sources of the two pieces.  But setting that aside, It seems that it was sufficient for Raes to comment on. An alternative hypothesis to the two pieces being of different manufacture, is that one of the areas may have had repair work done to it.  It cannot be asserted that the Raes samples demonstrate homogeneity!\n\n","date":"October 12, 2014 at 7:44 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","id":"comment-161799","author":"daveb of wellington nz","site":"shroudstory"}]
