[{"title":"St. Louis Theology Presentation by Russ Breault","post":"From Russ’s Powerpoint presentation  (see above):\nHowever … Unlike the Burns\nThe image does NOT fluoresce under uv fluorescence.\nThe image is NOT the result of heat\nSo… it looks like a scorch, but isn’t.\nThere’s one thing we can be pretty sure about: the TS image was NOT formed by the kind of high-temperature incineration that produced the 1532 damage. The latter was full thickness burns, leaving gaping holes with charred and scorched edges. Nothing so extreme is or was needed to produce an image of TS-like faintness by brief contact scorching from a heated template.  The latter is cooling the moment it makes contact with the cloth, producing (if one wishes) a superficial image that affects only a few fibres at the surface of the thread with no obvious reverse side scorching.\nIf you’re going to hold up the 1532 burns marks as a reason for rejecting the scorch model then do please add some caveats. If you’re feeling generous, you could even introduce some balance by pointing out how well they respond to 3D enhancement, just like that ‘profoundly mysterious’ TS image (see this blog’s margin notes). Sorry to mention the bword…\n\n","date":"December 6, 2014 at 6:24 am","url":"https://shroudstory.com/2014/12/06/st-louis-theology-presentation-by-russ-breault/","cat":"st_louis_2014","id":"comment-174899","author":"Colin Berry","site":"shroudstory"},{"title":"St. Louis Theology Presentation by Russ Breault","post":"In this paper/presentation I am only looking at how the Shroud corresponds with either theological or apologetic concepts.  It is a fact that the image does not fluoresce so that certainly suggests the image is not the result of heat. It may not be absolute proof that low level heat was not involved.  However experiments done by Thibault are enough to convince me that this premise is highly unlikely.  And if such a sculpture or bas relief was ever created to fabricate the Shroud image, as renowned artist Isabel Piczek said, they kept the wrong artwork, the sculpture itself would have been a masterpiece unlike anything else of the period.\n\n","date":"December 6, 2014 at 8:54 am","url":"https://shroudstory.com/2014/12/06/st-louis-theology-presentation-by-russ-breault/","cat":"st_louis_2014","id":"comment-174915","author":"Russ Breault","site":"shroudstory"},{"title":"St. Louis Theology Presentation by Russ Breault","post":"There might be a hundred differences between the TS image and certain model scorches depending on factors like temperature. All one is doing with a uv lamp is showing up just one or two of those differences, due to presence or absence of particular chemical entities while remaining ignorant of all the others that are non-fluorescent. \nIf you don’t know (or care) what’s causing the fluorescence at the molecular level, then any argument based on fluorescence is frankly worthless, especially when it’s about the absence  of fluorescence. \nYes, I for one would like to know which particular chemicals give certain scorches their uv fluorescence (I suspect they are polycyclic aromatics whose flat shape favours loss of energy from excited electronic states by fluorescence).   \nBut gaps in one’s knowledge that one freely acknowledges are no grounds for being held hostage for not having done those experiments, not when others, better equipped than I am,  haven’t bothered to do them either, being content to ‘play the fluorescence’ card, or allow others to do so.\nI prefer to hypothesize and experiment, that being the scientific MO. I don’t ‘play cards’. \nWe can discuss TH and his pdfs another day. Suffice it to say I have checked out his claims and found them wanting or incorrect in certain key aspects, as he has been made aware.\n\n","date":"December 6, 2014 at 9:58 am","url":"https://shroudstory.com/2014/12/06/st-louis-theology-presentation-by-russ-breault/","cat":"st_louis_2014","id":"comment-174930","author":"Colin Berry","site":"shroudstory"}]
