[{"title":"Anticipating the Conference:  Robert Siefker on Observations, Data and Hypotheses","post":"Good grief. Didn’t Colin Berry already do a number on this?  This document claims it is an established fact that “There are images of teeth and bone structures associated with the face, as well as indications of finger bones all the way to the wrist. There is also a shadow image of a hidden thumb.”  Established fact?\n\n","date":"June 27, 2014 at 6:15 am","url":"https://shroudstory.com/2014/06/27/anticipating-the-conference-robert-siefker-on-observations-data-and-hypotheses/","cat":"st_louis_2014","id":"comment-133075","author":"Paulette","site":"shroudstory"},{"title":"Anticipating the Conference:  Robert Siefker on Observations, Data and Hypotheses","post":"Too right, Paulette. Even with the best of intentions, Version 1 comes across as pompous persiflage more than a Scientific consensus. The very first example announces that it is an ‘established fact’ that ‘we cannot appreciate which image is the more evident, front or back.’ What a shame that similar established facts are not more prominent. The second statement (also an ‘established fact’) is gibberish: “The body image has the normal tones of light and dark reversed.” I ask you. Examine your own body. What are your “normal tones?” What would you look like if your “normal tones” were reversed? No, it explains, normal tones are the normal tones of a black and white photograph – except that can’t be true, because the third statement (another ‘established fact’) says the Shroud image doesn’t behave like a normal photograph at all, and uses a VP8 image (which looks exactly like a bas relief) to illustrate the statement that the image density can be correlated to the “clearances between the three dimensional surface of the body and a covering cloth.”\nEven the most fanatical Shroud authenticist must find it hard not to be embarrassed by such nonsense. I do hope the presentation at St Louis is a little less didactic and quite a lot less bombastic!\n\n","date":"June 27, 2014 at 9:18 am","url":"https://shroudstory.com/2014/06/27/anticipating-the-conference-robert-siefker-on-observations-data-and-hypotheses/","cat":"st_louis_2014","id":"comment-133098","author":"Hugh Farey","site":"shroudstory"},{"title":"Anticipating the Conference:  Robert Siefker on Observations, Data and Hypotheses","post":"When shadows of artifacts constitute reality, sindology really looks like the allegory of the cave. And these guys have PhDs…\n\n","date":"June 28, 2014 at 4:45 am","url":"https://shroudstory.com/2014/06/27/anticipating-the-conference-robert-siefker-on-observations-data-and-hypotheses/","cat":"st_louis_2014","id":"comment-133252","author":"anoxie","site":"shroudstory"}]
