[{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"How long do we wait for the image on the Shroud to be declared a miracle in Christianity ?\n\n","date":"June 4, 2014 at 1:20 am","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-126679","author":"ekmcmahon","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"Here we go again.  Someone talking imprint. In a comparison analogy this would be the equivalent of a new detective hired to shed new light on a unsolved murder case going back and re-questioning a suspect that was eliminated as being possible of committing the crime.\n Despite being told with unmistakeable clarity that this suspect has already been questioned by 100’s of other detectives and each time he is eliminated, the new detective gets the idea in his head that somehow “this guy did it’   Perhaps a even better comparison analogy, is that of a person in a mental institution that keeps banging their head against a wall all day,    but if Joseph Accetta wants to bang his head against a wall,  let him do it.  \nThe closest imitation done of The Shroud Image  (a very small fragment of it, not a complete image)actually involves using high frequency, short wave bursts of microscopic lasers. We can logically conclude that The Shroud image was formed in this manner.\nNow Russ B’s theory of Jesus being the light source that formed Shroud image has solid ground in what are not widely  known but established scientific facts.\n1973, Miller, Webb and Dickson described DNA as a holographic projector (see “Embroyonic Holography”). In other words, genes encode and express themselves via light and radio waves, or acoustical holography (see “Quantum Bioholography”, Miller, Miller and Webb, JNLRMI , 2002). Delocalized interference patterns create calibration fields (blueprints) for our bodies’ space-time organization. The system works as a biocomputer — a wave biocomputer.\n DNA can also function as a gel-like liquid crystal, emitting a weak laser-like light that can be converted into an electro-acoustic signal.\n“Our body is a walking crystal.  We can receive, we can transmit and we can store electro-magnetic energy.” – Dr Norman Shealy, American Holistic Research Physician and Neurosurgeon.\nThe only lasers that can could create a image that would be less than the thickness of a human hair such as seen on the Shroud are Liquid Crystal Lasers, the chiral liquid crystal provides sufficient feedback to generate lasing within a device of thicknesses less than a human hair.\nCoincidence:  Human DNA is made up of a gel like liquid crystal that can emit microscopic laser light.  That is a fact, that is not speculation.\nI am convinced that if the gel like liquid crystal DNA in the human body was exposed to a fine point, minimum 4 decimal point accuracy electro-magnetic field it will fire off a microscopic laser light capable of producing the Shroud image.   Not sound or radio, but magnetic that would cause the DNA to oscillate and react by emitting light.\nBottom Line:   Russ B’s Image Formation theory is correct,\n“Jesus was lit up like a Christmas Tree”\nThat is the only remaining possibility.   The only suspect that cannot be eliminated. And no matter improbable that may seem, it must be the Truth.   May that set us ALL FREE!\n\n","date":"June 4, 2014 at 3:12 am","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-126690","author":"Dave Hines","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"New detective you say?  Joseph Accetta was a member of the original STURP team, one with impeccable credentials in lasers and imaging.\n\n","date":"June 4, 2014 at 3:18 am","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-126691","author":"colinsberry","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"So there’s someone from STURP who you actually think knows what he’s talking about? Who woulda thunk it?\n\n","date":"June 4, 2014 at 11:01 am","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-126776","author":"LS","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"Hi colinsberry, I am nobody from nowhere.  I have no credentials. so not a single person is going to take what I say with any degree of seriousness on this discussion.   I was under the mistaken impression that people on this blog believed The Shroud of Turin to be authentic.\nMy huge mistake on that.\n Like an idiot I thought I was going to make some friends on this site and be able to talk about The Shroud of Turin without being attacked. That was my 2nd huge mistake.\n When I hear someone is going to get up and make a presentation and present evidence The Shroud is the result of printing from the 14th century, I am out of here.\nI am not making a 3rd mistake by continuing to talk about it\n I am sorry I took up the space I did on this subject and for the time you had to take just to ready my stupid comment.\n it will not happen again.   I know where the exit door is.\n\n","date":"June 4, 2014 at 11:11 pm","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-126920","author":"Dave Hines","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"If I’d intended to attack you and your avant garde ideas re subcellular DNA laser guns, Dave Hines, I’d have put a few pointed questions to you, like how come the TS man’s hair is so well imaged given that hair, mainly dead keratin beyond the follicle, has scarcely any intact DNA after cornification, and more besides. As it was Hugh Farey took on that task, and I was content merely to point out that Joseph Accetta PhD (not to be confused with the radiologist August ‘glow-in-the-dark’ Accetta MD) was no new kid on the block, as suggested by your ‘new detective’ tag. There was no personal attack in making that small point.\nMy advice to you is to hang around. You might find the site is a broader church than you first imagined. Shame about the agenda-driven blue sky thinking, though, when unsullied by anything so crass as hard experimental data.\n\n","date":"June 5, 2014 at 1:10 am","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-126944","author":"colinsberry","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"“My advice to you is to hang around. You might find the site is a broader church than you first imagined”\nColin, What a change of heart. I thought this was “Troll centre”, where Pseudoscience and character attacks thrive?\n\n","date":"June 5, 2014 at 7:22 am","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-127009","author":"Mike M","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"Ah, Dave…  Scientists, like, I dare say, Joseph Accetta, avoid words like “we can logically conclude” unless they are pretty sure of their logic. Although your comments are clearly heartfelt by you, personal conviction alone is not enough to warrant the term.\nProducing a minute surface discolouration of a cloth with a high-powered laser is interesting but certainly does not lead to any logical conclusion about the origin of the image on the shroud.\nAnd I’m interested in your “not widely known but established scientific facts.” This is contrary to the nature of a scientific “fact,” if such there be. Science establishes its norms precisely by making them widely known, and consequently accepted. Miller, Webb and Dickson’s vague and unsubstantiated hypotheses of Quantum or Embryonic Bioholography are certainly not established facts, and neither is any of the subsequent dogma about the body being a crystal and so on.\n“Human DNA is made up of a gel like liquid crystal that can emit microscopic laser light. That is a fact, that is not speculation.” That is certainly not a fact. It is wholly untested. In this context, it is not even obvious what is meant by “microscopic,” or “laser,” or even “light.” There are good, widely known and widely accepted definitions of these words, none of which currently apply to any results achieved from experimentation with DNA.\n“Bottom Line: Russ B’s Image Formation theory is correct: Jesus was lit up like a Christmas Tree. That is the only remaining possibility.” No, it’s not.\nThe point perhaps is not that these ideas are bunkum from start to finish – for all I know they may be absolutely spot on – the point is that without wide acceptance, and in particular experimental or observational evidence, they cannot be distinguished from the little green alien, the giant spaghetti monster or the Soviet plot, and tend to place their adherents at the far fringes of scientific recognition rather than in the forefront they so passionately think they deserve.\n\n","date":"June 4, 2014 at 4:23 am","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-126702","author":"Hugh Farey","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"Hi Hugh, thanks for replying to my post,  this is a article I was reading I thought I would share with you, it is related to the subject matter of a human cell emitting a laser beam.  \n“Scientists have for the first time created laser light using living biological material: a single human cell and some jellyfish protein.\n“Lasers started from physics and are viewed as engineering devices,” says Seok-Hyun Yun, an optical physicist at Harvard Medical School and Massachusetts General Hospital in Boston, who created the ‘living laser’ with his colleague Malte Gather. “This is the first time that we have used biological materials to build a laser and generate light from something that is living.” The finding is reported today in Nature Photonics 1.\nBuilding a laser requires two things: a lasing material that amplifies light from an external source (a ‘gain medium’) and an arrangement of mirrors (an ‘optical cavity’), which concentrates and aligns the light waves into a tight beam. Until now, the gain medium has only been made from non-biological substances such as doped crystals, semiconductors or gases, but in this case the researchers used enhanced green fluorescent protein (GFP) — the substance that makes jellyfish bioluminescent, which is used extensively in cell biology to label cells.\nThe team engineered human embryonic kidney cells to produce GFP, then placed a single cell between two mirrors to make an optical cavity just 20 micrometres across. When they fed the cell pulses of blue light, it emitted a directional laser beam visible with the naked eye — and the cell wasn’t harmed.\nThe width of the laser beam is “tiny” and “fairly weak” in its brightness compared to traditional lasers, says Yun, but “an order of magnitude” brighter than natural jellyfish fluorescence, with a “beautiful green” colour. \nI believe this type of research is the direction we need to be headed in to learn more about the Shroud image, not to go back into the dark ages and the stone knife and bearskin thinking of The Shroud image being a result of  paint, pigment or imprint, add camera obscura to that as well.     \nI am not by any means any kind of expert in microscopic laser technology, but I am fast learner.\nMy area of research before getting involved with the Shroud of Turin was in ELF waves and ELF technology.  I still do field research in this area and I am in fact getting ready to fly overseas to get started again.     \nWhen I have something more solid on video tape I will show it to you.  Like you, I am a person who believes physical evidence is a critical part of a convincing presentation.\nI agree,  we need more physical evidence that would demonstrate how a human cell is capable of emitting a microscopic laser that we could observe, measure and compare with Shroud image & to get it on film and show it. \n  I am working on producing that.  When I get it I will be in touch again.     PEACE\n\n","date":"June 4, 2014 at 3:25 pm","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-126827","author":"Dave Hines","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"An interesting article indeed, but wholly irrelevant to the shroud. The laser emitting substance is a simple protein (GFP), not DNA. It does not need a living cell to generate any kind of light, let alone laser light, which can be stimulated in a solution of the protein in a test-tube. The researchers investigating the production of laser light in a cell were considering how conditions in the cell could affect the observed light, such as by the rate of production of the protein or its interaction with intracellular material, with a view to ‘reading’ the state of the cell. This is a far cry from Jesus lighting up like a Christmas tree.\n\n","date":"June 4, 2014 at 4:18 pm","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-126834","author":"Hugh Farey","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"Hi Dave, you sound a bit peeved in your comment above, which I’m sorry if I provoked.\nHowever I’m a little worried by your impression that this blog was for people who believed the Shroud to be authentic. As I understand Dan’s object in supporting it, this blog is for people who want to find out more about the Shroud, authentic or not. From time to time we do get comments like: “It’s obviously authentic, so stop bickering,” and a very few that say: “It’s obviously a fake; get over it.” But as these commenters have little to add to the discussion, they usually don’t stay. Even those who are wholly convinced in principle one way or another contribute variations on the details. The non-authenticists are not unanimous on the provenance or manufacturing method, and the authenticists tie themselves up in knots (literally: see recent discussions) about how the Shroud was fixed or draped over the body.\nIdeas from science, fringe science and frankly whacky science are all grist to the mill, and given an honest review. I have now read several articles from Nature Photonics, and am much more familiar with the work of Seok-Hyun Yun and Malte Gather, who published their experiments with light induced laser emission from GFP in living cells in 2011. I can’t find any further research on the subject. Quantum bioholography failed to find any scientific acceptance by the end of the 2000s, and seems by now to have been rejected as a serious study even by its previous adherents.\nELF waves, on the other hand, could be a promising field of research and you may find yourself particularly welcomed by daveb, who has long championed Giovanna de Liso’s work on imaging during earthquakes. You are no doubt familiar with the WHO paper: Extremely Low Frequency Fields\nEnvironmental Health Criteria Monograph No.238, which leads to some interesting speculation.\nColin was quite correct to point out that comparing Joseph Accetta with “a person in a mental institution that keeps banging their head against a wall all day” was a hostile, ignorant and unwarranted attack, but generous enough to suggest that you “hang around. You might find the site is a broader church than you first imagined.” I agree with him whole heartedly.\n\n","date":"June 5, 2014 at 3:13 am","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-126966","author":"Hugh Farey","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"I see The Shroud of Turin investigation being first and foremost a wrongful death case, a unsolved murder.   I think it is important not to lose sight of the fact (or evidence that strongly suggests) that a brutal and sadistic murder took place.  We want to give a name to the person who was wrapped in that Shroud.  Out of respect for him and to do a thorough investigation.   I believe the Spirit of God has given us all the evidence we need to be able to make these determinations, we just need to put it all together.  \nWhen I hear 14th century printing, I think Walter McCrone,  When I hear that someone from STURP is going to present evidence of the Shroud being a print from 14th century, I am shocked, in the same way if I read Barrie S. was going to give a presentation of a similar nature.\nI thought at the very least we were at a point in the investigation where we could all agree that the Shroud was in existence in the 7th century.  Alright, so I am wrong on that. \nOne of the focal points of the investigation should be in determining what the calculated odds that all the match points between the Sudarium and The Shroud are  coincidental and do not come from the same person.\nWhat is that number?   We should know it.  I blame myself for not having it available to post here.  It shows my own investigation has not been conducted thoroughly\n(Shame on me) \nI suspect that it is one in several million, but I am not qualified to quote the odds of probability and chance on that.\nBut it looks something like this.\nMatch Points\n1. Type AB Blood\n2. Blood degraded to the point on both cloths where rh factor cannot be determined.   (That is actually a match point)\n3. Both contain post mortem blood & fresh blood\n4. Both cloths contain pulmonary edema fluid\n5. Both contain pollens that only bloom at time of passover\n7. Absence of clotted blood on both\n8. Elevated levels of bilirubini on both\n9. Fabric on both is same thickness, same threads per surface unit.\n10. 120 points of head on Sudarium, match head area of Shroud\n11. Nose of the man on both cloths is 8cm\n12. Identical form of chin on both heads\n(A revised list that everyone can agree on would have to made, this is a sample/example list only)\nWe need to approach it from a purely mathematical standpoint. Neither adding or taking anything away & calculate the odds of probability and chance that all the match points are a coincidence and do not come from the same person and for the time being leave the name of “Jesus” out of the equation entirely.  \nEXAMPLE;  The calculated odds that all the match points between the person whose head made contact with the Sudarium and the person whose head made contact with the Shroud are coincidental and are  NOT from the same person are 1 in 1 million  or 1 in ______.   What is the number? \nWhen we know that number we should be able to draw a logical conclusion, one that we can all be certain of beyond any reasonable doubt.\nI think everyone here already knows deep down inside the conclusion that would be determined after seeing that math. \nThe problem is being able to agree on what are established facts in the case file.   Even going back to my opening statement.  If we cannot even agree that a wrongful death took place there is no point in even continuing.  That has be determined and agreed upon 1st and foremost before anything else.  I thought that was done. Likely I am wrong again.\nHow convinced is the scientific community of the conclusions drawn by the Spanish Center For Sindonology?\n FACT: The Sudarium of Oviedo was in existence in the 7th\ncentury. . \nFACT:  Spanish Government believed the cloth to be authentic, and was the property of Jesus of Nazareth.\nAre those 2 things we could all agree on? \nBottom Line:  I think the Shroud investigation should at least be narrowed down to a 7th century event that took place, not a 14th century event.\n\n","date":"June 5, 2014 at 10:10 am","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-127037","author":"Dave Hines","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"“the observed 3-d properties cannot be reconciled with any known radiative imaging process and thus must be a contact process.”\nHow about unknown radiative imaging process?, How can it be a contact process when the image appears in places where there is no contact?\n\n","date":"June 4, 2014 at 6:46 am","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-126732","author":"Mike M","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"Mike, you hit the nail over the head.\n\n","date":"June 4, 2014 at 11:08 am","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-126780","author":"Louis","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"I am certainly interested in his ‘geographical circumstance’ and ‘ locale’ , unspecified in the Abstract, as I shall be interested to see which ‘locale’ of Europe he locates the creation of the Shroud in and why. This was still a continent of diverse cultures and traditions (e.g Gothic architecture seldom travelled south of the Alps) and presumably he thinks one of them more likely to have inspired the Shroud than the others.\n\n","date":"June 4, 2014 at 11:33 am","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-126784","author":"Charles Freeman","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"Did Leonardo da Vinci or even Gutenberg know about this 13-century printing technology?!\n\n","date":"June 4, 2014 at 12:07 pm","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-126791","author":"Louis","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"This may be the most anticipated paper of the conference. Surely there will be questions. I would add an extra half hour for this. Maybe continue through lunch.\n\n","date":"June 4, 2014 at 1:07 pm","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-126799","author":"Paulette","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"I would not anticipate too much about printing techniques.\n\n","date":"June 4, 2014 at 1:43 pm","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-126808","author":"anoxie","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"The key word here is, I think, speculations. But we will see.\n\n","date":"June 4, 2014 at 2:02 pm","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-126810","author":"O.K.","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"There will probably not be enough time for Q&A, so we would have to wait for Joseph Accetta’s paper and say whatever has to be said in another paper.\n\n","date":"June 4, 2014 at 2:20 pm","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-126815","author":"Louis","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"Bishop d’Arcis wrote that the Shroud (the one being exposed) was painted, he didn’t say produced or printed. Joseph Accetta’s paper should be interesting and, despite his qualifications, it will undoubtedly be contested. Well, we will have to wait.  ‘\n\n","date":"June 5, 2014 at 6:55 pm","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-127139","author":"Louis","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"We have different accounts of Jesus: he could change appearance, he could be transformed into a being of light, power emanated from his body. It is things like these that gave rise to Monophysitism.\n\n","date":"June 4, 2014 at 4:35 pm","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-126837","author":"Louis","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"I have just re-read through Ray Rogers’ 2004 paper, “Frequently Asked Questions”.  It has more technical information than any non-chemist such as myself can possibly use.  However several major points emerge.  There is absolutely no trace of paint or dye or ink that can have formed the image; the cellulose of the linen was not involved in forming the image; the image is only present on the top-most crowns of the fibres;  any form of radiation could not have formed the image as it would have inevitably affected the fibres;  the coloration can be removed by the use of the solvent dimide which leaves the fibres underneath completely intact and unaffected;  Rogers firmly believed that the coloration lay in the sugar/starch coating of the fibres, and not the fibres themselves.  \nJoseph Accetta is asserting that all properties of the image can be explained by printing techniques available in the 14th century.  Unfortunately there are no clues in the Conference abstract of his paper as to what those printing techniques might be.  This must be a most mysterious printing process indeed, as according to Rogers it must exclude all dyes, paints and inks, or for that matter any organic compound containing any non-organic element, and it cannot involve any kind of radiation, and it must be confined to the surface coating of the fibres and not implicate the fibres themselves.  No doubt the conferees will be most curious to discover what this most mysterious printing process might be.  Of course Dr Rogers could be incorrect in a few of his assertions, but so far they all remain undisproved.  Of course if one ignores facts, one might assert just about anything at all, even a hitherto unknown mysterious printing process.\n\n","date":"June 5, 2014 at 7:15 am","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-127006","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"I find it difficult to reconcile “absolutely no trace of paint or dye or ink” and “the sugar/starch coating.” Surely, if the sugar/starch coating was coloured, it would constitute an ink! Perhaps Joseph Accetta’s printing technique involves a thick solution of molasses mixed with cornflour…\nRogers envisaged a sugar/starch mixture which, although the shroud was steeped in it, migrated to the edges via the useful evaporation gradient. He carried out quite a good experiment with blue ink to demonstrate this. However, if, instead of postulating a colourless “paint” which was discoloured by vapours, he had considered the posibility of the “paint” being coloured in the first place, then no vapours would be necessary.\nHas anyone licked the shroud to find out what it tastes like….\n\n","date":"June 5, 2014 at 11:54 am","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-127054","author":"Hugh Farey","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"Doesn’t lemon juice produce ghostly imagery? I’m trying to recall my junior detective handbook instructions for invisible ink.\n\n","date":"June 5, 2014 at 11:57 am","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-127056","author":"David Goulet","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"Try downloading this PowerPoint presentation from Joseph Accetta, David (he being the subject of a recent posting here, and one of STURP’s genuinely scientific, non-agenda driven, non grandstanding participants in my view). \nhttp://www.holyshroudguild.org/media/%20INFRARED%20IMAGING%20AND%20SPECTROSCOPIC%20PHENOMENOLOGY%20OF%20THE%20TURIN%20SHROUD.ppsx\n(Unzip as if a pdf).\nGo to the last few pages (approx 24/25). There you will see model spectroscopic (ir) studies not just with thermally-imprinted  scorches, but also with linen that has been chemically dehydrated with 36% H2SO4 and even your invisible ink (lemon juice).\nI’d be the first to admit there may be little to distinguish between an image produced by chemical as distinct from thermal dehydration (especially if chemical action was heat-assisted – see Luigi Garlaschelli’s model ‘frottage’ imprinting with acid-contaminated red iron oxide). It’s the vehicle for acid that is important (not too runny, not too viscous).\nSome of us eagerly await details of what JA will say at St.Louis. Let’s hope it receives more attention than his meticulous and detailed studies to date.\nNuff said. I’m thinking of doing a post dedicated entirely to JA (he being my kind of scientist).\n\n","date":"June 5, 2014 at 12:55 pm","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-127064","author":"colinsberry","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"Thanks for the link Colin! I should have known that when it comes to lemons in science — ask the limeys. ;)\n\n","date":"June 5, 2014 at 1:35 pm","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-127073","author":"David Goulet","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"Hi Hugh, I thought I would add the list of the 7 properties that make up the micro thin layer of sugars/starch fractions that Ray Rodgers wrote in his peer reviewed journal.\n1. Glucose\n2. Fucose\n3. Galactose\n4. Arabinose\n5. Xylose\n6. Rhamnose\n7. Gluceronic Acid\nCoincidentally these are all properties of myrrh resin. Myrrh is over 50% glucose and is made up of mostly sugars including all of the ones that are listed here & gluceronic acid.  Myrrh also contains acetic acid, that was also found on Shroud fibers.  For whatever it is worth it is of my opinion that this is the remnant of the myrrh resin used by Nicodemus that we are seeing.  The color is practically a dead on match to myrrh resin.  I wrapped a 3D Sculpture of Jesus in a pure linen fabric coated with myrrh resin for 3 days just to see what would happen to the cloth.  (it formed a extremely accurate 3D mold)  It was actually a bit shocked when I removed the linen from the sculpture.  Myrrh resin hardens, it ended up like a linen statue.  (the linen softens and flattens over time, I did this almost 3 years ago)\nAnyways not to get to far off track but it is of my belief that Nicodemus purchased the excessive myrrh resin to treat the scourge wounds of Jesus, thinking he would be scourged and released.  Not thinking or purchasing it to be used for burial. But it ended up being used that way.\nPrisoners are not normally scourged and crucified, Nicodemus did not foresee the later happening. (my  theory/speculation)   Myrrh resin also has chemical properties similar to that of cellulose acetate which was used to coat early film plates.   It is of my opinion only, that this is the reason why the cloth and the blood stains have been preserved as well as it has, considering the age of the Shroud. (preserved in myrrh) Also I believe the elevated levels of bilirubin in the blood are a contributing factor for why the blood retains the red color.\nThe scripture account and forensic evidence match up in this case.\nAnd there came also Nicodemus who 1st came to Jesus by night and brought a mixture of myrrh and aloes about a 100 lb weight, then they took the body of Jesus and wound it in the linen cloth with the spices.\nSide note:Myrrh resin does not taste very good although it can be ingested(It’s bitter tasting)\n\n","date":"June 5, 2014 at 1:55 pm","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-127076","author":"Dave Hines","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"But wouldn’t the resin only leave a mark where it made contact? And what about the hair?\n\n","date":"June 5, 2014 at 2:22 pm","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-127087","author":"David Goulet","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"Sorry to put another dampener in, but such scientific study of the Sudarium of Oviedo as there is is far too vague and irregular to be definitive, which is why I tend to shy away from discussion involving it. Mark Guscin’s very informative article at https://www.shroud.com/guscin.htm, and the BSTS article at http://www.shroud.com/pdfs/n65part6.pdf are the best I can find, but they are poor at chapter and verse.\nSuch definitive results as were discovered included that the Sudarium dates to 700AD. Except, of course, that it could be contaminated with oil. Do we have to go through all this again? How much oil would be needed to contaminate it, and why did the carbon-dating laboratory firstly not notice it and then say they were unable to remove it? Everybody else can, with fairly simple procedures. Perhaps there was a Soviet spy at work here as well. And what sort of oil? And when. Say modern, say olive, say 15%. That’s a lot of contamination. If from petroleum, of course, it would make the date much older than its real date, not younger.\nThen we hear that Max Frei had identified pollen. Again? Really? Is his report available? Is, it, like his Shroud report, so specific as to species as to call his entire oeuvre into question? I read, repeated on the internet 60 times, that pollen from “Quercus caliprimus” was found on the Sudarium, a tree that only grows in Israel. Only there’s no such plant. It’s Quercus calliprinos (the Palestine oak), and it grows from Northern Algeria to Turkey and beyond. It is so closely related to Quercus coccifera that I have no doubt its pollen is indistinguishable from it. Quercus coccifera grows commonly in Spain. At the Second International Conference, María José Iriarte, of impaccable paleobotanical credentials, said that no geographical evidence could be derived from the pollen.\nAnd so it goes.\n\n","date":"June 5, 2014 at 1:58 pm","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-127077","author":"Hugh Farey","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"Good Afternoon Hugh:  Did you see my myrrh resin theory I posted?    I forgot to add myrrh was also used in war to cover battle wounds, used as an antiseptic  (the Man In The Shroud had over 120 wounds to treat) It was also used in purification rites,  It supports my theory.\nThere are different grades of myrrh.  One was called Kataf, from Arabia used in ancient time, a fine grade, that is almost a clear color.  It was also called “Stacte Myrrh)  This is what I believe Nicodemus used on Jesus.   (And he was buried with the rich at death)\nI am actually in the process of leaving the US right now.  I have to be at the airport pretty soon.  We’ll have to pick off where we left some other time.  In the meantime may the spirit of good fortune, good health and good cheer be with you.  PEACE\n\n","date":"June 5, 2014 at 2:39 pm","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-127092","author":"Dave Hines","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"Hi David. I did indeed, and have carried out some experiments with myrrh myself. It fluoresces under UV light rather well, which could account for the background fluorescence of the shroud. It seems to come in two kinds, as an oil or as a solid extract, and if I were pursuing Rogers’s hypothesis I think I would use the solid extract mixed with water, which could conceivably evaporate according to his evaporation gradient hypothesis. It must be pointed out, however, that the list of carbohydrates you give is typical of most plants, and does not indicate myrrh any more than cornflour or saponaria.\n\n","date":"June 6, 2014 at 2:37 am","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-127218","author":"Hugh Farey","site":"shroudstory"},{"title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins","post":"So we have to wait until October before knowing Dr. Accetta’s theory? I hope some hints are dropped before then.\n\n","date":"June 5, 2014 at 7:06 pm","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","id":"comment-127142","author":"Chesterbelloc","site":"shroudstory"}]
