[{"id":"comment-56871","author":"rosalie_giansante","post":"Hello, Dan: I too hope to visit Torino during the exposition. It will be the first time for me and I’m really looking forward to it.. I have written a trilogy about the Shroud of Turin (not published yet, but hoping) and because of all the research I’ve done, am so anxious to see the burial cloth of our Savior. I believe it’s the first fictional trilogy where the people actually living at the various times intermingle with my characters..","date":"2013-12-05","mins":"9:40 pm","url":"https://shroudstory.com/2013/12/05/every-time-of-its-exposition-since-1978/","cat":"2015","title":"Every Time of its Exposition Since 1978"},{"id":"comment-3212","author":"rosalie_giansante","post":"I was impressed by the History International showing of the Real Face of Jesus with Ray Downing’s fantastic work. In opposition to Denise Robinson’s comment, I don’t remember ever seeing anything in the Scriptures about what Jesus looked like. He was loving and king to people in need, he became angry with the money changers in the Temple, He exorcised demons who inhabited bodies of victims, He knew hunger and thirst, and all of these features showed up on Ray Downing’s rendition of Jesus’ face in three dimension. For years I’ve had a picture of Jesus of the Shroud and when you viewed the picture from a different angle, it changed into the artist’s idea of what Jesus of Nazareth looked like. Ray Downing’s 3 D image is what I would thing Jesus looked like. Do I believe it is the shroud of Jesus? Absolutely. Those who believe need no further evidence, and those who do not believe would hold this stance regardless of the amount of evidence to the contrary. That’s why they call it FAITH..","date":"2011-06-01","mins":"11:58 pm","url":"https://shroudstory.com/2010/09/30/ray-downing-of-the-real-face-of-jesus-tv-documentary-received-an-emmy-for-stealing-lincolns-body/","cat":"news_&_views","title":"Ray Downing of “The Real Face of Jesus?” TV Documentary received an Emmy for “Stealing Lincoln’s Body”"}]
