[{"id":"comment-16495","author":"helmut_felzmann","post":"To anoxie: the area below is indeed very dark and different than the rest of the body image. This can be due to breathing. Scourge marks: I believe that most is part of the image only a part is blood. This is the image formation theory has also to explain this. If the image substance allocation has followed the temperature allocation this can be explained: wounds have a higher temperature than the surrounding skin..","date":"2012-09-19","mins":"3:31 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","title":"Latest on David Rolfe’s Site on Maillard Reaction"},{"id":"comment-16496","author":"helmut_felzmann","post":"To anoxie: the area below the nose is indeed very dark and different than the rest of the body image. This can be due to breathing. Scourge marks: I believe that most is part of the image only a part is blood. This is the image formation theory has also to explain this. If the image substance allocation has followed the temperature allocation this can be explained: wounds have a higher temperature than the surrounding skin..","date":"2012-09-19","mins":"3:35 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","title":"Latest on David Rolfe’s Site on Maillard Reaction"},{"id":"comment-16474","author":"helmut_felzmann","post":"In 2004 I had a long email discussion with Ray Rogers a long time ago. He agreed that diffusion processes and gas concentration differences alone could not effect the resolution of the image that we see. Something else had to be involved. We agreed that indeed we see an allocation of an image substance (“double bound saccharides”) and that as an approximation it can be said that the closer the cloth was located to the body at one spot the more image substance had been formed. The final allocation of the image substance gives the impression of an image. He had the opinion that the image formation process was a chemical process that took place at room temperature and took a while and that primarily gas concentation differences (amines) were responsible for this allocation. But he agreed that concentration differences could not effect the resolution and also not explain the image on the back side, where there was hardly any space between body and cloth and therefore no big possibility for gas concentration differences. There is also a problem to explain the dark area below the nose and the scourge marks. He agreed that temperature differences may have played a role, as temperature has an effect on the process speed of the chemical process. But then I had the impression that he was not willing to continue the discussion. If a natural process is supposed, temperature differences on the cloth can only come from a warm body: the closer the cloth was to a warm body, the higher was the temperature at that spot, the faster was the process speed and the more image substance has been formed – which is in agreement with what we see. The allocation of the image substance would then not be due to gas concentration differences but to temperature differences on the surface of the shroud. If a cooling down corpse is supposed there would be indeed such an effect. BUT: in the trunk of a corpse there is much more energy bound than in the extremities. Therefore the extremities would cool down fast and hardly any image should be visible there. But this is NOT what we see. The image is rather similar along the whole body, which speaks for a rather equal body temperature throughout the body during the whole duration of the process (about 36 hours). But this can only be possible if blood circulation and a beating heart was still there. Therefore I think that if somebody considers a chemical process (like the Maillard reaction as proposed by Rogers) he might finally come up with the hypothesis of a living body. This may also explain the uniqueness of the image. As far as I know there is only one similar (not equal!) image known, the so called “Liverpool image”, found on the mattress of a just died person in a hospice, which was formed by a warm (living) body. Corpses can not produce such an image, therefore the image on the shroud is unique, pointing to a unique event (my opinion)..","date":"2012-09-18","mins":"3:25 pm","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","title":"Latest on David Rolfe’s Site on Maillard Reaction"}]
