[{"title":"Colin Berry’s Christmas Present","post":"Ah the false charge to pseudo-science again. It soothes them so, doesn’t it? And again, the red herring of the scorch hypothesis. Keep trying to squeeze blood out of that stone, one day you shall tire.\nHe’s got it worse than the guys with the excimer lasers.\n\n","date":"December 19, 2012 at 10:38 am","url":"https://shroudstory.com/2012/12/19/colin-berrys-christmas-present/","cat":"uncategorized","id":"comment-20712","author":"Chris","site":"shroudstory"},{"title":"Colin Berry’s Christmas Present","post":"Tire? Me? Never…\nAnd I’m not wedded to the scorch theory. It’s just that the image does look so very like a scorch…\nAnyway, just to show proper scientific balance, today I acquired some myrhh (too expensive) and some urea (very cheap). Myrhh, it turns out, without any treatment at all… IS FLUORESCENT! Not strongly, it’s true, but it has certainly put a new cat among my pigeons.\n\n","date":"December 19, 2012 at 12:33 pm","url":"https://shroudstory.com/2012/12/19/colin-berrys-christmas-present/","cat":"uncategorized","id":"comment-20724","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry’s Christmas Present","post":"Here’s wishing Dan and all his readers a Merry Christmas and a Happy New Year – full of insight and enlightenment. Clue to the second: don’t believe everything you read, no matter how seemingly impeccable the credentials. In the world of knowledge, misinformation lurks round every corner… Trust YOUR instincts – they are far more reliable than others’ eloquence…\n\n","date":"December 19, 2012 at 1:26 pm","url":"https://shroudstory.com/2012/12/19/colin-berrys-christmas-present/","cat":"uncategorized","id":"comment-20726","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry’s Christmas Present","post":"I don’t believe it’s a scorch either, but I’d have to agree with Hugh, that superficially it looks like a scorch.  There are several problems with Colin’s scorch theory: (a) I can’t see that the TS can be a forgery – there’s too much evidence against it, particularly the forensics; (b) I can’t buy the construction of a conforming template – it’s against all artiistic conventions and the template would be more imposing than the mere image (c) the lack of superficiality of images produced by a scorch.  As Colin would have it, I’m trusting my instincts here. \nHowever the history of Science is full of examples of serendipitous discoveries;  We pursue one single idea which doesn’t work no matter how hard we try, and then out from the sky drops something new and unexpected, an accidental result that we hadn’t expected, or suddenly a new idea which changes our perspective entirely, and another insight is gained.  The discussion on fluorescence might hint at some such possibility.  \nI wish Colin well in his kitchen science endeavours. Who knows where they may lead! I don’t believe he’ll be successful in the way that he expects, but yet who knows what unexpected result he may obtain.  But he’ll have to be open-minded enough to be able to recognise it when the unexpected does occur!  It may yet shed further light on some elemental fact on how the image was actually imprinted – Or possibly not as the case may be!\n\n","date":"December 19, 2012 at 3:14 pm","url":"https://shroudstory.com/2012/12/19/colin-berrys-christmas-present/","cat":"uncategorized","id":"comment-20733","author":"daveb of wellington nz","site":"shroudstory"}]
