[{"title":"End-of-year brain-teaser for Shroudies: I challenge you to explain this apparent contradiction…","post":"Yup, a linen fibre is a chain, Adrie, a chain of separate adhering cells, and a chain we know is only as strong as its weakest link. So it hardly makes sense for miraculists to bang on about the (conventional) science-defying superficiality of the Shroud image, while turning a blind eye to “minor” effects elsewhere – like weakening and fracture at the nodes.\n Some might say that the authenticists  have developed a handy tunnel vision for the  strongest  (internodal) part of the linen fibre, while displaying  a convenient blind spot for the weakest. I  have no time (and if the truth be told)  a degree of contempt  for “trophy findings” that merely serve a religious agenda. Religion should be able to look after itself – without the need for agenda-driven ‘pseudoscience’….\n","date":"December 31, 2012 at 5:02 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/29/end-of-year-brain-teaser-for-shroudies-i-challenge-you-to-explain-this-apparent-contradiction/","cat":"brain-teaser","id":"comment-1608","author":"colinsberry","site":"colinberry"},{"title":"End-of-year brain-teaser for Shroudies: I challenge you to explain this apparent contradiction…","post":"Incidentally, I was preparing this consideration, about cellulose having  been affected in image fibers without having being colored, and about the increased brittleness of the nodes in image fibers:\nIn an e-mail (cited by Carreira, p. 30) Rogers wrote: “I studied the chemical kinetics of the impurity materials and concluded that it was improbable that the impurities had been scorched by heat or any radiation source: the crystal structure of the flax image fibers was no more defective than non-image fibers.” This is incorrect reasoning: as you have often said, Colin, “impuritiy materials” (starch, hemicellulose, lignin) may have been scorched at a temperature at which cellulose is not scorched yet (doesn’t lose hydrogen and make cross links yet). At that temperature the cellulose may have only recrystallised: heat/warmth makes water escape from the cellulose and makes dislocations/defects in the crystal structure move to the edges of the crystal. Thus, the bulk of the crystal becomes more perfect and less brittle (this is called annealing in metallurgy). But the edges of the cellulose crystal, where the crystal is connected to its surroundings and where the dislocations concentrate, would become more brittle. This would be not only at the surrounding non-crystalline regions and at the (scorched) linen of the cylindrical primary cell wall, but also at the cell joints/‘growth nodes’, I think.\nAlso loss of water may have rendered the image fiber more brittle and make it break more easily, as linen “is a very durable, strong fabric, and one of the few that are stronger wet than dry” (Wikipedia). It seems possible/likely that a sealing coating of retrograded starch (end of this comment) still more or less protects the non-image fibers from drying/aging. Antonacci noted “the soft, pliable and excellent condition of the Shroud (a condition confirmed by STURP)” in his Reply to Rogers, p. 3. On image fibers, which look more corroded than non-image fibers (Adler), this sealing would have been disturbed/crackled by the image formation process, allowing water to escape faster from the linen, either immediately through heat that not scorched the celluse (at a glass transition temperature, well below 300C) or while aging after image formation.\nI’m very curious what you will discover with the microscope. Congratulations on the purchase. Have fun!\n","date":"December 31, 2012 at 4:37 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/29/end-of-year-brain-teaser-for-shroudies-i-challenge-you-to-explain-this-apparent-contradiction/","cat":"brain-teaser","id":"comment-1607","author":"Adrie","site":"colinberry"},{"title":"End-of-year brain-teaser for Shroudies: I challenge you to explain this apparent contradiction…","post":"Well spotted, Adrie, since I had tacked that reference to your splendid paper onto the end as an afterthought (having discovered your focus on growth nodes, aka dislocations,  through googling).\nI shall be taking my new microscope out of its box today and start to explore its capabilities re testing the scorch hypothesis. I shall be focusing (literally!) on the nodes, given the possibility that they may carry a distinctive signature for scorch damage, more so than the internodal region. Nodes may be where “most of the action” is, perhaps because they are the sites of cell-cell junctions, with  less in the way of crystalline, fracture-resistant cellulose, and maybe more cementing hemicelluloses, pectins(?) and – most of all-  the enigmatic lignin – all of which are more thermally-sensitive and prone to damage.\nWe are told the Shroud image is incredibly superficial, but that does not (in  my view) mean that the energy that produced it is highly superficial in its effects  everywhere on something that is not simply a continuous uninterrupted filament. Cotton seed hairs have no junctions – i.e nodes –  being elongated single cells – but that is not so for linen, making the latter a far more complex entity where potential scorch damage is concerned.\n","date":"December 31, 2012 at 2:43 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/29/end-of-year-brain-teaser-for-shroudies-i-challenge-you-to-explain-this-apparent-contradiction/","cat":"brain-teaser","id":"comment-1606","author":"colinsberry","site":"colinberry"},{"title":"End-of-year brain-teaser for Shroudies: I challenge you to explain this apparent contradiction…","post":"Thanks Colin. I found the 200 nm +/- 200 nm range here.\n","date":"December 31, 2012 at 1:55 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/29/end-of-year-brain-teaser-for-shroudies-i-challenge-you-to-explain-this-apparent-contradiction/","cat":"brain-teaser","id":"comment-1605","author":"Adrie","site":"colinberry"}]
