[{"title":"Colin Berry’s Credentials","post":"Well if anyone ever theorizes that the Shroud was made from crushed corn flakes,I’ll know who to call to debunk that.\nGiven that I’ve previously posted that my own science background stems primarily from watching Bill Nye the Science Guy (Bill…Bill…Bill) I hope the chirp above will not be misconstrued as a serious slight. :)\n\n","date":"November 9, 2013 at 8:55 pm","url":"https://shroudstory.com/2013/11/09/colin-berrys-credentials/","cat":"other_blogs","id":"comment-50594","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry’s Credentials","post":"Ah yes- cornflakes. They and their variable resistant starch (RS) content (depending on how they are made – traditional or extrusion) were a subject that caught the eye of one John Emsley,  a well known science writer in the UK. . Back in the 80s he wrote on article on my resistant starch discoveries for the Independent newspaper (now in dire financial straits) entitled “The Hidden Good in White Bread”. While  is not searchable under the paper’s name, but hey presto I’ve just discovered that the article is now being used as an English comprehension exercise! See page 2 of the pdf:\nhttp://www.ss.sugiyama-u.ac.jp/waku/SkimmingPredicting.pdf\nIt’s amazing what one can dig up from the past simply by pressing  a few laptop keys.\nScience bit:  Brace yourselves.  I found a high level of RS  in standard Kelloggs cornflakes (with a useful dietary fibre like action and possible anti-cancer properties in the colon mediated via anaerobic fermentation to short chain fatty acid).\nBut when I looked at cornflakes produced by more modern extrusion technology there was scarcely any there. Everyone in the place I worked had their own ideas as to the reason, with some getting quite annoyed that their pet hypotheses were not instantly recognized as the Truth, the Whole Truth etc (ring any bells?) but through patient experimentation (the mainstay of science) the answer turned out to be quite banal. To form RS you need first to gelatinise starch and then to let it quickly recrystallize to form short-chain linear alpha-glucan (“mini-straight chain starch”).. The latter process needs plenty of water, which is provided for in the traditional cooking process, but not in the typical extruder that runs on a rather dry  mixture.\nYup, the humble cornflake (made traditionally) has useful amounts of dietary fibre as RS, but not allowed back then in labelling declarations. I had terrible probably career-damaging battles with the civil servants  (who funded most of our nutrition research!) and with certain analysts to get them to change their minds on that. It all got rather complicated, especially when the EU got involved, and began organizing inter-laboratory collaborative trials to compare my RS methodology with that of the fibre purists. EURESTA was born, probably googlable, with or without my surname, that being the European Resistant Starch something or other.\n\n","date":"November 9, 2013 at 9:32 pm","url":"https://shroudstory.com/2013/11/09/colin-berrys-credentials/","cat":"other_blogs","id":"comment-50595","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry’s Credentials","post":"PS: Have just discovered that I won – but it’s taken over 20 years to get that ruling in my favour.\nhttp://nutritionprogram.wordpress.com/2012/05/07/fibre-nsp-or-aoac/\nAny dietary fibre measurement based on the “purist” NSP method now has to be multiplied by a temporary fudge factor of 1.33 to take account of RS (and lignin). This messy state of affairs is to continue until problems are sorted out with AOAC methodology that attempts to measure all 3 components (NSP +RS + lignin together).\nThank you for mentioning cornflakes, David, Through discovering that up-to-date link just now you have finally allowed me to draw a line under a frustrating period of my research career, one that involved quite a bit of name-calling and charges of being an industry stooge – to which I replied – then as now-  ALL THAT BOTHERS ME IS GETTING THE SCIENCE RIGHT.\n\n","date":"November 9, 2013 at 10:17 pm","url":"https://shroudstory.com/2013/11/09/colin-berrys-credentials/","cat":"other_blogs","id":"comment-50596","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry’s Credentials","post":"Good thing I didn’t go with rice crispies, as I’d originally planned. It might have led to a much longer ‘scorch’ dissertation.\nBut seriously, glad my stab at levity dominoed to some closure for you. Goes to show that you don’t need a phD to be useful sometimes.\n\n","date":"November 9, 2013 at 10:57 pm","url":"https://shroudstory.com/2013/11/09/colin-berrys-credentials/","cat":"other_blogs","id":"comment-50598","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry’s Credentials","post":"I’ve been out of circulation the last few days, but the antibiotics and steroids are now starting to kick in, and I’m hopeful of slipping back into recovery mode.  As a frequent user of food, and living in a country whose food production is a mainstay of its economy, I was fascinated with some of Colin’s research projects. My maternal side has been afflicted with gall bladder problems, and my dad had a serious case of diverticulitis, both ailments featuring in Colin’s CV. \nBut what really attracted my attention is that Colin is one of the few research scientists I’ve come across who would seem to have had liberal hands-on experience with lab-rats.  I’m just a little disappointed that he hasn’t extended that to some real pioneering Shroud research. He could put Ray Roger’s theories to a genuine crucible test, wrapping up traumatised dead rats in all sorts of linen cloths treated in a variety of ways, holding them under various conditions of temperature, humidity and exposure to light.  He could then say, “Look, I’ve tried it, it doesn’t work, Rogers was wrong!” “Or not, …” (as the case might be). One ought not to presume the outcome of an untried experiment, simply because of one’s preferred position or opinion in such matters. Giovanna De Liso experimented for some 12 years in Piedmont, examining seismic effects on Shroud-like images, but only used a dead snake and a metallic object.  Rats are at least mammalian!\n\n","date":"November 10, 2013 at 4:38 am","url":"https://shroudstory.com/2013/11/09/colin-berrys-credentials/","cat":"other_blogs","id":"comment-50609","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Colin Berry’s Credentials","post":"Oh dear. Those rats. I still have a guilty conscience regarding the use of rats, even for that lifespan trial. All they had to do was eat the experimental diets with different levels of fibre, but it was a kind of cruelty, even though they were well-looked after by skilled and gentle technicians. I wish there could have been an alternative, but the alleged protective effects of dietary fibre are long term, so it took a lifespan trial to show that fibre does indeed protect against colonic diverticulosis.\nIt required 1800 rats and was hugely expensive, paid for by the Ministry and ultimately the taxpayer. Butit provided hard evidence that favoured the fibre hypothesis, at a time when the latter was seen as threat by the bakers and millers who also financed my place of work, so I’m battle-hardened so to speak when it comes to operating in a political climate . All one can do is argue the science and play for time. The millers and bakers did finally see sense on fibre when they found they could make more selling by wholemeal bread at a premium rather than white bread, provided they were allowed to use their preferred “improving agent”. But since that was ascorbic acid (Vitamin C) instead of the now banned bromate, they got the green light from me , as the industry’s nutrition/food safety advisor, from MAFF,  from pretty well everyone, so the story finally had a happy ending.\nI’m still trying to think what to say re Raymond Rogers and his ideas that won’t cause more offence than already inflicted. But here’s a bit of advice. Put his name as R.N.Rogers into Google Scholar, and regard it as a de-mythologizing exercise. One has to maintain some perspective where science and scientists are concerned, and look for the hard evidence, ignoring the hype. I would urge “anonymous” to do that exercise before continuing to describe Rogers as an expert in this or that. Rogers was a thermochemist, with chemical explosives as his specialty, who pioneered differential scanning calorimetry (which I and colleagues also used to investigate starch crystallinity).\n\n","date":"November 10, 2013 at 5:17 am","url":"https://shroudstory.com/2013/11/09/colin-berrys-credentials/","cat":"other_blogs","id":"comment-50611","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry’s Credentials","post":"I’m now making more and more use of Google Scholar to check up the scientific credentials of Shroudie celebs, having piloted the software on a relative nonentity (me).\nhttp://scholar.google.co.uk/\nHere’s a shortcut way of cutting to the chase. First enter the initials and name into the box, e.g  J.O.Bloggs.\n If you know a word or two that is associated with their life work, like “widgets”, then enter that too. Once you’ve located your (wo)man look first at the number of citations in blue under each entry, and then the number of entries, to get a quick idea of the impact they have had on the literature. Keep scrolling down until the citations get down to single digits.\nBut don’t stop there, Take their most cited paper, click on the blue number for citations, bringing up the list. Then click on the year filters in the left hand margin. “2013” will show if the paper is still being currently cited. Then try 2012, 2009 etc.You’ll soon be able to tell whether their work is the kind of landmark stuff that goes on being cited long after publication. \nBeware early short-lived citations: it may be that their peers piled in to dismiss their work, though I’m pleased to say that applies to no one associated with STURP , even if their pre-Shroud contributions to science are occasionally over-hyped (it’s relatively few scientists who get noticed,  far less revered, unless they have been awarded a Nobel prize, or been targeted by the media for premature publication or worse).\nBeware of listings for people with the same surname and initials. If it’s a J.O.Bloggs who published in 1901, you can be sure it’s someone else. If the subject matter looks different from your man, then call up the paper, check other links, and see if there are cross-references or not. Keeping any eye open for full names, middle initials etc  can also help to avoid mistaken identity.\n\n","date":"November 10, 2013 at 12:50 pm","url":"https://shroudstory.com/2013/11/09/colin-berrys-credentials/","cat":"other_blogs","id":"comment-50642","author":"colinsberry","site":"shroudstory"}]
