[{"title":"Colin Berry’s Method and 3D Information","post":"There’s much food for thought where contact imprinting models are concerned, given the wealth of experimental options open to the researcher. My own thinking is changing by the hour, as one tries to understand why a wet imprint should result in reasonable 3D properties (demonstrated yesterday btw with a plastic toy). \nThe thing one has to beware of are preconceptions, especially pro-authenticity ones. Medieval forgery opens up a much wider range of options that would have been judged entirely by the artefact maker purely on the “look” of the end-result. What was the intended look? I’ve made my position clear on that for well over a year: it was to create a Veronica-like imprint on fabric in sweat and blood (marking on my part an abandonment of the contact scorch theory that was tied to an attempt to symbolize slow-roasting of Geoffroi de Charny’s alleged uncle alongside Jacques de Molay in 1314).\nThe artisans were not time-lords, worrying about the final look of their work on 20th/21st century 3D rendering programs. They were concerned about the instant impression created on the relic-hungry pilgrim. that’s why the dual image head-to-head configuration, life size, real linen was chosen  in order to yell “real body imprint, a bigger and better version of that Veronica in Rome”.\nSo what techniques did they deploy to best achieve their ends that just happen, purely by accident,  to give the 3D result we see today? I have some fresh ideas to offer on that, which I’ll mull over for a while before returning here, possibly this morning but probably the evening (am heading off shortly to a family reunion so will be hors de combat  for quite some time.\nHere’s a taster: imprint the face either from a bas-relief as per Luigi Garlaschelli OR imprint in LUWU configuration (face down into linen) separately from the rest of the body (LOTTO) to get not only a pseudo-bas relief effect, but gravity-aided flow of imprinting medium to the extremities (nose etc) giving extra image intensity where it’s most needed to convey the impression of  an IMPRINT, not a artist’s sketch. Separate imprinting of head and body could also explain some anomalies, like the head seeming slightly too small for body (LOTTO gives more lateral distortion than LUWU), as well as that prominent crease at the neck/chin etc etc. Manual touching-up of image will also be flagged up (there’s time an opportunity to do that while the blood drips and trails are applied immediately after imprinting medium, followed by conjoint printing that places blood under body image).\n\n","date":"May 10, 2015 at 2:40 am","url":"https://shroudstory.com/2015/05/10/colin-berrys-method-and-3d-information/","cat":"other_blogs","id":"comment-198750","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry’s Method and 3D Information","post":"Indigo has a very strong affinity for wool, silk, cotton, and linen…\nI have read that:\n>Indigo-blue is converted by oxidizers, e. g., nitric acid, into yellow-red,\ncrystallizable isatin (C16H10N2O4) …\nSo…\nHave you tried to do the interesting experiments using\n“linen dyed with indigo” treated with nitric acid?\nI am curious to see what happens.\nBut I have found only few links…\n— — —\nUnder another address I have read:\n>… Indigo plus nitric or chromic acid apparently produces isatin plus anthranilic acid,\nplus a bunch of other degradation and condensation products.\n>This is probably why isatin has not been commercially produced\nfrom indigo anytime in the twentieth century, because other\nsyntheses are much more practical. … …\nLink:\nhttp://www.sciencemadness.org/talk/viewthread.php?tid=2653&page=2\nHere another vague reference:\n>Isatin (1H-indole-2,3-dione, Figure 1) was first obtained by\nErdman and Laurent in 1841 as a product from the oxidation\nof indigo by nitric and chromic acids. …\n>… In nature, isatin is found in plants of the genus Isatis … etc. …\nLink:\nhttp://www.scielo.br/scielo.php?script=sci_arttext&pid=S0103-50532001000300002\n>Isatin\nC 8 H 5 NO 2, in chemistry, a derivative of indol, interesting on account of its relation to indigo; it may be regarded as the anhydride of ortho-aminobenzoylformic or isatinic acid. It crystallizes in orange red prisms which melt at 200-201Â° C. It may be prepared by oxidizing indigo with nitric or chromic acid (0. L. Erdmann, Jour. peak. Chem., 1841, 24, p. II); by boiling ortho-nitrophenylpropiolic acid with alkalis (A. Baeyer, Ber., 1880, 13, p. 2259), or … … \nLink:\nhttp://www.theodora.com/encyclopedia/i/isatin.html\n\n","date":"May 10, 2015 at 8:09 am","url":"https://shroudstory.com/2015/05/10/colin-berrys-method-and-3d-information/","cat":"other_blogs","id":"comment-198773","author":"piero","site":"shroudstory"},{"title":"Colin Berry’s Method and 3D Information","post":"Pro-inauthenticity preconceptions are as bad as proauthenticity preconceptions.\n\n","date":"May 13, 2015 at 5:57 pm","url":"https://shroudstory.com/2015/05/10/colin-berrys-method-and-3d-information/","cat":"other_blogs","id":"comment-199054","author":"Andy","site":"shroudstory"},{"title":"Colin Berry’s Method and 3D Information","post":"“Pro-inauthenticity preconceptions are as bad as proauthenticity preconceptions.”\nOne begs to differ.  A preconception is simply one kind of assumption, possibly one that the owner is initially unaware of being an assumption. But assumptions, whether they are preconceptions or not, are the lifeblood of science. Without making assumptions, tacit or otherwise, there would be no hypothesizing or model building. Without model building there would be no new research directions, no new data, no opportunity for refining existing models, or as occasionally happens, going back to the drawing board, and maybe rooting out one’s own or others’ assumptions and indeed preconceptions.\nThe scientific method may not lead immediately to the right answers, but it’s a sure fire way of gradually and systematically dumping wrong answers,based on faulty assumptions, or indeed preconceptions.\nContrast that with the preconception that says the ‘enigmatic’ TS features like image superficiality, 3D properties could never have been created as a result of forgery. Where does one go from there? Where are the testable hypotheses? Even the non-supernatural ones like Rogers’ putrefaction-amine/semi-degraded starch- assisted ones have defied experimental modelling due to the host of qualifying assumptions that collectively add up to a non-testable preconception (“it all took place in a tomb”). As for the supernatural ones that invoke special kinds of radiation (self-emitting, self-collimating, super air-attenuated etc etc) and then claiming that entirely man-made lasers offer a ‘possible glimpse of mechanism’ – here you see the kind of preconceptions that have no place in science, least of all Government-funded science laboratories. ENEA management please note.\n\n","date":"May 14, 2015 at 12:22 am","url":"https://shroudstory.com/2015/05/10/colin-berrys-method-and-3d-information/","cat":"other_blogs","id":"comment-199069","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry’s Method and 3D Information","post":"I think Andy was replying to Colin’s “The thing one has to beware of are preconceptions, especially pro-authenticity ones.” However, being aware of preconceptions, which Colin also identifies with “the lifeblood of science” is not the same as avoiding them altogether. As an understanding of anything builds up, one is inevitably inclined to one opinion or another, and tends to approach a new idea with that inclination. The important thing is not to fossilise an inclination based on partial evidence into such a firm conviction that no subsequent evidence can be looked at on its own merits. If you are convinced the Shroud is genuine, then no attempt to demonstrate a medieval method of manufacture can be looked at on its own merits, and if you don’t, then no natural process in a tomb can be taken seriously. Recognising the possibility that one may be wrong is crucial, and any paper or article from either side which includes phrases such as “the only way” or “it must have been” indicate unwarranted certainty. It is worth looking at the published scientific papers to see how all the authors scrupulously avoid committing themselves to “the only way” or “proof,” and then at the comments on this blog and elsewhere convinced of absolute certainty.\nA perfect paragon of a scientific conclusion is in Riani and Atkinson’s statistical paper:\n“Our results indicate that, for whatever reasons, the structure of the TS is more complicated than that of the three fabrics with which it was compared.” Brilliant.\n\n","date":"May 14, 2015 at 1:56 am","url":"https://shroudstory.com/2015/05/10/colin-berrys-method-and-3d-information/","cat":"other_blogs","id":"comment-199073","author":"Hugh Farey","site":"shroudstory"}]
