[{"title":"Dan Porter and his 2002 Long Bet,10 years on. Was he right? I say NO.Time has proved him spectacularly WRONG…","post":"Hello again Matthias\nThat’s quite a number of points you raise. I’ll make a start now, taking breaks to check on sources, and use the Edit facility to keep my answers within this one reply.\nFirst, re the “braided hair”. I think it is a matter of individual interpretation as to whether there is a representation of long braided hair in the dorsal view. Yes, I know Bucklin described it thus, but it’s always been a mystery how someone accustomed to viewing cadavers on mortuary slabs could be quite so categorical in what he saw, or thought he saw, on the faint Shroud image.\nA couple of key points: firstly, there is nothing to differentiate hair from body image in the frontal view. The so-called hair shows no strands etc. Given that the Shroud image is not a painting, and that no one is absolutely certain how the image was formed, we have to be very careful to distinguish between a “representation” of hair and real hair.\nSecondly, I have looked at the head in dorsal view very carefully with Shroud Scope, and am far from convinced that the “braid” is even a representation of hair. Its colour under my optimised contrast/brightness settings is different from the rest of the head “hair”, being more grey, less yellowish-brown.  It looks more like the imprint of a spine (cervical region) than hair if you ask me.\nI have done a screen grab of my Scope picture, and can attach it to one of my Shroud Scope series if you wish and provide a link. I say that the evidence for a braid of hair seems somewhat impressionistic to say the least.\nRe you second point: suppose the Man in the Shroud was intended initially to serve as an ambiguous tribute to Jacques de Molay. He was after all a major personage – last of the Templar Grand Masters –  figurehead of an immensely wealthy chivalrous order at least until stripped of its wealth by Philp IV of France, aided and abetted by the Church’s charges of heresy. What kind of tribute is possible when the individual in question has been slow-roasted to death and then reduced to ashes? I think there is a clear rationale for producing a scorched-on image of de Molay on a  burial shroud, serving a a metaphor for his death by slow-barbecue, and perhaps deliberately incorporating hints of a Christ-like fate at the hands of tormentors, false witnesses etc. It may have been that same ambiguity that allowed the original Shroud to morph into that of Christ’s burial Shroud, with the LATER addition of blood in strategic locations to convey the idea of a death by crucifixion. I say the Lirey Pilgrim’s badge captured the Shroud in a period of transition –  from medieval Templar to New Testament-faithful holy relic….\nRe Templar ceremonies in the late 1200s, I have a complete open mind as to the existence of Shroud forerunners, proto-Shrouds if you like. I have read of Barbara Frale’s discoveries in the Vatican secret archives, e.g. \nhttp://templars.wordpress.com/2009/04/15/knights-templar-hid-the-shroud-of-turin-says-vatican/\nand I have seen the  Vatican’s questionable endorsement of her idea that the Templars venerated an allegedly-like Shroud like image. But Frale forfeited her credibility in my humble opinion with that ridiculous “complete burial certificate” of “Jesus of Nazareth” written on the very fabric of the Shroud – but too faint for anyone else to discern. But let’s not throw baby out with the bathwater: the  Shroud we see today may indeed be the product of a gradual evolution of the Shroud as a Holy Relic, one endowed with magical properties – the occupant de-materialising to leave just a scorch – introducing yet another layer of ambiguity re the scorch. Was it made by a living OR dead person… if living, a craftsman fashioning a grim memento, but if dead, a victim of execution who was miraculously resurrected…\n“Thoughts on your theories versus the existence of Greek epitaphios circa 1200 / 1300 AD with Jesus laid on a herringbone weave cloth, with body wide wounds generally consistent with those on the shroud?”\nFirst, let’s be clear about one thing. There are no images of wounds on the Shroud body image. There are plenty of (so-called?) scientists who will tell you there are wounds, and even ring them in red to show their supposed location, but I repeat, there are NO wounds, or should one say ‘unequivocal’ wounds. What are described as wounds are bloodstains. So we have all the hullabaloo about the wrist “wound” when in fact it is just a bloodstain on the wrist. Do any of your precursor Shrouds show a wrist wound? Or do they show a reversed 3 on the forehead?  I doubt it. “Being consistent” is simply not  good enough as definitive tests go – there should be replication of those crucial hallmark features.  Anything else is just wishful thinking…\nAs for the herringbone weave, I would imagine that medieval artists seized upon it with glee, even if as I suspect it was of medieval invention and thus anachronistic in portrayals of the Biblical tomb scene. Why? Because it allowed artists to clearly differentiate for the viewer’s benefit the linen of the Shroud from other plain or patterned surfaces. \nIn short, the herringbone weave became an artistic device or convention to flag up that there was a very important burial Shroud in the picture – but whether it was Christ’s or of someone else has to be a matter of conjecture, especially as regards the Lirey Pilgrim’s badge with it highly ornate representation of the herringbone weave.\n“Was not the Lirey public display done in the context of the shroud being the Shroud of Jesus?”  Maybe, maybe not. it could have been made deliberately ambiguous, along the lines of “Some say it’s a Templar knight who was crucified or barbecued or both (both in the case of Jacques de Molay), but some believe it to be the actual burial Shroud of Christ that was in the possession of the Templars and used to make a point. One thing’s for certain – the creator of Lirey Pilgrim’s badge did not go out of his way to convey an image of the crucified Christ, or even of the present Turin Shroud for that matter – no reversed 3, no visible wounds or blood on hand or feet, no scourge marks, no crown of thorns. Instead there is the peculiar chain-like feature across the waist, looking for all the world like the chain used to secure victims at the stake for burning. Yes, I know that Ian Wilson interprets it as blood from the spear wound, but why would it gush laterally in spirals from BOTH sides of the torso. \nThanks for you interest, and taking the trouble to comment.\n","date":"September 1, 2012 at 9:43 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/21/dan-porter-and-his-2002-long-bet10-years-on-was-he-right-i-say-no-time-has-proved-him-spectacularly-wrong/","cat":"criteria","id":"comment-573","author":"colinsberry","site":"colinberry"},{"title":"Dan Porter and his 2002 Long Bet,10 years on. Was he right? I say NO.Time has proved him spectacularly WRONG…","post":"Also Colin when will you be testing the fluorescence matter – I think this is critical. There must be skeptical scientists out there with the required equipment who would be more than happy to test this if asked????\nI don’t think you’ve fully failed Porter’s bet unless you can put this issue to bed\n","date":"August 30, 2012 at 11:20 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/21/dan-porter-and-his-2002-long-bet10-years-on-was-he-right-i-say-no-time-has-proved-him-spectacularly-wrong/","cat":"criteria","id":"comment-565","author":"Matthias","site":"colinberry"},{"title":"Dan Porter and his 2002 Long Bet,10 years on. Was he right? I say NO.Time has proved him spectacularly WRONG…","post":"Colin\nGood thoughts.\nBeing agnostic on the shroud, I keep an open mind either way.\nHowever, whilst you might be getting there in terms of the science, there are a number of historical oddities that are not so easily explained away:\n– If the Shroud is not indeed the Shroud that wrapped Jesus’s dead body, why would its creator create an image that did not protect Jesus’s modesty, when almost exclusively in the history of art Jesus is shown with at least a loin cloth, and certainly buttocks are not displayed?\n– Similarly, why would its creator have shown the would in one wrist (As opposed to two palms, which is the historical artistic norm?) Surely the creator, if he was wishing to profiteer from public display and / or sale of the creation, would have met the artistic norms / expectations of Jesus of the time and indeed through history?\n– How about the existence of epitaphios from Greece circa 1200 – 1300AD that show Jesus’s body, complete with body-wide wounds similar to those on the shroud, lying on a herringbone weave shroud (and the art of the time universally otherwise shows Jesus with only modest wounds in the palms, on the side of the torso)\nAlso, with regard to the science, do you have any plans to test your scorching theory on a full size statue? One could argue that theorising as you have done is one thing, but to reproduce the full body characteristics of the shroud convincingly is another. Also, how do you explain the flagrum marks etc.\nMatthias\n","date":"August 30, 2012 at 11:09 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/21/dan-porter-and-his-2002-long-bet10-years-on-was-he-right-i-say-no-time-has-proved-him-spectacularly-wrong/","cat":"criteria","id":"comment-564","author":"Matthias","site":"colinberry"},{"title":"Dan Porter and his 2002 Long Bet,10 years on. Was he right? I say NO.Time has proved him spectacularly WRONG…","post":"Hello Matthias\nLooking at the Lirey Pilgrim’s badge, I think it somewhat improbable that the body image on the Shroud, as displayed around 1355, was that of Christ. If you mentally subtract the bloodstains one sees on the present Shroud (there being no obvious blood on the Lirey man), then there is nothing to suggest it was that of a crucified man, and indeed I have previously developed others’ suggestions that it was a Knight Templar (Jacques de Molay? Geofffroi de Charney?), and a scorched-on image was initially intended as a tribute to Templar martyrs who were finally burned, or rather slow-roasted,  at the stake. De Molay was in fact crucified too as part of the long torture he endured for some 7 years, but survived, no doubt to be allowed to recover and face more torture.\nSo that’s why there is no loin cloth. In fact it’s said that the final roasting was done in as sadistic a manner as possible, so the naked figure on the Lirey badge may well be portrayed as attempting to protect his genitals.\nI suspect that the Lirey Shroud gradually morphed into the present one through additions, notably of bloodstains in all the biblically-relevant places. Remember- there are no wounds on the basal body image – contrary to  great deal of misinformation from some who should know better. Scourge marks are also simply bloodstains – with dumb-bell shaped markings etc – but no real evidence for  broken skin. The 1532 fire may have provided cover for some major tinkering – thus the scepticism that resulted in an enquiry by  3 bishops and 10 noblemen no less to rule on whether the post-fire Shroud was the original.\n I don’t intend to do any more modelling myself, being content to test feasibility in principle. Have you seen my latest post, in which I propose that the template for the original body image may have been a death mask, with similar castings for the limbs and torso.\nIt’s those who push the fluorescence argument (or rather lack of fluorescence) as\nevidence in favour of authenticity who need to do their homework. All they have to do is to produce a range of scorches at progressively higher temperatures. I predict that the low temperature scorches, comparable to the Shroud in terms of superficiality, will be non-fluorescent, whilst high temperature scorches, comparable to those produced in the 1532 fire, will fluoresce on account of benzenoid aromatic ring systems. I’ll have to leave it there, since I’m away from home, but hope this somewhat terse reply to your points will do for now.\n","date":"August 30, 2012 at 2:22 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/21/dan-porter-and-his-2002-long-bet10-years-on-was-he-right-i-say-no-time-has-proved-him-spectacularly-wrong/","cat":"criteria","id":"comment-566","author":"colinsberry","site":"colinberry"},{"title":"Dan Porter and his 2002 Long Bet,10 years on. Was he right? I say NO.Time has proved him spectacularly WRONG…","post":"Questions, Colin:\n– doesn’t the rear image of the shroud display braided hair characteristic of Jews of Jesus’s time?\n– scorching the image on to a cloth seems a somewhat odd tribute to martyrs. I’m not saying its impossible, as odd things have happened over history. But it seems the whole process is a big one for a tribute\n– Isn’t there evidence that the templars started ceremonies in the late 1200s venerating a cloth with Jesus’s image on it?\n– Thoughts on your theories versus the existence of Greek epitaphios circa 1200 / 1300 AD with Jesus laid on a herringbone weave cloth, with body wide wounds generally consistent with those on the shroud?\n– was not the Lirey public display done in the context of the shroud being the Shroud of Jesus?\nMatthias\n–\n","date":"August 31, 2012 at 7:29 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/21/dan-porter-and-his-2002-long-bet10-years-on-was-he-right-i-say-no-time-has-proved-him-spectacularly-wrong/","cat":"criteria","id":"comment-567","author":"Matthias","site":"colinberry"},{"title":"Dan Porter and his 2002 Long Bet,10 years on. Was he right? I say NO.Time has proved him spectacularly WRONG…","post":"Hi there Joao. Good to hear from you again.\nYup, I shall continue to plough my lonely science furrow for as long as there are folk like you who are open to new ideas and willing to spend a few minutes hearing what I have to say,\nIf you find any other kindred spirits out there, please let me know. I tried to register with that James Randi ‘professional sceptical’ site of yours, but immediately ran into difficulties, getting an email that said my registration had been deleted even before it had been activated. I remonstrated, a particular lady who administers the site did not care for my tone – end of story. I may try again later, since a lot of the comment there is exceedingly-well argued and well-informed. Thanks for letting that forum know of my existence.\n","date":"August 25, 2012 at 7:13 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/21/dan-porter-and-his-2002-long-bet10-years-on-was-he-right-i-say-no-time-has-proved-him-spectacularly-wrong/","cat":"criteria","id":"comment-556","author":"colinsberry","site":"colinberry"},{"title":"Dan Porter and his 2002 Long Bet,10 years on. Was he right? I say NO.Time has proved him spectacularly WRONG…","post":"I am a brazilian computer programmer whose interest in the historical aspects of the Shroud dilemma led me to find Colin’s blog.\nAll I have to say is that I consider Colin’s work in the matter, up to now, as possessing an invaluable scientific value. Before his appearence, a real scientific approach (meaning that only the evidences have to be evaluated, pure faith should be kept apart) had rarely if ever been used.\nSo all I have to say is: Keep up the excellent job, Colin. I’ll be looking up for new posts in a daily basis, trying to keep it parallel to my own studies of the theme.\nThank you for your desire to arrive to the actual truth about this intricate ancient “mystery”.\n","date":"August 24, 2012 at 9:12 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/21/dan-porter-and-his-2002-long-bet10-years-on-was-he-right-i-say-no-time-has-proved-him-spectacularly-wrong/","cat":"criteria","id":"comment-553","author":"Joao","site":"colinberry"},{"title":"Dan Porter and his 2002 Long Bet,10 years on. Was he right? I say NO.Time has proved him spectacularly WRONG…","post":"The link to my site seem to not work.\n","date":"August 21, 2012 at 10:38 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/21/dan-porter-and-his-2002-long-bet10-years-on-was-he-right-i-say-no-time-has-proved-him-spectacularly-wrong/","cat":"criteria","id":"comment-539","author":"Dan","site":"colinberry"},{"title":"Dan Porter and his 2002 Long Bet,10 years on. Was he right? I say NO.Time has proved him spectacularly WRONG…","post":"Agreed. It did not work for me either, Dan, but should be OK now.\n","date":"August 21, 2012 at 11:05 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/21/dan-porter-and-his-2002-long-bet10-years-on-was-he-right-i-say-no-time-has-proved-him-spectacularly-wrong/","cat":"criteria","id":"comment-540","author":"colinsberry","site":"colinberry"}]
