[{"title":"Dear Colin:  If you change your mind you are welcome back.","post":"There is an important admission by Colin “Yes, it’s all hypothesis, but…”\nA hypothesis is not evidence of anything. It is often an educated guess. Sometimes it’s an uneducated guess. To become important, the hypothesis must be supported by facts and experimentation. the Jacques DeMolay hypothesis is supported by neither.\nAs much as I believe in the right of free speech and welcome debate, CB has been a distraction. I still wonder if it was deliberate.\n\n","date":"February 8, 2014 at 8:44 am","url":"https://shroudstory.com/2014/02/08/dear-colin-if-you-change-your-mind-you-are-welcome-back/","cat":"other_blogs","id":"comment-77467","author":"John Klotz","site":"shroudstory"},{"title":"Dear Colin:  If you change your mind you are welcome back.","post":"My memory’s not what it used to be, but I’m 90% certain that I made the link with the Templars through pondering details of the Lirey badge, its curious omissions  and the peculiar “blood belt” (Wilson’s description) especially, rather than through awareness of the Knight and Lomas prison/torture  scenario which came later.  They proposed chemical imaging of a still living de Molay. I propose imaging off a metal effigy, possibly a crucifix to add to the confusion between Jesus Christ and an executed Templar  It was strengthened by the close similarity between the names of Geoffroi de Charny, first known owner of the TS in Lirey,  and Geoffroi de Charney, Preceptor of Normandy, who died at the stake the same day in 1314 as Jacques de Molay. Genealogist Noel Currer-Briggs considered them to be nephew and uncle respectively, so it was a small step to regard the TS as a one-off grim and arresting pyrographic tribute by nephew (maybe) to his uncle (maybe).\n But this is clearly not the site to be discussing these ideas, and in any case I am now going through the sequence of ideas developed over the last two years and trying to decide how credible they are or not. Some here have quickly made up their minds. I have not, and could be swayed either way as new argument or evidence comes my way. But I will not be ridiculed or bullied into submission. I’ve taken unconventional stands in the past, and lived to see my ideas become accepted as the norm. The John Klotz’s of this world cannot take that away from me.\nMy site is now a work sheet for detailed and meticulous re-examination of each link in the chain, so to speak. It’s unlikely to appeal to many here, bar one or two folk still receptive to new (or even recycled) thinking. That’s why I’d prefer to work with few if any distractions from having posts covered on this site. My blog has always been primarily by way of a personal odyssey, certainly not the draft for a book, and with no absolutely no ambition for fame or personal enrichment. \nI will look in here from time to time, not to comment, but to pick up on views I consider interesting or debatable, offering my own view maybe over there. But with that proviso, kindly consider me hors de combatwhere this site is concerned. Chalk and cheese…\n\n","date":"February 8, 2014 at 10:21 am","url":"https://shroudstory.com/2014/02/08/dear-colin-if-you-change-your-mind-you-are-welcome-back/","cat":"other_blogs","id":"comment-77485","author":"colinsberry","site":"shroudstory"},{"title":"Dear Colin:  If you change your mind you are welcome back.","post":"Colin, for me, was only a distraction when he lost his patience and then strayed from the facts into personal attacks. I’m not sold on the Molay hypothesis either but Colin’s other observations about the Shroud, his questioning of the assumptions, were most valid. His scorch experiments were also fascinating re: 3d properties.\nI’m not here start a CB fan club but we need Colin, Charles, and Hugh’s skepticism. It’s healthy for the discussion.\nWhat I’ve noticed with both sides of the debate is a reflex to dogma and ad hom attacks the minute we realize ‘I might be wrong’ – but cannot handle this possibility.\nEach of us has boldly claimed that whether the Shroud is authentic or a fake, that it doesn’t really matter as to what we believe about Christ. Looking at our reactions to each other on this blog at times, I think we’re not being honest with ourselves.\n\n","date":"February 8, 2014 at 10:31 am","url":"https://shroudstory.com/2014/02/08/dear-colin-if-you-change-your-mind-you-are-welcome-back/","cat":"other_blogs","id":"comment-77486","author":"David Goulet","site":"shroudstory"},{"title":"Dear Colin:  If you change your mind you are welcome back.","post":"“Looking at our reactions to each other on this blog at times, I think we’re not being honest with ourselves.”\nGreat point. Many here DO seem to be clinging to Shroud authenticity to support their faith, despite what they say.\n\n","date":"February 8, 2014 at 5:42 pm","url":"https://shroudstory.com/2014/02/08/dear-colin-if-you-change-your-mind-you-are-welcome-back/","cat":"other_blogs","id":"comment-77559","author":"Matthias","site":"shroudstory"},{"title":"Dear Colin:  If you change your mind you are welcome back.","post":"You are absolutely right. By the same token I have also noticed people clinging to fantasies to support their lack of faith, despite what they say( that they are only interested in scientific proofs and so forth).\n\n","date":"February 8, 2014 at 9:33 pm","url":"https://shroudstory.com/2014/02/08/dear-colin-if-you-change-your-mind-you-are-welcome-back/","cat":"other_blogs","id":"comment-77609","author":"Mike M","site":"shroudstory"},{"title":"Dear Colin:  If you change your mind you are welcome back.","post":"No one has noticed that there are bloggers who react to other bloggers depending on how yet other bloggers react?\n\n","date":"February 8, 2014 at 6:44 pm","url":"https://shroudstory.com/2014/02/08/dear-colin-if-you-change-your-mind-you-are-welcome-back/","cat":"other_blogs","id":"comment-77575","author":"Louis","site":"shroudstory"},{"title":"Dear Colin:  If you change your mind you are welcome back.","post":"It isn’t just that his screeds are so antagonistic to the Shroud world, or even that they are bitter and self-humiliating, but that they are so unfailingly patronizing. The Shroud world, we gather, hasn’t been sufficiently deferential to Berry’s credentials, to his academic attainments and his immense store of knowledge, his often unfortunate command of chemical minutiae, and the insolent presumptions of superiority that have come along with it all, however unentitled. We read of the deluded Shroud world, the “Mickey Mouse” Shroud world, the Shroud world, and the big one – particularly distasteful because it has been so gratuitously trumped up as to look like a mere projection – the starry-eyed pseudo-science  Shroud world.\n\n","date":"March 28, 2014 at 7:54 pm","url":"https://shroudstory.com/2014/02/08/dear-colin-if-you-change-your-mind-you-are-welcome-back/","cat":"other_blogs","id":"comment-94374","author":"Psuedonym","site":"shroudstory"},{"title":"Dear Colin:  If you change your mind you are welcome back.","post":"Thankfully I and a tiny handful of others are no longer the only ones blowing the whistle on Shroud pseudoscience, David Kyle Johnson on Psychology Today has recently added his voice too, citing my views on the resort to wacky or unspecified radiation sources, rarely bothering to discuss problems and mechanisms of imaging.  Here’s a link to the first of his three part series, curiously not flagged-up thus far on this site.\nhttp://www.psychologytoday.com/blog/logical-take/201403/let-go-the-shroud-part-i/comments\nOne needs hardly add that he also attracted the kind of personal invective in the attached comments as we see here. \nEnough said. DFTT.\n\n","date":"March 29, 2014 at 3:28 am","url":"https://shroudstory.com/2014/02/08/dear-colin-if-you-change-your-mind-you-are-welcome-back/","cat":"other_blogs","id":"comment-94456","author":"colinsberry","site":"shroudstory"}]
