[{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"A tandoori is an urn-shaped oven, yes? That would surely be too cramped.\nI’m more inclined now to think in terms of a rotating open spit, with the linen wrapped in cylindrical or spiral fashion around a horizontal timber or metal pole,with turning handle, supported above a long tray of glowing embers (charcoal). That might explain the curious black specks one sees in the Mark Evans photomicrographs that I commented on back on late 2014:\nhttps://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/\nAt that time I thought the specks might be toasted flour particles, but I’ve gone off that idea – there being too few. Flecks of carbon (soot) from a charcoal fire seems more likely, sticking preferentially but not exclusively to the image-imprinted areas for a variety of reasons.\nIt was actually hot cooking oil I checked out as an alternative means of heating using my thermostatted deep oil fryer (which irritatingly stops heating at approx 190 degrees C).. Yes, the folded and rolled-up linen was deep-fried as if battered cod!  I’ve abandoned it at least temporarily, but there was useful scientific spin-off as indicated earlier. The ability to get a good primary image (Maillard) but failure to see a decent ghost image after abrasive washing to remove oil and crud can be seen as supporting my ‘blotting paper’ theory for the superficial TS image. The latter depends on limited penetration of tiny amounts of hot reactant efflux from browning flour into and between the fibres (condensing chemically on the surface of the fibres to form a thin yellow film of adsorbed Maillard products). If the spaces between linen fibres are already blocked with cooking oil, then there can be no blotting paper effect via capillary action!\nI think we’re getting there – being able now to account for the superficiality and other subtle properties of the TS image due to the blotting-paper properties of linen.\n","date":"August 13, 2016 at 5:13 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7605","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"The Shroud of Tandoori? 🙂\n","date":"August 12, 2016 at 6:59 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7603","author":"David Goulet","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"From Ian Wilson’s history of the Shroud, displayed on the STERA “Shroud History” page:\n“Lalaing adds that the Shroud’s authenticity has been confirmed by its having been tried by fire, boiled in oil, laundered many times ‘but it was not possible to efface or remove the imprint and image.’ (1503)\nThere’s a clue there David to an alternative means of heating the linen that does not require  a large oven, or indeed any kind of oven, but maybe a cauldron instead  (nudge, nudge, wink, wink). It’s one I’ve experimented with briefly since it allows one to roll up the linen into a compact package.The 1st stage imprints plump up beautifully when given a light, non-abrasive laundering with soap and water.  The bas-relief imprints look for all the world like that on the circa 1355 Lirey Pilgrim’s  badge (which may or may not be pure coincidence).\nThere are still to problems to be resolved, mainly to do with getting a sufficiently visible final ‘ghost’ image after more image-abrading laundering (which may require somewhat higher temperatures than the ones tested so far, say 220 rather than 190 degrees C.).\nThe chief problem is not so much scientific or even technological. It’s arriving at a satisfactory answer, whether practicable or not, without burning home-sweet-home down in the process…\n","date":"August 12, 2016 at 5:19 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7602","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Colin,\nWhat kind of oven would have been used to roast the linen? Do think it was one large oven or a smaller one which the linen was drawn through little by little. How would the linen have been suspended in the oven – as we don’t see any signs of over-baking on the non-image side?\n","date":"August 12, 2016 at 2:34 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7601","author":"David Goulet","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Bonjour Matthieu\nForgive my asking, but can you give just one good reason for thinking that the Shroud is 2000 years old (approximately)? If so, please enlighten. For my part, I can supply two good reasons for thinking that it’s just 600-700 years old (again, approximately) and a few dozen not-so-good reasons.\nI too believe there’s a connection between the Shroud and the biblical account of the road to Calvary, but not for the pro-authenticity reason you  cite, i.e. imprinting with real mineral dust from the road. I believe that medieval artisans, probably the clerics employed by Geoffoi de Charny for his private monarch-financed chapel at Lirey, hit on the idea of modelling an icon along the lines of the fabled Veil of Veronica (the imprint of Christ’s face which, according to legend, was captured en route to the cross) but with a difference, It would be the imprint of the entire body, both sides,  captured shortly after death in sweat and blood en route from the cross to tomb, wrapped in Joseph of Arimathea’s ‘fine linen’ (NOT intended one might add as the final burial shroud).\n Flour, or something similar, was used as the imprinting medium, but only because it achieved that ‘authentic-looking’ sweat-imprint appearance AFTER oven-roasting and thorough laundering, leaving the faint yellow image but no trace of the inspired choice of imprinting medium.\nThank you for rescuing my site from the Google doldrums. The arrival of your comment lifted it from the bottom of Page 5 to the top of Page 4 listings. 🙂\n","date":"August 12, 2016 at 6:24 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7600","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Hi Collin,\nGlad my comment helped your google referencing, though when I googled shroud and I can’t remember the other keyword, it came almost first in first page.\nWell, to answer to you, the main reasons I’m not hundred percent sure the TS is a forgery is the quality of the artwork, that respond exactly to all aspects that we could scientifically expect for a crucified man that had a crown of thorns on his head. If TS is a forgery, then the forger is a really a genius, and a scientific, and a forensic, and a scholar, and a torturer. It means he invented a printing technique not known before and after him (until you arrived), had to make a lot of testing like you do, he had to torture and crucify a bearded man with long hair, did it with nails in the wrists although all artistic depiction in his time and in the past have always been in the hands (I’m very skeptical the forger used a sculpture for the imprint, due to the blood stains that are very subtle and in the right physiological layout).\nMaking such a forgery with no mistakes, with the means and knowledge of middle ages is very impressive (to me). But why not, if the C14 says so.\nOn the other hand, I wonder if TS is not the Mandylion? What is your opinion about it?\nBut anyway. I am now still wondering if your model works only with flour or also with any powder material? If you prefer the question turned this way, could Geoffoi de Charny or his forger used only flour, or dust, or pigments, or talc, or else?\n","date":"August 13, 2016 at 11:01 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7607","author":"MATTHIEU LEFEBVRE","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Hello again Matthieu\nAm travelling right now, so can only give a brief reply. Your major objection, or at any rate reservations re forgery, will have to wait for a day or two. Dealing with your last point: no, white flour is not necessarily the only imprinting medium that works, or might work. Similar results might (or might not) be obtained from other milled grains, or maybe milled seeds or nuts, especially oily ones. The important property is that they should all of them ‘sweat’ a yellow or brown-tinted fluid when heated at temperatures up to around 200C (which linen amazingly tolerates). In a forgery model, such as the one I propose, one may never know for certain what was used as imprinting agent, given that all traces of it could/would have been removed in the final laundering that is needed to obtain the final attenuated image (essentially a weak ‘blot’ mark left by a heat-induced oily exudate). \nTo summarize: whatever the imprinting medium, heat from an oven or open charcoal fire made it ‘sweat’  and permanently mark linen so as to model the notional ‘look’ of a human sweat imprint. There’s a neat symmetry there, no?\nAfterthought: When using white wheaten flour as the imprinting medium, I used a thin smear of oil on the skin first to assist adhesion and to ensure an even powder distribution when the surplus was shaken off. It’s just possible that if a milled oil-containing seed or nut was used, then there would be less need for the preliminary smear of oil – the powder could/would stick to skin using its own oil! Either way, oil assists colour development in the oven, mechanism still to be determined.\n","date":"August 14, 2016 at 6:02 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7608","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Thanks for these explanations Collin. Are you planning to make a man-size imprint on linen one day? Would be interesting to see how close you can get to TS, using a bearded young man for model.\n","date":"August 14, 2016 at 9:35 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7610","author":"MATTHIEU LEFEBVRE","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Nope. It’s never been my ambition to do a life size model Matthieu. What attracted me in the first instance was the claim that the image characteristics (superficiality, 3D properties, microscopic features etc) were ‘enigmatic’  and/or beyond the ability of any known man-made technology.\nWhat seems clear right now is the remarkable similarity between the technology now being proposed and “invisible ink” for writing secret messages using milk or lemon juice to write an invisible message that can then be developed by holding the paper over a light bulb or candle.  In both instances it’s probably Maillard reactions that produce most or all of the brown colour. For invisible writing with invisible ink, substitute invisible imprinting with near-invisible solid white flour or similar as imprinting medium, but again using heat to develop the colour. \nThe difference is that linen,unlike paper, can then be given a thorough wash, removing all the imprinting medium, leaving no clues as to how the final faint image had been formed. That’s one more reason surely to stop with small-scale models where it’s image characteristics rather than large scale morphology  (with all the attendant guesswork) that is modelled. Folk would simply point out the inevitable differences with the TS image, large or small, and declare one had failed in one’s self-imposed task. As I say, it’s never been my goal to produce a replica – merely to figure out the underlying science, or rather, feasible science that generates a comparable mix of properties. I don’t like picking up a newspaper (tail end, 2011) to read that “scientists” are resorting to uv lasers to model the Shroud body image, earnestly hoping their findings will prompt us all to reflect on philosophy and theology!\n","date":"August 14, 2016 at 11:17 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7611","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Hello Colin,\nI’ve been reading your blog since few days. I have to say your theory is very convincing, and main point, you achieved to reproduce very similar artefacts to TS like no one did before. So warm congrats!!\nI’m not sure if this is the right place to post the following question:\nAccording to the gospels, Jesus was anointed few days before his death by Marie Magdala. So here we have one of the ingredients you use for imprinting and image on a linen cloth. The gospels don’t mention any flour, and we would not see why Jesus would have flour all over his body like you do to recreate the image on linen. Nevertheless, knowing the conditions of Jesus walk to Golgotha, we can imagine that he has been in contact with dust all over his body (for e.g. falling down, possibly people throwing him dust, wind, or during body put down the cross, or whatever). My question is: could judean fine dust be a possible replacement for flour to make a body print on linen shroud? Would it have similar properties, as fine particles?\nI’m not trying to defend shroud authenticity here, just investigate! I’m fine with TS being a forgery, but still ok to give a chance to TS authenticity!\nThanks for your scientific answer. And excuse my english, I’m french!\nMatthieu\n","date":"August 11, 2016 at 11:35 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7598","author":"MATTHIEU LEFEBVRE","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Speaking of search engines, this seems as good a time as any to educate Google at least – probably the others too – into the way blog sites are configured. There’s (a) a title (b) a credo alongside, setting out one’s general approach or stance and  (c) the current post title.\nSo, when Google and the others trawl the web for new content, checking for new blog updates, they should display the blog title, FOLLOWED BY THE TITLE OF THE NEW POSTING..\nBut Google doesn’t. Instead, it displays the title and the first few words it finds after the title. \nSo if one’s blog displays its credo, as this site does, then the introductory words only of the credo are displayed, and the NEW BLOG TITLE IS TOTALLY IGNORED!\n Is it any wonder then that one’s new research findings and ideas rarely if ever impact on the intended audience.  Searchers entering (shroud of turin) into Google merely see the same old entry again and again – title plus the first part of the credo – with no flagging up of the new blog posting. \nThe only indication that something may have been recently added is a  more recent date stamp – hardly a come-on.\nSo, for my my next posting, with its important title, I shall have to wipe the credo, making the site look a bit bare at the top.  But one has to do that to ensure the new posting title appears in the list of Google returns.\nThe new title? Still to be finally decided, but possibly: “Shroud of Turin: why all the fuss over what is clearly a laundered image (Antoine de Lalaing said as much in 1503)?\n","date":"August 11, 2016 at 8:17 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7597","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Thanks David.\nI hope you won’t be offended if I say I’m keeping my own counsel as to where to go from here. Naturally I hope that the next issue of Hugh Farey’s  BSTS Newsletter carries its “Around the Internet” feature, and that my work again gets a mention, as it has in the last two issues (Dec 2015 and especially the earlier June 2015). But the acid test is what one sees when googling (shroud of turin). Sadly, one needs to shout (from the rooftops) to stand any chance of being noticed where it matters. Where dissemination of one’s research is  concerned, there is no longer (post Dan Porter’s shroudstory) any marketplace for ideas. Sindonologists simply look after their own – studiously ignoring those deemed ‘opposition’, and thus ‘beyond the pale’.\nSindonology exists primarily as a Mutual Appreciation Society (constantly promoting its pro-authenticity, agenda-driven narrative online and in the media, assisted by its network of like-minded anti-sceptic editors and journalists).\n","date":"August 11, 2016 at 4:22 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7595","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Could you submit an essay outlining your latest course of research to the British Society for the Turin Shroud newsletter (if it is still active). Hugh, I’m sure, would publish it and he’s an objective editor. The BSTS newsletter is still a well read publication and you could link discussion back to this site.\n","date":"August 11, 2016 at 2:48 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7594","author":"David Goulet","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"If sindonology were truly the science or even academic discipline it claims to be, then this researcher’s conclusions would be on its radar screen, referred to, linked to. But it’s not. I cannot find a single mention on Google of my research and conclusions these last 4 years and more  (apart from on the now retired wishy-washy Dan Porter site). Why not? Because sindonology is neither a science nor an academic discipline. It’s merely an attempt to impose a narrative, based on the flimsiest of evidence, and a resort to agenda-driven pseudoscience (uv lasers etc). So it’s no wonder that my research and conclusions have been frozen out.\nResponse? Time to hang up the scientist’s hat. Science, or rather the scientific method was handy in helping one know what the Shroud is NOT.  Deciding what the Shroud IS requires that a lot more knowledge skills, life skills, appreciation of history etc above and beyond “science” as generally perceived is called into play.\nI shall wait a few days to see if the present posting attracts more interest and comments. I’m not holding my breath,\nIf not, then I shall proceed to lay it on the line, and tell the world precisely how and why the Shroud came to be seen and enthusiastically promoted as a ‘genuine relic’ or even ‘science-baffling enigma’. Suffice it to say, the expression “much ado about nothing” springs to mind, thinking of the real-life significance of  faint, scarcely visible ‘washed-out’ images in the general scheme of things that would normally attract zero attention, were it not for the underlying presuppositions and accompanying agenda.\n","date":"August 10, 2016 at 9:26 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7590","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Afterthought: given the extensive scorching and full-thickness burnholes resulting from the 1532 Chambery fire, the bloodstains would surely have been severely oxidised and discoloured, over and above the effects of age. Would that not have provided further grounds to ‘touch up’ with new blood? That might explain the surprise expressed by the Poor Clare nuns at the brightness of the bloodstains if they had been called in to do the repair patches after the remedial work. It might also explain the doubts expressed re the genuineness of the Shroud in the immediate aftermath of the fire, explaining why it was felt necessary to convene a commission of enquiry to rule on the matter.\nWhat’s especially annoying for this investigator is that without the fire, one could have proposed a highly discriminating diagnostic test for the thermal flour-imprinting  model – i.e. find some means for testing whether the ENTIRE linen has been exposed to high temperatures- in the region of 200 degrees C. That is sadly ruled out.\nHow does one test a model, the key feature of which is that the sensitizing agent to heat – in this instance white flour- has been been washed out, and is no longer there, not even traces thereof (?). OK, one can explain the washed-out look of the final image, but that alone is hardly likely to convince the pro-authenticity sceptics…\n","date":"August 8, 2016 at 7:01 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7580","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"See altered title to this posting (well, a few extra words added onto the start), followed by this:\nUpdate: Aug 3, late evening, UK time:  Oops. The new title and format of this site, now into its 5th year, has been picked up by Google under a (shroud of turin) search sooner than expected – approx  14 hours! But there’s no initial posting ready just yet – one that invites questions to which I hope to give speedy but considered answers. Sorry about that. Expect the first posting by end tomorrow (Aug 4) at the latest. In the meantime there’s always the comments facility attached to this posting, most of them my own sad to say, but hopefully things will change for the better soon.\n","date":"August 3, 2016 at 10:53 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7558","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Am still pondering on my next move. Previously I had suggested two more postings, one listing the 10 polemical obstacles that we Shroud iconoclasts are expected to negotiate, the other “selling” the flour-imprinting model more forcibly than has been the case so far.\nYesterday I went back to the shroudstory site (which ‘closed up shop’ in December last year) looking to remind myself  about the model’s initial reception on that site. (Much is best left to moulder there, given the level of vituperation on display,  though in most cases from ‘newbies’ popping out of the woodwork to deliver their tirade laced with personal insults).\nHowever there was one comment from the wise and perceptive David Goulet (author of ‘LooneyTombs’ that lifts the, er lid, on the reclusive world of funeral directors).\nHere it is in full:\nDavid Goulet\nSeptember 3, 2015 at 9:26 am\nWhat would be interesting is to find a scientist, or two, who is not a Shroudie and present him Colin’s linen/shroud and see how long it takes him/her to discern how the image was formed. This would provide a baseline of sorts. If the scientist quickly deduces that flour/oil and heating was used then we would have to ask ‘how is it the mechanism was more easily observed on Colin’s shroud vs the actual one?”\nIf Colin’s model is ‘the answer’ what tell-tale signs would we have to find on the Shroud to corroborate his theory?\nOr is my presumption wrong here and Colin is not saying this model is exactly how the Shroud image was created, but rather his model merely demonstrates that a simple mechanism can account for certain Shroud properties, which had previously been attributed only to complex mechanisms (lasers, etc).\nJust trying to wrap my head around the various repercussions of the theory.\nLink to  Dan Porter’s posting:\nhttps://shroudstory.com/2015/09/03/colin-berrys-latest-and-greatest-is-it-enough/\nSorry I never responded at the time, David, being, to put it crudely,  up to my arse in alligators.\nBut I shall respond soon. Not here, but on a new posting that will take the form of ‘Questions and Answers on the Flour-Imprinting Model’. Your discerning question has really put me on the spot, but more importantly, probably puts both analytical chemistry and the scientific method on the spot too. Would modern day science have a ready and correct explanation for my final faint attenuated imprint, the one that remains  – see site banner- after vigorous washing with soap and water, with no encrusted material, no particulate matter visible under the microscope (and thus no scope for a latter-day Walter McCrone),  merely a faint seemingly-superficial yellow-brown discoloration? Would it require more than science? Would it require an imaginative leap, preceded by putting oneself in the place of a medieval artisan, wondering how he might set about simulating (less politely, “faking”) an ancient sweat imprint on linen. \nYes, on reflection, that’s the way to go. I’ll address David’s question first, which should be sobering if nothing else, then invite new ones.  Meanwhile, I shall continue to trawl the Porter archives for further questions  re the TS to which I was not able or willing, for one reason or another, to do proper justice at the time.\nPS: I’ve altered the site’s title to reflect the new strategy.\n","date":"August 3, 2016 at 8:17 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7553","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Back again (August 2): Progress update regarding the bloodstains. Or, rather, their modelling thereof in the somewhat restrictive context of the flour-imprinting model (requiring as it does that oven-heating stage that would degrade blood to a most unblood-like dark brown colour).\nThere’s no shortage of evidence for there being collagen (connective-tissue protein) in the Shroud bloodstains that really ought not to be there. See my posting done a long time ago, gently taking the late Raymond Rogers to task for thinking that his hydroxyproline result was diagnostic for the presence of blood, more specifically unheated blood:\nhttps://shroudofturinwithoutallthehype.wordpress.com/2012/08/06/i-think-i-now-know-why-sturp-chemist-raymond-rogers-thought-there-was-hydroxyproline-in-the-blood-on-the-shroud-and-its-to-do-with-those-medicinal-leeches/\nFollowing some clues from contrast-adjustment in my photoediting program that suggests the presence of a faint yellow component that spreads out from underneath the TS bloodstains into the surrounding linen, which I had initially thought might be serum proteins, I got to wondering if I might be seeing evidence for that unphysiological out-of-area collagen instead.\nExperiment: make a viscous solution of gelatin in warm water, use before it sets to a gel as if “artificial blood” (though yellow, not red). Apply to my hand AFTER coating with oil and flour. Bake the linen as per usual (approx. 200C) when the gelatin becomes visible as light brown stains. Then, and only then, apply red dye (commercial beetroot juice) by dabbing onto the gelatin stains. The result was most gratifying, the dye tending to stay put on the gelatin  stain instead of spreading out into the surrounding linen which would have looked most unblood-like.\nIf the bloodstains had been ‘manufactured’  this way by a medieval ‘modeller’ would the result be compatible centuries later with STURP’s blood-before-image sequence of imprinting? Answer? It depends. It depends on whether the roasted gelatin, i.e. collagen, still behaves like a typical protein. Had that been the case the yellow brown gelatin/collagen stain (plus attached red dye) would  presumbly have been digested by the Adler/Heller protease, on the assumption that their source of enzyme had broad specificity towards a range of proteins (collagen as well as blood albumins etc) and that heat denaturation did not alter the susceptibility towards the protein-digesting enzyme.\nI can supply photographs of the above experiment if anyone’s interested.\n","date":"August 2, 2016 at 6:59 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7550","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Interesting train of thought. What do you make of this equally intriguing paper on the bloodstains by Adrie A. M. van der Hoeven (that seems to have slipped of the radar of many – which is a pity):\nhttp://file.scirp.org/pdf/OJAppS_2015113010464750.pdf\n","date":"August 4, 2016 at 7:07 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7564","author":"David Goulet","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Yes, I too had spotted that one of Adrie’s a short while ago. I look forward to reading when I have a spare hour or two – it being mercifully shorter than its 200+ page predecessor that overwhelmed me last year – needing one to set aside days…\nHowever, there’s a caveat. Anyone who focuses on the colour of the blood, investing the time that Adrie has put into analysing spectral characteristics etc has to be exceedingly careful if coming from a pro-authenticity point of view. Why? Because even if the TS were 1st century, and the original bloodstains genuine, who’s to say that most if not all that original blood has not flaked off and been subsequently ‘touched up’? And if touched up, what was used? More original blood, or fake look-alike blood?\nThe question I would put to Adrie is this: what does she make of Rogers finding a peak for hydroxyproline in his mass spectometer. Is that not a marker for collagen? Isn’t collagen a marker for connective tissue, not blood?  And isn’t collagen, in the form of gelatin  (either as a solid gel or viscous liquid) precisely the kind of substance that might be in the medieval tool kit? I can show her photographs taken after dribbling mixtures of red dye and viscous gelatin solution onto linen. The gelatin runs in rivulets a short distance, with no obvious soaking into linen, with plumped up blood-like beads, sharp meniscus etc, which then set solid, freezing the ‘right look’. One can then overpaint, either with real or fake blood, and straightaway one has an answer to the blood-before-image conundrum in the flour-imprinting model (details another time).\nI had said last year I wasn’t planning to research blood, feeling it was a separate issue from body image, assuming there was a means of imprinting so as to look as if blood had arrived first (as indeed there is, indeed more than one). But since discovering the versatility and potential of gelatin as a component of ‘fake blood’, not only for touching up, but for simulating the original blood in an initially unpromising blood-degrading thermal-imprinting model, I may do a separate posting on it, maybe using your question as the posting’s title.  It’ll also be an opportunity to respond to Adrie in greater detail. \nFor now the focus has to stay on that ‘washed-out’ looking body image (see today’s addition to the present posting). Why does it look ‘washed out’? Answer: because most of the Stage 1 imprint WAS indeed washed out. Savoy house courtier Lalaing said as much, but supposed the image was being “tested” for permanence, a misunderstanding that is entirely understandable, if you see what I mean,\n","date":"August 5, 2016 at 9:54 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7570","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Here’s a late answer to the question you raised here Aug 4 re Adrie’s Nov.2015 paper, David.\nhttps://www.researchgate.net/publication/285120654_Cold_Acid_Postmortem_Blood_Most_Probably_Formed_Pinkish-Red_Heme-Madder_Lake_on_Madder-Dyed_Shroud_of_Turin\nThe problem I’ve always had with Adrie’s thesis is this: why would the manufacturers of a 1st century sheet of linen need to impregnate with madder as well as starch?\nWell, maybe they did or didn’t. But if there is indeed madder under the blood, and only the blood (?) then there’s a ready explanation in terms of the new model I’m currently developing for the bloodstains (see current posting, with “cunning” and “dastardly” in the title!\nI now believe that the ‘forgers’ of a 14th century TS decided roughly where the bloodstains needed to go for biblical credibility, and protected that part of the linen from imprinting agent. For example, they could have coated the subject with oil, then added patches of linen – circular, oval, sausage shape etc – as flagged up earlier on this thread BEFORE sprinkling with flour, then proceeded to shake off surplus flour, and then the linen patches. After the linen had been roasted then washed, there would be handy blank areas in the body image on which they proceeded to paint or dribble blood.\nIf the paint did not cover the blank areas 100% that would have left white edges or patches with no body image colour currently (mis?)interpreted as serum haloes etc.and indeed one sees evidence for paler-than-body image areas in and around bloodstains. But maybe our forgers did not want those paler areas to look too much like virgin linen. So what did they do? They applied an undercoat of pale yellow dye first to those blank areas before applying the top coat of blood. \nI’ll be interested to hear what Adrie thinks of this re-working of her madder-dye brainwave… First I must find my tin helmet…\n","date":"September 21, 2016 at 4:55 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7833","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Why madder? “Madder dye is antimicrobial, antifungal, and insecticidal.” Thus the linen treated with it was valued for religious/burial purposes. That’s her assumption. It’s logical in the context of her 1st century hypothesis. I felt she did a credible job supporting her hypothesis. I find your medieval hypothesis also is logical. A discussion between you and Adrie would be more interesting than much of what they have lined up so far for the Washington conference.\n","date":"September 21, 2016 at 7:05 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7834","author":"David Goulet","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Yes, but why go to the trouble of bleaching linen, especially ‘fine linen’ as produced by J of A, requiring weeks or months of exposure to sunlight etc, and then go and give it a yellow or pinkish cast using a plant dye? Somewhat self-defeating, no? Surely there would have been knowledge of alternative preservatives for linen (if employed) that were totally colorless? Or just store the linen in a sealed container so as to exclude moisture!\nIncidentally I see that Adrie mentions the remarkable state of preservation of the TS, freedom from mould etc, amazing one would think even for something as ‘young’ as the medieval era. The model proposed here accounts for that: the oven-roasting would not only have destroyed all microrganisms like fungi, bacteria etc, resistant spores included. It would also have denatured most if not all of the more fragile biochemicals of flax, retting agents etc that are more nutritious for bugs than resistant cellulose \nI despair of the Pasco prospectus. It’s accompanying notes begin by listing all the anatomical and pathological features one can see on the TS – treated as if a photograph based on imaging via reflected light. It then goes on to play the ‘deeply mysterious image’ card, requiring inputs beyond the realms of conventional  science, designed to elicit ‘spirituality’. But if those conference organizers  don’t know how the image was formed, then what right do they have to contradict themselves, interpreting it as if it were a photograph? Why should a dark patch be assumed to be an “abrasion”, caused by scuffing of the cross on a shoulder?\nIt really is time that these folk ceased treating an idea (and a largely unsupported one at that) as if it were a commodity for the marketing thereof.\n","date":"September 21, 2016 at 7:34 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7835","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Have just added some more images to the end of the posting, detailing a second way of reconciling my flour-imprinting technology with ” blood-before-image”.\n It uses cut -outs of linen to represent “bloodstains”. The latter act as masks during the imprinting process. The blank areas on the imprint, shaped like bloodstains (I used lettering too!) can then be manually touched up with blood or blood-substitute afterwards.  Here’s a snapshot of an intermediate stage in the process:\n\nThose cut-out masks might look somewhat fiddly to produce, but let’s not forget that it can be done at leisure ahead of time, an important consideration, while filling in some dark winter months for a medieval religious order (Geoffroy de Charny’s personal chapel with its 5 or 6 probably bored underworked chaplains?). The pre-prepared stock of masks can then be quickly applied to all the strategic locations on their chosen flour-coated subject (or subjects in the plural, if, as suggested earlier there were TWO used in the imprinting session, one for the frontal, the other, of roughly the same height and build, for the dorsal image).\nCareful painting/infilling of the blank, mask-protected regions of the imprinted  linen with blood or “blood” could also have been done at leisure after the crucial oven-heating stage. Indeed, it could have been done more than once, say every 50-100 years,  so as to maintain a pristine appearance, given that blood, real blood that is, would have a tendency to flake off with time, especially as a result of handling the Shroud (displaying, folding, refolding etc).  Repainting with blood at intervals  might explain why for some  “the blood looks too red”.\n","date":"August 1, 2016 at 6:41 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7543","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Yesterday I embarked on a new line of experimentation, designed to test the blood-before-image conclusion of the Adler/Heller protease experiment, and to see whether it makes difficulties or not for my flour-imprinting model. Preliminary conclusion: no it doesn’t. Why? Because blood-before-image is reversed in a contact-imprinting model, where it’s image-imprinting medium BEFORE blood on the subject’s body that iis being imprinted onto linen. It was that proposition that was tested yesterday, at least in principle, albeit imperfectly in practice.\nSee the 4 new images added to the end of the current posting. I’m willing, indeed happy, to discuss the results and my preliminary conclusions here, while recognizing that a lot more R&D still needs to be done, ideally with real blood – or likely substitutes partially or completely replacing real blood in a medieval context.\n","date":"July 31, 2016 at 8:39 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7538","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"No.10 (continued): have been refreshing my memory on what little information is in the public domain re the Adler/Heller ‘blood –before-image’ mantra. Here’s a posting that appeared in early 2013 on the now retired shroudstory site that could well supply the answer, or rather the comments, supplied by Hugh Farey:\nhttps://shroudstory.com/2013/02/26/that-is-not-what-one-would-expect-to-see-if-the-blood-first-dogma-were-true/\nIn looking to see what was under the bloodstains (or “serum” as it’s irritatingly referred to) Adler and Heller did not apply their protease enzyme to a square of linen from a body image-bearing region. They applied it to individual fibres from that region. Why? Because that’s all they had (working from Rogers’ sticky tape samples with detached, i.e. stripped-away individual fibres). So why expect there to be yellow (image) colour under the blood, given that a minority of fibres in an image zone are/would be coloured, as Hugh points out (recalling that image colour is an averaging by the human eye of a few uniformly coloured fibres and a lot of uncoloured ones – the so-called half-tone effect.\nRandomly sampled, only a few fibres from an image zome can be expected to be coloured. Chances are that Adler and Heller had ones that were UNCOLOURED!\nThanks Hugh. The blood-before-image mantra lacks conclusive experimental evidence. Indeed, it’s deeply suspect, and I now have no hesitation in opting for what I consider a more commonsensical chronology, at least in the context of medieval provenance and man-made technology, namely that the body image was imprinted first, and the blood second (the latter by a second round of post-oven imprinting or maybe even painting), either with real blood or some blood-like or blood-derived substitute.\nSee also the images (mine, from adjusting contrast on ShroudScope)  that accompanied that posting on Dan Porter’s site. I reckoned there was no visual evidence for blood-before-image based on particular regions where it seemed that blood had partially detached, i.e. flaked away. I shall take another look and see if I can’t improve still further the differentiation between blood and body image, maybe using the neglected midtone control in MS Office Picture Manager that proved so useful in amplifying faintly-coloured fibres when I was looking at the microscopic characteristics of my final flour imprints after thermal processing and soap/water attenuation.\nHaving kicked blood-first into the long grass, I’ve decided, then, to omit the so-called “blood evidence” from my next posting. Freedom!\n Loath as I am to do so, I may have to substitute something else like, groan, sindonology’s love affair with the Hungarian Pray Codex instead (“spot the signature L-shaped poker holes!”) so as to retain a nice round 10.\n","date":"July 29, 2016 at 10:24 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7527","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"10. “The evidence of the blood”?\nThe problem for this investigator is in finding detailed accounts of that evidence. Ideally, it should be in the public domain, especially that obtained by STURP, given the manner in which STURP conclusions have been thrust into the public domain. STURP did not produce its own final report, bar the short summary. STURP findings are scattered through a plethora of research papers, conference proceedings and personal memoirs, much of it behind paywalls, and in many instances lacking abstracts that make it impossible to know whether each $30-$40 order placed with a publishing house would provide the desired information. Of especial interest in the Adler/Heller “blood first, image second” mantra, based on experiments we’re told with protease enzymes. How exactly were those experiments performed? Is there any photographic record of what was seen undeer the microscope. Without answers to those questions it’s impossible to know whrher the “evidence of the blood” is all it’s cracked up to be.\nI shall hold fire on “blood” for a day or two while I trawl one more time through what is available online, but if I decide that I’m having to take too much on trust, that the specifics are too hard to pin down, then I may well decide to omit No.10 from my “unqueering the pitch” posting.  To those who might be tempted to object, I simply say: “OK, if you’re not happy with that decision, then YOU supply the hard data on those so-called crucial experiments on which are based the various blood mantras.”\nOne could do a lot worse than take the 10 page Adler pdf from 1999  (see link below) as one’s starting point, given its many extravagant claims, most if not all of which presuppose authenticity,  as if a mutually agreed starting point with the reader.\nhttps://www.shroud.com/pdfs/adler.pdf\nObjective science? Discuss (the sceptics among us anyway).\nMy next step will be to post this list of 9 (or less probably 10) considerations under the title “Shroud of Turin: De-queering the pitch”. With that task out of the way, it will then be possible to confidently make the case for the flour-imprinting model as THE technology (at least in principle) that can account for many, indeed most, of the subtle characteristics of the Turin Shroud body image, arguably the result of a medieval attempt to model a  sweat imprint onto Joseph of Arimathea’s linen deployed in transport mode, intended perhaps as a whole-body imprint to trump the then-celebrated  much visited ‘Veil of Veronica’.\n","date":"July 28, 2016 at 8:00 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7524","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"9. Is the thermally-processed flour imprint a scorch, or, at any rate, some kind of scorch?  I’m using the term scorch loosely to refer to any kind of superficially coloured linen, no longer pure white but yellow-brown as a result of contact with a hot object, generally in excess of 200C approx.  If so, does it fall foul of the sindonological mantra that all scorches fluoresce under uv light, whereas the TS image does not. Ipso facto, we’re told, the TS image cannot be a scorch.\nThese issues were addressed by this researcher back in December last year. Here’s a link to one of the three postings:\nhttps://shroudofturinwithoutallthehype.wordpress.com/2015/12/16/does-thermally-induced-scorching-of-linen-always-produce-fluorescence-under-uv-rendering-it-invalid-as-a-model-for-the-turin-shroud-answer-most-definitely-no/\nUv fluorescence is irrelevant. Why? Because model contact scorches do NOT fluoresce under uv, at least not my uv source, one that detects fluorescent pigments in bank notes, marker pens, tonic water etc etc.\n The mantra that scorches do not fluoresce under uv seems to be based on a single observation, and a highly questionable one at that, namely the margins of the 1532 burn holes on the TS, that are said to fluoresce red under uv. A full thickness burn hole, with total carbonization indicative of exposure to very high temperatures, can hardly be described as a typical “scorch” even if there’s an intermediate zone between black carbon and unaltered linen that looks golden-brown and vaguely scorch-like. \nMore to the point, the flour imprints from the current model show no fluorescence whatsoever under uv, in common with the  more typical ‘hot metal’ scorches from the previous model.\nRIP fluorescence.\n","date":"July 27, 2016 at 7:59 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7522","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"8. “Valid models of the TS Image must appear on one side of the linen only.”\nThis is a hugely complex area which spans science, technology and probably digital photography and post-processing of images too (thinking of claims from Fanti and others for that “second face” on the opposite side that some regard as pareidolia).\nThe area is especially difficult for this researcher, occupied as he is right now with trying to thermally develop the flour images –  both initial and final ghost image post-washing – in compact packages that don’t require huge ovens. Each heating regime produces its own ratio of the intensity of initial to final attenuated image, with varying degrees of reverse-side coloration.\nWe shall persevere, exploring new chemistry if necessary in addition to ringing  technological changes. The focus is presently on the contribution that the vegetable oil adjuvant has on the final result (oil being smeared onto skin to assist adhesion of the flour – and having a sizeable positive effect among other things on speed of Maillard colour development).\n","date":"July 27, 2016 at 6:35 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7521","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"7. “The TS shows unique 3D properties in certain graphics software (analogue and/or digital)”, or so it it claimed, indeed trumpeted in some instances.\nI can only speak for a particular digital re-processing program, freely downloadable on the web, i.e. ImageJ. I have reported in a dozen or more postings that there is nothing unique in principle about the TS image. 3D properties are shown by any graphic that has gradations, abrupt steps even, in image intensity. The reason is simple: the software reads image density as height above the xy plane, constructing an imaginary z (vertical) axis for display purposes.  The 3D impression is further enhanced by the software installing a virtual low level light source to one side (the left) which then creates virtual shadows.\nThe so-called 3D properties of the TS image can be seen as an entirely predictable manifestation of its imprinted origin, one where’s there’s no directional light source, as in conventional photography. The absence of shadows makes it ‘easier’ for the software to render in 3D strictly according to image density, which in turn depends partly (but only partly) on the 3D nature of subject being imprinted (flour tending to settle on the higher FLATTER contours, and scarcely if at all on the vertical planes, notably sides of the subject).\nBeware those who resort to digital oneupmanship  (“you’ve used too much smoothing”, “you should have converted natural colour to black-and-white”, “you should have used ImageJ’s Thermal LUT-mode” etc etc. All these and other factors have been patiently investigated and found, without exception, to be red herrings, an attempt to make this user of ImageJ seem like a rank amateur compared to their total professionalism. There’s a sense in which we’re all amateurs where sindonology and the alleged “unique 3D properties” are concerned. The difference is that some of us do not restrict our attention to the TS image alone, but explore a wider range of images (charcoal drawings, ink and dye imprints, cartoons, brass rubbings, scorch and flour imprints, photographs  etc etc). Some of us are less amateur than others.\n","date":"July 27, 2016 at 12:00 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7519","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"6. Then there’s the claim that any image produced by direct contact between linen and a 3D subject would display ‘lateral distortion”, i.e. excessive width due to a wrap-around effect.\nSee the discussion this researcher had with Stuart McClaren on the Ancient Origins site:\nhttp://www.ancient-origins.net/artifacts-other-artifacts/shroud-turin-controversial-cloth-defies-explanation-study-shows-it-has-dna-020577?page=2%2C0\nI say that the TS face DOES show a little of that so-called lateral distortion, looking maybe a bit wider than it should, with a simple means for correcting the image using a curved surface, e.g. bottle, and re-photography.\nBut in any case, lateral distortion can be minimised by imprinting off the highest relief only, which is clearly the case with the TS (no sides, no ears etc).\n","date":"July 27, 2016 at 11:20 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7518","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"5. Then there’s the attempt to make a preemptive strike against any imaging mechanism that depends on direct contact between flesh/template and linen. Leaving aside the stupendous difficulties for any model that proposes imaging across air gaps (radiation, gaseous diffusion etc) and the fact that contact is permitted and indeed optimal in those models (zero air gap giving maximal image intensity!) the clincher we’re told is (a) presence of image where one would “expect”  gaps and (b) absence of image where one would “expect” imaging..\nMeaning of “expect”? Based on what prior assumptions, dare one say self-serving preconceptions, like a sheet of linen loosely draped over a recumbent subject, as per authenticity  models (rock tomb etc). But the medieval modelling of the ;’transport linen’  with a pseudo-sweat imprint is not bound by those considerations. It envisages linen being PRESSED down manually onto the elevated contours (not sides) of the subject, with decisions as to which parts one wished to be imprinted, and, just as important, which parts one did not.\nIt doesn’t stop there. The flour imprinting model gives the artisan TOTAL CONTROL over which part to imprint or not imprint, simply by deciding which parts of the subject’s anatomy  to coat with flour, which parts to leave uncoated. Indeed, one could start by coating all the subject, then selectively wiping away the flour from parts one did not wish to be imprinted.\nTo be continued:\n","date":"July 27, 2016 at 10:57 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7517","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Continued from previous comment:\n4. The claim that the image thickness, variously estimated to be between 200-600 nanometres (1nm = 1 thousandth of a micrometre, or 1 millionth of a millimetre), if far too small to have been formed by any conceivable imaging mechanism known to science, this justifying  (we’re informed) resort to pulses of laser-genererated uv radiation\nWrong on both counts. One has only to look at botanical cross-sections of flax/linen fibres to see that Mother Nature provides an outermost cell layer that is 200nm or less thick, i.e. the primary cell wall. Any mechanism, real or imagined, that selectively coloured the PCW – possible in principle, given the chemical differences between PCW and SCW )would automatically generate an “image” layer that was 200nm or less thick (which is not to say that the TS image is confined to the PCW). As for the laser approach, words fail me. Are we being asked to assume that the depth of coloration produced by uv radiation, whether laser-generated or not,  can never be greater than the wavelength of the radiation, e.g. that uv of wavelength, say, of 200nm can never produce effects at depths greater than 200nm, that the laser is guarantted to produce superficial effects only?  If so, that shows a deplorable ignorance of radiation effects in biological systems, whether due to visible, uv or X-ray and gamma radiation.\nMore to come.\n","date":"July 27, 2016 at 10:15 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7516","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"As I say, attempts in the past to publicise my flour-imprinting model outside of my own site (and sometimes on it too!) have often been met with desperate attempts to derail by one or more of the pro-authenticity tendency. By that I mean the resort to  comments that my approach is an irrelevance and waste of everyone’s time, on account of so-and-so (the latter invariably unrelated to experimental model-building, which is this researcher’s speciality). Off the top off my head, there are some 10 standby  ‘so-and-so’ interventions that I’ve come to expect. Here they are, listed with a bare minimum of detail:\n1.The deployment of the term “burial” shroud. There’s no evidence that the TS, whether authentic or of medieval manufacture, represents a “burial” shroud. It’s the uncritical use of that term “burial shroud” that introduces irrelevancies (putrefaction products, as in the Rogers’ model, miraculous flashes of radiation etc etc ). The biblical description of the linen in the three synoptic gospels suggests it was intended and used merely as an impromptu means of transporting the crucified body from cross to tomb, where the account in John then takes over (winding strips etc). The TS was a transport shroud for an unwashed body (thus the idea of a ‘sweat imprint’ of the body accompanied by bloodstains).\n2. Re the claimed references in art of writing to the TS prior to the Lirey display in 1355 or thereabouts, consistent with the radiocarbon dating. There are no reports that this researcher is aware of for the existence of the iconic  ‘two-fold’,  head-to-head, frontal v dorsal image that one sees on the Lirey badge.There may have been any number of images of a face – or whole frontal image even-  prior to Lirey, but it is misleading to say the least to claim they were representations of THE Shroud, and thence to claim that the radiocarbon daters got it wrong or have ignored ‘compelling’ historical evidence.\n3. Likewise the evidence for the TS being older than the radiocarbon date is rendered invalid if based on claims that the fibres are chemically or mechanically older (i.e. weaker)  than 600-700 years. If the TS image was produced by thermal technology as per my model, then the heating step would produce changes that are comparable to those resulting from age, except they would produce in minutes what would normally take centuries at ordinary environmental temperatures, given the nature of chemical kinetics (a mere 10 degree rise in temperature generally doubling the rate of most chemical reactions). I typically use 200 degrees C to develop the flour imprints, which is approx 18 consecutive doublings of rate (2,4,8,16 etc).\nThere are seven more of those pitch-queering so-and-so obstacles in the pipeline  (expect them later today).\n","date":"July 27, 2016 at 9:40 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7515","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Next step? Next posting? Here or elsewhere?\nI had decided to make my pitch more strongly, namely that the TS is a flour imprint, made to seem like (and later promoted as) a 1300 year old sweat imprint left on Joseph of Arimathea’s linen.\nNote that word “pitch”, a colloquial alternative to message, thesis etc.\nBut then I recalled the expression “queering the pitch”, and realized why I have felt discouraged from “making my pitch” more strongly these last 12 or so months. That’s due to the inevitable attempts by defenders of authenticity to “queer my pitch” by bringing in a range of standard “rebuttals” that attempt to undermine any notion of medieval manufacture.\nHere’s how one internet source describes the meaning of  “queer the pitch”:\n(Originally) interfere with or spoil the business of a tradesman or showman.\n (More recently) spoil the business at hand.\nOrigin\n‘Queer’ has been used as a verb meaning ‘to spoil’ since the early 19th century. Putting those two together we get the meaning of this little phrase. It was first recorded, in the vernacular speech of 19th century London, in The Swell’s Night Guide, 1846:\n(I’ll spare readers the details). Further on we read:\nTravelling showmen and market hawkers also called the place they set out their stalls a ‘pitch’. ‘Queer the pitch’ was frequently used it those circles, and later amongst travelling theatre groups, as meaning ‘distract the paying audience from the show’. Directing the public away from one trader’s business and towards one’s own was an important part of street trading of any sort. There was and still is an established pecking order of positions where a stallholder may ‘pitch up’ on any site. It is a difficult to explain but none the less established fact that a crowd, when entering an open space through an entrance, will veer to the right. The stallholders whose stalls languish on the left-hand side were likely to try any sort of ‘queering’ of the right-hand ground to redirect traffic.\nSo don’t be surprised if I produce a posting here, or maybe on my sciencebuzz site, with the title “Unqueering the pitch on the Shroud of Turin”.  Then, and only then, I’ll proceed to blow my ‘flour imprinting’ trumpet, spelling out the technology that I previously considered might have been used, but am now firmly of the opinion WAS used to produce the TS body image. \nOne possibility that has just this minute come to mind is to post the “Unqueering the pitch” preliminary here, then following up in short order with a detailed appraisal and indeed promotion of my (not so) new technology on sciencebuzz. It will then be possible to flag up those postings to one or more of those MSM outlets that invite ideas for new stories (the BBC, Mail etc) where all the crucial details are to be found in just two postings, one strategically-defensive background, followed by the more innovative discoveries from well over 4 years of experimentation.\nOne has only to look at the first listing one ALWAYS sees when googling (shroud of turin) to see what this researcher is up against. I’m simply nowhere to be seen on that particular radar screen – a non-person one might say. ‘Sindonology’ is an exclusive club, members only. But this researcher sees no place or useful role for ‘clubbishness’ where pursuit of knowledge is concerned, so is not unduly bothered on that score. Being treated not just as an outsider, but as a ‘non-person’, indeed pariah one suspects, judging  by some of the stray remarks one encounters from time to time, is something else entirely. As I’ve said before, the gloves are finally coming off, kidgloves that is. I shall now be telling things the way they are where ‘sindonology’ is concerned. The words “self-serving” and “agenda-driven” will undoubtedly appear from time to time.\n","date":"July 26, 2016 at 10:39 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7514","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Hi Colin, loving your ongoing research! It was good to be introduced to the very interesting pilgrimage badge. I didn’t realize they made ones which included images of the shroud. If I may, you have put quite a lot of thought into naming your process, but you mention that you’re looking to publicize outside your site. From a publishing point of view, the label ‘unqueering’ may prove a stumbling block in that regard, what with the modern use of the term. Just my two cents, and no disrespect or discouragement intended. 🙂\n","date":"July 29, 2016 at 4:20 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7528","author":"Liz Leafloor","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Thanks Liz. \nPoint taken – I too had been having second thoughts  about ‘de-queering’. In fact I had toyed with the idea of replacing it with the idea of an obstacle course that sindonology sets up for sceptics like myself, designed to wear us down, designed to prevent us getting to within audible shouting distance of its well-guarded fortress.\nTo make the point more strongly, I’d even taken this cartoon off the internet and added some labels of my own  (in red):\n\nI may or may not use it. What do you (and others) think?\n","date":"July 29, 2016 at 6:57 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7531","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"OK, I’ve refreshed my memory on the microscopic details, Matthew, so here’s a quick response to the points you raise:\n1. The image fibrils showed no signs of capillarity. If your images were analyzed, would they also show this?\nNo, they do not show signs of capillarity, but I have to add  an important proviso. There are no signs of clogging of the relatively large  interstitial pores of the weave, ones that can be seen by holding the fabric up to the light.  What may be present is coloration that migrates between the closely-apposed fibres of the weave – where the gaps are so small that capillarity really comes into its own. But STURP did not examine that aspect of between-fibre migration when addressing the question of artists’ pigments. One would not expect paint medium to penetrate BETWEEN fibres within a thread – only between threads.\n 2. The darkened color was only present on the very crowns of the fibrils. Under a microscope, would we see the same thing on your samples?\nYes, I do. See the link above, then scroll down to the end (“Topic 1”). The concentration of colour on the crowns of the weave is precisely what one might expect from inprinting with a powdered solid (white flour) as distinct from a solution or liquid suspension.\n3. Heller also reported that there was no variation in the color of the image fibrils–areas where the color seemed to be more intense on the linen was due to a greater number of fibrils in a given area being colored–almost like the digital images on an old black and white Macintosh computer.\nYes, I see the so-called half-tone effect, where image fibres all have the same degree of coloration, differing only in the number. What’s more, my model can explain that. The colour is due to a migration of a liquid along the fibres, leaving even coloration as it goes.  I initially thought the migrating liquid was due to the natural oils within flour which on heating “fried” the fibre carbohydrates as they spread. I’m now more inclined to think that the conjectured mobile migrating liquid represents high temperature Maillard reaction products (liquid) which polymerise in transit to yellow or brown substances, staining the linen fibres, probably on their external surfaces, at least initially. So we have an explanation for the ‘fuzziness’ of the TS image – liquid migration from hotspots, only getting so far along each fibre, then abruptly stopping,  producing a ragged edge due to different distances of migration between adjacent fibres.\n","date":"July 22, 2016 at 4:56 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7503","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Hi Colin:\nI happened on your site today and was fascinated by your work here.  I have been interested in the Shroud ever since I was a kid when I read the 1980 article in National Geographic.\nI have seen many explanations for the image over the years, but these haven’t always synced well with the data gleaned from the Shroud by STURP.  Apart from the chemical change in the fibers, Dr. John Heller reported a number of particular details about the image:\n1. The image fibrils showed no signs of capillarity.  If your images were analyzed, would they also show this?\n2. The darkened color was only present on the very crowns of the fibrils.  Under a microscope, would we see the same thing on your samples?\n3.  Heller also reported that there was no variation in the color of the image fibrils–areas where the color seemed to be more intense on the linen was due to a greater number of fibrils in a given area being colored–almost like the digital images on an old black and white Macintosh computer.\nI have done some text searches to look for some of these details on your blog, but didn’t find anything.  If you have already mentioned one or more of these, I apologize for asking a question that you have already answered.\nIf your images have these details, then there’s a strong possibility that you may just have solved the mystery once and for all.  Thanks for the work you’re doing.\nMatthew Demattei\nTempe, AZ\n","date":"July 21, 2016 at 7:11 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7496","author":"Matthew Demattei","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Thanks Matthew. Nice to hear from so well-informed a visitor. Thanks for the appreciative comment.\nIt’s almost a year since I reported  microscopy on the image fibres from the current flour model. I can understand why you have had difficulty locating that work, since I was using a diary format at that time, mixing up this and that, and reporting in reverse chronological order.\nhttps://shroudofturinwithoutallthehype.wordpress.com/2015/08/17/is-the-shroud-of-turin-really-just-18-years-short-of-its-2000th-birthday-see-this-blog-for-a-daily-acerbic-overview-of-current-wrangling-currently-2015-week-34/\nThat work turned up some interesting possibilities for explaining the weird properties of TS image fibres, like that half-tone effect you mention, the discontinuities etc which I tried to explain in terms of endogenous oil-seepage inside or between fibres (more likely between). I’m  now more inclined to think it washigh temperature  liquid Maillard products that were migrating, depositing yellow or brown high molecular weight melanoidins as they went that bond strongly, indeed irreversibly to the surface of the linen fibres, maybe penetrating the interiors too.\nI shall need 24 hours in which to refresh my memory on all the tricky detail. Be warned that my microscope is very basic, and not well suited to viewing 3D threads and fibres with its limited depth of field. I’ll be back, hopefully tomorrow, with a summary of findings that will try to address the main points you raise.\nThanks again for the interest.\n","date":"July 21, 2016 at 9:15 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7497","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Or, put more simply, a contact “toastograph” (which surely beats hands down that awful ‘crustograph’ offered earlier). The only drawback is that “toastograph” suggests the kind of Mark 1 heating regime proposed initially, i.e. baking/roasting of flour-imprinted linen in an oven. It doesn’t really fit with my newer Mark 2 heating regime, details of which I’m still withholding for reasons that may or may not be apparent to those who visit (or, more pointedly, don’t visit) this site for updates on an ongoing project, now into its fifth year.\n","date":"July 21, 2016 at 8:27 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7491","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"New accompaniment to blog title:\nNo, it’s not a photograph, primitive or otherwise. It’s almost certainly a medieval ‘biothermograph’ made by flour-imprinting a human subject or bas relief onto linen, then developing the negative image with heat (Maillard browning reactions).\n","date":"July 20, 2016 at 10:44 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7488","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"A  medieval  ‘biothermograph’ – a step on the road to photography?\nThe “bio” refers to the flour imprinting medium, and indeed the imprint-receiving flax-derived linen too. The “thermo” refers to the essential second-stage, post-imprinting heat-development, making the white imprint turn a more easily visible yellow or brown as a consequence of Maillard sugar-protein reactions.\nA fuller description would be a  “contact biothermograph”, thus stressing there’s no ‘action at a distance’, i.e. across air gaps: no direct physical contact, no image.\nYes?\n","date":"July 20, 2016 at 9:24 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7486","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"In the first instance it’s a  Maillard ‘crustograph’ making an analogy with the brown crust that forms on bread as a result of Maillard sugar-protein reactions in the oven. However, the final attenuated, and indeed scarcely visible image, deploying present novel  – or as I prefer to think, rediscovered – technology is maybe better described as a residual soap/water- and abrasion-resistant ghost image.\n","date":"July 20, 2016 at 7:14 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7485","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Contact melanoidogram (final attenuated washed image, after removal of heavy encrustation)?\n","date":"July 20, 2016 at 3:17 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7483","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Something acronymic? Like “NIFTY” technology?\nNegative Imprint, Flour, Thermal Yellowing.\nNo?  Oh well, let’s keep trying…\n","date":"July 19, 2016 at 12:14 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7479","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"An essential first step that’s urgently needed (if the present ideas are to stand any chance of entering the public domain) is a catchy name for the technology employed. “Flour imprinting’ doesn’t really do the business, does it, given there are no precedents? All one would do is create a Catch 22 situation (no newcomer’s understanding of what the term means on first acquaintance, no point in encouraging first acquantaince if the term is not understood).\nThere’s little encouragement to be had from listing the more technical terms  specific to the technology deployed: Maillard reaction, non-enzymatic browning reactions, reducing sugar/protein interaction, melanoidins etc. Simpler terms like “scorching”  are too ambiguous, inviting confusion with the earlier hot-tempate technology that attracted so much flak, and which was dispensed with once the need for a thermal-sensitizer (white flour) was fully appreciated.\nHelp…\n","date":"July 19, 2016 at 8:21 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7478","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Have just discovered this 1972 paper (short, too short summary) from a pair of UK brewing scientists, describing colour spot tests for Maillard reaction products (and any polyphenols that might be there too):\n\nNo need to worry about polyphenols where linen is concerned. They are the products of enzymatic browning reactions, as seen on the cut-surface of  apples etc. Maillard products formed at high temperature, as in my model system, are by definition products of non-enzymatic browning , i.e. chemical reactions between amino groups and reducing sugars).\nI shall try to get hold of the two chemicals needed for the Maillard spot test (ferric chloride and potassium ferricyanide) and try them out on my thermal imprints. (The paper omits to say what colour to expec!t). It will then be necessary to see whether Adler and Heller ever included them in their battery of spot tests under 1978 STURP auspices, though I doubt it. If so, and if I can perfect the test, it could form the first step in devising a more sophisticated procedure for detecting and confirming the presence of Maillard products on the TS itself,  possibly needing a STURP Mk 2 (internationally- constituted next time) or as I would prefer a postscript to STURP MK1 (requiring a special plea to the Vatican/Turin trustees to allow the job to be finished, especially as there are both pro- and anti-authenticity narratives that both posit a Maillard reaction – mine and  STURP’s sadly now passed-on Raymond N.Rogers’ !).\nPostscript: Total phenols (and Maillard products it would seem) are measured as Prussian Blue. Mechanism? The phenols reduce the potassium ferricyanide component of the reagent to potassium ferrocyanide. The latter then reacts with the ferric chloride (acidified with HCl) to form Prussian Blue. For quantitative work, the absorbance of the Prussian Blue is measured at 700nm.\n","date":"July 15, 2016 at 1:08 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7464","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Another successful day at the coalface of experimental sindonology. \nOne of the practical snags where imprinting off real people is concerned is how one ensures that  the frontal image aligns exactly with dorsal image on the long axis. That’s easier said than done if imprinting off a single person, whether doing both sides simultaneously or sequentially.\nSolution: don’t use one person – use two of roughly the same height and build. Get them to lie head to head on a sheet of sacking or similar with the required gap between the heads, one face down, the other face up, and then get them to adjust their positions as instructed till in perfect alignment. One can then sprinkle white flour (imprinting medium)  from a sieve onto their upper surfaces, then pull out  and dispose of the sacking with surplus flour from the edges, then cover the elevated contours of both subjects with wet linen and imprint manually.\nI have modelled the above using my brass crucifix to represent one subject (frontal) and plastic toy (see banner) the other (dorsal), both fortuitously having roughly the same size.\n\n The resemblance of the final heat-processed image with the Lirey badge and TS is striking. As previously stated, one can also see how the ‘baked in’ creases of the TS result from rolling up the imprinted linen with blank spacer linen to get a compact package for heat-processing and resulting Maillard colour development (final golden-brown image). In fact the ‘twin track’ ‘crease’  is reproduced almost exactly (two brown bands of unequal width separated by a pale central zone, as described many moons ago in an earlier posting that argued the case, correctly I now consider, for those ‘baked-in creases’).\nTime maybe to go to press after 4.5 years model-building R&D? But where? Whom?\n","date":"July 10, 2016 at 5:57 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7438","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Sudden brainwave: the image of the man on the Lirey pilgrim’s badge, circa 1355, corresponding with the Shroud’s presumed first public display, is a BAS RELIEF.\nhttps://shroudofturinwithoutallthehype.wordpress.com/2012/04/24/comparison-of-lirey-badge-cluny-medal-depicting-the-shroud-of-turin-in-the14th-century-with-the-1865-forgeais-drawing-for-open-discussion/\nEver wondered why? Up until now I’ve assumed that was because someone making a medallion felt obliged to show the man on the shroud as semi-3D, despite being a flat image on the linen, in order to do justice to the semi-artistic metal-casting medium. Yet that’s an awful lot of  extra work in making the mould, having to scoop out the soft stone and smooth the hollows of sunken relief (recalling that final raised relief has to be generated ‘in reverse’ so to speak).\nBut what if the Mark 1 Shroud image, the one that Bishop Henri de Poitiers heartily approved initially, WAS a striking and indeed enigmatic bas relief, obtained accidentally by use of a particular means of thermal processing, still used to this day I might add, and which spawned the Lirey badge to advertise that novel and unexpected outcome?  Later, when the image deteriorated (flaked off etc) the make-or-break decision was made to wash and gently abrade with more soap, when it was then discovered there was a permanent ghostly image still there, one that was deemed ‘authentic’ looking. Thus we have the Mark 2 Shroud, for which we also have the Machy mould with the added word SUAIRE  (“shroud”) beneath a Jesus-like face (Veronica-reminiscent), and it was the re-display of that icon-morphed-into-‘genuine’-relic that caused the Bishop to erupt in fury, perhaps suspecting it had all been pre-planned and that he was the fall guy.\nYup,the scenario proposed  may all seem a little far-fetched at first sight, but I for one consider it fairly plausible that my not-so-new technology was indeed deployed some 6 centuries ago to create the kind of bold and arresting bas relief image that you see on the main posting, and that the final attenuated image was not part of the initial plan. The Shroud image we see today was an ‘accidental’ forgery, maybe too good an opportunity for the recently widowed Jeanne de Vergy to throw away, encouraged maybe by the 5 or 6 clerics-cum-artisans of the de Charny chapel in tiny Lirey founded by her knightly husband from the seedcorn gift of land from his warrior monarch.\n","date":"July 9, 2016 at 7:54 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7434","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"The one negative about the new thermal-processing regime (details of which I’m still not ready to reveal just yet) is reverse-side coloration. Leaving aside questions of whether that is or is not inconsistent with the TS image – about which there are conflicting statements-  or whether it’s simply a matter of cloth thickness (my linen is VERY thin!) I’ve been exploring novel strategies for reducing reverse-side coloration.\nThe one that has yielded unexpected dividends these last few days came through investigating a different question – like how to obtain a good imprint when heating a rolled or folded up length of linen – compactness being an advantage in any heating system that involves a 4.4m length of linen.  Simple rolling up was not an option, since it put the flour imprint in direct contact with the reverse side. So an EXTRA sheet of ‘blank’ linen was placed over the imprint before rolling up. Hey presto, reverse-side coloration disappeared almost entirely. But there were intriguing new effects seen, like  (1) “baked-in” creases due to kinking of the primary linen on rolling up, like (2) image-fibre breaking and “tufting’ due to adhesion as a consequence of the two sheets of linen becoming stuck together by the ‘cooked’ imprint during heating, and needing to be pulled gently apart. \nIt remains to be seen whether these new observations, chiming with comparable oddities re the real Shroud (creasing, tufting) are relevant or not. What is clear is the wealth of technological possibilities that is opened up in the new ‘tweaked’ thermal processing system. That detached/reattached “side strip” is also simply explained…\n","date":"July 9, 2016 at 9:10 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7433","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"To those who might be wondering who Liz Leafloor is (with her most gratifying response to my upgraded model), here’s a tip. Put (shroud of turin) into Google. After the shroud.com site, and after the inevitable wiki return, you may well see one of two Shroud postings that have appeared recently on the ancient-origins site. Liz is presently Acting Editor while her colleague takes maternity leave. Liz was instrumental in allowing me to publicise my new thinking re Silbury Hill.  I had emailed Liz earlier today, flagging up my new improved Shroud model, divulging some corroborative details from Shroud history,  and specifying the all-important change in thermal processing in place of oven-heating  that I’m not quite ready yet to release here,\n Houston, we have a problem… Think seed. Think barren soil on which nothing grows… Sindonology does not function like any other ‘academic community’ (?) that I’ve previously encountered. Why not? Sindonology has an attitude problem…Sindonology has a TOTALLY fixed focus. Sindonology is concerned purely with dissing the radiocarbon dating, despite participation of three different labs and the British Museum. Sindonology is concerned entirely with promoting the flimsy case for authenticity… Any resemblance between Sindonology and an academic community is purely coincidental.\n","date":"July 5, 2016 at 9:51 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7426","author":"Colin Berry","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Thanks very much for the kind mention, Colin. Ancient Origins was happy to be a part of bringing your research to new audiences. Hope to see more of your work in future!\n","date":"July 5, 2016 at 10:14 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7427","author":"Liz Leafloor","site":"colinberry"},{"title":"Final posting in previous stodgy site format: “Shroud of Turin – and now for a retrospective look at the boring old (systematic) science”","post":"Hi Colin! Great work – I can’t see a better theory for the creation of the Turin Shroud than the one you’ve demonstrated here. This makes total sense, and the results have that unnerving after image that what I believe makes the shroud so intriguing to people. I was surprised the image survived washing, and that familiar remaining ‘ghost’ says it all.\n","date":"July 5, 2016 at 5:44 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/06/24/shroud-of-turin-and-now-for-a-retrospective-look-at-the-boring-old-systematic-science/","cat":"uncategorized","id":"comment-7425","author":"Liz Leafloor","site":"colinberry"}]
