[{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"From that wiki entry: “He was also on the editorial board of Thermochimica Acta from the first issue of this journal in 1970 (also the very first paper published in the first issue of this journal is authored by him) until his retirement in 1988.\nWhat’s that if not a long-term editor, Dan – 18 years! Oh, and I didn’t suggest, or even try to hint, that he was ever sole editor, as suggested by your “THE long term editor”. Scientific journals usually have editors-in-chief, but I did not try to suggest that Raymond Rogers ever fitted that description, not knowing, or even suspecting that to be the case.\nAs for “reevaluating my position”, I’m still uncertain as to what boundaries of Yankee propriety or old world courtesy I have crossed (but then, we in the Old World dropped the insincerity-dripping courtesy thing about the time of Waterloo and the Corn Laws).\n My main beef was that the, er, beef was not in the paper, but attributed to apparently unpublished work by one of his colleagues.presumably still beavering away at his Los Alamos place of work, with nothing I can find in the literature re an expertise or even involvement in lignin or botanical research. \nHow on earth did that paper ever get past the Thermochimica Acta referees? Yes, I know he was a dying man, but, but  …  his final paper was a highly publicised landmark refutation of the radiocarbon dating and is regularly cited here as the gold standard in shroud research   Those who question it find themselves described as mice in comparison with a giant. \nListen ye here: if Ray were still alive, I’d invite him to my local, and kindly propose some alternative metals to gold from the Periodic Table…then buy him a drink. maybe two – and change the subject.\n\n","date":"January 31, 2014 at 3:38 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-75486","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"Progress! We’ve gone from Rogers being a total scientific fraud, to a dying codger desperate to impress his friends, to a naive fool who was duped by some nefarious Shroudies, to this…a sloppy researcher out of his element who’s last article shouldn’t have been accepted but was by some overly-compassionate referees – in deference to his relationship to the journal’s legacy.\nRogers seems to be almost as enigmatic as the Shroud itself!\n\n","date":"January 31, 2014 at 5:08 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-75500","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"I know you are a keen observer of the flow of sceptical opinion on this site, David.\nSo please enlighten me. Is what you have written a description of the sum total of sceptical opinion in general re Raymond N Rogers, or of my own in particular?  Maybe your (encyclopaedic?) memory is better than my own.\nYou’re right about one thing. I’ve been sceptical about Raymond Rogers’ objectivity from the word go. One of my first experiences on this site was having its host quote back to me, as if holy writ, what St. Raymond had to say on the idea that the TS might be a scorch. The flaws were apparent very quickly – as was the tiniest hint of a lack of strict scientific objectivity on Rogers’ part. Yet this is the middle-ranking explosives safety expert we are asked to regard as a scientific “great” (thank you John Klotz). \nObjective scientists are usually hesitant to go building bullet point browbeat-your-opponent-into-submission dossiers. Rogers was increasingly given to doing that, post 88.\n\n","date":"January 31, 2014 at 5:40 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-75507","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"As a relative newcomer to all things Rogers, I see both sides. He is a lion to some, a goat to others. You know where you stand, as do others. If you want a balanced appraisal (so not just aimed at you) it’s this; you folks are amost as obsessed with Rogers as with the Shroud and it would do you good to put Ray’s work on the shelf for a bit and move on to other avenues.\nThis avenue is bearing no fruit.\n\n","date":"January 31, 2014 at 5:49 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-75515","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"Colin, I’ll concede that I threw in the “the” in “the long term editor.” It was careless for I meant “the wording long term editor.” But you’re playing semantic games.  Thermochimica  Acta currently has three editors and a long list of people serving on an editorial board. Actually, there is no editor in chief, to use your wording. And as I look at several journals I find similar pattern. The fact of the matter is that Rogers served the community by being part of what is a board not a position, probably well and probably very honorably. There was absolutely nothing wrong with him submitting to that journal. There was nothing wrong with the journal publishing because of his prior association. Your criticism is simply petty as I confess mine was of Jull. Or do you think Jull and his journal was wrong?\n\n","date":"January 31, 2014 at 5:43 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-75509","author":"Dan","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"I don’t expect you to have an encyclopaedic memory, Dan, but I do recall many moons ago saying that I had no objection to a journal editor submitting to his own journal. One of my ex-bosses at FMBRA – whose title as I recall was Director of Fundamental Research, also founded a scientific journal (J.Cereal Science) and one of his papers published in his “own” journal in conjunction with a close colleague of mine is now highly ranked (clue: “friabilin”).  If you observe closely you will see that I have not mounted a personal attack on Raymond Rogers. The criticism is specifically aimed at the sloppy or undocumented, unreferenced science, and the extraordinary and ill-judged decision of Thermochimica Acta to publish that paper. \nI am by no means the first to criticize that decision or that paper and its tendentious claims.  But for the trolling you allow on this site from John Klotz and others I would not have bothered researching further into the credentials of that scientific “great”,  Mr. Raymond N.Rogers, thermochemist specializing in safety testing of chemical explosives.  \nSpeaking for myself. I am not a great, but I will not allow your commentators to get away with describing me as a mouse. I too am, or rather was, a middle-ranking scientist, and was content to be just that (putting my family’s interests before my own).\n\n","date":"January 31, 2014 at 6:21 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-75525","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"I don’t want to get into a bunfight over the way Thermochimica Acta runs its internal affairs, Dan, being content merely to point out that Rogers had been associated with the journal in some kind of editorial capacity from the very start, and chose it to publish his 2005 paper with scarcely any thermochemical content, at least not his own, and with crucial data withheld. It’s hard to imagine the journal would have accepted that paper had he not been editing its papers for some 18 years and/or the editors(s) knew or suspected he did not have long to live.\nOh, and there was an Editor-in Chief, at least in the early days, while still a relatively small operation, hunch being confirmed by a quick google.\nhttp://www.researchgate.net/publication/232341908_How_thermochimica_acta_began_Some_recollections\n“The early history of Thermochimica Acta is described by the Editor-in Chief”\n\n","date":"February 1, 2014 at 11:01 am","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-75727","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"P.S. Here here is – W.W Wendlandt, a newspaper clipping from the very same year  he founded Thermochimica Acta with a Ray Rogers paper being the very first to appear – according to wiki.  T\nhttp://pubs.acs.org/doi/abs/10.1021/ac60295a770?journalCode=ancham\nThat must have made him  (Rogers that is) someone special, someone held in high esteem thereafter, someone who could be pretty certain that his last paper, produced long after retirement, would not be spiked. But it should have been – the absence of any kind of objectivity is plain for all to see. He simply set out to shoot down the radiocarbon dating by substituting highly inferior methodology, lacking proper validation, and using specimens of dubious provenance.\n\n","date":"February 1, 2014 at 11:17 am","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-75732","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"Colin,\nI will not discuss now the details of your critique.\nMoreover, I agree with you that some important data (mainly the data of Stanley T.Kosiewicz) are missing in Rogers’ paper.\nLet’s go now to the basic observations.\nEven if you reject the Rogers’ lignin/vanillin-CLOCK as not proved by the data we have, a hard fact remains:\nThe Shroud’s flax fibers did not give “the usual chemical spot [Wiesner] test for lignin (..)” (Rogers)\nThis test was performed by Rogers on his own samples and by Adler/Heller on their samples with the same negative results.\nHowever, according to Rogers, the “RAES THREADS, the Holland cloth, and all other medieval linens gave the test for vanillin (…)” (Rogers’ paper, p.3).\nLet’s forget for a moment the question of the clock (dating).\nEven if you disagree with Rogers’ interpretation -the “clock”- the fact that the Raes linen fibers gave a clear Wiesner test while the Shroud fibers did not give the same test remains.\nHow do, you explain that ?\n\n","date":"January 31, 2014 at 6:31 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-75528","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"Hello Thibault. I have been assembling that rather difficult posting in stages, given the complexity of the subject (I’m sure I do not need to tell you that lignin  is complex, and so is the chemistry of its “simple” spot tests, and more so its breakdown). You will note that I said there was more to come, and you have correctly anticipated the key question, namely, that no matter what deficiencies exist in the underlying methodology or its reporting, that need not detract from the paper’s final conclusions, namely that there is a clear difference in Shroud linen, relative to Holland cloth etc, that can be linked to the age as determined by the lignin characteristics.\nTell me this. What is the use of a clock that is either running, or has stopped completely? That is the situation with the Shroud linen. We are asked to believe that it’s the absence of Wiesner-reactive lignin that is the reason, ie that it is incredibly aged.\nSorry, I don’t buy that. The “vanillin clock” is so poorly documented that I decline to believe that the absence of a positive test is necessarily to do with age.  It could be due to any number of factors – other than age – that affected the Shroud before 1534 (approx) when the Holland cloth was attached. to patch the burn holes. What about those references to earlier attempts to test the permanence of the Shroud image by boiling in oil etc? (Sorry, do not have links to hand) They could have oxidised the more susceptible coniferaldehyde end groups of lignin too, resulting in a negative Wiesner test.\n(Coniferaldehyde – note – with 3-carbon propanal side chain – NOT vanillin as stated by Rogers which is 1-carbon only).\nSorry, but Rogers went looking for data to support a preconception, and filtered out anything that did not suit. That’s agenda-driven science. I’m not condemning it outright – since it keeps real scientists on their toes. I’m just fascinated by the fact that the two can somehow manage to co-exist (uneasily) and offer an alternative if dubious route by which science can make progress. But how much time is wasted, fielding bad science (and Rogers’ paper WAS bad science)?.\n\n","date":"January 31, 2014 at 7:05 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-75540","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"PS. Another thought struck me a few minutes ago of another factor, other than age, that could account for loss of  colour with phloroglucinol in the Wiesner test. According to a literature reference I can supply, phloroglucinol reacts with the free aldehyde group of coniferyaldehyde (forming an oddball pinkish cationic species). So anything that blocks that aldehyde will probably prevent the reaction. A classic way of blocking aldehyde groups is to form addition products with bisulphites (essentially dissolved sulphur dioxide gas).  What’s more the removal of lignin from wood in papermaking relies on that same reaction between SO2/HSO3- and free aldehyde functions.\nI’m sure I need hardly tell you that there is more than one way in which SO2 etc could have come into contact with the Shroud in its early history. It could have been used perhaps to bleach yarn (it’s the classic method for bleaching straw hats with their high lignin content, though I’m less certain about its effects on linen). Alternatively, someone may have burned sulphur candles in the vicinity of the Shroud – known from antiquity as a means par excellence for fumigation to kill insects and their larvae etc. \nSomeone here was saying just a day or two ago that Rogers’ chemical clock was just as accurate as radiocarbon dating. Bless!\n\n","date":"February 1, 2014 at 3:41 am","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-75633","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"Thank you Colin,\nSome years ago, I studied in depth the complex problem of lignin/vanilin.\nI think you’ll be surprised.\nTomorrow you will know.\nThank you for your patience.\n\n","date":"February 1, 2014 at 4:28 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-75778","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"Second afterthought. Someone decided to fumigate the reliquary (see my earlier comment). They removed the TS, then inserted a lit sulphur candle. Later the candle was removed, and the TS replaced, with its long sides folded in towards the middle before folding or rolling. Residual SO2 made better contact with the central regions of the TS than with the edges. So the reactive aldehyde groups of lignin in the initially peripheral Raes threads were better protected from the SO2 than the more central threads.\nI’m not suggesting this was the actual process that gave the difference between Raes v the rest, but it’s an indication of the uncertainties that attach to using a chemical as distinct from radioactive clock, where one is at the mercy of environmental conditions that one can only guess at, as I am guessing right now.\n\n","date":"February 1, 2014 at 4:17 am","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-75639","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"Some of you have heard this story before but it bears repeating in this context.\nIn late 2001, Sue and submitted to Radiocarbon our Orvieto paper. In a letter dated January 1, 2002, Dr. Timothy Jull, editor of the journal Radiocarbon, and one of the scientists from the University of Arizona laboratory that dated the Shroud in 1988, sent Sue and me a reply regarding the submission of our C-14 paper. For those not familiar with the process by which papers are published in scientific journals, the editor chooses various reviewers, usually anonymous to the author and supposedly objective, who then make suggestions to the author(s) on how to make the paper better. After changes are made, the reviewers read the paper again, and make their recommendations to the editor as to whether the paper should be published or not. However, the final decision is in the hands of the editor. The review of our paper was out of the ordinary insofar as the reviewers were revealed to us, something that normally doesn’t occur. They were all originally directly involved in the specific topic of our paper, the 1988 Shroud C-14 dating. It was our contention that the C-14 dating was skewed due to the presence of a sixteenth century repair. Here is a list of the reviewers of our paper:\nPaul Damon, head of the Arizona laboratory that participated in the 1988 Shroud dating\nJacques Evin, French C-14 expert present at the 1988 sample-taking\nThe late Gabriel Vial, French textile expert present at the 1988 sample taking\nFranco Testore, Italian French textile expert present at the 1988 sample taking\nHarry Gove, inventor of the AMS radiocarbon dating method, who had literally bet a companion that the Shroud was medieval and was heavily involved in various aspects of the dating\nWhat were the chances that any of these men, each of whom would publicly look bad if our theory were correct, would want to see our paper published? The answer was obvious. Needless to say, our paper was not accepted. Most interesting was a comment by Evin, who wrote in the review sent by the editor to Sue and me: \nThe authors, who, for several reasons, are convinced that the shroud is authentic, want to publish an article in Radiocarbon only to introduce a doubt about the dating. All people involved in the sampling and in laboratory analyses, will be very angry with these suspicions turning on so an important mistake or a misconduct…\nEnigmatic comment by Evin, is it not?\nHow fair or ethical was of it of Radiocarbon to use reviewers who were directly or closely involved with the Shroud C-14 dating?\n\n","date":"January 31, 2014 at 8:48 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-75556","author":"Joe Marino","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"Your SO2 contamination re Wiesner test looks as hypothetical as Jackson’s CO contamination re C14 content, at least he thought contamination would be homogeneous (whereas Wiesner test is negative on any other location on the shroud).\nThe model is basic (arrhenius law), we don’t have the data but the figures (2) of the estimated parameters, anyone may reproduce the experiment and compare his results.\nI don’t think either it is a very robust dating method, but what is significant is the discrepancy between the C14 corner and the other parts of the shroud.\n\n","date":"February 1, 2014 at 7:57 am","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-75688","author":"anoxie","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"I for one could never fathom Jackson’s CO hypothesis, knowing of no conceivable component in linen with which it could form chemical bonds. Christopher Ramsay has confimed experimentally that CO does not interfere with radiocarbon dating. But aldehyde (-CHO) groups can and do form chemical bonds with SO2, provided some moisture is present. It’s one of the first functional group properties (common to all aldehydes in other words) that one learns in organic chemistry. I would not have mentioned it if it had no basis in fact. But please note the rider – my aim was to point out that functional groups in lignin that are sufficiently reactive to form chemical bonds with the Wiesner reagent are  by the same token sufficiently reactive to form chemical bonds with other substances in the environment, without one being aware of it (until one finds no colour with Wiesner’s reagent).\n\n","date":"February 1, 2014 at 9:13 am","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-75706","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"PS: am I not correct in thinking that “all those other locations” on the Shroud were sticky-tape samples, whereas the Raes threads were not. So one’s not comparing like with like. Who’s to say that the positive response with the Raes threads was not due to free vanillin (oxidation end-product). But free vanillin is lipid soluble, and may well have dissolved into the hydrocarbon adhesive of the sticky tape. Again, it’s just a theoretical possibility, but underlines once more the need for scrupulous controls.\n\n","date":"February 1, 2014 at 9:19 am","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-75709","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"There seems to have been no room for religion in Ray Rogers’ worldview, he had no axe to grind when working on the Shroud.\n\n","date":"February 1, 2014 at 8:33 am","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-75696","author":"Louis","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"Wondering where the contamination, vanillin or other anomalous material on the radiocarbon sample may have come from, last week I dyed some linen with madder root, using alum as a mordant. I didn’t boil my preparation, and it dyed (yes, linen does dye quite well, just not as well as cotton) a pale orange. This week I cut it up and experimented. The results are at http://i.imgur.com/KskjuLV.jpg.\nBelow a piece of undyed linen are the following:\nA – the dyed linen\nB – boiled in water for 10 minutes\nC – stirred in Molar HCl at 70°C for 10 minutes\nD – stirred in Molar NaOH at 70°C for 10 minutes\nE – all three of the processes above, separated and concluded with a thorough rinse in cold water.\nF – the dyed linen (kept as a spare).\nI do not know what exactly is left on piece E, and I expect that it would get fainter if the processes were repeated, but it is seems clear that the cleaning processes carried out by the radiocarbon labs may not have removed dye (as opposed to paint, which would have been removed). Of course the contamination is far too small to affect the radiocarbon dates much, although it might partially explain Riani and Atkinson’s chronological anomaly findings. It may also explain Rogers’s vanillin findings.\nNone of the samples fluoresces under UV light.\n\n","date":"February 2, 2014 at 8:55 am","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-75949","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"Honestly Dan, I don’t expect any non sentimentality from Colin when it comes to STURP members, scientists or anyone else.  He has lambasted Rogers (among others) when he was not able to defend himself.  It seems to me Colin simply doesn’t like Rogers.  He may pretend its scientific, but his character assaults of him in these blogs of which I am a witness gives him no credibility at all in the issue.  I will not listen to Colin.  There are many real scientists who can at least be honest and fair, even if they disagree with conclusions (anyone’s).\n\n","date":"February 3, 2014 at 8:56 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-76301","author":"Andy","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"If you don’t mind my saying, you seem fairly proficient in the character assault department yourself, Andy, especially as my comments regarding Rogers have been confined largely, if not entirely, to details of his science, with just occasional asides re the failure to maintain strict scientific objectivity on his part. He was, to put it colloquially, rooting for authenticity, albait a chemist’s version thereof, with chemical, rather than radiation or thermal imprinting. In other words, we were allowed to have any scorch we liked, provided it’s a Rogers’ approved chemical “scorch”.\nRay Rogers, to put it mildly. showed a distinct pro-authenticity bias and was clearly piqued when the radiochemical dating was announced. Maybe you consider my saying that to be “personal” or disrespectful to a dead scientist. I don’t, since the chief requirement one expects of any SCIENTIST given privileged access to the TS  and with no obvious specialist skills to contribute (why recruit a thermochemist, unless to investigate pyrolysis and scorching with an open mind?)  was transparent objectivity, whatever the underlying religious beliefs or otherwise.\nI am not going to respond in kind to YOUR character attack, Andy (Andy Weiss?). What I shall do is assemble a list on my own site of the numerous instances in which Ray Rogers simply got it wrong, of failed to properly support his often over-dogmatic assertions which again and again were more expressions of hunch or opinion, NOT closely argued science  See my recent post on the sloppy way that he employed the term “vanillin” that has since been adopted as the assumed gold standard in Shroud literature. But Rogers was NOT measuring vanillin.  He was supposed to be measuring components of undegraded lignin that were NOT vanillin – albeit with his simplistic unfit-for-purpose spot colorimetric reagent  (why did he not use his pyrolysis mass spectrometer?).\n\n","date":"February 4, 2014 at 3:27 am","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-76372","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"What documentation do you have that Rogers “was clearly piqued when the   radiochemical dating was announced?”  I’ve always heard that he completely   accepted the results.  He didn’t get back into the Shroud scene until 2000,   12 years after the dating.\n\n","date":"February 4, 2014 at 7:02 am","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-76423","author":"jmarino240","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"Sorry to be so long in getting back. Here’s a passage from his FAQ (pdf) with frequent references to “we” so refers to his thought processes presumably while still in close contact with fellow STURP members, probably prior to 1988/89.\n“From Page 13/19 from his FAQ\n“The Shroud is a structure composed of chemical compounds, and all of the main ones\nhave been studied in detail. They are published in chemical text books. Chemical analyses can yield considerable definitive historical information. All manipulations of the Shroud should be considered in detail in order to preserve as much information as possible.\nLinen-production technology has changed through the centuries. We have assembled chemical information related to the technology, and we have consulted textile experts who have done detailed chemical research that relates to the composition of the Shroud. Our detailed analyses suggested that the cloth had been prepared by technology common before about AD  1200. It best resembles linen made in the Near East during Roman times. These results do not agree with the date published in 1989.”\nSo here was a chemist relying on vague poorly- or undocumented evidence re “linen technology”, referring presumably to bleaching practices, those starch coatings etc, on which to go speculating on a Roman-era provenance, Leaving aside the propriety of using such wishy-washy ill-defined evidence on which to go speculating about age, that final reference to “Roman” and “Near East” strikes me as evidence of systematic bias in his thinking about the Shroud’s  age, so yes, I do think that Rogers’ reactions on hearing the radiocarbon date would be one of pique. He also had a heavy investment in his impurity coating idea, linked to Pliny-quoted Biblical-era technology, since without that, and apparently unaware of the PCW, he had nowhere else to go except in the direction of Maillard or other allegedly low-temperature chemistry which of course was all part of an authenticity narrative.\n\n","date":"February 4, 2014 at 6:03 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-76565","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"You changed from “was clearly piqued when the radiochemical dating was   announced” to “…I do think that Roger’s reactions on hearing the radiocarbon   date would be one of pique.”  You went from stating a fact to stating a   speculation.  And Rogers was biased?  Nothing you quoted proves  your initial  statement of fact nor does it prove your subsequent  speculation.  He’s just  stating a possible conclusion based on the  evidence.  You used the phrase  “strikes me as evidence of systematic bias  in his thinking about the Shroud’ s age,” which again is just speculation on your  part.   You never even met the man.  You’re making assumptions about him with  only  your beliefs to back them up.  Rogers was a man of integrity.   When Sue  and I made our hypothesis about the invisible reweave, Rogers  considered us  part of the “lunatic fringe.”  How hard do you think it was  for him to come  out publicly to say he believed we were right?  Very few  scientists would  have done that.  It’s too bad he’s still not here to  defend himself about  the statements being made about him..   At this point, I think I’ve spent quite enough time on this exchange.\n\n","date":"February 4, 2014 at 8:00 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-76593","author":"jmarino240","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"That was clearly not a character assault.  You did that yourself, Colin.\n\n","date":"March 2, 2014 at 8:08 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-84246","author":"Andy","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"Andy, last week I received a cortisone injection in the spinal canal of the low back for sciatica. I never knew an injection that went on and on for several minutes could be so painful. It worked slowly. A week ago, walking was the act of dashing to the closest chair. Now I’m walking the dog and enjoying it. Colin is an epidural-like pain in the butt that goes on and on. But he makes a wonderfully useful contribution to the discussion. That doesn’t mean I accept much of anything he has to say. I don’t. Not yet. I’m open to being convinced. He makes me think, however. For instance, how sure are we that there is no image underneath bloodstains?\n\n","date":"February 4, 2014 at 4:34 am","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-76391","author":"Dan","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"You got me thinking again about blood stains, Dan. I know the blood question has been discussed many times here. Dr. Kearse often provides great insights. Has this angle been discussed: do we have examples of medieval-era blood on clothing artifacts that can be compared to the blood on the Shroud? Are there common properties we see in medieval-era blood that apply equally to the Shroud, such as speed of decay, dryness, etc? Is there, in essence, a way to discern the approximate age of blood based on its degradation?\n\n","date":"February 5, 2014 at 11:48 am","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-76761","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"Glad you can walk the dog again, Dan.  No doubt Colin is thinking and gets others doing the same, which is good, but his character assaults he has made completely tuned me out from what he has to say.  It’s a shame really, but I don’t have the time to waste. I am far too busy.\n\n","date":"March 2, 2014 at 8:06 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-84244","author":"Andy","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"I have never thought the evidence for the ‘bloodstain first, image second’ hypothesis was particularly convincing. Shroud 2.0 does not show that the exposed areas of shroud where bloodstains have rubbed off are paler than the image upon which they sit, although Thibault has explained that the colour under the blood may be due to serum, which is fortuitously very similar to that of the image. Heller, I think, having determined that the image was due to degraded cellulose, found that image fibres showed such degradation, but blood fibres, after the blood had been dissolved away, did not. This is the principal evidence for the ‘blood-first’ hypothesis. However, Rogers’s more recent theory, that the image is wholly on a thin coating on the fibres, and not a part of the structure of the fibre itself, completely contradicts this claim. Highly respectable scientists both of them were, but their views are contradictory – one of them, at least, is wrong.\nAnd then, of course, if the image was made by laying something onto the cloth, and if that something, painting, bas relief or actual body, was painted with blood before being laid, then the blood would have suppressed image formation, and the ‘blood first’ hypothesis would be justified.\n\n","date":"February 4, 2014 at 8:29 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-76599","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"\njmarino240 :\nYou changed from “was clearly piqued when the radiochemical dating was   announced” to “…I do think that Roger’s reactions on hearing the radiocarbon   date would be one of pique.”  You went from stating a fact to stating a   speculation.  And Rogers was biased?  Nothing you quoted proves  your initial  statement of fact nor does it prove your subsequent  speculation.  He’s just  stating a possible conclusion based on the  evidence.  You used the phrase  “strikes me as evidence of systematic bias  in his thinking about the Shroud’ s age,” which again is just speculation on your  part.   You never even met the man.  You’re making assumptions about him with  only  your beliefs to back them up.  Rogers was a man of integrity.   When Sue  and I made our hypothesis about the invisible reweave, Rogers  considered us  part of the “lunatic fringe.”  How hard do you think it was  for him to come  out publicly to say he believed we were right?  Very few  scientists would  have done that.  It’s too bad he’s still not here to  defend himself about  the statements being made about him..   At this point, I think I’ve spent quite enough time on this exchange.\n\nWith respect, it is you who is now going beyond the evidence (which is easy I grant you to do in the heat of the moment and an occupational hazard of posting online in real time). You have slipped in that term “integrity”. (“Rogers was a man of integrity”). When have I ever questioned the man’s integrity? I have no recollection of doing so, in the sense that he would deliberately set out to collect or disseminate data that he knew were wrong. What I have suggested is that he betrayed an underpinning bias (“preference”, “leaning” etc etc in common parlance) which is something entirely different, a human attribute that we are all prone to and which silently and unobtrusively kills science stone dead. He displayed that when he suddenly began (mis)quoting Pliny and lumbering the Shroud literature with his references to starch coatings, saponins etc etc, displaying a total blind spot for the PCW, and frankly derailing the entire STURP project as far as image chemistry was concerned. Nope, I don’t question his integrity. I condemn his embrace of a paradigm that had scarcely a fact to support it (which did not seem to greatly trouble him).  It favoured authenticity, at least place and time (Near East, Roman era) because of his inability to step outside of a fundamental pro-authenticity bias. \nAnd that I am afraid is what Rogers – and quite a few other of the largely self-selected STURP did – they killed the image (AND blood) science stone dead through their BIAS, through taking authenticity as the default position, through wasting time and effort on excluding the TS as a painting when the focus should have been on investigating its resemblance to negative photographic image, and through premature and highly unrealistic  SELF-INDULGENT model-building (aka building castles in the sky). Somebody had to say it.\nLater today, I propose to post a summary of my attempts to integrate all the crucial evidence into my Templar/pyrographic tribute hypothesis, and later post a copy to my own site, inviting further comments at leisure over there (for reasons that should be obvious).\n\n","date":"February 5, 2014 at 3:36 am","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-76675","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"Read your 2nd last paragraph again. Then read your last paragraph again. Are you not also guilty of that which you accuse of others?\n\n","date":"February 5, 2014 at 8:05 am","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-76718","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"No, not guilty you honour. There is a huge difference between imposing fanciful ideas on others, unsupported by a reasonable body of fact, and the disciplined model building that attempts to be as inclusive as possible of more secure findings, patiently refined over the weeks and months, and inviting queries and objections every step of the way as I have in nigh on 200 postings. If folk on this site refuse to recognize orderly and systematic model-building when they see it, and/or fail to understand that it’s intended purely  as a model, not an attempt to brainwash or provoke, merely to offer a possible solution to multiple enigmas, then this site becomes merely a billboard. I use it to give occasional updates on what perceive as progress, but duck out of discussion if it means becoming an Aunt Sally target for those who resent questioning of authenticity (while making no move to have the radiocarbon dating repeated or argue for rival models).\nMy priority now is to finish writing a summary of my pyrographic imprinting/Templar hypothesis, but thanks to Dan Porter’s attempts to confine me to the chemistry (akin to telling a climate scientist to confine themselves to meteorology)  have changed my mind about posting it here first.  Here’s me signing off (yet again) for a breath of fresh air.\n\n","date":"February 5, 2014 at 9:09 am","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-76732","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"\nThibault HEIMBURGER :\nThank you Colin,\nSome years ago, I studied in depth the complex problem of lignin/vanilin.\nI think you’ll be surprised.\nTomorrow you will know.\nThank you for your patience.\n\nAugust 17, 2012 at 3:15 pm\n\nThibault HEIMBURGER :\nDear all,\nSome weeks ago, you could read an old paper from me in which I concluded that the Maillard reaction was very likely not possible in the first days after the death of the TSM simply because the necessary heavy amines postulated by Rogers (Putrescine and Cadaverine) were missing.\nMore recent papers fully confirm that. BUT for reasons I’ll explain later, i know think that it is not impossible that other heavy amines (not known by Rogers) may work.\nI’ll also will try to answer to some of your comments.\nMore later.\n\nThese are two critical points, i can wait 2 days, 2 years or even 20 years.\nThank you,\n\n","date":"February 5, 2014 at 7:00 am","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-76707","author":"anoxie","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"Never mind anoxie. This doctor’s waiting room is well supplied with reading matter.  It’s some of the other patients who worry me (the ones who look as if they’re about to burst a blood vessel).\n\n","date":"February 5, 2014 at 7:15 am","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-76709","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"I’m not in the waiting room. \nThibault is just going back to Rogers’ (counter-)intuitive theory. Next years will only confirm he fad found the right track.\nScorch is a dead end.\nLight is sci-fi.\n\n","date":"February 10, 2014 at 3:03 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-78101","author":"anoxie","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"Oh did I love this comment from Anoxie!  I agree 100% with all that was said…\n\n","date":"February 10, 2014 at 4:46 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-78126","author":"Anonymous","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"Anoxie, thank you.\nNext week, I’ll have more time to answer.\nIf you wish to contact me, just ask Dan my private email address.\n\n","date":"February 10, 2014 at 4:38 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-78122","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"Important question to all of you:  What can best explain (rationally speaking) the ultra-superficiality of the shroud image everywhere on the cloth, no matter if we look at a very dark zone or a very light one?  Wouldn’t be the presence of a thin film of something that was mainly concentrated on the top-surface of the cloth and which reacted chemically with another something coming from a dead and crucified body?  If we take into account all the pertinent data coming from the Shroud (INCLUDING THE BLOOD AND SERUM STAINS EVIDENCE), I think the answer is YES.\n\n","date":"February 10, 2014 at 4:51 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-78129","author":"Anonymous","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"I need to write down again my second question: Wouldn’t be the presence of a thin film of something that was mainly concentrated on the top-surface of the cloth and which WAS THE ONLY THING TO REACT chemically with another something coming from a dead and crucified body IN ORDER TO EVENTUALLY PRODUCE THE YELLOW COLOR THAT IS 100% RESPONSIBLE FOR THE BODY IMAGE?\nNow that’s better…  More clear.\n\n","date":"February 10, 2014 at 4:54 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-78131","author":"Anonymous","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"\nAndy :\nThat was clearly not a character assault.  You did that yourself, Colin.Andy :\nThat was clearly not a character assault.  You did that yourself, Colin.\n\nYou’ve waited a month, just to have another go at me Andy? See my #21.\nDaniel R Porter: if you continue to allow this kind of trolling to occur on your site, I may feel obliged to devote a posting to it. I’m even toying with the idea of referring to this site in all future postings as Troll Central.\n\n","date":"March 2, 2014 at 9:45 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-84271","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry on Rogers’ Thermochimica Acta Paper","post":"Colin, do what you must, but do it elsewhere.\n\n","date":"March 2, 2014 at 10:34 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","id":"comment-84285","author":"Dan","site":"shroudstory"}]
