[{"title":"Colin Berry: The 1532 fire  was no accident","post":"Why do I feel we are the victims of a super troll?\n\n","date":"October 17, 2013 at 5:50 am","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47740","author":"Paulette","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"\nTroll :\nIn Internet slang, a troll (/ˈtroʊl/, /ˈtrɒl/) is a person who sows discord on the Internet by starting arguments or upsetting people, by posting inflammatory, extraneous, or off-topic messages in an online community (such as a forum, chat room, or blog), either accidentally or with the deliberate intent of provoking readers into an emotional response or of otherwise disrupting normal on-topic discussion.","date":"October 17, 2013 at 1:54 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47783","author":"anoxie","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"A super troll or …\nIMHO, CB’s post is only a joke.\nHow is it possible to write : “I perceive the Shroud of Turin [is as] being in essence a thought experiment, imagining the effect of removing a victim, condemned to burning at the stake, while newly deceased but before substantial incineration, and placing in an up-and-over Shroud. The “hot” victim then leaves a scorch-like body imprint on both surfaces of the cloth”. \nIn order to obtain a discoloration of the linen (by heat) a surface temperature of 150-200+°C. is necessary.\nWhat is the result on the skin? Everybody knows the answer: destruction.\nIt is impossible to remove a victim, “condemned to burning at the stake before substantial incineration”. High temperatures of the skin implies incineration.\nTherefore, it is a joke.\nCB seems to abandon his hot template model. Why ?\n\n","date":"October 17, 2013 at 3:37 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47793","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"“L is a signal to tell us how the blood will be applied at a later date: leeches.”\nBut that’s not what I meant when, with characteristic refusal to beat about the bush, I once pleaded with you, many moons ago,  to stop, er, leeching off my blog Dan. Still, I’m glad that one idea (leeches) has stuck.  (Shame it’s in the craw, but there you go – you win some, you lose some).\nAnyway, I have a new strategy where blogging is concerned. I now sit on new ideas, including those wild and weird flights of imagination, until an opportunity presents itself on an established forum (like this one). I submit them as a comment, or as some might say, gift-wrapped hand grenade, and then make a duplicate posting of the same comment to my own sad site, now relegated to a personal archive, with maybe an added graphic or two for visual interest.\n\n","date":"October 17, 2013 at 5:58 am","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47741","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"PS: It’s a long shot, I know, but the “L” might have been a mischievous nod-and-wink to the geographical location of the Shroud’s first public display in western Europe (the tiny French village of Lirey). This archaeocryptanalysis thingy is catching (to the refrain “Anything you can do, I can do better”. ;-)\n\n","date":"October 17, 2013 at 6:26 am","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47742","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"Could this foodiechemistry thingy NOT pay his own thoughts to me, PLEASE? Some anxiety?\n\n","date":"October 17, 2013 at 4:46 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47808","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"Colin were you intending this hand grenade for Dan Porter’s site, or Dan Brown’s? Seriously, your premise would make for a fun novel. It’s the skeptics answer to David Rolfe’s proposed movie. Anyone got Tom Hanks’ number?\n\n","date":"October 17, 2013 at 6:43 am","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47744","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"Ah, but Dan Brown did not bother too much about the tiny little details, like, in this instance, how the linen would have needed to have been folded with respect to the face in order to get the bilateral symmetry of both sets of burn holes.\nOne of my earliest posts queried the propriety of storing the Shroud folded lengthwise through the mid-line of the face for those “accidental” burn holes to be where they are.  Sacrilege surely for a holy relic? \nYou see, the ideas that you and others are now scoffing at have been through a lengthy incubation period – with attention to the pesky finer details – so rest assured that references to Dan Brown etc. won’t cut too much ice with me. Yup, the scientific approach can be a heartlessly detached, austere and icy one – and maybe off-putting to some –  perhaps most. \nSorry. I was not consulted when the human psyche was designed.\n\n","date":"October 17, 2013 at 7:08 am","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47748","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"Ah yes, the burn holes and the folds. A myriad of explanations of which yours, incubated (festered others might say), is but one. Here’s mine. The Shroud was nearly destroyed when the church it was being hosted in was sacked by Saracens — but a brave monk hurriedly retrieved it (no time to worry about folding etiquette) but not before it was damaged by falling embers. The Shroud remained folded like this for some time — hidden from heathen hands. The fold lines were made permanent because of the heat reacting with the starches on the cloth and from the length of time the material was left folded — months, nay years, before it was safe to remove it from its hiding place. That’s my thought experiment – perhaps together we might have a bestseller!\n\n","date":"October 17, 2013 at 9:39 am","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47763","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"Interesting that The Gospel of the Hebrews, an ancient text writes that ” Jesus gave the cloth to the servant of the priest then appeared to James ”\n\n","date":"October 17, 2013 at 8:13 am","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47751","author":"Vincenzo Giovanni Ruello","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"The 1532 fire, the silver casket and the drop of molten metal have become so ingrained in popular shroud history that any suspicion of doubt tends to be greeted with ridicule or completely ignored. Aldo Guerreschi’s comprehensive study, refuting the ‘drop of molten metal’ story, carries with it some fearsome implications which have not been followed through.\nFirstly, I have never read the primary source from which the story of the fire comes in the first place. I do not know if our information is contemporary, or if the first known information comes from a copy of a copy of a copy many years later. Does anybody else?\nSecondly, the melting point of silver is about 900°C. The melting point of iron is about 200°C hotter. It is interesting to speculate about the kind of conflagration around the “niche in the wall” which heated the casket within it to 900°C, but did not melt the iron bars holding it in place. It is also interesting to speculate about the actions of the famous blacksmith, who in the midst of this inferno popped into to rescue the shroud.\nOf course, the “silver” casket may not have been silver at all. Perhaps it was wooden, with silver plates or bands, and the wood burnt through, depositing the lid on the cloth. But not, apparently, any of the burning wood.\nI have heard it said that wrapped cloth is a remarkably good insulator, and experiments of my own with molten lead (melting point about 300°C) show how difficult it is to make a hole through more than one or two layers. However the corollary to this is that folded cloth is very easy to char on the outside, as the heat is not conducted away. Remarkably, however, the unfolded shroud shows no distinction between the inside layers and the outside layers.\nFor two years the shroud disappears, and then requires the testimony of three bishops and ten noblemen to establish that the one which has mysteriously reappeared is the same one as disappeared two years previously. I wonder why. Wasn’t it obvious? Or were there dark suspicions that the original may in fact have been destroyed?\nIt was then taken to a convent where it took two weeks to do what is possibly the worst patching job in recorded history. That’s odd, don’t you think?\nColin’s speculations may turn out to be fanciful, but he’s absolutely on the money when it comes to thinking that the 1532 fire is worth further investigation.\n\n","date":"October 17, 2013 at 9:05 am","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47758","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"Hugh: “Firstly, I have never read the primary source from which the story of the fire comes in the first place. I do not know if our information is contemporary, or if the first known information comes from a copy of a copy of a copy many years later. Does anybody else?”\nHugh see: http://www.shroud.com/pdfs/ssi02part6.pdf Besides, there are Pingonius (who so far I remember described the rescue action), first historian of the TS, and probably numerous other documents from the epoch.\nHugh: “For two years the shroud disappears, and then requires the testimony of three bishops and ten noblemen to establish that the one which has mysteriously reappeared is the same one as disappeared two years previously. I wonder why. Wasn’t it obvious? Or were there dark suspicions that the original may in fact have been destroyed?”\nYes, there were dark suspisions, or rather unsourced rumors and insinuations spread by the Calvinists -remmeber it was in the midst of religious wars in Europe between Protestants and Catholics.\nIn response, Catholics claimed that 1532 was set up by Protestants.\nBTW: There were also some claims that 1997 fire was also started by arson. Supposedly the police got warning that the fire “may” start. In 1972 there was a previous attempt to set fire in St. John Baptist cathedral. The cause of 1997 fire was never determined.\n\n","date":"October 17, 2013 at 3:01 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47788","author":"O.K.","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":">>>> I do not know if our information is contemporary, or if the first known information comes from a copy of a copy of a copy many years later. Does anybody else?<<<<>>>>For two years the shroud disappears, and then requires the testimony of three bishops and ten noblemen to establish that the one which has mysteriously reappeared is the same one as disappeared two years previously. I wonder why. Wasn’t it obvious? Or were there dark suspicions that the original may in fact have been destroyed?<<< “Le Saint Suaire de Chambéry a Sainte-Claire-en-Ville (AvrilMai 1534)”, which was published in 1891 by Abbé Léon Bouchage. >\nIt is only the edition of the text you can find, in a better edition, in the Chevalier’s 1903 book (doc. P).\nIf you write to me a personal email (andrea DOT nicolotti AT unito DOT it) I can send you this text, or both.\n\n","date":"October 17, 2013 at 8:03 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47825","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"Excuse me for the horrible form of my answer. I intended to answer to Hugh Farey, quoting some of his sentences, but…    :-)\n\n","date":"October 17, 2013 at 8:06 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47827","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"I think Colin Berry may believe in the authenticity of the shroud more than most…he is dileberately entertaining us in the role of “devil’s advocate” and is likely getting a good chuckle out of those who actually take him seriously.lol\n\n","date":"October 17, 2013 at 9:22 am","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47759","author":"jkenneth8@hotmail.com","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"Actually I’m dead serious (though I don’t blame you for thinking otherwise). What you may not appreciate is the difficulty of inserting a deadly serious signal into a cacophony of background noise (or mind-numbing musak) and expecting it to be received, filtered and declared serious – not instantly dismissed as tongue-in-cheek, or super-trolling …  You see, there has always been something seriously amiss with 2 entirely different sets of burn holes strung along the same axes, equidistant from a mid-line divider that casually bisects the face of Jesus Christ. \nIt’s just one instance one could cite of the Shroud of Turin being too symmetrical, too  formulaic, too mathematical. Its stylized presentation, while unique, has human fingerprints all over it, albeit geekish ones, those that might be described as the medieval equivalent of today’s IT and software experts (or hackers). .. The Shroud was intended to elicit gasps of “Ooh, that’s so clever, so futuristic so …15th century”.\n\n","date":"October 17, 2013 at 11:23 am","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47772","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"God is not capable, in His miracles, of symmetry, mathematical precision? \nYes, the Shroud has human fingerprints all over it… potentially 2,000 years worth. We will never fully know the journey it has endured — how many human hands have touched it, and with what intentions. What marks on the Shroud are intentional, which are accidental? What has possibly been added to the original image? Is it like the Bible itself, ‘edited’ by later writers?\nColin, it is not fair of me (us) to dismiss your theories – for they are as valid as anyone else’s. Each of us sees this relic through the prism of our own unique context — providing a different starting point of investigation. The conclusions we draw are by-products of our id, mixed with the few facts we can glean.\nKeep the theories coming amigo — they serve the truth.\n\n","date":"October 17, 2013 at 11:47 am","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47773","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"ctually Dr. Ig. Colinqsberry is just begging someone for a truth he just cannot find by himself….\n\n","date":"October 17, 2013 at 10:57 am","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47768","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"…anyone.\n\n","date":"October 17, 2013 at 10:57 am","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47769","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"CB wrote to the British Royal Academy and he did look forward for an answer. Actually he got NONE [rest deleted by me]\n\n","date":"October 17, 2013 at 11:04 am","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47770","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"This was more than a year ago…\n\n","date":"October 17, 2013 at 1:25 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47779","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"Margaret de Charney passed the Shroud across to the House of Savoy in 1453.  It was housed in the newly built Sainte Chapelle 1502.  It was installed in a “magnificent silver casket” commissioned by the Dowager Duchess of Savoy, Margaret of Austria in 1509.  The fire of 1532 was some mere 23 years later. The circumstances are set out in a book by Abbe Bouchage, and was published in 1891 (prior to Pia’s photos of 1898).  The report of the Poor Clare nuns is included in the book, and can be found as a Secured PDF on an Italian shroud web-site at:\nhttp://www.shroud.it/CLARES.PDF   \nThe question of symmetry on the TS is a non-problem, it merely results from the symetrical way it was folded. The burn marks are not identical, but are progressive through the layers of the folds. A simple “thought experiment” involving an A4 sheet of paper sliced to correct proportions ought to provide a quick answer satisfying even a ‘rational’ skeptic. A similar explanation is adequate for other symetries such as the “poker holes” and its use as a frontal and dorsal burial cloth over the head.\n\n","date":"October 17, 2013 at 3:31 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47792","author":"daveb of wellingon nz","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"\nThibault HEIMBURGER :\nA super troll or …\nIMHO, CB’s post is only a joke.\nHow is it possible to write : “I perceive the Shroud of Turin [is as] being in essence a thought experiment, imagining the effect of removing a victim, condemned to burning at the stake, while newly deceased but before substantial incineration, and placing in an up-and-over Shroud. The “hot” victim then leaves a scorch-like body imprint on both surfaces of the cloth”.\nIn order to obtain a discoloration of the linen (by heat) a surface temperature of 150-200+°C. is necessary.\nWhat is the result on the skin? Everybody knows the answer: destruction.\nIt is impossible to remove a victim, “condemned to burning at the stake before substantial incineration”. High temperatures of the skin implies incineration.\nTherefore, it is a joke.\nCB seems to abandon his hot template model. Why ?\n\nFirstly, all this talk of trolling is just plain silly. When has it been trolling to express one’s views candidly about the TS on a site called: “Shroud of Turin Blog: latest news and views”? What’s more I was expressing my doubts as to the 1532 fire way back in February 2012 on my own site (in a comments section):\nhttp://shroudofturinwithoutallthehype.wordpress.com/2012/02/24/the-turin-shroud-man-is-a-scorchograph-and-i-challenge-anyone-to-prove-otherwise/\nI introduced them with the words: \n“Health warning: what follows is strong stuff – not suitable for those of a nervous disposition.”\nRe Thibault’s comment: I was not suggesting that a scorch imprint could really be obtained from a hot body – merely that an artist (artisan?) had used that as the basis for a thought experiment, rendered pictorially. Perhaps I should have said “tongue-in-cheek” thought experiment, but didn’t think that would be necessary.\nI’ll say some more another time about hot templates v Luigi Garlaschelli’s frottage technique. Suffice it to say they both involve scorching by contact – either directly from a hot template, or indirectly when a facsimile powder imprint  from a human subject is heated in an oven – with localised scorching occurring under the powder imprint, the latter then flaking away to leave a faint scorch. (So it’s still a scorch model in essence). I mentioned here a couple of days ago the similarity between Luigi’s technique and the one described in my very first TS posting on “thermostencilling”. What interests me primarily is not so much the precise details of the technology as the kind of physics and chemistry  that is operating, which I still consider to be 3D imprinting via contact scorching (conduction/pyrolysis) of some kind or another, as distinct from radiation. We need to know those carbohydrate profiles from the TS image zones, and then relate them to the botany of the primary and secondary cell walls.\nSo what’s happened to that handy listing of “Latest Comments” in the sidebar?\n\n","date":"October 17, 2013 at 4:05 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47795","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"Colin wants to know, “So what’s happened to that handy listing of “Latest Comments” in the sidebar?”\nRecent Comments. It is there, right under Recent Posts.\n\n","date":"October 17, 2013 at 4:14 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47797","author":"Dan","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"But the list is not visible.\n\n","date":"October 17, 2013 at 4:18 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47801","author":"O.K.","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"That’s funny. It works fine with Internet Explorer 10 but not with Chrome 30. I don’t have Firefox on this machine. I’ll contact support if it doesn’t clear up in a while.\n\n","date":"October 17, 2013 at 4:39 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47804","author":"Dan","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"Yup, the heading “Recent Comments”  is still there, Dan, but the listings have disappeared – on one laptop anyway. Maybe there’s an even Higher Power than you attempting to protect the finer sensibilities on this site.\n\n","date":"October 17, 2013 at 4:19 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47802","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"You mean Bill Gates?\n\n","date":"October 17, 2013 at 4:29 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47803","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"I’m getting the same on my wife’s lapton. And it is broken on Safari running on an iPad. So I’m going to durect this problem over to wordpress.\nAt least Max can’t have all the entries for a while.\n\n","date":"October 17, 2013 at 4:44 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47806","author":"Dan","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"Boy, I can’t type today. First cataract comes out on the 30th so I’ll then be able to see my typing before posting.\n\n","date":"October 17, 2013 at 4:45 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47807","author":"Dan","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"\nDan :\nI’m getting the same on my wife’s lapton. And it is broken on Safari running on an iPad. So I’m going to durect this problem over to wordpress.\nAt least Max can’t have all the entries for a while.\n\nMy wife, who uses another WordPress site, says Recent Comments have disappeared there too (on Firefox).\n\n","date":"October 17, 2013 at 4:47 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47810","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"Following on from an earlier comment, a point that needs emphasizing is that the real novelty is not the suggestion, as per title, that the 1532 burn holes were non-accidental. That idea was around before I started blogging, and is one I picked up on very quickly, speculating as to what features might have been surreptitiously erased or doctored. The novelty is the suggestion that the earlier so-called poker holes are also non-accidental. and that they were placed there as a hint to the viewer to interpret the image as a heat scorch. The rest as they say is history (early 14th century history, French history to be precise).\n\n","date":"October 17, 2013 at 6:37 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47820","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"I am familiar with both the sources linked to above. However they have no deep provenance. Dorothy Crispino’s ‘Report of the Poor Clare Nuns’ seems to come from an article called “Validita ed Attualita di Due Antiche Descrizioni Della Santa Sindone” by Riccardo Gervasio in 1974, which may derive from the second source, “Le Saint Suaire de Chambéry a Sainte-Claire-en-Ville (AvrilMai 1534)”, which was published in 1891 by Abbé Léon Bouchage. Is that as far back as we can go there?\nOn the other hand thank you very much for mentioning Pingonius. His “Sindon Evangelica”, published in 1581, which can be found on the internet at http://sceti.library.upenn.edu/sceti/printedbooksNew/index.cfm?TextID=sindon&PagePosition=9. Pingonus mention the rescue of the shroud, but not, as far as I can see, its repair.\n\n","date":"October 17, 2013 at 7:17 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47823","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"Again:\nHugh said: “I do not know if our information is contemporary, or if the first known information comes from a copy of a copy of a copy many years later. Does anybody else?”\nIn order of time, the essential sources are:\n1) Francesco Adorno (1578)\n2) Filiberto Pingone (1581)\n3) Giovanni Tonso (1596)\n4) Giuseppe Cambiano di Ruffia (1606)\n5) François Capré (1662)\nOnly Pingone says to have been present during the fire. On 1532, he was eight years old. We have not other reliable testimonies. Obviously, Pingone’s history is highly exaggerated (miracles, enormous fire, rescuers of the shrine protected by a divine rain, etc.).\nHugh said: “For two years the shroud disappears, and then requires the testimony of three bishops and ten noblemen to establish that the one which has mysteriously reappeared is the same one as disappeared two years previously. I wonder why. Wasn’t it obvious? Or were there dark suspicions that the original may in fact have been destroyed?”\nSome people said that the Shroud was destroyed by the fire: François Rabelais  (1534), Antoine Froment (1534), Calvinus (1543), Michel Roset (1560 circa)\nHugh said: “….Le Saint Suaire de Chambéry a Sainte-Claire-en-Ville (AvrilMai 1534)”, which was published in 1891 by Abbé Léon Bouchage.”\nIt is only the edition of the text you can find, in a better edition, in the Chevalier’s 1903 book (doc. P).\nIf you write to me a personal email (andrea DOT nicolotti AT unito DOT it) I can send you this text, or both.\n\n","date":"October 17, 2013 at 8:09 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47828","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Colin Berry: The 1532 fire  was no accident","post":"\nDan :\nBoy, I can’t type today. First cataract comes out on the 30th so I’ll then be able to see my typing before posting.\nSorry to hear about that Dan. Best wishes for a successful conclusion. \nRe that glitch: message from “rootjosh” on WordPress Support:\nHello all.\nThere have been reports of comments not appearing in the “recent comments” widget box. We are aware of the problem and are working on it.\n\n","date":"October 18, 2013 at 1:34 am","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","id":"comment-47848","author":"colinsberry","site":"shroudstory"}]
