[{"title":"How come my “simulated sweat imprint” hunch is nowhere to be found in Google’s top 150 search returns under ‘shroud of turin’ (unlike those eye-glazing announcements for “Shroud replica goes  on display… ” etc etc )?","post":"There’s currently an interesting paper in the Journal of Forensic Science from Matteo Borrini of the Liverpool John Moores University. Here’s a link to just one of the several summaries appearing in the popular press:\nhttps://www.news.com.au/technology/science/archaeology/shroud-of-turin-conceals-a-bloody-secret/news-story/a5b1e20e8da9172e8f456935c6e702b4\nCaveat: if you thought you’d seen these results before, you were right: they were presented at conferences in Seattle and Orlando in 2014/2015, as reported on Dan Porter’s blog at the time:\nhttps://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/\nThe gist is that the bloodstains on the Shroud are too random in their direction to have been realistically acquired from a crucified body onto a sheet of linen. In short, the bloodstains have been faked.\nReminder of my own (hopefully) final Model 10.  Two naked adult male subjects, approximately the same height and build, lay on the floor head to head, one face down, the other face up. White flour was sprinkled over the two separate surfaces, one frontal, the other dorsal, from a height. maybe after an initial smear of  oil to act as light adhesive.  Surplus flour was fanned/blown or otherwise shaken off. A slurry of red clay or similar was then trickled onto the subjects to represent Mark 1 “blood”, for which the subject could have been moved at intervals, or even stood up to account for the Liverpool modelling data with blood going ‘in all directions’, somewhat fanciful (artistic licence etc).\n A sheet of wet linen was then pressed down onto the two subjects simultaneousy (after their  returning to the recumbent position). The sheet of flour/clay imprinted linen was then gently roasted over glowing embers (or in a large breadmaking oven or similar) to develop the yellow body image (white flour to melanoidins – comparable to brown crust formation in breadbaking) but not in places that received the “blood”. Later, after removal from heat a more realistic substitute for “blood” was painted on top of the red clay areas (maybe using the last meal of human blood from medicinal leeches, better suited to serve as “paint” given its non-clotting tendencies, as I proposed back in 2012 causing a degree of wonder and indignation).\nThe two step procedure for Mark 1 and Mark 2 blood accounts for the “blood before image” finding from Adler and Heller, and more recent data that reported traces of red clay in a Shroud “bloodstain” (from microscopy experts  Gérard Lucotte et al in Paris).\nhttp://www.shroud.com/pdfs/n85part3.pdf\nPS (added 19 July): the fightback has begun, led by  Shroud “expert” Emanuela Marinelli (what does one have to do to qualify for that tag?)\nhttp://www.catholicherald.co.uk/news/2018/07/19/shroud-of-turin-expert-criticises-new-study-casting-doubt-on-authenticity/\nShame it fails to acknowledge the realities and limitations of scientific model building, criticizing the use of an inanimate mannequin as distinct from real live (less than static!) real human subject. Shame also that it contained the customary slander of Shroud sceptics, one  that betrays some might think an increasingly desperate attempt to defend an increasingly indefensible position. \nSpeaking for myself, I’m only here for the science (and ever keen to expose the pseudoscience/special pleading  that tries to present itself as science, aided and sometimes abetted by our gullible headline-grabbing mass media and so-called internet search-engines).\nLate late addition, July 20: Halleluja” PLOS ONE has retracted the Carlino and Fanti “nanoparticle/blood trauma” paper,  the subject of major criticism in this posting and elsewhere, and not before time. I’ve tacked a bit on the end of this posting, supplying links and more detail. Bravo PLOS ONE for restoring standards, and holding back the tide of pseudoscience that bedevils sindonology…\n","date":"July 16, 2018 at 8:08 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2018/05/02/why-is-my-simulated-sweat-imprint-nowhere-to-be-seen-in-googles-top-150-rankings-under-shroud-of-turin-unlike-those-eye-glazing-announcements-for-shroud-replica-goes-on-display-etc/","cat":"commercial_and_or_ideological_taint","id":"comment-11130","author":"Colin Berry","site":"colinberry"},{"title":"How come my “simulated sweat imprint” hunch is nowhere to be found in Google’s top 150 search returns under ‘shroud of turin’ (unlike those eye-glazing announcements for “Shroud replica goes  on display… ” etc etc )?","post":"Have just been reading the 15-page internet-tome from French-Canadian Mario Latendresse that dominates the latest BSTS Newsletter (Summer 2018). Given the latter is behind a paywall, with copyright restrictions, I refrain from quoting his words verbatim. Suffice it to say that  he has placed a seemingly new word into the Shroud literature, namely “trelle” or “treille” (medieval French), apparently “trellis” in modern English. The gist of his comment was that the 14th/15th century literature regarding the first reportings of the Shroud referred (oh so annoyingly!) to the image being on a “trellis”, with no mention of cloth. “Table” also substitutes for cloth.\nThose familiar with this site from its inception (2012) will know that “trellis” featured prominently in my Model 2 (“scorch hypothesis”) being the pattern  displayed on the reverse side of the Lirey Pilgrims’ badge (not mentioned by Mario in his current article, though mentioned in a handy article on his site under the “Papers” tab – see link below, he reporting his visit to the Cluny Museum in Paris to view the badge in person.).\nI now have a new narrative that could possibly account for the “trellis” involvement. It’s to do with the 14th century modelling of the means by which Joseph of Arimathea’s “fine linen” was used to transport the crucified Jesus from cross to tomb. Maybe it wasn’t an unsupported  sagging linen used to transport the body. Maybe the linen was envisaged as being  first spread over a lightweight wooden trellis, used to provide sufficient but  rigid support for an adult body.\nThat’s why the trellis is shown on the REVERSE side of the Lirey badge.  It added to the credibility, seen through the eyes of medieval pilgrims. It was linen plus trellis as stretcher, not just linen per se!\n(Late insertion: unfortunately it’s not a simple trellis shown on the rear of the badge, as I pointed out back in 2014, taking an image from Mario’s sindonology.org site and using MS Paint to give added emphasis to the faint trellis pattern:)\nhttps://shroudofturinwithoutallthehype.files.wordpress.com/2014/02/trellis-with-and-without-blue-overlay.jpg?w=640&h=296\nMore to come, possibly a new posting after a break of well over 2 months!…\nAny new posting from this authenticity-rejecting blogger, like its 350+ predecessors,  will no doubt be ignored, needless to say, not only by authenticity-fixated/promoting websites, but the Google so-called search engine, at least by those entering simply entering “shroud of turin”… \nBut one has to put one’s views on record, if only for the benefit of future historians…\nMore and more, the internet looks like a medium for  Californian-driven mind-manipulation, mind-control.  To think we used to worry about the Soviets and their ambitions…  All that’s changed are the ambitions …\n","date":"July 14, 2018 at 3:05 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2018/05/02/why-is-my-simulated-sweat-imprint-nowhere-to-be-seen-in-googles-top-150-rankings-under-shroud-of-turin-unlike-those-eye-glazing-announcements-for-shroud-replica-goes-on-display-etc/","cat":"commercial_and_or_ideological_taint","id":"comment-11128","author":"Colin Berry","site":"colinberry"},{"title":"How come my “simulated sweat imprint” hunch is nowhere to be found in Google’s top 150 search returns under ‘shroud of turin’ (unlike those eye-glazing announcements for “Shroud replica goes  on display… ” etc etc )?","post":"Here’s a link to my latest posting on Stonehenge:\nhttps://sussingstonehenge.wordpress.com/2018/06/21/more-pseudo-scientific-pseudo-mathematical-twaddle-on-stonehenge-in-the-telegraph-no-less/\nIt has just been added to, with an explanation for why Stonehenge is where it is, stuck out there on the somewhat bleak and breezy Salisbury Plain (chalk uplands).\n\n","date":"June 24, 2018 at 9:25 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2018/05/02/why-is-my-simulated-sweat-imprint-nowhere-to-be-seen-in-googles-top-150-rankings-under-shroud-of-turin-unlike-those-eye-glazing-announcements-for-shroud-replica-goes-on-display-etc/","cat":"commercial_and_or_ideological_taint","id":"comment-11043","author":"Colin Berry","site":"colinberry"},{"title":"How come my “simulated sweat imprint” hunch is nowhere to be found in Google’s top 150 search returns under ‘shroud of turin’ (unlike those eye-glazing announcements for “Shroud replica goes  on display… ” etc etc )?","post":"Google triviali$e$, but I can’t for the life of me think why…\n","date":"June 18, 2018 at 1:56 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2018/05/02/why-is-my-simulated-sweat-imprint-nowhere-to-be-seen-in-googles-top-150-rankings-under-shroud-of-turin-unlike-those-eye-glazing-announcements-for-shroud-replica-goes-on-display-etc/","cat":"commercial_and_or_ideological_taint","id":"comment-11037","author":"Colin Berry","site":"colinberry"},{"title":"How come my “simulated sweat imprint” hunch is nowhere to be found in Google’s top 150 search returns under ‘shroud of turin’ (unlike those eye-glazing announcements for “Shroud replica goes  on display… ” etc etc )?","post":"Have been monitoring Google and its listing (or NOT listing!) of this site day by day for over a week. \nGoogle is a disgrace – a complete and utter disgrace\nGoogle has given up performing solely as a search engine. It is now attempting to control what folk see – or don’t see – on the World Wide Web. \nThe sooner Google  gets regulated out of existence this side of the Pond the better. Google is yet another expression of Californian Control Freak Tendency.\nBugger off California.\n","date":"June 15, 2018 at 8:43 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2018/05/02/why-is-my-simulated-sweat-imprint-nowhere-to-be-seen-in-googles-top-150-rankings-under-shroud-of-turin-unlike-those-eye-glazing-announcements-for-shroud-replica-goes-on-display-etc/","cat":"commercial_and_or_ideological_taint","id":"comment-11032","author":"Colin Berry","site":"colinberry"},{"title":"How come my “simulated sweat imprint” hunch is nowhere to be found in Google’s top 150 search returns under ‘shroud of turin’ (unlike those eye-glazing announcements for “Shroud replica goes  on display… ” etc etc )?","post":"Sindonologists should drop their “authenticity” fantasy. There’s not a single shred of evidence to back that up (hard evidence that is).\nThe Turin so-called “Shroud”, read faked taut-linen transport stretcher,  based on the biblical Joseph of Arimathea intervention, was a superb invention on the part of an obscure, tiny,  secretive clique of relic-fixated 14th century opportunists. \nWhy not celebrate the TS for what it is?  It  was fabricated as a visual aid  for simple trusting moneyed pilgrims – summarising key verses of the New Testament – namely those few in the four canonical  Gospels  that relate the aftermath of the crucifixion – deficient and indeed contradictory  as regards essential detail.\nIt was a stupendous  work of genius –  one that has hoodwinked generations of yearning-for-mystique true-believers – latterly aided and abetted  by the totally irrelevant intrusion of 19th century photography and 20th century 3D-rendering computer software).\nIt’s time the “Shroud” of Turin fantasy was seen for what it is – wishful thinking – with lashings of pseudoscience – and finally laid to rest…\nSindonology does a disservice to science (real science that is!). Science, real science, attempts  objectively to evaluate alternative ever-evolving models. It does not, repeat NOT, fixate upon and seek to underpin the few that happen to support preconceptions. \nSadly there is no distinct dividing line between science and pseudoscience. But one can do a lot worse than seek out those agenda-driven preconceptions that to this day generate the never-ending onslaught of pseudoscience that appears under Google’s (shroud of turin)  listings …\n","date":"June 8, 2018 at 9:13 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2018/05/02/why-is-my-simulated-sweat-imprint-nowhere-to-be-seen-in-googles-top-150-rankings-under-shroud-of-turin-unlike-those-eye-glazing-announcements-for-shroud-replica-goes-on-display-etc/","cat":"commercial_and_or_ideological_taint","id":"comment-11012","author":"Colin Berry","site":"colinberry"},{"title":"How come my “simulated sweat imprint” hunch is nowhere to be found in Google’s top 150 search returns under ‘shroud of turin’ (unlike those eye-glazing announcements for “Shroud replica goes  on display… ” etc etc )?","post":"The so-called “Shroud” of Turin is not, repeat NOT,  the genuine burial garment of the crucified founder of Christianity!\n Indeed, it’s not even a faked version of a burial garment!\nIt’s in fact a faked version of Joseph of Arimathea’s ‘transport’ stretcher. That, in the bible, was  used to convey the crucified Jesus from cross to tomb. But relic-fixated medieval clerics and artisans, intent on attracting pilgrims,  imagined  and then MODELLED with much inventiveness that brief transport  to have deposited an imprint of his newly deceased self in both  sweat and blood, the sweat component having yellowed with age to leave a  tone-reversed negative contact (photographic-like) imprint. \nBut that ‘modelling’ took place centuries before the discovery of photography with its similar tone reversal (on the initial light-sensitive silver salt -emulsion prior to second-stage  chemical development).\nIt can hardly be said too often – to authenticity-proselytising  sindonologists.  “Negative” (tone-reversed) images were around a lot sooner – centruries sooner –  than relatively recent 19th century photographs!  \nHow many times does one have to say it – before the message sinks in? \nThe negative image does NOT imply photography!   In an earlier, pre-19th century context, it implies contact-imaging! The objections levelled against contact-imaging – by John Jackson  and others – are worthless!\n","date":"June 8, 2018 at 6:24 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2018/05/02/why-is-my-simulated-sweat-imprint-nowhere-to-be-seen-in-googles-top-150-rankings-under-shroud-of-turin-unlike-those-eye-glazing-announcements-for-shroud-replica-goes-on-display-etc/","cat":"commercial_and_or_ideological_taint","id":"comment-11010","author":"Colin Berry","site":"colinberry"},{"title":"How come my “simulated sweat imprint” hunch is nowhere to be found in Google’s top 150 search returns under ‘shroud of turin’ (unlike those eye-glazing announcements for “Shroud replica goes  on display… ” etc etc )?","post":"Stop pretending you authenticity-promoting sindonologists that you’re muscled Mr. Universe. That you ain’t. Mr.Puniverse.\nYou’re a skinny, round-shouldered  wimp, lurking in the internet shadows, afraid to step forward and do combat. All I ever saw from you in the early days, 2012 on the Porter site especially, was cowardly hit-and-run tactics.\n  Come on out of that oh-so- shadowy secret garden of yours! Prepare to do combat! Face up to the facts!  Like the TS being merely  a medieval era project, one designed to model with a degree of imagination an aged, yellowed sweat/blood imprint left on the  biblical ‘fine’ linen brought to the foot of the cross by one Joseph of Arimathea. His linen, brilliantlly modelled,  probably by mid-14th century Lirey-based clerics, was intended purely, repeat PURELY, for dignified  honour-conferring transport purposes (not the final burial shroud!).\n","date":"June 7, 2018 at 6:08 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2018/05/02/why-is-my-simulated-sweat-imprint-nowhere-to-be-seen-in-googles-top-150-rankings-under-shroud-of-turin-unlike-those-eye-glazing-announcements-for-shroud-replica-goes-on-display-etc/","cat":"commercial_and_or_ideological_taint","id":"comment-11009","author":"Colin Berry","site":"colinberry"},{"title":"How come my “simulated sweat imprint” hunch is nowhere to be found in Google’s top 150 search returns under ‘shroud of turin’ (unlike those eye-glazing announcements for “Shroud replica goes  on display… ” etc etc )?","post":"Update on Google listing: whilst round the opposite side of London this morning, using someone else’s iPad, this site briefly appeared under a Google (shroud of turin) search at the bottom of Page 10, i.e. approx. No.100 in the rankings.  (I took a photograph!) \n\n That looked promising, but for one thing. Half an hour later the entry had disappeared, and 8 hours later, back on my own laptop, it’s still not reappeared. \nI find it hard to believe that Google (unaided) can be responsible for the ‘now-you-see-it-now-you-don’t’ nonsense. What seems far more likely is the work of sinister tendency pursuing an agenda, the so-called SEOs (search engine optimizers) who make their living from promoting sites they are asked/paid to promote and/or to demote the ones that are being targeted for invisibility.\nThat doesn’t let Google off the hook completely ,far from it, not if it’s turning a blind eye to all kinds of abuse of its search engine rankings. It must surely be able to detect sudden disappearances that can mean only one thing – manipulation of the system that works, we’re told. primarily by clicks in real time  to some sites, not others. Clicks  can be summoned up  probably in their scores or hundreds, all designed to subvert the system, thanks to those shadowy dedicated organizations, …. \nIt’s time Google began to tame the monster it has created. Get a grip, Google. \nI shall create a daily log, summarized every few days or so here on Comments,  showing when this site reappears in the rankings, assuming it ever does, and when it disappears again. Let’s look for a pattern…  (But why should I be doing Google’s detective work for it?).\n","date":"June 2, 2018 at 4:23 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2018/05/02/why-is-my-simulated-sweat-imprint-nowhere-to-be-seen-in-googles-top-150-rankings-under-shroud-of-turin-unlike-those-eye-glazing-announcements-for-shroud-replica-goes-on-display-etc/","cat":"commercial_and_or_ideological_taint","id":"comment-10996","author":"Colin Berry","site":"colinberry"},{"title":"How come my “simulated sweat imprint” hunch is nowhere to be found in Google’s top 150 search returns under ‘shroud of turin’ (unlike those eye-glazing announcements for “Shroud replica goes  on display… ” etc etc )?","post":"I sent the following short message this morning to: (a) Mr.Barrie M.Schwortz , President of STERA, owner of the shroud.com website  and to (b) Mr.David Rolfe, Editor of the BSTS Newsletter.\nThe title of my email was  “The Deposition Linen of Turin”\nHello again xxxxxxx\nYes, I believe “Shroud” of Turin to be a seriously misleading misnomer, one that has led to much inappropriate theorizing, not to say pseudoscience, regarding events taking place inside a  certain 1st century rock tomb. \nHere’s a link to my latest posting, well over 6 years and some 350 internet postings in the making. \nhttps://shroudofturinwithoutallthehype.wordpress.com/2018/05/02/why-is-my-simulated-sweat-imprint-nowhere-to-be-seen-in-googles-top-150-rankings-under-shroud-of-turin-unlike-those-eye-glazing-announcements-for-shroud-replica-goes-on-display-etc/\nI say the Deposition Linen of Turin was a medieval modelling of a simulated sweat imprint (with identifying blood in all the right places)\nEnjoy.\nColin Berry (MSc, PhD, retired biomedical scientist)\nHerts, UK\nPostscript (added June 21 2018)\nBarrie M Schwortz has just updated his shroud.com site. There’s a small section headed “The Shroud on the Internet”  (5th from bottom ) with a few items only. This site fails to get a mention, needless to say.  But then it would be totally out-of-character for that site owner to make reference to this one.  Having never done so in the last 6 years or more, why start now?\n","date":"May 30, 2018 at 7:45 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2018/05/02/why-is-my-simulated-sweat-imprint-nowhere-to-be-seen-in-googles-top-150-rankings-under-shroud-of-turin-unlike-those-eye-glazing-announcements-for-shroud-replica-goes-on-display-etc/","cat":"commercial_and_or_ideological_taint","id":"comment-10994","author":"Colin Berry","site":"colinberry"},{"title":"How come my “simulated sweat imprint” hunch is nowhere to be found in Google’s top 150 search returns under ‘shroud of turin’ (unlike those eye-glazing announcements for “Shroud replica goes  on display… ” etc etc )?","post":"I shall take the liberty of priming my own comments on this – probably my last posting for some time.\nAfter some 6 years of posting on the so-called ‘Shroud’ of Turin (or as I prefer to say, less propagandist, less mind-controlling,  ‘Deposition Linen’ of Turin) and having received scarcely any useful or substantial feedback, at least  from know-all pro-authenticity authorities (comments on Dan Porter’s now retired shroudstory site making a welcome change)  I’ve come finally to a conclusion. There’s a hitherto unrecognized syndrome, read quirk of human nature.\n It’s called ‘enigmaphilia’ (you read it here first). \nFolk grow up with those so-called unsolvable enigmas in their head, where they become fixed mental furniture. They become loath to part with those oh-so-familiar items that become essential mystique, without which the mind would seem  partially denuded of  familiar furniture.\nThe MSM plays on this need for intermittent reinforcement of those  comforting certainties, correction , uncertainties. \nThe MSM helps to keep those uncertainties carefully corralled, carefully hived off from everyday life…\nNeed I say more?\n","date":"May 29, 2018 at 4:45 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2018/05/02/why-is-my-simulated-sweat-imprint-nowhere-to-be-seen-in-googles-top-150-rankings-under-shroud-of-turin-unlike-those-eye-glazing-announcements-for-shroud-replica-goes-on-display-etc/","cat":"commercial_and_or_ideological_taint","id":"comment-10993","author":"Colin Berry","site":"colinberry"}]
