[{"title":"Is the Shroud of Turin really just 18 years short of its 2000th birthday?  SEE THIS BLOG FOR A DAILY ACERBIC OVERVIEW OF CURRENT WRANGLING ( currently 2015, Week 32)","post":"The first priority is for Di Lazzaro to do some microscopy on his laser-irradiated linen and attempt to identify the uv-absorbing chromophore. I personally find it incredible that he’s failed to do either of those yet is still described a scientist. Well, he’s a laser technologist, and possibly even a physicist. But uv light from a laser is still governed by the First Law of Photochemistry. \nAh yes, photochemistry – a term we have yet to hear from Dr.Di Lazzaro and his ENEA team.This blogger spent the first two years of his research career operating as a photochemist – despite being biochemically-qualified – because the problem was to do with the mechanism and safety of phototherapy for neonatal jaundice.\nIn fact, if you read Di Lazzaro’s recent comments, he blithely assumes throughout that it’s “cellulose” that is the target for his uv radiation. Evidence?  I doubt it personally. It’s more likely something with a peak in the uv spectrum – e.g. lignin. Why are we still having to ask such basic questions after all these years? Where’s the SCIENCE????!!!!!\n","date":"August 20, 2015 at 1:17 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/08/03/is-the-shroud-of-turin-really-just-18-years-short-of-its-2000th-birthday-see-this-blog-for-a-daily-acerbic-overview-of-current-wrangling-currently-2015-week-32/","cat":"uncategorized","id":"comment-6209","author":"Colin Berry","site":"colinberry"},{"title":"Is the Shroud of Turin really just 18 years short of its 2000th birthday?  SEE THIS BLOG FOR A DAILY ACERBIC OVERVIEW OF CURRENT WRANGLING ( currently 2015, Week 32)","post":"First of all:\nI admit that I arrive with my message very late …\nSorry!\nI think the problem of bleaching is still interesting.\nFor example: I have never seen a comparison about colored linens from Di Lazzaro and samples (from these linens) that were subjected to NaClO bleaching.\nMost likely there is a difference between the linen samples treated with “XeCl laser” (308 nm) and those with “ArF laser” (193 nm). But I think that a certain amount of color is still visible (although, probably, with a reduced contrast with the surrounding areas).\nIn other words there is only a partial bleaching.\nI understand that you cannot work on VUV excimer laser treated samples, but you can try to do something on CD (= Corona Discharge) treated linens because this is a more easy way to treat the textile material…\nIf you cannot work, then try to ask a treated linen sample to Di Lazzaro and/or Fanti.\nI am interested in discussions about this work because we can guess something about the depth of color penetration. For example: probably with a XeCl Laser [308 nm. Result= brownish color. Instead (if i am right) an “ArF laser” produces a yellowish coloration…] there is a more deep penetration.\nWhat is your opinion?\nHave you an idea how to treat treated (and/or irradiated) linens in a washing machine?\nLink:\nhttp://www.frascati.enea.it/fis/lac/excimer/labeccimeri_eng.html\nI think the same color permanence may apply for what\nobtained Fanti with his system (= Corona Discharge).\nAn easy test:\nSee also the use of a crockmeter or a fingertip,\nrubbing the images obtained on linen\n(with an adequate pressure) …\nThe Crockmeter provides a quick and accurate method to determine the amount of color that is transferred by rubbing textile materials to other surfaces.\nThe Crockmeter was originally designed to simulate the action of a human finger.\nThe rubbing action is provided by a “finger” which moves back and forth in a straight line with each complete turn of the crank…\n","date":"August 19, 2015 at 3:03 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/08/03/is-the-shroud-of-turin-really-just-18-years-short-of-its-2000th-birthday-see-this-blog-for-a-daily-acerbic-overview-of-current-wrangling-currently-2015-week-32/","cat":"uncategorized","id":"comment-6208","author":"piero","site":"colinberry"}]
