[{"title":"Hello, all you Shroud sceptics out there","post":"Colins (I hope I got that right),\n– I appreciate your priorities and time constraints – I have, myself, miles to go before I sleep.\n– But anyway, have you read my ‘chapters’ 3 and 4?\n– If not, and if you get a chance, please do so – and then, rethink your decision. The debate we propose should advance very slowly and require very little of your time…\n– Whatever, thanks for the quick response.\n— Rich\n","date":"February 17, 2012 at 3:17 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/12/hello-all-you-shroud-sceptics-out-there/","cat":"cellulose","id":"comment-12","author":"Richard Savage","site":"colinberry"},{"title":"Hello, all you Shroud sceptics out there","post":"Hello Rich Savage. \nWell, there’s never a dull moment where internet forums are concerned. Just when you think you have created a tiny secure niche something comes along to disturb the equilibrium. That’s not altogether unwelcome of course, boredom being the main enemy in this retired science bod’s life at present, but one does have to consider one’s options very carefully to avoid being diverted off one’s chosen course.\nWhat you propose could be quite interesting, although I have to say I think you are kidding yourself if you imagine there is some kind of equivalence between the position of those who see the Shroud as dating back to the 1st century AD and those like myself who see it as a clever indeed ingenious forgery from the medieval era. We can discuss the matter of C-dating another day. Suffice it to say that if you seek to restore the kind of equivalence that existed in the 1970s (?) when I recall reading a fascinating account of then “modern” analysis of the Shroud in the Sunday Times Magazine (or colour supplement as we used to call it) , with the 3D imaging, the “correct” nailing through the wrist etc.then you are going to have to get some more samples of fabric released for dating – with a clear a priori understanding as to what results will be accepted without quibble.\nNaturally I am flattered that you should approach me to be sceptic-in-chief. But my blog is just as new as yours, and I have my own blogging model that is distinctly different in approach. Mine is less confrontational. more thoughtful, dare I say more creative. \nYou see, I accept the C dating. My interest is in knowing precisely how that image was produced, and how it came to fool 20th century science for as long as it did. There is a parable to be learned here, methinks, regarding the use and misuse of the scientific method and scientific data that has relevance to issues of more pressing and immediate concern to humanity, notably the greenhouse effect and climate change, AIDS aetiology etc etc.\nLet’s keep in touch. I shall certainly visit your site from time to time, and may comment if the spirit moves me. But I prefer to comment when I feel i have something worth saying, not in a purely reactive fashion to others, no matter how provocative the stimulus.\nI’ve set myself the quite onerous task of reviewing a detailed paper by Fanti et al (2010) , my current post, so bid you farewell for now. Good luck with the new site. I hope you find the person you are looking for – but I am not he.\n","date":"February 15, 2012 at 4:19 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/12/hello-all-you-shroud-sceptics-out-there/","cat":"cellulose","id":"comment-10","author":"colinsberry","site":"colinberry"},{"title":"Hello, all you Shroud sceptics out there","post":"Colin,\n1. Our Purpose:\n1.1. “We” are a small team of ‘commentators’ imported from http://www.shroudblog.com.\n1.2. We believe – apparently, contrary to current popular opinion – that the preponderance of evidence regarding the Shroud of Turin somehow – but clearly – favors the Shroud’s authenticity…\n1.3. (“Authentic” meaning simply that the Shroud was, in fact, the burial cloth of Jesus — at this point, we are not claiming that there is anything supernatural about the Shroud…)\n1.4. We also believe that we will be doing a great public service if we can bring our conclusion to worldly consensus.  (Such a conclusion should give anyone serious pause – whether believer or nonbeliever, and whether the image on the Shroud is supernatural or not — and should also put any sarcastic skeptics into their rightful places… which would be a good thing.)\n1.5. So, our purpose here is to show that the preponderance of evidence clearly favors shroud authenticity, and to bring that conclusion to a worldly consensus…\n– The above was taken from our website – http://shrouddebates.com/.\n– Would you like to have a friendly, patient, on-line, written debate with us?\n– You would be ‘allowed’ to recruit all the help you desired, but you would be the official spokesperson.\n— Rich Savage, rsavage@nycap.rr.com\n","date":"February 15, 2012 at 2:03 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/12/hello-all-you-shroud-sceptics-out-there/","cat":"cellulose","id":"comment-8","author":"Richard Savage","site":"colinberry"},{"title":"Hello, all you Shroud sceptics out there","post":"Welcome to the fray. It should be fun. It should help to keep the conversation going and help those of us who believe first and foremost that determining the truth about the shroud is important. \nDan Porter\n","date":"February 13, 2012 at 12:48 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/12/hello-all-you-shroud-sceptics-out-there/","cat":"cellulose","id":"comment-5","author":"episcopalian","site":"colinberry"},{"title":"Hello, all you Shroud sceptics out there","post":"Thank you Dan. Incidentally, I don’t know whether you noticed, but I inserted your excellent summary of computer-aided 3D-imaging into my final Shroud post on  science buzz \n I also responded to a question raised on your site as to whether fainter scorch marks respond to the 3-D imaging software. The answer is YES, they do.\n","date":"February 13, 2012 at 2:14 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/12/hello-all-you-shroud-sceptics-out-there/","cat":"cellulose","id":"comment-7","author":"colinsberry","site":"colinberry"},{"title":"Hello, all you Shroud sceptics out there","post":"Here was my response to ArtScience:\nWhat a splendid comment, ArtScience, the best reply I have ever had on this site.\nHope you don’t object, but I have used it to prime the Comments on my new site –  I hold you up as a role model for good blogging etiquette (something that is sadly in short supply here –  Barrie Schwortz and some others please note).\nColin Berry aka sciencebod\n","date":"February 13, 2012 at 5:44 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/12/hello-all-you-shroud-sceptics-out-there/","cat":"cellulose","id":"comment-4","author":"colinsberry","site":"colinberry"},{"title":"Hello, all you Shroud sceptics out there","post":"From ArtScience\nshroudofturin.wordpress.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/\nOf all the forgery theories the scorch one is the only one that bears a chance of being able to partly explain the image on the Shroud. \nHowever, to avoid the distortions in the image the underlying statue would have to be a bas relief (as has already been tested before by numerous experimenters but might be worth a revisit). I also think it would have to be a low relief as well, because any bedding down movement might show as a blurring of markings.\nI think that rather than using a sand bed, instead a bed of dense but compressible wool, would help transfer the depth information into an increase in pressure of the linen against the hot surface (as I dont think the sand bed would be responsive enough to achieve a linear relationship between the depth and the pressure). The scorching on the top surfaces of fibres and the ability to scorch some fibres and not neighbouring fibres might all be down to pressure difference as Colin mentioned. I’m not sure whether that level of responsiveness in possible with a scorch image to give the subtlies in the Shroud, but some experimentation might give some indication of this. I disagree with Colin that just showing the principle is enough and the rest is arts and crafts – I spent many years working in transferring theoretical results into workable technologies with sufficient fidelity ….sometimes it’s not possible. \nBut I agree with Colin that I wouldnt be too confident about the UV fluorescnce results if you are not comparing like with like pyrolysis results (ie image and 1500′s fire pyrolysis results as they were created under different circumstance). I’d like to see the proper report on this as it seems like an important result to establish. \nHowever I still think the bas relief method would struggle to explain the faint image on the other side of the head given that the fibres in between dont appear to affected. Also the blood patterns apparently being created before the image (how sure are we of this?) I’d like to see a comparison of the intricate blood and whip marks, to see if these correlate exactly as they are precise enough as markers – I saw somewhere some very faint images (only visible after image processing) of the leather parallel strip marks that lead towards the actual whip wounds – that was very impressive to me. There are a number of other physical results I’ve come across whilst researching in only the last month that I found to be perplexing if you work on the hypothesis that its a fake, and thats not to mention some of the historical documents. So I cant dismiss the Shroud as easily as Colin does.\n","date":"February 13, 2012 at 5:20 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/12/hello-all-you-shroud-sceptics-out-there/","cat":"cellulose","id":"comment-3","author":"colinsberry","site":"colinberry"},{"title":"Hello, all you Shroud sceptics out there","post":"Hello. I am just testing to see if my new site accepts comments. if it does, I shall prime the Comments with one that has appeared overnight on another site, as an example of the kind of comment that is welcomed – critical maybe but civil and constructive. Would that all comment in the Shroudy world were so…\n","date":"February 13, 2012 at 5:12 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/12/hello-all-you-shroud-sceptics-out-there/","cat":"cellulose","id":"comment-2","author":"colinsberry","site":"colinberry"}]
