[{"title":"Needed urgently – scorch scanner (gd wkg cond)","post":"Hello again Matthias.\nProbably both, I would guess. In other words, there were two bas reliefs, one for the front, one for the back. Each was pressed vertically into the linen with some heat-absorbent “padding” underneath (damp sand? snow? damp wool or bedding?) to achieve good contact between cloth and template thus ensuring a reasonably good imprint (but some tenting effect is inevitable, which one sees as white space around the crossed hands etc).  But each template would presumably not penetrate more than a few centimetres into the underlay. That means no imaging of the sides of the effigy, which aren’t present on shallow bas relief  templates anyway, and no ears, and no ‘top of head’.\n I suppose it’s possible that a single template was used for the head, if using an ‘in the round’ bust, say, as distinct from  flatter bas-relief  ‘death masks’, but there would still be limited imaging of the sides, and if there were too much of the latter, one would see distortion effects that would be unsightly and a giveaway. Having said that, I noticed some distinct signs of excessive ‘wrap-around’ effect with the lower legs when looking at Shroud Scope images the other day. It’s a different leg as I recall when  checking both frontal and dorsal images, which makes one wonder if there was not some operator bias where pushing/imprinting was concerned, i.e. pressure was not applied directly and evenly over the midline of the long axis. Put another way, the template tipped a bit to one side, probably towards the ‘pusher/rammer’. I hope that makes sense.\n","date":"September 26, 2012 at 11:00 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/09/22/needed-urgently-scorch-scanner-gd-wkg-cond/","cat":"horse_brass","id":"comment-829","author":"colinsberry","site":"colinberry"},{"title":"Needed urgently – scorch scanner (gd wkg cond)","post":"Colin\nInterested in your view, given your scorch theory, as to why there is no scorch image on the top of the head on the shroud. Might this be because the scorch image involved downward pressure into the cloth? Or do you think it more likely two base relief scorches neatly aligned in a mirror-like manner, thus explaining the lack of top of head image?\nMatthias\n","date":"September 26, 2012 at 10:26 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/09/22/needed-urgently-scorch-scanner-gd-wkg-cond/","cat":"horse_brass","id":"comment-828","author":"Matthias","site":"colinberry"},{"title":"Needed urgently – scorch scanner (gd wkg cond)","post":"I trust you are not a clairvoyant, Davor… Inquisitions are simply not my scene…\n","date":"September 22, 2012 at 10:21 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/09/22/needed-urgently-scorch-scanner-gd-wkg-cond/","cat":"horse_brass","id":"comment-785","author":"colinsberry","site":"colinberry"},{"title":"Needed urgently – scorch scanner (gd wkg cond)","post":"\n","date":"September 22, 2012 at 7:49 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/09/22/needed-urgently-scorch-scanner-gd-wkg-cond/","cat":"horse_brass","id":"comment-783","author":"Davor Aslanovski","site":"colinberry"}]
