[{"title":"Colin Berry on STURP","post":"Why would the supposed forger want to use nitrated protein derived from wheat glutens in order to form a surface film? What was he trying to convey?\n\n","date":"May 30, 2015 at 11:44 am","url":"https://shroudstory.com/2015/05/30/colin-berry-on-sturp/","cat":"other_blogs","id":"comment-200603","author":"Louis","site":"shroudstory"},{"title":"Colin Berry on STURP","post":"Not too difficult to be so wise some 40 years after the event.  In 1978, there was a strong lobby that believed it was a painting, and so it had to be addressed.  Nevertheless McCrone held to that belief to his dying day, and we’ve now seen more recent versions of the same old story with CF’s flaky paint idea.  \nThere will never be another STURP, the Italians have seen to that, with their own peculiar agendas.  Unlike the Americans, I’m unaware that any of them have been involved in any cutting edge space exploration or atomic energy advances.  We did have some Italian engineers out here back in the 1970s building railway viaducts and tunnels, which happened to involve a launching girder collapse, and a few other mishaps.\n\n","date":"May 30, 2015 at 3:38 pm","url":"https://shroudstory.com/2015/05/30/colin-berry-on-sturp/","cat":"other_blogs","id":"comment-200615","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Colin Berry on STURP","post":"“Not too difficult to be so wise some 40 years after the event. In 1978, there was a strong lobby that believed it was a painting, and so it had to be addressed. Nevertheless McCrone held to that belief to his dying day, and we’ve now seen more recent versions of the same old story with CF’s flaky paint idea.”\nI fully agree.\nNeedless to say that Colin’s model (as well as other models) is (or should be) mainly based on STURP’ data (superficiality, no pigment, spectra, fluorescence, blood data, half-tone etc..).\nColin (and others) should recognize that the STURP’s work is and remains of paramount importance.\nThe image is an imprint. Yes.\nFor now, I don’t see anything resembling the TS image in Colin’s new experiments.\nAt the end (??), we will see…\n\n","date":"May 31, 2015 at 2:25 pm","url":"https://shroudstory.com/2015/05/30/colin-berry-on-sturp/","cat":"other_blogs","id":"comment-200690","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Colin Berry on STURP","post":"First of all, what make Colin think it’s an imprint?? Secondly, isn’t it true that the reason STURP caught interest to investigate the shroud is because they knew that in no way the image is a painting because paintings do not create negative images and have 3 dimensional qualities? Didn’t STURP use most of its technology to see how the image was created? Not just painting? To find out if it was a painting, you don’t really need a whole lot of technology.\n\n","date":"May 30, 2015 at 4:38 pm","url":"https://shroudstory.com/2015/05/30/colin-berry-on-sturp/","cat":"other_blogs","id":"comment-200618","author":"don","site":"shroudstory"},{"title":"Colin Berry on STURP","post":"Agreed Daveb.  Hindsight is a perfect 20/20.  The post actually has no content at all.  Guess Colin just doesn’t like STURP or its work.\n\n","date":"May 30, 2015 at 6:06 pm","url":"https://shroudstory.com/2015/05/30/colin-berry-on-sturp/","cat":"other_blogs","id":"comment-200623","author":"Dcn Andy","site":"shroudstory"},{"title":"Colin Berry on STURP","post":"daveb wrote:\n>There will never be another STURP, the Italians have seen to that, with their own peculiar agendas. \nWhy?\nSee, for example, what is possible to do with using new nanomechanical techniques:\n>The NanoTensile automated test system enables simplified tensile testing by providing materials researchers with a state-of-the-art instrument that solves various scale-related challenges involving exceedingly small specimens…\nLinks:\nhttp://www.hysitron.com/Portals/0/App%20Notes/nanoTensile%205000%20Sell%20Sheet.pdf\nhttp://en.wikipedia.org/wiki/Hysitron\n— —\nHere another vague reference:\n>Modulus mapping is a technique to map and display the mechanical properties of a material surface through joint actions of dynamic mechanical testing (nanoDMA) and in-situ SPM (scanning probe microscopy) imaging. A high frequency sinusoidal force is applied to the indenter probe while it is being raster scanned over a sample surface. The resultant displacement of the indenter probe at each pixel position then is analyzed for amplitude and phase lag from the dynamic force input signal. As a result, storage modulus, loss modulus and tangent delta of the material surface are quantified at each pixel position and displayed in a colored image. \nLink:\nhttp://www.ebatco.com/modulus_mapping.html\n— —\nThen I think is possible to test the precious samples (ancient linen fibrils) in a better manner with respect what was able to do  prof. Giulio Fanti in the past.\nI believe that this will also allow you to cut away all the lies that\nhave been said about the alleged painting, etc. … etc.\nI have confidence in the tools of modern science (when these tools are well applied in research on the Shroud).\n— —\nUnfortunately I have successfully completed only some subjects of\nthe course in Textile Engineering and therefore I have not earned\nthat degree in Engineering …\n\n","date":"May 31, 2015 at 7:47 am","url":"https://shroudstory.com/2015/05/30/colin-berry-on-sturp/","cat":"other_blogs","id":"comment-200668","author":"piero","site":"shroudstory"},{"title":"Colin Berry on STURP","post":"The problem has nothing to do with Italians or Americans, it is related to human nature.\n\n","date":"May 31, 2015 at 11:13 am","url":"https://shroudstory.com/2015/05/30/colin-berry-on-sturp/","cat":"other_blogs","id":"comment-200679","author":"Louis","site":"shroudstory"},{"title":"Colin Berry on STURP","post":"Louis I can tell you this much, I wouldn’t have wanted to be a member of the Episcopal faith the day when Cardinal Anastasio Ballestero received a letter from an ASSIST member pleading with him to return to the original C-41 protocol.\n\n","date":"May 31, 2015 at 5:18 pm","url":"https://shroudstory.com/2015/05/30/colin-berry-on-sturp/","cat":"other_blogs","id":"comment-200701","author":"Giorgio HSG","site":"shroudstory"},{"title":"Colin Berry on STURP","post":"Hi Giorgio\nCan you explain further?\n\n","date":"May 31, 2015 at 5:24 pm","url":"https://shroudstory.com/2015/05/30/colin-berry-on-sturp/","cat":"other_blogs","id":"comment-200703","author":"Louis","site":"shroudstory"},{"title":"Colin Berry on STURP","post":"Yes, The Turin authority was not pleased with “outsiders” criticizing the Holy Sea’s decision pertaining to the C-14 protocol. Truth be told, the Sindone is an Italian and Catholic artifact. \nEmphasis on Holy Sea.\n\n","date":"May 31, 2015 at 5:49 pm","url":"https://shroudstory.com/2015/05/30/colin-berry-on-sturp/","cat":"other_blogs","id":"comment-200704","author":"Giorgio HSG","site":"shroudstory"},{"title":"Colin Berry on STURP","post":"I really don’t see it that way. The Sindon is not an Italian and Catholic artifact, although it is in the possession of Italian Catholics. If the image of Edessa/Shroud are one and the same object it once belonged to Eastern Christians and before that to Jewish Christians of the Jesus movement.\nIf one condition stipulated by King Umberto I di Savoia before donating the relic to the Pope was that it would have to remain in Turin that does not make it an Italian Catholic relic. The Pope can be German, Italian, Argentinian and…, the Christians from various denominations, whether Catholic, Anglican, Protestant, Orthodox, even non-Christians who believe in Jesus, also have the right to feel they “own” the relic … because it is believed it once wrapped the body of Jesus.\nHow did it land in Italy?:\n    https://www.academia.edu/7447446/Was_there_a_link_between_the_Knights_Templar_and_the_Turin_Shroud_An_interview_with_Dr._Barbara_Frale\nAs for the “Holy Sea”, that is the human nature I mentioned previously.  Pope Francis is aware of that.\n\n","date":"May 31, 2015 at 6:19 pm","url":"https://shroudstory.com/2015/05/30/colin-berry-on-sturp/","cat":"other_blogs","id":"comment-200705","author":"Louis","site":"shroudstory"},{"title":"Colin Berry on STURP","post":"“the Christians from various denominations, whether Catholic, Anglican, Protestant, Orthodox, even non-Christians who believe in Jesus, also have the right to feel they “own” the relic … because it is believed it once wrapped the body of Jesus” \nLouis, I am in total agreement with your statement as long as it is the true burial cloth of Jesus,  however, to many of the  Italians who are primarily Catholics, the Sindone is their artifact. Even the wonderful Father Rinaldi showed his national pride in some of his correspondence between the Turin authority speaking out against American scientists who he felt stepped out of line by challenging the Holy Sea’s decision on the C14 protocol. What would you expect a loyal priest to do? His first obligation is his dominated faith.  As you stated in this link, the problem is human nature.\nAs far as King Umberto donating the relic to the Holy Sea, It was a respectful gesture allowed by the Italian government since all of the Savoie’s belongings were confiscated making them property of the Italian State including the Shroud of Turin. You can find a brief explanation in Relic, Icon or Hoax?: Carbon Dating the Turin Shroud\n By Harry E Gove.\n\n","date":"May 31, 2015 at 7:07 pm","url":"https://shroudstory.com/2015/05/30/colin-berry-on-sturp/","cat":"other_blogs","id":"comment-200708","author":"Giorgio HSG","site":"shroudstory"},{"title":"Colin Berry on STURP","post":"Great, Giorgio. We are on the same page now. I think the only mistake you made was by saying “property of the Italian State including the Shroud of Turin.” It seems that only the palace and the chapel, not the Shroud, were confiscated and the Carabinieri, also part of the army, are always there during an Exposition just as an honour guard because there is an agreement between the Vatican and the Italian State when it comes to security:\nhttp://www.demotix.com/news/7375609/exposition-holy-shroud-2015/all-media\n\n","date":"May 31, 2015 at 7:36 pm","url":"https://shroudstory.com/2015/05/30/colin-berry-on-sturp/","cat":"other_blogs","id":"comment-200711","author":"Louis","site":"shroudstory"},{"title":"Colin Berry on STURP","post":"Louis I still have to stand by my statement.  After 1946, all of the Savoys possession  were confiscated and he was exiled.\nIt’s hard to claim ownership when you have no possession of an article in question.\n\n","date":"May 31, 2015 at 8:40 pm","url":"https://shroudstory.com/2015/05/30/colin-berry-on-sturp/","cat":"other_blogs","id":"comment-200716","author":"Giorgio HSG","site":"shroudstory"}]
