[{"title":"Welcome to Colin Berry’s new Straw Shedder blog","post":"Oh man, what can one say? Here you have a man who claims to be a scientist and the ‘protector’ of “objectivity and the reputation of science”, then can make such a irresponsible claim that only “true believers” refuse to accept the C-14 evidence!….Seriously, that may be the most untruthful and unscientific comment I have ever heard! What about objectivity when talking about the ‘SINGLE’ C-14 test,..same sample done by three different labs, not representing the whole? What about; even a high school science student realizes/recognizes C-14 is not infallible and yes even prone to errors. No scientist would ever claim C-14 is the FINAL word…EVER! If one does they are just simply, IDIOTs and definately not being “objective” or scientific. One must remember ALL aspects of the item being tested must be weighed and one aspect alone carries very little weight on it’s own.\nAs for the C14 test done on the Shroud, Colin, be a man and admit your wrong, get over it and move on.\nAnyone with a sense of objectivity or with a slight bit of common sense would admit it was botched and move on. Move on, in lets push for more PROPER scientific testing of the Shroud.\nR\n\n","date":"March 17, 2012 at 11:20 am","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","id":"comment-9396","author":"Ron","site":"shroudstory"},{"title":"Welcome to Colin Berry’s new Straw Shedder blog","post":"You are allowed to believe the C-14 dating has produced a wrong answer, Ron. You are allowed to believe that the portion taken had been more than 50% replaced with more modern linen and/or cotton. You are allowed to believe it was done by fiendishly clever invisible weaving with cunningly dyed thread spliced end-to-end to resemble the original. You are allowed to believe Rogers’ designer vanillin decay curves. In fact, you are allowed to believe whatever you want.\nJust don’t expect me, a seasoned science bod, to believe that all this hot-under-the-collar special pleading represents objective science. Don’t try to draw me into your denialist flat-earther world, because, if the truth be told, I have seen this kind of thing over and over again, and it makes not the slightest impression on me.\nIf you don’t like what you hear, then the answer is simple. Get the Shroud custodians to repeat the C-14 dating. In the meantime, stop the whingeing, stop the name-calling, and reflect on the possibility that you are being taken for a ride, with this site providing the wheels.\n\n","date":"March 17, 2012 at 2:21 pm","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","id":"comment-9400","author":"colinsberry","site":"shroudstory"},{"title":"Welcome to Colin Berry’s new Straw Shedder blog","post":"I don’t care about all the points you mention in your first paragraph, they mean nothing to my  statement!…The simple fact that you and others can accept a ‘single’ radiocarbon dating test as ‘proof’ or ‘fact’ to the age of an object is just complete nonsense. Definately not “objective science” and I would say makes the field of science look much, much worse then anything you might claim about STURP or other Shroud science put forth.\n By you accepting the 1988 C-14 dating, as the means to end all question of the age of the Shroud, shows a complete lack of logic, scientific objectivity, honesty and dare I say bias. You know I’m right Colin. \nLet’s say they decided to carbon date the Declaration of Independence, and the tests came back at 1840 conclusively. Would everyone change the history books because of that one test? or would they take all other known and relevant information and conclude the ‘dating test’ must be wrong? …This is my point.\nR\n\n","date":"March 18, 2012 at 12:50 am","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","id":"comment-9410","author":"Ron","site":"shroudstory"},{"title":"Welcome to Colin Berry’s new Straw Shedder blog","post":"“…Definitely not “objective science” and I would say makes the field of science look much, much worse…\nIn just those few words alone, you have demonstrated why a site like my “strawshredder” was needed. Not content with  misusing the tools of science over decades, Shroudology and its camp followers are now attacking science and scientists for having come up with the wrong answer on the C-dating. \n“By you accepting the 1988 C-14 dating, as the means to end all question of the age of the Shroud, shows a complete lack of logic, scientific objectivity, honesty and dare I say bias.”\nThat is actually defamatory – character assassination in fact. I’m glad I set up the new site, to tell the world what happens to any scientist who attempts to tell it the way it is. Small wonder we have a virtually unchallenged edifice of pseudo-science from all those numerous Shroud symposia, aka “let’s make it up as we go along”.\nYou have provided an example of what I an minded to call “the New Dark Age of Unreason”, one in which the tools of science are first misapplied, and which then become weaponised and turned on any real scientist who has the temerity to protest. \nI am course recording all this for posterity on my own site…\n\n","date":"March 18, 2012 at 3:37 am","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","id":"comment-9412","author":"colinsberry","site":"shroudstory"},{"title":"Welcome to Colin Berry’s new Straw Shedder blog","post":"Like a mini-version of The Terminator, “He’s back!!”  A sad case, but not the first brilliant scientist with major achievements to his credit, who through obsession screws up in other research.  We only remember their successes, and overlook their failures.\n1) Aristotle’s Biology became a classic which survived into the European Enightenment, but he screwed up badly in his Physics.\n2) Robert Hooke, devised many inventions and devices for the Royal Society, including his invention of the microscope, but refused to accept Newton’s Theory of Light, and persisted in his belief that colours arose from a mixture of Darkness and Light.\n3) Johannes Kepler who first postulated the elliptic orbit of Mars, believed that the space between the planets was comprised of Platonic polyhedra.\n4) Galileo Galilei was unwilling to accept Kepler’s elliptic orbits, and preferred to maintain a Platonic ideal of circular motion for the planets and moon.\n5) Isaac Newton spent much of his final years in pursuing the mystical notions of Hermetic philosophy, and despite his universal renown, quarreled with everybody, including tearing out several pages from his Prinicipia which referred to John Flamsteed’s work.\n6) Few scientists in the 17th c would accept the pioneering work of Niklaus Steno in geology, but preferred to believe that fossil shells either grew in the parent rock or were the remnants of the Noachian flood.\n7) Huygen’s theory of light as a wave gave way to Newton’s theory that light was comprised of corpuscles.  When Thomas Young’s experiments with interference patterns demonstrated that light was indeed a wave there was an outcry from scientists in Britain offended that their hero was being challenged.  It was left to the European Fresnel to develop the wave theory of light.  Even so the wave character of light must have been evident to Newton from his light rings observable during lens grinding and the fringe patterns at the edges of his prism colours.\n9)  Despite chemists working on the hypothesis of an atomic theory for some 100 years, Ernst Mach would not accept Boltzmann’s atomic theory working from statistical mechanics, declaring as late as 1905 that he did not believe in atoms which were merely conjectural.  Mach’s influence with the European academies resulted in Boltzmann committing suicide.\n10) Albert Einstein could not accept the random behaviour of quanta, and spent the last years of his life fruitlessly searching for underlying variables that did not exist.\n11)  Einstein had demonstrated that no object with mass could exceed the speed of light, as otherwise the mass would become infinite.  Recent LHC work indicates that neutrinos may very well exceed the speed of light.\nAll these men had remarkable scientific achievements to their credit, yet they were clearly not infallible, and their obsession with some pet theory would sometimes lead them well astray and off the mark.\nWe need to remember this when faced with unsupported narrowly-focused pontifications from a scientist with much to his credit, and whose principal defence appears to accuse his opposition of pseudo-science, or of claims of personal ad hom arguments.\nWith so much unknown about the origins of the Shroud image, it is unfortunate that so much effort is being expended on a lame-duck theory, when there may well be more fruitful lines of enquiry to pursue.\n\n","date":"March 17, 2012 at 5:45 pm","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","id":"comment-9406","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Welcome to Colin Berry’s new Straw Shedder blog","post":"The most defining characteristic of the Shroud image is its negative, i.e. light/dark reversed character. Yet it is invariably the reversed image that fronts any publicity. Scarcely if any comment in the Shroud literature is given to the reasons why that image with no known photographic emulsion should be a negative. Well, previous researchers may have opted to neglect that most defining of characteristics, and have foisted on their readers vague allusions to radiation without any known focusing system or other image-creating mechanism, but this old science bod will continue to plough his lonely furrow with or without votes of confidence in his scientific competence. I’ve been out on a limb before, and never had occasion to regret it later. There’s always a first time, of course, but until someone here can offer an explanation for that negative image, then I for one shall not be nervously looking over my shoulder. \nAre you reading this, all you big shot Jacksons, Schwortzes, Porters, Di Lazzaros etc etc ? Come on: if you know so much more than me about the Shroud, then explain that negative image. If you can’t, then stop expressing surprise and dismay that I should continue to assert that we are looking at a contact scorch.  Instead be thinking of ways of verifying or falsifying an entirely reasonable and rational proposition.\nCome on now. Rise to the challenge, anyone and everyone. Explain what mechanism other than physical contact with a hot surface, without an air gap, is capable of producing a negative image…\n\n","date":"March 17, 2012 at 7:29 pm","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","id":"comment-9408","author":"colinsberry","site":"shroudstory"},{"title":"Welcome to Colin Berry’s new Straw Shedder blog","post":"Daveb, the more recent experiment with neutrinos after fixing some previous errors shows that neutrinos move below the speed of light, thus making Einsteins theory more solid than ever.\nhttp://news.cnet.com/8301-30685_3-57398740-264/not-so-fast-neutrinos-cern-says-lights-speedier-still/\nAlso, light is currently accepted to have a double behaviour as a wave and as corpuscle. That discussion belongs to the 20’s http://www.nature.com/nature/journal/v117/n2937/abs/117236a0.html\nhttp://www.nobelprize.org/nobel_prizes/physics/articles/ekspong/\n\n","date":"March 17, 2012 at 6:59 pm","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","id":"comment-9407","author":"Gabriel","site":"shroudstory"},{"title":"Welcome to Colin Berry’s new Straw Shedder blog","post":"Colin, how dare you say, “Just don’t expect me, a seasoned science bod, to believe that all this hot-under-the-collar special pleading represents objective science. Don’t try to draw me into your denialist flat-earther world, because, if the truth be told, I have seen this kind of thing over and over again, and it makes not the slightest impression on me.” \nYou were speaking of course about the carbon dating. I recently served on jury duty. First the prosecution made their case. The police evidence was clear. He was guilty, it seemed. Then the defense brought forth some excellent chemists. They disassembled the prosecutions case, piece by piece. For all the world it was clear now, he was not guilty. We retired to deliberate. But an stuborn, retired “police bod” could not accept the possibility that the police labs had been wrong. He held out for four days before the judge declared a mistrial. An innocent man will be retried because of jury nullification by irrational denialism. \nColin, you are clearly the xxx denialist, here. The evidence that the carbon dating was messed up is overwhelming. At the very least there is reasonable doubt and the evidence must be set aside. Seasoned science bod, ha. Questioning is what science is supposed to be about. (xxx represents editing. Dan)\n\n","date":"March 18, 2012 at 5:20 am","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","id":"comment-9413","author":"Paulette","site":"shroudstory"},{"title":"Welcome to Colin Berry’s new Straw Shedder blog","post":"Correction, last paragraph: change the evidence must be set aside to the carbon 14 test results must be set aside.\n\n","date":"March 18, 2012 at 5:24 am","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","id":"comment-9414","author":"Paulette","site":"shroudstory"},{"title":"Welcome to Colin Berry’s new Straw Shedder blog","post":"On the contrary, Paulette, it is you and some others here who are acting as, prosecution counsel, expert witness, judge and jury – all rolled into one. And why? Because you do not like the initial verdict. \nIf you consider the initial verdict wrong, then kindly stop biting the head off someone who  acknowledges the less-than-ideal restrictions placed on the sampling of the fabric, as I’m sure would the carbon-dating labs themselves. \nBut I am not prepared as you are to reject the results out of hand, and see your objections, indeed contempt of the testing protocols and three laboratories as self-serving. I see too much partisan clutching at straws, or in Ray Rogers’ case that allegedly single spliced thread. If you think the result is non-reproducible, then there is a simple answer. Campaign instead for the testing to be repeated, instead of attacking science and the scientists.  \nNext time, see that the labs get multiple random samples, instead of being fobbed off as they were with one strip from a corner (which can then be oh so conveniently described as  “unrepresentative” or better still “repaired” when it returns the wrong answer).\n\n","date":"March 18, 2012 at 5:47 am","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","id":"comment-9416","author":"colinsberry","site":"shroudstory"},{"title":"Welcome to Colin Berry’s new Straw Shedder blog","post":"Colin, we don’t know how the image is formed. Oh, yes, some of us may have pet theories, favorite hypotheses. Some of us day dream about possibilities – the mustard seed of science. We have taken up the challenge and so far have failed. We don’t know how the image is formed. Nor do you.\nWe admit it freely. You do not.\nWhat have you done? You’ve scorched some linen. You’ve shown that it can produce a negative image. Good start. But can scorching produce a superficial image? You have tried to show that it can by scorching an onion skin, easily 1000 times as thick as the image, placed over a piece of linen and shown that the linen underneath was not scorched. That experiment is fraught with so many problems that it cannot even be thought of as a scientific experiment. (One might even suspect that there was some confusion between microns and nanometers). On the other hand Di Lazzaro showed and explained why scorching could not produce a superficial image on a fiber. Unable to criticize his work, you, like the creationist-scientists who ignore fossil records while claiming that dinosaurs walked the earth among the offspring of the biblical Adam and Eve less that 10,000 years ago, have decided to simply ignore factual scientific observations.\nYou write, “If you can’t, then stop expressing surprise and dismay that I should continue to assert that we are looking at a contact scorch. Instead be thinking of ways of verifying or falsifying an entirely reasonable and rational proposition.”\nSurprised, yes; dismayed, no. We have suggested many ways to verify your assertion that it is a scorch. You tried to get away by telling us that it was up to us to prove you wrong. Wrong! (One might even suspect that there was some confusion between falsifiability and falsificationism). \nIt is simple, my friend. Provide evidence of 1) a fiber scorched by your methods that is scorched only to a depth of 200 nanometers, 2) a yarn segment which is also superficially scorched only to a depth of two or three fibers, 3) a piece of linen cloth that is scorched on the reverse side as well as the front as is the case with the hair and mustache of the man whose image is “somehow portrayed” on the shroud, 4) a bit of scorch image removed from the surface of linen cloth by sticky tape, 5) a scorched image on cloth that is extremely faint or an explanation that is more than unscientific speculation as to how the scorch faded with time and 6) a demonstration of shading by scorch that replicates the halftone effect seen in the shroud. \nColin, unless you can demonstrate most of these characteristics experimentally and not by verbal contortionism , I am far more inclined to think that Leonardo da Vinci created the shroud with proto-photographic methods and I’m about 100% certain that he didn’t.\n\n","date":"March 18, 2012 at 5:35 am","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","id":"comment-9415","author":"Dan","site":"shroudstory"},{"title":"Welcome to Colin Berry’s new Straw Shedder blog","post":"As I said on a previous occasion,  Dan, I now refuse to be drawn into discussing here the fine detail of the science and technology, given the previous lacing of replies, yours included with ad hom asides,\nIf you really wish to discuss experimental protocols etc, then it will have to be on my site, where I reserve the right to block comments from those who persistently make personal attacks. (Nope,unlike you I do not pre-moderate beyond the first comment (WordPress default) or threaten to edit in a control-freak fashion – I block entirely if I begin to feel insulted or intimidated. \n But I will say this. You and others suddenly seem highly expert and knowledgeable about scorching, and what it can and cannot achieve. Perhaps you could supply some links to yours or others’ published work on cellulose and hemicellulose pyrolysis.\n  But please omit Paolo Di Lazzaro’s with his hot euro coin experiment, the one you reported here not so long ago, which was performed at a single arbitrary temperature, based on literature values for pyrolytic weight loss. It is not weight loss that is the relevant criterion in the present context, but visibility to the naked eye, e.g. that of a medieval pilgrim, of a scorched-on image.The latter may well be achievable at temperatures lower than those that result in weight loss. I notice that he failed to respond to my objection, or my own experiments with heated coins, and later with good old English horse brasses.\n\n","date":"March 18, 2012 at 6:37 am","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","id":"comment-9417","author":"colinsberry","site":"shroudstory"},{"title":"Welcome to Colin Berry’s new Straw Shedder blog","post":"Gabriel, Thanks for the catch-up ref re neutrinos, I’ll follow it up (“… may very well …” =  I was leaving it open either way).  I’m well aware of the dual nature of light, thank you very much.  Purpose of the litany was to make the point that even great achievers are not infallible, particularly when obsessed.  By the way, how’s Schrodinger’s cat?\nI think I may have an explanation why the discussion re “scorching” has been going absolutely nowhere for some little time now.  I thought it seemed I recognised the symptoms from some undergraduate reading many long years ago.  I searched my Encyc Brit on “Freud” and “projection” – came up with this set of extracts:\n1  “Defense Mechanism –  in psychoanalytic theory, any of a group of mental processes that enables the mind to reach compromise solutions to problems that it is unable to resolve. The process is usually unconscious, and the compromise generally involves concealing from oneself internal drives or feelings that threaten to lower self-esteem or provoke anxiety.”\n2 “Projection is a form of defense in which unwanted feelings are displaced onto another person, where they then appear as a threat from the external world. A common form of projection occurs when an individual, threatened by his own angry feelings, accuses another of harbouring hostile thoughts.”\n3 “Denial is the conscious refusal to perceive that painful facts exist. … ”\n4  “Rationalization is the substitution of a safe and reasonable explanation for the true (but threatening) cause of behaviour.”\nI should also add that the extract has this rider: “…defensive activity is in itself considered no sign of pathology.”\nThere is nothing ad hom intended about this, it is after all a reputable source.  It’s just that I for one am getting just a little bit tired of so much circular argumentation, when I would prefer some genuine enlightenment for a pleasant change, my main purpose in visiting this site.\n\n","date":"March 18, 2012 at 6:53 am","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","id":"comment-9418","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Welcome to Colin Berry’s new Straw Shedder blog","post":"I hope I am not  expected to respond to all that psychobabble claptrap – which is of course more DaveB-ish ad hom, the kind he revels and excels in, despite his preemptive attempt at denial.\nAnyone here who still has their feet on terra firma, and a head addressing the scientific essentials – instead of fashioning these oh-so-lovingly-crafted putdowns –  might care to take a quick look at an image from my own site. It demonstrates the amazing ability of a scorch to capture detail that can then be computer-enhanced:\n King George VI \nYes, it is a scorch mark obtained simply by pressing hot brass onto linen, then inverting the image back to a positive, and then given a little 3D enhancement so as to more closely resemble the original brass. Amazing, wouldn’t you say? One can even read the lettering.\nEach time I look at the post-19th century reversed image of the man in the Shroud, and am tempted to think “How could a scorch generate so serene, so soft-focus an image, merely by converting pseudo-negative sepia-tints to positive silver grains or digital equivalent – I think of my King George VI horse brass…\nI am now minded to make my horse brass the subject of my next post, as a way of addressing the collective blind spot that exists in the Sindo-no-logic-al community…\n\n","date":"March 18, 2012 at 7:34 am","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","id":"comment-9419","author":"colinsberry","site":"shroudstory"},{"title":"Welcome to Colin Berry’s new Straw Shedder blog","post":"In this discussion we are jumping from one difficulty to another at the speed of neutrinos :-) but I will like to focus on the C14 issue (just a few comments before) because in the eyes of the scientific community the paper in Nature is currently the major difficulty against the authenticity of the Shroud. It also seems to be so for Collin Berry.\nI usually act as a reviewer for a couple of JCR journals and it seems to me very unlikely the hypothesis of a conspiration in 1988 around the Nature paper to falsify results for non scientific reasons. Publishing a paper in Nature is a very diffciult task and only very solid works get published (OK, I know about the case of the corean guy!). Perhaps some methodological mistakes were made at the sampling stage, but as a whole, I tend to think that according to the knowledge that was available (crucial remark!) in 1988 the results were correct.\nHOWEVER\nAt that time it was believed that the C14 test was appliable to almost anything. Now we know that the C14 test has got its limitations, and more specifically, when applied to ancient linens, relevant and serious studies (1) published a decade later indicated that the C14 test is not appropiate to datate ancient linens like the Shroud. This is how science moves forward.\nMy position is that the C14 test was carried out correctly but NOW (and not in 1988) we know that the C14 methodology is not appliable to the Shroud. For that reason, I think that the issue of the age of the Shroud still remains open.\nIn my opinion, this is why the Church who always gets very good scientific advice, will never repeat a C14 test and will move to more promising and breaking-edge technologies and methodologies to elucidate the origin of the Shroud.\n(1) H.E. Gove, S.J. Mattingly, A.R. David, L.A. Garza-Valdes. A problematic source of organic contamination of linen.Nuclear Instruments and Methods in Physics Research B 123 (1997) 504-507\n\n","date":"March 18, 2012 at 8:56 am","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","id":"comment-9421","author":"Gabriel","site":"shroudstory"},{"title":"Welcome to Colin Berry’s new Straw Shedder blog","post":"\ncolinsberry :“…Definitely not “objective science” and I would say makes the field of science look much, much worse…\nIn just those few words alone, you have demonstrated why a site like my “strawshredder” was needed. Not content with misusing the tools of science over decades, Shroudology and its camp followers are now attacking science and scientists for having come up with the wrong answer on the C-dating.\n“By you accepting the 1988 C-14 dating, as the means to end all question of the age of the Shroud, shows a complete lack of logic, scientific objectivity, honesty and dare I say bias.”\nThat is actually defamatory – character assassination in fact. I’m glad I set up the new site, to tell the world what happens to any scientist who attempts to tell it the way it is. Small wonder we have a virtually unchallenged edifice of pseudo-science from all those numerous Shroud symposia, aka “let’s make it up as we go along”.\nYou have provided an example of what I an minded to call “the New Dark Age of Unreason”, one in which the tools of science are first misapplied, and which then become weaponised and turned on any real scientist who has the temerity to protest.\nI am course recording all this for posterity on my own site…\nGo ahead Bod, post it and then maybe people will see just how illogical you really are being.\n The point I am making seems to be lost here by everyone and that being; that archaeologists DO NOT regard 14C dates as being “ABSOLUTE” because of frequent anomalies-(Most 14C technicians will admit this also). They (archaeologists), rely more on dating methods that link into historical records. So basically for anyone involved to accept a single 14C dating as the ‘final answer” is rediculous, it is just not so!…simple. There are far too many issues with 14C dating to be so conclusive, especially if much in the line of radiocarbon dating is assumed. Get my point?\nNo one being “Objective”, especially the scientists involved can say with a clear conscience the 1988 14C dating is conclusive in any way. This is just simple logic I’m talking here. But you know this already, right Bod? I’m not saying anything against the truth here. So why all the opposition to the truth on radiocarbon dating?\nR\n\n","date":"March 18, 2012 at 2:29 pm","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","id":"comment-9424","author":"Ron","site":"shroudstory"},{"title":"Welcome to Colin Berry’s new Straw Shedder blog","post":"That’s the point.\nPr Ramsey said we should have a comprehensive and coherent approach.Modern C14 dating is included in a multidisciplinary approach and a critical look is accepted.\nIn 1986, scientists may have overlooked the limits of C14 dating.\n\n","date":"March 19, 2012 at 6:34 am","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","id":"comment-9443","author":"anoxie","site":"shroudstory"},{"title":"Welcome to Colin Berry’s new Straw Shedder blog","post":"I believe that a reputable authority such as Encyclopaedia Britannica would not indulge in “psychobabble”, but qualifies its remarks quite clearly “… in psychoanalytic theory …”\nColin seems to think it’s ad hom argument; Strange, I didn’t say as to where or to whom it might apply.  I’m quite capable of recognising how recourse to “defence mechanisms” might very well apply to myself in certain stressful situations.\nLet those who can read, judge for themselves how it might apply elsewhere! \nAgreed that the King George positive image is indeed very clear.  I wonder to what depth the original negative penetrated?  But that’s not stated!  \nAs I mentioned previously, I’d prefer to see a move onto some other more enlightening topics for a change, rather than giving any further traction to this scorching hypothesis, which seems to be going nowhere.\n\n","date":"March 18, 2012 at 4:04 pm","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","id":"comment-9426","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Welcome to Colin Berry’s new Straw Shedder blog","post":"I agree. It is not going anywhere.\n\n","date":"March 19, 2012 at 4:31 am","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","id":"comment-9441","author":"Dan","site":"shroudstory"},{"title":"Welcome to Colin Berry’s new Straw Shedder blog","post":"Gabriel, I checked out the CERN site on speed of neutrinos, and sure a rerun showed them travelling more sedately, and they’re looking at a faulty connection.  However a follow-up showed that there was also another problem which may have biased the results the other way.  I guess “Watch their space” for further developments.  \nYour comments on C14 dating, seem to overlook the important aspect of a poor sample; It seems that few are taking a conspiracy theory seriously, and the dating might not be too far out as far as the sample goes.  The variation in vanillin content between sample and parent material is surely significant, together with excessive cotton contamination of the sample, Result = GIGO! but I take your point that C14 testing may not be applicable to testing of ancient linens for a whole variety of reasons.\nThe dogmatic assertions made by supporters of the 1988 C14 tests contrasts sharply with the more enlightened approach taken by CERN in respect of neutrino speed: \n“The evidence is beginning to point towards the OPERA result being an artifact of the measurement,” said CERN Research Director Sergio Bertolucci in a statement today. However, to be rigorous about the matter, the laboratories plan to rerun the experiment in May and cross-check it with data involving cosmic ray particles. \n“Whatever the result, the OPERA experiment has behaved with perfect scientific integrity in opening their measurement to broad scrutiny, and inviting independent measurements,” Bertolucci said. “This is how science works.”  \nI particularly like Signor Bertolucci’s final comment: “This is how science works.”\nMaybe someone should tell the C14 labs!\n\n","date":"March 18, 2012 at 5:51 pm","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","id":"comment-9429","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Welcome to Colin Berry’s new Straw Shedder blog","post":"La teoría de la conspiración fue favorecida por la actitud y declaraciones de los responsables de los propios laboratorios……\nEl laboratorio de Zurich preparó para la BBC un montaje fotográfico IMPOSIBLE mostrando las muestras y submuestras que fueron datadas. Aunque se conocía por la descripción que de él hizo Bonnet-Eymard cuando se lo mostró el Prof: Woelfli que lo tenía en su despacho, la foto no fue publicada hasta el 2005 por ETH Life International, newsletter del Swiss Federal Institute of Technology Zurich, al que pertenece el laboratorio que dató la Sábana por el C14.\nhttp://archiv.ethlife.ethz.ch/e/articles/sciencelife/turin.html \n\nLas 3 submuestras Z1.1.1, Z1.1.2 y Z1.1.3  NO PUEDEN PROCEDER  de la muestra Z1.1 (entre otras varias cosas la “raspa” de la “espina de pez” típica del tejido y que aparece en Z1 y en Z1.1, tenía que aparecer en alguna de las 3 submuestras que se “quemaron”……)\nSi alguien conoce la SOLUCIÓN del puzzle, probablemente Colin, que la explique…….\nY si hay ERRORES, que no se han reconocido, en algo tan simple como realizar ESE montaje fotográfico para la BBC, cualquiera sabe qué fue lo que se “quemó”……\n[El Prof. Hull, del laboratorio de Arizona nos sorprendió a todos hace poco tiempo al decirse poseedor de una submuestra que según Nature estaba “quemada” (DATADA)]\n\n","date":"March 18, 2012 at 7:12 pm","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","id":"comment-9432","author":"corneliotel","site":"shroudstory"},{"title":"Welcome to Colin Berry’s new Straw Shedder blog","post":"Google translation:\nThe conspiracy theory was favored by the attitude and declarations of the heads of the laboratories themselves ……\nThe Zurich laboratory for the BBC prepared a photo montage showing IMPOSSIBLE samples and subsamples were dated. Although it was known by the description of Bonnet-Eymard he did when he showed Prof: Woelfli I had it in his office, the photo was not published until 2005 by ETH Life International, newsletter of the Swiss Federal Institute of Technology Zurich, to which the laboratory that dated the Shroud by the C14.\nhttp://archiv.ethlife.ethz.ch/e/articles/sciencelife/turin.html\n\nThe 3 sub Z1.1.1, Z1.1.2 and CAN NOT PROCEED Z1.1.3 sample Z1.1 (among several other things the “scraping” of the “fishbone” typical tissue and appears in Z1 and Z1 .1, had to appear in any of the 3 sub-samples that are “burned” ……)\nIf anyone knows the solution of the puzzle, probably Colin, that the explain …….\nAnd if there are errors, that have not been recognized, something as simple as making ESE photomontage for the BBC, who knows what it was that was “burned” ……\n[Prof. Hull, the Arizona Laboratory surprised everyone recently the owner of a subsample said that as Nature was “burned” (dated)]\n\n","date":"March 19, 2012 at 4:28 am","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","id":"comment-9440","author":"Dan","site":"shroudstory"}]
