[{"title":"Colin Berry takes advice from daveb","post":"Reminder: I first paraphrased CB’s second blog title (The Turin Shroud: but for the pseudo-science it might have been dismissed long ago) writing (on January 9, 2013 at 1:20 pm | #6)\n“Re CB’s scorch theory: but for the pseudo-Knight-Templar history and archaeology and the pseudo-blood-stained pattern analysis that back it up it might have been dismissed from the very start as a Mickey Mouse theory. CB should better stick to what he is really an expert in as far as science is concerned rather make incursions in fields of expertise he is totally ignorant namely Knights Templar History and Archaeology, (Archaeological) Blood-Stained Pattern Analysis [and Medieval Art History].”\nYesterday I also paraphrased CB’s third blog title as I wrote: “(Just in case CB had finally become aware naturally pre-mordanted linen once mordanted can also look like very lightly scorched or pre-scorched linen), I would suggest CB a more suitable blog title: “The Turin Shroud: late antique natural mordanting or medieval scorch? Separating the science from the pseudo-science, the archaeology from the pseudo-archaeology, the history from the pseudo-history”…\n (After I reminded him yesterday his scorch allegedly “historical and scientific” hypothesis is based on:\n–     His FANCIFUL/PSEUDO-interpretation of a medieval piece of art (the Lirey badge)\n–     A NON-RELIABLE draft memorandum (D’Arcy’s)\n–     Avignon Antipope Clement VII’s bull PSEUDO-final version\n–     A NON-RELIABLE C14 dating\n–     UTTER IGNORANCE of Archaeological Blood-Stained Pattern Analysis and Medieval Art History (as he just cannot discriminate between genuine aged re-dried remoistened dried human blood of a crucifixion victim on the Shroud and medicinal leech digesta with leeches being used as felt-tipped-pens to fake up the blood imprint\n–      “I THINK I SEE” (the body image does look like a scorch) \n  Will Colin Berry change the title of his blog again?\n\n","date":"February 14, 2013 at 10:44 am","url":"https://shroudstory.com/2013/02/14/colin-berry-takes-advice-from-daveb/","cat":"other_blogs","id":"comment-24229","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry takes advice from daveb","post":"On January 13, 2013 at 9:44 a | #8, I re-wrote the same “Reminder”:\n“Reminder (as long as B. Colin’s web-site heading stands): “CB scorchography thesis: but for the pseudo-Knight-Templar-history-and-archaeology and the pseudo- (archaeological) bloodstained-pattern-analysis that back it up, it might have been dismissed long ago as a Mickey Mouse theory”. Forensically speaking CB is FAR from being as smart and reliable as Prs. Bucklin, Baima-Bollone and Zugibe when it comes to detect and identify bloody wounds from the TS whether from photographs or directly from the piece of cloth.\nDid Colin Berry change his blog title because of my reiterarated reminding him of his historical, archaeological and blood stained pattern analytical shortcomings/illiteracies?\n\n","date":"February 14, 2013 at 12:30 pm","url":"https://shroudstory.com/2013/02/14/colin-berry-takes-advice-from-daveb/","cat":"other_blogs","id":"comment-24244","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry takes advice from daveb","post":"Typo: his allegedly “historical and scientific” scorch hypothesis\n\n","date":"February 14, 2013 at 10:46 am","url":"https://shroudstory.com/2013/02/14/colin-berry-takes-advice-from-daveb/","cat":"other_blogs","id":"comment-24231","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry takes advice from daveb","post":"I’m somewhat mystified by that reference to daveb in the title, as he may be too, since I tweaked the appearance of my site some 17 days ago, adding this to a comment:\n“Observant readers may note I have manicured the site’s appearance today: there is a new less aggressive title and accompanying message, new background to fill in blank space to left and right of the content. The repeating images in that previously blank space were obtained by taking a ShroudScope image of the face, adding some contrast, then showing the result of light/dark reversal (“inversion”) in ImageJ, followed by 3D enhancement. So folk can see at a glance the iconic features of the Shroud image that arise through modern stepwise processing (conversion of the “photographic negative”, correction, thermographic negative, to a positive, as per Secondo Pia, then the demonstration of so-called “encoded 3D information”. Forget the mystique: in fact nothing is encoded – certainly not digitally – except by via analogue/tactile reproduction, like a gramophone needle in a groove. The ImageJ software simply reads image intensity as height on the z axis above the xy plane). More importantly, one can see that the same transformations are attainable in principle by starting with a thermal imprint (“scorch”) from a heated template (see banner, with my Ghanaian trinket as bas-relief template).”\nAll very teccie, boring even, mere housekeeping.  Move along folks. Nothing to see here…\n\n","date":"February 14, 2013 at 3:39 pm","url":"https://shroudstory.com/2013/02/14/colin-berry-takes-advice-from-daveb/","cat":"other_blogs","id":"comment-24272","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry takes advice from daveb","post":"I had assumed that Dan’s heading might have been connected to a comment I’d made on his posting of Jan 12: “Stop taking cudgels to each other?” – It was a very thoughtful piece uplifted from Colin’s site.  I’d commented: \n“This looks like a welcome peace offering from Colin. I think it is thoughtful and well-written. However, let us not forget that Colin’s web-site seems to be agenda driven, with its heading “The Turin Shroud: but for the pseudo-science it might have been dismissed long ago as a medieval fake” Contrast this with the more circumspect heading on Dan’s site intro – “Is the Shroud real? Probably.” Colin would win more friends if he was less provocative as to his intentions, and could demonstrate a modicum of open-mindedness about even the possibility of authenticity. However I particularly like the point he makes about “known unknowns” and “unknown unknowns” – for I suspect there are many such. In the meantime “Peace!” and let us hope that it is more than just a “Cease-fire!” ”\nLong may it continue! And of course Colin has now removed his agenda-driven heading! Does this make the agenda les transparent?  I wonder.\n\n","date":"February 14, 2013 at 4:10 pm","url":"https://shroudstory.com/2013/02/14/colin-berry-takes-advice-from-daveb/","cat":"other_blogs","id":"comment-24279","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Colin Berry takes advice from daveb","post":"I’d forgotten that, daveb. I suppose it may have influenced my decision to soften the title, maybe not. But it’s all somewhat academic now, given I’m now minded to return to a  harder line. Why? In a word – pseudoscience. It keeps on coming in an unremitting stream. Nuff said.\n\n","date":"February 14, 2013 at 5:36 pm","url":"https://shroudstory.com/2013/02/14/colin-berry-takes-advice-from-daveb/","cat":"other_blogs","id":"comment-24288","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry takes advice from daveb","post":"It’s your site, so it’s your call.  And I agree there’s a lot of pseudo-science out there.  If I may paraphrase what Max Patrick Hamon has mentioned from time to time, the Shroud is not merely the most studied ancient object in history, it’s also the most badly studied. But bear in mind, that those striving to penetrate its mystery are not so very different from yourself, voluntary enthusiasts mainly, some perhaps with an agenda, some with a pet theory, some just merely hoping to discover something new.  There are no large chemical or drug corporates behind it funding the research to discover a new product to sell, not even a formal research foundation nor a University looking for a doctoral thesis.  Mainly just amateurs, mostly with a professional background, perhaps a spare time or voluntary retirement project. This constrains what can be done. \nA hard line has only paid off occasionally in the history of scientific research.  More often the answer has been found in some kind of serendipitous synthesis of ideas.  Of one thing I am certain: That a closed mind and uncompromising pre-judgements have no place in a spirit of true and honest scientific enquiry.  That way leads to failure and inevitably to bitter disappointment!\n\n","date":"February 15, 2013 at 3:43 am","url":"https://shroudstory.com/2013/02/14/colin-berry-takes-advice-from-daveb/","cat":"other_blogs","id":"comment-24335","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Colin Berry takes advice from daveb","post":"Well, I shall think long and hard about your final words of reproof – that “hard line” being counterproductive etc. I’m not entirely clear about the logic there – how taking a hard line against perceived pseudoscience can somehow impede one’s own scientific investigations, especially those of a kitchen scientist/blogger who reports directly online. All my own findings are easily verifiable (or not) by anyone willing to spend a few hours, minutes even, doing what I have done, and quickly separating fact from fiction. Fact – it is perfectly possible to obtain a superficial scorch at the limit of visibility with no reverse side discoloration. Fiction (from  Paolo Di Lazzaro and John Jackson) – it is impossible to get a superfical scorch without reverse side scorching (conveniently overlooking that some parts of the Shroud DO show reverse side scorching).\nAs for the idea that there is no difference between me and other Shroud researchers, there is much I might say to disabuse you of that starry-eyed idealism. Here’s a clue: think modern-day Crusader, in search of the Holy Grail, then look at the letters after the names of the two authors of that outrageous so-called ‘critical review’ from Jackson’s Shroud Center of Colorado.  In short, daveb, don’t you dare bookend me with those other so-called agenda-driven researchers. I’m simply anti-pseudoscience. The Shroud controversy is just one of my many interests where science interfaces with society and its current concerns. Nuff said (here at any rate).\n\n","date":"February 15, 2013 at 4:32 am","url":"https://shroudstory.com/2013/02/14/colin-berry-takes-advice-from-daveb/","cat":"other_blogs","id":"comment-24339","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry takes advice from daveb","post":"I see nothing wrong with taking a hard line against any kind of Pseudo-science.  But in that case, one’s own work needs to be beyond reproach.  My own comments on various postings on the Siefker & Spicer so-called Critical Review are a matter of record.  Robert W. Siefker, M Th, KHS, KC, retired engineer; Daniel S. Spicer, Ph.D, KHS, KC, Professor of physics.  I would have respect for Professor Spicer’s PhD, presumably in Physics.  M.Th. I take to be a university qualification in Theology, The KHS & KC are unknown to me, but perhaps it is possible they may be Air Force qualifications.  \nBut if any comparisons are to be made with the best research work that has been carried out on the Shroud, I doubt if these two gentlemen would be prominent in my short list. \nSome excellent research has been carried out, mainly in the fields of pathology and forensics, now somewhat ancient history.  That is why I think that any programme aimed at demonstrating that the Shroud is a man-made artifact using a type of metal template is doomed to failure.  It can only have value as a type of personal entertainment.  However, if you are able to show that the image was indeed created by some type of scorch-like mechanism, then it could not have been a naturalistic phenomenon, and in view of the forensics, you are then left with seeking an explanation of how an uncorrupted corpse could have brought this about.\n\n","date":"February 15, 2013 at 7:14 am","url":"https://shroudstory.com/2013/02/14/colin-berry-takes-advice-from-daveb/","cat":"other_blogs","id":"comment-24353","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Colin Berry takes advice from daveb","post":"You will find neither KHS nor KC in any recognized list of  US-recognized postnominal letters/initials (see wiki). That’s because they are not recognized postnominal qualifications. They are bestowed by the Holy See/Vatican/Pope. So what are they doing on a supposedly scientific paper (” A Critical Summary etc.)? What does this say about the scientific objectivity and credibility of the Shroud Center of Colorado?\nAs for the scorch theory, I have two posts planned. The first (today) will suggest how the technology can be tweaked to get a fuzzy image with a somewhat ghost- like quality and explain the stochastic distribution of pixel density.. The second, probably tomorrow, will have “calumny” in its title, and will name the chief offenders, several of whom have used Dan’s site in comments or guest postings etc here to attack scorching, and in most cases have failed to acknowledge my responses (“hit-and-run” tactics).\n\n","date":"February 15, 2013 at 7:38 am","url":"https://shroudstory.com/2013/02/14/colin-berry-takes-advice-from-daveb/","cat":"other_blogs","id":"comment-24356","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry takes advice from daveb","post":"Supercilious Colin Berry shows us how super silly the Shroud Center of Colorado is.\n\n","date":"February 15, 2013 at 2:18 pm","url":"https://shroudstory.com/2013/02/14/colin-berry-takes-advice-from-daveb/","cat":"other_blogs","id":"comment-24382","author":"Frank Ly","site":"shroudstory"},{"title":"Colin Berry takes advice from daveb","post":"NATURAL CLOTH-TO-CORPSE ARCHAEOLOGICAL THERMAL PRINTING \nReminder for Colin Berry et al: \n  Archaeo(crypto)logically speaking, in the most likely hypothesis the TSM is Yeshu’a, a natural cloth-to-corpse thermal imprinting should account in turn for a high resolution superficial body image, undisturbed bloodstains and a two thousand years’ old degraded blood still looking fresh on the cloth. To trigger up such an accidental/providential image formation process, it requires: \n1/pre-mordanting conditions (i.e. burial linen cloth in-soaked with aqueous alkaline solution such as the Red Heifer waters and/or Jerusalem limestone/Malky dust mixed with waters + ammonia present in urea residues)\n2/auto-collimation (body covered with “opaques” present in the Judean desert and/or Jerusalem limestone/Malky dust + long inner burial linen cloth first tautly wrapped lengthwise and then compressed widthwise around body + next to skin-to-cloth contact followed by gradual loss of next to skin-to-cloth contact through burial inner sheet shrinkage and relative loosening as it gets sort of taut again front and back and gradually unstuck from deceased’s body the latter resting in extra height and being laid first on its left side and then right side while drying out\n3/heating source such as corpse in hyperthermia and/or fumigation as a purifying and drying-out ritual. \n  Naturally pre-mordanted linen once naturally mordanted looks like a very light scorch or “pre-scorch”.\n\n","date":"February 16, 2013 at 12:50 pm","url":"https://shroudstory.com/2013/02/14/colin-berry-takes-advice-from-daveb/","cat":"other_blogs","id":"comment-24452","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry takes advice from daveb","post":"Typo: Naturally pre-mordanted linen once naturally mordanted, THE MORDANTING looks like a very light scorch or “pre-scorch”.\n\n","date":"February 17, 2013 at 6:49 am","url":"https://shroudstory.com/2013/02/14/colin-berry-takes-advice-from-daveb/","cat":"other_blogs","id":"comment-24507","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry takes advice from daveb","post":"Science can only test the testable (so annoyingly restrictive I know). But it’s through following that self-denying ordinance that science has brought us antibiotics (but sadly the atomic bomb too)… You win some, you lose some.  Who knows what ‘truths’ one fails to spot when declining  to address the untestable?\nPS: Tomorrow’s my big day. Tomorrow’s when I finally tackle head-on the surviving Mr. (Dr.) Big of STURP and indeed Shroudology, after trying to keep a safe distance from this ‘big hitter’  for the best part of a year. Can you guess who? I don’t suppose he’ll be quaking in his shoes – but I will…\n\n","date":"February 16, 2013 at 1:21 pm","url":"https://shroudstory.com/2013/02/14/colin-berry-takes-advice-from-daveb/","cat":"other_blogs","id":"comment-24455","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry takes advice from daveb","post":"CB, to really assess the “science” behind the antibiotics, why don’t you read instead Dr. John I. Pitt, The Genus Penicillium, Academic Press, 1979. He wrote: “It is ironic that this humbled fungus, hailed as a benefactor of mankind, may by its very success prove to be a deciding factor in the decline of the present civilization.”\nReminder for CB with chemistry PhD: antibiotics ALSO kill the beneficial bacteria within your intestines. As such they lead to serious health risks.\n\n","date":"February 16, 2013 at 1:49 pm","url":"https://shroudstory.com/2013/02/14/colin-berry-takes-advice-from-daveb/","cat":"other_blogs","id":"comment-24457","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry takes advice from daveb","post":"Max Planck who won the 1918 Nobel Prize in Physics, once weighed in as to why science is slow to change even in the presence of overwhelming evidence that it should do so.\n“A new scientific truth does not triumph by convincing its opponents and making them see the light,” Planck said, “but rather because its opponents eventually die and a new\ngeneration grows up that is familiar with the ideas from the beginning.”\n\n","date":"February 16, 2013 at 1:57 pm","url":"https://shroudstory.com/2013/02/14/colin-berry-takes-advice-from-daveb/","cat":"other_blogs","id":"comment-24458","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry takes advice from daveb","post":"As I say: you win some, you lose some.  But it’s a minority of antibiotic-recipients who get overgrowth of Campylobacter etc.due to suppression of commensals or “friendly bacteria”. (In case you weren’t aware, you’re dealing with a one-time dietary fibre specialist/ Head of Nutrition/Food Safety at an industrial  UK food research association).\n\n","date":"February 16, 2013 at 2:00 pm","url":"https://shroudstory.com/2013/02/14/colin-berry-takes-advice-from-daveb/","cat":"other_blogs","id":"comment-24460","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry takes advice from daveb","post":"Keep in mind the post-antibiotic importance of restoring the intestinal terrain with plain yogurt and probiotics. If you experience bloating, belching, gas, constipation, diarrhea, GERD, or other intestinal problems, probiotics can play an important role in restoring your intestinal terrain.\n\n","date":"February 16, 2013 at 2:02 pm","url":"https://shroudstory.com/2013/02/14/colin-berry-takes-advice-from-daveb/","cat":"other_blogs","id":"comment-24461","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry takes advice from daveb","post":"Selling antibiotics to sell probiotics…that’s the whole “science” behind it. Some wins (always the same), some loses (always the same).\n\n","date":"February 16, 2013 at 2:09 pm","url":"https://shroudstory.com/2013/02/14/colin-berry-takes-advice-from-daveb/","cat":"other_blogs","id":"comment-24465","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry takes advice from daveb","post":"Typo: Some will win (always the same), some will lose (always the same).\n\n","date":"February 16, 2013 at 2:15 pm","url":"https://shroudstory.com/2013/02/14/colin-berry-takes-advice-from-daveb/","cat":"other_blogs","id":"comment-24468","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry takes advice from daveb","post":"How long are irresponsible ‘scientists’ to rely on the “win some lose some” principle when antibiotics may by their very success prove to be a deciding factor in the decline of the present civilization?\n\n","date":"February 17, 2013 at 11:47 am","url":"https://shroudstory.com/2013/02/14/colin-berry-takes-advice-from-daveb/","cat":"other_blogs","id":"comment-24536","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry takes advice from daveb","post":"Addendum to CLOTH-TO-CORPSE ARCHAEOLOGICAL THERMAL IMPRINTING: Low temperature alkali gelatinisation of starch residuals present in ancient linen cloth is also a possible factor as printing paste to be taken into account in the Shroud image formation process.\n\n","date":"February 17, 2013 at 9:31 am","url":"https://shroudstory.com/2013/02/14/colin-berry-takes-advice-from-daveb/","cat":"other_blogs","id":"comment-24516","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry takes advice from daveb","post":"A MUST SEE: Now on his blog, CB is just ‘recycling’ my own ‘thought experiment’ into his own scorch hypothesis so as to give it more scientific/archaeological credence! \n–“Opaques”/sand grains (present in the Judean desert dust and that most likely covered the TSM’s corpse (to account for both the soft focus effect/auto-collimation and stochastic aspect of the Shroud image)\n–Stretching and excessive compression at head level (to explain the reverse-side incomplete pressure imprint).\n\n","date":"February 17, 2013 at 9:57 am","url":"https://shroudstory.com/2013/02/14/colin-berry-takes-advice-from-daveb/","cat":"other_blogs","id":"comment-24517","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry takes advice from daveb","post":"Typo: so as to give THE LATTER\n\n","date":"February 17, 2013 at 10:14 am","url":"https://shroudstory.com/2013/02/14/colin-berry-takes-advice-from-daveb/","cat":"other_blogs","id":"comment-24522","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry takes advice from daveb","post":"Rephrasing: CB is just ‘recycling’ my own ‘thought experiment’ into his own scorch hypothesis in a desperate attempt to give the latter more scientific/archaeological credence!\n\n","date":"February 17, 2013 at 12:46 pm","url":"https://shroudstory.com/2013/02/14/colin-berry-takes-advice-from-daveb/","cat":"other_blogs","id":"comment-24541","author":"Max Patrick Hamon","site":"shroudstory"}]
