[{"title":"“Let’s poke ’em with hokum…”","post":"There’s a difference between yellowing of linen, placed inside an oven at, say, 300 degrees C, Hugh, and yellowing from a template that has been removed from an oven at the same temperature and pressed onto linen. \nThe former gives overall yellowing – or more likely progressive browning – that is due primarily to heat transfer from hot air to linen – in other words a CONVECTION/CONDUCTION mechanism. \nScorching by direct contact between template removed from hot oven is primarily by a CONDUCTION mechanism only, with a minor contribution from convection and even smaller one from radiation. (Though there may be some secondary yellowing from superheated air or steam that is forced to exit via the underside of the linen if the template is applied from above). It’s the difference between roasting chestnuts and branding the backside of a cow.If the temperature of a branding iron were used to cook a cow, you’d get well-done Sunday roast – via two different mechanisms – one using hot air, the other hot metal. The first would give deep browning due to prolonged heat transfer that penetrates deeply.  The second would give superficial scorching only – providing the application time was brief – basically chalk and cheese in terms of heat transfer.\n","date":"December 18, 2012 at 1:05 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1510","author":"colinsberry","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"Well, I look forward to what Adrie and Thibault have to say about my three main confusions at the moment! As for scorching at at a distance, there must be some reconciliation between a hot template apparently not being able to scorch at a non-contact distance of a millimetre of two, and an oven at the same temperature managing to scorch it from perhaps 20 cm. (Although to be fair my linen was lying on a plate. I think I might dangle it from a grill, so that the minimum distance from any other solid is about 10 cm, but I guess it will go brown just the same.)\nI’ve got some interesting photos of fluorescence I’d like to share. Can I email them to you?\n","date":"December 18, 2012 at 12:47 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1509","author":"Hugh Farey","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"Ok Hugh.\nI will send to you privately the documents.\nPlease ask Colin my private email address (he has it) and send me an email.\nI will also try to answer to some of your interesting questions and comments here later.\nBest regards.\nThibault.\n","date":"December 19, 2012 at 10:24 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1523","author":"Thibault HEIMBURGER","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"“There does not have to be contact to produce visible discolouration, for instance. “\nOne of the few things on which Thibault and I are agreed Hugh is that the smallest air gap means no scorching. However, that will need qualifying in view of your comment. One is talking about a metal template that is just hot enough to produce a superficial scorch  when pressed into linen – say 250 to 300 degrees C. If the template were to be red hot, then yes it could produce discoloration at a distance. But that kind of temperature – say 700 degrees C and higher, is way, way beyond that which would have been used by a medieval artisan – given it would instantly carbonise linen – and probably set it on fire – if attempts were made to produce a reasonably sharp image from a brief contact scorch off a bas-relief metal or ceramic template.\nGranted there are attractions to thinking in terms of thermal radiation across an air gap from  a red hot template, as distinct from contact scorching. Image fuzziness is the obvious one that springs to mind. Indeed, I suspect that it’s the essential ‘fuzziness’ of the Shroud image that endears so many folk to Rogers’ ideas on there having been some kind of chemical reaction between a vapour and cloth – Maillard reaction or otherwise, putrefaction amines or otherwise, reducing sugars, cleverly disguised as “starch fragments” or otherwise. But there are alternative explanations for image fuzziness, image-degradation via age-related changes being the most obvious.\nI don’t know about you, Hugh, but the deployment of a microscope  as a heat-seeking missile for the instant shooting down of scorch-imprinting theory strikes me as premature to say the least, and is, I believe, agenda-driven, i.e. tainted science. A far more sensible application of a microscope would be using it to examine closely the transition between image and non-image regions on the Shroud, vis-à-vis  model scorches, with a view to better understanding the underlying reasons and mechanisms for image ‘fuzziness’.\n","date":"December 18, 2012 at 10:37 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1507","author":"colinsberry","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"These are all excellent references, Adrie, for which many thanks – many of them I have read before, of course, as some were posted to threads which I was commenting on myself. I have several questions revolving in my mind, and you might be able to clarify one or two.\nI have not read, I think, that the previous researchers thought that the ‘background fluorescence’ might itself be due to a scorch – they tend to attribute it to part of the manufacturing process, in spite of Miller’s experiment showing that “Modern linen can be artificially aged by baking at high temperature (125º-150º C) to the point where its reflected color and fluorescent emission approach those of the Shroud.” I find that 10 minutes at 220C will do the same. Yet the shroud has been heated at least once, and possibly more, to at least that temperature. Even if there were another reason for the fluorescence, that heating would be sufficient.\nIt’s not obvious to me what is meant by ‘weakly fluorescent.’ Looking at the picture of the hands, which Colin posted above, there appears to be a bright oval of yellow-green fluorescence centred roughly in the middle of the picture, with darker margins at the edges (particularly the upper edge) as if a bright spotlight were being aimed at that particular place. If this was a UV light, and if the photo shows the reflected visible light, then I don’t call that ‘weak,’ but remarkably bright. What’s more it is all around the image of the hands. if (just suppose, for the sake of argument) a hot bas relief of a pair of hands had been pushed onto a piece of modern linen, that is exactly the picture I would expect, with discolouration (but no fluorescence) where contact or radiation heated the linen to 200C or so, and fluorescence (and very weak colouration) where distance (or perhaps a cooler bit of the bas relief) heated the surrounding region to, say 190C.\nI have recently been heating bits of linen in an oven, and find that at 250C, ten minutes is enough to char it a uniform mid-brown. I now find it staggeringly unlikely that the shroud could have sat in a silver ‘oven’ (its casket) at a temperature of 900C (to melt the silver), without being totally destroyed.\nFinnally, in a last attempt to produce pink fluorescence, I placed a piece of linen in a glass tube and passed methane (my ordinary lab gas) through the tube, then, after a few seconds so that there could not be any oxygen left in the tube, and with the methane still flowing, inserted a red hot steel spatula into the open end (yes, very nervously) onto the linen, and scorched it. Removing the spatula, waiting for the linen to cool, turning off the methane, and examining the linen under UV produced… yup, the same old yellow-green as ever!\nNot really questions then, but I’d be grateful for your thoughts!\n","date":"December 17, 2012 at 4:56 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1502","author":"Hugh Farey","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"Hello Hugh, just some thoughts:\n– As far as I know, it is unknown to which temperature the background of the Shroud has been heated. It needn’t have been the 220C of the scorches.\n– As to the UV photo: “The film was to record only radiation emitted in the visible region of the spectrum, and none of the reflected, exciting UV. Consequently, the light source had to be free of visible radiation. To achieve these conditions special excitation filters were constructed to fit on the 15-cm diameter strobe sources.” (M&P p.73) They probably saw the fluorescence was weak and exposed the film a long time.\n– The molten silver hypothesis has already been refuted by Guerreschi and Salcito.\n– I think you’ll get red fluorescence if you anaerobically scorch/bake unbleached linen that fluoresces lignin-blue. Some furfural-lignin polymer doing the trick.\n– Have you scorched any non-fluorescing cotton yet?\n","date":"December 19, 2012 at 8:50 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1514","author":"Adrie","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"Thanks Adrie.\nThe background fluorescence continues to intrigue me. Is age itself (oxidation presumably) enough to make linen fluoresce? Or was it treated with something naturally fluorescent in manufacture? Or was it heated? I don’t know, but if I want to make non-fluorescent linen fluoresce in ten minutes, 220C is a good temperature, while Miller and Pellicori found that 125C-150C (perhaps for an hour or so?) would also do the job.\nI’m sure you’re correct that the picture of the hands has either been exposed for a long time, or pushed in processing, to show the fluorescence. However it does show an image area (the front of the thighs) either fluorescing itself, or at least not suppressing any background fluorescence. I’d love to see other areas of the shroud (recognised scorches) for example, photographed in a similar way. It may be that Miller and Pellicori addressed this, but I can’t get hold their paper. Yet.\nGuerreschi and Salcito clearly showed, I think, that the burn holes were made by something solid, not liquid, but they were less convincing about how the solid arrived on the cloth. They wonder if the casket was in fact made of wood, with silver or gold panels, and the wood burnt through, or that the fire was hot enough for ‘weld points’ to yield, or that something might have sat on top of the casket heavy enough to buckle it. All of this, I submit, would have charred the insides irredeemably. Another relevant point, which I have only just noticed in their papers, is the tiny amount of water apparently used to extinguish the smoulder, judging by the size of the water marks which they attribute to that incident. This is not, I think, indicative of someone desperately trying to cool a casket, but of a well targeted application just to cool the burns themselves.\nI think I’ll have to give up on the pink…\nI found alas that my coloured cotton shirts were all mixed with artificial fibres which just melted under heat! Even cotton wool, which I was hopeful of, fluoresces quite well before being heated. So I’m afraid we’ll have to wait a while for that one!\nyielding of weld points or buckling under the weight of something else\n","date":"December 19, 2012 at 10:55 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1515","author":"Hugh Farey","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"It’s presumably their 1981 paper in Journal of Biological Photography that you wish to lay your hands on Hugh. As you say, tricky, since the Journal is listed as not having a website (is it still going one wonders – or maybe subsumed into another journal?). I’ll root around and see if I can retrieve any of that paper elsewhere. Don’t hold your breath…\nPS  Adrie Van Der Hoeven (who contributes comments on this site) cites a short section from that paper(pdf) . Maybe she can help.\n","date":"December 17, 2012 at 9:57 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1497","author":"colinsberry","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"Hope this helps: I started with an ordinary b&w paper copy from a university library. Three weeks ago I bought a digital color copy at the  Journal of Biocommunication for $25 USD, by mailing Ms. Carol Gray (it indeed got subsumed into this journal). I got color photograps of poor quality of yellowed journal pages, but it is better than nothing. Miller and Pellicori’s article is: Journal of Biological Photography, Vol 49, No 3, 1981, p. 71-85, but there are other important articles on Shroud fluorescence, for instance\nGilbert, R., and M.M. Gilbert, Ultraviolet-visible reflectance and fluorescence spectra of the Shroud of Turin, Applied Optics, Vol. 19, No. 12, June 1980, pp. 1930-1936\nPellicori, S.F., Spectral Properties of the Shroud of Turin, Applied Optics, Vol. 19, No. 12, 1980 pp. 1913-1920\nThey are behind paywall here. I haven’t found any of them free online, but I’ve quoted quite a few pieces of them in my comments on this site:\nOct 24 on red and green Shroud scorches and a reply\nOct 25 on non-fluorescing Shroud ‘scorches’ and its note\nOct 25 on the background fluorescence\n Nov 13 also on the background fluorescence\nNov 20 on furfural and the background fluorescence\nAnd, as Colin said, there are also quotes in my article Internal selvedge in starched and dyed temple mantle, especially in paragraph 2.3. on (fluorescent) Madder dye, and paragraph 4.2.5. on the fluorescence shift between background and image, and in their endnotes.\n","date":"December 17, 2012 at 3:36 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1500","author":"Adrie","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"I should very much like to, but would probably want to reference Miller and Pellicori’s original findings. However their paper does not seem to be easily available on the internet. Do you happen to know if anyone’s published it anywhere?\n","date":"December 17, 2012 at 9:45 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1496","author":"Hugh Farey","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"Hugh,\nI don’t understand: you might find all the papers you want on the internet.\nI purchased them some years ago easily.\nIf you don’t find them, I can provide them to you.\nI don’t understand anything to your approach of the fluorescence problem but I have an open mind.\nHowever, the TS image is not a scorch as I showed on the “other site”. Just look at the evidence through the microscope.\nBest regards. \nThibault.\n","date":"December 17, 2012 at 8:41 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1504","author":"Thibault HEIMBURGER","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"Thanks for your comment Thibault. I read your paper with interest – and Colin’s denunciation, and really the two of you inspired me to try some of these things for myself. I am now quite a dab hand at “painting” linen with a red hot spatula, in such a way that minimal scorching occurs on the other side of the cloth, and I am also aware of the effect radiated heat has on linen. There does not have to be contact to produce visible discolouration, for instance. I appreciated your paper very much (and said so at the time), but my own subsequent experiments have led me to query much of what I have read about the fluorescence of the shroud. The paper I would very much like a copy of is Miller and Pellicori’s seminal 1981 paper in the Journal of Biological Photography, which is not available to independent researchers on the internet. If you have a pdf of it I would be very grateful.\nI hope that my post below makes some of my current concerns clear, but to simplify them:\n1) The only photo I have seen of the shroud under UV light (above) is brightly coloured, not weakly, and does not seem to be suppressed by the image. This is in contradiction to what I have read elsewhere.\n2) When I heat a piece of linen in an oven ( 800C) without discolouring at all.\n3) I personally have not been able to produce a pinkly fluorescent scorch, and I’d like someone to tell me how to do it. (Using school lab and kitchen equipment!)\nWould you like to comment on any of those points? I would be grateful.\n","date":"December 17, 2012 at 10:15 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1505","author":"Hugh Farey","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"Oops! My Point 2 has disappeared! I wonder how that happened. To replace:\n2) When I heat a piece of linen in an oven (300C), it turns brown in 10 minutes. This is in contradiction of the tale that the shroud was heated in a silver ‘oven’ (the casket) until it was hot enough for the silver to melt (900C) without discolouring at all.\n","date":"December 17, 2012 at 10:45 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1506","author":"Hugh Farey","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"These are some fascinating ideas you have developed here, Hugh – and all based on original research. \nForgive me if I reserve judgement for now on whether I think your case is totally watertight or not. It’ll take a little while to see this tricky fluorescence issue in the round so to speak. In the meantime, you have shown why the “absence of body image fluorescence compared with 1532 scorches” is simply a mantra that the Shroudies  intone as polemical debating point, one that lacks any solid scientific foundation, given that next to nothing is known about the precise identity or stability of the fluorochromes. Nope, trump card it is not – more the joker in the pack.\nHave you considered writing a paper, maybe for the British Shroud of Turin Society?\n","date":"December 16, 2012 at 1:10 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1485","author":"colinsberry","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"I don’t know if my hypothesis works better when the ‘overall’ scorching happens before or after the ‘image’ scorching. However, we are told that the entire shroud is ‘yellowed with age’ and ‘weakly fluorescent.’ This is consistent with the entire shroud being heated (as part of the manufacturing process before the image, or in a reliquary after the image) to, say, 200C, producing some visible chromophores (yellow -I have still not been able to produce fluorescence without any visible change at all), and some invisible fluorochromes. (Your Phase 1 above) I believe the fluorochromes form at one temperature, and are indeed degraded into non-fluorescence after a very small increase in temperature. If I pour a blob of molten lead onto a piece of linen, and (after tipping it off) look at it under UV light, the scorch itself does not glow, it just looks brown, but it is surrounded by a coastline of yellow-green fluorescence, as if a steep temperature gradient is being illustrated, from no change, to fluorochrome, to visible scorch (shades of brown) and eventually to char (black). Your Phase 2 then, is the application of a hot template, which would turn more of the fluorochromes into non-fluorescing scorch, reduducing the overall fluorescence.\nI entered the shroudstory/shroudwithoutallthehype fray trying to demonstrate (with you) that the image could be a scorch, but was consistently obstructed by the “scorches fluoresce but the image does not fluoresce” chant. I think the idea that scorches only in fact fluoresce round the edges, and that the fluorescence of the shroud image is smothered by the overall backgroud fluorescence, overcomes this obstruction.\n","date":"December 16, 2012 at 10:14 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1484","author":"Hugh Farey","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"If I read you correctly, Hugh, you appear to be saying that the entire cloth first becomes weakly fluorescent through having been exposed to energy that is sufficient to chemically modify the linen producing fluorescence – but with no visible yellowing. Then, with greater energy input, needed to produce a body image that is visible under ordinary white light – there is a LOSS of the first-formed fluorescence. (Suggested shorthand, independent of mechanism: Phase 1:  minor changes at lower energy input – producing fluorescence, but no visible yellowing. Phase 2 – at higher energy input – loss of that fluorescence, appearance of visible yellowing).\nLet’s take that at face value. What could have produced first the Phase 1 then the  Phase 2 changes? If it was radiation producing superficial effects only, a mechanism that I personally I find somewhat improbable, notwithstanding ENEA’s Star Wars light sabres, then it would have affected one side of the linen only. The reverse side would be non-fluorescent. Is it? Do we know?\nIf both sides are fluorescent, one has even fewer grounds for invoking radiation. One would have to think in terms of a Luigi Garlaschelli’s mechanism that involves baking the entire cloth. I personally am still somewhat unclear as to why that step was introduced. Was it purely to give an aged look to the linen, or did the baking also play a crucial role in allowing those “acidic” ochre pigments to attack and etch the fabric?\nThere is clearly a difference between Luigi’s mechanism and my own, inasmuch as his needs the imprinting first with an extraneous pigment, followed by a generalised heat treatment whose purpose and mechanism is still a matter of doubt, while mine relies purely on direct contact with a hot template to produce immediate scorching.  With mine, there is no requirement in principle for ochre or any other chemical pretreatment (whilst not excluding the use of adjuncts, e.g. lemon juice, that sensitize the fabric allowing scorching to occur at lower temperature making the process more technician-friendly).\nMaybe fluorescent has a role to play in distinguishing between these two mechanisms – or, for that matter, any others that may be proposed. But the problem one is up against is that the fluorescence (or lack of) that we see now may not accurately reflect what might have been seen centuries ago immediately after image-imprinting. Fluorochromes tend to be fairly reactive and thus unstable chemicals – if not within weeks or even years – at least over decades and centuries as chemical double bonds become modified by oxygen etc. If Rogers’ vanillin can act like a chemical clock, albeit erratically, then so can fluorochromes that are initially yellow-green under uv light. As for those elusive red ones – well, I’m as much in the dark as you. The only red fluorochromes I have come across are free porphyrins, i.e. the cyclic tetrapyrroles that remain behind when iron is stripped out of haems.\n","date":"December 16, 2012 at 8:33 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1483","author":"colinsberry","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"Is the photograph taken under uv light (albeit with some weak violet light) not consistent with the view that the fabric has a weak background fluorescence, with the latter being quenched in those parts that carry body image?\n","date":"December 15, 2012 at 11:23 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1481","author":"colinsberry","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"Yes, that’s exactly my point. It would be interesting to know how enhanced the exposure was during the processing of the photo. As I said before, if the shroud was lightly scorched all over, then the visibly scorched fibres would not fluoresce, while the invisibly scorched (but chemically altered) fibres would, producing weak fluorescence all over, which is what we can see in the photos. Further scorching (such as you suggest for the image), would simply increase the number of visibly scorched, non-fluorescent fibres, and decrease the number of invisibly scorched (but chemically altered) fibres, thus reducing the overall fluorescence.\n","date":"December 16, 2012 at 12:02 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1482","author":"Hugh Farey","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"What I’m getting at is why we can see anything at all on these photos. If you illuminate a non-fluorescent cloth with a UV lamp and try to take an ordinary photo, the result is nothing, just black.   How come we can make out the shape of the image and bloodstains. If the shroud was also illuminated by visible light, then weak fluorescence could be impossible to detect, and if the photo was taken using UV sensitive film, then we would only be seeing reflected UV, not fluorescence.\nIn fact, my UV lamp also gives off a small amount of deep violet light, and most materials reflect that colour, but it is far too weak to show up on my camera and even if it did, it would be deep purple, not yellowy green, like your top photo.\n","date":"December 15, 2012 at 11:00 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1480","author":"Hugh Farey","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"End of Term… Back to the Shroud…\nI notice your photo of the hands area, under UV illumination and a long way from the nearest scorch, is glowing nicely. What do we make of that? A similar photo, also under UV, from Jumper and Adler’s Examination of the Stains and Images (1984), but this time of the area covering a big scorch and the spear wound, also shows the middle of the shroud shining brightly, and the scorch rather less!\nHaving nothing better to do, a shoved a bit of linen into a glass pipe today, and passed methane out of a gas tape through it (and lit it the the other end so as not to die). Then scorched the linen with a Bunsen. There could not be circumstances of less oxygen surrounding the linen. After letting it all cool down, but with the methane still passing over it, I pulled it out an looked at under UV. The same greeny-yellow as ever. How to get pink fluorescence is a complete mystery to me.\n","date":"December 15, 2012 at 5:03 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1472","author":"Hugh Farey","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"Er, you’ve rather lost me there Hugh. Are we looking at the same thing? As much as I would ‘like’ the body image to glow under uv light, as per model scorches,  I simply don’t see any glow in that first of the three photographs, except for that questionable ‘serum halo’ at the 9’oclock position and maybe some similar patchiness elsewhere. (Ignore that enlarged second one since it’s had extra brightness and contrast).\nPS:  I know what I’m getting for Christmas  😉  It’s a microscope with a USB socket for linking to a laptop.  It will hopefully serve as the equivalent for a bolt-on camera attachment. I’ll soon be able to take a better look at the superficiality issue. Now all I need is a uv lamp…\n","date":"December 15, 2012 at 6:37 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1474","author":"colinsberry","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"Thanks. That’s new to me, but what I really want is the source for all that stuff about the four padlocks and the blacksmith and the ‘single drop of molten silver.’ Since the last ‘fact’ is clearly false, I wonder what else was.\n","date":"December 11, 2012 at 5:48 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1439","author":"Hugh Farey","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"How about this?  It’s  a pdf translation from the original Spanish\n(a selected passage obtained from the original 19th century book in French: “Le Saint Suaire de Chambéry à Saint Claire en Ville (Avril-Mai 1534)” par M.L’Abbé Léon Bouchage, Chambéry, Imprimerie C.Drivet 1891)\nBe prepared for a few surprises. Example: “The nail holes are in the middle of the long and beautiful hands”. (my italics)\nIs it just me, or is the observer relating the pattern and distribution of blood stains as if seeing them for very first time, rather than providing a checklist that all the features from before the fire were present and correct? I have to point that out, given an unsupported statement I have seen elsewhere to the effect that the assembled bishops and noblemen had specifically confirmed the presence of bloodstains in all the right places, and accusing me of not having done my homework (which was rich, given that no links were provided).\nTwo years to organize repair? You may well ask why…  \n","date":"December 10, 2012 at 7:53 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1431","author":"colinsberry","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"Maybe an old cloth, then, left over from the crusades? Is the primary source for the fire and its aftermath online, do you know? I find it odd that people had to wait for two years before the damaged shroud was ‘resurrected,’ and that was before the Poor Clares attached the backing. Where was it, and what was it doing for those two years? And why marjoram leaves, I wonder? There are no blood drops that big on the shroud (3-4cm). Were they thinking of the spear wound, I wonder, which would  be about right.\n","date":"December 10, 2012 at 7:12 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1430","author":"Hugh Farey","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"PS. Don’t tell me you’ve thought of that too!!!\n","date":"December 10, 2012 at 9:43 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1425","author":"Hugh Farey","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"Now what about this…\nThere was a shroud of some kind in a silver reliquary, from the 1st, 13th or whatever century, but it was destroyed in the 1532 fire, and a copy was secretly made, complete with appropriate burn marks and patches, to maintain the relic, and more especially the pilgrimages and their income. I wonder if de Wesselow would consider the image ‘culturally, stylistically and technically’ impossible from a 16th (as opposed to a 14th) century viewpoint. I thought of this while reading David Hockney’s book ‘Secret Knowledge’ last night, where he thinks that portrait painters from about 1430 used a camera lucida (basically some lenses and prisms) to project images onto their paper so that they could be drawn up very accurately. He illustrates his book with dozens of examples, and points out parts of big paintings where the perspectives and sizes don’t quite match up correctly, due, he thinks, to the painter having to move the camera lucida around as it could only cover a bit at a time. Makes me think of all those people who think the shroud’s legs are too long or the neck too short or whatever.\nSo, the carbon dating would be wrong, wrong, wrong, as usual, but because it dates the cloth as too early, not too late! Humm. Lots of implications and ramifications probably…\n","date":"December 10, 2012 at 9:43 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1424","author":"Hugh Farey","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"The radiocarbon dating remains for me the gold standard, Hugh, despite the attempts by some, naming no names, to substitute bad chemistry for good physics. So I’m more inclined to see the present Shroud as a doctored version of the original, rather than a complete substitution. \nIt’s my hunch that the pre-1532 Shroud had little or no blood.  Blood was opportunistically painted on shortly after the fire in all the strategic locations to fit the Biblical account, thus giving the impression of wounds (I personally see nothing indicative of wounds in the body image per se). The Poor Clare nuns who patched the Shroud in 1534 were said to have been struck by the appearance of the“blood drops as large as marjoram leaves”  viewed through the cloth from the reverse side. I suspect they were actually viewing freshly-applied blood,  or blood substitute (digesta from medicinal leeches?) which they interpreted as having come either from ancient wounds or from a contemporary miracle occasioned by the fire. I need hardly add that any “new” showing of blood is always welcome and something to write home about where religious icons are concerned, and is in fact considered almost de rigueur by custodians who wish to counter any backsliding or flagging interest on the part of the faithful,  or merely to keep up visitor numbers…\n","date":"December 10, 2012 at 1:03 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1428","author":"colinsberry","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"Thanks for that tip, Hugh, re Guerreschi, a name I had not come across previously. Here’s a paper of his (pdf) that I have just unearthed with the benefit of Google that would appear to have the claim you mention re the 1532 burn holes being made with an angular hot solid implement. Seems at first sight to be a very thorough, well considered proposition. Well now, we learn something new every day…\n","date":"December 9, 2012 at 2:04 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1421","author":"colinsberry","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"Might have guessed you’d been there before me. Still, nothing like confirmation by experiment is there? I’m impressed by Guerreschi’s reconstruction (shroud.com) of the scorching pattern, and note that he thinks the burns were made by a solid metal object, not molten droplets. His findings are not inconsistent with a hypothesis that the shroud wasn’t in a reliquary at all, but deliberately attacked with a hot metal object, as you suggest.\n","date":"December 9, 2012 at 12:53 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1419","author":"Hugh Farey","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"Good morning Hugh\nThose are some fascinating findings you have with the fluorescence, especially the distinction between scorched, and heated-but-not-yet-scorched. There is much food for thought there, but it’s going to take me a little while to get my head round all of that.\nIn the meantime,here’s something to be getting along with, i.e.    a link to some comments I posted back in February re that silver reliquary.  (Skip the posting, go straight to the second comment, my own, the one that is headed “Health warning: what follows is strong stuff – not suitable for those of a nervous disposition). Beware, there’s some highly seditious stuff there. I’m not usually given to conspiracy theories, but as you indicate, silver is exceedingly difficult to melt without specialized equipment…  That molten silver story is scarcely credible …\n","date":"December 9, 2012 at 12:14 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1418","author":"colinsberry","site":"colinberry"},{"title":"“Let’s poke ’em with hokum…”","post":"Gunga Din here…\nWhat about the myth of the silver reliquary?\nI was pursuing my idea that a pre-scorched shroud, with weak UV fluorescence, might mean that any fluorescence due to later scorches wouldn’t show up.\nI have an electric hotplate, designed to melt ‘model-maker’s metal’ which is a mixture of tin, lead and bismuth. When turned up full, a bit of lead sitting on it melts quite easily, but a similar bit of zinc doesn’t melt at all, so its temperature is presumably in the mid to high 300s C. I also have a small steel peppermint box (courtesy of Starbucks), about 5cm x 4cm x 1cm high, Into which I put a folded up bit of linen about 9cm x 6cm, closed the lid and put it (cold) onto the hotplate (hot). I then put a bit of lead on the top of the box just to see if it would reach melting temperature. (I do have some glass thermometers that go up to 300C, but I’m not sure how accurate they are; they’re immersion thermometers and not good at hotplates, reading a maximum of about 240C even when lying on the plate).\nAnyway, after ten minutes, I took the box off (the lead on the top hadn’t melted at all) and prized open the lid. Most of the linen was charred black, and what wasn’t was well scorched – much browner than old newspaper, for example. The char, of course, didn’t fluoresce at all, and the scorched bit quite weakly (as advertised).\nNow silver melts at about 900C, depending on its quality, and I seriously wonder how a linen cloth could receive serious melt damage from a silver reliquary without being previously scorched quite badly all over, and probably charred to destruction in several places. I’ll bet a pound to a penny no shroudie has popped and old sheet into a metal tank, heated it in a bonfire until bored and then had a look inside, but I think the results would have been quite disturbing…\nOr am I wrong?\nI’m a bit reluctant (well, totally reluctant actually) to look through a microscope at a sample lit by UV, as I don’t know how much will be reflected up the barrel, but I have a feeling that there is a very small temperature difference between degradation to fluorescence, and degradation to visible scorching, at which point fluorescence stops. Certainly areas of fluorescence look much bigger than the visible scorches they surround, but I’ve never been able to get fluorescence completely unaccompanied by visible browning. However, I suspect that as it is heated, something (cellulose, lignin, hemicellulose, other starches, sugars or carbohydrates generally?) first degrades into a chemical that fluoresces but is visibly unchanged, and then degrades further into something that is visibly yellow or brown, but does not fluoresce. The weak fluorescence of a lightly scorched cloth is due to the browned fibres not fluorescing at all, and only unbrowned fibres fluorescing. Obviously, any further scorching, such as somebody playing with hot bas reliefs, would increase the area of visible scorching, and therefore decrease the area of fluorescence.\nWhich is why it is said that the image does not fluoresce.\nDoes that make sense?\n","date":"December 9, 2012 at 11:50 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","id":"comment-1417","author":"Hugh Farey","site":"colinberry"}]
