[{"title":"Quote for today by Mario Latendresse","post":"I love their “Shroud Scope” tool and use it all the time to look at details on the shroud – both raw and in the negative. Great site.\n\n","date":"January 29, 2012 at 1:28 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7662","author":"Chris","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"I agree with you.  This website is a MUST for anyone interested in the Shroud of Turin.  BUT…  Be careful in the interpretation you give to some features !!!  Sometimes it is not what it is like !  The danger of the “I think I see” pattern is always there.\n\n","date":"January 29, 2012 at 6:29 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7666","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Very true. I don’t know how to interpret some things so I tend not to assign any meaning to that which I don’t know about. I just look in wonder and form questions to be researched and/or asked. I assume there will be some questions which may never be answered.\n\n","date":"January 29, 2012 at 7:18 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7669","author":"Chris","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"You got some good wisdom Christ…  Probably more than me !  It’s pretty rare to see someone with your way of thinking, especially in the Shroud world.\n\n","date":"January 29, 2012 at 7:52 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7670","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"This is an error of interpretation from Mario.  THIS SET OF 3 SYMETRIC MARKS WITH WATER STAINS AROUND THEM ARE SCORCHES MARKS !  The symetry, along with the water stains is a good evidence that point in one direction : Scorches marks, not blood stains.\nAnd this is confirmed by the study of the UV photography of the Shroud made by Miller and Pellicori from STURP.  This proof one thing :  light scorches and blood stains are often difficult to differenciate from one another and this FACT was confirmed to me by my good buddy Barrie Schwortz, who know what he’s talking about.\n\n","date":"January 29, 2012 at 6:04 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7664","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Yo quisiera conocer la opinión de Mario Latendresse al respecto……..\nNO son 3 puntos simétricos, son 4 marcas en las 4 “esquinas” aproximadamente de la fotografía, y no hay eje de simetría.\nLa forma de las “manchas de agua sería” completamente absurda de explicar, alguna de las  marcas tiene “submarcas” con su halo de “agua”?………….\nNo veo otras “quemaduras” parecidas por la Sábana.\n\n","date":"January 29, 2012 at 7:02 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7667","author":"co","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"I have debate this question personally with him and, of course, since he already got his mind set before I tell him he was probably wrong in his interpretation, he didn’t changed his point of view on the question…  I respect that but personally, I don’t let myself being influenced by anyone’s thoughts about the Shroud.  I’m a free thinker…  Mario got his opinion on the question.  I got mine.  And what is funny is that, at first, when I read his paper on the subject, my first reaction was :  This conclusion is very probable !  But, after I look more closely on those images, I started to detect some pieces of evidence that eventually lead me to believe (and I would bet my house on that), that those marks are not blood stains at all, but instead, they are light scorches marks, most probably create when 3 firebrands of incense would have drop on the Shroud in the area of the right buttocks (if you look at a positive photo).\nTo answer your questions :  \n1- Yes, the 3 marks on each side are clearly symetric but not in a totally vertical axis (not in 90 degrees).  And those marks only appear in 2 corners, not 4.  The symetry came when someone would have fold the Shroud in 2, in an effort to extinguish the 3 firebrands of incense that would have droped on the Shroud, who was most probably completely unfold at the time the drop of firebrands.  This way of exinguish the firebrands is just a logical move of someone in a panic.  If my supposition if correct and if there is no liquid near you when that happen, what will you do ?  Me, everytime, I’ll fold the cloth in 2 to take out any air for the fire to continue.  From my perception, I really think that’s what happened.\n2-  The form of the water stains (very circular) made me think that someone just gently droped a cup of water (or maybe a cup of wine; this is a possibility since the accident maybe occured during a religious celebration), anyway a cup of liquid, after the cloth was unfold again, on the 3 places were the firebrands had droped + the 3 opposite places that touched the firebrands when the cloth was folded in two.  This was probably unnecessary, because the folding had done the job, but it was surely done to make sure all the firebrands were completely extinguished (that would explain the very circular aspect of the water or wine stains).  In other word, the folding of the Shroud was probably done in a hurry, but not the droping of liquid, that was done afterward.\n3- There is other light scorch marks like that elsewhere on the Shroud.  Just look at   First, I want to say it again :  Those marks were judge as probable scorch marks by Miller and Pellicori of STURP.  This is something we have to really take notice !  Mario is not a fan of Miller and Pellicori and don’t believe what they said about that.  He’s free of his opinion but I completely disagree with him on this.  Miller and Pellicori, you can ask Barrie Schwortz about that, were not amateurs regarding imaging !!!  They were truly experts on this subject, contrary to Mario, by the way (and me, of course).\nTo conclude my point, the funniest thing about all this debate is that there is a simple way that exist and that can tell us, once and for all, who’s probably right between Mario and me on this question, and that is the X-Ray fluorescent photographies that were taken by STURP in 1978.  Effectively, here’s what we can read on page 463 of the STURP paper « A Comprehensive Examination of the Various Stains and Images on the Shroud of Turin » :  “The water marks are interesting as they are the only marks (other than added material like the patches) that show up distinctly in the x-radiographs. Clearly, the density of heavy elements in the water-mark boundaries is sufficiently great to be apparent on these x-radiographs.”  So, if we could look at those X-Ray photos (I wish I could !!!), we could confirm if what I see as water (or wine) stains, really is (and that is not something else related to blood, like serum or plasma stain, as proposed by Mario).  And if those circular stains around each marks are really water (or wine) stains like I think they are, then, using Occam razor, we would be almost certain that those 6 dark marks surrounded by liquid stains are scorch marks and not blood stains, since that make no sense for someone to drop a bit of water (or wine) on some blood stains !  I’m sure, you understand my reasoning.\nI’ve asked Barrie Schwortz about those X-Ray photos and he told me that he have the negatives of those photos but, unfortunatelly, there was no exact references that were made to know what exact part of the Shroud one photo represent, and what other part of the Shroud the another photo represent.  Since Barrie is not the one who took those photos, it would be a very hard task for him to try to find the right one who was taken in this specific area of the Shroud !!!  So, I think that, unless a miracle, we’ll have to rest on our judgement to try to determine if those marks are really scorch marks or blood stains.  But remember folks, Miller and Pellicori from STURP thought that those marks were scorch marks and not made of blood.  Again, here, I’m not making this up to confort my personal idea…  This information is avalaible in this peer-reviewed article from Miller and Pellicori and I had the privilege to read it.\n\n","date":"January 29, 2012 at 8:56 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7673","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Sorry, my answer to the 3rd question of Co was incomplete.  Here is the complete answer :\n3- There is other light scorch marks like that elsewhere on the Shroud. Just look carefully at the so-called “poker holes” that is outside the righ buttock (when you look at a dorsal positive photo of the Shroud) , and you’ll see light scorches that look pretty much like the 2 set of 3 marks in the buttocks area (because of their small shapes and also because we can also see circular liquid stains around them).  Here’s a link on Mario’s website in order to see the area I mean : http://sindonology.org/shroudScope/shroudScope.shtml?zl=3&image=2&lon=323&lat=1419\nThe light scorch marks I refer to are located right in the middle of the screen.  To me, they look pretty much the same in nature than what can be seen in the buttocks area.  \nI also want to say it again : Those marks were judge as probable scorch marks by Miller and Pellicori of STURP. This is something we have to really take notice ! Mario is not a fan of Miller and Pellicori and don’t believe what they said about that. He’s free of his opinion but I completely disagree with him on this. Miller and Pellicori, you can ask Barrie Schwortz about that, were not amateurs regarding imaging !!! They were truly experts on this subject, contrary to Mario, by the way (and me, of course).\nAnd, to conclude, here’s a reflection of mine about the “importance” of those scorch marks (if this is really the case) :  To me, that would mean that there was one more “unrecorded” pyrolisis incident regarding the Shroud that was probably not directly related to the so-called “poker holes” !!!  Historically speaking, this “potential” information can have some great value…  From my perspective, that is one more clue that the Shroud was probably kept in Constantinople for a long time, since there was at least 2 pyrolisis incidents on the Shroud (the so-called “poker holes” and this one in the buttocks area) that were most probably due to some drops of firebrands of incense on the cloth.  For the so-called “poker holes”, we have to think that the firebrands were much bigger and, consequently, the incident must have been more important and dramatic.  I firmly think that this would be wrong to judge this topic as “no value”, especially, as I said, in an historical perspective about the Shroud…  That’s where I stand presently in my reflection about this interesting “inquiry” !!!  I think that if I proven right about this, that mean that the Shroud survived A BUNCH of pyrolisis incidents during his long life, and to me, the fact that this cloth is still here with us in a relative good condition, this is what I call a little “miracle” in itself !   \nAnd the truth is :  I NEVER read anything anywhere regarding this possibility that there could have been more than one pyrolisis incident that possibly involved firebrands of incense.  I think someone should investigate this topic more deeply and write an article about that.\n\n","date":"January 29, 2012 at 9:37 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7675","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Vemos las marcas de manera muy diferente……\nLas 4 marcas que refiere Mario Latendresse, y a las que yo también me refiero, tienen una ESTRUCTURACION completamente distinta a las otras marcas que usted propone.\nEn lo que SI estamos de acuerdo es que el tema es lo suficientemente interesante para ser investigado en profundidad.\n\n","date":"January 29, 2012 at 11:37 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7679","author":"co","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"On his website, Mario wrote: “It was recently pointed out to me by Yannick Clément that these marks could be burned marks and not bloodstains based on the study of Pellicori and Evans. Although, not impossible, this argument would be based on the burned marks being produced while the Shroud is folded. An analysis of the marks on the backside (photographs of 2002 published by Ghiberti) shows that this is unlikely, as the color intensities of the marks on the backside do not match a transmission of the burning material from front to back and from back to front again.” I do agree with Mario and cannot heip thinking Yannick is a very poor “amateur perceptive archaeocryptologist”.\n\n","date":"January 30, 2012 at 8:59 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7689","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Correction: “is a very poor amateur perceptive archaeocryptologist HERE”\n\n","date":"January 30, 2012 at 9:28 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7693","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Yannick, you’d better examined the area in transmitted light.\n\n","date":"January 30, 2012 at 9:09 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7690","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Typing error should read: “examine”.\n\n","date":"January 30, 2012 at 9:20 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7691","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"To all of you who wouldn’t trust what I said yesterday, here’s what we can read at the page 77 of the marvelous paper written by Vern Miller and Sam Pellicori from STURP entitled “Ultraviolet fluorescence photography of the Shroud of Turin” :  “The circular mark in the thighs (D-5 and C-5) RESEMBLING a scourge MIGHT BE a scorch mark.  Similarly, in D-7 and C-7 (note :  This is the buttocks area), there is NO FLUORESCENCE EMISSION (note :  normally, when there is a blood stain, there is also a fluorescence emission due to the presence of a small halo of serum around the blood), but PERHAPS THE MARKS HAVE THE SAME ORIGIN AS THE CIRCULAR BURN HOLES in this section. (note : they are talking about the so-called “poker holes”).\nSo, you can see that Miller and Pellicori, even if they stayed prudent on the subject (proving that they had a good scientific judgement), conclude that those marks have more chances to be scorch marks than blood stains, mainly because of the lack of a fluorescence emission around them.  And as you know now, I’ve also add one other clue in favor of the scorch marks hypothesis :  the probable presence of circulars water (or wine) stains around each dark marks.\nNow, knowing all those details and facts, it’s up to you to make up your mind about that !!!   I just want to add this reflection that is very true about the Shroud :  A lot of times, what we think we see is not exactly the reality !!!  Maybe I’m wrong about this question of the marks in the buttocks area (just like Miller and Pellicori could be wrong too), but, to those who think like Mario and believe that those marks are made of blood, I just say this :  PROVE US WRONG !!!  Show me hard scientific FACTS that can prove that those marks are really made of blood material and I will change my mind.  Not before that…\n\n","date":"January 30, 2012 at 9:25 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7692","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Yannick you wrote: “A lot of times, what we think we see is not exactly the reality !!!”; It definitely apples here to you as your reconstruction of the event just cannot archaelogically/physically work (a transmission of the burning material from front to back and from back to front again) unless you believe in a most miraculous tramistting process.\n\n","date":"January 30, 2012 at 9:37 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7694","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"My reconstruction of the event is simply my own little hypothesis to explain those scorches.  Of course, I can be wrong.  But I think I’m not so off-track.  Anyway, as I said in another comment, I think a scientist should investigate those marks much further and publish a paper about them.  As I said, if he could put his hands on the X-Ray photos taken by STURP, he would be, at least, able to confirm if the circular clear stains around the dark stains are water stains or not.  If it is, then there would be a great probability that those marks are really light scorches from an unknown pyrolisis event…\n\n","date":"January 30, 2012 at 11:40 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7704","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"It is contradicted by the very color intensities of the marks on the backside.\n\n","date":"January 30, 2012 at 9:51 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7695","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Yannick, don’t you forget, the Shroud has two sides and your reconstruction  only works one side.\n\n","date":"January 30, 2012 at 9:56 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7696","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"It is simple :  alot of those marks are not present on the backside.  I’ve seen it and I think there’s only 2 spots we can detect.  It’s normal since, from my perspective, it was only superficial scorches.  It didn’t make burn holes like the so-called “poker holes”.  Those “poker holes” were part of a pyrolisis event much more dramatic.  That’s what I think.\n\n","date":"January 30, 2012 at 11:36 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7703","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Correction: “only works on one side”\n\n","date":"January 30, 2012 at 10:08 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7697","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"This is a very strong fact against your hypothesis.\n\n","date":"January 30, 2012 at 10:11 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7698","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"I am on the fence on this matter, but I’m glad it has been brought up by Dan here. It has been on my mind for much time…First I must add that I can only make assertions here from what material we have available, so my observations are based on images available to me.\nI’ll attempt to address my assertions in point form to make it shorter and also make it easier to debate…\nFrom my observations;\n1. I notice a difference in “luminence” and ‘density’ between the posterior-markings (PMs) and ‘any’ burn markings. The PMs seem more reminiscent of some blood stains that seem to have ‘settled’ at the end of a blood stream.\n2. The PMs do not seem symetrical, not from a centered point of the Shroud itself or of the centering point of either the poker-hole burns or the larger burn markings. Also the angles are quite different! This leads me to believe these PMs are not related to either incident and are ‘independent’ of both.\n3. Observations from point 2 bring me too conclude the PSs were most likely not created whilst the Shroud was in a folded configuration…Due primarily to the angle of the formation….Note; I have seen any photos of what Max as suggested here.\n4. It seems improbable that the ‘liquid’ stains surrounding the PMs are a “dousing” as they are too exact. (Unless someone had a syringe style douser and centered it exactly to the stains)…This is especially evident from the top two stains (left & right). These are precise circular stains bearing from the center and also of a deeper colour then most all water stains.\nR\n\n","date":"January 30, 2012 at 11:45 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7705","author":"Ron","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"I will just say this :\n1-There is a very good symmetry between the 2 series of 3 marks.  Love it or not, it’s true.  I’ve check it out myself from a photo of the Shroud in a mapping software I work with.  The only thing is that the axis for the symmetry is not totally straight up.  You have to BEND THE AXIS a bit.  But if you do that, the 2 series of marks align almost perfectly one over the other.  This observation is a good indicator (not a proof) that the Shroud was probably folded in 2 for those marks to appear.\n2-Miller and Pellicori from STURP didn’t notice any fluorescence around those marks.  Here, we have to remember that around almost every blood stains and scourge marks, Miller and Pellicori did noticed fluorescent halos…  It’s fun how people around here neglect this precious scientific FACT !  An what is the real meaning of this information ?  It mean that, most probably, the liquid stains we see around every marks were formed on the Shroud AFTER the body image was formed !!!  Effectively, we know for a FACT that the serum halos that we found around almost every blood stains and scourge marks on the Shroud, did stained the cloth BEFORE the body image formation was active.  By staining the cloth in those areas, the serum was able to prevent any coloration on the surface of the fibrils they covered.  No such thing was seen by Miller and Pellicori in the UV photo of those 2 series of 3 marks in the buttocks area.  So, if those circular liquid stains were formed AFTER the body images, that mean that, most probably, the marks were ALSO formed AFTER the body images.   The hypothesis that those marks are scorches reaches a higher level, just by considering this scientific FACT.\n3-The fact that those liquid stains seem almost perfect in their circular shape makes me believe that it cannot have come from someone throwing water in a hurry to extinguish the firebrand.  It MUST have come from someone dropping some liquid on those places very gently AFTER the firebrand were extinct, just to make sure that they were 100% extinct.  This scenario of mine offers a simple and realistic explanation for those liquid stains IF the marks are really scorches (like I think).\n4-If you take into account of all the observations and facts we know about the body images, the blood on the Shroud and those particular marks, and then you used the Occam razor, then the most plausible conclusion is that those marks are light scorches and not blood.\nThe best thing that could happen to really know the truth about those marks would be to find the right X-Ray photo that was taken from this area and look if we can see the dark marks.  If we can, that would prove that they are not composed of blood, since THE BLOOD STAINS ARE NOT VISIBLE on this kind of photos, only the water stains can be seen (other than added material like the patches – quote from STURP)…\n\n","date":"January 30, 2012 at 3:21 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7717","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Very good analysis, Ron\n\n","date":"January 30, 2012 at 12:59 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7707","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"I also want to say that : If it’s ever proved that those marks are really blood stains, that wouldn’t make Mario’s hypothesis necessarily true, since 1- there is no record in history that the Romans ever used spikes on their cross to torture the victim. And 2- those injuries (if this is blood of course) could have been done well before the crucifixion (during the scourging period or after, during the way to Calvary).  There’s absolutely no way to be sure that they were made on the cross (if this is blood of course).\nAnd I also want to say this :  Forget about the sedile in relation to those marks !  The sedile was a kind of horn that was sometimes put between the legs of the victim to retard death (which is a great sign to me that death in crucifixion normally came from slow asphyxiation).  \nNo way this thing could make injuries like we see in the buttocks area (if this is blood of course).  And, in Jesus case, we can really assume that there was no sedile used, since he must have been dead before sunset.  So, in this particular context of the day before the Passover and the Sabbath, there was absolutely no need for a sedile, simply because there was no need to retard death.\n\n","date":"January 30, 2012 at 3:48 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7718","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Yannick you wrote: “This is an error of interpretation from Mario. THIS SET OF 3 SYMETRIC MARKS WITH WATER STAINS AROUND THEM.” \n1/ The true fact is there are 4 visible circular halos not 3 on the area under study.\n2/ This is not non archeological fresh blood but most likely archaeological remoistened blood (with a watery solution).\nHowever, I do agree with you, Mario’s sedillis hypothesis can easily be challenged by the scourging mark hypothesis on a 50-50% basis. This area need further examinations for sure.\n\n","date":"January 30, 2012 at 4:37 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7721","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"I dont think Mario was thinking that it came from a sedile, but I wanted to make sure nobody believe that.  And I don’t know where you see 4 marks.  I see 2 sets of 3.\nAnd since you still believe it is blood, how can you explain the absence of fluorescence around the dark stains, while everywhere else (including the scourge marks), Miller and Pellicori have note these fluorescent halos ???  To me, this single scientific fact make that the blood theory just don’t ring true…  Of course, the only way to be 100% sure about that would be that another Alan Adler could perform chemical analysis of a sample taken from these marks to see if this is blood or something else.  It’s not for tomorrow ! ;-)\n\n","date":"January 30, 2012 at 5:59 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7726","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Yannick, just put your x10 magnifying glasses on!\n\n","date":"January 31, 2012 at 9:09 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7742","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"There are only 4 bloodstains in conjunction with a halo.\n\n","date":"January 31, 2012 at 9:28 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7743","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Correction: “4 almost symetric bloodstains”\n\n","date":"January 31, 2012 at 9:30 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7744","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"New correction: ‘4 almost symetric sets of bloodstains”.\n\n","date":"January 31, 2012 at 9:38 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7746","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Last typo correction: “2 almost symetric sets of bloodstains”\n\n","date":"January 31, 2012 at 9:43 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7747","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"We might also think of just 2 long nails driven from behind through the vertical post “to spur” the cucifixion victim’s butts.\n\n","date":"January 30, 2012 at 5:01 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7724","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Correction: The wounds might also well have been made by two long nails hammered through from behind and half way down the upright beam (instead of a sedula) “to spur” the cucifixion victim’s butts.\n\n","date":"January 31, 2012 at 8:56 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7741","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Yannick is making three major errors:\n1) The “sedile” (aka sedillis) has been described in various ways. Seneca the Younger (4 BC – 65 AD, philosopher, statesman, dramatist) describes the sedillis as “acuta sedere cruce” that can be translated as “a sharp chair on the cross”. Seneca also describes it as “acuta crux … subdas” (Epistles), that is a sharp cross placed underneath the victim. He also writes (translation) “Do you think it’s so great to weigh down on one’s own wound and hang down from the Patibulum, stretched out while spread abroad?”.\nBased on this, Yannicks’ statement that the sedile could not in any way cause wounds on the butts is flat wrong.\nWhat we see on the Shroud is likely the sign of a sedile that was not mentioned in the literature in its full details, yet is close to the description of Seneca as “a sharp chair” or “sharp cross …underneath”. Sharp indeed! \n2) The paper by Miller and Pellicori does not give a definitive answer about the origin of the stains under consideration. On page 79 of their paper we read:\n“Two small circular stains at C-7 and D-7 are mirror images and visually resemble weak scorches. In fluorescence these stains are absorbing. Note also lighter boundary areas associate with water marks.”\nIn the Section “Discussion — Laboratory experiments” on page 84 in the context of the fluorescence photographs we can read:\n“Laboratory data for whole blood displayed total absorption, which is in agreement with the Shroud data”\nThis is also summarized in Table I on page 75: \n“Blood, UV Fluorescent Characteristics: Highly absorbing. No color. Fluorescing borders apparent around some areas.”\nFrom these facts, you certainly cannot conclude from the fluorescent photographs that these stains under consideration are not blood stains. Miller and Pellicori data just says that it is blood. But I actually disagree that fluorescence photographs is the last word on this. It is possible that the Turin authorities have a microphotograph of these stains and that we could see, from white reflective light (i.e., no fluorescent photography), that blood is clearly involved in these stains.\n3) Yannick constructed a convoluted scenario for the origin of these stains as scorch marks, totally detached from any historical event. The scenario concocted by Yannick is so improbable that almost anything else could be imagined. The stains cannot happen while the Shroud was folded due to the backside color intensities that do not match. Miller and Pellicori, of course, did not have access to the backside of the Shroud and could not see that the hypothesis of mirror scorch marks was not plausible. And Ron (commenting in this blog) pointed out a clear fact: if someone had put water on these stains, it was done with great precision, contrary to what we would expect for someone hastily trying to extinguish whatever was burning the Shroud. That by itself is not a plausible assumption.\nTo conclude:\nI think that all the data that we have at the moment point to a detail that I would place at the level of the nails through the wrists versus through the palms: these are bloodstains from wounds caused by a sharp sedillis. It is (very) likely that we have yet again a clear sign that shows forgery is not a plausible hypothesis for the Shroud.\n\n","date":"January 31, 2012 at 2:34 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7733","author":"Mario Latendresse","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Mario forget one important thing :  My hypothesis that those marks are light scorches is not a view of my imagination !  This is the same hypothesis than Miller and Pellicori !!!  And what Mario said about the backside is simply not true at all.  ALL the marks on the backside of the Shroud are less clear than their corresponding marks on the front side, proving that the event happened on the front side of the Shroud while he was unfold.  And my scenario of one folding is completely consistent with the symmetrical aspect of the 2 sets of marks and with the fact that one set of marks is more intense than the other !  Sorry but there’s nothing about those marks that can completely reject my scenario.  \nAnd for the fluorescent thing, Mario forget another major FACT that come from the Miller and Pellicori paper :  All the scourge marks and all the other blood stains show a fluorescent halo around them, but no fluorescent halo can be seen around the marks in the buttocks area.  Mario can twist it all he want in his brain in order to confort his idea, but sadly for him, the truth is this :  THOSE MARKS DON’T REACT THE SAME WAY THAN EVERY BLOOD STAINS ON THE SHROUD WHEN THEY ARE SUBMIT TO FLUORESCENT LIGHT !  PERIOD !  AND THIS IS PRECISELY WHY MILLER AND PELLICORI EMIT THE HYPOTHESIS THAT THOSE MARKS ARE SCORCHES LIKE THE OTHER SCORCHES WE CAN SEE OUTSIDE THE BUTTOCKS AREA.\nThis very important aspect of those marks was point out by Miller and Pellicori in their study of the UV fluorescent photos.  Now, of course, anybody can reject this paper and say, like Mario, that those guys were wrong in their interpretation…  But, personally, I trust their judgment since they were truly imaging expert, unlike Mario.\nAlso, in the context of a crucifixion that could not last long (because of the Sabbath and the Passover), the use of a sedile is highly unlikely.  This just doesn’t fit with the context.\nAll this story prove again that anybody just see what he wants to see about the Shroud and, to do so, is willing to reject the scientific FACTS that were gathered by STURP !!!  It’s a very good example of the “I think I see” syndrome !\nI also want to say that I can be wrong in some aspects with my scenario.  Of course.  But the thing is :  if you put all the data we know about the Shroud and particularly about those marks and you use the Occam razor principle, the most viable scenario to explain those marks are that they are light scorch marks.  Miller and Pellicori came to this conclusion.  Not Mario.\n\n","date":"January 31, 2012 at 9:55 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7749","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Of course, Mario cannot change is mind because it was already set. He he !\n\n","date":"January 31, 2012 at 9:33 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7745","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Yannick, I do think that even being seated on a “sharp chair”, you would not change your mind either! ;-)\n\n","date":"January 31, 2012 at 10:07 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7750","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Of course, the purpose of the sedile was not to give some comfort to the victims, but to add something that could support better their body weight, so that they would die slower !  Having some kind of a horn between your legs must have been really painful, of course !  But, at the same time, having some kind of a horn between your legs don’t have the effect of making 2 small sets of 3 symetric injuries in your buttocks area !  To believe that a sedile could cause this kind of injury, someone MUST use a lot of speculation and extrapolation…\n\n","date":"January 31, 2012 at 4:27 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7785","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Last comment : I sadly think that the major error of Mario was to publish his hypothesis on his website without having considered the important observations that were published by Miller and Pellicori and their STURP paper.  And when I point out those observations to him one year ago (after the publication of his paper), of course, he didn’t changed his mind.  Barrie Schwortz told me once that in all his career in the Shroud World, he never saw a scientist change his mind, except for just a few, like Ray Rogers.  Personally, if someone shows me some SCIENTIFIC PROOFS that those marks are made of blood, I will change my mind, no problem.  But, for the moment, nobody can show me proofs like that, so I stick to the hypothesis of Miller and Pellicori.  Unlike Mario, they were in Turin and saw the cloth personally, so I have a tendency to trust their judgment more than his…\n\n","date":"January 31, 2012 at 10:08 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7751","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Schwortz was also in Turin. He told me Frei had not lifted up the least sample with a sticky tape from the Shroud face. According to himit was A FACT…  till I read Avinoam Danin had actually examined a Frei sticky tape lifted up from the left side of the Shroud face!\n\n","date":"January 31, 2012 at 12:48 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7768","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Neither would you being seated on the Occam razor blade!\n\n","date":"January 31, 2012 at 10:11 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7752","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Sorry, one more comment :  A sedile was like a horn put between the legs of the victim and used to support the weight of the body, not to torture them some more in the buttocks area !  This FACT is not consistent at all with the marks in the buttocks area.  This FACT, along with the context of the crucifixion of Jesus, got to be taken into account when you use the Occam razor principle.  This one, and of course, 4 other major points :  The symmetrical aspect of the marks, the fact that one set is more intense than the other, the fact that there is no fluorescence around those marks and the evident presence of a circular liquid stain around each marks.  Taking all that into account, the more viable hypothesis is that those marks are light scorches and not blood stains.  Of course, only a chemical test could give a definitive answer to this question.  But until this test can be done, the Occam razor principle is the best thing we have to evaluate what is the most pertinent hypothesis.\n\n","date":"January 31, 2012 at 10:25 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7753","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Yannick, the “I think I see” syndrome does apply to you, as you are not able to discriminate between a possible water mark, a scorch mark and 2 sets of almost symetric remoistened bloodstains surrounded with a circular halo (the sets being archaeologically consistent with the use of a “specific sharp chair”). Shall I repeat once more, your scenario is totally inconsistent with the marks recorded on the two sides of the Shroud.\n\n","date":"January 31, 2012 at 10:31 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7754","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"To forge my opinion, I didn’t rely on “I think I see”, I relied on the STURP paper published by Miller and Pellicori.  It’s pretty much different than what Mario did when he wrote down his hypothesis…\n\n","date":"January 31, 2012 at 11:40 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7759","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Yannick, you need more than only Miller and Pillicori’s opinion. All the more so as the did not see the backside  of the Shroud. Pellicori was an optical ingeneer. So was the French Shroud researcher André Marion who partially misread ghost inscriptions on the Shroud face. Miller was a photographer. So is the American Barrie Schwortz who failed to discriminate between non body and body image resolution when it came to possible partial coin blood decals on the eye areas. Even image specialists can be the victims of “I think I sees” and “I think I dont sees”.\n\n","date":"January 31, 2012 at 11:59 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7761","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"The fact is  Pellicori and Miller were neither forensic archaeologists nor opto-forensic analysts.\n\n","date":"January 31, 2012 at 12:14 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7765","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"I just try to stick to the scientific data regarding the Shroud that were published in peer-reviewed journals.  And the data concerning those marks told us that they didn’t react the same way the blood stains react when they are submit to UV fluorescent light.  I’m sorry for all the people (espectially Mario) who don’t agree with me but THIS IS A FACT.\n\n","date":"January 31, 2012 at 2:00 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7769","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"It is not a fact, it is a “I think I see” (see Pellicori paper)\n\n","date":"January 31, 2012 at 2:06 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7771","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"“They visually resemble weak scorches”.\n\n","date":"January 31, 2012 at 2:09 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7773","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Wangher was also published in Applied Optics. Do you really think Wangher’s opinion on the coin-on-eye issue is a fact?\n\n","date":"January 31, 2012 at 2:14 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7774","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Yannick you wrote: “Barrie Schwortz told me once that in all his career in the Shroud World, he never saw a scientist change his mind, except for just a few, like Ray Rogers.” I personnally changed my mind about the coin-on-eye issue.\n\n","date":"January 31, 2012 at 10:48 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7755","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"I first did not give any credence to Filas et al’s image extractions on the eye areas till I myself became aware they had more “sensed” than correctly identified  partial Pilate coin images on the right and left eye areas and the left eyebrow arch area.\n\n","date":"January 31, 2012 at 11:06 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7758","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"“They visually resemble weak scorches”.\n\n","date":"January 31, 2012 at 2:09 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7772","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Also, what do you make of the FACT that there is circular liquid stains around EACH marks and that those liquid stains are most probably NOT serum or plasma stains (since those stains were not able to prevent the image formation on the Shroud simply because they didn’t fluoresce) ?  The presence of liquid stains (most probably made of water or wine) are totally consistent (no matter the perfection of their form) with a pyrolysis event, but are not at all consistent with blood stains from some spike injuries.  What do you make of this observation ?\nJust to be clear :  The fluorescent halos Miller and Pellicori saw around every blood stains and scourge marks are there simply because the serum stains that stained the cloth around the blood stains were able to prevent any image formation under them.  By doing so, the natural weak fluorescence of the Shroud (that is present everywhere there’s no body image and that was caused probably by the washing of the cloth with Saponaria – Ref. : Rogers)  was able to pierce through those serum stains and could be seen by Miller and Pellicori.  That’s exactly why they could detect fluorescent halos in the regions that were stained by serum coming from the retraction of the blood clots (normal process of blood clotting).  NO SUCH THING WAS SEEN BY MILLER AND PELLICORI IN THE UV FLUORESCENT PHOTO OF THE BUTTOCKS REGION REGARDING THE 2 SETS OF MARKS.  That mean that there’s no serum around those marks, unlike what can be seen around every blood stains and scourge marks…  LOVE IT OR NOT FOLKS, THIS IS A SCIENTIFIC FACT.  Of course, this fact don’t mean necessarily that the hypothesis of Miller and Pellicori regarding possible light scorches is correct, but that mean that the hypothesis of Mario is highly unlikely.\n\n","date":"January 31, 2012 at 2:19 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7776","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"In the double hypothesis the Shroud could have been soaked with a watery solution and a “sharp chair” used invo!ving deep wounds in the buttock areas, the said wounds might well have been saturated with the watery solution. This would then account for possible waterstains surrounding bloodstains.\n\n","date":"January 31, 2012 at 2:45 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7777","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Whatever you believe Max, good for you !\n\n","date":"January 31, 2012 at 4:29 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7786","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"It is just a working hypothesis just in case the 2 sets of circular stains ARE weak scorches and the circular halos water stains (which is FAR FROM BEING scientifically demonstrated by Miller & Pellicory who just claimed “[They] VISUALLY RESEMBLE to weak scorch”). \nTo underrate Mario’s hypothesis on the ground he is the victim of the “I think I see” syndrome is to overrate Miller & Pellicori’s which ALSO amounts to a “I think I see” hypothesis.\n\n","date":"January 31, 2012 at 5:34 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7797","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"The watery solution oozing post mortem throuh the deep wounds when the buttocks were pressed against a hard surface.\n\n","date":"January 31, 2012 at 2:52 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7778","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Correction: “the deep non retracted tiny-mouthed wounds”\n\n","date":"January 31, 2012 at 3:08 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7781","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"And why we don’t see those kind of liquid stain (that don’t show any fluorescence) around the scourge marks in the same buttocks area ?  Max, I think your completely off-track here…  Sorry.\n\n","date":"January 31, 2012 at 4:30 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7787","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Yannick, shall I repeat here again and again, we need FURTHER examination of the buttock areas to be conclusive in any way. Pellicori just claimed “[They] VISUALLY RESEMBLE to weak scorches” (which does not mean the 2 sets of marks are scientifically identified as scorch marks as you imply, if words have a meaning for you! Who is off track?Cannot you read?).\n\n","date":"January 31, 2012 at 5:02 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7793","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"The bloodstained body areas the most likely to rest directly on a slab or a tomb shelf were precisely the buttocks, shoulders and left feet? Most curiously, those same body areas are not fluorescent. This is consistent with my working hypothesis and totally inconsistent with your most improbable scenario. Yannick, what do you make of this? I guess nothing again.\n\n","date":"January 31, 2012 at 6:02 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7801","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"…or subjected to a tight wrapping up.\n\n","date":"January 31, 2012 at 3:02 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7780","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Cada PEQUEÑO tema relacionado con la Sábana da lugar a GRANDES problemas de interpretación.\nHay marcas o manchas de sangre cuyos márgenes NO emiten fluorescencia, como la sangre que cruza la espalda (DORSAL) y la sangre del pie izquierdo (DORSAL).\nAsí que la NO presencia de fluorescencia en las 4 marcas referidas por Mario Latendresse ( DORSAL) no tiene forzosamente que significar que no sean marcas de sangre.\nSu apariencia es de sangre y , en mi opinión, el que sean marcas de quemaduras sobre las que se ha echado agua o vino de manera “tan  particular” me parece ABSURDA.\n\n","date":"January 31, 2012 at 4:30 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7788","author":"co","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Whatever you want to believe Co, bravo for you !  Read again Miller and Pellicori paper and you’ll see that all scourge marks have a fluorescent halo around them !  THIS IS A FACT.  But, of course, their conclusion don’t go with your preconception, so you prefer to discard them.  It’s so easy to do that :  Take what fits with your preconception and forget one or two FACTS that don’t fit…  THIS IS NOT SCIENCE.\nThere is water stains around each marks (not serum stains).  This FACT alone (no matter the form of the water stains) fits better with the idea of scorches than with the idea of blood stains.  And the absence of fluorescence mean that those water stains (if this is not wine) appeared on the Shroud AFTER the body image was formed.  This FACT is completely incoherent with the data we know about the blood stains formation versus the body image formation (blood stains came first, then the body image)…  WHY IN THE WORLD THERE WOULD BE WATER STAINS (OR WINE STAINS) AROUND EACH MARKS IF THEY WOULD BE MIRROR IMAGE OF BLOOD CLOTS ?  This observation just doesn’t fit right with the idea pretending that those marks are made of blood.\nAgain, I’ll repeat it to make it clear :  Nobody can say for sure if Miller, Pellicori and me are correct with the “scorches” hypothesis, but this is also true with Mario’s hypothesis.  And for me, his hypothesis, using Occam razor is highly unlikely.  And, to conclude, the only thing that could resolve the question, would be a CHEMICAL TEST (and not just a check out of some high resolution photos like Mario think) to know if those marks are composed of blood.  And a specific test like that, for a subject not so important regarding the Shroud in general, will probably never happened !  So, all we’re left with is probabilities.  And in face of all the data and observations that came from STURP, my opinion is that the hypothesis proposed by Mario is highly unlikely and the one proposed by Miller and Pellicori (not mine) have a pretty good chance to be correct.\n\n","date":"January 31, 2012 at 4:47 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7789","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Yannick, mirror images can be deceptive as there may ALSO be false mirror images.\n\n","date":"January 31, 2012 at 5:42 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7798","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Yannick, YOU YOURSELF JUST FORGET the backside stains to force your most improbale scenario on us. Is that you call Science?\n\n","date":"January 31, 2012 at 5:48 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7799","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Yannick, shall I repeat: The bloodstained body areas the most likely to rest directly on a slab or a tomb shelf were precisely the buttocks, shoulders and left feet? Most curiously, those same body areas are not fluorescent. This is consistent with my working hypothesis and totally inconsistent with your most improbable scenario. Yannick, what do you make of these FACTS as you would call them? Not much, I guess.\n\n","date":"January 31, 2012 at 6:04 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7802","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Correction: “parts of those same body areas”\n\n","date":"January 31, 2012 at 6:28 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7805","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Correction: ‘foot”\n\n","date":"January 31, 2012 at 6:05 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7803","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Yannick, who is totally off track?\n\n","date":"January 31, 2012 at 6:14 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7804","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Yannick, yo no invento nada, siempre me documento en la medida posible. \nNo tenido acceso a los trabajos de Miller y Pellicori, pero si a un buen artículo de A.Rodriguez-Saldaña de 2009 muy bien documentado sobre los trabajos de Miller y Pellicori:\n—Miller, V.D. – S.F. Pellicori – Ultraviolet Fluorescence Photography of the Shroud of Turin – Journal of Biological Photography, Vol. 49, No. 3, July 1981, pp. 71-85.\n—Pellicori, S. – M.S. Evans – The Shroud of Turin Through the Microscope – Archaeology 34, January/February 1981, pp. 34-43.\n—Pellicori, S.F. – Spectral Properties of the Shroud of Turin – Applied Optics Vol. 19, No. 12, June 15,1980, pp. 1913-1920.\n—Pellicori, S.F. – Chandos R.A. Portable Unit Permits UV/vis Study of “Shroud”. Industrial Research & Development, Feb, 1981, 186-189.\nNo tengo ninguna razón especial NO CREER lo que escribe Rodriguez-Saldaña en su artículo “El STURP: Un completo estudio científico” . \nhttp://www.lasabanasanta.org/docs/sturp.pdf\nY escribe textualmente en el apartado:\n11. Fluorescencia fotográfica:\n“En algunas manchas de “sangre” (herida costal, herida de la muñeca, herida del pie derecho dorsal) se rodea de márgenes fluorescentes (Figs. 30b y 30c). De estas zonas no hay micrografías, espectro de reflectancia ni cuantificación de la fluorescencia, por ser posteriores estos estudios (a la vista de estos resultados hubiera sido importante realizar esas pruebas, pero el S.T.U.R.P. ya no disponía de tiempo para ello). Miller y Pellicori interpretaron que esos márgenes fluorescentes podrían deberse a la presencia de suero, el cual retardaría las reacciones de formación de la imagen.\nLOS MÁRGENES DE OTRAS HERIDAS ANALIZADAS ( SANGRE QUE CRUZA LA ESPALDA O SANGRE DEL PIE IZQUIERDO DORSAL) NO EMITEN FLUORESCENCIA.”\n(Las mayúsculas son mías) \nAlejandro Rodriguez-Saldaña es profesor asociado de la Universidad de Murcia (España) en el Departamento de Biología Celular e Histología.\n\n","date":"January 31, 2012 at 6:37 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7806","author":"co","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"I agree with what is reported by Alejandro Rodriguez-Saldaña.  It’s correct.  But the blood in the feet area and the blood across the back are probably the 2 only places where there’s no fluorescence at all, and you know why ?  Simply because this blood was post-mortem blood in a liquid state when he stained the cloth !  There was no time for a retraction process before he stained the cloth (I’m not even sure that a retraction process is still working in the case of post-mortem blood) and that’s why there’s no serum stains around those blood stains.  BUT, for all the scourge marks all around the 2 sets of marks in the buttocks area, Miller and Pellicori report fluorescent halos !!!  This is a fact.  In this particular area (the buttocks), there’s only those 2 sets of marks that doesn’t react the same way than all the blood stains present there (the scourge marks).  It’s a good indicator that those 2 sets of marks are not made of blood.  And don’t forget the fact that there are liquid stains around each mark that are clearly not made of serum or other blood material.  Those stains are probably made of water or another liquid like that and came most probably in contact with the Shroud AFTER the body image formation.  All this is in good agreement with the idea that those marks are scorches instead of blood stains.\nAnd for the quote from Thibault’s website, I don’t agree with his remark in the sense that those fluorescent halos were detect everywhere there’s bloos stains on the Shroud, except, like you said, of the feet area and the blood flow across the back (for the reason I’ve explain :  they were made of post-mortem blood in a liquid state).  I think Thibault was too much prudent in his remark.  When you read the paper of Miller and Pellicori, it is quite clear that those fluorescent halos are present everywhere, especially around all the scourge marks, or, at the very least, around the vast majority of them.  And that include those in the buttocks area, but not the 2 sets of marks…  I really think this observation of Miller and Pellicori is a clear indicator that if a blood stain on the Shroud came from the decal of a pre-mortem blood clot (that was still humid at his surface), there was almost everytime a serum stain that was formed around this blood stain.  Since there is no such serum stains around the 2 sets of marks, it’s a clear indicator that it is highly improbable that those stains came from pre-mortem blood clots.  There would be a serum stain around them if this was the case.  This is not good for Mario’s hypothesis…\n\n","date":"February 1, 2012 at 11:45 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7840","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"………. y en el mismo sentido que A.Rodriguez- Saldaña, escribe el siempre MAGNÍFICAMENTE documentado Dr. Heimburger Thibault en su página “Suaire & Science”:\n“ on détecte autour de CERTAINES taches de sang, la présence d’un halo fluorescent à limite nette. Ceci pourrait correspondre à un exsudat de sérum formé lors de la rétraction du caillot: le sérum sanguin est en effet légèrement fluorescent.”\nhttp://www.suaire-science.com/sang.htm\n\n","date":"January 31, 2012 at 7:43 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7807","author":"co","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"In conclusion, Yannick’s most awkward hypothesis is most inconclusive while Mario’s most interesting sedillis hypothesis is only half conclusive. \nBefore I read Mario’s, I had observed those famous 2 sets of stains on the buttock areas in 2006. Then my very first thought was they might well be the result of two “blood-&-water comparative tests” done in situ textilis LONG AGO. \nAs early as Late Antiquity or the Middle Ages, that is in “ante-sindonological time”, wouldn’t it be possible the Shroud had been directly tested more or less symetrically folded in two and pressed with a hot iron in an attempt to check out  or solve the “old fresh looking blood mystery” ?\n\n","date":"February 1, 2012 at 9:36 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7832","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"If your talking about a sort of trial by fire, I seriously doubt that Max !  Since it was surely a precious relic, if they would have tried a trial by fire, they would most probably have done it in another place, much more discreet.  Also, it’s sure that if this is a pyrolisis event, it MUST have happen when the Shroud was completely unfolded, simply because of the correlation between the intensity of each sets of marks (including their corresponding marks on the reverse side of the cloth.  If it is a pyrolisis event, it must have follow the scenario I talked about :  a drop of 3 firebrands on one buttock and then, a folding in two of the Shroud, so that the opposite part was also burn a bit.  Then, on the reverse side, you have some marks more intense that correspond to the first marks that were made in the front side and you have some marks less intense (in fact, they are almost invisible) corresponding to the marks in the front side of the Shroud that were made when the cloth was folded over the firebrands.  I hope you follow what I’m trying to say ! From the configuration of the marks and the correlation regarding the color intensity, we can say with high confidence that the Shroud was completely unfold when the event occured and then, the cloth was folded over the firebrand to extinguish the fire (if it is really a pyrolisis event of course).  Then, water or wine was droped very carefully to make 100% sure the fire was completely extinct.\n\n","date":"February 1, 2012 at 4:51 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7846","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Yannck, CANNOT YOU READ ME: I am not talking AT ALL of a trial by fire! In MY 2006 EYE, the stains just might DECEPTIVELY resemble weak scorches and be just 2 SETS OF ALMOST SYMETRICAL STAINS left by two blood-and-water comparative tests in situ textilis  subjected to a heating source (that of a hot iron). Shall I remind you it was just a first sight impression which needs to be further investigate as an alternative hypothesis to Mario’s not to yours.\n\n","date":"February 2, 2012 at 7:55 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7852","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Ok.  At least we agree that more investigation need to be done to know the truth about those marks…\n\n","date":"February 2, 2012 at 9:31 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7854","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Glad you can hear me…\n\n","date":"February 3, 2012 at 7:18 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7885","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for today by Mario Latendresse","post":"Correction: the “fresh looking old blood” mystery”?\n\n","date":"February 1, 2012 at 9:51 am","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","id":"comment-7834","author":"Max Patrick Hamon","site":"shroudstory"}]
