[{"id":"comment-8819","author":"jennifer","post":"God has used you to give many gifts to the world. You, yourself, you son, and your testimony. You are such a true, honest, and loyal person to God and to his kingdom. He has something so special for you both here on earth and also in heavan once you finally arrive there some day. He is building you both a mansion there now. This earth is not our home. Heaven is our home. And he is waiting there to welcome you some day. He has a plan for your son. A plan that you don’t know yet but it is so great and some day soon we will all know what that plan is. I commend you so greatly for what you went throught to have him born into this world. It was so hard for you. I don’t know another woman that would have gone through all of that. I am truly grateful for you. You are so awesoem and I can’t wait to meet you someday in heaven!.","date":"2012-02-29","mins":"2:23 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-21582","author":"jennifer","post":"Christie, a similar thing happened to me driving back home across state lines. I wasn’t speeding, but there was a mist falling, and the road was a bit wet. I lost control of my car as I came around a curve. My car left the road, hit the embankment and flipped. My car was totalled, but my airbag did not deploy. The only side of my car not smashed in was the drivers side! I remember my body not moving throughout the whole thing as if I were being held in place. I walked away from the wreck without a scratch. To top it off, the only witness was a retired ambulance dispatcher who was able to call in the wreck with all of the details. (My i Phone was unuseable, as it was covered in strawberry shake. Apparently, cup holders weren’t designed to be used upside down.). The next car to stop was one of her previous coworkers who stayed with me until the deputy arrived..","date":"2013-01-04","mins":"1:58 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]
