[{"id":"comment-192852","author":"henrik","post":"Isn’t the overlapping watermark a greater problem for the reweave hypothesis than Jackson´s banding structures?.","date":"2015-03-08","mins":"8:13 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-101682","author":"henrik","post":"From OK’s quote above: ” …as oil is not cleaned by the laboratory processes used before carbon dating and if oil is present on a sample, the date produced by carbon dating is in fact the date of contamination.” Very interesting given the historical hints that the shroud may have been boiled in oil some time before 1500, Antoine de Lalaing: “To prove if it was the true Shroud, it was boiled in oil, tossed in fire, laundered different and numerous times. But one could not efface nor remove these imprints and marks of our sweet Lord.” It also reminds me of an experiment by Mario Moroni and Remi van Haelst where modern linen (relatively high amount of C14) was boiled in mineral oil (relatively low amount of C14). Samples of treated and no treated linen were then radiocarbon dated by Toronto and Oxford who noticed a 36% decrease in C14 for the treated piece. The paper can be found here: https://www.shroud.com/vanhelst.htm So what about the opposite conditions of old linen and modern oil based on vegetable or animal (fat)? I made some rough calculations based on the assumption that the exchange of carbon atoms between linen and oil affected 36% of the linen carbon atoms and estimated the new age to be around 2000 years taking into account the exponential decrease from 1500. It seems reasonable anyway to have a radiocarbon estimation of age closer to the moment of contamination as Mark Guscin reported the expert telling in the quote from OK. Strange that no one has investigated this alternative further!.","date":"2014-04-20","mins":"12:10 pm","url":"https://shroudstory.com/2014/04/10/ray-schneider-why-is-the-carbon-dating-wrong-i-dont-know-that-it-is-wrong-i-am-quite-certain/","cat":"carbon_14_dating","title":"Ray Schneider: Why is the carbon dating wrong? I don’t know. That it is wrong I am quite certain . . ."},{"id":"comment-104021","author":"henrik","post":"Thank you for your responses. I think you have argued quite convincingly why we should treat Antoine de Lalaing’s claim with extra caution and will only grant boiling in oil a small chance of being true. What I had in mind was the shroud suspended at its center on a wooden plank with its both ends submerged in the vessel for testing the effects on the lower part of the frontal foot region. But of course I have no evidence to back it up with. I don’t consider Pam Moons argument for this part being cut away based on the Lier copy very strong for example. Later copies shows the same trend of a longer shroud. And the distances poker holes – edge is roughly the same for both ends of the cloth. However, whatever the reasons might be, the radiocarbondated area seems to be quite contaminated with later added substances. It’s the combination of contamination and heat (1532 fire) that concerns me the most. And the only studie I have come across which take both into account is the Moroni – van Haelst paper mentioned above. Sadly they do not seem to have taken the cleaning procedure beyond the standard acid base acid technique to include the more sophisticated cleaning procedures mentioned in Hugh’s two interesting links..","date":"2014-04-26","mins":"9:16 am","url":"https://shroudstory.com/2014/04/10/ray-schneider-why-is-the-carbon-dating-wrong-i-dont-know-that-it-is-wrong-i-am-quite-certain/","cat":"carbon_14_dating","title":"Ray Schneider: Why is the carbon dating wrong? I don’t know. That it is wrong I am quite certain . . ."}]
