[{"id":"comment-12679","author":"menedemus","post":"The crucial point, in support of David Mo’s clear summary of the issues, is that it had been normal practice since the sixth century at least , to bury a body with its hands crossed over the genitalia. This was true for both men and women. So if you are Benedictine monk in an enclosed order making an illustration of the burial of Christ, you would simply copy the method of burial you have seen around you. (There are lots of examples from cemeteries so we are absolutely secure on this.) You did NOT need to copy it from the Turin shroud because you would have seen actual examples of bodies being wrapped up just like this.They are giving Jesus a typical Christian burial, using examples, of course, from the gospels for the figures who are doing the anointing. And we must get away from the idea, that seems to be accepted without anybody thinking about it, that the Turin Shroud would have been thought to be something special. Goodness knows in Constantinople, you have far ,far better relics around a big fragment of the Cross was the top Constantinople relic, taken out and about in the streets in a grand procession every year, and second to that was the holy icon of the Virgin Mary painted by Luke which,when taken out on the walls, had saved the city from being captured. Then there is the robe of the Virgin Mary that one of the emperors would put on to give him protection when he went out of the city to negotiate with Byzantium’s enemies.Then there is the Mandylion which is of the living face of Christ so it cannot be the same as a large piece of cloth with the figure of a dead naked Christ (sorry, Mr. Wilson). There are lots of documents about these and all we have is ONE mention by Robert de Clari of an image on a cloth in the Blachernae Chapel which might or might not be the Turin Shroud. If someone decided to paint a relic from Constantinople ,it would be very strange for them to choose the shroud when there were so many more more famous ones to choose from. They say that there were 3,600 separate relics in Constantinople and the Turin Shroud would be nowhere near the top! If it had been we would have had MORE documents about it and they surely would have said that it was a double image, not just an image..","date":"2012-06-18","mins":"1:48 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12671","author":"menedemus","post":"Thomas de Wesselow was once a reputable art historian. His credibility has been shattered by the ‘The Sign’ as you will see a) by the range of reviews it has got b) by the embarrassed silence on the part of the art history establishment since it came out. In his pages on the Pray Codex he does little more than repeat some speculative ideas by others he nowhere adds any significant reason for seeing the Shroud in the Codex. It is sad that Professor Lombatti’s detailed analysis of all these issues and his full rebuttal, point by point of Ian Wilson’s history,has not yet been translated into English. But Lombatti is already being condemned by all and sundry on the basis of a newspaper report of an article he is due to publish in one of the most prestigious medieval journals around. But, hey, what does a Professorship in these issues count for if you are from Italy probably as a sophisticated a place to study medieval history as anywhere if there are all these US/UK experts who already know the truth about relic cults, Byzantine art, medieval depictions of the entombment, medieval Greek and Latin, etc. Etc, areas which normally take years of full time study to master, certainly if you are going to be awarded a professorship..","date":"2012-06-18","mins":"9:32 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12664","author":"menedemus","post":"Until you can show a large shroud with a double image on it on the Pray Codex ,you are not going to persuade anyone outside the Shroud community that this is a representation of the Shroud of Turin. Readers of this blog may be convinced that they can ‘see’ it , but don’t expect to convince anyone else especially as no one defending the Codex on this blog has shown that they have any expertise in the history of art and there are lots of questions as to why a relatively obscure ( compared to the other more prestigious relics held in Constantinople) relic should be illustrated by anyone in the first place. Burial shrouds were never first rank relics at any point in the Middle Ages and no one here has come up with an original academic article making the case for the Codex showing the Shroud. It is the same with Professor Lombatti’s article it is a pity that it was released through a newspaper because comments on it should be avoided on it until the original, which will be published in a prestigious academic journal, is available and one hopes then that it is subject to any criticism it deserves from people who have the same academic credibility and experience as Professor Lombatti. One can study the Shroud for years on end but if one does not have a basic background in medieval art or history, then you are hardly likely to say anything of importance. There is still no clear DOCUMENTARY evidence that an academic historian would accept for the existence of the Shroud before 1350. I leave ti to the scientists to argue if there is any SCIENTIFIC evidence in the Shroud existing earlier that the medieval period.","date":"2012-06-18","mins":"4:40 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12694","author":"menedemus","post":"Hear, hear, David. I cannot understand how Wilson has got away with his bizarre idea that Byzantine art began in the middle of the sixth century for so long. (Of course, most people know that and just don’t take him seriously as a historian or art historian , but it still goes on being repeated. ) Does anyone seriously think that they found the Turin Shroud , were so excited by whatever they could see on it, that they started a whole new genre of painting., with the dead face of the Shroud being transformed into the living face of the Byzantine icons of Christ. David is making the point, that perhaps no one dares to say, that the Turin Shroud is more likely to be a copy of a Byzantine icon than the other way round.There is no no known case in art history so far as I know where a relic has started off a new school of art!! I think Hans Belting( and he really is an expert) argues that the Shroud is actually a medieval copy of an older Byzantine image which explains why it has so many Byzantine characteristics. I want to keep an open mind on the Shroud after all so long as Christ was a historical person who was crucified ( and i strongly believe he was), he would have been buried in a Shroud. I am just against making up stories that , like the Byzantine art began in the mid sixth century one, that are plain nonsense and can easily be refuted. People can believe what they like, it is when such stories get out on websites and repeated in such a way that readers think that they are accepted by mainstream historians that they need to be refuted. David has done good work here in keeping everyone’s feet on the ground!.","date":"2012-06-19","mins":"5:13 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12699","author":"menedemus","post":"Of course, I agree with you about Wilson and I am sure that gradually people are realising that his views are accepted by no one other than himself. But it will take time because he has sold so many copies and not enough people have read the arguments against his views. BUT Yannick, you can find earlier artworks, starting from the 4th century in any history of Byzantine art which show how the idea of a fully frontal figure,first the emperors (many scholars place the fully frontal image of Constantine on the Arch of Constantine in Rome (AD 315) as the first), then Christ in the same pose evolved. You can also look at the coffin lids of Egypt where the living faces of the deceased are placed on the wood of the lid (and these go back even earlier) and again scholars see these as the inspiration for the faces on icons. These are real images in wood or marble and they can be easily copied and you can trace a tradition in art directly from them. The Turin Shroud, on the other hand shows a man who is dead and has marks of suffering so this does not look like a model which has been copied. What date do you think the copying began? I repeat ‘There is no no known case in art history so far as I know where a relic has started off a new school of art!!’ I think you must make your case a lot stronger before it becomes believable..","date":"2012-06-19","mins":"9:05 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12712","author":"menedemus","post":"Well, Yannick, I remain to be convinced but I admire the depth with which you do your research. I think the mechanism by which the transmission from cloth to icon would have taken place would be quite difficult to establish. Of course, everyone working in this period has such a lack of sources!.","date":"2012-06-19","mins":"11:47 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12787","author":"menedemus","post":"I’ve missed something. Can someone please give me the comment number here that explains how you know that the red zig zag lines , which I assumed were part of the decoration on the tomb lid in the space between the separate sudarium and the Shroud held by the angel, actually show blood. Have you also the latest on whether the blood on the Shroud is AB ( this used to be argued but I haven’t seen it recently) and is there anyone who can follow that by making comments as to whether, if the blood on the Shroud is authentic, how the blood relates genetically to the blood of Jesus’ ‘parents’?.","date":"2012-06-20","mins":"11:11 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12796","author":"menedemus","post":"Thank you both for the information. It is a pity that the art work on the Codex is often so indistinct that it is hard to be certain what its inspiration was. Cautious as I am by nature, I am,= not convinced that the Shroud is there, partly because I do not understand why anyone would want to copy it without making it very clear, from the size of the cloth and the double image, what they were wanting to show their audience.I have seen no good reason why this has to be a secret or symbolic picture of the Shroud..","date":"2012-06-20","mins":"1:54 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12838","author":"menedemus","post":"Art Science. Thanks for this information and your thoughtful analysis. Please may I say that when there are so many strange postings on this subject and quite a lot of name calling, that it is good to find someone who is trying to actually work through the issues! The question remains, and has been raised by others during these discussions – is why the Shroud has to be concealed in this way. If, and there is not enough evidence to be sure of this ( I am being cautious again) , Robert de Clari is describing the Turin Shroud in the Chapel at Blachernae in 1203, it shows that there were no inhibitions about unrolling it so that the full image could be seen. This was the common practice of course, people wanted to see the relic fully exposed. We do have an illustration of the Crown of Thorns in Paris being shown to the crowds from a tower. So why not show the Shroud more clearly? On Stephen Jones’ blog, there was some statement about the authorities in Constantinople not authorising the Shroud to be shown in full but no Catholic ( and it is assumed that the illustrator of the Pray Codex was a Benedictine monk) would have taken any notice of any such decree from the schismatic Greek Orthodox Church. Look at what happened just a few years later in 1204 the Crusaders just grabbed what relics they could from the Greeks and took them back to Europe. Many said that it was God’s will that they should do so! Yes, mysteries are fun – so long as one keeps one’s feet on the ground it is a pity that the surviving sources are so few. Do not worry about Max Patrick Heron We have been trying to get him to explain himself more clearly at present he is adding nothing to any argument but seems to live in some kind of cryptical world of one liners followed by typo corrections. There is nothing here that can persuade anyone of anything and perhaps if we keep on making the point he will even realise this himself. N.B. Menedemus is a character in one of Erasmus’ work on relics who was a loyal Catholic but sceptical of the relic cults he saw around him in the 1520s. Not to be confused with an obscure Greek philosopher of the same name!.","date":"2012-06-21","mins":"4:11 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12862","author":"menedemus","post":"We will have to wait to see what Lombatti is actually arguing in his article when it comes out but I wonder whether (perhaps a mistranslation from the Italian), the word ‘copy’ is the right one to use. It may be that there were a large number ( forty perhaps) of cloths claiming to be the original burial shroud. This is ,of course,typical of medieval relic cults in general and not a large number when you remember how many pieces of the Cross, thorns from the Crown of Thorns, the six or seven heads of John the Baptist,etc.were around. Europe , especially if you include the Byzantine empire, was a large place, communications were very poor and individual communities would develop their own cults ,often unaware that three or four hundred miles away, another shrine would be claiming to have exactly the same relic as they had. Even if you knew of your rivals ,you would still develop a legend to show why yours was the real one! So are we really talking about COPIES here or simply alternative versions of shrouds each claiming to be the authentic one. I don’t know the original source for ‘the forty’ but i am certainly not surprised to hear of forty different places each claiming to have the original shroud. It fits well with what we know of medieval relic cults in general..","date":"2012-06-21","mins":"10:11 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12885","author":"menedemus","post":"Thanks, Art Science and David Mo. Yes, this is a basic issue that you have pinpointed, David. We have lots of different versions of the same relics ( not just shrouds,of course), but we simply do not have clear enough descriptions to be able to trace the fate of each and, in the case of the many shrouds.etc which of them might or might not relate to what we now know as the Turin Shroud. Recognising this is an important step forward because all too often even the most obscure reference to an image on a piece of cloth is assumed by enthusiasts to be a reference to the Turin Shroud. This is not good history. I share David’s scepticism over the Pray Codex. While the writer of the latest posting on this blog (just posted, 22nd June)) is convinced by the evidence, i am of the the school that you really do need a lot more evidence before making the kind of assertion. As the key feature of the Turin Shroud is the double image, I start from the assumption that unless this is clearly shown in an illustration or directly referred to then I am not buying. As seems to have been established in other discussions here , the idea only came from Ian Wilson and no one was ever able to produce a peer reviewed research paper by an art historian which has backed the idea. (Not too late, if anyone knows of one! de Wesselow adds nothing of importance in The Sign) What has been surprising is the number of enthusiastic supporters of the ‘Pray Codex shows the Shroud school’ who do not seem to have even the most elementary knowledge of medieval art. David and others have done a great job in opening up the subject and showing that you really do need to know quite a lot about illustrations of this period before you start making the kind of dogmatic statements some people here and on a neighbouring blog have been making.I am on the fringes of this world but know of academics who have spent years of their lives studying these issues yet here we find all kinds of pseudo experts telling exactly what we SHOULD be seeing in what is a rather low quallity illustration of a well known gospel scene, made by a Catholic Benedictine monk of a possible relic held by schismatic Greek orthodox Christians. Just too far fetched to stick with me. There are two points I will conclude with. Not necessarily relevant but may be taken up. 1) Whether the Turin Shroud is 650 or 2000 years old, it is an important artefact, a rare piece of cloth and a rare piece of art because of the difficulties in defining how it might have been made. If it had been a work of art of say 1300 ,the age of Giotto, imagine how it would have been treated for further examination/ conservation. There would have been a long period of examination in controlled conditions before anyone even thought of doing any work on the surface. I don’t need to repeat the sorry story of how the Turin Shroud has been treated virtually every basic procedure for dealing with an item of this age and vulnerability has been ignored. I am sure people thought they were doing the right thing but far too many people who had absolutely no training in the most basic of conservation techniques were let loose on the Shroud, and even allowed to take off substances from it. The chances of every really finding out how it has been made are certainly diminished as a result. The substances detached from the Shroud are floating around the world, it is not even clear who controls them (at the very least they should all be returned to one conservation laboratory, probably in Italy so that a team of textile experts can work on them in one place). I have even read of one enthusiast who has managed to get hold of part of the Shroud which he treats as a relic. It is a shocking story of how not to treat medieval ( or earlier) art. 2) The Protestant reformers had a point ( although I deplore the way they destroyed relics). All too often a relic became more important than Christ and the scriptures. Some pro Shroud supporters come across as more attached to the piece of cloth than to the man who may, or may not, have been laid in it. Not healthy, and probably idolatry ( see Ten Commandments) rather than Christianity..","date":"2012-06-22","mins":"6:30 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12897","author":"menedemus","post":"Davor. I notice that on your link Andrea Lombatti has given the reference to his own article on this issue. It is much more comprehensive than Averil Cameron (who, as one of the finest Byzantine scholars in the world, has better things to be spending her time on) and deals with all the points, refuting Ian Wilson and his supporters in particular. I think you overestimate the amount of support Wilson has – do any of these ‘scholars’ hold an academic position in Byzantine/medieval history or literature? I think you will find not. Lombatti’s article needs to be in English. I hope it will be translated soon. Anyone relying on the 944 sermon by Gregarius ( a typical welcoming of a relic to a new home sermon) needs to quote from the early part of the sermon where Gregarius makes it clear that not only is he looking at a cloth with just a face on it (of Christ, of course) but that this cloth was given by Jesus, after he had wiped his face with it ,in the garden of Gethsemene to the apostle Thomas who then handed it to Thaddeus who then, of course, keeps it and brings it to Edessa. So, as far as Gregarious is concerned, the cloth by passed the tomb altogether. This is the clinching point. The sweat of Jesus is thick ‘like blood’ – i.e. It is not actually blood and the point Gregarius is making about the wound in the side, although rather theologically obscure is that the water of the sweat is similar to the prestigious water that flowed, on a later occasion at the Crucifixion, from Jesus’ side alongside blood. It is for that reason that the Image is to be honoured. In fact, the first part of Gregarius’ sermon is one of the best pieces of evidence we have that the Image of Edessa/Mandylion that Gregarius was welcoming to Constantinople was not a burial shroud. Here is the relevant passage. Gregarius is telling his congregation the story of the Image of Edessa by narrating the events by which it came to Edessa. Thaddeus has arrived with the Image in Edessa and the story goes on: ‘And Thaddaios answered [to king Abgar], “When Ananias [ the messenger of Abgar], who you entrusted the letters to, said in hope that apart from your health, you also wished to look upon the likeness of his [Christ’s] face as it was seen, Jesus told him to come quickly to you with the letter, in which he promised to send you one of his disciples after his ascension, and I [Thaddeus] am that disciple. But Jesus, undergoing the passion of his own free will, believing that human nature fears death – indeed death comes upon the very nature that was made to live – taking this linen cloth [i.e. The Image of Edessa that Thaddeus is holding] he wiped the sweat that was falling down his face like drops of blood [note ‘like drops of blood’, not actual blood!] in his agony. And miraculously, just as he made everything from nothing in his divine strength, he imprinted the reflection of his form on the linen. When he came down the mountain after praying, he gave it [ the cloth] to Thomas, one of my fellow disciples, as I was not there. He [Christ] told him to give it to me [Thaddeus], so that after the ascension I could bring it to you.’ And anyone who still thinks that Gregarius is talking about a burial shroud needs some serious help. There is, of course, as you will find when you read Lombatti’s article, a mass of other evidence making it clear that the Image of Edessa is not a burial shroud. There is also an article by Charles Freeman found online ‘Charles Freeman Shroud of Turin’ that shows how tetradiplon refers to the method by which the Image of Edessa was folded for storage in such a way that the face of Christ was not folded..","date":"2012-06-22","mins":"9:15 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12533","author":"menedemus","post":"Are you saying that the Santa Pudenziana Mosaic is showing the Turin Shroud? So where was the Turin Shroud in 400 AD ? In Rome? Please explain what your argument is for those who don’t live in the cryptic world of yours but just look at art works as they are..","date":"2012-06-15","mins":"1:15 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"}]
