[{"id":"comment-12988","author":"menedemus","post":"And see the article by Charles Freeman ‘The Shroud of Turin and the Image of Edessa, :A Misguided Journey’ which also deals with some of these issues.e.g the tetradiplon idea and the strange story of Arculf in Jerusalem easy to pick up online..","date":"2012-06-24","mins":"5:46 am","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"id":"comment-12997","author":"menedemus","post":"Domenico well, you need to read the article to get his full argument it is not hard to find. Freeman suggests that the only way to fold the Image of Edessa without concealing or folding over the face of Christ is to have each of the four sides of the Edessa image folded back under itself to make a smaller cloth for storing which would leave the face intact at the centre, in other words ‘four double foldings’. He says that a cloth of 4 by 4 would be reduced to one of 2 by 2 with the face still exposed at the centre. So the Image of Edessa could be stored in a box and then viewed when the box was opened without having to unpack it. So you wouldn’t need Wilson’s elaborate theory about folding up the Turin Shroud. I haven’t seen anyone comment on Freeman’s argument so far but as Davor clearly has done a lot of work on tetradiplon his comments would be especially valuable, here or on his blog. It may be that when you get back to the original documents where the word tetradiplon is used,that they don’t support Freeman’s argument but,on the surface, it seems to have more going for it than Wilson’s..","date":"2012-06-25","mins":"3:40 am","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"id":"comment-12971","author":"menedemus","post":"Well done, Davor, for cutting through the fantasy world that has pervaded this part of Shroud studies for too long. It is astonishing what some people have read into non existent documents and in some cases, statements have been made that border on the fraudulent in that a careful reading of the documents show the OPPOSITE of what is claimed. (There are too many cases where whole part of documents that contradict a case have simply been ignored, so one wonders whether there is deliberate deception in some cases. No names!) Gregarius’ 944 sermon, for instance, makes it quite clear, in the opening parts, that the image of Edessa which he was welcoming to Constantinople, was, according to the legend that Gregarius believed, given by Christ to the apostle Thomas while he (Christ) was still alive and then passed on from Thomas to Thaddeus (and then to Abgar). Gregarius makes it absolutely clear that the Image by passed the tomb altogether and yet that sermon is often quoted as it if referred to a burial shroud aka the Turin Shroud. Keep up the scholarship! Jesus Christ existed, he was undoubtedly crucified and buried. So once a burial shroud existed. Did it survive is the question. I have said elsewhere in these posts that some Shroud enthusiasts seem to venerate the Turin Shroud more than the man who may or may not have been wrapped in it..","date":"2012-06-23","mins":"12:05 pm","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"id":"comment-13054","author":"menedemus","post":"Max, Can you please be constructive for once! You pile on these endless comments but as no one knows what your own take on the Shroud they are completely meaningless to all of us. You are quite clearly the world’s greatest expert on a number of arcane subjects but this matters nothing if you cannot communicate clearly. Calm down, clear some space, give a full version of what your own version of the Shroud’s history is. Cut out the abuse of everyone who has not yet reached your level of expertise it adds nothing to what is potentially an important discussion of Wilson’s work. I am sure your definitive version can be posted up somewhere for those interested enough to read it. Thanks..","date":"2012-06-26","mins":"8:06 am","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"id":"comment-13071","author":"menedemus","post":"Max says “I am definitely not trying to write a research paper. Here. Just passing/bombarding comments in snatches while working….” And, as a result, wasting everyone’s time. Is there any way of making it clear to you that no one knows what you are talking about for most of the time and so your comments have no value whatsoever. Please think for yourself: “What am I hoping to achieve by entering all these comments’. Somewhere, there does need to be a proper debate on Wilson’s history and Davor’s articles , to which the links are provided , are a good place to start..","date":"2012-06-27","mins":"3:54 am","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"id":"comment-12989","author":"menedemus","post":"Davor, Thank you for your response. I suspect that we are not that far apart and you deal with the motivations of those arguing for the authenticity of the Shroud very well. As you say, most contributors have no background in the enormously complex world of Byzantine texts, where legend and history mingle and there are immense linguistic problems as well. I m not a scholar here but have immense respect for the scholarship there is. I wonder sometimes if some of the contributors to Shroud blogs know ANYTHING about the years of patient study of Byzantine art and language the experts have undertaken. Yet some Shroud enthusiasts are prepared to make the most authoritative statements about the meaning of difficult texts e.g. The Twin Pearls or the iconography of the Pray Codex. The debates here often gave the impression that the Pray Codex was the only entombment scene some convinced commentators had ever seen! ‘Deceitful ‘ may be too strong but I think that if a contributor quotes from a document in support of their case for the authenticity of the Shroud or whatever when the full document they quote from actually says something very different, this kind of selective quoting does border on the deceitful. But I will name no names. And remember, and here I am NOT talking specifically about Shroud studies, some pseudo historians have made a lot of money by jumping on bandwagons in the knowledge that their readers won’t check out the original documents. Try the world of the Pyramidiots! I wonder if you recognise my pseudonym from Erasmus’s A Pilgrimage for Religion’s Sake. In this dialogue, Menedemus appears as a Catholic sceptic about the relic cults of his day but quite a gentle one I like to think..","date":"2012-06-24","mins":"6:07 am","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"id":"comment-13259","author":"menedemus","post":"We have no clear way of knowing whether the Blachernae Shroud mentioned by Robert de Clari in 1203/4 is the Shroud of Turin. It is a single reference and not precise enough to make the connection for sure (e.g. One would expect some reference to the double image). The fact that there is no other mention of this shroud by sources within Constantinople itself ( a city which provided quite a lot of lists of relics) suggests it was not considered among the more prestigious relics of the city. However, we know the Blachernae relic collection was first built up in the fifth century and we know that under the auspices of the imperial family, many relics came direct to the chapel from Jerusalem which was still directly under Byzantine control. The link between the two cities was considered very important after the empress Helena transferred two nails from the Cross to Constantine himself as the time of the city’s foundation in 330. So ,and this is pure speculation, the Blachernae Shroud may have come direct from Jerusalem in the fifth century and remained in the Blachernae Chapel ever since then. It was just not considered important enough alongside the very prestigious relics Constantinople had, for it to be mentioned in a relics list before an outsider, de Clari, saw it. I just put forward the idea as one which as likely as others suggested here and certainly much more likely than the highly convoluted theories of Ian Wilson! There s no question that that this could be the Mandylion moved without any documentary evidence to the Blachernae Chapel between 1201 and 1203. These translationes were major public events and it would have been recorded after all the Mandylion, unlike the Blachernae Shroud, was a top class relic..","date":"2012-07-01","mins":"5:08 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"id":"comment-13190","author":"menedemus","post":"Mario. ‘Can easily [sic!!] be answered’. Well, there are seven questions here in the first para and only documentary evidence for one the transfer of the Image of Edessa. The rest are highly dubious speculations and most seem to be very unlikely. Wilson’s argument is a very precarious pile of cards,only one of which needs to be removed for the whole lot of fall down. This is not history as it should be done. Mario : ‘It is likely that many confused the Shroud and the copies of it shown as the “Mandylion”.’ I am not surprised!!.","date":"2012-06-29","mins":"3:03 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"id":"comment-13284","author":"menedemus","post":"The nature of the replies to Davor makes his own point for him. The fact that some amazing space and nuclear programme scientists worked on the Shroud means absolutely nothing because ancient textiles was not a field in which they were trained to work. I am happy to be corrected by Davor but having worked on the sidelines of similar issues it seems to me that if you want to carry out a research programme on an ancient textile or a fourteenth century painting or whatever. 1) You have to have proper laboratory conditions set up for an examination so that the artefact can be moved there and there can be no further deterioration or contamination from other substances. 2) You have a full examination of the object before you do anything, especially if you want to remove pigment or other substances. 3) You assemble a team of experts covering a variety of disciplines it is important someone is in charge who can judge on the quality of each member of the team and make sure that the problems you have identified on your preliminary examination can be dealt with. 4) You don’t expect to work under pressure of time. 5) Samples are removed with extreme care and only when essential and are only allowed to leave the laboratory if another specialist laboratory has equipment that you don’t have. 6) Intervention is minimal of course, a great problem with the conservation of pictures. One day the story will be told of how it was possible for a self selected group of nuclear physicists to get access to the Shroud in 1978, not to have had any preliminary physical examination of it before they began research on it, were able to examine it in a draughty hall with nuns on hand to cut off the backing cloth, to improvise the examination within a very short time span of 120 hours, to remove samples and take them out of the system, to have a completely disorganised method of distributing the samples around once they had been taken back to the States ( Who actually owned and was responsible for these possible substances from the body of Christ?). It also seems that there was a preconceived idea of what would be found.When the samples were sent off to Walter Mc Crone’s laboratory, Ian Wilson in his latest, 2010, edition of the Shroud , notes on p.92, how the apparently brilliant Mc Clone (who had worked on Yale’s Vinland Map) was selected for the analysis of the samples and goes on ‘The expectation ( not least on my part) was therefore that by some equally brilliant feat he might be able to show the Shroud to be authentic’. Further comment unnecessary! Of course, as is well known, Mc Crone came up with a mid fourteenth century date to the horror of the team. Then Wilson tells, us, p.92 , ‘With the benefit of hindsight, the STURP [this was the self selected US work team on the Shroud]were probably far too undemanding in their sample requirements. Their ‘light touch’ sticky tapes did little more than kiss the Shroud’s surface’. Well, that is one relief who knows what irreversible damage might have been done with ‘real’ sticky tape?. So far as one can see there are still samples from this 1978 raiding expedition around and they can still be handed around but only it seems, after the Mc Crone episode to people who will back the Shroud is authentic point of view. Needless to say the samples are pretty worthless from the scientific point of view by now and there does not seem to be a single hint from any of the samples that we have a first century artefact. Davor has explained the immense difficulties in linking a historical narrative which takes the Shroud back to the first century. As he says, surely correctly, it is not impossible that the Shroud is authentic, simply that Wilson et. Al. Have not yet come up with any usable evidence to suggest that it might be. It would have been better simply to have a traditional ‘Veneration of the Shroud’ guild and have kept the science out of it altogether. It is pretty worthless and the latest idea to offer a £15,000 prize for explaining how the Shroud ‘s image was made makes no sense unless the Shroud is allowed to be properly examined under laboratory conditions and the samples taken from it that are still floating around returned to the examining laboratory. Perhaps the £15,000 can be diverted towards paying for this! The answer may well come back that in the present state of knowledge we don’t know how the image was made but with further scientific advance it might well be in the future. In the meantime ,don’t fret. Keep to your traditional faith in Christ as a human/divine being and stop worrying so much about any physical objects that might have survived from his lifetime..","date":"2012-07-01","mins":"12:33 pm","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"id":"comment-13202","author":"menedemus","post":"Surely the important point is that any serious study of the texts describing or failing to describe the variety of cloths with or without images, purporting to be the living face of Christ or not, can only be done by someone with a in depth knowledge of the Greek original texts. What surprises me about Wilson is that although he has been apparently working in the field since 1978, e.g. 34 years, there is not a hint in any of his works that he has bothered to learn Greek in all this time. I may be wrong but if he does know Byzantine Greek he conceals his learning carefully. As the Byzantine scholars who have bothered to work on the Shroud texts have also shown there are also spectacular misinterpretations or distortions of the original texts by members of the Shroud community.The response seems to be to rubbish the academics, partly ,of course, because few from the Shroud community have the academic skills to challenge them. So sadly the debates which might be productive end in angry stalemate ..","date":"2012-06-30","mins":"5:32 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."},{"id":"comment-13258","author":"menedemus","post":"Dave B. The single description we have from Robert of Clari of the Shroud on the Blachernae Chapel is not precise or accurate enough to day that it is the Turin Shroud, rather than one of the many other burial cloths of the period. (There was even another in Constantinople itself the cloths in the Pharos Chapel!) The most we can say is that ‘ there is a possibility that this was the Shroud but we would need to know more’ a reference to a double image would be a help, of course. The real problem is that we have no references to this Shroud from Constantinople sources itself when we do have a lot of documentation about many other prestigious relics of the city. The implication is that this was not considered by the hierarchy of Constantinople itself a very important relic. IT could possibly be that that it is the Shroud of Turin but was simply not given much importance. The elevation of the Shroud of Turin as a major relic is a twentieth/ twenty first century phenomenon,of course. Burial shrouds ranked pretty low down in the hierarchy of relics of the Passion in the medieval period..","date":"2012-07-01","mins":"4:40 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."},{"id":"comment-13285","author":"menedemus","post":"Ron: ‘The balance of evidence from all reputable studies points this Shroud in the early period of the first mellenium, not Medieval.’ I,for one ,would love to know where to find this evidence, please give me some clues. ‘ The early period of the first mellenium [sic] ‘doesn’t get us very far, of course, because the only date that counts is AD 30 give or take a year or two ..","date":"2012-07-01","mins":"12:41 pm","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."},{"id":"comment-13308","author":"menedemus","post":"The problem remains that you have to get it to AD 30 give or take a year or two in an age when crucifixion was all too common. Those less convinced about the authenticity can propose any other date since then. No one seems to talk much about the problems of conservation.Is this because very few people working on these blogs know anything about ancient textiles? (This was one of the major criticisms of the STURP team and why the Shroud should only have been ever examined in a conservation laboratory.) If you do talk to someone who works with textiles that is pretty well the first thing they raise because once a cloth gets damp or subject to molestation by insects ,etc. It is gone. The Shroud of Turin would be absolutely unique as a survival – it would have beaten all the odds many times over. You don’t get surviving pieces of cloth this size ( outside the very special case of Egypt) until the Fatimid workshops/looms of the tenth /eleventh centuries. Any discussion of where the Shroud might have been and when must tackle this as a major issue a couple of years in the wrong place and the damage is done.For textile experts, especially those who work in museums, it would be the strongest piece of evidence against the authenticity of the Shroud the chances of being kept intact over so many centuries are virtually minimal. Don’t ignore the problem..","date":"2012-07-02","mins":"7:22 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."},{"id":"comment-13256","author":"menedemus","post":"Ron. ‘Wilson on the other hand, doesn’t need to understand Byzantine Greek as he uses Byzantine scholars to do this work, …’ Well ,so long as no one takes him seriously as an original scholar and he does not distort or misrepresent what the scholars actually say that is fine. But I have yet to hear of any Byzantine scholar who endorses his view that the Shroud of Turin is the same as the Image of Edessa. The problem is that be seems to go far beyond the cautious findings of Byzantine scholarship and develops theories largely on his own initiative. Ron : “One does not have to be an historian or a scholar to understand simple things like why the Shroud of Christ ‘IMAGE’ was not mentioned in scriptures or by early church fathers, atleast not openly mentioned.” I beg to differ, Ron. These seem to be to be very complex scholarly issues the world of early images, as no doubt you will know from your close reading of the work of Hans Belting is a very difficult area. I don’t think the ‘anti Shroud community’ as you persist in calling them, insist that the Carbon14 dating is carved in stone. Most of them are independent scholars and have the natural caution of scholars. A typical position might be be that a medieval dating (perhaps some decades earlier than 1250 if there was genuine contamination that affected the date) is the most likely possibility but needs further work on it. As I understand Christopher Ramsey from Oxford ,et, al, it is that there is enough debate to justify a re resting but Ramsey still, as I understand it, thinks a medieval date will be the result again. The issue rather is that no one has come up with any evidence that a renewed Carbon 14 dating is likely to come up with a first century dating.Until they do, a preferred date somewhere in the Middle Ages is likely to have most of the scholarly consensus, not because these scholars are rabid atheists but because they are scholars working on the balance of probabilities from the evidence they have..","date":"2012-07-01","mins":"4:25 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."},{"id":"comment-13339","author":"menedemus","post":"Ron, well I just did a very brief search on the exposure of linen and cotton in one scientific report and the summary ran as follows: ‘Flax and cotton, for example, are very susceptible to attack by bacteria under humid conditions and seldom survive in archaeological environments. All textiles are deteriorated by light, insects, microorganisms, and air pollution which, alone or together, cause considerable loss of tensile strength and pliability. The oxygen in the atmosphere affects all organic substances to varying degrees. Prolonged exposure to normal atmospheric conditions will cause textiles to weaken and disintegrate. The speed of the deterioration varies according to environment and the nature of the fibres’ I think we would have more examples of ancient linen , outside the very special conditions of Egypt, if it was quite as enduring as you suggest. The Shroud if authentic would be a real rarity, certainly no similar example is known from the thousand tombs excavated in and around Jerusalem from this date..","date":"2012-07-02","mins":"4:54 pm","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."},{"id":"comment-13370","author":"menedemus","post":"Ron: ‘So I find that report [see the statement from the Laboratory in no.22 above] suspiciously ignorant of known facts.’ Probably easier, Ron, for you to take up the issue direct with them they have more experience in these matters than I have. And please don’t argue that because they primarily deal with shipwrecks they are not qualified to comment on flax/linen. It won’t wash. If the Shroud of Turin is authentic, it is the only surviving linen cloth of that size and date from outside very specifically arid conditions such as Egypt or Peru and it is of a weave of which no other first century examples are known. Here are the details of the Laboratory that made the report: ‘The Conservation Research Laboratory (CRL), directed by Dr. Donny L. Hamilton, is one of the oldest continuously operated conservation laboratories that deals primarily with archaeological material from shipwrecks and other underwater sites. Operating under the Center for Maritime Archaeology and Conservation, CRL plays an important role in the Nautical Archaeology Program at Texas A&M University (TAMU), and works closely with all of the excavation projects of the TAMU affiliated Institute of Nautical Archaeology. In fact, students are a big part of the work done at CRL. It is a great place to gain practical experience in conservation science. CRL deals with archaeological projects year round and consists of two laboratories: one is used primarily to teach conservation classes to students at TAMU; it is also equipped to conduct conservation of small inorganic and organic artifacts. The second laboratory has recently been enlarged to accommodate bigger projects. In 1995, we established the Archaeological Preservation Research Laboratory, which is devoted to developing new conservation technologies. All kinds of artifacts are treated at CRL, from those made of iron, copper, brass, or pewter to those of wood, leather, glass, or ceramic.’.","date":"2012-07-03","mins":"5:54 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."},{"id":"comment-13382","author":"menedemus","post":"Relics woven of linen in the Middle Ages have been reasonably well preserved because they were treated with respect within churches,etc. Before then they are very rare, usually only in fragments that have got caught in very specific dry places (or occasionally waterlogged). It is up to you to provide examples from before 1000 AD if survival is so good give me the link please to any one museum, such as the V and A, which has a linen collection from before 1000 AD (other than Egypt, Peru,where the dry preserved it).Even better if you can provide anything the size of the Turin Shroud the nearest equivalents are the Fatimid workshop textiles of the eleventh century which are similar in size to the Turin Shroud and even then we only have two good examples. I try not to let these discussions become personal but I have worked in similar areas myself for many years and do not need to be treated as if i was some sort of ignoramus. I assume from the way that you speak with such assurance that you are a specialist in these areas but I won’t be convinced until you can actually provide some evidence of your expertise..","date":"2012-07-03","mins":"7:40 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."}]
