[{"id":"comment-170489","author":"andy","post":"Thanks for your reply OK. I agree the writeup leaves much to be desired – it is not nearly specific enough in some cases. For example, I would like if he would have specified what disciples one ought to be “reasonably capable” in in order to duplicate and support or deny the assertions made by Dr. Soons. I assume I do not have the expertise to be able to duplicate his experiments. I wonder if some figure they are “reasonably capable” and aren’t and others figure they are not so and maybe are..","date":"2014-11-10","mins":"7:23 pm","url":"https://shroudstory.com/2014/11/08/a-detailed-response-to-the-halo-study/","cat":"history","title":"A Detailed Response to The Halo Study"},{"id":"comment-170687","author":"andy","post":"Wasn’t the Enrie photo pushed contrast? This in and of itself would mean the image data was already altered. I wonder how many iterations the photo you were using went through. The more it goes through, the less you are testing the image and more you are testing distortions of the image..","date":"2014-11-11","mins":"8:25 pm","url":"https://shroudstory.com/2014/11/08/a-detailed-response-to-the-halo-study/","cat":"history","title":"A Detailed Response to The Halo Study"},{"id":"comment-170634","author":"andy","post":"OK, what image is this one “Gino Moretto’s Całun: Przewodnik, Wydawnictwo Salezjańskie 1998”? Pete used a scientific grade Schwortz transparency professionally back lighted..","date":"2014-11-11","mins":"1:10 pm","url":"https://shroudstory.com/2014/11/08/a-detailed-response-to-the-halo-study/","cat":"history","title":"A Detailed Response to The Halo Study"},{"id":"comment-170689","author":"andy","post":"It wasn’t claimed as a “halo”, but “circular shading”, Louis. I had just used the word halo as a shorthand, but that didn’t work out well since it seemed to lend confusion to the research, so I changed it..","date":"2014-11-11","mins":"8:31 pm","url":"https://shroudstory.com/2014/11/08/a-detailed-response-to-the-halo-study/","cat":"history","title":"A Detailed Response to The Halo Study"},{"id":"comment-170688","author":"andy","post":"Paulette, if you look at the document, you will see this: “The primary image used was the 1978 full‐size color image on Kodak Duratrans film purchased from Barrie Schwortz in 2009.” This would be the color photo. If there are any hotspots, you would have to direct that question to Pete. We are presently preparing the new space to move the museum into so he might not be able to respond adequately for a while. You can contact him from our website (click my name)..","date":"2014-11-11","mins":"8:29 pm","url":"https://shroudstory.com/2014/11/08/a-detailed-response-to-the-halo-study/","cat":"history","title":"A Detailed Response to The Halo Study"},{"id":"comment-172324","author":"andy","post":"When OK does a complete study on multiple images, then he can come back and tell me what he thinks. Until that point, his 5 minutes are up..","date":"2014-11-21","mins":"12:54 am","url":"https://shroudstory.com/2014/11/08/a-detailed-response-to-the-halo-study/","cat":"history","title":"A Detailed Response to The Halo Study"},{"id":"comment-167066","author":"andy","post":"I think the scientific and other evidence makes it most unlikely the Shroud was made in any medieval age. I would never begrudge anyone to think what they want, but I don’t think the preponderance of the evidence supports an opinion of in authenticity..","date":"2014-10-31","mins":"12:33 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science"},{"id":"comment-170375","author":"andy","post":"I wonder what your qualifications are, O.K., are you an imaging expert or do you have any qualifications or training that lend weight to your own work? Pete Schumacher is an imaging expert and it is this expertise that is exercised in discussing Dr. Petrus Soons’ observations. From the document: “While it is true that not everyone has a VP‐8 Image Analyzer system available to them; and, while they may not have all the images available to them that I used in this study; I am convinced that this evidence is conclusive and can be readily duplicated by anyone reasonably capable in the disciplines applied while using a variety of easily accessible tools and even some readily accessible images.” This work has nothing to do with the halos as discussed here – the word is used to shorten “circular shading”. I need to change the wording on the website to keep others from coming to the same erroneous. It has to do with a shading around the facial image on the Shroud which would link the Shroud with the Mandylion. Concerning the historical implications of the results of this study, he writes this: “Thus, the Mandylion and the Shroud of Turin are on[e] and the same. Therefore, the Shroud of Turin existed at a time in accord with the known history of the Mandylion. I defer to the considered works of Ian Wilson and other accomplished historians as to the impact of the results of this study, as I am not a historian.”.","date":"2014-11-10","mins":"8:02 am","url":"https://shroudstory.com/2014/11/08/a-detailed-response-to-the-halo-study/","cat":"history","title":"A Detailed Response to The Halo Study"},{"id":"comment-144040","author":"andy","post":"The Edessa Constantinople route everyone knows cannot so easily be dismissed. But I say to Charles, research on and coordinate with the experts to explore his hunch..","date":"2014-08-15","mins":"8:41 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route"},{"id":"comment-144427","author":"andy","post":"This sounds very interesting. I’ll have to download and read the paper when I have a couple hours (ha! – been very busy)..","date":"2014-08-17","mins":"7:48 pm","url":"https://shroudstory.com/2014/08/15/jack-markwardts-antioch-theory/","cat":"history","title":"Jack Markwardt’s Antioch Theory"},{"id":"comment-77325","author":"andy","post":"When one says he could not tell and other equally or better qualified folks say there is evidence, we’d obviously go with the majority of experts in that field. For Annette, it’s not that difficult for the people burying him to break the rigor mortis..","date":"2014-02-07","mins":"4:20 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-185088","author":"andy","post":"Interesting..","date":"2015-01-21","mins":"8:10 am","url":"https://shroudstory.com/2015/01/20/the-shroud-on-ancestry-com/","cat":"history","title":"The Shroud on Ancestry.com"},{"id":"comment-190951","author":"andy","post":"There’s not really anything Catholic about Crossan’s opinion. It would be honest to have full disclosure..","date":"2015-02-13","mins":"1:58 pm","url":"https://shroudstory.com/2015/01/07/we-also-have-the-shroud-of-turin/","cat":"history","title":"We also have the Shroud of Turin"},{"id":"comment-181811","author":"andy","post":"“The earliest sources were eyewitnesses from which we get the greater part of the New Testament. But we can discount the eyewitnesses because they just embellished.” Did I understand this so called scholar correctly or did I miss something?.","date":"2015-01-07","mins":"7:48 am","url":"https://shroudstory.com/2015/01/07/we-also-have-the-shroud-of-turin/","cat":"history","title":"We also have the Shroud of Turin"}]
