[{"id":"comment-214014","author":"matthew_l","post":"I think Rob makes a good point which is one of the reasons that my gut feeling is a supernatural explanation. Given the forensic evidence that would seem to indicate this cloth is Jesus it is a stunning coincidence that the burial cloth of that man who has rumored to have been Resurrected also has an image that despite the best efforts of well, everyone, cannot be explained naturally. Its just a feeling I have that this is not a coincidence. Add to this the negative image, 3 D data, X ray like quality etc. And I do think a supernatural explanation is plausible though we should keep searching for a natural hypothesis. The teeth in the image behind closed lips is an example of the X ray like quality the image has. I really do think in this particular image the row of teeth are clear as day http://blog.world mysteries.com/wp content/uploads/2012/07/shroud sml1.jpg Also, why in 2015 are there still people who do not believe the Shroud held a real human body that leaked blood on the Shroud? As far as I can tell such people are not helping Shroud research one bit denying some of the most basic well established details about the Shroud. The blood is to red? There are a number of explanations, and just because there is one detail about the blood that we don’t understand completely doesn’t mean therefore blood isn’t on the Shroud, but its better and convenient for certain hypothesis to ignore all the other evidence for real blood I guess..","date":"2015-10-31","mins":"3:01 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-213945","author":"matthew_l","post":"I think it would be something that happened during the Resurrection process not by Jesus, but by God the Father. Thats what I would think for any hypothesis like this, radiation, corona discharge etc..","date":"2015-10-30","mins":"5:15 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-214032","author":"matthew_l","post":"Multiple peer reviewed papers by two very good blood chemist Alan Adler, John Heller. Independently confirmed by Dr. Baima Bollone, and its only the opinion of the STRP team and nearly every medical expert, pathologist, immunologist etc. I’m fine with saying it is not 100% proven, but it is pretty well established. Your assertion that forensic experts have not seen blood this red is unjustified. If I remember correctly jbejon who I believe said he was medical experience (might have spelled his name wrong) said on here that it is not abnormal at all. When all the tests done indicate that it is real blood with serum stains included then the fact that the blood is red is just something that needs to be worked out, and there are multiple explanations on the table that are credible. You don’t jump to conclusions and say it proves the blood is not real blood, that is absurd. Well, it happens a lot Charles I see it all the time. Deny Jesus burial despite it being well established and you have a weaker Resurrection argument that you can refute easier. Deny the blood despite it being well established and its a lot easier to deny the authenticity of the Shroud. With all due respect, you know nothing about blood stains, neither do I. However, when multiple independent peer reviewed test by blood chemist/medical experts come to the conclusion that there is real blood I would think you ought to respect that conclusion. When the vast majority of those with medical experience who have see the Shroud in person or in lifesize pictures (Barbet, Zugibe, Bucklin the list goes on and on) agree it is real blood you ought to respect their expert opinion as well. And I don’t want to hear about anonymous forensic experts you have allegedly consulted with. Lastly, it is not easy to just say “well someone just tossed some medieval blood on there” its not that simple, and i’m sure this has been explained to you many times before. I have to be honest Charles i’m not sure another series of test would do anything to sway your opinion. Why do we even need a handful more of experts to tell us what all the other experts have been saying all along?.","date":"2015-10-31","mins":"7:11 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-213963","author":"matthew_l","post":"We have to get rid of the concept of bodily Resurrection? Biblical Scholars disagree..","date":"2015-10-31","mins":"12:17 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"}]
