[{"id":"comment-211136","author":"matthew_l","post":"Hey Barrie, i’m a pretty big fan of yours when it comes to the shroud. I’m writing an article right now nothing major just on a friends blog (i’m only 18) and since you’re a photographer i’m wondering if you have some good pictures showing the serum stains around the blood. I’ve seen a lot of good ones, but they are usually hard to find again. Thanks!.","date":"2015-09-24","mins":"11:35 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","title":"Facebook:  Barrie Schwortz on Indianapolis"},{"id":"comment-209920","author":"matthew_l","post":"I enjoyed this video, and i’m always glad to see proponents of the Shroud. However, I would like it very much if someone on here would clear up the pollen/plant/flower evidence in regards to the Shroud because it is all very controversial, and confusing to me. And its frustrating especially when i’m trying to create an article on the Shroud..","date":"2015-09-08","mins":"11:46 pm","url":"https://shroudstory.com/2015/09/08/new-youtuibe-presentation-is-the-shroud-of-medieval-forgery/","cat":"presentation","title":"New YouTube Presentation:  Is the Shroud a Medieval Forgery?"},{"id":"comment-210059","author":"matthew_l","post":"I can’t reply to your other comment for some reason, and you sure have made your views public! The skeptics tend to love linking the article you mention. However, I am fully convinced partly because of Thomas de Wesselow that the shroud is absolutely not any type of painting, but the real burial cloth of someone. There is real blood on the shroud which is completely confirmed by dozens of pathologist/blood chemist, and there is no brush marks whatsoever. Everything like the naked corpse, wound marks on wrists, single nail through feet, whip marks, crown of thorns etc. Looks authentic. For example, medieval, and christian art shows at least a loin cloth on Jesus, and sometimes much more clothing, wound marks in the palms, a crown of thorns that is almost like a sweatband. Also how would a forger know what a roman flagella wound looked like? Yehohanan the crucified man from the 1st century had a single nail through his feet like the man on the Shroud appears to have been nailed through the feet. Moreover, the feet on the shroud are not even visible, and why would an artist make an incomplete “painting”, and why would he go to such extreme measures to make a forgery? An obvious artwork was revered as the burial cloth of Christ centuries ago it isn’t very hard to convince people, and you didn’t have to go to such extreme measures that would be necessary to create the shroud. Medieval paintings differ in style, and don’t match the rugged look of the man on the shroud that is medically accurate etc. I do agree there is not absolute conclusive evidence that traces the Shroud back to the 1st century, but I don’t think that is required. It is either Jesus or a forgery, and if it is Jesus it comes from the 1st century. There is however clues that it was in existence early on like coins, christ pantocrators, pray manuscript, sudarium of oviedo, and perhaps Jerusalem dirt/limestone, and perhaps what i’m not sure of pollen..","date":"2015-09-10","mins":"2:15 pm","url":"https://shroudstory.com/2015/09/08/new-youtuibe-presentation-is-the-shroud-of-medieval-forgery/","cat":"presentation","title":"New YouTube Presentation:  Is the Shroud a Medieval Forgery?"},{"id":"comment-210008","author":"matthew_l","post":"I think De Wesselow dealt with Nickells silly rubbing technique as well as the blood being “painted on”…That is just mind boggling wrong. You’re right though Atheist will always bring up Mc Crone, and the C 14 dating which gets old after awhile, but I can’t force anyone to believe the Shroud is authentic..","date":"2015-09-09","mins":"7:48 pm","url":"https://shroudstory.com/2015/09/08/new-youtuibe-presentation-is-the-shroud-of-medieval-forgery/","cat":"presentation","title":"New YouTube Presentation:  Is the Shroud a Medieval Forgery?"},{"id":"comment-210060","author":"matthew_l","post":"Also I wouldn’t say the textile type observations support the shroud or don’t support the shroud. It seems to me that the textile observations completely leave open the possibility of the shroud coming from the 1st century or medieval times. There are certain things that fit better from the 1st century though, and like Dr. Flury Lemberg has said there is nothing that shows the cloth could not have come from the 1st century syrian area. The 3:1 Herringbone Weave pattern is interesting because it is expensive, and what you would expect from a rich man like Joseph, and why would an artist use such a pricey cloth? One of the major motives for art is financial gain, and it seems pretty counter productive to me to use such a cloth..","date":"2015-09-10","mins":"2:21 pm","url":"https://shroudstory.com/2015/09/08/new-youtuibe-presentation-is-the-shroud-of-medieval-forgery/","cat":"presentation","title":"New YouTube Presentation:  Is the Shroud a Medieval Forgery?"},{"id":"comment-209982","author":"matthew_l","post":"I think i’m leaning in the direction that the pollen/plant/flower evidence isn’t as strong as many believe, but you do say in the conclusion of your article.. “In spite of all the secrecy and confusion there remain a few grains of pollen from some exclusively wind blown Middle Eastern trees that are difficult to explain except that they fell on the Shroud while it was in Israel.” So you do think there is at least a minimal amount of evidence that shows the Shroud was in the Middle East? Obviously if it was it must have been before the rock solid historical record because it doesn’t appear in the middle east anywhere during it..","date":"2015-09-09","mins":"1:08 pm","url":"https://shroudstory.com/2015/09/08/new-youtuibe-presentation-is-the-shroud-of-medieval-forgery/","cat":"presentation","title":"New YouTube Presentation:  Is the Shroud a Medieval Forgery?"}]
