[{"id":"comment-213510","author":"matthew_l","post":"Glad to see Sovik’s articles posted here…Those articles are in my opinion very good, and fair..","date":"2015-10-24","mins":"1:12 pm","url":"https://shroudstory.com/2015/10/24/and-now-you-have-something-to-do-this-weekend/","cat":"other_blogs","title":"And now you have something to do this weekend"},{"id":"comment-213537","author":"matthew_l","post":"“Responding to one question with another is an evasion, not an answer” Try telling that to Jesus, Hugh. He did just that all the time..","date":"2015-10-24","mins":"11:10 pm","url":"https://shroudstory.com/2015/10/24/and-now-you-have-something-to-do-this-weekend/","cat":"other_blogs","title":"And now you have something to do this weekend"},{"id":"comment-212174","author":"matthew_l","post":"I would love to follow a new scientific investigation into the Shroud, and I think its very important that there is one to confirm a lot of the data we have, and to gather new data as well. I’m confident that if there was another in depth investigation that it would be very positive for authenticity just like STRP was, but the church doesn’t seem to want to do it. The truth needs to be figured out no matter what it is. If it is authentic it will have a huge impact throughout academia especially New Testament scholarship..","date":"2015-10-09","mins":"6:29 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","title":"No Closer to the Truth Because of Simony"},{"id":"comment-215028","author":"matthew_l","post":"#4 or course has always been the most compelling…Because you can reason..So this burial cloth held a real crucified human corpse..The human corpse that was inside the Shroud at one point has all the wounds of Jesus, and they are forensically accurate. Jesus had a pretty unique death so its not all that hard to tell it is in fact Jesus, and not some anonymous crucifixion victim, and of course by tradition the cloth has been connected to Jesus which is worth noting, and i’m not sure why a burial cloth would even be taken out a tomb unless it was significant. I believe the forensic evidence is more than enough to establish the authenticity of the Shroud, but its always nice to have additional evidence like #7 where there is Jerusalem limestone. Its significant to me that it is largely concentrated near the feet which again just shows this is an authentic burial cloth of someone who walked around probably barefoot before being killed. Until we get further testing on the aragonite which i’m dying to see it will remain not quite excellent evidence, but still decent further evidence in part of a cumulative case for authenticity. #2, and #3 are very significant for the Carbon Dating question, and along w/ other pieces of evidence I think shows the results are probably in error without even getting into the scientific evidence. #6 Is interesting, but I don’t find it evidence for authenticity really, but more like possible evidence for the Resurrection. The body in the Shroud left within a couple days like Jesus in the Gospels left his empty tomb. Why did the body leave? Was it manual extraction or did Jesus just “disappear”? I think the evidence and what we see on the Shroud points to the latter more so than the former. I’m not sure about #1, and don’t quite understand the rationale for #5.","date":"2015-11-23","mins":"2:05 pm","url":"https://shroudstory.com/2015/11/23/three-comments-promoted-seven-or-so-reasons-to-believe-the-shroud-is-authentic/","cat":"comments_promoted","title":"Three Comments Promoted, Seven or So Reasons to Believe the Shroud is Authentic"}]
