{"resources":[{"author":"2121212123","post":"“…Giulio Fanti’s claim that UV radiation is the only technique that comes close to reproducing the image have not been so corroborated. …”\nSorry…\nEng. Fanti never claimed that.\nYou are wrong.\nDr. Di Lazzaro used VUV (vacuum UV).\nSo, I hope you’ll want to be more exact in your writings.\nPerhaps you wanted to write:\n“Giulio Fanti’s claimed that Corona Discharge effects…”\nor:\n“Giulio Fanti’s claimed that Corona Discharge and UV effects…”\n(because he indicated us something similar the “brilliant Body of Resurrected Jesus” that passed through the linen cloth, something similar the Jackson’s hypothesis…).\n-*-*-*-*-*-\nHere Particular References:\n1- “Forces of the Quantum Vacuum”\nAn Introduction to Casimir Physics\nEdited by: William M R Simpson\n(The Weizmann Institute of Science, Israel),\nUlf Leonhardt (The Weizmann Institute of Science, Israel)\nLink:\nhttp://www.worldscientific.com/worldscibooks/10.1142/9383\n>Forces of the Quantum Vacuum presents a number of\ntheoretical approaches to Casimir, van der Waals and Casimir–Polder\nforces that have been fruitfully employed in mainstream research,\nand also reviews the experimental evidence for Casimir forces. … etc. …\n2- “Quantum vacuum energies and Casimir forces between\npartially transparent δ-function plates”\nJ. M. Muñoz Castañeda, J. Mateos Guilarte, and A. Moreno Mosquera\nPhys. Rev. D 87, 105020 – Published 29 May 2013\nLink:\nhttp://journals.aps.org/prd/abstract/10.1103/PhysRevD.87.105020\n3- “Giant vacuum forces via transmission lines”\nEphraim Shahmoona, Igor Mazetsb, and Gershon Kurizkia\nAn excerpt from the abstract:\n>Quantum electromagnetic fluctuations induce forces between neutral particles,\nknown as the van der Waals and Casimir interactions.\n>These fundamental forces, mediated by virtual photons from the vacuum,\nplay an important role in basic physics and chemistry and in emerging technologies involving, e.g., microelectromechanical systems or quantum information processing.\n>Here we show that these interactions can be enhanced\nby many orders of magnitude upon changing the character\nof the mediating vacuum modes. … etc. …\nLink:\nhttp://www.pnas.org/content/111/29/10485.abstract\n4- Quantum Vacuum Forces Project\n>A project, sponsored by NASA’s Breakthrough Propulsion Physics Program,\nto study ways of influencing the energy density of the quantum vacuum\nwith a view to possible applications in spacecraft propulsion.\n>It is being conducted by a team of scientists from various academic\nand corporate institutions in the United States and Mexico. \nLink:\nhttp://www.daviddarling.info/encyclopedia/Q/Quantum_Vacuum_Forces_Project.html\n5- Quantum energy teleportation.\n>Quantum energy teleportation, a hypothesis first put forward\nby Japanese physicist Masahiro Hotta of Tohoku University,\nproposes that it may be possible to teleport energy by exploiting\nquantum energy fluctuations of an entangled vacuum state of\na quantum field…\nLinks:\nhttps://en.wikipedia.org/wiki/Quantum_energy_teleportation\nhttp://www.tuhep.phys.tohoku.ac.jp/~hotta/extended-version-qet-review.pdf\nSo…\nPerhaps there is an interesting possibility to write a new novel based on a\n“Black Order of Templar Knights” (…an evocation received by an unknown\nET civilization who decided to mock our own World, producing the famous\nand presumed textile fake) that “presumably produced that Image” [included\na chapter on explanations about the lack of investigations into the exact\nlevel of sophisticated textile attack to our Christian civilization… !]\nOr: A case of Applied “Quantum energy teleportation” (= QET).\nBut this Science-Fiction seems to be far from our normal\nScientific knowledges about the Shroud!\nB.T.W.:\n>The 2006 James Rollins novel “Black Order” discusses\nsuspected zero-point energy research by the German military\nduring the Second World War…\nInstead in 2013 Fanti, Baraldi, Basso, Tinti,\npublished their work about\n“non-destructive dating of ancient flax textiles”\non “Vibrational Spectroscopy”.\n\n","date":"July 7, 2015 at 10:32 am","url":"https://shroudstory.com/2015/07/06/techno-science-and-the-shroud/","cat":"article","title":"Techno-Science and the Shroud"}]}
