{"misc":[{"id":"comment-958","author":"a_nicolotti","post":"Before I answer to the two objections: 1) Ad hominem. I have not spoken about Marion to create an argumentum ad hominem, but because Frale introduces Marion as person totally neutral, impartial and disinterested. Before introducing his work, she reconsidered the credibility of Marastoni and Orecchia because they are Catholic; then she created a situation of expectation in the reader, introducing Marion as a super partes scholar. But Marion was a person very interested to the defence of the shroud. The fact that has written some books on the relics, certainly cannot mark him out as an “independent” scientist. Was he agnostic? Strange. He wrote a book on the shroud not limiting himself to speaking of his studies on the handwritings, but making the history of the shroud and concluding with the hypothesis of the resurrection of Christ. If Frale suggests an argumentum pro homine, I use an argumentum ad hominem. 2) “It’s clear it’s just a possibility, not a certitude for Barbara Frale”, you say. In reality the continuous use of “possibilist” sentences is the style of the entire book, where the repeated use the “if” and the “perhaps” in insistent way, is aimed at creating the impression of strong possibility in the reader. The large majority of the possibilities, in the following pages will be turned into reality. If we try to eliminate all the sentences with a “perhaps”, we will cancel the 90% of the Frale’s books. Just against this system (creating an historical reconstruction using undemonstrated hypotheses) prof. Vallerani has written a very incisive review. The main point is that Frale holds possible that handwriting of the I century can be legible in XIII and then disappear forever. Nobody has ever spoken of them, nobody has ever described them, nobody has ever seen them. The consequences of the fire in Chambery? Someone should explain us *how* the writings did form, and as *why* they disappear. Marion and Frale say that the handwriting possesses the same nature of the body’s image. If the fire has modified the handwritings, has modified also the image of the body. But why? How? About Capasso: Frale “showed him the handwritings “discovered” by Marion and Courage in a single blind experiment”? The palaeography is not similar to the medicine. The original is important. Frale has not presented to Capasso the shroud or photos of the shroud, but photographic manipulations of the shroud. The handwritings that are reproduced in the Frale’s book, was prepared by Marion, going over the lines again; if one looks only at the “original” photos, he doesn’t read anything. Moreover: some of the researchers quoted in the book that I have contacted, are completely against the Frale’s thesis, and in some case spoke with me in terms of “dishonesty”. The other objections remain: the handwritings do not exist, it is not explained how they formed, the handwritings are integrated in a completely arbitrary way, they are full of errors, the Frale doesn’t know the Hebrew language, the external side of the shroud is completely white, nobody sees the handwritings on the high quality pictures, it is known that the images of Enrie are defective, etc. Etc. I have analyzed some of the modern high quality pictures, looking for the handwritings. The most greater part of the presumed signs are clearly fold marks of the shroud or some protuberant threads that, illuminated by the light used by Enrie, appear clearer and therefore dark on the negative image. It is not necessary to ask a palaeographer to see it. PS Forgive my English!.","date":"2010-01-26","mins":"1:21 pm","url":"https://shroudstory.com/2010/01/22/more-death-certificate-on-the-shroud-of-turin/","cat":"news_&_views","title":"More: Death Certificate on the Shroud of Turin?"},{"id":"comment-955","author":"a_nicolotti","post":"Kind Mr. Lupia, about Mario Capasso: probably he cannot legitimate the inscriptions on the shroud, because he has not seen them. To all the researchers consulted by Barbara Frale, it has been shown a photographic manipulation of the shroud, without saying that it was the shroud! The transcript and the translation of the inscriptions , and also the grammatical errors, are due to Barbara Frale. If you know Capasso, you can ask him. P.S. I have written some pages on this matter, in Italian http://www.christianismus.it/modules.php?name=News&new topic=17.","date":"2010-01-25","mins":"6:53 pm","url":"https://shroudstory.com/2010/01/22/more-death-certificate-on-the-shroud-of-turin/","cat":"news_&_views","title":"More: Death Certificate on the Shroud of Turin?"}]}
