{"history":[{"author":"albert_bodt_m_d","post":"David, I read your comment with interest.\nA few comments from my perspective if I may.\nFirst, most scholars in the field, based on careful analysis of the available ancient literature, analysis of the known events and their dates (year CE), agree that the crucifixion with reasonable confidence, occurred ~30CE. The estimate of the age of Jesus was about 33 years of age, which makes the year of his birth 3-4BCE. I unfortunately cannot cite the specific evidence for this off the top of my head, but I believe my statement to be correct. \nYour post makes the following claims\n” Jesus was buried in an identifiable tomb, rather than in a common grave for criminals”. \nThis is of course stated in the gospels, and I believe the site of burial was provided for by Joseph of Arimathea.\n“This detail is historically significant because of an historical event, the Resurrection, and an artifact, the Shroud of Turin”\nYou speak of the resurrection as an historical event. There is not one iota of historical evidence that such an event occurred. This is a theological precept that has no place in academic historiography. The story goes, depending on which gospel you read, that  when Jesus’ disciples approached the tomb, the stone had been rolled away and the tomb was empty. An “angel”appeared to them and told them that he had risen ( I am paraphrasing here). These are articles of faith, not history.  By definition, faith is a belief, without any evidence to support it. It is an emotively based phenomenon, not founded on any physical scientifically reproducible evidence. The rising of a human being back to life after clinical death just does not happen. The changes that occur immediately after death occurs, precludes the return to life, no matter who the individual is. One can believe what he or she wishes to believe, however, the reality remains and has been the same throughout time. The story, in my and others view, is made up, by those who had an interest in maintaining calm and preventing political unrest after the execution of Jesus. Those would have been the Sanhedrin, specifically Caiaphas. They presumably did not want Jesus’s tomb to become a shrine, a place to rally and further the Jesus movement. A more plausible and more likely scenario could have involved  two or more priest novices (who were traditionally dressed in white robes), sent by the Sanhedrin (Caiaphus), to remove the corpse during the night (who else could have gotten past the Roman soldiers guarding the tomb, and gotten help in removing the heavy stone in front of it). Then, they taking the corpse into the Negev desert, left it there to be devoured by wild dogs.(1) They then advised that his body had risen from the dead; a story easily accepted by the illiterate peasants that made up most of Jesus’ followers. The resurrection story sounds idealistic not realistic and I submit to you and others that it historically never happened. \nSecondly, the Shroud of Turin as a historical icon. I agree that it is indeed that, but not necessarily what believers claim it is. It is indeed controversial and I myself am not well versed in it per se. However, couple of comments. \nThere is a great deal of disagreement in the lay community regarding the age of the shroud itself. It was dated by Radiocarbon 14 dating, performed at three separate academic centers, independent of each other. The date of the shroud was dated to the middle ages, roughly the 13th century. Carbon-14 dating is a way of determining the age of certain archeological artifacts of a biological origin up to about 50,000 to 75,000 years old. It is used in dating things such as bone, cloth, wood and plant fibers that were created in the relatively recent past by human activities. The more recent the artifact the smaller the confidence interval, that is to say, the range of dates of which the mean is the date given to the artifact. It was developed by one of my professors at UCLA and remains to this day, as far as I know, the main method of dating organic artifacts. It is accurate enough that one can rely on its results with a fairly good confidence interval. There are academics, or purported academics who would challenge that statement, however it remains the mainstay of dating biological material artifacts. The fact that three independent prestigious academic centers independently dated the shroud to the middle ages, suggests very strongly that it was created during that time period and not long before or after, despite all the obfuscations of those who disagree with it.  Secondly, the image on the shroud, however it was formed has the image formed by an individual of a stature of 5 feet 10 inches. This itself is an unusual  stature for men of the first century CE, where the common height of a man was about 5 feet one to three inches. Had Jesus been 5’10” one may assume some scriptural reference to his stature, as it would be highly unusual. It would coincide more with the height of someone of the middle ages, and even then, this person would have been considered tall.\n“The Resurrection occurred within a few years of the crucifixion, and can’t be explained in terms of any other historical event because the followers of Jesus founded the Catholic Church”\nI believe you misstated years for days. I am not sure what you meant by the second part of your statement, however I refer to my statement above regarding the resurrection. I for one, do not subscribe to supernatural or mystical statements as evidence, as it does not provide one iota of physical evidence that an event occurred. Again, people don’t become alive again after they die for the clinical reasons cited above. It is again a matter of faith, which I see as a belief based on emotive (emotional) responses, not factual, evidence based historical events. I will not go into the history of the Catholic Church as its foundation is based on a restricted set of beliefs that coincided roughly with the theology of the majority of Church fathers in the fourth century to suit their theology. It left out those writings that did not meet the specific theological criteria of those few individuals. In fact any one who disagreed was excommunicated and in a few instances killed.\n“When the Catholic Church lost its influence in the 18th century, the wars and genocide of the 19th and 20th centuries followed. ”\nI doubt very much that the “genocidal wars” which you mentioned, (American and French Revolutions? Nepoleonic Wars?, American Civil War?, WWI?, WWII?) had any thing to do with the decline of the influence of the Catholic Church. There is not one shred of evidence these are in any way connected.\n“The Shroud of Turin is a long piece of linen with a mysterious image of Jesus showing the blood marks from the crucifixion nails, whipping, crown of thorns, and stabbing, as reported in the gospels A heretical Christian sect probably created the image in the 1st or 2nd century with methods that have been lost to history.”\nThere is no convincing evidence that what you claim is correct regarding the shroud. It is a piece of linen, with the image of a man 5’10”, who appears to have wounds consistent with scourging, and wounds to the ankles and wrists. The fact that the wounds to the ankles and wrists are evident is historically interesting. If one was crucified by the use of nails (some victims were tied to the cross), then the nails or spikes would have been placed through the ankles (there is a specimen of the calcaneous (ankle) extant that is the remains of a 20ish year old male from the first century with spike through it as a result of crucifixion). Additionally, the spikes were not placed in the hands but through\nthe wrists, as the hands are not capable of supporting the weight of the body. That evidence in itself does not suggest that this is the shroud of Jesus, far from it, especially in light of the independent C14 radio dating. \n“The faith response to the historical Jesus is to believe that Jesus is alive in a new life with God and that if you follow Jesus the same good thing can happen to you. The historical Jesus includes an accounting of those who believe in Jesus, those who don’t, and those who think believing in life after death is irrational ”\nYou are showing your bias here as a believer. Therefore you cannot dispassionately argue on the historical evidence and mix that with your beliefs in the theology which I suspect you were raised with and is emotionally, not factually or scientifically, driven. To say that those of us who rely on physical evidence for the historicity of events as they really occurred and do not subscribe to the religious belief that you and other Christians subscribe to as irrational, is motivated by your emotion and perhaps lack of understanding of the scientific method.\n“I believe in Jesus is that those who think faith is irrational tend to be ignorant of the cosmological argument for God’s existence, unintelligent about the mind-body problem, and irrational about the meaning of life.”\nAgain, I am not sure what you mean here, it is somewhat of a rambling statement that obviously is motivated by your emotional need to believe those religious precepts that you have been taught. It is very difficult to stand back and look at the physical evidence without a jaundiced eye if you are religiously inclined to accept certain stories as fact. Unfortunately many of those “facts” do not stand up to historic and scientific scrutiny.\nHaving said everything I have said. I mean to argue against your statement from an academic point of view and do not mean in any way to demean the beliefs you may hold. I have respect for your beliefs. However when making statements, you have to be ready to provide evidence and defend your position. The burden of proof lies with the individual who makes the claim. That proof must rely on hard, reproducible, falsifiable evidence (Popper).\nSincerely, A. Bodt., M.D.\n(1) Freeman, Charles A New History of Early Christianity, Yale University Press 2009, pp\n     32-34.\n\n","date":"August 7, 2013 at 7:55 pm","url":"https://shroudstory.com/2013/08/07/comment-the-real-history-is-nothing-like-what-christians-believe/","cat":"history","title":"Comment:  The real history is nothing like what Christians believe . . ."}],"resources":[{"author":"albert_bodt_m_d","post":"“Modern day Christianity-loathing Academia is almost unanimous in saying that Jesus did in fact exist.” \nTony, it seems from your post that you have a distinct bias against academia. As an academician and scientist, while there may be individual academics that have objections to Christianity, I cannot vouch for them. I can frankly tell you that academics who study the historicity of religions, Christianity included, in general do not “loath” Christianity, or for that matter, any other religion.  Biblical history academics are not concerned with theology but they are interested in the history, the actual events of the the formative Christian era. Whether this coincides with the theology is irrelevant. There is no judgment as to the beliefs of those who adhere to the theological precepts of Christianity, even if they themselves are not believers such as as myself. I do however have an abiding interest in history including ancient history.  As a (non-blblical) scientist ( I am involved mostly in Medical as well as Anthropological research) and medical clinician (my background is in Biology and Cellular Biology), I am interested only in the physical evidence to determine what is going on in my fields of interest. That evidence has to be supportive of ones hypothesis, determined by diligent research and experimentation. The studies (experiments) must be reviewed by experts in the field (peer reviewed) before the results of the study can be published in a specialty journal. The study has to reproducible and yield the same results by other scientists in the field to be eventually accepted as hard evidence in support of one’s hypothesis. After several attempts to disprove one’s results, there being no evidence to falsify the conclusions, the hypothesis becomes a “theory”. After further time, and efforts to disprove the theory, it becomes generally accepted as fact, bearing in mind that science only determines the probability of a theory being true. Such is the case with several theories in biology including Evolution, which is considered fact due to the high degree of probability of it being true, as all attempts to disprove it over the last 155 years–haven’t. Obviously, historians, including Biblical New Testament historians cannot use the scientific method to the same degree as biologists or physicists, however they are quite diligent in their efforts to tease the physical historical evidence from the literature, which includes the ancient documents (most of which, if not all, are copies, as the originals are lost), in Greek, Latin and some in Aramaic. Some devote their careers to analyzing one document or even one chapter. These individuals are dedicated to discovering what really happened as opposed to those that believe what happened (despite their lack of evidence).\nTo respond to the second half of your statement. I am inclined to believe the evidence as cited by the academic experts in the field of Biblical, New Testament, history. The prevailing evidence seems to suggest that there was in fact an individual named Yeshua of Nazareth, who was probably baptized by a person who we know as John the Baptist, around 27CE and preached in Judea until 30CE when he was arrested for sedition and sentenced to death by the common Roman method of execution for enemies of the Roman State, crucifixion, by the governor of Judea, one Pontius Pilatus, who we know was governor from 26-36 CE. There is plentiful physical evidence to support this. The four (three synoptic) Gospels themselves, even though written decades (between 60-90 CE) after the death of Jesus, are sources that can be combed and teased for evidence for the historical Jesus. These were obviously based on earlier writings and oral traditions that go back to around 30CE. Paul’s letters offer much the same titillating tidbits of historical evidence. The picture of the historical Jesus is not at all the image that Christians see in their Jesus. The real history is nothing like what Christians believe what happened. The modern story is a construct that has been embellished by supernatural and fantastical events through the millennia, by hundreds of believers who added them for their own purposes, never mind the translational mistakes that occurred. We as scientists, have no opinion, or professional interest in theology, only in the physical evidence that describes the physical universe and what happened in it.\n\n","date":"August 6, 2013 at 9:19 pm","url":"https://shroudstory.com/2012/03/21/bart-ehrmans-new-book-did-jesus-exist/","cat":"books","title":"Bart Ehrman’s new book: ‘Did Jesus Exist?"}]}
