{"image":[{"author":"alvin","post":"You should read: “Those are VERY GOOD QUESTIONS that DiLazzaro or Fanti or anyone else has NOT been able to answer yet (to my knowledge at least)…”\n\n","date":"April 16, 2014 at 1:29 pm","url":"https://shroudstory.com/2014/04/15/good-chemistry-questions/","cat":"science","title":"Good Chemistry Questions"},{"author":"alvin","post":"Quote: “What is the final result of diimide (a powerful reducing agent) treatment on images produced by Corona Discharge ? … and on images produced by VUV excimer laser irradiation ?”\nComment:  Those are VERY GOOD QUESTIONS that DiLazzaro or Fanti or anyone else has been able to answer yet (to my knowledge at least)…  I guess that if it is so, it’s simply because no one (starting with DiLazzaro and his team) have chosen to make the test, which would probably discard their hypothesis right away, because I seriously doubt that a diimide treatment of their oxydized samples would be able to remove the color and leave a clean linen fiber behind as it was the case for the colored fibers of the Shroud…\n\n","date":"April 16, 2014 at 10:44 am","url":"https://shroudstory.com/2014/04/15/good-chemistry-questions/","cat":"science","title":"Good Chemistry Questions"},{"author":"alvin","post":"This was a joke, really…  At least, they ended up adding the possibility that the chromophore is located in a layer of impurities…\n\n","date":"April 16, 2014 at 1:13 pm","url":"https://shroudstory.com/2014/04/15/good-chemistry-questions/","cat":"science","title":"Good Chemistry Questions"},{"author":"alvin","post":"Here’s another test DiLazzaro should do with his oxydized samples:  Try to apply sticky tapes on it with a similar amount of pressure as Rogers used in Turin and see if he can find the same kind of ghosts of color on the tapes.  Again, I seriously doubt he could find any…  And if my guess is good, that would also be enough to discard his hypothesis right away.  Same thing for Fanti and his corona discharge hypothesis.\n\n","date":"April 16, 2014 at 10:47 am","url":"https://shroudstory.com/2014/04/15/good-chemistry-questions/","cat":"science","title":"Good Chemistry Questions"},{"author":"alvin","post":"Quote: “The suggested diimide test on the Fanti & DiLazzaro treated samples might not have a starch layer. Also likewise Colin’s and Hugh’s samples probably also did not have starch layers. Their tests all need to be repeated on Edgerton type linen with a starch layer, then tested with diimide, before their hypotheses can be properly evaluated.”\nReply:  I agree with you.  And between you and me, the fact that they didn’t made their coloration tests on proper samples (i.e. samples that would have been made with the Antique technology, which would have created a thin carbbohydrate coating on the surface) is a very negative aspect of their test plan and, simply for this reason, their results must be considered with high suspicion in regard of the image formation that occured on the Shroud.\nThen, you ask: Does scorching, excimer lasers work when a starch layer is present, and are their images removed when treated with diimide leaving an unaffected PCW behind?\nTHAT’S THE QUESTION!!!  And in all logic, the answer should be “no” since their coloration processes are directly affecting the PCW of the linen fiber.  One thing’s for sure: DiLazzaro and Fanti have never show us any kind of proof that their coloration results is the same thing, chemically speaking, as what Adler saw on his Shroud sample.  They must do those kind of comparison tests if they want to get some credibility.\n\n","date":"April 16, 2014 at 4:42 pm","url":"https://shroudstory.com/2014/04/15/good-chemistry-questions/","cat":"science","title":"Good Chemistry Questions"},{"author":"alvin","post":"Quote: “However the fact is that Rogers never wrote the world primary cell wall. Why ?”\nMost probable answer:  Simply because, at the time he was doing his research, no one (namely : Fanti) had yet to come up with the primary cell wall hypothesis as a possible solution for the image chromophore.  Therefore, Rogers, even if he knew perfectly well the composition of a linen fiber, including the PCW (in his writings, he makes some specific references to the composition of the external part of the fiber, including hemicellulose and pectin), had no need to talk specifically about that external part of the fiber.  We must understand that his conclusion didn’t include at all the linen fiber (including the PCW) as part of the image chromophore, but only a thin layer of carbohydrate impurities, which left the whole structure of the linen fiber intact (and, for him, this was proven by the ghosts of color that leave a clean fiber behind and the diimide reduction of the color, which also left a clean fiber behind).\nQuote : “Therefore everything makes sense : dark bands = thick impurity layer = dense image.\nALL the impurity layer hypothesis is based on this hypothesis.”\nComment: That’s unfair to Rogers to reduce his hypothesis to such a simple premise.  In fact, along with this observation of the bands, Rogers hypothesis was mainly based, as I already said, on the observation of the ghosts of color that leave a clean fiber behind and the diimide reduction of the color, which also left a clean fiber behind and also on the FACT that traces of starch had been found on the STURP samples (first by McCrone and, later on, confirmed by Rogers himself).  Also (and this is important), we must note that Rogers, thanks to his preliminary tests concerning his image formation hypothesis, was able to prove that such a thin layer of carbohydrate residues on the top-surface of a linen cloth were able to get colored with the same kind of coloration as the Shroud image when exposed to a post-mortem gas like ammonia, which reinforce the credibility of his chromophore hypothesis…\n\n","date":"April 16, 2014 at 9:05 am","url":"https://shroudstory.com/2014/04/15/good-chemistry-questions/","cat":"science","title":"Good Chemistry Questions"},{"author":"alvin","post":"At the end of my previous comment, I said “which reinforce the credibility of his chromophore hypothesis…”  \nI should have add this:  as well as the credibility of his whole image formation hypothesis.\n\n","date":"April 16, 2014 at 9:07 am","url":"https://shroudstory.com/2014/04/15/good-chemistry-questions/","cat":"science","title":"Good Chemistry Questions"},{"author":"alvin","post":"Not for Rogers…  He thought the image was the product of a dehydration of a thin layer of carbohydrate impurities mainly made of starch and some other components (like maybe saponaria).\n\n","date":"April 15, 2014 at 4:37 pm","url":"https://shroudstory.com/2014/04/15/good-chemistry-questions/","cat":"science","title":"Good Chemistry Questions"},{"author":"alvin","post":"Concerning the idea that the image on the Shroud is the result of oxidation of the fibers, here’s what we can read in Ray Rogers’ book: “The first steps of the Maillard reactions are rather fast at much lower temperatures, and they produce colorless compounds (for example, glycosylated-proteins). The rates are even higher at body temperatures; however, they\nincrease by factors between two and three for each 10°C (18°F) increase in temperature. The colorless compounds are unstable, and they rearrange to give brown polymeric materials, melanoidins, most of whose structures are still unknown. It takes some time at lower temperatures for the color to appear. The color IS NOT a result of oxidation.”\nElsewhere in his book, we can also read this: “Prof. Alan Adler of Western Connecticut University found that the image color could be reduced with a diimide reagent, leaving colorless, undamaged cellulose fibers behind. All image color resides on the outer surface of the fibers. This confirmed spectral data that indicated that the image color was a result of complex conjugated double bonds; however, it proved that image color was found only on the outer surfaces of colored image fibers. Until this time, we had assumed that the image color was a result of chemical changes in the cellulose of the linen. The most likely change would involve the DEHYDRATION of the cellulose to produce conjugated-double-bonds systems.\nAdler’s observation proved that the cellulose was not involved in image formation.”\nNote that, in Rogers language, when he say that “the cellulose was not involved in image formation, he mean the whole linen fiber, including the most external part named “primary cell wall”.\n\n","date":"April 16, 2014 at 10:41 am","url":"https://shroudstory.com/2014/04/15/good-chemistry-questions/","cat":"science","title":"Good Chemistry Questions"},{"author":"alvin","post":"People should also take note of this reply of mine concerning an old comment made by Thibault Heimburger : https://shroudstory.com/2014/04/15/good-chemistry-questions/#comment-99916\nAnd they should also read this other comment of mine, in which I cite Rogers’ book: https://shroudstory.com/2014/04/15/good-chemistry-questions/#comment-99941\n\n","date":"April 16, 2014 at 1:22 pm","url":"https://shroudstory.com/2014/04/16/remember-the-valencia-consensus-parenthetical/","cat":"image_theory","title":"Remember the Valencia Consensus Parenthetical"},{"author":"alvin","post":"There was a mistake in one of my comment cited by Dan.  You should read: “Those are VERY GOOD QUESTIONS that DiLazzaro or Fanti or anyone else has NOT been able to answer yet (to my knowledge at least)…”\n\n","date":"April 16, 2014 at 1:29 pm","url":"https://shroudstory.com/2014/04/16/remember-the-valencia-consensus-parenthetical/","cat":"image_theory","title":"Remember the Valencia Consensus Parenthetical"},{"author":"alvin","post":"Quote: “Consequently it is unlikely that any of the other tests would give the same diimide reaction that Rogers found on his TS sample, leaving the underlying linen fibril unaffected. I also have not read that Rogers ever attempted a diimide reaction with his own Edgerton linen sample. Does anyone know?”\nWhat is really unlikely is the idea that a reduction of the color of Fanti or DiLazzaro’s samples could leave the resulting fiber unaffected the way Adler (not Rogers) saw it when he did the test!!!  Seriously, since their color reside on the PCW of the linen fibers, it is highly unlikely that a reduction of the color would not result in damaged fibers that would be easy to see…\nAnd concerning your question, this is a very good one that I also asked myself and I doubt he ever did the test!  Since the colored samples of Rogers are still in the hand of his wife (another scientist by the way), that would be a very good idea to ask her to do the test and show us the result!!!  Someone should ask her to do the test.  Dan, I hope you read this!  In all logic, because of the nature of the chromophore (i.e. completely external to the linen fiber), the result should look pretty much like what Adler saw when he did the test on a Shroud sample…\n\n","date":"April 17, 2014 at 8:35 am","url":"https://shroudstory.com/2014/04/16/remember-the-valencia-consensus-parenthetical/","cat":"image_theory","title":"Remember the Valencia Consensus Parenthetical"},{"author":"alvin","post":"If that’s the case and you focus on my identity, then you miss something…\n\n","date":"April 20, 2014 at 9:09 pm","url":"https://shroudstory.com/2014/04/16/remember-the-valencia-consensus-parenthetical/","cat":"image_theory","title":"Remember the Valencia Consensus Parenthetical"},{"author":"alvin","post":"Here, I would like to reprint some important facts about the image that were written by Ray Rogers in his book or papers about the Shroud and by Alan Adler in his book about the Shroud, in order to underline the most important aspects of the image, so that any researcher that have produce some colored samples of linen (like Fanti, DiLazzaro, Colin Berry, etc.) could check out if the chemical nature of their samples can match those facts that we know about the image on the Shroud:\n1- Concerning the non-effect of the image formation on the bloodstains: “No image formed under the bloodstains (the blood was on the cloth before the image formed) and the image formation mechanism did not damage, denature, or char the blood. The image formation process was sufficiently mild that it did not destroy or damage the blood.” (note: Rogers could have also said that it was surely very mild and involved no movement whatsoever because all the bloodstains were left completely undisturbed, which is a fact that really seem to go against any idea that the image could be a manmade forgery, because such an idea would involve the use of a real bloodstained burial cloth of a crucified man and it’s very hard to think of one particular technique that would not have caused the disturbance of some bloodstains in some areas, as well as, for some techniques involving the release of a high amount of energy (like a scorch for example), the damage and/or destruction of some bloodstains in some areas). (quote from Ray Rogers’ book “A Chemist’s Perspective on the Shroud of Turin).\n2- Concerning the kind of temperature involved in the image formation: “Results of kinetics studies support a low-temperature image formation process. The temperature was not high enough to change cellulose within the time available for image formation, and no char was produced.” (Quote from Ray Rogers’ paper “Shroud of Turin FAQ”).\n3- Concerning the reduction of the image color: “Prof. Alan Adler of Western Connecticut University found that the image color could be reduced with a diimide reagent, leaving colorless, undamaged cellulose fibers behind.” (note: In Rogers language, the word “cellulose” is a generic word that include the whole structure of the fiber, including the primary cell wall of the fibers and this is confirmed by this statement made by Rogers that we found in Emmanuel M. Carreira’s paper “The Shroud of Turin from the viewpoint of the physical science” : “Later we found that the image color resides only on the outer surfaces of image fibers: the flax fiber was not colored at all.”). (Quote from Ray Rogers’ paper “Shroud of Turin FAQ”).\n4- Concerning the location of the image chromophore: “All image color resides on the outer surface of the fibers.” (note: For Rogers, this “outer surface” do not include any part of the fiber, including the primary cell wall). “This confirmed spectral data that indicated that the image color was a result of complex conjugated double bonds; however, it PROVED (note: Rogers never use such a word loosely) that image color was found only on the outer surfaces of colored image fibers. Until this time, we had assumed that the image color was a result of chemical changes in the cellulose of the linen. The most likely change would involve the dehydration of the cellulose to produce conjugated-double-bonds systems. Adler’s observation PROVED (note: again, Rogers never use such a word loosely) that the CELLULOSE WAS NOT INVOLVED IN IMAGE FORMATION.” (note: Again, in Rogers language, the word “cellulose” is a generic term that include the whole structure of the fiber, including the primary cell wall). Rogers conclude by saying: “THIS IS AN EXTREMELY IMPORTANT OBSERVATION.” (Quote from Ray Rogers’ paper “Shroud of Turin FAQ”).\n5- To complete the previous point #3, here’s an important observation made by Heller and Adler that we can find in their paper “A Chemical Investigation of the Shroud of Turin”: “…hydrazine bleaches the yellow body image fibril color very slowly and diimide… bleaches it instantly. Alkaline peroxide… similarly bleaches the yellow image fibril color quickly.” (note: Heller and Adler also made bleaching tests with many other solvents and reductants and the 3 stated here (i.e. hydrzine, diimide and alkaline peroxide) are the only ones that were able to remove the image color.\n6- Concerning the absence of a noticeable difference in the kind of defects observed on an image fiber and on a non-image fiber: “If Jackson were correct, and energetic photons caused the image color, the image areas should show significantly different amounts of diffuse radiation damage than the non-image areas. They do not.” (Quote from Ray Rogers’ paper “Testing the Jackson “Theory” of Image Formation”).\n7- Again, concerning the absence of a noticeable difference in the kind of defects observed on an image fiber and on a non-image fiber: “Image fibers and non-image fibers show exactly the same kinds of defects and defect populations. The image was not caused by energetic radiation. (Quote from Ray Rogers’ book “A Chemist’s Perspective on the Shroud of Turin).\n8- Concerning the absence of the characteristic effects of high-energy radiations on image fibers: “If any kind of radiation had caused the image, the characteristic effects of the radiation would be clearly visible in the flax fibers of the Shroud. In addition to that fact, more damage should be observed in image areas than in non-image areas. Such a situation is not observed (on the Shroud).” (Quote from Ray Rogers’ paper “Testing the Jackson “Theory” of Image Formation”).\n9- Concerning the presence of “ghosts” of color left stuck in the sticky tapes that were used by Ray Rogers to lift samples from the Shroud’s surface: “Heller and Alder also reported that “ghosts” of color were stripped off of fibers by the adhesive of sampling tapes when they were pulled out of the adhesive and that the insides of the fibers were colorless. I have confirmed this observation. The color is only on the surface of the image fibers.” (note: For Rogers, the image reside only on the “surface” of the fibers and when we read the quote I gave you in #2, we understand that the color reside only on the outer surface, which do not include any part of the fiber, including the primary cell wall). Then, Rogers add: “Another important observation was that the “ghosts” had the same chemical composition as expected from dehydrated carbohydrates.” (Quote from Ray Rogers’ paper “Scientific method applied to the Shroud of Turin – A Review”).\n10- Concerning the very small thickness of the color: The layer (of image color) is approximately one wavelength of visible light thick (200-600 nanometers), and it is amorphous (i.e. Lacking definite form; shapeless). (Quote of Ray Rogers found in Emmanuel M. Carreira’s paper: “The Shroud of Turin from the viewpoint of the physical science”).\n11- Again, concerning the very small thickness of the color, along with the fact that the surface of the chromophore appear to be “corroded”: “The color of the image is indeed a result of a thin coating. “Thin” is the important word. Surface cracking (“corrosion” as Adler called it) of the color can be seen, and flakes can be seen in the “ghosts” on the sampling tapes.” (Quote from Ray Rogers’ book “A Chemist’s Perspective on the Shroud of Turin). Elsewhere, Rogers explain the meaning of this particular observation: “At high optical magnifications, up to 1000X, no coatings could be resolved on the surfaces of the image fibers; however, the surfaces appeared to be “corroded.” That observation suggests that a very thin coating of carbohydrate had been significantly dehydrated on the outer surfaces of the fibers.” (note: This conclusion of Rogers clearly show that, for him, the observation he mention did suggest that no image color was present inside the linen fiber itself, which include the primary cell wall, but inside a thin coating of carbohydrates that was external to the fiber). (Quote from Ray Rogers’ paper “Scientific method applied to the Shroud of Turin – A Review”).\n12- Concerning the complete concentration of the color on the top-most part of the cloth: “Direct microscopy showed that the image color resides only on the top-most fibers at the highest parts of the weave.” (Quote from Ray Rogers’ book “A Chemist’s Perspective on the Shroud of Turin).\n13- Concerning the absence of a more in-deep penetration of the color in the darker zones of the image versus the lighter ones: “Darker-appearing, pure image areas did not penetrate significantly more deeply into the cloth than did lighter areas. The effect was much different than that produced by scorching a cloth with a hot statue.” (Quote from Ray Rogers’ paper “Scientific method applied to the Shroud of Turin – A Review”).\n14- Concerning the discontinuous aspect of the image: “The distribution of image color on the surface of the cloth is discontinuous. This can easily be seen in macrophotographs of the image areas.” (Quote from Ray Rogers’ paper “Testing the Jackson “Theory” of Image Formation”).\n15- Concerning the absence of cemented fibers in the image area: “No fibers in a pure image area were cemented together by any foreign material and there were no liquid meniscus marks. These facts seemed to eliminate any image-formation hypothesis that was based solely on the flow of a liquid into the cloth. This also suggests that, if a body was involved in image formation, it was dry at the time the color formed.” (Quote from Ray Rogers’ book “A Chemist’s Perspective on the Shroud of Turin).\n16- Concerning the absence of proteins in the image area: “No proteins could be detected in either image or non-image areas; however, they were easy to detect in blood stains.” (Quote from Ray Rogers’ paper “Scientific method applied to the Shroud of Turin – A Review”).\n17- Concerning the presence of carbohydrate impurities on the Shroud: “A search for carbohydrate impurities on the Shroud confirmed McCrone’s detection of some (wheat) starch fractions. Starch and low-molecular weight carbohydrates from crude startch would color much more easily than would cellulose as a result of either thermal dehydration or chemical reactions” (note: These kind of impurities would not only color more easily than the inner core of the linen fiber, which is mostly made of cellulose, but would also colored more easily than the primary cell wall, which is mainly made of substances like hemicellulose and pectin, along with also some pure cellulose, even though it’s true that the primary cell wall of the linen fiber is the part of the fiber which is the most easy to color).\n18- Concerning the similar characteristics present in the dorsal image versus the frontal image: “The image of the dorsal side of the body shows the same color density and distribution as the ventral and does not penetrate the cloth any more deeply than the image on the ventral side of the body.” (Quote from Ray Rogers’ book “A Chemist’s Perspective on the Shroud of Turin).\n19- Concerning the fact that every parts of the image (front and back) had been produced by the very same process: “Thermography PROVED ((note: again, Rogers never use such a word loosely) that the emittance of the image was the same in all areas.  The entire image was formed by the same mechanism.  Spectra and photography confirmed this observation.” (Quote from Ray Rogers’ book “A Chemist’s Perspective on the Shroud of Turin).\n20- Concerning the very low amount of coloration that was produced by the image formation process: “The image is extremely faint and difficult to see. Many more details can be seen in contrast-enhanced and ultraviolet photographs; however, they are somewhat misleading for studies on image formation. Whatever produced the image color did not produce very much color.” (Quote from Ray Rogers’ paper “Shroud of Turin FAQ”).\n21- Concerning the fact that water has no effect whatsoever on the image: “Water-stained image areas on the Shroud showed that the image color does not dissolve or migrate in water.” (Quote from Ray Rogers’ book “A Chemist’s Perspective on the Shroud of Turin).\n22- Concerning the nature of the image: “Adhesive-tape samples show that the image is a result of concentrations of yellow-brown fibers.” (Quote from Ray Rogers’ book “A Chemist’s Perspective on the Shroud of Turin).\n23- Again, concerning the nature of the image: “The puzzling “half-tone” effect has been mentioned. All of the colored image fibers showed approximately the same color intensity under a microscope.” (Quote from Ray Rogers’ book “A Chemist’s Perspective on the Shroud of Turin).\n24- Concerning the banding effect seen on the Shroud and its most probable meaning: “Bands of different-colored yarn can be observed in the weave of the cloth. Where darker bands intersect image areas, the image is darker. Where lighter bands intersect an image area, the image appears lighter. This PROVES ((note: again, Rogers never use such a word loosely) that the image color is not solely a result of reactions in the cellulose of the linen. Something on the surface of the different batches of yarn produced color and/or accelerated color formation. THIS OBSERVATION IS EXTREMELY IMPORTANT WHEN TESTS ARE BEING MADE ON IMAGE-FORMATION HYPOTHESES. If image color is not simply a result of color formation in the cellulose of the linen fibers, image formation must be a much more complex process than we originally thought.” (Quote from Ray Rogers’ book “A Chemist’s Perspective on the Shroud of Turin).\n25- Concerning the important difference of the force required to lift colored fibers with sticky tapes versus non-colored fibers: “When I took a tape from a non-image area of the Shroud, I found that it pulled much more easily than tapes pulled from the patches. The large difference in ease of pulling tapes from the surface made me decide to use the applicator to measure the force required to remove tapes. Tapes pulled from the darker body-image areas with extreme ease: I could barely measure the pulling force.” (Quote from Ray Rogers’ book “A Chemist’s Perspective on the Shroud of Turin).\nThese are, to me, the most important data coming from the Shroud in link with the image formation process that occurred on the Shroud that we can find in Ray Rogers’ writings. And along with all those things, we can also add those general characteristics of the image that are recognized by all the Shroud researchers who have studied the relic in-deep:\n26- The image has negative properties: When a photo of it is taken, the negative shows much more details than the positive.\n27- The image is isotropic: There are no preferential directions in the image.\n28- The image has a high resolution: The resolution of the image has been estimated at 5 mm. In other words, 2 points separated by 5 mm on the human body enveloped in the Shroud (or on the artifical form of a human body like a bas-relief or a statue) are seen as 2 separated points in the image.\n29- The image is not saturated: No point in the image is overexposed, so that it would cause a flou in the image.\n30-The image do not show any important distortions: Only some small distortions have been observed by the STURP team, which are consistent with the loose draping of the Shroud over a crucified human body that would have been in rigor mortis, so that he would have kept some of his position at the time of death (for example: both knees slightly bended, one more than the other, the head bended toward the chest, the feet in extended position and one foot pointing toward the other as they had been nailed together).\n31-The image shows no perceptible contour: The image slowly faded away instead of stoping abruptly as it is seen in paintings and photographs.\n32-The image possess tridimentional properties: When a photo of the image is placed under a VP-8 image analyzer or any modern 3D software, the result show the natural relief of a human form. Those tridimentional properties are also present in the dorsal image, even though they are more subtle (probably because of the combination of the more flat shape of the back in general – no matter if we talk about a real human body or some artificial form of a human body – and the position of the Shroud much closer in general with this side of the body or of the artificial form of the body). \nBefore anyone can claim he has found the solution to the image formation on the Shroud, this person should show us clear evidence that the image formation mechanism he propose (or, even better, he use for sample testing) can match all those facts and observations I extracted from Rogers’ writings and from other sources in scientific articles and books about the Shroud.  If even one or two of those things cannot be reproduced by the image formation hypothesis proposed by a researcher, his proposal must be considered as different than what happened on the Shroud of Turin.  All the claims that the result of someone’s test is looking pretty much like the Shroud image has absolutely no value at all if this person is unable to reproduced all those facts and observations.  \nFor instance, if the colored fibers of an image formation process proposed by someone can be easily disolved with the use of some solvents and reductants used by Heller and Adler that were not able to disolve the color of Shroud image fibers, then the image formation hypothesis proposed by this gentleman must be considered as different than what lead to the formation of the body image on the Shroud. Or on the contrary, if the colored fibers of an image formation process proposed by someone cannot be easily disolved with the use of diimide or if they cannot be disolved at all with the use of hydrzine or alkaline peroxide (see point #5 above), then the image formation hypothesis proposed by this gentleman must be considered as different than what lead to the formation of the body image on the Shroud. And it’s the same thing for the absence of a more in-deep penetration of the color in darker zones versus the lighter ones that any proposed hypothesis for image formation must reproduce in order to stay credible. \nThose are just three examples of possible discrepancies for one particular image formation hypothesis that can be considered as clear proofs of a non-match between such an image formation proposal and the real image formation that occurred on the Shroud of Turin.  We can take all the others facts and observations and do the same “matching” exercise.  In fact, I believe any credible researcher should do those “matching” exercise before he can claim to have found a potential solution for the image formation that occurred on the Shroud of Turin…  Here, it’s important to note that Rogers did made such a “matching” exercise (on a theoric base) before he proposed publicly his image formation hypothesis, which shows the kind of profesional scientist he was and can be seen as a good reason to support further testing of his hypothesis by another chemist (or, even better, biochemist).  Here, we must remember (or, for the skeptics, acknowledge) that he never was able to make more than preliminary testings before his death in 2003 but that, nevertheless, those tests were good enough in his mind (especially because those tests, especially the one he made with an old-fashion linen sample exposed to ammonia for 10 minutes, did gave some interesting matches with the known data from the Shroud that confirmed the “matching” exercise he did previously on a theoric base) to confort his idea that the most probable image formation process that occurred on the Shroud was natural and involved a Maillard reaction between post-mortem gases (along with heat coming from a recent dead corpse) and a very thin coating of carbohydrates present on the top-most fibers of the cloth. \nI must conclude by saying that, in all honesty, I really doubt the same kind of “matching” exercise had been done (or at least, done fully and properly) by many modern researchers who have proposed artistic or supernatural hypotheses for image formation in the last few years (like Moran, Rinaudo, Fanti, DiLazzaro, Berry, Garlaschelli, etc.)…\nFinal note: I know that some of the observations mentioned by Ray Rogers in his writings (like the particular location of the image chromophore for example) are still debated in the sindonologic world, but I choosed to keep them in my list of facts and observations coming from the Shroud for one important reason: because I really think that, on this particular issue, Rogers is the most reliable scientist we can trust because he was the chief chemist of STURP who saw the Shroud in person for 5 days and nights in 1978 and who was the best scientist of the team to judge if the image was located inside the linen fiber (including the primary cell wall) or outside the linen fiber and if the formation process had anything to do with a mild artistic technique (like the one used by Garlaschelli for example) or with a natural process involving the release of a very low amount of energy or with some process (supernatural or artistic) involving the release of a high amount of energy. On those crucial points, Rogers’ conclusions were definitive: The color reside outside the fiber and the image formation process did not affect the fiber at all and, consequently, we can forget any image formation process involving the release of a high amount of energy (like the ones proposed by Moran, Rinaudo, Fanti, DiLazzaro and Berry for example) because all of those things can’t color only an external coating of carbohydrates without affecting also the primary cell wall of the linen fiber. Rogers’ conclusions also rejected the possibility of an image formation involving a mild artistic technique that would have included the penetration of some liquid product inside the cloth.  Here, we can also add this to Rogers’ conclusions: Because the STURP team conclusion was definitive about the fact that the Shroud is a real burial cloth of a real crucified man and that the blood went on the cloth before the image was formed, the idea of a forger who would have used this kind of bloodstained burial cloth to create a body image some times later without ever disturbing or damaging the bloodstains is so ludicrous that we can reject it completely.\nAnd when we consider the most important conclusions of Rogers concerning the location of the image chromophore and the natural and very mild nature of the image formation, I think it’s not surprising at all to note that most of those who do not agree with those conclusions of Rogers are the ones who defend image formation hypotheses that involve the release of a high amount of energy that will always color the primary cell wall of the linen fibers (like a Corona discharge, a burst of UV light or a scorch)…  The best example concern the particular location of the image chromophore: Thanks to Rogers experiments of high energy hypotheses for image formation (see particularly figures X-7 and X-8 in his book “A Chemist Perspective on the Shroud of Turin” where we see the kind of oxidized result coming from a Corona discharge, which affect the primary cell wall of the linen fiber), we know that all those image formation processes that involve the release of a high amount of energy are not able to only color a thin layer of carbohydrate impurities and will always affect the fiber itself, which is, for him, a kind of result that is different from what he saw on his colored fibers samples taken from the Shroud. In such a context, would it be surprising to see Fanti, DiLazzaro, Berry and other researchers like that going against Rogers’ conclusion about the chromophore by defending the idea of a chromophore located inside the primary cell wall of the fibers?  I think asking the question is enough to understand why those persons will never agree with him on that question…  And it’s the same thing for the observation made by Adler that proves that no image formed under the bloodstains (and also under the serum stains) and for some other topics that are still debated in the sindonologic world.  \nSome can say that this reasonning could apply also to Rogers because he also proposed an image formation process, but those people don’t understand that if Rogers came to the conclusion that the image formation that occurred on the Shroud was natural and mild and involved only a thin coating of carbohydrates and not at all the linen fibers themselves (including the PCW), it’s only after he analyzed in-deep all the facts and observations I reprinted here and after he tested many high-energy hypotheses like the Corona discharge proposed by Fanti.  In other words, in the case of Rogers, he did things in the proper order, scientifically speaking: first he regrouped all the most pertinent and solid data available, then he made some experiments and only after this, he published his conclusion concerning the most probable process that lead to the formation of the body image on the Shroud.  Again, in all honesty, I seriously doubt that this kind of science done “the right way” have been done by those who have publicly proposed an image formation hypothesis involving the release of a high amount of energy in recent years…  Many people on this blog will surely crucified me for saying this, but I just want to remain faithful to what I firmly think is the truth.\n\n","date":"April 20, 2014 at 7:28 pm","url":"https://shroudstory.com/2014/04/16/remember-the-valencia-consensus-parenthetical/","cat":"image_theory","title":"Remember the Valencia Consensus Parenthetical"},{"author":"alvin","post":"Thanks\n\n","date":"April 20, 2014 at 9:17 pm","url":"https://shroudstory.com/2014/04/16/remember-the-valencia-consensus-parenthetical/","cat":"image_theory","title":"Remember the Valencia Consensus Parenthetical"},{"author":"alvin","post":"Nope.  the real reasion is the one I told you: I’m sick and tired of people always focussing on my name (most often in negative terms) instead of what I say, which is the only thing that matter.\n\n","date":"April 20, 2014 at 9:18 pm","url":"https://shroudstory.com/2014/04/16/remember-the-valencia-consensus-parenthetical/","cat":"image_theory","title":"Remember the Valencia Consensus Parenthetical"},{"author":"alvin","post":"I spent many hours writing my long post (link: https://shroudstory.com/2014/04/16/remember-the-valencia-consensus-parenthetical/#comment-101772) and people only keep the focus on who is the author of my post instead of the post itself.  That’s a shame.  \nThe name of the author is not important at all.  Please keep the focus on the content of the post and forget the possible author of the post.  Thanks.\n\n","date":"April 20, 2014 at 9:20 pm","url":"https://shroudstory.com/2014/04/16/remember-the-valencia-consensus-parenthetical/","cat":"image_theory","title":"Remember the Valencia Consensus Parenthetical"},{"author":"alvin","post":"Do you have a sample of linen colored with a UV laser or with a Corona discharge?  I don’t.\nThe only ones who can do those simple and relevant tests are the same who did some coloration tests with a UV laser or a Corona discharge, namely DiLazzaro and Fanti. \nIf those researchers wants to be credible in their image formation claims, they should do those easy tests and show us the results.  Why they never did those simple tests?  Good question that deserve to be ask…\n\n","date":"April 16, 2014 at 2:33 pm","url":"https://shroudstory.com/2014/04/16/remember-the-valencia-consensus-parenthetical/","cat":"image_theory","title":"Remember the Valencia Consensus Parenthetical"},{"author":"alvin","post":"[First part of comment edited out]  As I often said:  when you go publicly by publishing a book or a paper, be ready to take some critics…\n\n","date":"April 22, 2014 at 8:34 am","url":"https://shroudstory.com/2014/04/16/remember-the-valencia-consensus-parenthetical/","cat":"image_theory","title":"Remember the Valencia Consensus Parenthetical"},{"author":"alvin","post":"Last message to Louis:  I’m ready to apologize to you and anyone else for things I could have said that hurt you or them.  I have no problem doing so because my goal never was to hurt people.  In most cases, it was, as I said, just a way to reply to bad comments that were written against me.\nSo, can we start speaking honestly about the Shroud science instead of personal comments?  I’m fully ready to do so as my long post of Sunday clearly show…\n\n","date":"April 22, 2014 at 8:52 am","url":"https://shroudstory.com/2014/04/16/remember-the-valencia-consensus-parenthetical/","cat":"image_theory","title":"Remember the Valencia Consensus Parenthetical"},{"author":"alvin","post":"They are welcome?  With the use of which colored linen sample?  They are the ones who claim to have found a potential solution for the image formation.  They are the ones who should make those relevant tests in order to see if there really is a good match, chemically speaking.\n\n","date":"April 16, 2014 at 4:31 pm","url":"https://shroudstory.com/2014/04/16/remember-the-valencia-consensus-parenthetical/","cat":"image_theory","title":"Remember the Valencia Consensus Parenthetical"},{"author":"alvin","post":"If the chromophore would be located in the PCW, then why on earth the resulting fiber would be a clean and UNDAMMAGED fiber?  This makes no sense theoretically speaking since the PCW is an integrant part of the linen fiber and if you reduce it, no doubt the resulting fiber would be a damaged fiber.  And be sure that this was the kind of reflection that lead Rogers to discard the idea that the chromophore was located inside the linen fiber itself.  \nFanti and DiLazzaro can claim what they want in order to back-up their hypothesis.  I ask them to show us some proofs, especially regarding the diimide reduction of color and the ghosts!  I still wait for them to show us their colored samples are reacting in the very same way as the Shroud samples, as reported by Adler!\n\n","date":"April 16, 2014 at 2:52 pm","url":"https://shroudstory.com/2014/04/16/remember-the-valencia-consensus-parenthetical/","cat":"image_theory","title":"Remember the Valencia Consensus Parenthetical"},{"author":"alvin","post":"As Barrie Schwortz always say:  Something can look like the image on the Shroud (or the kind of coloration that produce the image), but if this thing don’t match all the chemical and physical properties of it, it is NOT the same.  UV laser and Corona discharge coloration of linen can produce something that look like the coloration of the Shroud image, but that’s far from meaning this is exactly the same.  If DiLazzaro and Fanti could prove us that they can obtain the same results observed by Adler on Shroud samples (i.e. diimide reduction of color and ghosts of color left in sticky tapes that leaves a clean and undammaged fiber behind) with their oxydized samples, this could surely stenghten the potential validity of their hypothesis.  But if the results are different, then we must consider their hypothesis as most probably invalid.  Why they never did those kind of comparative tests, I really don’t know.  They surely have the possibility to do this easily.\n\n","date":"April 16, 2014 at 2:46 pm","url":"https://shroudstory.com/2014/04/16/remember-the-valencia-consensus-parenthetical/","cat":"image_theory","title":"Remember the Valencia Consensus Parenthetical"}],"misc":[{"author":"alvin","post":"To me, the Shroud doesn’t prove at all the Resurrection but can be seen as a potential “proof” of the reality of the Incarnation of God in our humanity.  What if the main message of the Shroud to us would not be about the Resurrection but about the Incarnation?  Note that this is how Christians of the pre-STURP era were mainly understanding the silent message of the Shroud to us, while they were mostly believing the image was the one of the crucified Jesus at the time of his death that came from a natural image formation process (possibly related to the sweat that was covering his body and hair when he was placed in the tomb)…\n\n","date":"April 20, 2014 at 6:18 pm","url":"https://shroudstory.com/2014/04/19/its-called-circumstantial-evidence-anybody-have-a-better-idea/","cat":"news_&_views","title":"It’s called circumstantial evidence. Anybody have a better idea?"}],"resources":[{"author":"alvin","post":"And this shaving would most probably imply the disappearance, not of the primary cell wall of the linen fibers, but the colored coating of carbohydrate impurities that reside on-top of those fibers…\n\n","date":"April 20, 2014 at 7:13 pm","url":"https://shroudstory.com/2014/04/20/myra-adams-the-larger-question-for-easter-sunday-is-how-did-the-shroud-survive/","cat":"press_coverage","title":"Myra Adams:  The larger question for Easter Sunday is how did the Shroud survive"},{"author":"alvin","post":"I agree again 100% with Daveb’s comment, except for the fact it’s not Rogers who did the test with diimide (and other solvants and reagents) but Alain Adler…\n\n","date":"April 20, 2014 at 7:16 pm","url":"https://shroudstory.com/2014/04/20/myra-adams-the-larger-question-for-easter-sunday-is-how-did-the-shroud-survive/","cat":"press_coverage","title":"Myra Adams:  The larger question for Easter Sunday is how did the Shroud survive"}]}
