{"art":[{"id":"comment-191482","author":"andrea_nicolotti","post":"Very funny. Another example of human fantasy.","date":"2015-02-21","mins":"9:41 am","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","title":"A Bas Relief Match to the Shroud of Turin Image?"},{"id":"comment-191498","author":"andrea_nicolotti","post":"You are right, Thibault, Vignon is better. Wrong, but better. For the “problem” of Pray codex, no, I do not see differences. I am serious. (I do not know why you call it a parody, I have seen some minutes of the first video, and no more).","date":"2015-02-21","mins":"1:12 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","title":"A Bas Relief Match to the Shroud of Turin Image?"},{"id":"comment-191491","author":"andrea_nicolotti","post":"It is not a NEW level of bad, is the same level of Vignon, Filas, Whanger, Frale, etc. Etc. With their coins, inscriptions, objects, similarities, from the iconography of Jesus to the Pray Codex. Exactly the same level..","date":"2015-02-21","mins":"10:33 am","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","title":"A Bas Relief Match to the Shroud of Turin Image?"}],"dating":[{"id":"comment-78662","author":"andrea_nicolotti","post":"Max Patrick Hamon : An Italian specialist, Andrea Nicolotti, has proposed that the locution “ Ecce suaire Jesu Christi” ou “Here is the shroud of our Lord Jesus Christ” [Nicoletti totally missed both the U in Gothic script with E embedded within and the “h” in Gothic script in JHV!] I do not see any “U in Gothic script with E embedded within”. The first letter COULD be an E because it is very similar with the E of SUAIRE. As for the H that you say I missed, obviously I have not missed it (I am not blind), but when you do a transcription you must undo the abbreviations; so “Ih V” must be transcribed “Iesu” (or Jesu, like French people like). P.S. An e mail sent to Mr. Hourseau by me is not a “Scholar peer reviewing”, and internet is not a review..","date":"2014-02-12","mins":"9:40 am","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"id":"comment-79818","author":"andrea_nicolotti","post":"I’ll answer in a proper post. Here the argument is the funny argument of the earthquake, not the epigraphy.","date":"2014-02-16","mins":"12:37 pm","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"id":"comment-78830","author":"andrea_nicolotti","post":">>>>Reminder for Nicoletti: My name is Nicolotti. >>>>There are “official” and “non official” ways to peer reviewing” (e.g. Via email as Hourseau asked your opinion as “an Italian specialist” not as a plumber). Hourseau asked my opinion and I said what I consider right. I said also that I see many errors in his book and in Wilson’s interpretation of the object. Again, this is not peer review. It is a private email. >>>>>You cannot see a U letter in Gothic script just because you’re not familaier with carved inscription in Gothic script. I am familiar with it and I do not see the U. >>>>>To correctly undo the abbreviation “Ih V” is to fully write “Ih ESV” not “Iesu”… A full transcription is not a translation. …in Italian. Iesu is not a translation, is a transcription. “Iesu” is not Italian. You are a bit confused. “Ih ESV” is not wrong, like Iesu or Jesu. >>>>E[CCE] SVAIRE:Ih[ES]V C[RISTI], “here is the Shroud of (our Lord) Jesus Christ” (and not “Ecce suaire Jesu Christ”) I never wrote “Ecce suaire Jesu Christ” >>>>>At 2nd reading level (in Latin and in conjunction with the French word SVAIRE): E[CCE] SVAIRE (ND) IH[ES]V C[RISTI] ND? Why? Is not necessary. And here you missed the H in Christi >>>>>>At 3rd reading level (in Latin as a cryptic polemical inscription?): UE[RGENSI] SVAIRE (ND) IH[ES]V C[RISTI], “The de Vergy Family’s Shroud of our Lord Jesus Christ”. UE[RGENSI]? You are a bit confused with the language..","date":"2014-02-12","mins":"8:17 pm","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"id":"comment-126257","author":"andrea_nicolotti","post":"This book “The Untold Story of the Holy Shroud” is not a published book, and it is impossible to order it. If someone knows how to get a copy (in any form) of it, let me know, please.","date":"2014-06-02","mins":"6:31 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"},{"id":"comment-48613","author":"andrea_nicolotti","post":"Hugh Farey : As for the words of Pope Stephen II, do we have a source? It does not exist. The sentence that sindonologists quote (attributed to Stephen III, not II) was not written by the pope but in reality is an interpolation of the X XI century..","date":"2013-10-24","mins":"11:43 am","url":"https://shroudstory.com/2013/10/24/meanwhile-part-2-works-for-me/","cat":"carbon_14_dating","title":"Meanwhile, Part 2:  “Works for Me”"},{"id":"comment-48618","author":"andrea_nicolotti","post":"David Goulet : What is your source for that assertion? You can see my book “Dal mandylion di Edessa alla Sindone di Torino”, pp. 121 127..","date":"2013-10-24","mins":"12:24 pm","url":"https://shroudstory.com/2013/10/24/meanwhile-part-2-works-for-me/","cat":"carbon_14_dating","title":"Meanwhile, Part 2:  “Works for Me”"},{"id":"comment-48751","author":"andrea_nicolotti","post":"Matthias : I’m very interested in these words. Even if they date to 10th / 11th century, they strongly hint at referring to the shroud, which would add to quite an impressive array of historic literature that points to the shroud being of an age far older than the carbon dating suggests. I’d like to know more on this – Andrea when is your paper to be translated into English? Dear Matthias, I do not think that this interpolation hint at referring to the shroud, and much less “strongly”. This fantastic story has nothing to do with a shroud. As the mandylion has nothong to do with any burial shroud. When the book will be published, if you want I’ll tell you.","date":"2013-10-26","mins":"6:02 am","url":"https://shroudstory.com/2013/10/24/meanwhile-part-2-works-for-me/","cat":"carbon_14_dating","title":"Meanwhile, Part 2:  “Works for Me”"},{"id":"comment-48621","author":"andrea_nicolotti","post":"David Goulet : What is your source for that assertion? You can see my book “Dal mandylion di Edessa alla Sindone di Torino”, pp. 121 127. Would this be available online anywhere? I’m assuming then your assertion is based on original research. 1) No, is not online. But is going to be translated in English. 2) I always do original researches, but in this case is not necessary: to see that this sentence is not work of Stephanus, you can see, for example, the Christusbilder of E. Von Dobschuetz (printed in 1898: not exactly a “new” release…).","date":"2013-10-24","mins":"12:37 pm","url":"https://shroudstory.com/2013/10/24/meanwhile-part-2-works-for-me/","cat":"carbon_14_dating","title":"Meanwhile, Part 2:  “Works for Me”"},{"id":"comment-143705","author":"andrea_nicolotti","post":"I do not understand why you you lose so much time to comment things, usually meaningless, that Jones writes. It is a mystery to me. By the way, I think he did a good job with the scans of the newsletters, but unfortunately missing something fundamental: the page numbers of the original. So his work, for quoting with scientific purposes, it is useless, because it is necessary in any case to check on the printed copy..","date":"2014-08-13","mins":"11:39 am","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"}],"events":[{"id":"comment-28862","author":"andrea_nicolotti","post":"Obviously from Italy I am seeing it on TV, but here the streaming is working well: http://www.rai.tv/dl/Rai TV/dirette/Publishing Block 64203784 70f7 4b53 9d21 b14693850195.html.","date":"2013-03-30","mins":"1:02 pm","url":"https://shroudstory.com/2013/03/30/breaking-news-links-to-see-the-shroud-now/","cat":"event","title":"Breaking News:  Links to See the Shroud Now"},{"id":"comment-126287","author":"andrea_nicolotti","post":"Charles, this is not “an important new avenue of research”. It was proposed first time on 1910 and repeated many times. But what Pulcheria brought to the Blachernae is not the presumed burial cloth of Jesus, but the bandage of His mother..","date":"2014-06-02","mins":"11:29 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126298","author":"andrea_nicolotti","post":"Charles, you hope, but I think your hope will be vain. Scavone published in 1989 his first relation about the (presumed) documentary evidence of the Shroud in Constantinople. Now we are in 2014, and he is going to repeat the same things, and we are still at the same point. I do not expect any kind of fresh idea in sindonological congresses from the historical point of wiew, particularly if outside Europe. I think it is the moment to stop at all with sindonological congresses, where people tell the same things to the same people, about an object closed in a case that they cannot see and study, and without any original research in the historical archaeological exegetical biblical field. But this is another vain hope..","date":"2014-06-02","mins":"12:15 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126560","author":"andrea_nicolotti","post":"Where Nikephoros Kallistos reported that Empress Pulcheria placed burial linens of Christ in Blachernae church?.","date":"2014-06-03","mins":"3:47 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126572","author":"andrea_nicolotti","post":"O.K, with your last answer you make clear, if still necessary, the difference between an historian and a sindonologist. If you are not able to read a language, do not speak about this language. If you are not able to find a document, do not quote that document. If you have not seen it, do not speak about it. If your papers are based on internet, books based on other books or unreliable sources (and, in case of Centini, very unreliable), do not write papers. You are not obliged to do it. You can love the Shroud and believe in God also without writing pseudo historical papers (like this one you have linked). Please, there’s no need to take offence, but this is why the sindonology, and in general this christian apologetic, is detrimental. Any discussion is totally useless, with you and 99% of other sindonologists that do what you do..","date":"2014-06-03","mins":"4:28 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126735","author":"andrea_nicolotti","post":"Mike, answer to your questions: 1) Centini is unreliable because I know him and his books, and he does not any analysis of the sources, but only copies from other books. He is not an expert, is an author of popular books based on secondary sources. A sort of populariser. So, he read this false statement about Kallistos in a book of sindonology, he did not check any primary source and just copied it. O.K read the book of Centini and copied it. And so on, from one to another book, without end. As I have just written, I found this error the first time in a book of sindonology in 1910 and now we, in 2014, are still here at the same point. 2) My 99% comes from my experience, because I have read several hundred books and articles about Shroud, and 99% are written with the same technique: repetition, recopying and guessing. 3) You ask me if I have any primary source. Obviously yes. But your question is misleading. OK wrote a statement based on a byzantine source, I asked the source and he admitted that never saw the source. You must ask him or Centini the source, not me. I am not the author of the statement. 4) My problem is not O.K. Or Centini or any other person, is all the method sinonologists use 5) “Gibberish” means “unintelligible or meaningless language”. But my language is very intelligible: if you are not able to read a language, do not speak about this language. If you are not able to find a document, do not quote that document. If you have not seen it, do not speak about it. Very clear. Not gibberish, nor ad hominem attack. A simple rule of historical method. Rule number one. If you want to learn German, and your teacher does not speak German, you can tell him that if the wants to be a teacher of German, he must know German. It is not gibberish, nor ad hominem attack. It is common sense..","date":"2014-06-04","mins":"6:58 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126853","author":"andrea_nicolotti","post":"“I do not say that Centini is unreliable as an author, but he can hardly be ranked as a specialist in ancient Byzantine history”. This is said with charity. You are very kind. Surely, if someone writes 13 books in a year, I do not have charity for him..","date":"2014-06-04","mins":"5:38 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126744","author":"andrea_nicolotti","post":"Mike, your answer is very appropriate. Centini is perfect, O.K. Is right, you too, I am a sinner I have a log in my eye, and today is cloudy. Ciao.","date":"2014-06-04","mins":"7:27 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126863","author":"andrea_nicolotti","post":"Nicephoros in Historia ecclesiastica XIV,2 nd XV,14 speaks about the translation at the Blachernae of the burial bands (ἐντάφια σπάργανα) of Holy Mary by Empress Pulcheria. The chapters I.32 33 you quoted (from Centini) do not speak absolutely about Blachernae in any form..","date":"2014-06-04","mins":"6:21 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-127011","author":"andrea_nicolotti","post":"Obviously. If not, I would not have said it.","date":"2014-06-05","mins":"7:26 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-127023","author":"andrea_nicolotti","post":"You can find the text in Migne, PG 145 147. All Migne is online. To your question about how the misconception with Jesus’ burial linens might have arised, the answer is that as sindonologists want to find the Shroud of Turin at the Blachernae, they are inclined to force the history to put it there. And as they normally do not check their sources, misconceptions can survive for many many many years..","date":"2014-06-05","mins":"8:41 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-127113","author":"andrea_nicolotti","post":"145: https://archive.org/details/patrologicursus11migngoog 146: http://books.google.it/books?id=mp NBAAA Ac AAJ&redir esc=y 147: http://books.google.it/books?id=r Ie6 FD Ueeg8 C&redir esc=y Irrilevant, not irrilevant… it is the method that does not work. This was only an example. Also the page you linked (https://shroudofturin.files.wordpress.com/2014/05/burial linens of constantinople.pdf) is constructed with the same method, without serious quotations, without checking the texts, without any knowledge of the scientifical literature. Sindonologists and internet are the only source for you, it seems. The few texts quoted in Greek and Latin sometimes are wrong, sometimes the translation does not correspond to the original. It seems that you have no idea about this matter. And also, there is lack of critical approach to the texts. It seems that you are like me, if I try to write a paper on astrophysics…. Obviously, all people sometimes is wrong, and I am too… but this is not question of oversights… At the end, you can do what you want, but when I see that this is the normal standard for sindonologists, in the last century, I can say and repeat that 99% of sindonology is detrimental. P.S. What Kallistos said is not so important, because if we have not other earlier sources, his statements about what Pulcheria did nine centuries before are very questionable.","date":"2014-06-05","mins":"4:34 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-127248","author":"andrea_nicolotti","post":"My aim is not to refute your paper. I have tried to explain that I consider your method unreliable, so from my point of wiew it is useless to start discussions about papers written in such a style. I think that now we have clear our positions, and we can draw our own conclusions. Thank you for the discussion..","date":"2014-06-06","mins":"5:59 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-127275","author":"andrea_nicolotti","post":"1) I know that you try to perform critical analysis of whatever you have, but I think that you cannot do it properly, because you have not methodology, knowledge and means. And I am not saying that you DELIBERATELY falsifies the texts. It is not question of volition. The “critical analysys” of historical sources is not something you can “try” to do. It is the result of long academical studies and practice, everyday. If we (historians, philologians) exist, there is a reason, or not? Or if we have not reason to exist, and all people can do what we do with succes, this could be applied also to ALL professions: doctors, engineers, physicists, chemists … 2) Yes, I refer to your paper. The Greek text is wrong, the translation is not consistent with the text, the Latin text is quoted in an uncorrect way. 3) Surely I am irritating. Because I am a little brusque, and English is not my language, nor my preferred language. But if you want to believe me, I assure you that I am a very peaceful and understanding.. Not on blogs, perhaps. But prejudiced, NEVER. What I say is not fruit of prejudice, is fruit of years passed studying and reading sindonological literature. I am post judiced, not pre juidiced. The judgement of the work of others is part of my job. It is an obligation for me, not a caprice.","date":"2014-06-06","mins":"7:53 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-127284","author":"andrea_nicolotti","post":"<<<<<The Greek text is from Scavone and the translation is his own paraphrase. <<<< This is not a justification, is another proof that your work is only a work of recopying. And when you copy wrong things, you are not capable of realizing that they are wrong.","date":"2014-06-06","mins":"8:29 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-127287","author":"andrea_nicolotti","post":"Web sites and books of sindonology are not adequate “sources”. Your paper is not “scientific”, surely, but it is not correct, too. I think that the only proper thing you can do is cancel this paper from internet, because we have just on the web a lot of uncorrect informations, and we do not need one more (that will be read, linked, quoted, etc. Etc.). If you want to conserve it, don’t ask me to make it a little less uncorrect. It is contrary to my principles of seriousness, I am sorry.","date":"2014-06-06","mins":"8:40 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-127318","author":"andrea_nicolotti","post":"I do not believe that it could be a good lesson for you “poor, naive, copying everything sindologist”. The only good thing that, in my opinion, you could do, is to cancel a lot of pages from your “Apologetyka” websites. But I am sure you are not going to do it. So, what you call “a good lesson”, it is only the occasion for you to correct some mistakes, without changing the general approach of your website, that I do not approve at all. So, I will not help you to improve something I do not consider improvable. At the contrary, I hope that someone, reading your site and seeing the mistakes, realize earlier and easier that it is not unreliable. Again, it is not because of you, it is because of what I consider my seriousness. When some days ago I said that 99% of sindonologists make history as you do, someone said that I am not objective. So, if it is true, you will find a lot of sindonologists with perfect knowledge of Latin, Greek and ancient sources that shall help you to correct all mistakes, without asking me, “prejudiced or irritating skeptic”, as you called me..","date":"2014-06-06","mins":"12:07 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-127323","author":"andrea_nicolotti","post":"[that it is not unreliable = that it is not reliable].","date":"2014-06-06","mins":"12:25 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-162045","author":"andrea_nicolotti","post":"I think Fanti (even if he is not head of any departament, and cannot be it) is a sindonologist very useful and necessary. When I need to explain what is sindonology, I tell what Fanti believes and all understand immediately..","date":"2014-10-13","mins":"2:17 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","title":"\"Just the facts, ma’am.\""},{"id":"comment-162095","author":"andrea_nicolotti","post":"Courage? Shroud haters? Be man? : ))))) Mah…..","date":"2014-10-13","mins":"5:10 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","title":"\"Just the facts, ma’am.\""}],"forensic":[{"id":"comment-184249","author":"andrea_nicolotti","post":"What Flavia shows are not flagra nor Romans: they are decorations of Italic provenance, or objects for hanging something, or weights for scales, as it was showed by archaeologists almost 100 years ago, and as I have showed in a conference in Turin on 2 march 2013. It is strange that in Vatican museums did not explain to Flavia that what they store (closed in a wardrobe) are not flagra, and also probably they are modern “pastiches”: when I was there on 2012, they knew it..","date":"2015-01-18","mins":"6:11 am","url":"https://shroudstory.com/2015/01/18/a-number-of-marks-falling-all-over-the-surface-of-the-body/","cat":"history","title":"A number of marks falling all over the surface of the body"},{"id":"comment-184254","author":"andrea_nicolotti","post":"What does it mans “independent confirmation”?.","date":"2015-01-18","mins":"6:25 am","url":"https://shroudstory.com/2015/01/18/a-number-of-marks-falling-all-over-the-surface-of-the-body/","cat":"history","title":"A number of marks falling all over the surface of the body"},{"id":"comment-184268","author":"andrea_nicolotti","post":"No, because the acts were not published. I have photos of that day and an audio recording… in Italian. I will publish it, soon or later.","date":"2015-01-18","mins":"7:48 am","url":"https://shroudstory.com/2015/01/18/a-number-of-marks-falling-all-over-the-surface-of-the-body/","cat":"history","title":"A number of marks falling all over the surface of the body"},{"id":"comment-125464","author":"andrea_nicolotti","post":"Hugh, the handle of twisted, metal chains and metal bell shapes of this very old dictionary is not a flagrum and it is not copied from a real, original object. It was copied from another book of the XVIII century, that made confusions between flagra and Italic decorations for people or horses. Old news, indeed. About it, and in general about flagra, I will write extensively in a chapter of a new book..","date":"2014-05-29","mins":"7:25 am","url":"https://shroudstory.com/2014/05/29/and-more-still-on-the-roman-flagellum-and-flagrum/","cat":"flagrum","title":"And More Still on the Roman Flagellum and Flagrum"},{"id":"comment-125475","author":"andrea_nicolotti","post":"Thank you, Dan. But the chapter about the flagra is not in that book..","date":"2014-05-29","mins":"8:01 am","url":"https://shroudstory.com/2014/05/29/and-more-still-on-the-roman-flagellum-and-flagrum/","cat":"flagrum","title":"And More Still on the Roman Flagellum and Flagrum"}],"history":[{"id":"comment-45788","author":"andrea_nicolotti","post":"No, is the blood that flowed from an image of the crucifix in Beirut.","date":"2013-09-29","mins":"6:00 am","url":"https://shroudstory.com/2013/09/29/blood-from-a-picture-of-christ-links-to-the-shroud/","cat":"history","title":"Blood from a picture of Christ: Links to the shroud?"},{"id":"comment-45806","author":"andrea_nicolotti","post":"Yes, all is “una traccia del passagio della Sindone” da ovunque a ovunque uno vuole..","date":"2013-09-29","mins":"9:33 am","url":"https://shroudstory.com/2013/09/29/blood-from-a-picture-of-christ-links-to-the-shroud/","cat":"history","title":"Blood from a picture of Christ: Links to the shroud?"},{"id":"comment-78839","author":"andrea_nicolotti","post":"Max Patrick Hamon : An Italian specialist, Andrea Nicolotti, has proposed that the locution “ Ecce suaire Jesu Christi” ou “Here is the shroud of our Lord Jesus Christ” [Nicoletti totally missed the U in Gothic script with E embedded within and the “h” in Gothic script in JHV!] As I said in another thread, I do not see any U. So, I remain with the “ecce suaire Iesu Christi” that I proposed in january 2013. But it is a suggestion. Your suggestion “vergy” and “Charny” could be interesting, if the V or U could be seen..","date":"2014-02-12","mins":"8:59 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-79901","author":"andrea_nicolotti","post":"Excellent Mr. Max Patrick Haman, I’ll asap answer to your posts. No, I have not published any article about “carved Gothic script”, but I will read all articles you wrote about it. I wait for the references. And also I wait for examples where the colon “:” is a contraction for NOSTER DOMINVS. All these references, Mr. Hemon, could be useful for my “homework”, as you call it Thank you. Your Italian “not specialist”..","date":"2014-02-16","mins":"9:17 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-94739","author":"andrea_nicolotti","post":"Mr, Hamon, I cannot find your article because the publication “Loches, Graffiti anciens, “QUATRIEME RENCONTRE 2006” is practically impossible to find. And it is not exactly the kind of publication I had imagined. No problem. It is not important. I still wait for: 1) an example of the “dual letter” (an E within a U). 2) the colon “:” as a contraction for NOSTER DOMINVS. Thanks.","date":"2014-03-29","mins":"8:43 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-171188","author":"andrea_nicolotti","post":"I remember also that the only serious study about the textile structure of the Shroud DONE BY AN EXPERT OF HISTORY OF TEXTILES is still G. Vial, Le Linceul de Turin. Étude technique, in «Bulletin du Centre International d’Études des Textiles Anciens» 67 (1989), pp. 11 24; Id., À propos du linceul de Turin, in «Bulletin du Centre International d’Études des Textiles Anciens» 69 (1991), pp. 34 35; Id., À propos du Linceul, in «Montre nous ton visage» 10 (1993), pp. 27 30. The first part was also translated in English in «Shroud Spectrum International» 38 39 (1991), pp. 7 20..","date":"2014-11-14","mins":"6:37 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"},{"id":"comment-171181","author":"andrea_nicolotti","post":"Hugh, the difference between herringbone and chevron, in the textile language AMONG HISTORIANS OF TEXTILES is not what you say. Herringbone is used to identify a kind of chevron, a “warp chevron” (as in the shroud). But as “herringbone” is not so well accepted in scientifical language, it is better to say, describing the shroud, “chevron twill” or “warp chevron twill”. What you call herringbone, defined by the alternate staggers of the weft threads, must be called “broken chevron twill” (that could be either a warp chevron or a weft chevron). I know that the matter is complicated, but the language among historians and among experts of MODERN weawing is not the same..","date":"2014-11-14","mins":"5:29 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"}],"image":[{"id":"comment-172533","author":"andrea_nicolotti","post":"Please, we want pictures of it!!!!.","date":"2014-11-22","mins":"9:28 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-186412","author":"andrea_nicolotti","post":"Piero, I do not know why you are amazed. The UTET’s book was sold for 3790 euros (=4270 US dollars), so a normal person will not buy it. It is one of those books that are a piece of art rather books. The texts inside have nothing new or special. The images, very nice, are not useful for research and are printed. So that book with those images cannot be used for scientifical purposes..","date":"2015-01-26","mins":"11:05 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers"},{"id":"comment-172538","author":"andrea_nicolotti","post":"Excuse me, John, but… I asked for pictures of Hugh in his laboratory! : ).","date":"2014-11-22","mins":"10:34 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-186426","author":"andrea_nicolotti","post":"“”I say Dr. Nicolotti is just the man to set about liberating Halta’s 72 GB of HD image data from the grasping hands of its over possessive custodians””””. Just tried, and failed. “””Didn’t he say not so long ago that he lives just a few blocks from where the TS is housed?””” 120 meters..","date":"2015-01-26","mins":"12:39 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers"},{"id":"comment-186201","author":"andrea_nicolotti","post":"Mario, I must add a point 3: 3) Turin authorities want to be payed for any use of their images, even if in a low definition..","date":"2015-01-25","mins":"2:04 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers"},{"id":"comment-186431","author":"andrea_nicolotti","post":"In person.","date":"2015-01-26","mins":"12:58 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers"},{"id":"comment-186120","author":"andrea_nicolotti","post":"The reason is not technical. The Turin’s diocese (in agreement with the Holy See, perhaps) does not want to allow the circulation of high definition images of the Shroud. And Haltadefinizione (who made the images freely) cannot share nor sell his images without the authorization of the the Turin’s diocese. The diocese does not allow researches to be conducted on the shroud without their authorization, and to see the images is considered research. So, practically, the original images of Haltadefinizione are useless because they remain closed in their computers, and will remain so. This is not my speculation..","date":"2015-01-25","mins":"5:23 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers"},{"id":"comment-186421","author":"andrea_nicolotti","post":"Colin, I know someone at the Lincei Academy, but… if they do not want to give the images, so… they will not give them. They give not the images to sindonologists, and do you think that will do this with an indipendent academy? The problem is only one: on 1946, end of the Italian kingdom, the State forgot (or avoided) to confiscate the Shroud. So,if the pope is his owner, the scientifical academy has not possibilities to be heard. As the Shroud is owned by the Church, the scientifical problems are a detail of secondary importance..","date":"2015-01-26","mins":"12:15 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers"},{"id":"comment-186128","author":"andrea_nicolotti","post":"For the resolution, see the camera they used. Http://en.wikipedia.org/wiki/Nikon D3 For the rest, all is coherent: no seeing the shroud, no seeing images of the shroud, no studying the shroud, etc. Etc..","date":"2015-01-25","mins":"6:05 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers"},{"id":"comment-186156","author":"andrea_nicolotti","post":"Many of them find themselves increasingly left out of discussions and much research, but really they like it, because they think that… there is not discussions and research. I think so, because discussions and researches about the Shroud while the Shroud is closed in a casket, are often fantasies, hopes, conjectures, like discussions about Atlantis..","date":"2015-01-25","mins":"8:55 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers"}],"misc":[{"id":"comment-55934","author":"andrea_nicolotti","post":"Probably tomorrow morning (4 december) the Archbishop of Turin will announce the new exposition of the Shroud in 2015.","date":"2013-12-03","mins":"6:17 pm","url":"https://shroudstory.com/2013/10/04/breaking-news-speculation-leaks/","cat":"news_&_views","title":"Breaking News? Speculation? Leaks?"},{"id":"comment-182193","author":"andrea_nicolotti","post":"I can say how is in Italy. All images of the Shroud are under copyright. If you want to publish it, you must ask the commettee for the shroud in Turin. They ask you why you want to publish them, and a summary of the book or article where you want to publish them (a summary of the book, the index, etc.). They read it and if they agree, they sell you the image. The only allowed source, are the photos of Gian Durante. They ask you how many pictures, the size, the nature of your publication, the diffusion, etc. My editor asked an image for my next book. For an image of the shroud to be printed in a page of a book, not in very high definition, they asked 300$ (american dollars). Gian Durante asked 155$ to send the image. Total: 455 $. My editor was very surprised. For the other pictures of the book, he payed between 60 and 90$. For this, I told my editor to refuse and print the book without the image of the shroud. But he considererd it impossible. After some insistences, the commettee kindly sold the image for 235 instead of 300 $. (300+155 = 405$) Before this experience, I imagined that the pictures of the shroud are free. P.S. A picture (not of the shroud) was provided by Schwortz, freely, I think, or almost freely..","date":"2015-01-09","mins":"12:35 pm","url":"https://shroudstory.com/2015/01/09/photographs-of-the-shroud-and-copyright/","cat":"news_&_views","title":"Photographs of the Shroud and Copyright"},{"id":"comment-191260","author":"andrea_nicolotti","post":"Same day:.","date":"2015-02-17","mins":"6:06 am","url":"https://shroudstory.com/2015/02/17/picture-for-today-1969/","cat":"other_sites","title":"Picture for Today: 1969"},{"id":"comment-82290","author":"andrea_nicolotti","post":"Too old. Carpinteri on 2013 has been removed from his position at the INRIM..","date":"2014-02-25","mins":"7:25 am","url":"https://shroudstory.com/2014/02/25/some-perspective-on-alberto-carpinteri/","cat":"news_&_views","title":"Some Perspective on Alberto Carpinteri"},{"id":"comment-174099","author":"andrea_nicolotti","post":"Hugh, I repeat again: the history of Othon de la Roche was invented in the fist half of 18th century by a priest in Besançon, manipulating and inventing sources, for the shroud of Besançon that was a copy of the shroud of Turin made in 1523 circa. Sindonologists are able to: 1) believe to the forger; 2) tell that the Shroud of Beançon was present in Besançon in the middle age, that is an invention made without documents; 3) conjecture that in the middle age the shroud of Besançon was the Shroud of Turin. They love mix histories of different relics (e.g. Mandylion/shroud).","date":"2014-12-01","mins":"5:26 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174196","author":"andrea_nicolotti","post":"No, no English journals. A deep analiysis of the “Othon forgery” will be published soon, in French: http://www.franche bourgogne.fr/pages/les publications.html I understand that if people knows only English, most of the literature about the shroud remains unknown to them (and the best things are published in Italian and French). But I am not sure that the language is the very problem….. I have written an entire book in English about the Mandylion and the Shroud, that is the most deep and complete ever written on the subject… and remains ignored among sindonologists.The best they did was to publish on the BSTN a distorted review written by a sindonologist without any competence on the matter …. —— As for Besançon. I do not understand how can you say that what I think “is not backed up by clear documents”. Is the contrary. Is what some say (i.e. The shroud was taken by Othon on 1204, arrived in Besançon, remained there until 1350, was copied ans stolen by Geoffro de Charny or his wife) that is not backed up by clear documents. In reality, is not backed by ANY document. It was invented, the first part on 18th century (by someone that believed that the Besançon shroud was authentic, and the Turin shroud… also!), the second part on 1902. I cannot make out, really, how it is so difficult to understand this. Paul Vignon, the father of sindonologists, a century ago explained why the “Othon theory” is based on a UNIQUE source, late, incoherent and manipulated. Zaccone, director of the museum of the Shroud in Turin, did the same 30 years ago. Even without my book – that will explain HOW the forger invented the history on the beginning of 18th century, and WHO is the forger – it is obvious that the “Othon history” is false. But… as Piana and Scavone still continue to believe in this, people continue to follow them. I am sure that Scavone and Piana never read and studied the “sources” they follow. What we are talking about? It seems that here all is considered true, all legends, forgeries, inventions, conjectures, fantasies, fires, disappaerances, substitutions (only when they support authenticity, obviously). The critical attitude never arrived?.","date":"2014-12-01","mins":"1:53 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174216","author":"andrea_nicolotti","post":"“I hope they can ship outside Europe” If not, I’ll send it to you. “it is not clear which Italian book is being translated” There is not an Italian book. As the manuscript is in French, and the Shroud is French, it seemed to me useless to do an Italian book. So, I have transcripted the manuscript, and I have written an introduction and commentary in Italian (or in “my” French) that was translated in French or corrected to make the book. “I will read it, although it appears quite time consuming to do so” You can do it, but maybe is better if you wait for my transcripion, that is complete and easy to read. Only a very little part contains what concerns Othon and the Shroud. All the rest is…. Very boring. “Your English book of the Mandylion: the problem is the price. I can’t see why it is priced so high”. Because is published by Brill. And Brill is expensive, I know. But they asked me to translate my book, and I said yes. I am not happy of the high price. “As you wrote, some documents say that Othon de la Roche sent the Shroud to Besançon” Not SOME documents, but ONE document: this manuscript 826, of the 18th century. You are right, is not so easy to explain all, and here, and in English. But the question, as I said, was just explained many years ago: the author of this treatise, in 18th century, said for the first time that Othon had a shroud (500 years later the 1204), when until that moment ALL historians in Besançon said that the Shroud arrived in Besançon some centuries before and by another way (all ignorant?). He quoted some sources, declaring that these sources attribute to Othon the translation of the Shroud. But it is not true, they did not. He manipulated them in a evident and also shameful. He is very ignorant, and for example says that a certain historian was at Constantinople on 1204, when the historian was born AFTER 1204. And so on. For that, Vignon and Zaccone (they are not “Skeptics”) understood that the manuscript 826 was written by someone who INVENTED the link between Othon and the Shroud, to defend his shroud (a normal painting). Now I have identified the author and the sources he manuipulated and falsificated, but, I repeat, it was enough what Vignon and Zaccone wrote to have a correct idea about the problem. My questions remain not answered: 1) documents before 16th century saying that in Besançon there was a shroud with an image of Christ; THEY DO NOT EXIST 2) documents before 16th century saying that in Besançon there was a shroud; THEY DO NOT EXIST 3) documents before 18th century (i.e. Before the forgery of the 826 manuscript of Besançon) saying that Othon de la Roche had a shroud. THEY DO NOT EXIST I add: documents between 1204 and 18th century describing the liturgy in Besançon, the relics in Besançon, the decisions of the chapter in Besançon: YES, THERE ARE MANY, but without any shroud. Because the shroud in Besançon was painted on 1520 circa. This is not question of subtle interpretation and analysis, is only normal exegesis of the sources..","date":"2014-12-01","mins":"5:39 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174350","author":"andrea_nicolotti","post":"Mario, when you will come in Turin let me know. My house is 30 seconds walking from the chapel of the Shroud.","date":"2014-12-02","mins":"7:06 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173431","author":"andrea_nicolotti","post":"Where is this church and this windows? Do you have images?.","date":"2014-11-28","mins":"6:32 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173433","author":"andrea_nicolotti","post":"Charles, the painting by Pierre d’Argent they sent you… is not made by Pierre d’Argent, but by Jean de Loisy. Do you know how much is necessary to pay to publish it?.","date":"2014-11-28","mins":"6:40 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173484","author":"andrea_nicolotti","post":"The image was partially published by De Vregille some years ago.","date":"2014-11-28","mins":"12:38 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174675","author":"andrea_nicolotti","post":"Aljone, I have to do a little correction: it is not true that STURP team did not want C14 testing. They asked it. Look at this communicate of the STURP (october 8, 1981): https://www.shroud.com/78conclu.htm All shroudie websites with this text have suppressed from it a sentence: “No carbon 14 measurements have been done. Unless and until permission is given to use part of one thread of the Shroud, such an essay must wait”. They tried to do it. Now, they prefere forget it, and cancel the sentence..","date":"2014-12-04","mins":"7:19 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174908","author":"andrea_nicolotti","post":"Aljones909, the methods used by STURP did not include radiocarbon dating because many people observed that the piece of cloth necessary for the test, before the invention of the AMS method, was too big. Sox and Mc Crone personally tried to persuade Turin to give them a piece, but they failed. The decision in Turin was responsability, first of all, of the archbishop and of the chapelan of the past king Umberto, mons. Pietro Caramello. He consulted a professor of our university, and he gave negative answer. Don Piero Coero Borga of the Centro Internazionale di Sindonologia had the power to suggest, but not to decide. The STURP participated in the preparatory meetings for the radiocarbon dating of 1988 and he also wanted to participate materially to the test. What I meant is that it is not true that the STURP was against the radiocarbon dating. The suppression of that phrase about the radiocarbon from the STURP communicate (see my other post) only means that before the results they were friends of the carbon, after the result became enemies.","date":"2014-12-06","mins":"7:52 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174911","author":"andrea_nicolotti","post":"“We can conclude for now that the Shroud image is that of a real human form of a scourged, crucified man. It is not the product of an artist”. This is not too neutral.","date":"2014-12-06","mins":"8:12 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173491","author":"andrea_nicolotti","post":"Http://larocheusa.org/Besancon.htm This page contains a lot of mistakes and inventions. Bad work.","date":"2014-11-28","mins":"1:33 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173579","author":"andrea_nicolotti","post":"It is not “subjective point of view”, it is “a lot of mistakes”. If there are several other similar examples asserting much the same, is because people love copy from other and repeat, without studying. And it is troubling that ALWAYS people who study is asked to demonstrate, whereas people who copy and invent not. However, only FEW things: 1) Othon de la Roche was not “a prince of Morea”. 2) he did not “sent some type of shroud in 1208 to his father”, because his father on 1208 was dead. 3) “history first records a shroud (most think it was a painted copy) on display at Besançon before 1349”. But is not said that it was not a “shroud”, but a white neckerchief without image. 4) “Then it was out of public view for about 3 years, because the former Cathedral at Besançon was struck by lightning”. False. 5) “When the fabric returned to public view, the shroud shown at Besançon was clearly a painted copy”. We have no ONE reliable source saying that after the fire a painted shroud was shown. 6) “Jeanne de Vergy, a direct descendent of Otto”. No, Jeanne de Vergy was not a direct descendent of Otto. 7) “[…] was the first to publicly display the Shroud of Turin in the 14th Century”. No sources saying that. 8) “In 1389, the Shroud went to another family member (Margaret)”. False. 9) “Interestingly, the burn marks on the original Saint Suaire come from a cathedral fire”. Invented. 10) “It is thought, but not proved, that”…., funny. 11) “a shroud of some type was on display at the Chapel of the Holy Shroud in Saint Etienne”. Yes, but after 1523 (in reality, there was not any “Chapel of the Holy Shroud” in Besançon before 1748). 12) “It is then thrown into a fire, from which it did not escape”. Invented. 13) “One may find a representation of it on a window in the chapel of Pérolles in Fribourg”. The chapelle of Perolles has a painting of the Chambéry Shroud, and shows both sides of Christ. It is obvious, as the Shroud of Besançon with image was displayed first time on 1523. Because, I have said many times, the Shroud of Besançon did not exixt on middle age. It is enough?.","date":"2014-11-29","mins":"6:08 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173652","author":"andrea_nicolotti","post":".","date":"2014-11-29","mins":"5:00 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173665","author":"andrea_nicolotti","post":"<<<<<<<principal authorites he cites seem to be: 8 See Chifflet (1624); Vignon (1902, 64 76); Fr. Paul de Gai (1973); and Dorothy Crispino (1985). 9 M. Buttigieg (1990); Bro. Hilary de Crémiers (1991); Michel Bergeret in CIELT (1993); and now Alessandro Piana in BSTS Newsletter (2007). See also Piana, Sindone: gli anni perduti (2007).<<>>Around 1206 or 1219, Othon de la Roche arranged to ship the Shroud… We have proofs and documents? >>>>Jeanne de Vergy, concerned that at Besancon the Shroud was under threat…. We have proofs and documents? >>>> wrote that in 1377 it was miraculously discovered in a niche in the new cathedral… We have proofs and documents? >>>>Besançon’s own historian Dom François Chamard (1902) agreed–though… We have proofs and documents? >>>>>the copy was commissioned by Jeanne de Vergy to replace the Shroud ….. We have proofs and documents? ————— The romance invented by Chamard and reproposed by Scavone and Piana is very funny, but remains a romance. They have not a shred of document saying what they believe. I am still waiting for a document before 16th century saying that in Besançon there was a shroud with an image of Christ. I am still waiting to pass the first floor, and other people believe to be at the top of the building. Always the same problem: they WANT to put a Shroud in some place, so they invent where. First lesson of history: do not invent..","date":"2014-11-29","mins":"6:50 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173765","author":"andrea_nicolotti","post":"Daveb, I do not understand why we need to change the historical method and write useless words about Africa and bla bla….. To make a gift to sindonologists. I ask very very simple questions: 1) documents before 16th century saying that in Besançon there was a shroud with an image of Christ”; 2) documents before 18th century saying that Othon de la Roche had a shroud. Answers: 0. If you believe that, without this, you can INVENT…. I do not know what I can do. You are wrong. The game is over. But is over with this “conclusion”: “Sindonologist believe that it is correct and possible to invent a medieval history of the Shroud of Besançon without proofs, because they want this”. It is enough for me. Clear. Yves Delage and Frederik Zugibe (the first one was not a medical forensic pathologists) have nothing to do with this. You want to believe that the 1349 fire (1350, indeed) at St Stephen’s destroyed documents? If it is true, if the fire destroyed them, and if you have not seen them, you cannot INVENT them. But, I inform you, fires are the customary pretext for forgers. And I am not so exigent with you: I ask not only medieval documents before the fire, but also documents AFTER the fire. We have a lot of historical and liturgical documents in Besançon AFTER the fire (and also BEFORE). We have liturgical books with the fests celebrated in Besançon. We have the books with the deliberations of the chapitre. We have many books and documents. Where they mention a shroud? Your argument “what little might have remained in the region was dispatched by the French Revolution” is weak, because all historians in Besançon that tried to write the history of their Shroud BEFORE the French Revolution did not find documents (obviously, they did not exixt) and choosed to INVENT like you do. But they invented other things: that Shroud was brought there by Aelia Eudocia or Licinia Eudoxia or Galla Placidia. No crusades, no Othon. Who invented better? Scavone and Chamard in XX century or D’orival and Gollut in XVII century? Why Scavone is right and D’Orival not? Because the last one is right? So, if I invent something about this I’ll become right? I inform you that on XVI century the history invented by D’Orival was considered “opposite to the truth and history” by Chifflet, but “consistent to the tradition” by the chapter of the cathedral of Besançon. Who is right? And why we do not see here any De la Roche or Vergy? You think that Scavone is better informed than Chifflet? Now I want to know why your invention is better than other inventions, in the past or the future, about the shroud of Lirey. We have a lot of possibilities. You propose a new history “believe what you want”? Better if in universities professors of history leave the place: we can engage novelists and comic strip artists..","date":"2014-11-30","mins":"5:58 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173789","author":"andrea_nicolotti","post":"Oskar, I do not want to start discussions with you, but the letter of Theodore Angelus is a forgery, and does not make the name of Otto nor tell something about shrouds with images or shrouds in Besançon, and the 18th century MS 826, as we know, was written 500 years after, and it is a falsification of medieval sources, as Vignon, Zaccone and other know and explained many years ago..","date":"2014-11-30","mins":"8:08 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173790","author":"andrea_nicolotti","post":"Hugh, can you show the letter of the Emperor Alexius V Mourtzouphlus to Pope Innocent III, specifically complaining that the Holy Shroud had been stolen by Otho de la Roche?.","date":"2014-11-30","mins":"8:11 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173793","author":"andrea_nicolotti","post":"<<<<<Why don’t you want to discuss with me? Because I know that our ways of thinking are too much different, so in our discussion it is impossible to find a common point of starting. And normally you do not have informations that I do not know, so I do not learn from you. Therefore, our discussion is useless. And, as I have just said, I do not consider a blog a place for deep discussions, but only a place to share informations. I give some informations, and people can use them as they want. And sometimes I learn something form other people..","date":"2014-11-30","mins":"8:31 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173798","author":"andrea_nicolotti","post":"I have just answered to this. “When the letter [from De Angelis Family] was forged, the forger was inspired by the histories of the Shroud of Turin written in his times, after Pingone [1581] that for the first time said that Marguerite de Charny was a GREEK noble woman; that, we know, was false, but repeated for a long time” in all the books about the Turin Shroud. So, it was natural for the forger put the shroud in Athens. This is the first possibility. The other one, less probable, is that the forger read the book of Dunod de Charnage (1750) and his followers, where was written that a shroud was translated to Athens on 1204. So, he did’nt know the manuscript 826, but its printed summaries. But, I repeat, this is less probable..","date":"2014-11-30","mins":"8:56 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173804","author":"andrea_nicolotti","post":"Concordances in modern forgeries are not strange nor extremely improbable. That Otho had a shroud, I remember, was invented on the first half of 18th century, AGAINST the tradition known in Besançon until that moment, and FALSIFICATING medieval sources. But you believe on it. The coffer. It remembers to me the history of Napoleon and his bed in a town near my house. In north of Italy many villages share the tradition that Napoleon slept one night in a house of the village. All villages wnat this privilege, but If they are all righy, it means that Napoleon slept all his life, day and night, changing everyday a bed. One day I was in a little “castle” in Piedmont where the owner, showing us a room with a 18th century bed, said that “Napoleon slept there”. And I said to him: “But we do not have any document saying that Napoleon went in this village, nor that slept here!” And he answered: “Oh yes, he did it. The bed is the proof”. This is like your coffer and the shroud..","date":"2014-11-30","mins":"9:22 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173811","author":"andrea_nicolotti","post":"If your historical methods (only yours) are right, ALL medieval shroud (by dozens) are authentic, because all have modern documents forges stating their authenticity. And Napoleon slept everywhere. Do you see why is useless our discussion?.","date":"2014-11-30","mins":"9:47 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173818","author":"andrea_nicolotti","post":"“exposing your intellectual dishonesty “. Mr. Anonymous, and courageous, for me the discussion with you is over, not only because I loose my time, but also because I do not accept this kind of judgment, and from someone that has not idea about what he says. You can continue your apologetic without me. You will seem also more informated. It is a gift for you. ——————— If someone has an answer to my questions, I remain here waiting. 1) documents before 16th century saying that in Besançon there was a shroud with an image of Christ; 2) documents before 16th century saying that in Besançon there was a shroud; 3) documents before 18th century (i.e. Before the forgery of the 826 manuscript of Besançon) saying that Othon de la Roche had a shroud..","date":"2014-11-30","mins":"10:11 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-198256","author":"andrea_nicolotti","post":"Do you see me in this picture?.","date":"2015-05-04","mins":"4:30 am","url":"https://shroudstory.com/2015/05/04/tweeted-picture-for-today-are-we-there-yet-almost/","cat":"2015","title":"Tweeted Picture for Today:  Are We There Yet? Almost!"}],"opinion":[{"id":"comment-157762","author":"andrea_nicolotti","post":"The signature of Giotto is much more visible than Jewish coins. Http://www.nannimagazine.it/ resources/ documents/Uploaded Files/File/sacrasindone%281%29.pdf.","date":"2014-09-29","mins":"3:52 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-157771","author":"andrea_nicolotti","post":"Capricious? You do not see “Giotto”?.","date":"2014-09-29","mins":"4:36 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-157790","author":"andrea_nicolotti","post":"You remember Piero Ugolotti, the father of the inscriptions on the Shroud? People do not know that he saw also the decrees of condemnation issued by Pontius Pilate nailed on the face of Christ. And the nails would have been stuck in the eyes, causing the leakage of aqueous humor..","date":"2014-09-29","mins":"6:58 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-157980","author":"andrea_nicolotti","post":"«If we follow the thread of his pseudo demonstration, the very face of the TS man should be not on the shroud either and should be nothing else but a pareidolia»….. I do not comment this statement because is clearly nonsensical. And the negative pareidolia does not exist. In fact, the discussion on this topic is useless, and my intervention is also useless. I am convinced that I am not able to discuss with people who see flowers, coins, and other things on the shroud, and also with those who see the Shroud in the code Pray. It seems pointless to me to discuss what I consider the evidence. Simply, my brain works differently and so there is no chance that I can discuss on this topic. I have to shut up. P.S. Ugolotti showed to Marastoni his manipulated photographs, and Marastoni tried to read. Then Messina has manipulated other photographs and tried to read Hebrew words; showed them to father Orecchia, and also Orecchia tried to read them (but today he has changed idea about it….) Then Marion did the same. Then Frale did the same. Then Castex and Ventutini. Then arrived Giotto. Then Leonardo da Vinci (but sindonologists don’t like this kind of inscriptions, they see only Hebrew, Latin, flowers and coins from Jerusalem). If you want, I can read letters too. I also read the clouds, but I do not think that what I read is real. My mother saw many other things on the shroud, she is very imaginative. You do not need a palaeographer, because a palaeographer reads what is visible, and no one doubts that there are letters on his manuscripts. You do not need a palaeographer to read the “letters” on the Shroud, because they are so easy to “read” by anyone who knows the Latin alphabet. The palaeographer is expert in reading unintelligible handwriting, not in seeing what is not visible. I read manuscripts, but I see the letters exactly how all people see the same letters : the only difference is that I am able to understand those graphic signs, when normal people does not understand them. They see them, but they not understand them. I do not know Arabic, but I see the Arabic letters on a book. “To decipher” and “to see” is not the same thing..","date":"2014-09-30","mins":"8:56 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-157999","author":"andrea_nicolotti","post":"“He cannot discuss and yet keeps commenting”. Yes, you are right. But I have just finished now. I was not able to remain in silence, only because sometimes the argument seems to me very fun and I cannot resist….","date":"2014-09-30","mins":"10:08 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"}],"researchers":[{"id":"comment-12674","author":"andrea_nicolotti","post":"Thank you, David, for ponting out the Acts of our congress. My article is only a very abbreviated version of my book about the mandylion, descripted here: http://unito.academia.edu/Andrea Nicolotti/Books/951200/Dal Mandylion di Edessa alla Sindone di Torino. Metamorfosi di una leggenda.","date":"2012-06-18","mins":"12:15 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"id":"comment-12308","author":"andrea_nicolotti","post":"I won’t enter this discussion because I don’t know the new documents, and I think that now is better to wait in silence. But there is an important thing, that Gabriel wrote here and made me feel flabbergasted. “Studi medievali” is one of the most important academic reviews in the world dealing with medieval history. It is known by all medievalists. It was established since 1904, and still has in its directive committee among the most important scholars. The Italian school of medieval history is among those with the most ancient tradition and value in the world. The “JCR ranking system” mentioned by Gabriel doesn’t have any importance in the field of the historical studies, especially for the publications not made in English language. Therefore, to make a classification of reviews according to that method, means having no idea what is the historical research. And the same can be said about the “Journal of Biblical Literature”. If “Studi medievali” has a “very low credibility”, I can say that “Nature” is a parish magazine. Please, let us avoid foolishnesses..","date":"2012-06-12","mins":"12:40 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"id":"comment-12314","author":"andrea_nicolotti","post":"Gabriel, 43 journals of history are nothing. What is inside JCR is not important for me, and for the scholars of our field. So I am not sorry at all. You are not obliged to know the medieval history or the importance of our reviews, but please, if you do not know, do not judge..","date":"2012-06-12","mins":"1:22 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"id":"comment-12323","author":"andrea_nicolotti","post":"Gabriel, I am not so interested on peer reviews and classifications among journals: it is a mostly American illusive mania (and we saw, with mr. Kouznetsov, how is unreliable) that, on humanistic field, generates only bad scholarship and detrimental competitions. But I could not omit to say how was wrong your statement about the value of “Studi medievali”, one of the most renowed reviews about medieval history on the world. Obviously, the validity of any article has to be judged reading it; I cannot understand why here so many people is speaking about what is not yet published..","date":"2012-06-12","mins":"2:02 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"id":"comment-15724","author":"andrea_nicolotti","post":"Kind Davor, I do not know if I am the devil or not (maybe a devil without self consciousness?). I have written a big book on diabolical possession, perhaps this was not without consequences. Perhaps you are right, but I am sure that the problem of languages is maybe not the only problem, but one of them. And it is easier make battles with internet pages, than refute scholar publications: when a book is too deep or difficult, is better to ignore it. By the way: ony now I see that the “dissection” of Stephen E Jones you pointed out. It is… embarrassing. I have opened a page at random. I read: “A 10th century codex, Codex Vossianus Latinus Q 69 found by Gino Zaninotto in the Vatican Library [wrong: the Vossianus is in Leiden and was not found by Zaninotto!] contains an 8th century account [wrong: the account can be of the 8th, 9th or 10th] saying that……. The source is Wikipedia. For me is enough to close it..","date":"2012-09-02","mins":"12:09 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15738","author":"andrea_nicolotti","post":"Daveb: I did not see in Freeman’s paper an attempt to address Jack Markwardt’s modification of Wilson’s hypothesis, that the Shroud was kept in Antioch until the the 6th century; nor Scavaone’s modification that it was kept in Besancon after being sent to Athens, rather than being held by the Knights Templar. Both of these hypotheses seem more credible than Wilson’s primary hypotheses. MORE CREDIBLE? 1) the Shroud was kept in Antioch: invented. 2) the shroud was in Athens: invented. 3) Was held by the Knights Templar: invented. It seems that anyone can invent something, and shroudies transform it in an “hypothesis”. If one is false, the other one maybe is true. Please, this is not history. Is Dan Brown. As far as I am aware his is one of the few attempts to vest the Shroud with some kind of historical provenance prior to the 14th century, and thus oblige a sceptical world to take it more seriously, than it had hitherto. You said well: “some kind of historical provenance prior to the 14th century”. Any kind of. The important is not if it is true, the important is to say *something*. Athens, Rome, Edessa, Antioch, Besançon, Constantinople, everywhere. I add Cabot Cove..","date":"2012-09-02","mins":"5:42 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15744","author":"andrea_nicolotti","post":"Yannick, can you tell me where are these 2 or 3 ancient sources?.","date":"2012-09-02","mins":"6:01 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15753","author":"andrea_nicolotti","post":"Ron, I know not 2 or 3, but even more “ancient” alleged sources, but all what I have examined is false, or invented, or mistranslated or non correctly understood. So I was asking Yannick where are these sources, because I have not found any kind of these sources. As I have read so many books and articles for one year about the shroud, from the morning to the night, before writing something, I think is difficult that such important sources are escaped from my research. Concerning the book I wrote: before we were speaking about the Mandylion, and not about Athens. I have dedicated a book only to the mandylion theory, and there I study the supposed history of the Shroud from Edessa to Constantinople. But no problem! The theories about the presence of the Shroud in Athens or elsewhere, from 1204 to 1350, are examined in another book I have published six month before the other one, so I am well informed also on this. So, I hope that you are not thinking about “chartularium culisanense” or other forgeries like that…… Because, excepting the forgeries, I repeat that I have not found any source..","date":"2012-09-02","mins":"7:38 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15841","author":"andrea_nicolotti","post":"Daveb, few words, because for me the discussion here is not useful and I desire to close it. You showed me not some scholar article, or recognized historical research, but three pdf from shroudie conferences. Please, ask yourself why these kind of pseudo historiography lives only among shroudies. 1) Markwardt paper says that Shroud was in Antioch. No proofs of it, only conjectures or legendary texts, sometimes not well read or interpreted. What no one historian can use to proof something. I know a lot of theories like that, that “prove” that the Shroud was everywhere, in Antioch, in Jerusalem, in Rome, in Costantinople, in Alexandria. Obviously all are in contradiction among them, because all are false. But as shroudies do not know all them, but retain only what they like, they choose one and believe in it. Again: invented. 2) The second paper is even worse. Markwardt cites an Athanasius’ text speaking about an “icon”. What a discovering! Maybe we have to be grateful to this shroudie historian that in 2008 discovered a new text that until now we ignored. The only problem is that every true historian with a minimum ok knowledge of the ancient christian literature knows that this text is not of Antanasius, that this text is pertaining to a painted image of Christ made by Nicodemus (do you believe also in that?), and obviously that this text says nothing about any shroud. Mr. Markwardt clearly has not idea about what is speaking of. Again: invented. 3) Scavone is incomparably better than this Markwardt. No comparable. But has a similar problem: no proofs. He uses Wison’s book as a “shroud bible” (quoted) and his theory about Othon de la Roche is based on these arguments or documents: 1) The letter of Theodorus Angelus to the Pope. A modern forgery. 2) Some words written by Nicola di Otranto about Christ’s bands (the Shroud is made of bands?) not well interpreted and used in a shroudie perspective. 3) The conjecture that Otho had a shroud from the Blachernae palace because garrisoned in this palace in 1204. Said without proofs (by another shroudie, but obviously taken as true without any control, because many shroudies believe any conjecture useful to “support” their theories, and despise all the rest) 4) a tomb of Othon in France described by the shroudie chemist Alessandro Piana; but the tomb is not a tomb of this Othon, and it is interesting that this tomb has an inscription in Latin of 8 words that was copied by Piana with 3 mistakes (good wok!), that Scavone repeated. I wonder if they know some Latin. 5) Scavone adds another invention: the Shroud was brought to Othon by Pons de Chaponay in1219. The proof? They were friends! I have explained all this in my book and now I cannot summarize here, but ony I say that in this manner surely I can demonstrate that the Shroud was in Cabot Cove, discovered by Jessica Fletcher. Please, open your eyes..","date":"2012-09-04","mins":"10:42 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15855","author":"andrea_nicolotti","post":"Post scriptum: opening at random the document of Markwardt, I see another funny pretended PROOF of the presence of the Shroud in Antioch: the Gospel of Hebrews. Markwardt wrotes: “Although the lost second century Gospel of the Hebrews related that Jesus gave his Shroud to “the servant of the priest”, scholars have suggested that, before falling victim to a copyist’s error, this text had actually stated that the Shroud was given to Peter”. Interesting. Who are these “scholars”? In the footnote we find… Ian Wilson!!! What a coincidence! Wilson is a source? Surely. Only we, academic historians without faith, we are headstrong in looking for authentic sources. And the book of Wilson is not a source. But obviously Wilson is not responsable of such a complex theory. The responsable is…. Another shroudie, J.T. Dodd, that in 1931 published a very “disinterested” article intitled “The Appearance of Jesus to The Priest’s Servant, as Recorded in the Gospel of the Hebrews, and The Holy Shroud”. A guarantee! Which is the idea of this Dodd? That where in the Gospel of Hebrews is written “dedit sindonem servo sacerdotis” (he gave the sindon to the slave of the priest) we must read: “dedit sindonem Petro” (he gave the sindon to Peter). Why? Because he wants. Any manuscript says that? No. Any translation? No. Any old translation? No. Any other scholar? No. And why he wants to make such a manipulation? Because, Dodds thinks, if this shroud was given to the Jewish priest, it was not on the christian hands of Peter, and also the account of the Gospel of John is wrong. Impossible for Dodd to understand that the Gospel of Hebrews is not an historical reliable source. He MUST save this little sentence because it remembers his loved shroud! And now, after 90 years, shroudie Mr. Markwardt can use the manipulation of his shroudie ancestor Mr. Dodd to write in his article that Peter had the Shroud and brought it in Antioch (conjecture+conjecture=reality). “Scholars” says that. In the meantime, the editions of the Gospel of Hebrews have not this manipulated text, and the rest of the academic world knows that in the Gospel of Hebrews is written “he gave the sindon to the slave of the priest”. Stop. The “scholars” thinking what Markwardt says, are only in his own fantasy or in the book of Wilson. But surely all scholars are obstinate incompetents and Wilson and Markwardt are right. The American congress of the shroudies will say the truth. : ) I have a new hypothesis: the Gospel of Hebrews has to be corrected like this: “dedit sindonem servo regis” (he gave the shroud to the servant of the KING). The king is Abgar of Edessa, his servant is Ananus. All make sense. So, the Shroud is the Mandylion. Now we have the proof. Please, invite me to the next shroudie congress. : ).","date":"2012-09-04","mins":"6:52 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15755","author":"andrea_nicolotti","post":"Yannick, I agree with you. What I do not know, is if Wilson is an “opportunist”. With me both Scavone and Wilson were kind, not as other shroudies. I think both are not good historians, but to be in disagreement does not mean to be enemies. I think also Guscin wrote some wrong things, but I had with him and he had with me a cooperative behaviour. I have appreciated, for example, that Wilson wrote a terrible review of the Barbara Frale’s books, that are maybe a biggest falsification of the last 30 years about the Shroud, having read my arguments against her. Maybe he did it because Frale was manipulating his theories presenting herself as the authentic “discoverer” of them? Or because he realized that Frale was untruthful with him? Or because of the love of the truth? I do not know, but he did it. About shroudies and history, the problem is simple: as until now we have not documents about the Shroud before 14th century (I hope that something will be discovered, but UNTIL now we have nothing), the only history that a “real” historian can write is the history of the “idea” of a shroud, the history of the relics in general, or the history of the alleged false sources about the Shroud. The last one started in the 16th century and is continuing now, with a growing vitality. Is what I am doing now, studying the sindonology as an example of pseudo historiography. As usual, with few exceptions, the pseudo historiography normally lives outside universities and is rejected or ignored by the scholar academical world. But is very pervasive because is propagandized in popular books and media, and believed by people not ready to understand what is wrong and what is true. Normally the pseudo historians are not professionals, and always are inaccurate, superficial, unreliable and conjectural in what they write. Normally they work with religious or political arguments, that can reach the emotivity of the not so historically educated people. As here: people WANTS that someone find documents about the Shroud in the centuries 1 14, so they – with or without consciousness – provide them what they want. I assure you that the study of the pseudo historiography is not easy, but very instructive. And also funny. Obviously, the “normal” historian will not sell so many books, but… for me this is not so important..","date":"2012-09-02","mins":"8:38 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15771","author":"andrea_nicolotti","post":"Some answers for carlos: <<<<<<¡Teníamos pseudo ciencia y ahora tenemos pseudo historiografía! ¡Ja,ja,ja…!<<<<< Carlos, la pseudo historiografía no es un invento creado para molestar a los sindonologos. Se enseña en la universidad, es parte de la metodología de la investigación histórica. Hay ejemplos de esto en los manuales, hay una larga tradición de lucha contra la pseudo historia. Si no sabes, es porque no es tu trabajo. Y no te importa la historia, estás interesado en la Sábana: la historia puede ser sólo una manera de confirmar lo que quieres oír. Puedes reír, pero en ese caso risus abundat in ore stultorum. <<<<<<<Son muy interesantes algunos de los comentarios de Marinelli sobre los últimos libros de Nicolotti:<<<<>>¿no encuentra extraño que los “eruditos” que atacan la identidad de la imagen de Edesa con la Sábana de Turín sean anti Shroudies?<<<< No encuentras extraño que los “eruditos” que atacan Dan Brown sean cristianos ? By the way : nadie « ataca ». La identidad de la imagen de Edesa con la Sábana no es una teoría que alguien acepta otro ataca. Es una teoría de sindonologos escrita por sindonologos. Nadie afuera la acepta. De ahí no sale. Y ahí permanecerá, en los blogs de sindonologos, y en los libros y escritos por sindonologos que no saben cómo vivir sin ella. Si te gusta el gueto, quédate ahí. A mi no me pasa nada..","date":"2012-09-03","mins":"6:09 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15772","author":"andrea_nicolotti","post":"I do not know why, but in the last post the central part of my answer was lost: <<<<<<<Son muy interesantes algunos de los comentarios de Marinelli sobre los últimos libros de Nicolotti:<<<<< Sí, muy interesante. Yo escribí 400 páginas buscando fuentes y documentos como nadie lo había hecho antes, en griego, latín, siríaco, árabe y armenio, y recibí la aprobación de TODOS los otros historiadores que hasta hoy se exprimieron. Demostré la falsedad de los libros de Frale y muchas otras cosas, como por ejemplo la falsedad del cartulario culisanense. Y los sindonologs qué hacen? Publican en su revista de sindonología un comentario escrito por una sindonologa licenciada en ciencias naturales, que ni siquiera puede entender lo que yo traduje, que (muy nerviosa porque he demostrado cuanto es equivocada cuando escribe, i cuanto le gusta copiar lo que otros escriben) manipula lo que escribí y no dice nada de lo que estudié, porque no le gusta. Calos, si te gusta el gueto, quédate ahí..","date":"2012-09-03","mins":"6:38 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15775","author":"andrea_nicolotti","post":"<<<<<it is undeniable that at some point in the history of the Image of Edessa, some writers were convinced, for whatever reason, that it was indeed a full body image on a large cloth that had been folded over (possibly in such a way that only the face was visible), and that it did contain bloodstains<<<<< The problem is not what Cameron likes, the problem is ONLY that what Guscin wrote is not true..","date":"2012-09-03","mins":"7:20 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-16042","author":"andrea_nicolotti","post":"Ron : Why has no true historian written a paper and made it accessible to all on Shroud.com? Thank you. R Ron, Guscin wrote a book and some articles, and the sentence you quoted is taken from a book, not from Shroud.com. Historians write books and articles, and Shroud.com is not a place to make historical discussions or publish articles. I do not see differences. But maybe if Shroud.com is interested, they can ask historians to reproduce their papers, and perhaps sometimes will be possible..","date":"2012-09-09","mins":"4:25 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15779","author":"andrea_nicolotti","post":"Carlos, el problema con la sindonologia pseudo historica es también problema de DATOS, antes que de INTERPRETACIÓN DEL DATO, debido a que los pseudo históricos generalmente no conocen los datos, los manipulan, traducen mal, conocen parcialmente. Déjame darte un ejemplo con ti mismo. Acabas de escribir: “¿Cómo se digiere que Robert de Clari NO VEA la imagen de Jesús y SI VEA la imagen de la Virgen?”. Esto demuestra que tu también tienes problemas con los datos. Porque nunca, en su libro, De Clari asegura haber visto algo el la iglesia de las Blachernas. Esto sería el FUNDAMENTO del la interpretación, pero te falta. Todo lo demás, lo expliqué en un artículo publicado en una revista de estudios bizantinos. Pero tu no la leíste. Así que estás hablando de lo que no sabes. Lo único que sabes es que lo que yo digo no te gusta porque no está de acuerdo con tu idea de Sábana. Eres un perfecto pseudo histórico..","date":"2012-09-03","mins":"8:33 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15720","author":"andrea_nicolotti","post":"I think the biggest problem for shroudies is a linguistic problem. Since most of the shroudies is not a professional scholar, and does not have language skills – which is in general a very serious problem among English speaking people – they have no knowledge of what happens outside the English speaking countries. Generally, therefore, ignore what is written in Europe in nations that have a very strong tradition in humanistic studies, that use German, Italian, Franch, and also Spanish languages. The criticism that Freeman and others now focus on the theory of Wilson, like many other critics in general, have been discussed many times there. In Italy by prof. Pier Angelo Gramaglia, for example, more than twenty years ago, even in scientifical reviews. And when (not so often) the same things are written in English, it seems that are new things! In reality, you are discussing things just discussed twenty years ago. Even I have written an entire book last year about Mandylion of Edessa and the Shroud, certainly the most thorough analysis of all the arguments from the historical and philological point of view. Surely outside Italy and outside academic circles, it will be totally ignored. If someone wants to discuss historical issues, he has to study foreign and ancient languages. It will be surely also a great gratification for him, I’m sure.","date":"2012-09-02","mins":"9:01 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15783","author":"andrea_nicolotti","post":"Reacción típica de pseudo histórico. Dice una cosa. Alguien dice que no es correcta. El cambia de tema. Antes has dicho que Clari vió la Sydoine. Te digo que no està escrito. Entonces usted dice que *tal vez* la vió, pero no es tan importante. Y de ahí se pasa a la siguiente objeción. Ahora descubrimos que tal vez De Clari no era un testigo presencial. Entonces, si hubieras estudiado De Clari, habrías descubierto que escribió su crónica no en Constantinopla, pero algunos años más tarde, cuando regresó a Francia. A continuación, habría constatado que comete varios errores en la descripción de Constantinopla. Y también que era analfabeto, y su testimonio lo escribía otra persona en su lugar. Y que era muy crédulo, y cuenta episodios que nadie creería. Entonces se verá que dice que el Mandylion estaba en una iglesia en el otro lado de la ciudad, así que si él dice la verdad eso es una otra prueba que Wilson aún más està equivocado. Entonces descubrirías que su cuenta de la historia del Mandylion es tan equivocada que queda claro que sus fuentes no eran buenas. Por último, se descubriría que su relato de lo que ocurre en Blacherne es contrario a toda la mas segura tradición bizantina y latina. Uno contra todos. Y màs: 1) Dice: “Su problema es: 1. Probar que NO la vió”. Es exactamente lo opuesto. 2) La transcripción de la versión francesa, que me has dado, no es buena. Curiosamente la veo en el Internet. Tal vez ha copiado desde allí? 3) para mi, despues un LARGO ESTUDIO de toda la obra de Clari e de TODOS los testimonios sobre la iglesia de Blachernae, Clari està equivocado. Pero el porqué no se explica en un blog. 4) « La viera o no la viera….”. No, Carlos. La viera o no la viera no es lo mismo. 5) Si en Blachernas habia una sàbana con la Imagen de Nuestro Señor en Constantinopla – yo no lo creo – no sabemos nada sobre sus orígenes y su realidad. Podría ser cualquier tela con la imagen de Cristo muerto, como muchas estaban en ese momento, con una función litúrgica que Clari, siendo francès, no entendìa. Y si estaba, no hay razón para pensar que era la misma que 150 años más tarde aparece en Lirey. Pueden ser objetos independientes, o incluso ser una copia de la otra, o ser dos entre muchas que existian. Así que este testimonio no cambia nada, sino para demostrar (si fuera verdadero, y yo no lo creo) que ya en el siglo 13 alguien dijo que existian sàbanas con imagen. Lo cual es interesante, pero no cambia la historia de la sàbana de Turin. Eso no me preocupa y tampoco me “desagrada”. No soy un fanatico de la Sábana. No soy un sindonologo ni un anti sindonologo. Simplemente, no me importa..","date":"2012-09-03","mins":"10:25 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15794","author":"andrea_nicolotti","post":"“a large rectangular piece of fabric/cloth (sindon in Greek)” LOL “four times longer than wide (tetradiplon in Greek)” LOL You are right, academics and art historians are all wrong. Save the world!.","date":"2012-09-03","mins":"2:00 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15806","author":"andrea_nicolotti","post":"There is a minimum level below what is not possible to fall. Y no me gusta que me tomen el pelo. Quis habet aures intendiendi, intendat..","date":"2012-09-03","mins":"4:25 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-16154","author":"andrea_nicolotti","post":"Ron, two answers: 1) I have written a short article about the mandylion in a book called “Sacre impronte e oggetti non fatti da mano d’uomo”, that you can freely find on google and also download. It contains other papers by other historians. For me is very difficult to write in English, and nobody translates it for me, so… is useless to send to an American web site a paper in italian just published on internet 2) I have written an entire book about the mandylion and the Shroud, but this is not free and I cannot put on internet (the editor has the property). And again, it is in Italian. I think it would be very difficult that some people here will translate it in English to publish it in English and “to helping all understand better” … : ))).","date":"2012-09-11","mins":"5:21 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-47825","author":"andrea_nicolotti","post":">>>> I do not know if our information is contemporary, or if the first known information comes from a copy of a copy of a copy many years later. Does anybody else?<<<<>>>>For two years the shroud disappears, and then requires the testimony of three bishops and ten noblemen to establish that the one which has mysteriously reappeared is the same one as disappeared two years previously. I wonder why. Wasn’t it obvious? Or were there dark suspicions that the original may in fact have been destroyed?<<< “Le Saint Suaire de Chambéry a Sainte Claire en Ville (Avril Mai 1534)”, which was published in 1891 by Abbé Léon Bouchage. > It is only the edition of the text you can find, in a better edition, in the Chevalier’s 1903 book (doc. P). If you write to me a personal email (andrea DOT nicolotti AT unito DOT it) I can send you this text, or both..","date":"2013-10-17","mins":"8:03 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","title":"Colin Berry: The 1532 fire  was no accident"},{"id":"comment-47827","author":"andrea_nicolotti","post":"Excuse me for the horrible form of my answer. I intended to answer to Hugh Farey, quoting some of his sentences, but… : ).","date":"2013-10-17","mins":"8:06 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","title":"Colin Berry: The 1532 fire  was no accident"},{"id":"comment-47828","author":"andrea_nicolotti","post":"Again: Hugh said: “I do not know if our information is contemporary, or if the first known information comes from a copy of a copy of a copy many years later. Does anybody else?” In order of time, the essential sources are: 1) Francesco Adorno (1578) 2) Filiberto Pingone (1581) 3) Giovanni Tonso (1596) 4) Giuseppe Cambiano di Ruffia (1606) 5) François Capré (1662) Only Pingone says to have been present during the fire. On 1532, he was eight years old. We have not other reliable testimonies. Obviously, Pingone’s history is highly exaggerated (miracles, enormous fire, rescuers of the shrine protected by a divine rain, etc.). Hugh said: “For two years the shroud disappears, and then requires the testimony of three bishops and ten noblemen to establish that the one which has mysteriously reappeared is the same one as disappeared two years previously. I wonder why. Wasn’t it obvious? Or were there dark suspicions that the original may in fact have been destroyed?” Some people said that the Shroud was destroyed by the fire: François Rabelais (1534), Antoine Froment (1534), Calvinus (1543), Michel Roset (1560 circa) Hugh said: “….Le Saint Suaire de Chambéry a Sainte Claire en Ville (Avril Mai 1534)”, which was published in 1891 by Abbé Léon Bouchage.” It is only the edition of the text you can find, in a better edition, in the Chevalier’s 1903 book (doc. P). If you write to me a personal email (andrea DOT nicolotti AT unito DOT it) I can send you this text, or both..","date":"2013-10-17","mins":"8:09 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","title":"Colin Berry: The 1532 fire  was no accident"},{"id":"comment-50184","author":"andrea_nicolotti","post":"John Klotz : It’s the detailed report of the STURP team and the peer reviewed articles that demonstrated that fact It is interesting/curious to me to see how is important, for the people in this blog, if an article is published under the control of the mechanism of the “peer review” (I ma speaking now indipendently from the Shroud or mc Crone etc. Etc.). Most of you are not European?.","date":"2013-11-06","mins":"9:22 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49932","author":"andrea_nicolotti","post":"Josey, surey there is a lot of people as you describe. Their behaviour is exactly the same of the sindonologists. Because they (both) do not study the shroud, they use the shroud to their own ideological pourposes. As for me, if the Shroud is authentic or not, my life or my ideas about God will not change in any manner. But I remember to you that in the XX century the most clever scholars opposed to the authenticity have been almost always catholic priests. This means that this opposition shroudies christians / critics atheists is not true.","date":"2013-11-04","mins":"3:29 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49627","author":"andrea_nicolotti","post":"Dear O.K: “[…] you, Collin, Charles Freeman, Andrea Nicolotti, Gian Marco Rinald really study in depth all the results, all the papers about the Shroud” Yes, I do it. Why 99% of shroudies don’t do the same? “…cunning sceptics” I am not a “sceptic”, I am a researcher and I work according to scientifical method. “why are they not so scrutine in case of those who claim the Shroud is not authentic?” I think you do not read what I write. But you ought to think about the statistics. Shroudies are hundreds. “Sceptics” are not many. There are hardly any serious researcher. So, obviously, the absurdities usually are pro authenticity. Because they are the majority. “Because by default the arguments of anti authenticity are good, while arguments of antiauthenticity is bad.” This is what you see in your mind… I am not interested in pro or against autheticity, I am interested on truth, on serious researches, on scientifical methodology. Stop. This is my work, it is not a hobby to get a bit of relaxation about the work..","date":"2013-11-02","mins":"4:21 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49628","author":"andrea_nicolotti","post":"[about = after.","date":"2013-11-02","mins":"4:22 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49634","author":"andrea_nicolotti","post":">>>>But if one looks deeper, it always appear that they methodology…. Normally – not always, but normally – sindonologists do not look deeper, but until now nobody in scientific field said me that my methodology is “entirely flawed”. I started my work 14 years ago. >>>>Can you say any argument pro authenticity of the Shroud? I did not find one until now. Until now, always I have discovered that arguments pro authenticity are non arguments. But I have not finished yet, so maybe you can wait, if you want. But as for the historical part, yes, I have finished with it. P.S. “To look deeper”, you said. Why to discover the froud of Dmitri Kuznetsov was necessary the study of the “sceptic” Gian Marco Rinaldi? Why nobody looked deeper before, instead of paying and sponsoring his falsehoods? I have little trust in such a people. They “look deeper” only when someone says what they do not like..","date":"2013-11-02","mins":"5:06 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49641","author":"andrea_nicolotti","post":">>>>true face of fanatical Shroud hater “Fanatical”, very funny. It is useless to speak with you, you can not go out of your manicheism: love Shroud / hate Shroud. I do not love nor hate the shroud, the shroud is an object that I study. Before the Shroud I studied the diabolical possession in antiquity, but I do not love nor hate the possessed. Wilson did not discover that Kuznetsov was a scientific frauder, he only discovered other thing related to money. Is not the same. <<<<>>>> who and how faked the Shroud? If you are entirely convinced of that. Your obsession with pro authenticity / against authenticity is preventing you from see that I never wrote that the Shroud is a fake. But, by the way, your question “who and how faked the Shroud” is a non scientifical question. I do not know exactly how Stradivari prepared his violins, but I do not think that Stradivari is God or that the violin is a miracle. And if I could make a Shroud identical to the original, this does not mean that the original Shroud was made exactly as I did. It is question of probabilty..","date":"2013-11-02","mins":"5:34 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49642","author":"andrea_nicolotti","post":"Colinsberry : Hello Andrea Your “I templari e la Sindone. Storia di un falso”: is it available yet in English? Is there an English language summary? No English. Until now nobody asked to translate it. At the moment they are translating only the book about the mandylion..","date":"2013-11-02","mins":"5:37 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49645","author":"andrea_nicolotti","post":">>>don’t try to excuse yourself. I do not excuse myself, I did nothing wrong >>>you cannot overcome your inability to say a single, even the weakest argument that could be used to support the Shroud’s authenticity>>>>> A: you do not believe in UFO B: Never I saw a UFO A: Because you hate them and you do not want to believe in them B: I do not hate them, simply I have not found until until now an argument to support their existence A: You showed your true face of fanatical UFO hater. Don’t try to excuse yourself. B: I do not excuse myself, I did nothing wrong. A: But I can say, if i want, many arguments that cast doubt on the existence of UFO or against the authenticity of the the relic of our Lady’s milk, that was conserved at Paris with the Mandylion of Edessa. And you can found even the weakest argument that could be used to support that UFO exist and that this milk is authentic? B: No. But can you show me this milk? A: No, it is impossible to see. But it did many miracles. B: Probably I do not believe in these miracles. A: You hate not only UFO and relics, but also miracles! B: No, I do not hate anything. So you believe also in miracles happened through the Shroud of Besançon or Cadouin? A: Excuse me, we were talking about milk..","date":"2013-11-02","mins":"6:18 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49648","author":"andrea_nicolotti","post":"Colinsberry : Would you consider me rude to ask you to summarise here in as few or many words as you see fit – what links you see between the Templars and the Shroud? I have my own half baked (literally!) views too, but they can and should wait till I’m au fait with what a published author has to say on the topic. Excuse me, but I cannot summarise here 180 pages full of arguments… But in few words, I have checked all texts that have been used to demonstrate a link between the Templars and the shroud, and I recognized them as falsified, poorly translated, poorly contextualized or invented. So, as it has been already written by the historian of Templars Malcolm Barber, I think that there is no link between the shroud (if existed at that time) and the Templars. But I can help you otherwise. If you want to read a review of my book, the British Society for the Turin Shroud Newsletter published one. My book is about medieval history and I am an historian. That review was written by a shroudie graduated in natural sciences. Surely you will like it. There are other reviews of my book, in «Rivista di storia e letteratura religiosa» 48 (2012), pp. 167 178, in «L’indice dei libri del mese» 10 (2011), p. 21, in «Giornale di storia» 6 (2011), in «Deutsches Archiv für Erforschung des Mittelalters» 67 (2011), p. 805, in «Revue d’histoire ecclésiastique» 106/3 4 (2011), pp. 858 859, in «Vetera Christianorum» 48 (2011), pp. 392 393, in «Rivista di storia del cristianesimo» 10/2 (2013), pp. 508 511. But unfortunately they were written by historians on scientifical reviews, so better if you do not trust them. P.S. If someone wants to give me a tenth of the money given to Kuznetsov, or to Frei, or some of the money given to Rolfe, I’ll pay the translation. For me, I do not need money. I am sure that a lot of sindonologists want to give their money also to people that want to study the Shroud without saying in the first page that surely it is authentic. Maybe also Rinaldi or Freeman could get some : )).","date":"2013-11-02","mins":"6:47 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49655","author":"andrea_nicolotti","post":"O.K, Hitler never existed. It was invented by a crown of graduated from natural sciences in 1947 because they, hafter having destroyed Nagasaky with their bombs, wanted to blame someone for having started the war. We, professors of history (I am sure you know many of them), are truly big idiots, serving particular ideology, and building our careers on nothing else but conformism and coteries; so we were payed by you “exact” scientists to write the histories about Hitler. I confess it. The shroud is authentic because you says it, and Koutznetzov is an historian. And the evangelists were graduated from natural sciences at the Jerusalem University. [Finished].","date":"2013-11-02","mins":"7:55 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49962","author":"andrea_nicolotti","post":"Josie, I have not spoken about priests as arguers against the examination of the Shroud, even if I have an idea about that; I have spoken about many priests that in the XX century did not believe in authenticity of the Shroud and wrote books against shroudies. And they were professors in seminaries and universities, not ignorant people. The last example is Mons. Victor Saxer, president of the Roman Pontifical Academy of Archaeology and of the Pontifical Commettee of Historical Sciences (even if in some aspects his work on the Shroud was not so well conducted as one could hope). What I want to say is that the equivalence “believer in Shroud = catholic” and “not believer = atheist” is wrong. Or it is true only in the mind of some obtuse catholic, as you can see in this blog (people that can guess also my ideology, my faith, if I am catholic or not…). Maybe they love the Shroud in such a fanatic way because they think to be able to demonstrate the miracles of God or his resurrection through the Shroud. It is an old temptation: to take a so called miracle and to use it as proof of God. By the way, the idea that the wine and bread become flesh and blood is not in idea “claimed in the past”: is a present truth of faith. But until now we are lucky because some pseudo scientific has not yet thinked to study with the microscope the wine before and after the mass, to see if it changed its composition in some way due to the priest’s verba institutionis..","date":"2013-11-04","mins":"8:28 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"}],"resources":[{"id":"comment-164983","author":"andrea_nicolotti","post":"Max Patrick Hamon, inviting other people, as usual, to do “home work before passing comment”, wrote: «I can read Modern French, Old French, a few Old French dialects, Classical Latin, Medieval Latin and Ecclesiastical Latin all right, what about you?» […] «This is what I would call “bad faith” (in Latin FRAUDO)» […] «Ecclesiastical Latin word fraudo means… » […] «Don’t you read the Medieval Ecclesiastical Latin fraudo…» ….. And after some minutes, when realizes that the word “fraudo” does not exist in Latin… « Note: FRAUDO (= MALFOY) as name derived from the verb FRAUDO and synonym of FRAUS, FRAUDIS » This demonstrates again to me, as just happened before, that Max Patrick Hamon does not know Latin, be it classical, medieval or ecclesiastical..","date":"2014-10-23","mins":"6:16 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-165444","author":"andrea_nicolotti","post":"Hugh, this is a picture (not made by Centini) of the mural external fresco in the cemetery church of Viverone. I do not know if dates before or after the trasnfer of the Shroud in Turin (1578)..","date":"2014-10-25","mins":"8:42 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-165449","author":"andrea_nicolotti","post":"If I well understand, Hugh, you believe that the fresco is older than 1534 because it has not the scorch marks. If it is so, the argument is inconclusive, because there are many paintings of the shroud AFTER the 1532 without the scorch marks, until XIX century..","date":"2014-10-25","mins":"9:00 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-165453","author":"andrea_nicolotti","post":"No, the paraments did’nt change their shape in a significant way.","date":"2014-10-25","mins":"9:13 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-165201","author":"andrea_nicolotti","post":"Mr. Max Patrick Hamon, please, do not make a fool of me. And I do not need to see dictionaries to solve such a simple question. You wrote: «This is what I would call “bad faith” (in Latin FRAUDO)». No, “fraudo” is a verb (“to cheat”), and “bad faith” is a substantive (with adjective). You wrote: «In Latin the substantive fraudis can mean “bad faith”, “deceit”, “fraud” etc, AND “misrepresentation”, “error”, “mistake”.». No, the substantive “fraudis” does not exist. “Fraudis” is a genitive of the substantive “fraus”. You wrote: «Don’t you read the Medieval Ecclesiastical Latin fraudo/fraudis with your preconceived». No, “fraudo/fraudis” does not exist in Latin. You wrote: «Mr Nicolotti, the Latin verb fraudo DOES exist in Latin and could even be used as a substantive». No, a verb is a verb and cannot be used as substantive. “Omni fraude cessante” = adjective + substantive + verb. Stop. No way. I taught Latin and Greek for many years, and I am able to see if someone knows or do not knows them. And this is not the first time you make grammatical errors. You are not obliged to know them: but please, before repeatedly saying “do your home work before passing comments”, look at yourself..","date":"2014-10-24","mins":"11:38 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-165226","author":"andrea_nicolotti","post":"Egregio (not “egreggio”) Hamon, with your blabla you can make a fool of people who does not know the matter. With me you can not. The discussion for me is closed..","date":"2014-10-24","mins":"1:46 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-187798","author":"andrea_nicolotti","post":"Viverone: I was there today. The fresco is completely disappeared.","date":"2015-01-31","mins":"1:15 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-56068","author":"andrea_nicolotti","post":"I say *probably* tomorrow. But it is not sure… perhaps the day after tomorrow… But now it seems an almost sure news. The Pope will be here. I have no more informations at the moment, because now here it is 3.15 AM, and all people in Torino is sleeping …...","date":"2013-12-03","mins":"10:18 pm","url":"https://shroudstory.com/2013/12/03/about-to-break-breaking-news/","cat":"press_coverage","title":"About to Break Breaking News?"},{"id":"comment-56296","author":"andrea_nicolotti","post":"In this moment the Archbishop of Turin is saying that there will be an exposition of the shroud for 45 days, between April and August 2015. I was right.","date":"2013-12-04","mins":"7:45 am","url":"https://shroudstory.com/2013/12/03/about-to-break-breaking-news/","cat":"press_coverage","title":"About to Break Breaking News?"},{"id":"comment-56305","author":"andrea_nicolotti","post":"Dan, I AM ALWAYS RIGHT!!! Joking apart, for further informations (they are distributing papers for the press services) I’ll inform you.","date":"2013-12-04","mins":"8:15 am","url":"https://shroudstory.com/2013/12/03/about-to-break-breaking-news/","cat":"press_coverage","title":"About to Break Breaking News?"},{"id":"comment-166317","author":"andrea_nicolotti","post":"In a few words? i think it is impossible…. But if your question is “Do you believe that the Sermon of Gregory Referendarius could be used to prove the identity between shroud and Mandylion, in any part?”, the answer is obviously not, as all scholars (except some sindonologist) do know, and as the reading of ALL treatise demonstrates without doubt..","date":"2014-10-28","mins":"6:25 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166304","author":"andrea_nicolotti","post":"Scavone: «[…] it is firmly documented as coming from Constantinople to Besancon to Geoffroy de Charny». Firmly documented???? Simply RIDICULOUS.","date":"2014-10-28","mins":"5:47 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166613","author":"andrea_nicolotti","post":"But I do not agree with you, Max. On XIII and XVI or XV century no Shroud existed in Besançon. So the problem is not how the Scavone’s hypothesis is reliable or proved, but how can exixt such hypothesis..","date":"2014-10-29","mins":"1:38 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166614","author":"andrea_nicolotti","post":"XIII, XIV, and XV.","date":"2014-10-29","mins":"1:39 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167293","author":"andrea_nicolotti","post":"Better explained: the shroud with the image in Besançon did not exit on XIII, XIV, and XV century. A white linen for the rite of the “Quem quaeritis” was present there in the middle age, as in many other churches..","date":"2014-10-31","mins":"1:44 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166326","author":"andrea_nicolotti","post":"I guess that this starting conversation between you and I will finish in nothing…. : ).","date":"2014-10-28","mins":"6:39 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166333","author":"andrea_nicolotti","post":"It is not question of “running away”. Only I know how conversation with you always finish. Your question is simple, yes. I do not deny anything. Why I have to “deny” authenticity of the Sermon?.","date":"2014-10-28","mins":"6:59 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166330","author":"andrea_nicolotti","post":"I do not like this translation….. Anyway, if you wanto to read Guscin you must add also http://www.shroud.com/pdfs/guscin3a.pdf.","date":"2014-10-28","mins":"6:45 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166337","author":"andrea_nicolotti","post":"The sermon was delivered on the evening of August 16, 944, at the imperial palace, perhaps yes, perhaps not.","date":"2014-10-28","mins":"7:07 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166353","author":"andrea_nicolotti","post":"We cannot assume anything without proofs. That the mandylion is a shroud folded is an invention of Mr. Wilson in the XX century, not a conclusion taken form the texts. So, as historian, I cannot discuss about fantasies and conjectures. The mandylion is a a towel used to paint the face of Jesus, or to clean the face of Jesus sweating or blooding, this says all tradition (obviously, is a legend). Stop. Robert de Clary is not more clear, because in any part he says that the mandylion is something different..","date":"2014-10-28","mins":"8:03 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166339","author":"andrea_nicolotti","post":"So?.","date":"2014-10-28","mins":"7:14 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166342","author":"andrea_nicolotti","post":"Please, go on. I am not here to answer a series of questions like in a tribunal. Say what you want to say without questions or “steps”..","date":"2014-10-28","mins":"7:21 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167324","author":"andrea_nicolotti","post":"P.S. The family link between Jeanne de Vergy and Otho de la Roche is false. (my book “I templari e la sindone”, p. 120 ss.).","date":"2014-10-31","mins":"2:25 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167321","author":"andrea_nicolotti","post":"Yes, I am sure. We know that the Besançon shroud was made on 1523 or some years before. We have medieval documents and they were not distroyed on the fire (forgers like fires, they use them to justify their forgeries). Piana Scavone theories are funny: they use false legends created on XVIII century to explain presumed facts occurred on middle age. “Local tradition” means nothing: it was also a “local tradition” that in my town sleeped Napoleon, but it is false. The story of Othon de la Roche was a lie invented on XVIII century. This is well known. Obviously, they fabricated also false “material evidence”, this is normal. So, yes, I am sure. (P.S. Absence of evidence is not evidence of absence: it is true, but only sometimes. But is ALWAYS true that you must demonstrate that something existed, if you think that it exixted, and not asking me to demonstrate that somethng did not exist)..","date":"2014-10-31","mins":"2:19 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167334","author":"andrea_nicolotti","post":"O.K, the first study of this question was Paul Vignon 100 years ago. After, you can read the article of Zaccone printed in the acts of the the Congress of sindonology of Nice (1997, I guess). In the fututre I’ll publish something more accurate, but this is enough. So, go on. I cannot make here all the history. I use this blog only for short suggestions, it is not the place to write articles. For Jeanne and Otho, the same. I explain all in my book..","date":"2014-10-31","mins":"2:42 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167397","author":"andrea_nicolotti","post":"OK, I try to be more clear. I do several categorical statements, yes. I seem sometimes insufferable, perhaps. But understand me: I do not want to argumentate here, because a blog is not a a place to make serious history with documents and argumentations. It is a place to spend time, make simple discussion, know people, and share informations. I share informations. I have not time, possibility and desire to explain here the results of my researches. History is a serious work, difficult an complicated, and needs the correct place and the correct way to be explained. So often I make fast statements, only because I know that some people could be interested in knowing what I have to say. If someone wants to go deeper, he must read my books or articles, and study himself. So, for me, my statements are a little help for the readers that know me, and that know that I work seriously and professionaly,… and that I do not invent or manipulate sources. Vignon: his second book, not the first. Zaccone: the article on Besançon, not the book. Jeanne: no games, she is not descendant of Otho..","date":"2014-10-31","mins":"7:32 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167669","author":"andrea_nicolotti","post":"1) The genealogical tree of Wilson is wrong. Henry de Vergy was not wife of Élisabeth de Ray. 2) All the list of Scavone’s speculations and conjectures (=inventions) needs only an answer: where are the sources that associate Othon de la Roche with a Shroud?.","date":"2014-11-01","mins":"12:45 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167670","author":"andrea_nicolotti","post":"Husband.","date":"2014-11-01","mins":"12:46 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167709","author":"andrea_nicolotti","post":">>>>So who was wife of Henry de Vergy? Élisabeth de Chalon >>>>Piana has similar genealogy to that of Wilson Piana is a biologist <<<<<>>>Those 18th century sources, Source (one), not “sources”. And you call “source” an anonymous treatise of the 18th century, written to defend the authenticity of the Besançon Shroud (that was false, all know), telling something about what happened on 1204, based on falsificated sources? And the historians before, who NEVER associated Othon with the Shroud? Nobody remembered? Oskar, please, could you start to use a historical critical mehod? We adopted it two century ago. >>>>which you labelled as “lies” without giving evidence of their falsehood<<>>>>>Plus 1205 letter of Theodore Angelus to the Pope Innocent III. Another forgery. = 0.","date":"2014-11-01","mins":"2:34 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167717","author":"andrea_nicolotti","post":"<<<<<Was his sole wife, or had he additional marriages Too simple escamotage. But impossible, in this case <<<<<<<<it is a source not the best quality, but a source Your traitment of later, disinformated and forged sources is not compatible with the historical critical method. <<<<<<Can you tell me who faked this no. Maybe I'll discover, maybe not. Surely, a member of the siciilian false noble family De Angelis. <<<<<<<<when was it faked (century) probably from xvi to xix <<<<<Do you consider Benedetto D’Acquisto 19th century transcript as authentic? Benedetto D’Acquisto did not transcript anything. Only signed. <<<<<<Frale considers it authentic You consider Frale a reliable historian? <<<<<and found no evidence You do not found never evidences of forgeries if they are against the Shroud… : ) But now I told you many things and many informations (false source, wrong marriage, false chartularium). Go forward! This is the first step (according to the method): read all your 18th century \"source\" about Othon, and found proofs of reliability. Second step: compare it with the earlier sources about the history of the Shroud in Besançon. Third step: look for historical mentions of the shroud of Besançon in the sources in the city (we have them) from 1204 to 1523. Best wishes!!!.","date":"2014-11-01","mins":"3:09 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167725","author":"andrea_nicolotti","post":"<<<<<<So, Andrea you claim that someone from de Angelis family yes, the false, lying, pseudo byzantine De Angelis Family. It is better to remember it. <<<<<>>>>> and delliberately placed it in some forgotten Chartularium Culisanense. All the Chartularium Culisanense, obviously, is a forgery. >>>>>>There is one key question I would like you to answer Andrea; FOR WHAT THE PURPOSE? All fake Chartulariums are falsificated to give importance to a family or institution that has no importance and wants to have it. So the forger of the cartulary created a fake diploma of Constantine XI, with a false genealogy of his family; and then, to make believe that his family had in the past important relics, made a false dowry which contained the stones of the home of Our Lady of Loreto, a false report of translation of the relics of the martyrs of Otranto to naples and our false letter to the pope where is said that they possessed the Shroud. When the letter was forged, the forger was inspired by the histories of the Shroud of Turin written in his times, after Pingone [1581] that for the first time said that Marguerite de Charny was a GREEK noble woman; that, we know, was false, but repeated for a long time). The forger was not very able, and did not know the Greek; it is easy to see that the document is not authentic. When I showed the letter to the most important experts on this field, Luca Pieralli and Otto Kresten, in five minutes they confirmed my opinion..","date":"2014-11-01","mins":"3:57 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166305","author":"andrea_nicolotti","post":"The sermon was not found by Gino Zaninotto in the Vatican Archives. This is a sindonological legend.","date":"2014-10-28","mins":"5:48 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167727","author":"andrea_nicolotti","post":"<<<<< have you invented this right now, or before? I study very hard <<<<<Anyway, next round No rounds, game over. You must study, now. I indicated you the steps. Or you wait the publication of my next study about the Shroud of Besançon. But you can also do it alone, without me and my studies. It is very easy, t see how that \"source\" is a fake..","date":"2014-11-01","mins":"4:16 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-166314","author":"andrea_nicolotti","post":"The Sermon of Gregory and its position in the Vatican Library (not Vatican “archives”) was well known and published in the catalogue of manuscript since the beginnning of XX century. Von Dobschuetz wrote something about it in 1899 and 1905. So nothing was “discovered” after, by anyone. Simply Zaninotto, who lives in Rome, saw the codex (or he bought a copy of it), asked someone to transcript it and translated/was helped in translating some parts. After, Pier Angelo Gramaglia made a transcription more accurate of some parts. At the end, Dubarle asked Paramelle to make a transcription of all the manuscript, and published it. I explain all, and also the text contained in the manuscript, in my book “From the Mandylion of Edessa to the Turin Shroud”, pages 43 66..","date":"2014-10-28","mins":"6:15 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-167862","author":"andrea_nicolotti","post":"From my book “From the mandylion of Edessa”, etc, pp. 71 72: “But we know that the Byzantines believed that Jesus was laid in the tomb wrapped in bands: therefore, on Easter Day, in memory of this, the imperial dignitaries would “wrap themselves with splendid loroi, in imitation of the burial bands of Christ.” (Constantinus VII Porphyrogenitus, De cerimoniis aulae Byzantinae, II,52) The λῶρος was a long and narrow scarf, adorned with precious stones, which was worn wrapped around the body by the emperor and certain dignitaries. This quotation is noteworthy: evidently, in Constantinople at the time of Constantine, it was believed that Jesus’ body had been wrapped with long and narrow bands (σπάργανα)”.","date":"2014-11-02","mins":"5:12 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-167881","author":"andrea_nicolotti","post":"I do not know (and no time to verify). Probably there is a difference about the use of the emperors and dignitaries (only Easter) and the emperors only (also in other occasions). It could be useful E. Condurachi, “Sur l’origine et l’évolution du loros impérial”, in «Arta si Archeologia», n. 11 12 (1935 1936), pp. 37 45..","date":"2014-11-02","mins":"7:06 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-167244","author":"andrea_nicolotti","post":"“La Sindone, indagini scientifiche”, p. 276. Nothing useful, only a reference to Maria Delfina Fusina, saying: “If we accept the thesis of m. D. Fusina, that dates the fresco in the first years of the XVI century”, etc. But is said also that the fresco is cited in a pastoral visit of 1775. So, the unique source is Maria Delfina Fustina, on “Studi piemontesi” 1972 p. 98. She dates the fresco on “first years of the XVI century”, but does not explain why with sure proofs. I think we have not a reliable date for it..","date":"2014-10-31","mins":"10:26 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-125476","author":"andrea_nicolotti","post":"Yes, you are right. But the English version is widely updated and increased..","date":"2014-05-29","mins":"8:03 am","url":"https://shroudstory.com/2014/05/29/available-for-pre-order/","cat":"books","title":"Available for Pre-Order"},{"id":"comment-155330","author":"andrea_nicolotti","post":"Published: https://www.academia.edu/8475824/From the Mandylion of Edessa to the Shroud of Turin. The Metamorphosis and Manipulation of a Legend.","date":"2014-09-24","mins":"7:19 pm","url":"https://shroudstory.com/2014/05/29/available-for-pre-order/","cat":"books","title":"Available for Pre-Order"},{"id":"comment-31075","author":"andrea_nicolotti","post":"David Mo : “In agreement with the biblical book of Exodus, the Shroud’s threads have a twist “Z” instead of the more common twisting “S” because addressed to high ranking religious person.” Can anyone explain this? I think is simply invented.","date":"2013-04-17","mins":"10:54 am","url":"https://shroudstory.com/2013/04/16/giulio-fanti-responds-to-gian-marco-rinaldis-book-review/","cat":"books","title":"Giulio Fanti Responds to Gian Marco Rinaldi’s Book Review"},{"id":"comment-31102","author":"andrea_nicolotti","post":"Daveb of wellington nz scripsit: «[…]None of these refer to a Z twist». So I can repeat: the statement of prof. Fanti is simply invented. «However other *possible* sources for the Z twist requirement might be found in the Talmud, etc.» The Talmud was written some centuries after the death of Jesus and the destruction of Jerusalem. What is *possible* in the Talmud is not useful for us. All historians of Jewish textiles know that in the I century CE all textiles were made with S twist. So, again, the sentence of prof. Fanti is wrong. The Z twist means that the textile was NOT made in the ancient Palestine..","date":"2013-04-17","mins":"4:57 pm","url":"https://shroudstory.com/2013/04/16/giulio-fanti-responds-to-gian-marco-rinaldis-book-review/","cat":"books","title":"Giulio Fanti Responds to Gian Marco Rinaldi’s Book Review"},{"id":"comment-31111","author":"andrea_nicolotti","post":"Latendre : Notice that you wrote “all textiles”. This is very broad. I am speaking about linen textiles. Goat hair or camel hair fabrics, for example, are usually Z spun..","date":"2013-04-17","mins":"7:09 pm","url":"https://shroudstory.com/2013/04/16/giulio-fanti-responds-to-gian-marco-rinaldis-book-review/","cat":"books","title":"Giulio Fanti Responds to Gian Marco Rinaldi’s Book Review"},{"id":"comment-31181","author":"andrea_nicolotti","post":"I am not at home and now I cannot provide references, but that the linen in Jewish tradition was worked in S and not in Z is a fact well known. I remember that I have read it that many times. And that when (very rarely) linen textiles Z spun are found, it is interpreted as proof of foreign provenance. You can look, for example, for the studies of Orit Shamir, that now in Israel is the most notable authority on Jewish ancient textiles. Please, do not quote articles written by sindonologists without competence (e.g. Diana Fulbright). They are full of mistakes, like ALL what was published about the textile structure of the Shroud, from Paul Vignon to Fulbright. The only reliable study on this subject was published by Gabriel Val that, by the way, was the only expert on ancient textile that ever saw and touched the Shroud and wrote something about it. I have spent 4 month to check all the statements made by sindonologists about the textile structure of the Shroud, and I found all wrong. So, now for me all this is rubbish..","date":"2013-04-18","mins":"12:54 pm","url":"https://shroudstory.com/2013/04/16/giulio-fanti-responds-to-gian-marco-rinaldis-book-review/","cat":"books","title":"Giulio Fanti Responds to Gian Marco Rinaldi’s Book Review"},{"id":"comment-31307","author":"andrea_nicolotti","post":"<<< In any case, you are essentially writing that you cannot provide detailed answers in this blog. Exactly. A blog is not a place for it. And, by the way, is useless. <<<<<<<<<<< But you participated to a special issue of the magazine “L’Histoire” titled “Le Suaire de Turin, la vraie histoire d’un faux” published in February of 2012 in France which essentially had the purpose of proving that the Shroud of Turin is not authentic. Granted, that you gave an interview to a journalist that probably decided afterwards to publish it as part of this special issue. Yet, it gives the impression that you want to disprove the authenticity of the Shroud. This is the normal conclusion from such publication. <<<<<<<<< I was contacted by “L’Histoire”. They asked me to answer some written questions NOT prepared by a journalist, but by a professor of medieval history in a French university. I was contacted because I wrote a book about the false theory of the Shroud connected with Templars (Wilson, Frale, etc.). I have accepted and in my article NEVER I told something about the authenticity of the Shroud. It was not the aim of my article. Your “impression” is only your personal judgement. By the way, if some magazine publishes an issue against the authenticity it does not seem to me a problem: 95% of magazines publish only material pro authenticity. I like variety. <<<< What is a sindonologist for you? Someone convinced about the authenticity of the shroud, without possibility to change idea, that writes often about it even without competence, connected with some sindonological association, participates to sindonological congresses (organized and frequented only by supporters of the Shroud). Vial is not a sindonologist: he was a very famous teacher and researcher on history of textiles (like for example Daniël De Jonghe, John Peter Wild, Dominique Cardon, Elisabeth Völling, Lise Bender Jørgensen) and he was called to make an examination on the shroud. He made his work (with gentle words, saying what I say) and after he came back to his work. Flury Lemberg is a member of the sindonological diocesan committee for the conservation of the shroud, and is capable to say sentences like: “I believe that this is the original shroud of Christ, I believe without a shadow of a doubt. This fabric is so precious, so perfectly woven fabric, and thus corresponds perfectly with what is written in the Bible (!!!???) … On the other hand if it really was made on 13 and 14 centuries as well as the examination of the carbon 14 suggests, however I could not believe: it is necessary that the supporters of this thesis explain in which way the image was imprinted on the shroud. Because the image is so special that the answer *can only be a miracle*. Who else but Christ would have so much energy?” This is sindonology. Miracles, Jesus, energy of resurrection, believing without a shadow of a doubt, and so on..","date":"2013-04-19","mins":"12:11 pm","url":"https://shroudstory.com/2013/04/16/giulio-fanti-responds-to-gian-marco-rinaldis-book-review/","cat":"books","title":"Giulio Fanti Responds to Gian Marco Rinaldi’s Book Review"},{"id":"comment-31237","author":"andrea_nicolotti","post":">>>Andrea, your statements are very general and all sweepings. You just wrote “I have spent 4 month to check all the statements made by sindonologists about the textile structure of the Shroud, and I found all wrong”. *All* the statements are *all* wrong?! >>>>> Obviously not ALL in general sense, but almost all in historical perspective. Since sindonologists have the aim to demonstrate the authenticity of the Shroud, they made a lot of examples of “similar” textiles in antiquity, but their comparisons are unacceptable. I remember you that we started this conversation with the Fanti’s sentence: “In agreement with the biblical book of Exodus, the Shroud’s threads have a twist “Z” instead of the more common twisting “S”. This is an example of this kind of wrong statements. >What about Flury Lemberg? Flury Lemberg is a sindonologist and is an expert on textile conservation and restoration. Is not a well known historian of textiles. <<Diane Fulbright gave many useful references on ancient textiles Diane Fulbright is not an expert on history of textiles and is a sindonologist also. Many of her references are not acceptable, and she compares to the Shroud many textiles with fundamental discrepancies, so she is not able to demonstrate anything. I cannot explain this here, but in the future I will publish a deep analysis of it. As I normally do when I say something. <So far, you have produced no proof of your sweeping statements You can think what you want. But this is not the place to do it and I have not time nor capacities to write pages and pages in English in a blog. I started with the wrong sentence of Fanti, that remains wrong. Now I tell you that most of the statements of Fulbright & C. Are like the Fanti’s one. If you want to believe me, ok, if you do not want, is the same. This is not the place to demonstrate anything, if the demonstration requires a long and complicate analysis. Surely remains that the only group that believes that the shroud has a typical ancient textile structure are the sindonologists. Ask you why. <<<<<<A Google search on “Gabriel Val shroud of Turin” yielded no results. VIAL, not VAL, it was a mistype. You do not know Vial? Strange. It was also involved on C14. I confirm: Gabriel Vial is the only well known authority in HISTORY OF ANCIENT TEXTILES that until now touched, saw and wrote a technical analysis on the Shroud. <<<< The work of Orit Shamir seems mainly confined to the textiles found in the Christmas Cave No, Orit Shamir (curator of organic materials at the Israel Antiquities Authority) is now the most recognized authority on Jewish textiles of the Roman age in Palestina (and not only the Christmas Cave). Her phd thesis is still the most important study on the “Textiles in the land of Israel from the Roman period till the early Islamic period in the light of the archaeological finds” <<<<<<I am aware of Andrea Nicolotti’s antipathy towards the authenticity of the Shroud of Turin. You are inventing, as sindonologists normally do. I have not antipathy towards the authenticity of the Shroud of Turin (why?). I have antipathy towards pseudosciences, sloppiness, superficiality. <<<<It seems that he works from the principle of negating anyone who has a view contrary to his own You are describing the sindonology…. << I consider that the paper “Wiping the Slate Clean” by Emanuela Marinelli provides more than an adequate response to his particular negative view I consider the paper of Marinelli a perfect example of what sindonologists normally do. Marinelli is graduated on natural sciences and has no competences on history, philology, byzantine philology and ancient languages. So, she is a person completely unfit to write a review of a book about the Mandylion. However she wrote a review of it (even if in my book I often criticize her…), and obviously in a sindonological review (by the way, giving a description of my results in a very partial way). On the other hand, I have received until now six TRUE reviews on six TRUE scientifical reviews or books: 1) Luigi Canetti (professor of history of christianity at the Ravenna University), in S. Cosentino – G. Vespignani (edd.), Studi in onore di Antonio Rocco Carile, Fondazione CISAM, Spoleto, 2013, pp. 1 21 2) Francesco Pieri (priest, professor at the theological faculty of Bologna), in «Rivista di storia e letteratura religiosa» 48 (2012), pp. 167 178 3) Vincenzo Poggi (priest, professor at the pontifical institute of oriental studies) in «Orientalia christiana periodica» 78/1 (2012), pp. 239 240 4) Vassa Kontouma (professor of byzantine studies at the École pratique des hautes études, Paris) in «Revue des études byzantines» 70 (2012), pp. 308 309. 5) Valerio Polidori (phd in oriental studies at the pontifical institute of oriental studies) in «Medioevo greco» 12 (2012), pp. 375 376. 6) Alessandro Rossi (historian of christianity, University of Milano) in «Vetera Christianorum» 48 (2011), pp. 391 392. They are all positive. This is enough for me. I do not look for the assent and approval of sindonologist. To get it, I ought to write not what I consider true, but what they want to read. And this is not my way to work. I’m sorry about that..","date":"2013-04-18","mins":"8:37 pm","url":"https://shroudstory.com/2013/04/16/giulio-fanti-responds-to-gian-marco-rinaldis-book-review/","cat":"books","title":"Giulio Fanti Responds to Gian Marco Rinaldi’s Book Review"},{"id":"comment-31466","author":"andrea_nicolotti","post":"Mario Latendresse : I was actually a bit disappointed that you did not go over many details that you wrote in your book titled “Dal Mandylion di Edessa alla Sindone di Torino. Metamorfosi di una leggenda” published only in Italian. My Italian reading is slow. Can we expect an English (or French) translation of your book? Thank you for your answers. Mario, oui, une traduction sera publiée, ce qui me permettra aussi d’inclure certains changements. Si vous avez mon livre en italien, vous pouvez aussi consulter ma page en Academia où j’ai préparé un errata corrige (à la fin du document pdf): http://www.academia.edu/916021/Dal Mandylion di Edessa alla Sindone di Torino. Metamorfosi di una leggenda.","date":"2013-04-21","mins":"8:01 am","url":"https://shroudstory.com/2013/04/16/giulio-fanti-responds-to-gian-marco-rinaldis-book-review/","cat":"books","title":"Giulio Fanti Responds to Gian Marco Rinaldi’s Book Review"},{"id":"comment-191796","author":"andrea_nicolotti","post":"Mario, I am very disappointed. With a post signed February 24, 2015 (http://www.sindonology.org) today you announce there and in this blog that you published a book written in French, that «presents a complete transcription of both dissertations [of the manuscript 826]. The transcription of the first dissertation, for the authenticity, is new because this dissertation was never published before». This is a lie. I have started to work on it three years ago. My book was ready at the beginning of 2014. I sent the proofs to a professor of medieval history in University of Besançon and he, in September 2014, asked me to publish it in a collection directed by him. My book was printed on December 2015 and put in legal deposit on January 2015 (as it is written on the book himself that I have in my hands). In all this time you never know ANYTHING about the manuscript 826. In a discussion WITH ME on this blog on 1 December 2014 you asked me information about my book that you found JUST ANNOUNCED ON THE WEB FROM 23 NOVEMBER, BECAUSE IT WAS JUST FINISHED. On that day (1 December 2014) you looked for the manuscript 826, you found it on the web (it is online only because I paid the library for scanning every page of it FOR ME two years ago, and after they put it online) and on that same day you wrote “I just found it on the web.. I will read it”. Https://shroudstory.com/2014/11/27/the makeshift body bag of turin/ So, until 1 December YOU NEVER SAW that manuscript, when my book was just printed and waiting to be distributed in Besançon. And you knew it, because it was just announced on the web. The order paper is online from November. In Besançon they are waiting for my travel there to make two presentations in University and Diocese organized by them for 4 and 5 march. So, in two months or less you made a transcription from the images online paid by me, and you prepared your book, that contains, I think, a simple transcription of the manuscript, without any deep commentary. I transcribed it with a deep commentary (194 pages totally), and I have identified who wrote it, and his sources. And now you present a book printed by Lulu, a print on demand editorial who can prepare a book in few weeks or less, writing on the cover that the manuscript “was never published before”????????? This is very disappointing, dishonest, deceitful, fraudulent. I ask you to change your presentation on http://www.sindonology.org/ and also change the cover and the part of the text inside the book where you said that you prepared the FIRST TRANSCRIPTION of the manuscript. You can do it, Lulu does not print books if they are not bought. This blog is made to share news, or to stole news?.","date":"2015-02-25","mins":"8:07 am","url":"https://shroudstory.com/2015/02/25/new-book-by-mario-latendresse/","cat":"books","title":"New Book by Mario Latendresse"},{"id":"comment-191812","author":"andrea_nicolotti","post":"And I add also that on the same day, December 1, 2014 at 5:39 pm, in this same blog, answering to Mario Latendresse, I wrote: “As the manuscript is in French, and the Shroud is French, it seemed to me useless to do an Italian book. So, ****I have transcripted the manuscript****, and I have written an introduction and commentary”. Https://shroudstory.com/2014/11/27/the makeshift body bag of turin/ So, Mario was the first person informed that I did the transcription in abbok justi finished and available for order. And now, after three months, he presents a book writing that HIS transcription “is new because this dissertation was never published before” ?????????????? No words..","date":"2015-02-25","mins":"11:58 am","url":"https://shroudstory.com/2015/02/25/new-book-by-mario-latendresse/","cat":"books","title":"New Book by Mario Latendresse"},{"id":"comment-191922","author":"andrea_nicolotti","post":"1) I never received messages from you on my Academia. Never. I answer to all people. I have a website and a page at my university with two different emails. You could contact me through this blog, or ask if I received a mail. If you did not contact me, is because you did not want to do it. But any mail does not change the situation: I had finished a book with a transcription you were starting to do. Stop. You knew it. 2) In your book you state that the manuscript is “unpublished” or “inédite” that means only a thing: never printed before. You knew that my book was on press, so simply you tried to precede me, stealing my idea, but you failed. So you are both dishonest and lier. 3) Do not try to change argument with discussions about money or if I am or not misleading in the presentation of my book. Please, stop, it is pitiful. We are speaking about a very precise matter. No more. The readers and specialists will judge the content of my book, not you here. 4) You try to change the meaning of a very simple concept: text edited or not edited. The strange meaning you suggest, it is your invention. You claim to have made “une transcription inédite”, saying that my transcription will arrive after your transcription, so presenting you as the first: in reality I made the work before you and you knew that manuscript only because of me, when you learned that my book was just on press and publicized. It is clear that you made all this to publish before me a manuscript that five minutes before you did not know. In the first pages of your book is not made any reference to the fact that I made you know the text and I had just a book on press with the transcription. It seems that you made the work before all people. It is not a crime, it is a huge unfairness. All people and colleagues understand exactly what I am saying. For me the question is closed, you did what you wanted to do. But, if you have in mind to come near the Turin cathedral on the next exhibition, you must hope that I do not recognize you, because it could be very awkward..","date":"2015-02-26","mins":"4:32 pm","url":"https://shroudstory.com/2015/02/25/new-book-by-mario-latendresse/","cat":"books","title":"New Book by Mario Latendresse"},{"id":"comment-191837","author":"andrea_nicolotti","post":".","date":"2015-02-25","mins":"5:53 pm","url":"https://shroudstory.com/2015/02/25/new-book-by-mario-latendresse/","cat":"books","title":"New Book by Mario Latendresse"},{"id":"comment-191833","author":"andrea_nicolotti","post":"On December you learned that the manuscript 826 is available online, BECAUSE OF ME. Five minutes before you had no idea about what is the manuscript 826. My book was just printed at that time, printed but not still on sale (like my book about the Shroud of Turin, printed but not in sale: it will be on sale on 10 March). I said to you, and it was written on the website, that the book has (not “will have”) a transcription of the manuscript 826. THE FIRST complete transcription ever done. A sensible person does not transcript a manuscript just transcribed and being publishing, because it is useless and absurd. And does not publish a second transcription before seeing the first just done before him by another. You knew that the work was just done, because I told you. It was written on the editor’s website. You say that your main aim was that this transcription should become available in an book form for everybody to read at a very affordable cost? Why, if a book like this was just done? The price of my book was written on the page you read: 14 euros. Is not affordable? So, without telling me nothing, you transcribed the text very quickly to publish it as soon is possible with a print on demand editorial, in order to claim that you made the FIRST transcription. That was false and you knew it. “Not published yet” and “inédite” have a clear meaning. You run to arrive before, but you didn’t. My book was printed on December. It was put in legal deposit on January 2015. It is just stored at the National Library of France. Some copies are just circulating. Your book was published YESTERDAY, so AFTER. So, your transcription is not “inédite”. You started two years AFTER. Your book arrived some months AFTER. And you knew it. You printed on the cover of your book a false statement. So, it is NOT true that no clear printed version of the manuscript was available to the public. It is a lie. If you had doubts, you should have asked me or my editor. But why doubts? I TOLD YOU. An now you claim to be the first when you are the second; and some readers will be deceived, buying your book or perhaps wondering why a stupid Nicolotti publishes a text already published, which is an idiocy. This is my job, not a game or a pastime. Being editor of an unpublished text is not the same as being editor of a text already published. Some people, unaware, will believe that you are the first editor. I am not upset, I am furious, especially because I see that now you take me for a ride. You have a doctorate and you know perfectly how these works are going. I did not know that the faith on the shroud means also this: it is the SECOND time that a shroudie claim to have done something before me, using my informations. Only because I am generous in explaining things to people who ask me, like you that in this case never heard about manuscript 826 before I told you, and I HAD JUST FINISHED THE WORK YOU CLAIM TO HAVE DONE FIRST. Your money for the images is nothing for me. Again, this is my work, and you were unfair. Stop. I do not tell other things, but you knows perfectly whath think about you..","date":"2015-02-25","mins":"4:40 pm","url":"https://shroudstory.com/2015/02/25/new-book-by-mario-latendresse/","cat":"books","title":"New Book by Mario Latendresse"},{"id":"comment-191838","author":"andrea_nicolotti","post":".","date":"2015-02-25","mins":"5:53 pm","url":"https://shroudstory.com/2015/02/25/new-book-by-mario-latendresse/","cat":"books","title":"New Book by Mario Latendresse"},{"id":"comment-191868","author":"andrea_nicolotti","post":"David, thank you. The problem is not what he wrote about the manuscript: if the manuscript is online, it does not mean that it is “published”, it is only “photograhed”. The pictures of it are online because I bought them when I started to work on it. So, it is true that it was unpublished, but only UNTIL I PUBLISHED IT. The problem is that Mario was totally unaware about that manuscript until he read on this blog my posts, and until he read the information about my book AVAILABLE IN NOVEMBER. So he found this manuscript online on 1 December, when my book was on press and knowing that I had just done the work of transcription. I TOLD HIM. So he decided to arrive before me, copied the manuscript (tedious work, but not so difficult) and put on sale claiming to be THE FIRST to publish it. And he was not, because my book PRINTED has the date of january 2015, and his book has the date of 24 February. In order to arrive first, probably because he thought to be the most clever in the world, he was silent with me and did not wait to see my book, that is the NORMAL thing that every honest scholar does in cases like this: BEFORE it is necessary to see the work just done, and AFTER, if necessary, it is possible to publish some integrations, corrections, etc. Probably his work is hurried and incomplete (he did in few weeks). Probably his transcription is useless, because he modernized the text (that means that he did not reproduce the original text with his French language of the XVIII century, but changed it in a modern French language; that, by the way, means that he DID NOT publish a manuscript, but a PARAPHRASE of it). Probably he made a simple transcription with some notes and without historical commentary. So, there is not true “competition” about me and him. But all this he did with all possible speed, only to announce his work as THE FIRST EDITION (that is not). This is simply disgusting. I asked him to change his cover and his introduction on his book, stating unequivocally that: 1) he knew the existence of this manuscript THANKS TO ME ; 2) That my transcription was just done and on print, when he discovered and started to read the manuscript; 3) consequently, his edition is the SECOND edition of the test, DONE after and PRINTED after. And this is not a matter of pro or against authenticity, is a matter of honesty and true..","date":"2015-02-26","mins":"5:29 am","url":"https://shroudstory.com/2015/02/25/new-book-by-mario-latendresse/","cat":"books","title":"New Book by Mario Latendresse"},{"id":"comment-157467","author":"andrea_nicolotti","post":"In fact, the only defect of this book is the price : ).","date":"2014-09-28","mins":"10:46 am","url":"https://shroudstory.com/2014/09/26/the-metamorphosis-and-manipulation-of-a-legend/","cat":"books","title":"The Metamorphosis and Manipulation of a Legend?"},{"id":"comment-68576","author":"andrea_nicolotti","post":"In the pdf of the “Papers from 1991 Shroud Conference” are not present the pages 130 154, 226 255, 325 345, 351 ff..","date":"2013-12-26","mins":"6:32 pm","url":"https://shroudstory.com/2013/12/26/papers-from-1991-shroud-conference/","cat":"news_&_views","title":"Papers from 1991 Shroud Conference"},{"id":"comment-126453","author":"andrea_nicolotti","post":"Hide your ass: http://www.hidemyass.com/.","date":"2014-06-03","mins":"6:47 am","url":"https://shroudstory.com/2014/06/03/and-speaking-of-secondo-pia/","cat":"video","title":"And speaking of Secondo Pia"}]}
