{"art":[{"author":"angel_wynton","post":"there was no photograph at that time, and Ray Downing and his whole team found the tornplant that is only growing in Israel, als the blood is from a virgin birth.\nthose people want to get his right, but the true is Ray is right, who else clean my fish tank 250 gallon? Nobody can change my mind, since the painting is near the tank its pure clear water.\nAnd it proofs Yehoshua (Jesus) is still alive and around us and in us everywhere.\nAnd even my new baby Malawi’s eat out of my hand.\n\n","date":"September 4, 2014 at 10:39 am","url":"https://shroudstory.com/2014/09/04/speaking-of-matching-faces/","cat":"art","title":"Speaking of Matching Faces"},{"author":"angel_wynton","post":"Dan you said it yourself in the video, its not a painting of a artist, and when it come to a jury\nthey said its autentical, 100% proof.\n\n","date":"April 25, 2014 at 4:54 am","url":"https://shroudstory.com/2014/04/25/paper-chase-pam-moon-suggests-lucas-cranach-the-elder-painted-the-lier-copy/","cat":"art","title":"Paper Chase:  Pam Moon Suggests Lucas Cranach the Elder Painted the Lier Copy"},{"author":"angel_wynton","post":"Akiane paint one thing good, the eyes of Jesus are beautiful and are light green/blue\nRay downing painted the eyes brown. Perhabs he things all jewish people has brown eyes?\nThat is not true. allot of them have green/bleu eyes and even read hair.\nKiane well done also Ray downing great work\nThe schroud of Turin is for real.\n\n","date":"March 21, 2012 at 1:51 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}],"dating":[{"author":"angel_wynton","post":"Fact is, that the shroud never get lost!!\nAny substance normally consumed after 100 years\nIf you see that it even survived a fire\nBut this shroud after 2000 years is quite\nin strokes. And that alone is a miracle.\nI have no doubt more, in fact\nThe shroud strengthened my faith and\nThe paintings now hang on the walls.\nRemember that everyone saw Jesus\ntoaal deformed and beaten so badly\nAnd they saw him die on the cross.\nWhat amazed me is that 500 people\nsaw it alive. And the dead from the grave came\nand they went to Heaven with it. They will be much\nmore secrets for us than we even held\nmar imagine. But the biggest secret is now\nuncovered by Ray Downing and his team.\nAnd I think these people are elected. By Jesus\n\n","date":"April 23, 2014 at 7:16 pm","url":"https://shroudstory.com/2014/04/23/new-paper-the-missing-corners-and-the-radiocarbon-date/","cat":"carbon_14_dating","title":"New Paper: The Missing Corners and the Radiocarbon Date"},{"author":"angel_wynton","post":"Its more easy even, cause the Shroud is a real healing cloth!\nThat means, everyone who touch the shroud and are sick…?\nThose people get  heald right away, but its behind glas.\n\n","date":"April 24, 2014 at 4:54 am","url":"https://shroudstory.com/2014/04/23/new-paper-the-missing-corners-and-the-radiocarbon-date/","cat":"carbon_14_dating","title":"New Paper: The Missing Corners and the Radiocarbon Date"}],"events":[{"author":"angel_wynton","post":"I believe what Ray Downing has made out of the Shroud, is accuraat, 100% the True Face of Jesus. What more do I want, I have a large print on canvas, the last new one 2, a real birthday present from my  husband . Every day I look into the face of Yehoshua Ha Messiach(Jesus) and that alone gives me a warm feeling. People can have confereces or not, true is this is Jesus of Nazareth our Messiah, and raised from the dead. I believe He even follow us in all the things we do, cause there must be a fourth demension wich we can not see with our eyes. But this will be restored by the Lord himself.\n\n","date":"June 2, 2014 at 4:25 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"}],"forensic":[{"author":"angel_wynton","post":"The team of Ray Downing did perfectect work, be sure of that!\n\n","date":"April 27, 2014 at 9:00 am","url":"https://shroudstory.com/2014/04/26/how-valid-are-the-vignon-markings/","cat":"art","title":"How Valid are the Vignon Markings?"}],"image":[{"author":"angel_wynton","post":"Almost a year ago, I bought the canvas picture from the shroud from Ray Downing\nAfter that I wrote that my fish tank was brand new and cleaned up in one night.\nAnd that was, on the evening I’ll put the canvas picture of Jesus there.\nOne year later, the tank is still clean without touching it by me or my\nhusband. Nobody ask me about that, if the Shroud was not real this\nwould never been happening. But the shroud is real and Jesus is more\nalive then anybody can think of. I better say this, the shroud is so much\nalive, that even by passing it true on canvas, Jesus clean and show\nthat He is alive. I’ll bet nobody can explain my real story, scientist\nalways doubt Jesus, because they lost the child in them, they have\nto wait until Jesus come’s back. But it seems to me that even that\nRay Downing and his team show us Jesus, allot of people still\ndoubt that Jesus is alive. I am not a scientist, but a believer.\nA Jewish Christian,, from the bloodline mothers side.\n\n","date":"June 21, 2015 at 9:24 am","url":"https://shroudstory.com/2015/06/20/resolution-of-the-shroud-image/","cat":"image_theory","title":"Resolution  of the Shroud Image"},{"author":"angel_wynton","post":"The Shroud is a code cunstruction set, nou doubt about it, and this photograph is a flat produced image by Bernardo Galmarini. Ray Downing is the only one who made it by numbers and is a expert.\n\n","date":"April 12, 2014 at 3:53 am","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?"}],"misc":[{"author":"angel_wynton","post":"They both got it wrong, its a Jewish burial Cloth, and a Holy  Cloth to.\nThe blood can still heal people, why don’t they  see those things?\nI just wonder????? Why  do they not use this cloth?\n\n","date":"April 25, 2014 at 4:58 am","url":"https://shroudstory.com/2014/04/25/do-protestants-view-the-shroud-differently/","cat":"news_&_views","title":"Do Protestants View the Shroud Differently? ."},{"author":"angel_wynton","post":"Everybody a Happy Easter to start with.\nI will put more evidents with this youtube movie.\nIt seems Thimoty has the shroud and ask for it\nby that time he was in Turkey, guess what the King\nhold the shroud while he was sick and get heal when he hold  the shroud.\nAnd that event is true, read and listen.","date":"April 20, 2014 at 4:15 am","url":"https://shroudstory.com/2014/04/19/its-called-circumstantial-evidence-anybody-have-a-better-idea/","cat":"news_&_views","title":"It’s called circumstantial evidence. Anybody have a better idea?"},{"author":"angel_wynton","post":"@Daveb\nThere are allot of deseases they can’t cure Daveb, and poor people heardly can pay\nvoor a good doctor these days. And the soul is a matter of believing in Jesus.\nJesus himself would have said use the burial cloth, I am sure of it!!\n\n","date":"April 25, 2014 at 1:18 pm","url":"https://shroudstory.com/2014/04/25/do-protestants-view-the-shroud-differently/","cat":"news_&_views","title":"Do Protestants View the Shroud Differently? ."}],"resources":[{"author":"angel_wynton","post":"Larry the Shroud is not a painting at all, it has no paint but human blood staines.\n\n","date":"April 10, 2014 at 4:21 am","url":"https://shroudstory.com/2014/04/08/lawrence-e-schauf-for-the-prosecution-the-trial-of-the-shroud/","cat":"article","title":"Lawrence E. Schauf for the Prosecution: The Trial of the Shroud"}]}
