{"resources":[{"id":"comment-29559","author":"ankenyman","post":"Fanti’s study looks like it’s full of holes, but Rinaldi is just as biased against the authenticity of the Shroud as Fanti is in favor of it. Rinaldi appears to be ignorant of the study of the history of the Shroud. He ignores the Image of Edessa, the Sermon at Constantinople in 944 AD about the arrival of the Shroud there, and the Pray Manuscript which shows a drawing of the Shroud from approx. 1192 AD..","date":"2013-04-05","mins":"6:53 pm","url":"https://shroudstory.com/2013/04/04/a-critical-review-of-giulio-fantis-new-book-unreliable-results-because-of-inadequacy-of-methods/","cat":"books","title":"A Critical Review of Giulio Fanti’s New Book:   Unreliable Results Because of Inadequacy of Methods"},{"id":"comment-29952","author":"ankenyman","post":"CD = carbon dating..","date":"2013-04-08","mins":"8:03 pm","url":"https://shroudstory.com/2013/04/08/charles-freeman-on-peer-review-and-the-provenance-of-samples/","cat":"books","title":"Charles Freeman on Peer Review and the Provenance of Samples"}],"opinion":[{"id":"comment-2090","author":"ankenyman","post":"Ha, it says in the caption below a picture of the Shroud: “Take away the bloodstains from the Shroud (left) and what are you left with? Simply an image of a naked man, with no obvious wounds, except with the eye of faith.” That’s like saying about a forensic report of a murdered man, “If it wasn’t for the bullet holes and blood on the body, this dead, bullet riddled man would be simply a man with no obvious wounds, except with the eye of faith.” You are so biased that you refuse to acknowledge the obvious evidence right in front of you. You have no credibility and your rantings are worth nothing because you have an agenda and no objectivity. No evidence of wounds on the Shroud? Wake up. There’s only over one hundred of them..","date":"2013-04-07","mins":"1:49 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/12/dear-royal-society-time-maybe-to-take-a-hard-line-on-those-who-peddle-turin-shroud-pseudoscience/","cat":"medieval_forgery","title":"Dear Royal Society. Time maybe to take a hard line on those who peddle Turin Shroud pseudoscience?"}]}
