{"art":[{"author":"ann","post":"Thank you so much for the uplifting comment.  I have to tell you that as God is my witness, the day after I posted my comment, my husband and I were having dinner and he told me of an “incredible” dream he had last night.  His dream of “a little boy” with a “backpack” on him as if getting ready to go to school put his arms around my husband and said “I love you very much.”  As my husband is telling me this, my mouth was dropped and I didn’t answer right away.  I had not told my husband yet of my posting my comments.  He said it was the most “overwhelming love” he ever felt.  This confirms to me that we cannot even imagine the type of love that awaits the faithful.  After I told my husband about this, he just looked at me (he had obviously known about my miscarriage and I always told him I deeply felt it was a boy) and he was quiet all weekend, although appeared hopeful.  I have to say that when I was at mass yesterday, I cried for my Michael.  But, I know he is safe and LOVED.\nGod Bless You,\nAnn\n\n","date":"October 3, 2011 at 9:27 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"ann","post":"God Bless You.   It is so true.  I truly believe you will see your father again.  Our Lord and Savior, Jesus Christ, has the final say.  You believe in Him and He will believe in you, too.  A friend in Christ.  Ann\n\n","date":"January 19, 2012 at 11:35 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"ann","post":"I just finished HEAVEN IS FOR REAL and really enjoyed it.  I am a 44 year old mother of two and have been a practicing Catholic all my life.  I love the fact that Colton said he also saw Mother Mary in Heaven knealing by Jesus and that she still worries for Him as a mother would do.  I also miscarried before I had my two daughters and always deeply felt I lost a son.  I would love to see my son in Heavan one day but until then, God the Father has adopted him.  At the very least, God the Father, Jesus the Son, and the Holy Spirit have the final say.  HE is the Alpha and the Omega.  HE is the Way, the TRUTH, and the LIFE.  I’m not sure why there are skeptics in this world and that everthing has to be a perfect match.  Just know, please, that Jesus came into the world to die for our sins so that all humanity can be saved.  He loves us that much!  I have people throughout my life dry to “discourage” me from my faith.  Why?  I’m not sure.  I can tell you in my experience that some discourage because it is hard to live up to the ten commandments and perhaps this is a way of dealing with it?  All in all, whatever the reason, HE is there for us, and for that I AM TRULY GREATFUL.\n\n","date":"September 29, 2011 at 10:56 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
