{"art":[{"author":"annette_cloutiér","post":"Agree. And, it should be done.","date":"May 16, 2014 at 7:17 pm","url":"https://shroudstory.com/2014/05/16/mandylion-of-edessa-images/","cat":"art","title":"Mandylion of Edessa Images"},{"author":"annette_cloutiér","post":"Awesome!  Now we have comparative and empirical evidence that the Mandylion(s) are Shroud copies and Shroud cover-ups!","date":"May 16, 2014 at 7:14 am","url":"https://shroudstory.com/2014/05/16/mandylion-of-edessa-images/","cat":"art","title":"Mandylion of Edessa Images"},{"author":"annette_cloutiér","post":"This is such an intriguing question, Russ.  I can’t help but associating the L-Shaped Markings with the L-Shaped (Chevron) over the inner circle on the 1st Century Jesus Family Tomb.  But I know a host of other critics will not see this relationship as a resurrection symbol.  I once read on a Tabor Blog that this symbol was also used as a resurrection sign on the Mausoleums of Augustus and Tiberius.  It does seem to be a first century cultural fad.","date":"July 24, 2014 at 9:39 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","title":"Origin of the Gammadia"},{"author":"annette_cloutiér","post":"http://www.bing.com/images/search?q=jesus+family+tomb+images+over+tomb&id=B295B52057203C4688D1874E7A9E7D0223B26CE1&FORM=IQFRBA#view=detail&id=93D183BAB2FA26AAB50A58B6E0F6A6BC9EEF8451&selectedIndex=6     Also… a few more pictures of the L-Shaped (aka Chevron) symbol over the 1st century Jesus Family Tomb ..http://www.jesusfamilytomb.com/the_chevron.html..","date":"July 24, 2014 at 10:29 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","title":"Origin of the Gammadia"}],"dating":[{"author":"annette_cloutiér","post":"Wow Colins… just have to say I don’t understand your logic let alone your “science”.  Joe Nickels tried to reproduce the Image on linen.. he got the shadowy results somewhat like the TS’s Image, but no 3-D information!… You say you reproduced an Image on linen with 3-D information?  Why wasn’t it published?  Did you also produce the same 120 marks of scourges, the wounds on the head, side, feet, wrists so we can clearly see this and say Wow:  this must be the Jesus of the Gospels… until you can be so creative, I really must say that I can’t get into your science or logic about the Shroud.","date":"January 23, 2014 at 6:58 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"annette_cloutiér","post":"Colin… just wanted to add that I’ve followed your web page and you’re very colorful but while you can refute the date with the 1988 C14 testing of the fabric… still, I remain unsure about the medieval theory with the unique and enigmatic formation of the Image that wreaks of a 1st century Roman crucifixion.","date":"January 23, 2014 at 7:12 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"annette_cloutiér","post":"Thanks Colin… quick reply and explains your position succinctly.  Just wondering about further testing… with the thymol used to preserve the TS instead of argon do you really think that the absence or presence of bilirubin and/or protoporphrin IX could be determined?  I understood that the thymol alters the chemistry extensively.","date":"January 23, 2014 at 7:35 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"annette_cloutiér","post":"Thanks Colin… hope you get your opportunity sooner than later to do that most needed ultimate test!","date":"January 23, 2014 at 8:31 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"annette_cloutiér","post":"David, I wouldn’t pray too hard for this request… the Shroud will always mean something different no matter what for each individual:   every pope, religious, scientist, businessperson, historian, artist, writer, et al  because of its unique mystery.  It’s good we can debate it.  It’s good there is this forum.  It’s good we can share information about it all so freely without having to rupture our purses.","date":"January 24, 2014 at 12:08 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"annette_cloutiér","post":"I wonder what blood solvents Tryon and Mattingly used in 1993 when they confirmed Adler’s find of AB+ male DNA.","date":"January 24, 2014 at 5:34 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"annette_cloutiér","post":"Hugh, I can’t agree with this hypothesis… (1) a scorch with iron would produce a smooth surface of the fabric scorched… flattening the fibrils of the linen… the fibrils of the Shroud are neither flattened nor refined to a smoothed shiny surface as an iron would do.  (2) Others notably John Jackson, Joe Nickel, et al tested this scorching hypothesis many times… and could not reproduce the 3-D information nor the X-ray of the (teeth, hands, etc ) information.3) No bodily decomposition was found on the Shroud… 4) the prominent wounds on the Shroud cannot be reproduced by painting nor drawn in by any genius artist to match in 3-D information and negative quality.  If you think for a second that Geoffroi de Charney could have reproduced his uncle’s imagine to look like his Lord Jesus Christ… such a feat of photography should be able to be done today.  But it cannot be replicated now, and common sense would say that it wasn’t done in the 13th, or 14th centuries!","date":"January 24, 2014 at 11:19 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"annette_cloutiér","post":"Colin… I can’t believe your still using the old: But Bishop Pierre d’Arcis excuse that the Shroud was a painting and he knew the painter!  Everyone knows or should know by now that the Shroud had it’s substitute shrouds… (notably at St. Etienne’s in Besancon (cf. Dan Scavone Daniel Scavone, Shroud the Missing Years, Ohio Conference 2007, andShroud.com/scavone.htm)… D’Arcis was concerned that Lirey was getting a good influx of cash whilst his diocese was suffering from all the fervor created by the exposition of the Lirey Shroud.  He may have known the painter of the substitute Shroud at St. Etienne’s but he surely didn’t know the artist of the Shroud at Lirey.","date":"January 24, 2014 at 11:35 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"annette_cloutiér","post":"Hugh, right, the DeCharnay/ DeMolay roasted Templar hypothesis is Colin’s… but please explain your reply:The wounds on the Shroud can easily be reproduced by painting, do not necessarily reflect1st century Roman crucifixion practices accurately, and have no 3-D information or interesting negative quality.  Why should they have  3-D information  or negative quality information… The wounds are there… what an artist to show such accuracy on legs, and torso back and front!  Those scourging’s are there and most sindonologists agree it was inflicted by a Roman flagrum… I don’t know that an artist could have painted them in… we’ve ruled out painting when it comes to the Image.    I’m wondering how you can be so attentive to this blog.  It’s mind boggling how well you respond to everyone… I am grateful.  I’m wondering too if there’s a chance we could have the luxury of meeting you in St. Louis at the October 2014 Shroud Convention.","date":"January 24, 2014 at 5:58 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"annette_cloutiér","post":"Right, most of us are familiar and easily understand Benford & Marino’s 2000 Orvieto hypothesis, and the 2005 reinforcement given by Ray Rogers.  When Hugh writes about Adler’s study of the  C14 testing area being like the rest of the Shroud… I (and I dare say most of us) become lost once again in this “on the fence”  posture.","date":"January 25, 2014 at 11:08 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"annette_cloutiér","post":"Charles what about Raes’ 1973 study of the corner mostly cotton… did he have a percentage?What about Flury-Lemberg saying that the seam was that of the Herodian Jews of Masada (1st century Jews). So wouldn’t the seam be contrary to the 13th century hypothesis and the 1988 C14 dates?","date":"January 25, 2014 at 3:43 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"annette_cloutiér","post":"Hugh Farey :Ooh, flattery will get you anything.Still,When I say the wounds can be reproduced by painting, I mean they are fairly easy to simulate using paint, blood or a mixture, although until what they were actually made of is established, it will be impossible to replicate their chemistry. It was their shapes I was thinking of.Much to most people’s surprise, we have very little idea of what a Roman flagrum (or flagellum) looked like. None have ever been found, and there are a few illustrations on coins and the like, all different. It was obviously some kind of thonged whip, but how many thongs or tips, and what the tips might have been made of, is anyone’s guess (see Mel Gibson’s Passion film). It may be that the marks on the shroud exactly match a Roman flagrum, or it may be that a painter just came up with a good idea. The two designs of Roman flagrum that copies have often been made of and photographed were based specifically on measurements made of the Shroud itself, and do not even resemble the ancient illustrations.Much to most people’s surprise, we have no idea whether people were nailed through the palms, hands or lower arms. Although elaborate demonstrations with real corpses have shown how a hanging body would be too heavy for a dead weight on the arms, many Roman descriptions mention a sedile or seat, sometimes described as a horn sticking out, on which the victim sat, removing all the weight from his arms altogether. It may be that the nails through the wrists thing exactly match a Roman crucifixion, or it may be that a painter just thought it might be a good idea (perhaps he experimented on corpses too!).Much to people’s surprise, blood does not trickle down the outside of hair. It oozes out from the scalp and mats it into a bloody mass. Google news pictures of terrorists bombs for confirmation. To be fair, some people have supposed that the blood flows down the side of the face were imprinted on the shroud from the cheeks, whereafter the shroud realigned itself horizontally to receive the image of the hair, which was thus out of register with the blood flows. However this does not account for the trickles which appear at the back of the head.Much to people’s surprise, blood does not zigzag out of a stab wound to the chest, it flows straight down. To be fair, some people have surmised that the bloodflow from the chest occurred after the body had been taken down from the cross and the original blood had been washed off, and stained the cloth as the body was wrapped or draped with it. This is quite a reasonable scenario.You mentioned earlier that the wounds could not be “drawn in by any genius artist to match in 3-D information and negative quality.” All the blood flows are now fairly uniform pinkish stains, and do not display any particularly interesting features in terms of any relationship between their colour intensity and distance, which is the basis of the 3D effect, or in terms of their negativity (they just turn green).Delighted to be of assistance!You’re right!  I was much surprised!  What’s the 10% your giving to the Image having been formed to?  (Something like an alien communication from a parallel Universe?  Something which may have formed the Image on Guadalupe or Manoppello?)","date":"January 25, 2014 at 3:54 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"annette_cloutiér","post":"Does anyone know what ever became of the cutaway seam in the C14 area taken by Riggi in 1988?  Was his private study ever made public?","date":"January 26, 2014 at 5:04 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"annette_cloutiér","post":"Thanks Barrie!  This really set the Rogers’ story straight… right from the horses’ mouth  (as in work-horse)!","date":"January 22, 2014 at 12:00 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"annette_cloutiér","post":"Hey Hugh…thought this site might be necessary for you and yours to review!","date":"January 22, 2014 at 12:20 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"annette_cloutiér","post":"John, I’m so with you here!  The mouse that roared going on for the most part with this can’t see the forest for the trees anti-Shroudies!  BTW… did you ever see the 1983 interview of John Heller by Merv Griffin? It was a YouTube video that lasted about 6 months about two years ago and then was pulled.  It was a very insightful video to Heller’s Book Report on the Shroud with some timeless in depth questioning by Merv Griffin.","date":"January 22, 2014 at 12:05 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"annette_cloutiér","post":"I wonder if John Jackson & Flury-Lemberg put their high powered microscopes (as did Ray Rogers in 2005) to the area of the 1973 Raes Corner / 1988 C14 testing area  would they be so resolute in their assertion that there is no reweaving in this area.","date":"January 24, 2014 at 2:10 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"annette_cloutiér","post":"Hugh, now wait a minute here… you’re refuting Rogers completely!  While I respect your independent scrutiny of Barrie’s Quad Mosaics, Barrie will have to weigh in on your observation that they are not even of the RadioCarbon (Cotton rewoven) corner.  And as far as French reweaving, I had my St. John Knits from Sax Fifth Avenue French rewoven in the 1980’s.  I never could tell where those former holes were in my suits.  I admit, the suits were woolen not cotton or linen but with a French-reweave someone in 1988 like textile expert Flury Lemberg or C14 specialist Mike Tite could easily have been deceived and hid their embarrassment.","date":"January 22, 2014 at 12:19 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"annette_cloutiér","post":"I’ve looked at Barrie’s Quads many times, always believing the greenish area was of the Raes Corner.  So are you the only researcher saying that this greenish area is from under the buttocks… far removed from the Raes Corner and on the opposite (dorsal) side?  Thanks Hugh; you are truly giving a teachable moment here, but there are so many contradictions rather than bona fide clarifications.","date":"January 22, 2014 at 3:57 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"annette_cloutiér","post":"If you weren’t so British and so polite.. I’d think you were daft!  I’ve looked at these quads over and over and I do not see the greenish dark area any where’s near the buttocks or head area.  I see light blue bands, oranges and pinks… but at that infamous Raes Corner on the ventral lower leg area I clearly see a dark greenish patch… what is this patch Hugh?  Why is it so abnormally different from the rest of the Shroud?","date":"January 22, 2014 at 5:17 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"annette_cloutiér","post":"No Hugh, you can’t make it clearer… but where you see green patches in other frames after 8:40, I see only a blur of green in the charred patched holes.  I don’t see what you seem to see so readily: “The green patch appears in the same place on every photo.”  I only hear Rogers upset that the 1988 C-14 labs didn’t first check with the tests (viz. Barrie’s photographs/Quad Mosaics) and an overwhelmingly prominent green patch unlike any other on the Shroud in that one Cotton-Pickn Corner!   But thanks.  I am grateful for your insights. I just wish others would reference your insights directly, rather than referring us to more written “scientific” findings, or dance around what you are saying.","date":"January 22, 2014 at 8:29 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"annette_cloutiér","post":"Very nice… Hugh, very clear…  I’ll have to think about this more and read Morgan’s paper recommended by Joe Marino.  (Something that I was hoping I wouldn’t have to do tonight).  Do you think you could email John Morgan with your concerns Hugh?  Thanks for all your help.  I think I’m turning pretty green now.","date":"January 22, 2014 at 11:11 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"annette_cloutiér","post":"This makes terrific logical sense dave… good summation. Thank you.","date":"January 23, 2014 at 8:36 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"annette_cloutiér","post":"Annette Cloutier :John Klotz :Annette,I don’t know how long you have been contributing to the blog, but the last few months they have caught my eye. Like Paulette, you are short and to the point. I am trying to put to bed a somewhat complex part of my manuscript which is an analogy between the La Bella Principessa and the Shroud. It covers the functions of science and skepticism when the issue is disputed provenance.I glad there are individuals like yourself keeping “an eye on the store.”</blockquote.Merci pour le compliment!  So John, who is this beautiful princess you are writing about… Is it Marguerite de Savoy, or Princess Clotlide or is there another?  Can you give us a thread?John, thank you for this succinct explanation as well as the one on 20th January pertaining to Leonardo’s lost portrait of La Principessa (Bianca Sforza).  I glazed over the January 20th blog because anytime I see Leonardo da Vinci in the same paragraph as the Shroud, I fade away…the whole Prince & Picknett mire we were all subjected to 5 years ago.  I’ve been redirected to give you a standing O for this insight!","date":"February 2, 2014 at 11:07 pm","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?"},{"author":"annette_cloutiér","post":"Joe, I would be more than infuriated with the direct hit to sabotage the truth you and Sue worked so tirelessly to reveal.","date":"February 1, 2014 at 6:34 pm","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?"},{"author":"annette_cloutiér","post":"Interesting,  I wonder if it could still be reviewed today by a textile journal?  I bet there would be many textile specialists ready to give Joe Marino credibility.","date":"February 2, 2014 at 8:23 am","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?"},{"author":"annette_cloutiér","post":"John Klotz :Annette,I don’t know how long you have been contributing to the blog, but the last few months they have caught my eye. Like Paulette, you are short and to the point. I am trying to put to bed a somewhat complex part of my manuscript which is an analogy between the La Bella Principessa and the Shroud. It covers the functions of science and skepticism when the issue is disputed provenance.I glad there are individuals like yourself keeping “an eye on the store.”</blockquote.Merci pour le compliment!  So John, who is this beautiful princess you are writing about… Is it Marguerite de Savoy, or Princess Clotlide or is there another?  Can you give us a thread?","date":"February 2, 2014 at 5:14 pm","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?"},{"author":"annette_cloutiér","post":"What a truly great statement of fact and history regarding the TS!  Of course the relic craze of Medieval Europe was rampant!  And, of course everyone who thought of themselves as royal wanted a piece from the King of Relics– the “Holy Shroud!”  This would mean, however, that another Carbon-14 test would have to go deep into the Image itself where there was no invasive relic mining.  It would be quiet a 21st Century dare!  Joe Marino & his wife Sue were the first to recognize the patchwork for relic craze viz. done in 1520 by Marguerite of Austria’s staff of French reweavers.  Now, how many other patchwork stints surround the Image of the Shroud?","date":"May 20, 2014 at 12:20 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"}],"events":[{"author":"annette_cloutiér","post":"Lovely…a well prepared perspective and package, Russ; it keeps many of us together in faith, hope, & love.","date":"June 10, 2014 at 10:16 am","url":"https://shroudstory.com/2014/06/10/add-to-cart-the-shroud-of-turin-prophecy-package-by-russ-breault/","cat":"lectures","title":"Add to Cart:  The Shroud of Turin Prophecy Package by Russ Breault"},{"author":"annette_cloutiér","post":"Barrie, this was a clear and concise interview. Thoroughly enjoyable in each and every aspect.  Thank You!","date":"November 7, 2013 at 9:41 pm","url":"https://shroudstory.com/2013/11/06/barrie-on-ewtn-liveand-again-in-repeats/","cat":"event","title":"Barrie on EWTN, Live–and again in repeats"},{"author":"annette_cloutiér","post":"John, lucky you!  I can’t wait to meet Barrie myself having corresponded with him for two years, like yourself, and spoken to him from time to time over the phone… He’s very accessible and informative… which is totally unexpected for the only surviving key photographer of STURP together with his friendship providing the important liaison between Ray Rogers, Joe Marino (and Joe’s wife Sue Benford) who cracked the mystery of the skewed 1988 C14 dating.  When I was at Harvard, I studied under a Jesuit confrere of Thurston’s, the then Charles Chauncey Stillman Professor of Roman Catholic Studies… the Rev. Prof. George Windsor MacRae, S.J.  He informed me in 1978 that the Shroud was “a painting”.  When I asked him who made such a statement, he said the late Herbert Thurston, S.J. Of course I didn’t accept his statement, because intuitively, even in 1978, despite no one else stating it then, I felt the Shroud gave the impetus and inspiration, i.e., was the Source, for the NT.  Too bad the late Rev. Peter R. Beecher never came to Harvard.","date":"February 27, 2014 at 11:44 am","url":"https://shroudstory.com/2014/02/27/barrie-schwortz-at-st-johns-from-skepticism-to-belief/","cat":"event","title":"Barrie Schwortz at St. John’s:  From Skepticism to Belief"},{"author":"annette_cloutiér","post":"Someone ought to video tape this and upload it on YouTube for all seeing how the admission is free.","date":"January 28, 2014 at 9:10 am","url":"https://shroudstory.com/2014/01/28/ian-wilson-to-speak-on-the-shroud-of-turin-in-melbourne/","cat":"event","title":"Ian Wilson to Speak on the Shroud of Turin in Melbourne"},{"author":"annette_cloutiér","post":"Second that.  Short, sweet, simple!","date":"March 4, 2014 at 8:45 am","url":"https://shroudstory.com/2014/03/03/more-on-barrie-schwortz-at-st-johns-university/","cat":"event","title":"More on Barrie Schwortz at St. John’s University"},{"author":"annette_cloutiér","post":"Ooops Dan, you forgot to mention this Sunday, 9 March, at 7pm at Christ the King Church in Mashpee on Cape Cod.","date":"March 6, 2014 at 11:18 am","url":"https://shroudstory.com/2014/03/06/russ-breault-on-the-road-again/","cat":"event","title":"Russ Breault on the Road Again"},{"author":"annette_cloutiér","post":"Nice Pic Dan!  Perhaps you should also add Robert Villarreal, Mark Antonacci, and Robert Rucker to this photo.","date":"October 12, 2014 at 9:58 pm","url":"https://shroudstory.com/2014/10/11/chart-of-conference-well-so-far-anyways/","cat":"st_louis_2014","title":"Chart of Conference. Well, So Far, Anyways"},{"author":"annette_cloutiér","post":"AWESOME Russ, This work was instrumental, informative, and invaluable!","date":"November 27, 2014 at 7:55 am","url":"https://shroudstory.com/2014/11/26/st-louis-videos/","cat":"st_louis_2014","title":"St. Louis Videos"}],"forensic":[{"author":"annette_cloutiér","post":"What a beautiful insight!  Thanks Micheil! This explains the rigor mortis state well for the Image.","date":"February 11, 2014 at 12:06 am","url":"https://shroudstory.com/2014/02/10/anatomical-accuracy-chart/","cat":"uncategorized","title":"Anatomical Accuracy Chart"}],"history":[{"author":"annette_cloutiér","post":"According to Wikipedia, “rigor mortis is one of the recognizable signs of death, caused by chemical changes in the muscles after death, causing the limbs of the corpse to become stiff and difficult to move or manipulate.[1] In humans, it commences after about three to four hours, reaches maximum stiffness after 12 hours, and gradually dissipates from approximately 24 hours after death.”  So one could say that the TSM was in a state of rigor mortis when taken down from the cross but when laid in the tomb after burial preparation, his arms and hands became conveniently relaxed to extend in modesty.  Who moved those hands in that moment may present another question.","date":"February 7, 2014 at 7:05 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"author":"annette_cloutiér","post":"Louis, you are so well read in traditional academic biblical exegesis… I in admiration and respect your perspective wholeheartedly for this.  However, in order to make serious sense of the phenomenon of the overpowering of Christianity something other than stories of a god-man’s overcoming death with resurrection as in Osirus, Aesclepius, Mithras, et al…which were strong cults at the time… something had to energize the movement and give concrete foundation to it other than Story… Hence the Not Made With Human Hands phenomenon of the Shroud…As far as Paul being a Pharisee and not given to Plato and other burgeoning Neo-Platonists of Paul’s time and culture… Pharisees were highly educated to the influx of Greco-Roman ideas but clung to the belief of Resurrection, Angels, and Spiritual beings more than the Sadducees who had no appreciation for such matters… The Sadducees were this world legalists….they were also radically conservative not wanting to deal with Roman rule but rather an autonomous and self-governing Jewish state.  So Paul being a Pharisee would have digested the teachings of the Greek and Roman philosophers but have relegated them to the Stoichea of the Universe… on the Dark-Side of Life… while unwittingly incorporating them into the Light of his Mystical Body of Christ.","date":"February 11, 2014 at 2:05 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"author":"annette_cloutiér","post":"Annette Cloutier :Hi Mike… I’m not an agnostic or an atheist… and I believe in the powerful act of Resurrection.  But I know the difference between story/imagination and reality.  I know, too, that nothing corrupt can enter into the state of Paradise.Oh by the way Mike, I doubt that anyone then or now could ever view the Image as a “sweat process.”","date":"February 10, 2014 at 10:49 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"author":"annette_cloutiér","post":"Mike M :“Only real source for the tremendous inspiration to write above and beyond stories of one exceptional god-man to surpass all others of the time and culture and to have those stories survive and thrive unto the age of ages would be the one empirical source–the Turin Shroud.” Or the resurrected Christ and the power of the Holy Spirit after Pentecost.","date":"February 11, 2014 at 1:45 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"author":"annette_cloutiér","post":"Rght, Mike… but where’s the “empirical” evidence of the Holy Spirit after Pentecost… I believe it; but I believe it as a Story… a past Story seen through prisms of light of other minds.","date":"February 11, 2014 at 1:47 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"author":"annette_cloutiér","post":"Louis, for sure it wasn’t a burial cloth that stirred the masses of Christian believers…however, it was the origination and catalyst that convinced the leaders and those with money and power to keep the masses inspired.  Stories will only carry so much weight with rulers who wont be convinced; even King Herod Marcus Agrippa thought Paul was mad (according to Luke’s story in Acts 26.1-29.  But probably had enough money to investigate Paul’s claims further, saw the Shroud and had the first Gospel written about Jesus bearing the name of Mark…  Who knows, it’s not in story form all the mysteries of the early Shroud.  But there is no reason that early Christianity could have survived on story alone if it had not received plenty of financial support.  The same with the idea of Resurrection today… it would be mere story if we didn’t have the Shroud to ponder.","date":"February 11, 2014 at 7:16 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"author":"annette_cloutiér","post":"Louis, I admire your adherence to Story… however, I’m more in adherence to Shroud phenomenon (non-Story) and how it will move this next generation scientifically and spiritually.","date":"February 11, 2014 at 7:59 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"author":"annette_cloutiér","post":"Mark, I wish someone could draw a picture of this burial procedure.. It seems bizarre.  Was this type of burial customary in 1st century Jewish funerary practices?","date":"February 12, 2014 at 12:42 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"author":"annette_cloutiér","post":"Louis, will you be at the St, Louis Shroud Convention in October 2014… or the next SBL (Society of Biblical Literature) Convention?","date":"February 11, 2014 at 8:23 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"author":"annette_cloutiér","post":"Hi Louis, I asked the question tongue and cheek because I would think it of greater value to be on the cutting edge of insights on the Shroud rather than the stale and tired insights of the New Testament.  I am “skeptical” about the testimony in the NT because the Stories are “contrived” they are an announcement and EVANGALION of the New Universal Lord written nearly a half century after the life of Our Lord.  I think the NT served its purpose in creating a great energy for life in the economic efficiency of equality of SPIRIT… with Good Information told in Story of the Father delegating the work to the Son and the Son delegating the work to the Holy Spirit and the Holy Spirit delegating the work to everyone of us equally as kings and queens who know how love can grow.  So far I’ve seen very little of this obvious work that needs to be undertaken with the greatest passion in raising the dignity of one another by sincerely caring for one another–for enabling one another to be royal in love.  I think the NT is a gold mine for all of us to claim a stake in the nobility of Christ… but I see that for many of us the gold mine has been used in making trinkets of jewelry. Going beyond the NT there are waves and more waves of information that could provide the Economy of Spirit  via the work of equality so that no one need ever be Crucified again for the sake of Resurrection.","date":"February 12, 2014 at 1:20 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"author":"annette_cloutiér","post":"Louis you’re right… Like Hugh with the Shroud’s authenticity, I straddle the fence with the authenticity of the NT, especially the 4 Gospels.  I see them as a beautiful albeit 1st century Gnostic interpretation of Jesus. (I would never adhere to the phrase: “Jesus of Nazareth.”  I believe the first Gospel writer, Mark, invented the word from Jesus the Nazorite.  It’s obvious to me that the first Gospel hagiographer also created other characters such as Mary Magdalene from Mary the Majestic Tower–the tower of Herod’s first Queen Mariamne e Maria, also Mark created the name Joseph of Arimathea which he explained carefully in Koine Greek in 15:43 means:  Joseph an Aristocratic Ruler waiting for the Kingdom of God.  Mark needed to put a foundation under Paul’s castle in the sky.  I love the way the Stories have evolved in every culture… I love the belief in creating and recreating (resurrecting if you will) Christ in every generation towards an Ultimate Good.  And I respect you for being swallowed up in your love for Christ.  I’m with you there, Louis,… just on a different page, same book of life.  Yet sometimes, I too, love rereading the page your on.","date":"February 12, 2014 at 12:24 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"author":"annette_cloutiér","post":"Sure John:  CLublu2@comcast.net.  My French is rusty… at Harvard I passed the exam (1978) but after my father died (1982), I never used it again.  But, I’m sure I can translate this for you.","date":"February 10, 2014 at 10:08 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"author":"annette_cloutiér","post":"Hugh, thanks for including me on the side of authenticity… However, I do believe the Shroud is 1st century AD. (ca. AD 30ish) but I also believe the Gospels and Paul’s Epistles were written because of the Shroud, albeit the mention of the Shroud itself may have proven too much for anyone in the first centuries of Christianity to write about directly when it was the information and the energy that produced the Shroud which proved more culturally profound to write about (unlike today’s scientific culture).  Perhaps that’s where your issue of authenticity resides?","date":"February 9, 2014 at 1:41 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"author":"annette_cloutiér","post":"O.K. how do you read Lavoie’s impression that the Shroud’s Image is standing upright?","date":"February 10, 2014 at 11:10 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"author":"annette_cloutiér","post":"Hi O.K… I’ve seen the Fabric of Time video and the noetic-scientific mind behind it.  I can’t help but to be impressed with the explanation given here… especially with Isabel Piczek’s explanation of a taught shroud with a levitated body, an event horizon and the birth of a new universe.  Love it!  It may be hard to prove but it gives us a rationale that surpasses most so far.","date":"February 11, 2014 at 3:40 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"author":"annette_cloutiér","post":"Brilliant!","date":"February 7, 2014 at 10:55 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"author":"annette_cloutiér","post":"Louis :Annette, surely you don’t believe that a burial cloth led to the birth of Christianity? The apostles, including Paul, would have to taken it around while they were preaching, particularly about the Resurrection, but they didn’t do so.Louis, so sorry… I didn’t see your Quote ’til now.  Well yes I do believe that the Shroud instigated Paul to writing about his Platonic Jesus then mystically becoming Christ and Mark to writing in order to bring Jesus back down to earth while leaving Paul’s mysticism intact.   John Loken first wrote in his book (2010): The Shroud was the Resurrection, after which a few years later (2012) Thomas de Wesselow also concurred.  The NT Biblical scholarship in both books was only a preliminary one: Loken’s out of his own logic and reasoning… de Wesselow from an art historian point of view.  The Gospels are stories written decades after the time of Jesus.  I am quite certain that a certain few first century devotees were allowed to see the Shroud in all its glory:  a long snow white sheet with a young crucified golden man staring with bright red blood crying out in supplication…  It was the Shroud that gave rise to Christianity not the Gospels itself.  Like anything too sacred the Shroud had to be kept hidden… but the stories of this unique Man needed to be told.","date":"February 10, 2014 at 7:23 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"author":"annette_cloutiér","post":"Hi Mike… I’m not an agnostic or an atheist… and I believe in the powerful act of Resurrection.  But I know the difference between story/imagination and reality.  I know, too, that nothing corrupt can enter into the state of Paradise.","date":"February 10, 2014 at 10:33 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"author":"annette_cloutiér","post":"Thanks Mike.  Spent many undergraduate and graduate years studying the NT… source criticism, hermeneutics, etc..  Only real source for the tremendous inspiration to write above and beyond stories of one exceptional god-man to surpass all others of the time and culture and to have those stories survive and thrive unto the age of ages would be the one empirical source–the Turin Shroud.","date":"February 10, 2014 at 11:08 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"author":"annette_cloutiér","post":"Louis, did you mean there was a crack between James son of Joseph  … brother of Jesus?","date":"January 24, 2014 at 3:18 pm","url":"https://shroudstory.com/2013/12/28/it-continues-james-son-of-joseph-brother-of-jesus/","cat":"history","title":"It Continues:  James, son of Joseph, brother of Jesus"},{"author":"annette_cloutiér","post":"Dave, I’m in total agreement with you here… I’ve often wondered if the first Gospel writer “Mark”, walked into the Jesus Family Tomb and got his characters:  Mariamne e Mara Mary the Queen after the tower overshadowing the tomb, the Majestic Tower of Mary gilded with gold and ivory (before the Romans ravaged it in 68)…Herod’s Hasmonean Queen… Mariamne?  Mark made her his Gnostic Gospel Queen:  Mary Magdalene.","date":"January 24, 2014 at 3:39 pm","url":"https://shroudstory.com/2013/12/28/it-continues-james-son-of-joseph-brother-of-jesus/","cat":"history","title":"It Continues:  James, son of Joseph, brother of Jesus"},{"author":"annette_cloutiér","post":"I’m not too sure that the X’s on the shroud here represent a herringbone weave either.  Those same x’s occur at the foot of the crucifixion above.  However, the Christ-figure carved with a bloated chest, owl-like closed eyes, parted-in-the-middle long-hair, as well as the right wrist over the left might prove to be more of a tipping point.  Good topic!","date":"May 8, 2014 at 8:08 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"author":"annette_cloutiér","post":"Louis, thanks. This is so Aleister Crowleyish… what a mess that guy was for performing his kooky Black Masses in the early 1900’s… thought he was quiet the intellectual as well… ended up being a child rapist and a misfit.  But certain people still give him much adulation… Scientologists for some.Sometimes I wonder why people choose to live in a “satanic” bubble?  Why it even needs to be “studied”?  Instantly we know its cause and effect!","date":"May 10, 2014 at 2:40 pm","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"author":"annette_cloutiér","post":"Or, make the Image again to a tee","date":"October 24, 2014 at 1:42 am","url":"https://shroudstory.com/2014/10/23/the-guardian-notes-the-history-today-article-by-charles-freeman/","cat":"history","title":"The Guardian Notes the History Today Article by Charles Freeman"},{"author":"annette_cloutiér","post":"I’m having so much trouble posting with this site… Never had before.  Oh no, a mean and then I got this nasty message:  smokescreener and clever rationalizationer","date":"January 20, 2014 at 10:46 pm","url":"https://shroudstory.com/2014/01/20/the-idea-of-something-being-authentic-is-just-too-powerful/","cat":"history","title":"The idea of something being authentic is \"just too powerful\""},{"author":"annette_cloutiér","post":"Any truth to French rewoven cotton fibers compressed into the linen fibers in that area?And why the varying range of dates from high Arizona 1430 to low 1238?  What about the absence of lignin that Rogers documented in the Shroud’s linen fibers he tested.","date":"January 21, 2014 at 5:11 pm","url":"https://shroudstory.com/2014/01/20/the-idea-of-something-being-authentic-is-just-too-powerful/","cat":"history","title":"The idea of something being authentic is \"just too powerful\""},{"author":"annette_cloutiér","post":"And too, Hugh, if you are favoring a 13th century origin of the TS… what would provide that impetus save for the 1988 C14 dating?  Looking at the image itself there can be no denying the Roman flagrum lashes, the crown of thorns, the body killed by crucifixion, none of which practices were used in the 13th century.  It would be a very far fetched 13th century cult willing to contrive such a forgery.  Not even the Cathars would conceive of such a notion!  Looking at the image alone one relates it immediately to the Jesus of the Gospels… not to a 13th century forgery.","date":"January 21, 2014 at 5:33 pm","url":"https://shroudstory.com/2014/01/20/the-idea-of-something-being-authentic-is-just-too-powerful/","cat":"history","title":"The idea of something being authentic is \"just too powerful\""},{"author":"annette_cloutiér","post":"Did I not read over and over again in various studies  that the C-14 1988 dating did not first put their samples under a microscope to see the dye, the glue and the spliced cotton with older linen?","date":"January 20, 2014 at 10:53 pm","url":"https://shroudstory.com/2014/01/20/the-idea-of-something-being-authentic-is-just-too-powerful/","cat":"history","title":"The idea of something being authentic is \"just too powerful\""},{"author":"annette_cloutiér","post":"Any extraneous exegeses related to Mary Magdalene has always been speculative, even the Church with Gregory the Great first declaring her a prostitute (c.591).  This parcel of supposed 3rd-4th century papyrus is a Dan Brown prop par excellence.  Just looking at the bold letters of and Jesus said:  “MY WIFE” precludes the pale of honest scrutiny rendering an immediate and obvious forgery.  Oh, what an embarrassment for Karen King and Harvard Divinity School… a King of Cons!","date":"May 7, 2014 at 9:05 am","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","title":"The Latest News on the Gospel of Jesus’ Wife"},{"author":"annette_cloutiér","post":"Louis, why would you write:  “We are supposed to believe that biblical studies have come to an end.”?Whereas these liberal “scholars” have confused the core of the NT, don’t you suppose that there is room for more growth?","date":"May 9, 2014 at 9:02 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","title":"The Latest News on the Gospel of Jesus’ Wife"}],"image":[{"author":"annette_cloutiér","post":"Ditto from above! (Mike M)","date":"January 25, 2014 at 12:52 pm","url":"https://shroudstory.com/2014/01/25/photomicrographs-and-more-at-mario-latendresses-sindonology/","cat":"image_theory","title":"Photomicrographs and More at Mario Latendresse’s Sindonology"},{"author":"annette_cloutiér","post":"Thanks Barrie, the paper certainly puts the final nail in the coffin for McCrone’s dishonesty.","date":"May 13, 2014 at 5:13 am","url":"https://shroudstory.com/2014/05/13/schwortz-it-is-worth-reviewing-david-fords-noteworthy-blood-or-paint-paper/","cat":"image_theory","title":"Schwortz: It is Worth Reviewing David Ford’s Noteworthy Blood or Paint Paper"},{"author":"annette_cloutiér","post":"Can anything scientifically positive come from London lab analysis?","date":"May 13, 2014 at 5:26 pm","url":"https://shroudstory.com/2014/05/13/schwortz-it-is-worth-reviewing-david-fords-noteworthy-blood-or-paint-paper/","cat":"image_theory","title":"Schwortz: It is Worth Reviewing David Ford’s Noteworthy Blood or Paint Paper"},{"author":"annette_cloutiér","post":"There almost seems like a third head starting to be formed between the ventral and dorsal side.  Then the image processing resumed  after the body shifted!","date":"February 28, 2014 at 10:32 am","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"author":"annette_cloutiér","post":"Thanks Dave…a rather odd looking negative water stain… but grateful for the insight and information.","date":"March 1, 2014 at 12:14 am","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"author":"annette_cloutiér","post":"Like!","date":"March 1, 2014 at 10:38 am","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"author":"annette_cloutiér","post":"Like!","date":"March 1, 2014 at 6:15 pm","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"author":"annette_cloutiér","post":"Good insight Mike!","date":"March 1, 2014 at 11:51 pm","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"}],"misc":[{"author":"annette_cloutiér","post":"Too funny!… in retrospect… moving to a 2020 vision definition:  Shroud of Turin was thought to have been proved inauthentic by radiocarbon dating,,, but now we know its authentic!","date":"February 24, 2014 at 5:16 am","url":"https://shroudstory.com/2014/02/24/definition-of-inauthentic-in-oxford-dictionary/","cat":"news_&_views","title":"Definition of Inauthentic in Oxford Dictionary"},{"author":"annette_cloutiér","post":"“John” (aka the “Beloved Disciple”) and Peter finding the burial cloths together without the body is “Story”, Yannick, written nearly a full half century after the undocumented life and times of Jesus…   almost like you as the Beloved Disciple and the Church rediscovering the burial cloths (aka the Shroud and the Sudarium) today.  I can, however, document that I went to Woodstock with my younger sister and our guitar teacher in 1969.","date":"March 1, 2014 at 6:32 am","url":"https://shroudstory.com/2014/03/01/25000-comments-and-counting/","cat":"news_&_views","title":"25,000 Comments and Counting"},{"author":"annette_cloutiér","post":"Where’s the insight with this post?  Sounds like more ignorant atheistic blather.","date":"February 13, 2014 at 9:11 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"author":"annette_cloutiér","post":"Lovely, this should never be unwitnessed or kept as secret cultic information. Pictures and documentations by loving persons wishing to impart this energy to the rest of the world should be allowed to operate without impediment","date":"February 13, 2014 at 10:15 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"author":"annette_cloutiér","post":"Mike M :Annette, Most these Monks have little contact with civilization. Within the community of monks they usually act stupid/mentally retarded or dumb to avoid glorification by other monks. They are extremely humble and wear dirty rags. They are usually discovered by accident ( bright light coming out of their dwellings at night, sounds of people praying together where there is only one person in a room, situations where someone showed up in a place far away from where he lives with no explanation how he got there etc.) these people intentionally avoid detection so I think it’s almost impossible to get evidence for this. They  get the energy from the word of God. The father of Monasticism “Abba Antonious” was a very rich man and he heard the bible read in church, the verse where Jesus told the rich man “if you want to be perfect sell what you have and give the money to the poor, and you will have treasure in heaven. Then come, follow me.” He took that verse personally and followed the commandment and started Monasticism in the whole world. So the energy is in the word of God, but how many people are willing to follow through?Hi  Mike… Speaking of Anthony the Great… the rich young man who started desert monasticism ca 285, I read somewhere he wasn’t as saintly as you make him out to be… he had a pedophiliac relationship with Athanasius of Alexandria (the monk who authorized the canonization of the NT).  Athanasius was no prize either… he had a wicked temper.So I don’t know about relying on past information.  How can we be sure of anything really… we can’t test it empirically.  But today, in our Information Age, we ought to be able to take pictures, videos, and create documentaries of these phenomenon.  Just like we do of deep sea creatures of the ocean which are seldom seen (e.g., giant squid), we should be able to make a documentary of the Rainbow Body Phenomenon.","date":"February 14, 2014 at 8:24 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"author":"annette_cloutiér","post":"Right Hugh, I’ve seen on the Discovery Channel the filming of Tibetan Monks in the frigid cold wearing only a wet towel across their backs while in group meditation…one by one the towels on their backs would become steamy hot… I’ve looked for that on the Net (YouTube, Discovery Channel, etc.) and couldn’t find it.  But I found other research such as  http://www.youtube.com/watch?v=flJnlB4Tgu0   and    http://www.discovery.com/tv-shows/discovery-presents/videos/the-supernaturalist-levitation.htm.  I think dispelling the authenticity of this type of phenomenon would be akin to dispelling the authenticity of the Shroud… while not quite associated to a Medieval Merlin work, there is something almost unrelatable to be said for those who dedicate their lives totally in the deepest wells of E=MC2.   I would like to see more authentication of this type of spiritual field.  For example, Padre Pio types today would have to consent to undergo video taping of not only their stigmata, but reported acts of levitation and bilocation before getting 170 million hits on YouTube.","date":"February 14, 2014 at 9:22 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"author":"annette_cloutiér","post":"Right… I’m not home right now, but when I return I’ll go through my library.  It was from a faint memory.  I felt rather uncomfortable blogging about it.  I quickly checked Wikipedia on the life of Athanasius.  This is what I found:  Sozomen speaks of his “fitness for the priesthood”, and calls attention to the significant circumstance that he was “from his tenderest years practically self-taught”. “Not long after this,” adds the same authority, Bishop Alexander “invited Athanasius to be his commensal and secretary. He had been well educated, and was versed in grammar and rhetoric, and had already, while still a young man, and before reaching the episcopate, given proof to those who dwelt with him of his wisdom and acumen” (Soz., II, xvii). That “wisdom and acumen” manifested themselves in a varied environment. While still a deacon under Alexander’s care, he seems to have been brought for a while into close relations with some of the solitaries of the Egyptian desert, and in particular with the Anthony the Great, whose life he is said to have written.So now I’m unsure as to weather it was Bishop Alexander or Anthony the Great who toyed with Athanasius.  But I remember doing research on this nearly 10 years ago… so I will have to retrace my steps further.","date":"February 14, 2014 at 4:36 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"author":"annette_cloutiér","post":"Mike, this is precisely my point.  Whose to say one way or the other that these men were holy except people with an agenda.  The Church has its agenda.  The anti-ecclesiastical have there agenda.  Whose to say, except for us in the here and now to prove what can or cannot be proven… honestly.","date":"February 15, 2014 at 8:54 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"author":"annette_cloutiér","post":"Annette Cloutier :Mike, this is precisely my point.  Who’s to say one way or the other that these men were holy except people with an agenda.  The Church has its agenda.  The anti-Church have their agenda.  Who’s to say, except for us in the here and now to prove what can or cannot be proven… honestly.","date":"February 15, 2014 at 10:35 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"author":"annette_cloutiér","post":"Hey Mike, I’m not disputing the holiness of anyone past or present.  I’m just saying that there are certain things that we can not know for sure. The Shroud, being in our time and space right now, should be something that the Church should not leave as mystery because we can study it here and now.  It should be universally studied for the betterment of science, religion, or whatever it is that moves us to a greater good.  It’s lovely thinking that Anthony the Great and the Desert Fathers were “holy”.  It’s good for the mind, I’m sure, to contemplate the sacrifice of the smaller self, but for God’s sake we need to see and appreciate to the fullest the sacrifice others are making towards the study of the reality of Christ… Those dedicated now to the Shroud should be given more universal support.  The Shroud after all  is the indelible and long-lasting sign of his Energy, his Mass, his Light.  Whether it’s through the study of the Shroud itself, or the study of other spiritual phenomenon… such as Rainbow Bodies, the good that can result is a greater reality and idea of The Holy.","date":"February 15, 2014 at 8:52 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"author":"annette_cloutiér","post":"Tom, this was extremely helpful.  I can almost understand how this rainbow-body phenomenon remains under wraps.  I wish it was revealed to me more in my youth… I could have better understood what was gnawing at me… deeply grateful.  Can’t wait to meet you in St. Louis!  So sorry for my knee-jerk comment.","date":"February 13, 2014 at 10:24 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"author":"annette_cloutiér","post":"Precisely, Mike.  I would hope in the next scientific scrutiny of the Shroud that it is approached in an open democratic way not excluding the input of previous scientific groups such as STURP but rather will have learned to approach its findings openly and comprehensively with no pretention to transparency and inclusiveness.","date":"February 16, 2014 at 1:10 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"author":"annette_cloutiér","post":"Thanks Louis… well then forget Rainbow Bodies, and compare the Shroud to other spiritual phenomenon that begs to be examined such as the Guadeloupe Tilma, the Veil of Manoppello, the incorruptible bodies of Bernadette Soubirous, Catherine of Laboure, to name a few… dedicated to promoting the concept of the Greater Good via the Immaculate Conception.","date":"February 15, 2014 at 9:19 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"author":"annette_cloutiér","post":"Right Louis… I’ve relegated the Rainbow Bodies to Finian.","date":"February 15, 2014 at 10:03 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"author":"annette_cloutiér","post":"Louis,  would you be willing to point me to a link for the canonization process?  Thanks…","date":"February 18, 2014 at 11:42 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"author":"annette_cloutiér","post":"Thank  you Louis, this was very helpful.","date":"February 18, 2014 at 1:17 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"author":"annette_cloutiér","post":"Uh oh, now you’ve got me studying…Ludwig Wittgenstein!  Nonetheless, I was  happy to see the Church would canonize someone like Josephine Bakhita.  Gives one hope for canonization for people like you and me!","date":"February 18, 2014 at 4:59 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"}],"opinion":[{"author":"annette_cloutiér","post":"Right Louis, and a Jewish burial Shroud left with a 1st century Masada seam.  I’m not getting this one… Is the theory that Apollonius of Tyana  migrated to Jerusalem when he was a relatively young man, become badly scourged, crowned with thorns, crucified, speared, buried in a (Jewish) linen cloth, and then somehow rise again to live a ripe old age of 100?  That could have converted the world, then and now!  But alas, no documentation!","date":"February 27, 2014 at 11:15 am","url":"https://shroudstory.com/2014/02/27/apollonius-of-tyana-proof-or-doom-for-christianity/","cat":"other_blogs","title":"Apollonius of Tyana:  Proof or Doom for Christianity?"}],"researchers":[{"author":"annette_cloutiér","post":"Hope if anyone misses any of it… the podcast will get posted here!I wonder why Ian Wilson’s talk last weekend never got posted?","date":"February 18, 2014 at 11:21 am","url":"https://shroudstory.com/2014/02/18/barrie-schwortz-will-appear-on-coast-to-coast-am-with-george-noory/","cat":"news_&_views","title":"Barrie Schwortz will appear on Coast to Coast AM with George Noory"},{"author":"annette_cloutiér","post":"Right, John, I agree.  What a great Shroud novel it would be though… intriguing to the mind but out of bounds in reality.","date":"March 8, 2014 at 11:30 am","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"},{"author":"annette_cloutiér","post":"Right… for sure an anomalous testing area is prima facie.","date":"March 8, 2014 at 8:38 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"},{"author":"annette_cloutiér","post":"Right John, but what an intriguing Shroud novel this would make!   Imaginative in the mind, but out of bounds in reality!","date":"March 8, 2014 at 12:10 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"}],"resources":[{"author":"annette_cloutiér","post":"Charles Markos took the words right out of my mouth…perfectly stated!  Thanks Dan, for the post; thanks Joe for the find!","date":"May 16, 2014 at 4:19 am","url":"https://shroudstory.com/2014/05/16/a-reality-that-cannot-be-ignored/","cat":"press_coverage","title":"A reality that cannot be ignored"},{"author":"annette_cloutiér","post":"Louis, I didn’t read Markos this way.  I really think Markos’ point suggests that the TS forges ahead from the old mythologies of Religion including the Judeo-Christian mythologies which do not serve us so well today and noting the TS there is a whole field of Science and a whole new field of Religion that we’ve yet to tap into… that’s all.","date":"May 16, 2014 at 5:20 pm","url":"https://shroudstory.com/2014/05/16/a-reality-that-cannot-be-ignored/","cat":"press_coverage","title":"A reality that cannot be ignored"},{"author":"annette_cloutiér","post":"Didn’t Jerome Corsi try a novel on this level?  Isn’t there agreement that the Blood from the Shroud (and perhaps the Blood from the Sudarium of Oviedo) is too degraded to produce the chromosomal-DNA codes for replication into an evacuated egg cell?  The microscopic bone fragments from the Jesus Family Tomb would not provide a better cloning specimen… it too has DNA structure which is too far degraded to be used for cloning.  So… what would have been interesting is if Piatt wrote about the DNA connection between the Shroud, Sudarium, and Jesus Family Tomb and expressed a more modern scientific view of Resurrection- likelihood.","date":"May 3, 2014 at 11:01 am","url":"https://shroudstory.com/2014/05/03/new-fictional-book-blood-doctrine/","cat":"books","title":"New Fictional Book: Blood Doctrine"},{"author":"annette_cloutiér","post":"Thanks Louis, brilliant research.  Thank you.  I only wished that Amos Kloner hadn’t given the construction crew the okay to plow that tomb asunder the next day after his three day investigation.  There should have been an international investigation of biblical scholars and archaeologists allowed to study it before completely demolishing such a tomb with the name Jesus son of Joseph and two Mary ossuaries (Maria and Mariamne e mara).","date":"May 3, 2014 at 12:51 pm","url":"https://shroudstory.com/2014/05/03/new-fictional-book-blood-doctrine/","cat":"books","title":"New Fictional Book: Blood Doctrine"},{"author":"annette_cloutiér","post":"Russ is always educational!  So glad to have listened to this on before Easter…by 10:40 am Holy Saturday over and out … ready for Resurrection!","date":"April 20, 2014 at 5:33 am","url":"https://shroudstory.com/2014/04/19/russ-breault-was-on-the-hagmann-hagmann-report-on-yesterday/","cat":"radio_and_podcasts","title":"Russ Breault was on The Hagmann & Hagmann Report on Yesterday"},{"author":"annette_cloutiér","post":"Dan, this was video short and sweet. Thanks. In reflection,  I think it so demanding of centuries of time and attention that the Shroud remains like the Universe only guess work as to how it came into being.  Would that we knew it was actually from the Divine Light or the Demonic Darkness… from the Being of Life in Progress or the Being of Life in Regression.  Many of the Gnostic Gospels favored a lesser God (e.g.Yaldabaoth) that created a world of duality and “evil”.  While I wonder at times about the raes… the true nature of things and life… the Shroud certainly gives me a greater sense of pause.","date":"June 3, 2014 at 6:52 am","url":"https://shroudstory.com/2014/06/03/and-speaking-of-secondo-pia/","cat":"video","title":"And speaking of Secondo Pia"},{"author":"annette_cloutiér","post":"Dan can this video be fixed for viewing?","date":"February 13, 2014 at 10:50 am","url":"https://shroudstory.com/2014/02/13/does-it-really-matter-what-journalists-write-about-the-shroud/","cat":"video","title":"Does it really matter what journalists write about the shroud?"},{"author":"annette_cloutiér","post":"Too Hollywood, too commonplace, lacking in real insight… but just right for folks over 75 and young ones just learning their “catechism”.","date":"February 17, 2014 at 11:30 am","url":"https://shroudstory.com/2014/02/17/son-of-god-in-theaters-february-28/","cat":"movie","title":"Son of God in Theaters February 28"}]}
