{"art":[{"id":"comment-3617","author":"anniecee","post":"” All it can do is comfort those who soldier on under the false apprehension that they are alone.” “God loves us, and wants us to love Him back. If God were a metaphysical certainty, our fealty to Him would be out of fear, not love. God is no rapist. There is no love without faith.” Tobacconist, I appreciate your comments. Thank you..","date":"2011-08-16","mins":"9:44 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3261","author":"anniecee","post":"I think Cookie means they want a print of the Jesus picture. Colton’s book is easy to find, yes at Walmart or all over. I believe that prints of the Jesus picture are only available at http://www.akiane.com and they’re a little bit expensive..","date":"2011-06-24","mins":"11:45 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3309","author":"anniecee","post":"My own opinion is that modern society has become very jaded and cynical, to the point where it’s hard for us to believe in spiritual things at all. People used to be much more superstitious and much more spiritual, in general. They believed in angels, gods and demons and often had these things all mixed up in their Christianity too. So people didn’t need much encouragement to imagine spiritual things. But now, people have a difficult time believing that ANY of it is real. So I think the book helps to make heaven more relevant for a modern civilization. The book doesn’t say much beyond what we already know in the Bible. So scripturally the story seems to be very sound. But the way it’s presented brings all those things to life in a whole new way. IMO, it’s a very encouraging testimony..","date":"2011-07-04","mins":"10:02 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3641","author":"anniecee","post":"You may be right… I think in heaven it won’t matter what skin color we have and I’m sure we’ll all be relieved that it’s not an issue. The Bible indicates that even the angels have various skin colors. Michael the Archangel has skin that shines like bronze or copper: how beautiful he must be!.","date":"2011-08-20","mins":"5:52 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-4550","author":"anniecee","post":"People think it is more tolerant to adopt a concept of God such as you describe but there are two serious flaws in what you say: 1. There is no separation from God — Sin separates us from God. Anyone who has raised children can believe in the concept of original sin. Original sin needs to be acknowledged more than it is. People want to believe in the theoretical goodness of all mankind, but the world scene damns that theory within seconds. 2. Truth lives within us and can only be revealed through experience. — TRUTH as you describe it means that truth can be anything we want it to be and truth can be individually customized to each experience. By this definition, there is no central truth. I do think you’re right, that there’s no book that contains the entire Truth, not even the Bible. People who read the Bible for the words alone are possibly not going to end up with much, especially if they read it for the wrong reasons. The Bible is the inspired Word of God, but it’s not the complete Word. Even the Bible says that if everything about Jesus had been written, the world would not be able to contain the books. So there’s alot more Truth about Jesus than only what’s recorded in the Bible. But the Holy Bible is what God gave us, and apparently it’s enough Truth to get started with. But if we REALLY want to know what TRUTH is, then we must know Jesus Christ personally. Jesus said that HE is the TRUTH. In other words, truth is not a moral concept… **** TRUTH is a PERSON.**** You must read the Bible with the goal of getting to know Jesus. PLUS, the Bible is only the launching pad because Jesus also sent the Holy Spirit to “guide us into all truth.” If we leave Jesus out of our lives, we will never know Truth. It’s Jesus or nothing. No man made god ever did for us what Jesus did. That’s what the Shroud of Turin is about: the crucifixion AND the resurrection of Christ. He died, He was not a Victim, He did it by Choice, and He raised HIMSELF from the dead without anybody’s assistance. The Grave is empty, because Jesus LIVES. This is the basic Gospel. If we don’t believe in THIS Jesus, then we don’t believe in Him at all. Jesus said that He is the ONLY way to the Father. Jesus said that HE is the Way, the Truth and the Life. Jesus is not tolerant of all religions, in fact Jesus is not tolerant of ANY religions. Jesus despised “religion” when He walked this earth and He insulted the Jewish religious leaders on many occasions. Jesus does not represent a religion formed by man AFTER he died. Jesus represents HIMSELF, the living GOD. We must accept Jesus under HIS terms, or we have not accepted Him at all. In fact, we insult Him by lumping the Christ in with other gods who have never done anything for our salvation as Christ did. The universal “god” is a lesser god… far, far, far less. Although on the surface the universal “god” appears to be more tolerant and gracious, this humanistic interpretation of a universal god has nothing whatsoever to offer us. The universal god has no basic form, no basic code of behavior… the universal god is just vapor. I think universalists might as well admit they are agnostics: it would be more honest than trying to portray that they believe something when actually, they don’t believe in anything. I’m not trying to be harsh, just trying to cut out the nonsense because the vague, vaporous interpretation of a universal god is basically a copout. The gods do not allow it, and most importantly: Jesus Christ does not allow that interpretation of God..","date":"2011-11-04","mins":"3:56 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3310","author":"anniecee","post":"Yes, I was concerned about the universalism that seems to be creeping into her work. Although people think that a unified religion is a good idea, it doesn’t work out in practicality because the gods themselves don’t allow it. Each religion is somewhat exclusive, and some of them are extremely exclusive. You can’t be faithful to ANY religion if you embrace ALL of them. Which is perhaps a good illustration of what Jesus said, “I would that you were hot or cold, but because you are lukewarm I will spit you out of my mouth.” And Jesus also said, “I am the Way, the Truth and the Life. No man comes to the Father except by Me.” So Jesus himself made it clear that he doesn’t go for this unified religion stuff. Also in I Timothy 2:5, “There is but one mediator between God and man: the man Christ Jesus.” Yes, I’m concerned about Akiane. The humanist tendencies of athiesm seem to be creeping into what she believes..","date":"2011-07-04","mins":"10:13 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3311","author":"anniecee","post":"Well, before he was middle eastern he was God, the Son of God, and the Word who created this planet and this universe. IMO, it’s not surprising that he’s very unique in his appearance. :).","date":"2011-07-04","mins":"10:16 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5208","author":"anniecee","post":"Post number #187 is by A Grotta… are you A Grotta as well as Michele?.","date":"2011-12-03","mins":"4:18 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9688","author":"anniecee","post":"Hi Kent, we’re really slow giving you a reply, but then again maybe not BECAUSE – since you asked this question – there has been a new published report about this very thing. I don’t know the details very well. But there are Shroud experts who could tell you the smallest details about it. I believe the study was done in Italy and they did experiments with intense light on linen and they got results that were encouraging. And, it would have been impossible for such a method to have been applied to the linen during the time that Christ was here on earth: no such technology existed. So this indicates (possibly, hopefully, AWESOMELY) that the image must have been applied supernaturally. If you’re interested in all this, catch up with the fellas at the top of the blog (the daily posts) and they’ll be glad to steer you around all the fascinating facts about the Shroud. :).","date":"2012-03-27","mins":"7:30 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3312","author":"anniecee","post":"IMO, it’s best not to get hung up on details because the story comes from a 3 year old who may have muddled some things in his mind. He related the story to his parents, over a period of two years or more. So many things could have influenced the clarity of the vision by that time. The gist of it is: apparently he really did have a near death experience and there are some things that are particularly impressed on him that he was very strong about. First of all, Jesus really really loves children. And second, we must know Jesus when we die. Third, Colton wants everyone to know that heaven is for real. These things are scriptural and if this is the main message of Colton’s story it’s a really good story. Colton’s book is not the Bible, it’s not scripture. So I don’t think it needs to be gone over with a fine tooth comb for accuracy. But I do think God has used this story for good purposes. For example: Jesus loves the children. I’m trying to help orphans in Haiti and I can’t get anybody to care about the orphanage I’ve been assisting. Not even my own family. People are so indifferent now a days. I really understand Jesus’ frustration with the church of Laodicea, they could not be MOVED to care about anything. There are children starving and abused all over the world. Maybe Jesus wants to stir up compassion for these little ones who do not deserve the suffering they’ve been born into. IMO, we should not ignore Colton’s message about the children..","date":"2011-07-04","mins":"10:36 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3616","author":"anniecee","post":"David Rego, I just now saw your post. You can contact me through the website at http://www.http://bonsecours orphans.com The contact form goes to me. I’ve been praying for help. It seems it’s very difficult to move people’s hearts these days. I’m not sure why, sometimes I wonder if this is the Church of Laodicea manifest on the earth. Thank you for inquiring..","date":"2011-08-16","mins":"9:37 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3396","author":"anniecee","post":"I agree. I read it twice in a week, and re read some favorite sections. I basically memorized it! Such wonderful confirmation of what God has planned for those who love him. Recently I saw this video of a man who had a near death experience, and I have thought about his story a lot. It’s very compelling:.","date":"2011-07-24","mins":"4:01 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3401","author":"anniecee","post":"I think so. I think Christians (including myself) need to be more heavenly minded, that our rewards are not in this life but in the next. The reality of heaven changes our perspective considerably. The book does give some examples of people whose lives were touched and changed because of Colton’s testimony. His experience has had a profound affect on many people..","date":"2011-07-25","mins":"12:00 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5117","author":"anniecee","post":"I think God is reaching out to you, too, Michelle. That’s why you are so convinced God is real, and He cares about you. One of my friends has a similar history, her life is a long series of tragedies and traumas and injuries. Her longing for love got her into several bad relationships, some of which she was lucky to survive. Two years ago she married a man who is very sweet and kind, a good Christian guy with a reputation for being steady and reliable. . I figured God would do this for her eventually because she really needs to know what it’s like to be in a decent family. And by the time she found this man, a lot of the ginger had been knocked out of her so she wasn’t looking for excitement anymore, she just wanted peace. I noticed that she didn’t know how to be “normal” because of the bizarre life she’d had. Now she’s very grateful for the peace of being in a quiet, normal relationship. When Adam & Eve ate from the Tree of the Knowledge of Good and Evil, the serpent was right about some things. He said they would become like God, knowing good and evil. I believe this is possibly our Quest in Life, the purpose for our existance. You have encountered evil and you know what it is. There is some wisdom in knowing this, especially if God helps to process those horrible experiences so they turn into wisdom. You also need to understand what it means to be Good… and the word “good” is so much more rich than we realize it is. The Bible says that only God is good. The little bit we know about “goodness” is only the tip of the iceberg you might say: it’s only a teeny glimpse into the immense goodness of God. I found this website just now, because I love the book of Hebrews where it talks about how God does everything “Better.” A better Way, a better Covenant etc. Http://www.messianic literary.com/hebrews.htm That’s a messianic Jewish site which is kinda cool. I thought the outline he provided was a good start on reading Hebrews in light of knowing something BETTER. YES, God has a BETTER plan for your life!.","date":"2011-11-30","mins":"8:04 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9737","author":"anniecee","post":"I don’t have a problem with it, because the Bible does say, “Out of the mouth of Babes…” and that’s what is SO unique about this painting and the confirmation of by Colton AS WELL AS another very young child who had a near death experience! Another little boy ALSO confirmed that the picture looked like the Jesus he saw. All these “babies” think this painting is like Jesus. If a cult following was being developed, I would have a problem with it. But the only thing that’s happened is little children have confirmed that’s what the Jesus they saw in their vision looks like. Which is really cool. And, it’s from 2 or 3 witnesses so that’s an interesting point too. Might as well enjoy it, because Colton’s book is all about Jesus and it glorifies the Lord. I thought the family did a good job of writing the book in such a way that it was merely a narrative of what Colton told them. They didn’t jump to conclusions, they just told Colton’s story and they didn’t do it in such a way that it would glorify themselves. That’s a very difficult balance, I think there was a lot of wisdom in the way they wrote the book. I highly recommend it. And I tend to be more skeptical and jaded than most, IMO. But I absolutely loved Colton’s story: it’s incredibly encouraging especially in these difficult times..","date":"2012-03-28","mins":"9:42 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3571","author":"anniecee","post":"That’s a sweet story, Rosanne. I appreciate how people share their own experiences and thoughts here. Gives me alot to think about. I agree, it’s difficult to see people turn their backs on God. Prayers are needed..","date":"2011-08-11","mins":"4:01 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-4527","author":"anniecee","post":"The book of Revelation chapter 10 also talks about an enormous angel that stands with one foot on land and one foot on the sea. The angel gives the prophet Daniel a letter or parchment, maybe it is similar to the one the angel gave you. Maybe you should read the book of Revelation and see if it helps you understand your dream. Revelation is hard to understand, so don’t get frustrated if it doesn’t make sense. It’s not supposed to make sense, I think. And yet Revelation does give us clues and things to look for so we’ll be able to understand when these things start happening. And they DO seem to be happening, now, in our time..","date":"2011-11-03","mins":"3:03 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3601","author":"anniecee","post":"Yes, I agree: I didn’t see anything in Colton’s book that contradicted the Bible. I think the writers of this book were careful not to apply interpretations or conclusions to anything, either. Mostly it’s just a testimony, and the Bible does say that our testimony is a good thing that God uses. I’m very wary of false teaching — I thought this book was a pure blessing to read and I couldn’t find anything to complain about..","date":"2011-08-13","mins":"9:44 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3719","author":"anniecee","post":"I read the book twice and I thought it lined up with scripture really well. Colton’s description of how Jesus went up and down is consistent with the Bible’s description of the Ascension. Colton said that his grandfather had really big wings… that’s where that comes from..","date":"2011-08-29","mins":"6:24 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5189","author":"anniecee","post":"Wow, that’s harsh. I read the same story, it’s on Akianne’s website..","date":"2011-12-03","mins":"2:41 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5190","author":"anniecee","post":"I’m not sure why there are skeptics in this world, either, Ann. God confirms his Love and care to those who do make the effort to believe… why would anyone want to live without God’s help in their lives? Your husband’s dream… how beautiful! What a special touch from God..","date":"2011-12-03","mins":"2:46 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5193","author":"anniecee","post":"Ah, I found it. The story of the carpenter is in the book about Akiane. Here is a link on Google books: http://books.google.com/books?id=wy 0 Ig Or OMMC&pg=PA27&lpg=PA27&dq=akiane's+painting+of+Jesus+Carpenter&source=bl&ots=7utl R Lpb MG&sig=j9knr T5sxk1 sz H5fj4 M Hf V3 KIY&hl=en&ei=ou DZ Ton DJ9 K9tgeihtjs AQ&sa=X&oi=book result&ct=result&resnum=1&ved=0 CDIQ6 A Ew AA#v=onepage&q&f=false.","date":"2011-12-03","mins":"4:44 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-4526","author":"anniecee","post":"Why would heaven be anything less than earth? It will be so much more! All the animals that have been lost due to extinction, plus many more that we’ve never heard of. The Bible does mention a lion, lamb, and horses in heaven. Jesus comes back on a white horse. The Bible refers to animals as having the same “breath of life” as humans do, with the “breath of life” being spiritual in nature. And Noah’s covenant from God was promised to the animals as well as the humans. Animals will be judged for their deeds, the Bible says this, and how can they be judged if they are dead and gone? I wrote an article on this, with Bible verses etc. Http://waitingfortheword.com/index.php?option=com content&view=article&id=13&Itemid=5.","date":"2011-11-03","mins":"2:51 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-4665","author":"anniecee","post":"Your comments are very thoughtful, MC. Jesus had a big problem with religion, too. In fact, it was the religious leaders who were determined to kill Him. I would like to suggest that you read the New Testament to find out more about Jesus. Sometimes when we go back to the Gospels as an adult, it opens up in a whole new way. Jesus was fascinating, his miracles were amazing, his teaching was mind boggling. Every time I read the gospels I see more that I hadn’t noticed before. For example, Jesus sent his 12 disciples out in teams of 2 to do ministry. He told them, “Don’t take any money, don’t take any food, don’t take an extra cloak.” Maybe they were allowed to take a change of clothes, but they carried very little if they did. That’s an incredible contrast with modern churches who need a million dollars before they can even begin the work that God has called them to do. Who teaches this kind of faith anymore? But Jesus wanted his original 12 to depend entirely on God. If we really want to cut to the chase and find out what Christianity is about, it helps to go back to the source: Jesus..","date":"2011-11-08","mins":"8:41 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-4347","author":"anniecee","post":"This is a very moving testimony, thank you for sharing your amazing experience. I can feel the love of Jesus when I read it..","date":"2011-10-26","mins":"12:39 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-4687","author":"anniecee","post":"Colton was four. It was more than a year before he started to tell his parents what he’d seen. I believe Colton’s story, but I think there some things became fuzzy in his thinking by the time he told his parents about it. He is a preacher’s kid after all, so he was in Sunday School all the time. Maybe some images and memories got a little confused in his mind..","date":"2011-11-09","mins":"3:23 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-4695","author":"anniecee","post":"It’s important to remember that our English Bible is a translation and some things are lost along the way. For example, the Hebrew language had no word for “Cousin”, I read that somewhere and they seemed to know what they were talking about. So the “brothers and sisters” of Christ might actually have been his cousins. The Catholic theory that Christ was an only child might be right, when we look at the original languages. James, the Lord’s brother, might have been a cousin instead. Another thing to consider: the reason why the nails were put through the wrists is because the nails won’t hold if they’re put through the palms of the hands. Think of a skeleton with the long long fingers: there’s nothing but soft tissue that holds our hands and finger bones together. So if nails were put through the palms, they ripped out as the body sagged on the nails. The Romans did put the nails through the wrist, for that reason… so the nails would hold the body up on the cross. If we knew more about the original languages, we might learn that hands and wrists were the same word or close enough that it didn’t matter. Or somebody translating Hebrew to Greek got confused and it’s been that way ever since… etc. Ultimately, I don’t think it matters much. It would be nice if we could solve some of these discrepancies but how is anyone going to actually prove anything? Jesus Himself would have to appear among us to settle the question..","date":"2011-11-10","mins":"1:34 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5004","author":"anniecee","post":"Yes, that link is interesting. I know that there were many MANY miraculous events worldwide during a period of time from 1967 68 to 1974 75: a period of approximately 7 years. Personally I have wondered if these events began happening after the 6 Day War in Israel when the Jews gained control of Jerusalem. The 6 Day War was June 5 10 in 1967. That’s the only significant event I can think of that might explain those 7 years. There were also a lot of miracles that happened during the 6 Day War..","date":"2011-11-25","mins":"4:04 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5011","author":"anniecee","post":"God spans all religions… Not sure what you mean by that. Mostly I’m annoyed that people want to make it out that there’s more than one Savior, and according to Jesus Himself, that’s just not true. Jesus is the only Way. In Colton’s book, the child is so adamant that people must know Jesus before they die! I love that part. If we try to figure out ahead of time how God will handle Judgment Day, our frail brains come up with all kinds of strange theories. I think we should leave it alone before we say something silly. We know God will be fair about it. God spans all religions… I can agree with this to a degree. Not that God represents or is part of all religions, but rather: that God is ABOVE all religions. And I say that in it’s most ironic sense. He is above it all, beyond it all… so far above and beyond that God has nothing to do with any of them. What God looks at is His Only Son and those who follow Him. Jesus didn’t come to start a Religion: Jesus said over and over that He wanted us to have a relationship with His Father. Even Christianity can become a mere “religion” if it’s followers engage in legalism instead of relationship..","date":"2011-11-25","mins":"2:32 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5016","author":"anniecee","post":"CJ Cinkole : I was equally moved by the testimony in “23 Minutes in Hell”. That sounds very interesting! I will look it up, thanks. And I agree with you: heaven looks better and better every day! :).","date":"2011-11-25","mins":"4:44 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5091","author":"anniecee","post":"Wow, that’s quite an experience, Michael. A vision, or a near death experience? I just have to ask if you went to see your doctor after that and got checked out..","date":"2011-11-29","mins":"7:35 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5082","author":"anniecee","post":"Yes, Jesus did say that “a little child will lead them.” Colton does provide the “basics” in this book… there were some things that he was particularly intent on saying. One thing that was especially important: we MUST know Jesus. Also, that Jesus REALLY loves the children! I’m not sure any of us can truly know what love is until we have made an effort to read about and know Jesus Christ. I hear people talking about Love and the need for more Love, but which of us even cracks our Bible open to find out what Jesus had to say about Love?.","date":"2011-11-29","mins":"12:27 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5092","author":"anniecee","post":"Yes, I’ve heard of Jesus appearing to Muslims in “closed” countries. I heard about an entire village becoming Christians because one of the elders in the village had a vision that Jesus visited him. This was reported by reputable missionaries, so it’s very exciting. I’ve had some problems in churches that I attended too. What happened was completely inexcusable. I left two churches because of bullies. And I’m really sick of the so called “prophets” too. Jesus wants us to know Him on our own, not rely on words that others think they have for us. And not all their prophecies come true, so what does that tell you? The Charismatic renewal started out as a true visitation of God in the late 60’s, and it was precious and it happened worldwide. I think it’s embarrassing that today’s Charismatics are associated with that sweet move of God in any way. My folks are elderly and it’s hard for them to get out, so we watch Pastor David Jeremiah’s “In Touch” program on tv now. I highly recommend it. He also has a website. I can’t see anything questionable about that ministry: the teaching is relevant, interesting and completely Bible based and it’s not weird. We’ve been very grateful to have “real” church right in our home. For fellowship, I get together with Christian friends. Of course it’s best if you can find a good church to attend but many people are alienated from church now. Christians can be awful, but we ARE a work in progress and it’s important to think of that and I try not to be bitter about the past. God is always faithful and I’m so grateful for that..","date":"2011-11-29","mins":"7:52 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5118","author":"anniecee","post":"Oops, my reply ended up in the wrong place. This page is getting confusing!! :) I think God is reaching out to you, too, Michelle. That’s why you are so convinced God is real, and He cares about you. One of my friends has a similar history, her life is a long series of tragedies and traumas and injuries. Her longing for love got her into several bad relationships, some of which she was lucky to survive. Two years ago she married a man who is very sweet and kind, a good Christian guy with a reputation for being steady and reliable. . I figured God would do this for her eventually because she really needs to know what it’s like to be in a decent family. And by the time she found this man, a lot of the ginger had been knocked out of her so she wasn’t looking for excitement anymore, she just wanted peace. I noticed that she didn’t know how to be “normal” because of the bizarre life she’d had. Now she’s very grateful for the peace of being in a quiet, normal relationship. When Adam & Eve ate from the Tree of the Knowledge of Good and Evil, the serpent was right about some things. He said they would become like God, knowing good and evil. I believe this is possibly our Quest in Life, the purpose for our existance. You have encountered evil and you know what it is. There is some wisdom in knowing this, especially if God helps to process those horrible experiences so they turn into wisdom. You also need to understand what Goodness is… and the word “good” is so much more rich than we realize it is. The Bible says that only God is good. The little bit we know about “goodness” is only the tip of the iceberg you might say: it’s only a teeny glimpse into the immense goodness of God. I found this website just now, because I love the book of Hebrews where it talks about how God does everything “Better.” A better Way, a better Covenant etc. Http://www.messianic literary.com/hebrews.htm That’s a messianic Jewish site which is kinda cool. I thought the outline he provided was a good start on reading Hebrews in light of knowing something BETTER. YES, God has a BETTER plan for your life!.","date":"2011-11-30","mins":"8:07 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5125","author":"anniecee","post":"Leina, thank you for your reply, I appreciate that. And I got the name of David Jeremiah’s ministry wrong: it’s “Turning Point”, thank you for correcting it. The “In Touch” ministry is Dr. Charles Stanley and I like him too. Both are good. I’ve been especially impressed with Dr. Jeremiah in the past year..","date":"2011-12-01","mins":"3:04 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5141","author":"anniecee","post":"I’ve been asking “Why?” a lot, myself, lately. Trying to make sense of a lot of things. I do think that people who have always had it good, always had the best, always been provided for: it seems that such people don’t have as much to offer those who are hurting. Jesus can identify with us in all our sorrows, because of the things he suffered. He can weep with those who weep. The cross we bear is possibly preparing us, training us to provide “first aid” for wounded souls too. Pain and loss are truly the fires God uses to refine the soul to greater luster. This is how God converts the past into treasure worth having. Emily Dickson wrote, “If I can say one word in season, or soothe one pain, or help one fainting robin into its nest again: I have not lived in vain.”.","date":"2011-12-01","mins":"3:25 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5149","author":"anniecee","post":"My Mom said exactly the same thing yesterday. She nearly died when she was 16, in a bad car wreck. It was a prayer group hundreds of miles away that prayed her through. Her parents got saved because of it, they knew the prayer group made all the difference. But Mom wishes she had some special vision or something for herself… she’s jealous of those who do. :) I heard recently that “normal” is only a setting on the washing machine… !.","date":"2011-12-01","mins":"7:12 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5232","author":"anniecee","post":"Little Colton was particularly adamant about two things in particular: 1. WE NEED TO KNOW JESUS and 2. JESUS LOVES THE CHILDREN I think these two things are certainly a good map to start with. The reason why I keep pointing to Jesus, waving people toward Jesus, talking about Jesus… is because everything starts with JESUS. Michele mentions all the wonderful things that we begin to understand, realize, the stuff that DAWNS on us, when we have had an encounter with God. It’s not possible to put it into words. Whatever happened to her, she’s STILL floating around on God’s love. Something similar happened to my father when he got saved, and he still can’t find the words to convey what he wants people to understand about God’s love! If we could have mystical experiences anytime we want, we’d probably all be camped out in church 24/7 because people want to know that joy all the time, every day. But the only real way to know the Joy and Peace is to press ON in knowing Jesus. Just as Colton was relentless in preaching his 2 little messages, so we should be relentless in pursuing what Jesus wants from us. From ME. To be relentless in what Jesus wants of ME..","date":"2011-12-04","mins":"5:38 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5148","author":"anniecee","post":"Well, he wasn’t actually completely dead yet so maybe that explains it. I try not to dismiss the testimony of others because it is, after all, their own testimony. Abraham made it clear to the rich man in hell that the testimony of the prophets was enough, if that didn’t convince the rich man’s brothers then nothing would. My point in mentioning that Bible story is this: Abraham told the rich man that the TESTIMONY of others was all that the Living would get, and it was ENOUGH. So I think a testimony is something that should be respected because God gives personal testimonies quite an endorsement in that story. Yes, we do need to discern for ourselves what is true or not, and if you’re not comfortable with it then that’s your choice too. And it’s better to err on the safe side I suppose, than be taken in by every con that comes down the pike..","date":"2011-12-01","mins":"7:04 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5207","author":"anniecee","post":"Michael Wilks : Annie~ I remember there was the most awesome gold color to the sky, yet the clouds were such beautiful shades of blue and white. I’ve been thinking about this, the gold color sky. It sounds so pretty! I was looking at clouds in the east yesterday; huge puffy white clouds and tinged with blue, with the sunset in the west making them pink and gold too. I don’t know why there would be clouds in heaven, but they are so beautiful maybe that’s enough reason. :).","date":"2011-12-03","mins":"4:14 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5321","author":"anniecee","post":"Yes, the Bible isn’t clear how things “work” after we die. Jesus told the thief on the cross that they would be together in Paradise, which is possibly the “holding place” that you mention… A “holding place” that you describe is supported by Scripture and it’s called Paradise. Jesus said that the rich man suffered in Torment after he died, whereas Lazarus was comforted at Abraham’s bosom (which some scholars think is the same as Paradise mentioned in other places in the Bible.) I also read in Revelation recently that Jesus tells most of the people who are waiting for Jesus to set up his eternal Kingdom that they must wait and REST until the Millenium is over– that’s when everything with the devil will be settled once and for all. Then we will all go with Jesus to wherever we are going. (A vacation of 1000 years in Paradise sounds really good to me.) One of the prophets also mentions being caught up to the 7th Heaven, which is apparently the very special place where God the Father is. So heavens has LEVELS? That’s interesting too. I think if anybody believes that they can truly figure out what’s happening over there on the other side, they would have to invent or fabricate a lot of it because the Bible is vague about the afterlife. And the Bible doesn’t spell out a clear picture of the End Times either — It can drive you crazy trying to understand what Revelation means. (But the Bible says that we do get a Blessing just for reading Revelation anyway!) — Basically, we can look forward to GOOD things if we know Jesus. — Basically, we know that hell and punishment and Hades are all very terrible and we want to do what we can to avoid them. — Basically: we know that Jesus wins because we’ve read the end of the Story. Apparently these are things God wants us to be sure of. The rest of the tidbits are “appetizers.” :).","date":"2011-12-07","mins":"5:42 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5233","author":"anniecee","post":"That’s an awesome story, Stephanie. Very amazing to think about. What a comfort for your family..","date":"2011-12-04","mins":"5:45 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5513","author":"anniecee","post":"That is a wonderful, dramatic testimony of your conversion! I am always interested in the testimony of others, because each of us has our own “proof” from God; it’s a real touch from Him, something that we know within ourselves truly happened. God is real, and He cares. This is why Jesus said that the testimony of Believers is all this world is going to get in the way of proof. (That, and nature itself which shouts of God’s glory.) If somebody truly wants proof, God will give it to them. But He ignores the fakers and the blasphemers who don’t mean it..","date":"2011-12-14","mins":"2:46 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5601","author":"anniecee","post":"Possibly because you’re not ready to die. Are you prepared to meet Jesus? Doesn’t seem as if you are yet. The thoughts that you struggle with are Doubts. Doubts about everything, most likely. Even doubts about yourself. This generation is very good at asking doubts, but they don’t know how to find answers. They can dig a hole, but don’t know what to fill it with. So all they’ve got is a hole. That’s what doubts do for us. Jesus got annoyed with people who doubted Him. He said many times, “Where is your faith?” He thought it was so easy, all we have to do is believe in Him so why is it so difficult? Jesus did a zillion miracles, but the Bible says that he couldn’t do many miracles when He was in Galilee because the people there didn’t have faith. I think that’s amazing: our faith is sooo important? Apparently it is. In the Bible book of Hebrews 11: 6 it says, “And without faith it is impossible to please God, because anyone who comes to him must believe that he exists and that he rewards those who earnestly seek him.” If you want to help your mind be more peaceful, I recommend reading the Bible books of Matthew, Mark, Luke and John. These tell the story of Jesus. He was such an awesome person, it’s peaceful just reading about Jesus. And John 3:16 tells us how to be Saved of course. So does Hebrews 11:6 (above)..","date":"2011-12-16","mins":"4:38 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5641","author":"anniecee","post":"I want to add that Jesus said He came to give us LIFE and to give it more abundantly. And I encourage you again to read the Bible, especially the New Testament. And I hope there is someone in your life you can talk to. Make an effort to find someone or go to a school counselor if you need to. You shouldn’t deal with your depression alone. You have a lot to live for, and life is good. This video by Pam Thum is very comforting, perhaps you will like it:.","date":"2011-12-17","mins":"4:25 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-6080","author":"anniecee","post":"LOL… cute story indeed. I’d like to suggest that Mr. Ginn read the New Testament again. When we make up our own religion based on our own ideas, we can end up in left field. If we read the Bible often (a few verses every day, at least), it helps us stay more balanced. I like the ONE YEAR BIBLE because it lays out a daily reading of approximately 1 or 2 pages and is just right. In fact, the ONE YEAR BIBLE is a Facebook app now and I really like it: http://apps.facebook.com/oybonline/.","date":"2011-12-24","mins":"7:41 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-6220","author":"anniecee","post":"James Ginn : “Think not that I am come to send peace on earth: I came not to send peace, but a sword. For I am come to set a man at variance against his father, and the daughter against her mother, and the daughter in law against her mother in law.” Mathew 10:34 When you can explain this verse you will understand what I am talking about. But you dont understand it… do you ? Actually, I do understand it. Being a Christian tends to separate to sheep from the goats, especially if a person is committed to walking a selfless life then I think they encounter even more opposition from surprisingly disappointing persons. The devil will stop at nothing to hinder a true believer, including turning family against family. But this is happening in the world too. I read about a child recently who killed his grandmother because she wouldn’t let him play his video game. Or a son who killed his parents because his cell phone was confiscated for punishment. These things are happening, it is good vs. Evil. The same conflict that began in the Garden of Eden. Your claim that there is no proof Jesus Christ existed is baffling. He was not a world leader and yet one of the ancient historians mentioned him. Jesus, a mere carpenter from a small village in a small country of slaves, a man who died as a common criminal among other nameless criminals… this man Jesus Christ attracted the attention of Josephus. It is quite remarkable that he is mentioned at all. And yet, our years and our calendars revolve around his birth. I think you’re making up your religion as you go along, I’ve never heard anything like it..","date":"2011-12-28","mins":"12:32 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-6228","author":"anniecee","post":"James Ginn : He was the man whom Christianity is based upon. He performed miracles. Yet no one wrote about him. Highly unlikely. Um… I just told you that a secular historian, Josephus, mentioned him. Plus, you have the eyewitnesses of Matthew, Mark, Luke and John who wrote about Jesus’ life and death. There’s a lot that’s known about the life of Jesus Christ. Why do you have a problem with Him? I think that’s what you need to ask. You seem to be afraid of Jesus, and yet you’re drawn to Him. You don’t need to be afraid. Just get down on your knees and introduce yourself. Confess your need for Him as your Savior. I think you’re possibly very close to salvation. I will pray that you can overcome whatever it is that’s holding you back from knowing Jesus personally..","date":"2011-12-28","mins":"2:54 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-6207","author":"anniecee","post":"I’ve never heard of someone who claimed to be a Christian and yet did not believe in Jesus Christ at all. You don’t seem to know much about the New Testament either. This is nonsense. You can’t believe in the Bible without believing in Jesus: he’s the main Subject from beginning to end, starting with the Fall of Man and the need for a Savior – to His return in Glory. And it’s not an allegory with hidden meaning. Jesus was real, his death was real (that’s what this Blog about the Shroud is partly all about.).","date":"2011-12-27","mins":"10:28 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-6206","author":"anniecee","post":"For me, one of the main things that proves Christianity is different from all the rest is the music. No other religion has so much music, countless songs, choruses, anthems, always new music in every generation! Music that is joyful and full of celebration. Music that is full of worship and praise for God who is like none other. Worship that is full of Victory and Awe for what Christ accomplished while He was on earth. Music that is just plain fun and happy. Music for the children. Music for those who are sad and need comfort. Music, lots of it, pouring out of people who love to sing praise to the God they LOVE. The music alone sets Christianity far FAR apart. No religion on the planet takes even a remote second when it comes to the music. I don’t think anybody can explain away this phenomenon; why MUSIC just pours out of this religion in abundance. Maybe it’s because there is something very VERY special about Jesus Christ!.","date":"2011-12-27","mins":"10:16 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-6291","author":"anniecee","post":"You’re kinder than I am able to be, Jeannie. I’m so tired of these atheists popping up everywhere to insult and bully. They are a minority, a small minority, but they’re loud, aggressive and they have very bad manners IMO. They’re also turning up the heat on their own future torment, and for that I really do feel very bad for them but it doesn’t seem as if there’s anyway to talk to them, to reach them. They have deliberately hardened their hearts against God..","date":"2011-12-30","mins":"10:01 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-6292","author":"anniecee","post":"What an incredibly amazing story, Jeannie. A precious memory for all your family, and now for us as well. Thank you..","date":"2011-12-30","mins":"10:04 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-6794","author":"anniecee","post":"That’s very beautiful, thank you. Especially for those of us who are single women and know what it’s like to depend on Jesus completely to pay the bills and even help with the daily frustrations of life. I had a situation today that was driving me crazy. I went out on errands and when I got home, it was all resolved as if Jesus Himself had stepped in and done it for me. (Which I kinda think he did.) I too had a lovely dream of Jesus, that helps me through the rough spots… so I appreciate yours. I know what it means to you..","date":"2012-01-10","mins":"6:31 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-6941","author":"anniecee","post":"I really enjoy the personal stories on this blog; of miraculous intervention and divine encouragement. Jesus said, “My sheep hear my voice and know me.” I feel very sorry for those who don’t experience the personal touch of Jesus in their lives. It’s also very sad and frustrating when someone (like that unsaved brother) refuses to acknowledge God’s mercy in his life..","date":"2012-01-13","mins":"4:03 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-6952","author":"anniecee","post":"Maria, a friend of mine had a similar experiences when she was a child. She learned to pray to Jesus and the demons would leave. Her family didn’t believe her, that she was seeing these things in her bedroom but Jesus helped her. She learned later that witches had lived on that property before her family did. Her father also apologized to her many years later for not believing her..","date":"2012-01-13","mins":"11:22 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7457","author":"anniecee","post":"Your son died with a smile on his face? His angels must have been there to help him so he wouldn’t be frightened. He must have seen something truly wonderful. Jesus pulled a small child into his lap and told his disciples, “In order to enter the Kingdom of Heaven, we must be like these little ones.” And, “Their angels in heaven always have access to the Father.” Those are such wonderful verses: they give us a little insight into heaven and God the Father. God really loves the children!!.","date":"2012-01-24","mins":"5:24 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7536","author":"anniecee","post":"The Egyptians aren’t very dark. In fact many of them are very light. I don’t understand the problems that people have with Jesus’ skin color. We know what his nationality was. And probably every last one of ’em was tanned to a dark brown, only the rich people had pale skin I suspect. Jesus spent a lot of time outdoors, ministering to people. I do think it’s laughable when Jesus and Mary are portrayed as BLONDE, I don’t like it. Even though I’m blonde. I just think people should try to be accurate, and blonde isn’t very likely..","date":"2012-01-25","mins":"6:04 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7688","author":"anniecee","post":"Yes, Richard, I know what you mean: He has been there in good and bad. There’s no doubt of it. He is the “One who sticks closer than a brother.”.","date":"2012-01-30","mins":"8:47 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7815","author":"anniecee","post":"Yes I’d really like to see your pix. I sent an email. :).","date":"2012-01-31","mins":"10:54 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7792","author":"anniecee","post":"Clear images of… what?? This sounds hinky, in my opinion. He doesn’t even say what he’s selling. Unpublished originals? And buy now or… what? Why is he in such a hurry. This has all the red flags. I wish somebody would remove it..","date":"2012-01-31","mins":"5:01 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7975","author":"anniecee","post":"Actually, we don’t know. He could have been just about any skincolor shade. There are dark jews and light ones, as Rebecca explained. And because he was outside a lot he was probably dark anyway. Just about anything is POSSIBLE, because the Bible doesn’t provide a description of him. Not even his haircolor, whether he was tall or short: NOTHING. And I think that’s deliberate, so no matter who we are, we can identify with WHO Jesus is rather than what he looked like. God doesn’t want it to be a hangup, so He skipped that part when He wrote the 4 Gospels. That’s my opinion. :) Michael the great archangel is bronze: what a skincolor that must be! In heaven we won’t be married, it won’t matter if we’re male or female, it won’t matter what color we are and we won’t care. I love Colton’s book but I’m careful to avoid accepting it completely because the story was told by a very young child. Perhaps heaven was presented to Colton in ways that his baby mind could accept and remember. So everything is most likely over simplified. I believe most or all of what Colton reported is true, it doesn’t conflict with the Bible at any rate. But it’s coming from a baby, none the less. And the Bible warns against adding to scripture, in fact there’s a curse for those who try to do that. So Colton’s book cannot and does not carry the same authority as the Bible does. But it sure is fun to read!! And very encouraging, for many reasons..","date":"2012-02-06","mins":"7:08 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7981","author":"anniecee","post":"Hi John, Yes, I thought your pictures were very interesting and I loved seeing them. Amazing! What a blessing God gave you. It sure looks like a real glory cloud to me! Here’s the link to John’s pictures on Flickr, too: http://www.flickr.com/photos/fortheking2010/sets/72157629142268803/with/6806276365/.","date":"2012-02-06","mins":"8:35 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7979","author":"anniecee","post":"I think you’re missing the point of the question, Rebecca. Some people can’t identify with blonde and blue eyes… for very difficult reasons and it’s very understandable. And since the Bible does not SAY what Jesus looked like, we REALLY do not know. Jesus was only half Levite at the very most; the other half could have been any color that God picked out of a hat. The archangel Michael is bronze in color, God could have picked that if He’d wanted to. People make a mistake when they try to fit something into the Bible that isn’t there. Most of the time it’s not there for a reason. People all around the world need to identify with Christ, and if his appearance makes it harder for some people to identify with Him: then God simply didn’t tell us. He left it out. Akiane’s painting is not a photograph of God. Even Christ said, “The flesh is meaningless, it is the Spirit that gives life.” We need to seek Christ in Spirit and in Truth most of all. That is our common ground..","date":"2012-02-06","mins":"8:06 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8004","author":"anniecee","post":"I Corinthians 13, “For now we see through a glass darkly, but then we shall see face to face.” Be careful about enforcing your ideas… if it’s important to you to see him as blonde and blue eyed, then for YOU perhaps he is. But it’s equally as important to other people to be able to identify with Christ from their own perspective. Your eyes are faulty, so are mine, so are we all. That verse in I Corinthians 13 says we all need corrective lenses! Anything we might see here is going to be dull and different from what it’s like when we are with him. People who rely on visions or knowledge apart from Scripture are likely to get into error or at least off the beaten track. That’s one thing I liked about Colton’s book, they laid it out but allow the reader to decide for themselves. The story is told very gently, very kindly. If there’s truth in it, the Holy Spirit can use it. I have my own special little things that Jesus has given me for comfort and communion, but I don’t share it. It’s for me. Sometimes that’s the way these visions are meant: something personal between me and God, which makes it all the more precious. And I agree with you, the sooner the better when Christ returns! “John the Baptist” is out there telling people, warning people. He asked God for a witnessing tool, and God gave him a humdinger of a witnessing tool!!.","date":"2012-02-06","mins":"5:26 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8105","author":"anniecee","post":"Hi Rebecca, Yes I think your research is interesting. I like the explanation about Leah’s eyes. Although I’m not sure why blue eyes would be offensive, unless, like you say, it’s because they’re too sensitive in the arid desert regions. I have blue eyes and I’ve wondered what the ancients did without sunglasses. Or, if Leah was nearsighted I’m sure that would be detrimental too since they didn’t have corrective lenses back then. Our modern things sure do make life better for a lot of people. You’re right, it’s also possible Jesus was fair. But some people really have a problem with “white” Jesus. Here’s my collection of the Face of Jesus. There’s a lot of variety. Many like to portray him with very red hair:.","date":"2012-02-09","mins":"7:21 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8256","author":"anniecee","post":"Khanh, what an amazing story. I’ve already told other people who read that book. As the Bible says, “Out of the mouth of babes… ” Matthew 21:16. This is really FUN stuff, eh? And very encouraging..","date":"2012-02-14","mins":"11:26 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8253","author":"anniecee","post":"Diane, that’s an amazing vision. Quite a revelation… a comfort for people who have experienced extreme loss. The disciples expected Jesus to set up a Kingdom, which he certainly could have done with the power that he had. Instead, Christ deliberately challenged his disciples with words they couldn’t understand until only 12 were left. And then he deliberately gave himself over to the religious authorities who wanted to kill him. Why was “loss” and “failure” the path he chose? Why was the Cross such a gift for the Father? Why was blood necessary? And, where was the Love in such a hideous death? Your vision touches on a mystery that we can barely understand. Most of us just take it on faith because we don’t get it. You’ve had a very rare gift..","date":"2012-02-14","mins":"10:35 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8272","author":"anniecee","post":"There’s another kind of “understanding” that comes from brutal experience. Loss and failure are a very hard road, especially when there’s loss after loss and failure after failure. With 6 miscarriages, Dianne has known very deep grief. As a result, she can offer comfort for very deep wounds..","date":"2012-02-15","mins":"6:36 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8255","author":"anniecee","post":"Joni’s devotional this week says, “Like these saints, we experience the biting reality of suffering; but we also remember the enormously high price Jesus placed on a soul – suffering is bad, but a soul lost is worse (Matthew 16:26). We realize God is permitting something he hates (pain and persecution) so that something he prizes (more souls salvaged) could be achieved..","date":"2012-02-14","mins":"10:59 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8258","author":"anniecee","post":"If that’s what happened to you, to reassure you… I really wondered what happened to the stalker that night to make him stop completely. (I wonder what kind of NDE he might have had…).","date":"2012-02-15","mins":"2:06 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8302","author":"anniecee","post":"Your ex must have been so confused. What an amazing story of divine protection. It’s a wonder that you didn’t find a few fluffy feathers lying around the house… One time when I was traveling alone on a business trip, a car pulled out in front of me on a wet rainy road. There was no place to go or even time to think about it. Not even time to pray but my mind said, “Jesus!” and then the steering wheel kind of jerked hard and the car slid over one lane and squeezed in between two cars… and it was all ok. I was in so much shock I thought I needed to call the police or something BUT then I realized that nothing had happened. Everybody was ok, there was no accident. I’ve always been convinced that an angel grabbed the wheel. And wet roads in Florida are like driving on ice: the heat brings out the oil in the road so when it rains, it’s like ice and very slippery. There’s always accidents when it rains. So that sudden maneuver on the wet road, in my opinion that was impossible. I had been afraid to travel alone so much, but after that I knew I wasn’t really alone..","date":"2012-02-15","mins":"1:01 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8259","author":"anniecee","post":"Oh, whether you had an actual NDE? No, I suspect it was more like a vision. A spiritual experience, showing you the future that God had planned for you. We think the spiritual realm is a long ways away, but stop to think about it: the Bible says that to be absent from the Body is to be present with the Lord. So when Christians die we are immediately in the presence of God. That doesn’t sound like a far off place, to me! And we know that angels pop in and out all the time. Seen and unseen. The Bible says that we see through a glass darkly, but then we will see face to face… sometimes we can almost see what’s on the other side of that veil or darkened glass. When Jesus returns, the sky will be peeled back like a scroll… or you might say: like a piece of paper it will be ripped and thrown aside. Wow, we when think of ALL the Bible verses and ALL the spiritual experiences people have had the things we’ve seen… eternity is only a breath away. It’s all around us, it’s already here. EARTH is what’s temporary and fragile: the life to come is the one that’s REAL, which is why we should be INVESTING in that life. Also, the concept of Time is different in Eternity. In that place, Jesus already rules and reigns. He is already King of kings and Lord of all. It’s very comforting to know that Jesus is already in charge. It’s not a future event, it’s already a fact. Somehow, Jesus took care of your situation for you that night. And He also took the time to minister profound peace when you really needed it. Yours is a beautiful story and I would like to share it with a friend of mine who is dealing with a similar problem..","date":"2012-02-15","mins":"2:34 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8380","author":"anniecee","post":"In Colton’s story, the little boy did see Mary in heaven. Colton’s parents wanted to know what she was like. He said that she acts like a Mom. (His descriptions are so little boy CUTE.) I love his description of the Holy Spirit: well, he’s kinda… BLUE. (I love it!) Colton did say that Mary was right by the throne of Jesus, so she does have a very honored place in heaven..","date":"2012-02-17","mins":"12:34 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8513","author":"anniecee","post":"Thank you for your life story, Lu. It is a blessing to read your words. ———————————————————————————— HERE is a translation (using Google translator, and I clarified some of the phrases that Google didn’t do very well with.) ———————————————————————————— When I was 18. I got pregnant from a boyfriend, and my mother said, “so you will continue living with me, to abort this child.” I tried everything to make this not happen, but it was impossible, because my family mistreated me. Reaching even physically attack me because of pregnancy. My mom then took me to a woman who did abortions. And she had already prepared me for the procedure, when I stood up and said she would not do. Arriving home, I was physically and verbally assaulted again. I thought the longer I stay pregnant, it would be easier for her to give up the idea, since I risking my life, if I aborted with more months of pregnancy. However did nothing to change his mind. To my surprise, since he was 4 months pregnant when she came to take me to a doctor who did abortions. This doctor told us, who performed abortions with no more than 4 months of gestation, and in that case I would need a micro cesarean. And this could only be done in larger cities. My mom then took me to a big city. There were hours and hours of travel. My heart was troubled. I do not want in any way to have an abortion, but was weak, very weak. There was nobody to help me. Even the father of the child, who had been transferred to another city to work, and had no further contact with him. My sister, with my mother, atrocities practiced with me, with the intention that I would miscarry. Beat me, called me names, and forbade me to eat. I had no outlet, and not forces. Arriving in the capital, we stayed, and my mother was the clinic that sent us, talk about the procedure. She paid her half of the service, and the other half would be paid the next day, the day he would do the abortion. The clinic was too far from where we stayed, so we would have to wake up very early. By dawn. And 7 am would have to already be there. That night then, I do not sleep. Lying in my bed, just crying, with the very troubled spirit. I cried and cried, and when I closed my eyes to wipe away the tears and opened them again, I saw a man standing near my bed. He was a tall man, dressed in white, a large waist belt black, and his voice had extreme authority. At no time did he “borrowed”. He ordered. And I will never forget his words. While raising my eyes, he raised his left arm, pointed his finger in my direction and ordered: “YOU WILL NOT DO IT! CHILD THAT YOU DO NOT BELONG! BELONG TO ME! I WENT ABOUT THIS CHILD ON EARTH sent! AND I NEED HER HERE. ” Along with this vision, I also came to a gallows excomunal. A power of decision that I had not until then. Along with vision, I felt a power come and go, knowing that God was with me. So, it was around 5 am. When we would go in right direction already the clinic. When I stood firmly in his voice saying: “Mother, get up, we go back home.” My mother reacted. Swore, challenged, but I was firm. I knew that nothing would make me change my mind. And she knew it. Complaining a lot, she followed me, because I was decidedly back home and nothing would make me change my mind. The Holy Spirit came over me in that decision so so great that a wall does not prevent me back ago. We returned to our city, and it was played at home. I sleep from 4 to 9 months of pregnancy, in toolshed in the backyard. NO ground, but I knew God was with me. Could not get inside the house to eat and was beaten if I did. I have a large scar on my forehead, because hungry at 7 months pregnant, walked into the house to ask for food. My sister broke a plate of glass in my face, at the behest of my mother. It took 13 stitches to close the wound. Back from the hospital, returned home toolshed. I fed the plants that had for her. I spent the night awake, afraid of darkness, rats, spiders and lizards. There was only a blanket to lie. There was no pillow or a mattress … but even I knew God was with me. He had told me this personally. When I felt the pain of childbirth. There was not anyone to help me. At the hospital did not receive any visits from my family, and when I got high was not anyone waiting for me. Was discharged at 7 AM and 11 o’clock at night, no one had gone to fetch me. Ja had no bed for me. The bed where I was was occupied by another mother. And I waited for long hours with my son on my lap, sitting on a bench in the hospital corridor. 11 hours of the night, a neighbor picked me up. When you get home from my mother, I found that all had traveled. The house was locked. The power was off, and had not locked the water, but I just had to stay there. I managed to open the door, and I got it in the dark, and hungry … very hungry … My son was growing and growing. Could, with time and after much crying, I did gain my independence. My son now has 25 years of age. He is a person with the purest soul I know. A great son, honest, and hardworking student. Beyond that, and my biggest and best earthly friend. My mother, who already has 80 years, lives with us for many years in my house. And it is this child, who takes care of it, who buys their medications, their canes. And this son takes care of everything..","date":"2012-02-20","mins":"6:22 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9032","author":"anniecee","post":"To know more about Jesus, it is good to read the Bible. But do not start at the beginning of the Bible: the part about Jesus begins in the sections of Matthew, Mark, Luke and John. And you can pray to Jesus. The Bible says that if you seek Jesus, you will find Him: but you must do it with all your heart. You must be serious about it..","date":"2012-03-07","mins":"3:22 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9548","author":"anniecee","post":"That’s a really cool picture! Thank you for sharing that. :).","date":"2012-03-23","mins":"3:13 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9561","author":"anniecee","post":"Yes, I can see a crown of thorns. But the picture is too grainy to see a dove. It looks more like a fish to me. :) It’s a cool photo and yet frustrating too, just like the grainy shadowy image on the Shroud of Turin. It makes me want to see MORE. I would like to link to your picture if I may. From my blog, which is on hold at the moment as I’ve been finishing a huge project. But I’m going to get back to writing soon… I love to see unusual things like this. What fun! And for those of us who believe, it’s like a kiss from the heavens..","date":"2012-03-23","mins":"10:09 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9687","author":"anniecee","post":"That’s a beautiful testimony, Michael. God has really touched you. My mother was miraculously delivered from cigarettes when she got saved, too. Not everyone who gets saved is blessed with such a sign. And I agree, the lives of the disciples speak volumes. I’ve only recently learned what happened to Thomas and it’s very exciting. The “doubting apostle” was actually known for amazing signs and miracles. He traveled more than Paul did, and went further. There’s an article on the National Geographic website (of all places) that tells about him. Here is a paragraph from that article: “Thomas is said to have raised the first cross in India and performed one of his earliest miracles: When he encountered a group of Brahmans throwing water into the air as part of a ritual, he asked why the water fell back to Earth if it was pleasing to their deity. My God, Thomas said, would accept such an offering. He then flung a great spray into the air, and the droplets hung there in the form of glistening white blossoms. Most onlookers converted on the spot; the rest fled.” Here’s the link to the entire article, but I loved that particular paragraph. Http://ngm.nationalgeographic.com/2012/03/apostles/todhunter text I also learned, just today, that when a Catholic monk/missionary arrived in India in the 1600’s he found a well established Christian community that claimed to have been founded by Thomas. That’s 1600 years later!! I think that certainly speaks of the power of God, because only the Holy Spirit could have kept them on track for 1600 years. If it was only a man made religion, those remote Christians would have evolved into something entirely different and unique by that time and it would not have resembled the rest of Christianity at all. God bless you! It’s wonderful to hear of how Jesus has touched your life. :).","date":"2012-03-27","mins":"7:17 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9682","author":"anniecee","post":"I believe that when God gets hold of a child, He does not let go but watches until He can bring that person back to Himself again later in life. Your love for Him was precious to Jesus, and still is. You can teach your child to learn to love Jesus now, and I think it will help your faith as well. My best friend was concerned that her grandchildren would be raised without Christ in their lives so she has been their babysitter for several years, since they were born almost. Her greatest joy is to hear them pray, and their prayers are so sincere and honest and caring. She has tried to teach them to love Jesus. She wasn’t able to do this for her own kids when they were small, because she was so very lost herself..","date":"2012-03-27","mins":"5:03 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9735","author":"anniecee","post":"Hi Angel, by that logic we could say that every vision since the time of Christ is false, including Paul on the Damascus Road. The Bible does say that in the end times there would be an increase in dreams and visions, so I think it’s OK. The reason for these things is to encourage unbelievers. Usually they are a sign for the unbeliever. Such as Paul: that vision knocked some sense into him on the Damascus road. I don’t think of Akiane’s painting as a photograph of Jesus. It’s more of an “appetizer” for what’s to come. I collect hundreds of images of Jesus and actually, I see a similarity in all of them. But what’s amusing is, each image is painted with the hairstyle of that age and sometimes the clothing too. This is a very modernized image of Jesus and perhaps THIS generation needs a more relevant image to relate to. We don’t worship the image of course. Here is a painting done by Harry Anderson around 1950, and I think it looks a lot like Akiane’s painting. This is one of my favorites: That’s my collection on Flickr. Here are more pictures of Jesus, lots more: http://www.flickr.com/photos/waitingfortheword/sets/72157626190637769/with/5570683856/ And this is my huge collection of THE PASSION, if anybody needs Easter images right now there are more than 700 pictures: http://www.flickr.com/photos/waitingfortheword/collections/72157626459470938/ I want people to share them and enjoy them. Use ’em on websites and church overheads too..","date":"2012-03-28","mins":"8:21 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9746","author":"anniecee","post":"It makes sense to me. Jesus did say “Of such is the Kingdom of Heaven.” And, “Blessed are the Pure in Heart, for they shall see God.” Maybe that’s why the testimony from these little ones is Extra Special, at least to me anyway..","date":"2012-03-29","mins":"8:10 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9736","author":"anniecee","post":"He was a baby, so I don’t get hung up on the little things. His memory might have been affected by being in Sunday School AFTER he had a visit in heaven. In other words, the things he learned SINCE his near death experience may have tainted his memory of it. But one thing that did impress on him strongly was the fact that Jesus DID have “markers” and he saw them and he knew it was really important, which it certainly is. Those scars are wounds of honor and proof of Jesus’ love for us. Anyway, I love the book so much and I think it’s doing a lot of good in the midst of a very unbelieving generation, so I figure whatever faults are there can probably be explained by Colton’s young age in some way. Children who have these experiences gradually lose the sharp memory of it as they get older. He didn’t even mention ANY of it until a year after it happened. Maybe he was too traumatized to want to talk about his time in the hospital – so he shut it all out until he felt secure enough to talk about any of it. And then he only talked about it as bits and pieces came back to him. And, I wonder how much he remembers now that he’s a young teenager..","date":"2012-03-28","mins":"8:34 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5196","author":"anniecee","post":"Guideposts has a magazine called… “Angels Magazine.” :) We especially enjoyed it when they first started publishing it about 5 years ago. It doesn’t seem to be quite the same caliber anymore altho it’s still a nice magazine. They told real life stories of people who had seen or been helped by angels. There were some stories about small children who could see and talk to their angels. This isn’t too unusual, apparently, especially if the child has been ill. I believe in one case the child was retarded. The stories were very sweet. As your child gets older he will most likely outgrow the sensitivity that he has now. My nephew could see things when he was small, too, and he didn’t have any traumatic experiences. Well, yes he did come to think of it. They couldn’t get him to breathe when he was born. They very nearly lost mother AND child during delivery but everybody made it. I only found out about this recently. Apparently my brother, who was in the delivery room, was so traumatized he couldn’t tell us about it at the time. Anyway… you probably don’t need to be concerned about your son, IMO. It’s because he is at such a tender age that he can see the things he does. Most likely he will grow out of it. I do think it indicates a very sensitive heart in your child, and I do pray that he continues to be sensitive to the Lord all his life..","date":"2011-12-03","mins":"6:15 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9763","author":"anniecee","post":"Well, when I think about it, it’s kind of like a warning to the reader that we can’t get TOO deeply involved in it. Some people would set up a statue of Colton and begin to worship it, you know what I mean? And, all Bible prophecies or visions leave stuff out or put something in that doesn’t make sense. The book of Revelation is so frustrating to read. So you just have to read it and take it for what it is. The Bible says we get a blessing just for reading the book of Revelation, and maybe God had to say that so we wouldn’t give up on it. Dreams and visions are like that: we want MORE, we want the ENTIRE picture! But it’s only a taste, not the entire meal. This book is so nearly perfect, maybe God had to throw in one thing just to remind us not to go overboard, but to enjoy it for what it is. And I do think the book, Colton’s story, is a gift from God. We live in a generation where it’s more difficult than ever to believe in what’s supernatural, and we are mocked for doing it. Colton’s astounding 3 minute vision is a very comforting reinforcement that we are not crazy to believe in Jesus. All we desire is truly just a breath away. Heaven is for real..","date":"2012-03-29","mins":"3:18 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-6974","author":"anniecee","post":"Yeah, I knew that. :D Thank you for explaining it. I knew that light had something to do with all colors….","date":"2012-01-14","mins":"4:05 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3313","author":"anniecee","post":"I am glad to hear you’re feeling better. Your vision is awesome, how God gave you strength and encouragement when you most needed it..","date":"2011-07-04","mins":"10:43 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3260","author":"anniecee","post":"The Bible says in I Corinthians 13:12… “Now we see but a poor reflection as in a mirror; then we shall see face to face. Now I know in part; then I shall know fully, even as I am fully known.” So, I would interpret the shadow to mean that we can’t possibly understand all of the glory of Jesus and heaven while we are yet on this side of the darkened glass, or the veil, or the darkness of death that separates us from God. This image is only a hint of what is to come..","date":"2011-06-24","mins":"11:40 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3210","author":"anniecee","post":"I read today, in the Bible, that Nicodemus brought along 75 pounds of scented ointment to wrap the body in when he and Joseph of Arimethea put Christ’s body in the tomb. Seventy five pounds of scented ointment, WOW that’s a lot. I haven’t read up on the Shroud much but I have wondered if anybody took that into consideration when attempting to figure out how the image got transferred into the cloth. The ointment was made of myrhh and aloes. I would think it played a part..","date":"2011-06-01","mins":"5:09 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3262","author":"anniecee","post":"As someone with an artist’s eye, I think there’s a very strong resemblance between Akiane’s Jesus and the one by Ariel Aggemian. I think the facial structure is VERY similar, it’s only the hair, beard and eyebrows that are different – and hair is changeable of course. I like Akiane’s heavy brows, it gives Jesus more of a rugged look. Akiane’s nose is straighter but it’s also not very realistic, I’ve thought for awhile that the nose is the only thing in the picture that’s not quite perfect, and if the nose was perfect too I wouldn’t believe that an 8 year old did it because the painting is just too sophisticated for such a young girl. When I looked at other pictures Akiane did when she was eight, none of them were up to this level, which makes me believe there is more of “inspiration” in that particular painting. Ariel Aggemian’s Jesus has the better nose. Akiane got the proportions right but not quite the shape of it. Akiane’s bold modern colors and modern haircut make Jesus look more handsome, but Ariel Aggemian’s Jesus would look just as good if he went to the barber first. :).","date":"2011-06-24","mins":"12:01 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud"},{"id":"comment-5433","author":"anniecee","post":"Yes, I love that blog page. There are some very beautiful religious works there. The little girl with her prayer book is precious: it looks like a photo. I don’t think I’ve seen Ariel Agemian’s Christ from the Shroud, before. Or if I did, the JPG wasn’t very good quality. I do think he nailed it… I’m somewhat artistic myself so I can almost visualize the face of Christ by looking at photos of the shroud. Not that I could paint it, I don’t think I could. But I can “see” it, and his painting is very remarkable, IMO. Thank you for posting that. Whenever I googled for Ariel Agemian’s painting, all I ever got was images of the Shroud itself. So I’m very glad to see some of Agemian’s work..","date":"2011-12-11","mins":"6:44 am","url":"https://shroudstory.com/2011/12/11/ariel-agemians-christ-painting-based-on-the-shroud-of-turin/","cat":"art","title":"Ariel Agemian’s Christ Painting based on the Shroud of Turin"},{"id":"comment-8010","author":"anniecee","post":"That’s a very rough coin, overall. The letters fade in and out, which was either a problem with the original mold or the mold is getting old (over used) or the person minting it was very sloppy. So to make any attempt to derive such DETAILS or SIGNIFICANCE from such a sloppy coin is not a good idea in my opinion. I’m very very glad there are Shroud experts on this planet. But I think y’all are desperate for something to talk about, frankly..","date":"2012-02-06","mins":"7:49 pm","url":"https://shroudstory.com/2012/02/06/another-justinian-this-one-circa-652/","cat":"art","title":"Another Justinian, this one circa 652"},{"id":"comment-4755","author":"anniecee","post":"I look forward to seeing it! Not long to wait… I hope you will post the followup, since I’m not likely to run across the article unless it appears on CBS News.com … which it might..","date":"2011-11-12","mins":"10:10 am","url":"https://shroudstory.com/2011/11/11/new-bust-of-jesus-from-the-shroud-of-turin-soon/","cat":"art","title":"New Bust of Jesus from the Shroud of Turin. Soon."},{"id":"comment-8083","author":"anniecee","post":"That portrait certainly does resemble ancient icons, but it’s an improvement because the face is more gentle. Some of the ancient icons are really fascinating, but many of them are very intimidating. Or even angry and scary. In fact, I wonder why the Catholic Church used some of them at all, it’s shameful to portray Christ in such a bad mood, IMO. But this portrait is nice, I like it. The artist has a kind face, too. Looks like a sweet guy. He also wrote several books, including one on the dangers of Harry Potter..","date":"2012-02-09","mins":"5:29 am","url":"https://shroudstory.com/2012/02/09/michael-obriens-portraits-of-christ-often-a-likeness-to-the-shroud-of-turin/","cat":"art","title":"Michael O’Brien’s portraits of Christ often a likeness to the Shroud of Turin"},{"id":"comment-4701","author":"anniecee","post":"It’s a strange comment, isn’t it. Although I agree the image does remind me of the Shroud, I imagine a different scenario: perhaps Leonardo was asked to examine the Shroud and attempt a likeness. That’s more plausible than the outrageous theory that Leonardo created the Shroud somehow. I like this painting of the Salvador Mundi. It’s gentle and majestic, both. Christ is regal and yet approachable. This person seems to think that Da Vinci had a certain style in everything he did, but I don’t think that’s true of any artist I’ve known so why should it be true of the Old Masters? Artists are creative people who do enjoy experimenting, changing, creating, growing as artists. If Da Vinci wanted to create an icon, well… why not?.","date":"2011-11-10","mins":"12:38 pm","url":"https://shroudstory.com/2011/11/10/quote-for-today-did-leonardo-paint-this/","cat":"art","title":"Quote for Today: Did Leonardo Paint This"},{"id":"comment-4756","author":"anniecee","post":"Eric, I agree that the plain glass Orb is unusual. Most of the time, the iconic image of Salvador Mundi (Savior of the World) is holding a globe or some other “ball” with bands and a cross on it: which apparently has meaning for Catholics, I just don’t know what that is. The plain glass orb is unusual, and beautiful. It looks as if there are stars in the orb… To ME, it looks as if Da Vinci is saying that Christ is more than the Savior of the World: He is the Savior and Creator of the entire Universe. If that is what the artist intended, I think it’s absolutely fabulous!!.","date":"2011-11-12","mins":"10:19 am","url":"https://shroudstory.com/2011/11/10/quote-for-today-did-leonardo-paint-this/","cat":"art","title":"Quote for Today: Did Leonardo Paint This"},{"id":"comment-4782","author":"anniecee","post":"Yes, the Savior of the World, Ruler, King. I don’t understand why it’s drawn the way it is sometimes, with the gold bands across the top and around the middle. This is a common thing, seen in these images: And I noticed that Da Vinci’s orb didn’t have the extra accessories. I like it that way, free of manmade additions, less bound and restricted… and so pure. Although we tend to think of crystal balls and witchcraft, this pure sparkling orb wouldn’t represent anything satanic – so I do wonder what Da Vinci had in mind as he depicted it this way, and whether his image preceded the others which it apparently did, because I looked up dates of some of those, above. Seems as if the “orb” has evolved down through the centuries. This is another, similar image also done by Leonardo Da Vinci: Which shows that the Salvator Mundi shown at the top of the page isn’t the only one that Da Vinci did. The orb is a little different in that second one..","date":"2011-11-13","mins":"6:59 am","url":"https://shroudstory.com/2011/11/10/quote-for-today-did-leonardo-paint-this/","cat":"art","title":"Quote for Today: Did Leonardo Paint This"},{"id":"comment-4792","author":"anniecee","post":"I found another painting by Fra Angelico and the child Christ is holding a glass orb with the cross bands on it. So this symbolism is really ancient because Fra Angelico lived… 1395 to 1455 AD. Da Vinci was born 1452 AD. Well, it doesn’t really matter. I’ve been a little curious about the meaning of the globe orb cross icon but it goes so far back into ancient history that perhaps nobody knows. Da Vinci’s plain glass orb is unusual, though. I believe I read somewhere that this recently discovered painting was unfinished? So maybe he wasn’t done with the orb..","date":"2011-11-13","mins":"8:24 pm","url":"https://shroudstory.com/2011/11/10/quote-for-today-did-leonardo-paint-this/","cat":"art","title":"Quote for Today: Did Leonardo Paint This"},{"id":"comment-3554","author":"anniecee","post":"Yes, to think of the Shroud as proof of Jesus’ resurrection… it makes sense that it would have happened the way you describe it. “God has chosen foolish things to confound the wise, and the weak things, and things which do not even exist in order to bring to nothing the things that do exist, so that no flesh may glory in His Presence.” …. I think it’s amazing and amusing that a piece of cloth is so controversial, so revealing, so enlightening about what happened during the time that Christ was entombed. It is a profound statement that He was really flesh and He was really dead. And yet, he is not dead anymore. The Shroud says all these things. The Shroud has a life of it’s own, a story to tell. If it was only a dirty piece of cloth that had been proclaimed a religious relic by the will of man, I don’t think these things would be happening. There is mystery in this cloth, a mystery that points directly to Christ..","date":"2011-08-09","mins":"5:00 pm","url":"https://shroudstory.com/2011/08/09/rembrandt-understanding-christ/","cat":"art","title":"Rembrandt Understanding Christ"},{"id":"comment-3552","author":"anniecee","post":"I’m glad you elevated this to a blog post. I thought it was beautiful. Thanks..","date":"2011-08-09","mins":"4:39 pm","url":"https://shroudstory.com/2011/08/09/rembrandt-understanding-christ/","cat":"art","title":"Rembrandt Understanding Christ"},{"id":"comment-4003","author":"anniecee","post":"Ah, it’s just the feminine point of view. I think it’s amusing and I believe she was trying to be amusing. If that’s the typical flavor of that blog, it’s probably not written for a male audience. :D.","date":"2011-09-22","mins":"8:26 pm","url":"https://shroudstory.com/2011/09/22/wimpy-catholic-on-what-jesus-should-look-like/","cat":"art","title":"Wimpy Catholic on What Jesus Should Look Like"}],"blood":[{"id":"comment-9859","author":"anniecee","post":"I think we need to consider the crucifixion more than we have. If the Shroud of Turin truly is the “Sign of Jonah” for this generation, then what message would that “sign” be trying to tell us? To me, it means that we need to consider the true basis of our Christianity. Modern Christians have invented clever doctrines that allow us to be sub standard disciples. The Shroud shames us into remembering the example Christ gave, and the example of the Apostles after Him. Early Christians laid the foundations of our faith in devotion, blood and forgiveness. I have been collecting images of Christ’s life. Recently I put 700 pictures of the Passion in my Flickr account. Looking at so MANY pictures from that most Holy Week made a strong impact on me. Easter this year is so much more meaningful for me than ever before. Christians really love the “pretty” images: the Good Shepherd and Jesus with the Children, and all the glowing Nativity pictures. But maybe we should spend more time looking at the Shroud instead. I think if we dwell on that, and what Christ’s Passion really means, we might live very differently..","date":"2012-04-02","mins":"6:37 am","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-9883","author":"anniecee","post":"The Seventh Day Adventist writer Ellen White thought that the Revelation to John was probably to encourage HIM (John) because he was the last of the Apostles and Christ had not yet returned although Jesus did emphasize “soon.” I thought that was an interesting “take” on it. I am not 7th Day Adventist, but I’ve read a lot of their prophecy books because they are really into it and they use scripture to back it up. But their legalistic tendencies are a little off putting even though I can see they mean well. I read an article yesterday, or part of it anyway, on CNN about the same subject you brought up: that the book of Revelation was written to encourage the early church. And Revelation is addressed to seven churches, so that’s nothing new actually. It seems to me that the PURPOSE in bringing it up in such a way is to DIMINISH it’s purpose for the current Church. And that’s where I get very annoyed. Just because some people have made the serious Error of setting dates for Christ’s return, doesn’t mean we need to diminish any part of the Bible just to settle down the wackos. I don’t agree with the silliness of setting dates or even approximate dates: in fact the Bible specifically warns against it so WHY do these fools try it over and over again? They all think they’ve got an exclusive on hearing from God, or at least they would like people to THINK they do. There’s a long list of prophecies that seem to be in the process of being fulfilled now. One that I think is especially interesting: the Catholics have an ancient prophecy that lists our CURRENT Pope Benedict as the final Pope, with possibly an imposter coming after him. This “Benedictine” Pope will be martyred while in office, according to the prophecy. I think the Catholic prophecies are interesting even though I’m not Catholic, because it’s one more thing that points to THIS time and THIS era. Meanwhile I’m going about my usual work but I’m keeping an ear open for trumpets just in case. And, like John the Baptist I think it’s important to prepare the Way of the Lord, if this is indeed the approximate time. Jesus wants us to BELIEVE Him, and so that’s what I am trying to do. I don’t want to be another Thomas, making excuses. Yes, I know that Newton was a mystic. So was William Blake. These guys were a little weird in their religious views but their heart seemed to be in the right place. Besides, they were geniuses and geniuses are always a little weird..","date":"2012-04-02","mins":"9:36 pm","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-9896","author":"anniecee","post":"Well, if you **Men** want to have a Guys Only forum, why don’t you just SAY so. Max Patrick Hamon’s jab, if it truly is aimed at ME, is inexcusable and shameful. That’s not debate, it’s pure unfounded insult. And one thing I don’t understand is why this new doctrine about the book of Revelation isn’t challenged. That’s twice in two days that I’ve bumped into it. All of you seem to be mad at me for challenging it. — SO, what you’re saying is you do NOT think the Book of Revelation is relevant for the modern Church and you agree with this new theory that it’s purpose ended in the First Century? The Shroud has nothing to do with the Second Coming? If it truly is the “Sign of Jonah” then it most certainly does. And if the Shroud is the “Sign of Jonah” then maybe this Shroud blog is more for God’s purposes than you apparently understand or even care to realize..","date":"2012-04-03","mins":"5:54 am","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-9900","author":"anniecee","post":"How do you get that out of this conversation? That’s sort of a high brow dismissal. Condescending, disapproving. I’ve seen plenty of THAT tactic: it’s a control trick, and it works pretty good in religious cults or atheist forums. Something I said rubbed you the wrong way apparently..","date":"2012-04-03","mins":"6:14 am","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-9901","author":"anniecee","post":"I’ve Un followed this blog now so y’all can relax. ‘Bye..","date":"2012-04-03","mins":"6:17 am","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-9907","author":"anniecee","post":"Well I’m confused about what we’re talking about. But thank you..","date":"2012-04-03","mins":"7:30 am","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-9867","author":"anniecee","post":"Oh yes, the people who try to figure out the date for Christ’s return have got all kinds of info like that. You have to sort out the various calendars for one thing, because the Jewish calendar is different from our Roman Calendar system. And then one of the Emperors decided to coordinate everybody and they actually put an extra month in there somehow in order to get everybody on the same page. I can’t remember WHERE I read all this stuff: I was doing a lot of research on the Second Coming for awhile and those people are really INTO dates. So was Sir Isaac Newton. He was a very religious man besides being a scientific genius. He was annoyed that people kept predicting the date for Christ’s return, and then it wouldn’t happen, and it kept the populace all stirred up. So he decided he was going to figure this out once and for ALL… and he determined that the world will not last beyond 2050. He really got into the math, using Daniel and Revelation to figure it out. His notes on this were recently discovered in the Smithsonian, tucked into one of Newton’s old books. The Bible says that for the sake of the elect, God will shorten the days so I think it will be before that because I don’t want to wait that long!! Anyway, it’s all on Google. Start doing searches and you’ll find alot of very interesting things. But you can find a lot of junk too because the weirdos really go for this stuff..","date":"2012-04-02","mins":"8:46 am","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-9879","author":"anniecee","post":"I disagree entirely that the book of Revelation was written mainly for the early church. It was been a source of hope for all generations of believers. Without the book of Revelation, how would we know that Jesus wins? Without it, we would think, as every miserable century crawls by, that Jesus has forgotten us. Without Revelation, how would we know the Vision of Jesus’ ultimate victory and display of immense power at the end of the world? How would we know that God will indeed bring every work into judgment as we stand in the fearsome throne room of the Almighty? The visuals in Revelation lift us up beyond THIS life and give us a glimpse of the Glory that is to come, as well as a better idea of how great the struggle with satan truly is. The rest of the New Testament is WIMPY compared to Revelation, which breathes the fire of judgment and the Glory of our Almighty God. Jesus was so easily beaten on Calvary, but it was by his own submission. Revelation shows us who Christ really is, and what a privilege it is to know so Great a Person. One thing that was important to Jesus Christ, over and over again, was that we should BELIEVE. Read the Gospels with that ONE thought in mind, and pick up on it! He grieved when Mary failed to believe He could help Lazarus (who was VERY DEAD), but Martha still had a grain of Faith in her so he held her elbow, lead her up to the tomb of Lazarus and whispered to her, “If you believe, you will see the Glory of God.” And, Lazarus was raised from the dead, and apparently Martha played a part in that. **You never saw that in the scriptures, I bet.** Everybody remembers Martha for one thing only. When Jesus visited the disciples in the upper room, He rebuked them because they did not believe when Mary Magdalene told them she had seen the Lord. It wasn’t Thomas only who was the Doubter! Jesus was constantly going after his disciples for their Unbelief, even after the resurrection! I don’t think we can get solid answers out of the weird prophecies in Revelation, but the book says we get a blessing just for READING that book, so if you want a blessing today: GO AND READ IT. Even if I don’t understand it, the vivid word picture of a fire breathing Christ knocking all the enemies FLAT with one BLAST is very hard to forget, and I totally LOVE IT. Bethlehem? If the Bible says He was born in Bethlehem, and if the Old Testament prophecies said he was born in Bethlehem, then I guess I’m inclined to BELIEVE IT. Not because I’m cult blind, but because I don’t see much point in what Mr. Meier has to say. Why would Herod kill all the babies in Bethlehem, if the Christ Child was actually born in Nazareth? Our FAITH is in WHO we know, not what we know. Although the Bible is very helpful, the entire book can be as baffling as Revelation. It is the Holy Spirit who keeps us on track. I agree that Sir Isaac Newton can’t be taken too literally but he WAS a respected scientist and mathematician who really dug around in Daniel & Revelation, and tried to understand it so it’s worth looking at. Mainly, I think it’s VERY interesting that ALL prophecies converge on this (current) time period so I think people would do well to be ready. The Bible says we can’t know the day or the hour, but Jesus also commanded his Disciples to be able to read the Signs of the Times and don’t be stupid about what’s obvious. (That’s my paraphrase.) Jesus wants EVERY generation to believe He is coming again when anyone least expects it: because we do live differently if we believe it..","date":"2012-04-02","mins":"7:30 pm","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"}],"dating":[{"id":"comment-4517","author":"anniecee","post":"I’ve had doubts about Carbon Dating all along, so I’m glad to hear that it is losing its authority as a reliable scientific method. I think the main reason I’ve had questions is because of the bizarre dates that scientists throw at us, based on carbon dating. Some dates go back tens of thousands of years. And then there’s a huge leap to millions of years. I cannot remember seeing any “carbon dating” numbers that go back to 20,000 years, 30,000, or 100,000, 200,000 years etc. It seems as if all the carbon dating reports I’ve heard about will SKIP from 10,000 to millions – and nothing in between. Some of us think the Flood could account for this. Noah’s flood throws carbon dating off. If they were to factor in the Flood, and how it could skew the numbers, then maybe (probably!!) the dates would end up being very different. They also don’t consider the “canopy” that many people believe existed before the flood, where all of the earth was protected from UV rays and other harmful environmental factors that we have now. The earth CHANGED after Noah’s flood, and it was a drastic change. But of course, scientists don’t consider any of that. Even though most ethnic groups on this planet have an ancient legend of a catastrophic world flood, scientists don’t consider it to be a possibility. So the flood and the canopy are not included in calculations. I don’t know if we could figure it out, anyway: we don’t know what the earth was like before the flood so how could we make adjustments for it? But I do think we could do better than ignoring the flood completely. Maybe Carbon Dating would retain it’s Authority, if Scientists used it with these factors in mind..","date":"2011-11-02","mins":"12:50 pm","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","title":"A Reaction to Giulio Fanti’s Suggestion"},{"id":"comment-5814","author":"anniecee","post":"An awful lot of people are really bothered by the Shroud, aren’t they. This is an interesting phenomenon in itself..","date":"2011-12-21","mins":"5:06 am","url":"https://shroudstory.com/2011/12/21/chivers-in-the-telegraph-get-over-it-the-turin-shroud-is-fake/","cat":"carbon_14_dating","title":"Chivers in the Telegraph: Get over it. The Turin Shroud is fake."},{"id":"comment-3316","author":"anniecee","post":"I have noticed, with considerable chagrin, that God has not provided us with the kind of “proof” that many demand. It would be so much easier if the Ark were found on Ararat, and the mysteries of the Shroud could be nailed down, and the actual cross upon which Jesus died had been preserved from the very beginning, just to name a few artifacts that Christians would love to place in our historic museum of “Proof.” But we don’t have much. God is looking for more than this, apparently. He’s not willing to make it easy to find the spiritual path. Besides, things which are spiritual cannot be proven by natural means anyway. And this is the really HUGE point on which the skeptic and the athiests make their error. They demand proof of what is supernatural, but they require the proof to be in Natural terms. Ultimately it comes down to the leap of faith, every time. There’s no way to avoid it. Christianity is about faith in Jesus Christ. It is about bridging what it natural in order to obtain what is supernatural. And for those of us who have taken that leap, we are not left as fools. We know Him whom we have believed, so there are no doubts. This is why the scoffing of unbelievers is so astonishing: they really don’t know what they’re talking about. But we can’t “prove” it to them, because each of us needs to take the step of faith for ourselves, individually. The journey is a personal one..","date":"2011-07-05","mins":"11:56 am","url":"https://shroudstory.com/2011/07/05/crazy-talk-are-atheists-biased-or-just-uninformed/","cat":"carbon_14_dating","title":"Crazy Talk: Are Atheists biased or just uninformed?"},{"id":"comment-3319","author":"anniecee","post":"That’s a truly unique point: I love it. Perhaps “Science” could learn more about the origins of Man from this Shroud than they can learn from their huge microblaster in Switzerland. It’s quite possible! Perhaps, by denying the reality of God they shun the very Clues that God is willing to give them. :).","date":"2011-07-06","mins":"9:32 am","url":"https://shroudstory.com/2011/07/05/crazy-talk-are-atheists-biased-or-just-uninformed/","cat":"carbon_14_dating","title":"Crazy Talk: Are Atheists biased or just uninformed?"},{"id":"comment-3368","author":"anniecee","post":"As a Christian since childhood, I never gave the Shroud much thought until reading the comments here. I don’t need proof, so what does the Shroud matter to me? So I think it’s fascinating that God has used the Shroud as evidence for the unbeliever, to bring people to faith. What a fantastic witnessing tool, especially for those who are more concrete in their way of thinking… such as my brother who is an engineer and a math genius. Some people have a very difficult time making the “leap of faith” because it doesn’t make sense to them. I think they have difficulty believing that spiritual things exist at all, anywhere – since it’s not in their nature to be sensitive that way. I should learn more about the Shroud..","date":"2011-07-21","mins":"5:41 am","url":"https://shroudstory.com/2011/07/05/crazy-talk-are-atheists-biased-or-just-uninformed/","cat":"carbon_14_dating","title":"Crazy Talk: Are Atheists biased or just uninformed?"},{"id":"comment-3369","author":"anniecee","post":"Frankly, if the Shroud has THIS kind of influence… in my mind, this is the “proof” that it is, indeed, very real..","date":"2011-07-21","mins":"6:13 am","url":"https://shroudstory.com/2011/07/05/crazy-talk-are-atheists-biased-or-just-uninformed/","cat":"carbon_14_dating","title":"Crazy Talk: Are Atheists biased or just uninformed?"},{"id":"comment-4537","author":"anniecee","post":"“Behold a (Greek) indeed, in whom there is no guile! ” The geiger counter is terrific. And, I like this guy’s straight talking honesty. :).","date":"2011-11-03","mins":"11:08 am","url":"https://shroudstory.com/2011/11/03/modified-geiger-counters-to-measure-holiness/","cat":"carbon_14_dating","title":"Modified Geiger Counters to Measure Holiness"}],"events":[{"id":"comment-52908","author":"anniecee","post":"Is it because the Shroud is less mystical, that miracles are not associated with it? Or is it because the Shroud is apart from all of them, or above and beyond all other relics? It is one thing to worship before a saint. The saint is obviously a lesser being than Christ Himself, and actually so is the miracle. Works done in the flesh of mankind are of less value than those done in the spirit of mankind. And most documented miracles are healings of some kind. John 6:63 “The Spirit gives life; the flesh counts for nothing.” The Shroud represents a spiritual work. Nobody can truly understand why the Cross of Christ is as significant as it is, or even why it was so necessary: this is something we accept by faith. In accepting it, we acknowledge God’s greater wisdom that exists in the plan of Redemption – and accept that by faith too. Since the Shroud represents this great work of Redemption, something that can’t be understood but is the essential core of our Faith in Christ: then why in the world would we expect the Shroud to be associated with something of the flesh – such as a miraculous healing? Because that’s what most saintly miracles are about is healing of physical problems. The Shroud does not represent that kind of healing. It represents a far more significant healing and a far more significant power and a far more significant wisdom than looking after the cares of this earth. I didn’t know that the Shroud was not associated with any known miracles, but it didn’t surprise me when I read that. In fact, for me, this news is actually a possible validation that the Shroud may indeed be the real thing..","date":"2013-11-27","mins":"5:19 am","url":"https://shroudstory.com/2013/11/23/the-evidence-of-things-not-seen/","cat":"event","title":"The evidence of things not seen"},{"id":"comment-55243","author":"anniecee","post":"That’s a very good observation, thank you. I realize the science is important, and I’m glad that so many are interested in it – because there are some who have come to faith because of studying the Shroud. For me, the science is unnecessary and even a bit tedious at times. I do think it’s fascinating that the Shroud tantalizes the atheists the way it does. This is amusing, IMO. God seems to be mocking the mockers. While at the same time, God in His mercy reaches out to them through the message that’s imprinted on that ancient piece of cloth..","date":"2013-12-02","mins":"6:48 pm","url":"https://shroudstory.com/2013/11/23/the-evidence-of-things-not-seen/","cat":"event","title":"The evidence of things not seen"},{"id":"comment-8139","author":"anniecee","post":"Oh, it will travel the WORLD?? That really is exciting! I thought the exhibit was only in Spain. I don’t suppose there’s any chance the Shroud itself will be there? I really REALLY like what the scholar in South Africa said about the Shroud being “The Sign of Jonah” for our generation. That made a whole lot of sense, to me. How amazing that God would push it to the forefront in these final days, to more or less shove it in the face of those who blaspheme Him. This is an unbelieving generation. I know that every age has had it’s full share of sin and trials, but I really do think the blasphemers have ramped up to a new level. And just as they ramp it up, so does God. This Shroud of Turin shows His mercy, actually. God is reaching out to those who are the most blatantly skeptical. To enter the Kingdom of Heaven, we must have the faith and trust of a little child. That’s not a copout actually: it’s very difficult for intelligent, capable adults to let go and trust God. It’s a daily exercise, a daily discipline, a daily effort in prayer and Bible study. As well as being an enormous privilege: that we can lean on God to such a degree and find our comfort in Him..","date":"2012-02-11","mins":"6:25 am","url":"https://shroudstory.com/2012/02/11/upcoming-exciting-exhibition-on-the-shroud-of-turin-in-mlaga-spain/","cat":"event","title":"Upcoming, exciting exhibition on the Shroud of Turin in Málaga, Spain"}],"history":[{"id":"comment-9287","author":"anniecee","post":"Also, by the time Christ died he was extremely dehydrated, almost depleted of blood entirely. From descriptions of the crucifixion, medical professionals have determined that he died of heart failure due to extreme blood and fluid loss. Basically, Christ bled out from His many wounds: which would have made his eyes very sunken due to the extreme dehydration. The gaunt appearance that is evident on the Shroud indicates more than just a man who was slender: it also confirms the description of Christ’s death in the Gospels. The Lamb who was slain… the sacrificial lamb of the Old Testament was drained of blood. The blood was the most significant part of the sacrifice, because it was the blood that was sprinkled on the Mercy Seat in the Holy of Holies. It seems that Christ gave every last drop for our atonement, He did not spare a bit of Himself but truly gave all so that His death would be the last and final sacrifice. Also, I feel as if I need to repeat this over and over in order to UNDO the damage done by the movie The Passion: Christ was not a victim. At no time was he ever a captive of the Romans or the Jews. The scriptures make it clear that He did this willingly, that He died when He decided it was time to die and that Christ raised Himself from the dead when the 3 days were completed. Christ was not a victim!! What we see on that Shroud was done in submission to the Father’s Will. The Shroud is a monument to Holy Obedience, and it should serve as an example for all true believers of what “discipleship” truly means..","date":"2012-03-13","mins":"4:34 pm","url":"https://shroudstory.com/2012/03/13/banding-maybe-jesus-looked-different/","cat":"history","title":"Banding: Maybe Jesus Looked Different"},{"id":"comment-9288","author":"anniecee","post":"I can’t remember now why I started on that tangent… Oh yes, it’s because the writer mentioned that Christ probably looked different once you eliminate the banding in the linen. I think the linen studies are very interesting and it’s great that they help to confirm the origin of the Shroud. But do I think it’s important to remember that Christ was definitely not at his best when that image was made. Although they’ve been able to extrapolate a computer generated image from the Shroud that is quite attractive, I think the image on the Shroud may not look anything like the Christ before he was so brutalized..","date":"2012-03-13","mins":"4:41 pm","url":"https://shroudstory.com/2012/03/13/banding-maybe-jesus-looked-different/","cat":"history","title":"Banding: Maybe Jesus Looked Different"},{"id":"comment-9313","author":"anniecee","post":"“Not one of a tortured victim, but one of accomplishment.” Yes, that’s true. I hadn’t thought about it but the face does have expression. He looks peaceful, not tormented. Perhaps even “satisfied”, as if he was thinking, “I’m glad that’s over with.” A job well done. The Shroud is truly amazing, in all that it conveys. Although I had not been very interested in the Shroud before I found this blog, it would be difficult now to convince me that it is NOT the real Shroud of Christ. There is so much about the image that is authentic. And the fact that it drives the atheists crazy: well that seems like God’s sense of humor, as well as his Mercy in trying to reach out to a bunch of hardheads..","date":"2012-03-14","mins":"3:20 pm","url":"https://shroudstory.com/2012/03/13/banding-maybe-jesus-looked-different/","cat":"history","title":"Banding: Maybe Jesus Looked Different"},{"id":"comment-6897","author":"anniecee","post":"Oh, there are soooo many possibilities that I don’t think we can draw firm conclusions from the little bits of info that are in the Bible. For one thing, we know that Mary Magdalene was there at the tomb BEFORE Peter and John looked into it. She might have taken the large shroud with her!! When the man in the garden asked why she was weeping, she asked the man if he knew where Jesus body was. Perhaps she had the shroud in her hands, looking for the body to wrap it with. That fabric was valuable (all fabric was valuable in those times) and so she was hanging onto it because she needed it – and could not afford to go buy another. And perhaps it is Mary Magdalene who ended up keeping that Shroud as a memento and memorial – which somehow was saved and preserved through the centuries. Because she is so prominently mentioned in the gospel accounts of the resurrection morning, I would not be surprised if she did indeed have something to do with the Shroud. I can see how it would have happened very naturally..","date":"2012-01-13","mins":"5:23 am","url":"https://shroudstory.com/2012/01/13/have-a-think-about-it-of-linen-strips-and-the-shroud-of-turin/","cat":"history","title":"Have a think about it. Of linen strips and the Shroud of Turin."},{"id":"comment-4969","author":"anniecee","post":"That’s very interesting! Who is sponsoring this I wonder… is it the Catholic Church? No, it’s a University Event… The Spanish Center is a cultural association Sindonology therefore non profit organization that aims to study the Shroud of Turin, but also that of other relics that may be or have been scientifically studied. Jorge Manuel Rodríguez Almenar Professor University of Valencia President of the Spanish Centre Sindonology (CES) Well, if the Catholic Church does not allow access to the Shroud, what is the point? Perhaps this group hopes to influence the Church with such an event?.","date":"2011-11-24","mins":"11:18 am","url":"https://shroudstory.com/2011/11/24/international-conference-on-the-shroud-of-turin-in-valencia-next-april/","cat":"history","title":"International Conference on The Shroud of Turin in Valencia Next April"},{"id":"comment-4798","author":"anniecee","post":"It is interesting that her article states: the practice of crucifixion was discontinued BECAUSE of Jesus Christ. Constantine abolished it in 337 A.D. When the Roman Empire is mentioned, what do we think of first? Slave revolts, crucifixions, gladiator events, executions of men and women in the Coliseum, and the terrible tortures of Nero and other heartless emperors. It seems that the Romans are remembered primarily for their extraordinary cruelty. I read recently that the Gladiator competitions were discontinued due to public outcry against them. Constantine abolished the games in 325 AD, but Emperor Honorius had to abolish them again less than 100 years later. Like cockfights or dogfights, apparently it’s very hard for some people to give up their taste for violence as entertainment..","date":"2011-11-14","mins":"12:34 am","url":"https://shroudstory.com/2011/11/13/more-than-you-want-to-know-about-crucifixion/","cat":"history","title":"More than you want to know about crucifixion"},{"id":"comment-14744","author":"anniecee","post":"Hello Yannick, Actually, I don’t care much if the Shroud is real or not. It doesn’t matter to me, even though I am intrigued by it. I was only commenting on the thought that God would have left a perfect image, if it was God that did it… and no, I don’t think that’s necessary. It’s not God’s way to leave a full and complete trail to any physical evidence. It would be NICE if He would provide solid proof now and then (it would make it easier for witnessing) but God prefers to drive us to Faith instead. I am inclined to believe that the Shroud probably is real, primarily because of the interest it raises, the questions it leaves unanswered and how it tantalizes the atheists: perhaps even mocks them. And, someone pointed out that the Shroud may be the “Sign of Jonah” predicted by Jesus. These things speak to me of authenticity as much as the physical characteristics of the Shroud. I thought you believed the Shroud was real: have you changed your mind on that? Perhaps I was mistaken..","date":"2012-08-10","mins":"10:15 pm","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","title":"Imagine the image as part of the resurrection and not the result of the resurrection"},{"id":"comment-14741","author":"anniecee","post":"Oh wow, thank you for that. I have often thought something similar: that deception is God’s mercy so that their judgment will be less. I am frustrated with deception when I encounter it, but I also realize that sometimes God leaves people entangled in their deceptions out of His mercy, because of their hardness of heart. Why force them to see Truth that they would ultimately reject and thus be responsible for more sins against God? The only thing we can do is speak the Truth anyway, but it was helpful for me to understand this. You put it in a nutshell, and with a little variation. May I borrow it?.","date":"2012-08-10","mins":"8:54 pm","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","title":"Imagine the image as part of the resurrection and not the result of the resurrection"},{"id":"comment-14721","author":"anniecee","post":"Hebrews 11:6 “And without faith it is impossible to please God, because anyone who comes to him must believe that he exists and that he rewards those who earnestly seek him.” It is certainly OK, (to say the least) for Christians to believe in a “supra Quantum” event in connection with the Shroud: something miraculous, as part of the resurrection AND as a result of it, AND as evidence of it… It is most certainly OK to add “faith” to the mix… IN FACT, Jesus would be disappointed in anything LESS!! He was always scolding his disciples for their lack of faith. He couldn’t understand it, and at times their lack of faith deeply grieved Him. There are those who wish to cast Doubts on anyone who believes anything: they refuse to have faith in anything. They claim to have faith in “science” but that claim shows what hypocrites they are because science doesn’t represent anything in particular and science changes it’s mind constantly as new facts emerge. Science is as wishy washy as it gets. Today coffee is good for you, tomorrow it will kill you. Butter is bad for you, butter is good for you. Same with chocolate etc etc. And unfortunately, “science” is motivated too much by money, because money pays its bills. Those who claim science as their god are copping out on reality, IMO, because there’s plenty of “evidence” that supra natural is all around us. We must not get down to the level of the Doubters and be ashamed of Faith or ashamed of miracles. Of course, it is reasonable to answer reasonable questions from reasonable people who want real answers. But the people WITH the answers should not be ashamed to embrace FAITH as part of the answer. And THAT may well be part of the MESSAGE of the Shroud: that faith is an ESSENTIAL part of solving its mysteries..","date":"2012-08-10","mins":"10:41 am","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","title":"Imagine the image as part of the resurrection and not the result of the resurrection"},{"id":"comment-14724","author":"anniecee","post":"Besides, our thinking about “supernatural” is all messed up. If God is real, then supernatural is completely natural. Real is real. So the question regarding what’s “real” and what’s not real, boils down to whether GOD is real or not. It’s as simple as that..","date":"2012-08-10","mins":"10:54 am","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","title":"Imagine the image as part of the resurrection and not the result of the resurrection"},{"id":"comment-14726","author":"anniecee","post":"Yannick… “Seriously, do you see God makind miraculously an image on a linen cloth that wouldn’t be perfect and complete ??? : )” Yes, absolutely. The Bible is full of incomplete ness. The Birth of Christ fulfilled all the prophecies but also revealed how fragmented the prophecies were. The Bible says that now we see through a glass darkly, but THEN we shall see Face to Face. It is the very incomplete ness that makes FAITH necessary. We must jump over all those gaps and embrace Jesus ANYWAY. Jesus’ own life was incomplete, cut off in his prime, cut short of everything that the Messiah was predicted to be. We still wait for fulfillment of many incompleted prophecies regarding the Messiah, the coming King. His death doesn’t make any sense except to those who believe: to everyone else it was a tragic brutal waste. And that’s because the Story of Jesus Christ is not finished yet, it is not completed, even though the Bible TELLS us how the Christ Story will end, it has not happened yet. If the Story of Jesus ended at the cross and the grave, there would be absolutely no reason to be a Christian. But we know there’s MORE, that’s why we follow Him. Incompleteness is everywhere in Christianity. Would God give us only a partial image? Oh, you bet He would. That’s exactly how God does things. Because FAITH is essential in order to please God, and so it’s Faith that he’s digging around for, above all else..","date":"2012-08-10","mins":"11:16 am","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","title":"Imagine the image as part of the resurrection and not the result of the resurrection"},{"id":"comment-3834","author":"anniecee","post":"I agree that there is Victory in Christ. But I think modern man is almost unable to perceive what that Victory actually is. Sullivan implies it’s all about feeling better about ourselves and our origins and our potential, which I think is way off the mark because it’s a humanistic reasoning. Man centered. I think Genesis chapters 1 3 are a poetic account of creation that provides almost no details. And yet there’s a lot that can be gleaned from it, not about the HOW but more about WHY. I believe God’s heart is revealed in those chapters but not His methods. I actually believe Evolution is a waste of time. How did our earth come into being? Nobody will ever know the answers to that until we get to heaven and we can watch the home videos of God actually doing it. I suspect that everybody’s theories are off the mark. What totally annoys me about secular evolutionists is how they try to pound their theories into every new discovery, instead of appreciating the discovery for what it is. An ancient skull is very interesting, there’s no doubt about it. And even if carbon dating isn’t very accurate (which I don’t think it is), there’s still no doubt whatsoever that scientists have found some incredibly old skeletons in recent years. So of course they are fascinating. Why ruin it with all the evolutionary stupid talk about millions and billions of year and how this skeleton is nearly almost the missing piece they’ve been looking for? That’s a bunch of malarky. Even Darwin knew that his theory would never be proven, there isn’t enough fossil evidence to do that. There are some things that can be proven and other things that never will be. I think we waste time and money on some sciences that could be better spent on other kinds of research. It’s important for us to STOP and consider what is knowable, and what isn’t. People don’t seem to think of that, however, and so these ENDLESS discussions go on and on. Calvinism vs. Arminianism for example: an ancient conflict that will always be a conflict. And it’s not even important to our faith. It’s another question of HOW God does things. God doesn’t always explain the HOW. What Martin Luther fought for, now THAT is an important discussion. The Apostle Paul was the one who fought for Grace first and then Luther had to fight for it all over again. Some things are essential to Christian faith. If Sullivan’s Christian doctrine is basically sound, I’m glad to hear it. He threw me off by saying that the Tower of Babel is a myth, and I still have my doubts about him. The Tower of Babel is actually on Google Earth, the spot is easy to find and investigate. So what’s the myth? That languages developed from then on? Well, he could be right about that… Another theory is that God made it more difficult for people to UNDERSTAND one another: even though they spoke the same language they could not come to agreement or understanding. The turmoil that resulted caused them to abandon their Tower of Babel project and people scattered in various directions with everybody mad at everybody else. That’s another possibility. Is there any way to prove exactly what happened? No. We weren’t there. The foundations of the Tower are still there, however, as testimony that the Tower of Babel did exist and God’s account must have some importance for us since it’s in the Bible. So I don’t think it’s right for Sullivan to call it a MYTH. I am not likely to trust anything he says if Mr. Sullivan can’t show more respect for the Bible than that. Whether the Shroud of Turin is the real deal or not: well, that’s not exactly essential either but it’s one of those things that is just really Cool. And it’s encouraging for Believers, whether it’s the real Shroud of Christ or not. Because Christ really DID have a Shroud, and the Shroud of Turin helps us see Christ in yet another light. Regarding the current Pope, he was in charge of analyzing and clarifying and defining Church doctrine for many years. I have admired everything I have read so far, which admittedly isn’t all that much, but I really have admired his work regarding Christian doctrine. I think he’s remarkably clear headed. Which shows that the heart of the man knows how to be in tune with the mind of God. I think he’s a good Pope, even though he’s not as charismatic as his predecessor. I’m not surprised the Cardinals selected him so quickly to be the new Pope, because his work was probably well known among them. (I’m not Catholic, by the way.).","date":"2011-09-12","mins":"7:45 pm","url":"https://shroudstory.com/2011/09/12/i-am-defeated-all-the-time-yet-to-victory-i-am-born/","cat":"history","title":"“I am defeated all the time; yet to Victory I am born.\""}],"forensic":[{"id":"comment-5865","author":"anniecee","post":"I like Yannick Clément’s “triple amen.” :) And I like Dr. Peter Mullen’s “unsatisfactory faith.” That is a good challenge, a wonderful challenge. It strikes a note with me, I think this has been bothering me for days and it’s refreshing to hear it. Yes, I need to strive for better faith. We need to strive for better faith. And those who insist on substantial proof need to get on their knees and get busy with God while they are still able. Because there will come a time when it’s too late to acquire faith. I googled for the phrase “God of the Gaps” and discovered that’s an actual term. I assumed it meant that people refuse to believe in God until all the gaps are filled (or all the dots connected.) But actually, “God of the Gaps” refers to the idea that anything which cannot be explained is assumed to be supernatural. I think the term is a little bit obscure. And, I think it’s a false observation most likely coined by people outside the faith. They don’t understand how we think, as Christians. The implication is that Christians are over eager to label something as supernatural when it might not be. There are some impulsive people who may think like this but I believe most Christians are not so simple minded. We are intrigued that the Shroud MIGHT have been created by supernatural means but that doesn’t mean it was, and I think most people know the difference. Anyway… I think Dr. Mullen’s statement is related to this issue. True faith is able to accept that our knowledge is and always will be incomplete, until we see God face to face. Incomplete knowledge is an opportunity to **trust** God for what we don’t know, an opportunity to exercise faith. This is “satisfactory faith.” It is pleasing to God..","date":"2011-12-21","mins":"9:59 pm","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","title":"An unsatisfactory faith insists upon forensic proofs"}],"image":[{"id":"comment-5183","author":"anniecee","post":"Yes, reminds me of supercalifragilisticexpialadocious. If you say it loud enough you’ll always sound precocious. I bought a book for my brother for Christmas. It’s titled, “The Superior Person’s Book of Words.” This book is so amusing I might keep it for myself… :).","date":"2011-12-02","mins":"10:11 pm","url":"https://shroudstory.com/2011/12/02/archaeocryptologically-roflmao/","cat":"image_theory","title":"Archaeocryptologically ROFLMAO"},{"id":"comment-4951","author":"anniecee","post":"St. Catherine’s monastery in the Sinai?? Wow, a clue! Why does Da Vinci always get blamed for everything… it’s gotten to the point where, if Da Vinci’s name comes up, I really don’t want to hear it because this guy couldn’t possibly have done all the stuff he gets credit for. But this monastery… maybe they should be looking into that more. Maybe it was a monk at the monastery who made the shroud. That would be more likely: some hidden monastery in some remote place with some secret monk who used to be a mad scientist chemist magician before he converted. A place so remote that the REAL truth about the Shroud could be forever sealed. Da Vinci’s workshop was far too public: people would have known. But I think the conspiracy theorists should investigate this monastery. Who knows what other relics this mad scientist chemist magician monk was able to turn out; all in the name of promoting the faith? I should write a book, I think I’m onto something… :D.","date":"2011-11-23","mins":"12:20 pm","url":"https://shroudstory.com/2011/11/23/poor-leonardo-must-be-turning-over-in-his-grave/","cat":"image_theory","title":"Poor Leonardo must be turning over in his grave"},{"id":"comment-5301","author":"anniecee","post":"So you think I’m somewhat acerebral, eh? Well, the author of the “Superior Person’s Book of Words” says that only wire haired terriers are acerebral..","date":"2011-12-07","mins":"8:51 am","url":"https://shroudstory.com/2011/12/02/archaeocryptologically-roflmao/","cat":"image_theory","title":"Archaeocryptologically ROFLMAO"},{"id":"comment-6033","author":"anniecee","post":"Those poll results are better than I expected. If 80% think it’s either a holy relic or an unsolved mystery (leaving the door open)… those are phenomenal results IMO. Shows how the New Atheists may be loud and disruptive but they’re not anywhere close to being a majority. Of course, I am “assuming” that the 14% are mostly people who are prejudiced against Christian religion. I might be wrong about that..","date":"2011-12-23","mins":"12:18 pm","url":"https://shroudstory.com/2011/12/23/surprising-live-poll-on-the-shroud-of-turin/","cat":"image_theory","title":"Surprising Live Poll on the Shroud of Turin"},{"id":"comment-5177","author":"anniecee","post":"Your point #1, that the blood marks are not smeared: no, they would have been DRY by then. Jesus hung on the cross for a time after he died, before his followers got permission to take him down and bury him. The blood would have left an imprint but would not have been “runny” by that time. Also, his disciples and the women would most likely have wiped away the worst of it, the best they could, before they laid Christ in the tomb. This is why the women returned early on Sunday, so they could finish preparing the body. They probably covered up the body lightly on Friday, just enough for decency. And brought more supplies with them on Sunday morning, to finish the job. Also, there is some indication from the crucifixion account that Jesus had almost no blood left when he died. When the soldier pierced his side and blood mixed with water ran out: medical experts say this is an indication that his blood loss was very severe. So there wouldn’t have been enough blood left in his body to be able to run, spread or smear. It was more like he was spotted with whatever was remaining of his blood — rather than dripping with it. This is consistent with the idea of the animal sacrifice where the blood was drained from the animal. It’s a gross comparison, but there’s nothing about the crucifixion that is attractive. The point is, Jesus gave up every last DROP of blood, He gave it all… showing H Is followers that He was indeed a sacrifice, a complete sacrifice, an adequate sacrifice, and a totally committed sacrifice. Jesus gave absolutely everything He had, every last DROP, in order to fully complete his mission to END the need for ANY other atonement sacrifice. As for your other points, I always find it amusing that skeptics eliminate any supernatural cause for phenomena. As if there is no such thing as supernatural. In spite of the fact that people see things, hear things, sense things that are beyond the “natural” all the time, every day. Even animals have indicated they see, hear, sense these things too, when they are happening. The stories are so abundant that IMO, they MUST be considered as part of intelligent evaluation. But atheists refuse to consider the possibility of anything beyond what is natural even though they “believe” in other invisible things such as nutrinos and electrons etc. Which, IMO, is fulfilment of the Bible verse in Romans 1:21 22 which says, “For even though they knew God, they did not honor Him as God or give thanks, but they became futile in their speculations, and their foolish heart was darkened. Professing to be wise, they became fools.” Scientists are fascinated with the possibilities of light and sound… The Bible says that God is light, and in Him is no darkness at all. It’s easy for a Believer to assume that something supernatural happened to that Shroud. It may have been Infused and supercharged with light, energy, or the elusive element of LIFE, which scientists STILL do not know what LIFE is. And if science still does not understand why LIFE is what is IS, then why is it so hard to understand there is more on this earth than what merely “natural.”.","date":"2011-12-02","mins":"7:43 pm","url":"https://shroudstory.com/2011/12/02/was-the-shroud-of-turin-created-by-gnostics-continued/","cat":"image_theory","title":"Was the Shroud of Turin created by Gnostics? (Continued)"},{"id":"comment-5300","author":"anniecee","post":"Ahem… we think it’s Jesus because the legend about THAT particular cloth SAYS it’s Jesus. It’s not like somebody made this story up last week or last year. Also, it’s quite likely that the disciples DID keep the cloth. We know that three women and two men (at least) visited the tomb that first Easter morning. They might have taken the cloth with them. Fabric was very valuable. If Jesus was still dead and his body showed up again, they would NEED it. But they never did need it. But since they did have that stained cloth in their possession, and knowing what a fuss Jesus had made about his own blood in the weeks preceding his death, they might have kept it for all kinds of reasons. As they began to understand the value of what Jesus did on the cross, it most likely became very precious to them. So… who hung onto it? One of the women? Peter? John? In the hours after the resurrection, I’m sure they must have looked at the shroud and noticed how peculiar it was. Not exactly what you’d expect from a body that had just been crucified. Perhaps the shadowy image was quite sharp to begin with. Knowing how everything about Jesus was not “normal” or “usual” … he was constantly doing miracles, constantly saying strange things about God his Father… I would imagine that they viewed the shroud as just another strange thing in a long long list of strange things that were always happening when Jesus was around. His own mother was so accustomed to this, in fact, that when the hosts ran out of wine at a wedding she just ASSUMED Jesus could fix the problem. So he did, because she asked him to. Can you imagine what it must have been like to raise a son like THAT? Sometimes I am so jealous of Mary and what she must have seen and heard during the years of Jesus’ childhood and youth. I do hope there are lots of home movies because I’m anxious to see them when we get to heaven. I think I got off on a tangent… where were we?? Oh… We think it’s the Shroud of Jesus Christ because everybody said so. And because it’s a very strange object, which would have been typical of just about anything Jesus was involved with..","date":"2011-12-07","mins":"8:42 am","url":"https://shroudstory.com/2011/12/07/why-do-we-think-it-is-an-image-of-jesus-on-the-shroud-of-turin/","cat":"image_theory","title":"Why do we think it is an image of Jesus on the Shroud of Turin?"},{"id":"comment-5205","author":"anniecee","post":"It seems that any “expert” can have a few minutes of Fame if he publishes an opinion on the Shroud of Turin. I wonder why that is?.","date":"2011-12-03","mins":"3:57 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor"},{"id":"comment-8046","author":"anniecee","post":"“I’m more inclined to think the image is miraculous in ways that we have never even imagined,” YES!! I like that statement very much. What did Jesus tell the Rich Young Ruler? He said, “Go, sell all you have, give to the poor, and you will have treasure in heaven.” But how many Christians actually BELIEVE it, and live it? We are so very EARTH bound in our thinking. I don’t have much of anything of this earth. Not by choice, it’s just worked out that way, but as a result I look forward to heaven far more than most because earth has none of my treasures, not even a family of my own. Sometimes I resent it, but other times I realize I’m very privileged to understand more about heaven than most people do. I’ve made a concerted EFFORT to store up treasure in heaven, because there’s very little else that I can do anyway. And I’m convinced that Christians don’t think about heaven ENOUGH. If we did we’d live differently. We’d change our way of living. We’d become far more compassionate and extremely LESS materialistic. Heaven is not LESS than earth. Heaven is not EQUAL to earth. Heaven is FAR more in every way. Heaven is where Jesus came from, and He could do miracles and miracles and miracles. There was nobody, EVER, like Jesus Christ. Jesus said that He would raise HIMSELF from the dead. Jesus was not a victim, He voluntarily went through the awful ordeal on Good Friday. And I think his agony in Gethsemane was NOT because he was about to be subjected to it… No, his agony was because he didn’t know if he could control himself against such blasphemy or the onslaught of demons that he would be given over to. Apparently this ordeal he faced was worse than the temptations that satan put him through, 3 years earlier. James Tissot had something interesting to reveal in his art books “The Life of our Lord and Savior Jesus Christ.” (published 1899.) When Judas brought the Roman Soldiers to the Garden and betrayed the Christ, we know that Jesus stepped forward and knocked all the soldiers down with his power. That’s in the scriptures. BUT, Tissot said that the soldiers had intended to arrest Christ AND all his disciples: that’s why there were so many of them! However, Jesus did not allow it. Jesus only allowed the soldiers to arrest Himself. And when the disciples started to fight back, Jesus healed the man that Peter wounded and put a stop to what Peter was doing. So then the disciples scattered in confusion and the soldiers returned to Jerusalem with only Jesus, because that is all that Jesus allowed them to do. I realized Tissot was absolutely right. What power, what CONTROL Jesus had over that situation! He was not a victim. He was LORD! Even as they arrested Him, Christ easily sorted things out and took control. So, if we have FAILED to see even that much in the scriptures, how much else have we failed to see about the entire Passion? There was POWER at work here which we simply can’t wrap our heads around. Whatever happened to that Shroud is not likely to EVER be explained in natural terms. That’s my opinion anyway..","date":"2012-02-08","mins":"9:02 am","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","title":"Why do we think the Resurrection was a process? What if it was not?"}],"misc":[{"id":"comment-4005","author":"anniecee","post":"Or possibly switch to a CMS system such as Joomla. Or even Word Press but I’m a Joomla fan myself. The site is all HTML. In some ways that’s good but it’s really old fashioned now..","date":"2011-09-22","mins":"9:05 pm","url":"https://shroudstory.com/2011/09/20/a-call-to-freshen-up-shroud-com/","cat":"news_&_views","title":"A Call to Freshen Up shroud.com"},{"id":"comment-9773","author":"anniecee","post":"Yeah, that was my conclusion too. I spent some time in an Atheist forum, several months. I got something out of it but I don’t think they got a blame thing. I do think the Lord gave me wisdom because there were times I really did have control of the conversation – not that my goal was “control”, that’s not it at all. But I tried to stop their circular way of discussing things and sometimes I could do that but ONLY if I didn’t play the game THEIR WAY. They like to force their “victims” to run in circles. They don’t EVER like to come to conclusions, they just like to throw questions at you rapid fire to keep you spinning in circles. I learned that they tend to get crazy if you talk about Noah’s Ark. I wondered why that set them off because it really did. I figure it’s because Noah’s Ark is a story of God’s judgment on mankind, and the devil doesn’t like to be reminded of what’s in store for him. Judgment is inevitable. There’s plenty of evidence of the Flood, lots and lots of it. The flood is probably what throws off Carbon dating because they don’t factor that in. That’s my opinion on it anyway because I think their dates are screwy. It jumps from 10,000 years to millions and billions – with hardly anything in between. In other words, carbon dating gets really weird if they try to go back before the flood happened and so I think they left the flood out of their algorithms. They refuse to talk about angels. Even though there’s an endless supply of stories from people who have met and talked with angels or had angels save their life. They won’t go there. An angel saved MY life one time, maybe more than that. I’ve seen a few genuine for real documented miracles. But of course they mock all of it. Even the PROOF is not good enough for them, the idiots. Jesus told the story of the Rich Man and Lazarus the beggar. They both died. The rich man in hell begged Abraham to send Lazarus to warn his brothers. Abraham said it was not possible, and besides, they already had the prophets to warn them and if that wasn’t enough then nothing else would work either. WHAT THIS STORY IS SAYING IS THIS: The TESTIMONY of the Saints is all the PROOF that the Living are going to get! That, and creation itself are enough to convince anybody and if it isn’t, then that person is a lost cause. SO the lesson to be learned is this: YOUR TESTIMONY is a priceless gift and should be respected when sharing it with others. Most of the time with these loud mouth atheists it’s like throwing pearls before swine, but that doesn’t mean the pearls (your testimony) are worthless. It just says something about the swine who are supposedly intelligent but they actually know nothing. And like Ron says, they fart a lot. I’m very amused that the Shroud of Turin provokes them. Makes me happy to know they can’t find any peace as long as the Shroud exists. They don’t deserve peace, with all the blasphemies that come of them. I don’t wish damnation for them: I believe the best “revenge” is repentance. There is very little that gives me true joy, but watching someone get serious about God is one thing that really makes me happy and glad for them. This is what I wish for everyone..","date":"2012-03-29","mins":"6:48 pm","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","title":"A Guest Posting by “Jabba” (Rich Savage)"},{"id":"comment-9799","author":"anniecee","post":"Hi Rich, well you are willing to go where no man dares to go. God will bless you for your missionary heart, that’s for sure. May God give you all the wisdom you need! O’Reilly had a report on the recent Atheist convention last night – wow, that was hilarious. I don’t watch much tv, just happened to get that bit. I want to see it again, I wonder if that segment is available by itself. Not that it would be useful for your debates, I just enjoyed it. :).","date":"2012-03-30","mins":"3:32 pm","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","title":"A Guest Posting by “Jabba” (Rich Savage)"},{"id":"comment-9668","author":"anniecee","post":"Yes, I agree. They change topics constantly. They aren’t willing to actually DISCUSS anything. This shows their blatant dishonesty, in my opinion. You may learn some things by debating them, but it would be a miracle if they learned anything from you – because most of them aren’t interested in knowing the truth. Still, if this is what God wants you to do for now it may be worthwhile. It will certainly sharpen your own debate skills and increase your own understanding of the points involved. One thing they can’t handle is anything supernatural. And yet the evidence collected so far about the Shroud indicates that something supernatural most likely DID happen in order to imprint the image on the cloth. Maybe you can’t exactly prove it, but they can’t disprove it either. However, they are not content to leave that alone, which is why the Shroud nags at them. And explains why people are able to sell ridiculous books that (attempt) to discredit the Shroud. The Shroud is about Jesus Christ, first of all. If it is really the Shroud of Christ, then the real power in the Shroud is the story of Christ’s Passion. The whole story is THERE, a flannelgraph lesson of what Christ did for us..","date":"2012-03-26","mins":"4:29 pm","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","title":"A Guest Posting by “Jabba” (Rich Savage)"},{"id":"comment-9655","author":"anniecee","post":"They don’t know how blessed they are to HAVE you, it’s a very tough mission field and you’re brave to try it. Bless you. May some good come of it….","date":"2012-03-26","mins":"7:39 am","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","title":"A Guest Posting by “Jabba” (Rich Savage)"},{"id":"comment-5251","author":"anniecee","post":"That’s certainly refreshing to read about! Someone who came to their senses and realized, “Oh my goodness, what if God is REAL?” We were listening to the “Touching Point” program yesterday (Dr. David Jeremiah’s church program.) The music in that church is so fabulous. I don’t understand how anyone can resist the music of Christianity, or why they would choose any other religion if they knew what a great time Christians have with their celebrations. Christmas music is so awesome. And Easter music is just as good. Perhaps Peace did not come to earth (yet) when Christ was born in Bethlehem, but I do think there is a peace that settles over any person or group or crowd when “Silent Night” is played. That song has even been known to bring peace on the battlefield. So I don’t understand how people can be so resistant about turning to God. Seems as if God has left bread crumb trails all over the place to show people that He is worth knowing. I think they’re kinda dense when they can’t figure out any of it..","date":"2011-12-05","mins":"7:16 am","url":"https://shroudstory.com/2011/12/05/a-guy-who-claimed-to-be-god/","cat":"off_topic","title":"A guy who claimed to be God"},{"id":"comment-4511","author":"anniecee","post":"Oh wow, and THIS man is a PASTOR?? He is definitely hanging out with the wrong crowd! Sounds as if his associates aren’t any better than the Atheists. “And without faith it is impossible to please God, because anyone who comes to him must believe that he exists and that he rewards those who earnestly seek him.” Hebrews 11:6 If you believe in God, you must also believe in the Afterlife and the Rewards that come with it. If we believe in a SPIRITUAL EXISTANCE, which is where God lives, then we also believe that we ARE and WILL BE there with God some day. We’re much more a part of that existance even now than we fully realize. We’re right in the middle of it. It surrounds us. The problem with the Math brain types is they can only see the what their eyeballs see. But there are plenty, PLENTY of other personality types who are not so concrete and are able to perceive more without even trying. I feel really sorry for the Math brains. And I do think they could do a MUCH better job of being intuitive if they wanted to. I really wonder why this guy went into the ministry. This is appalling. Absolutely appalling. I’ve heard that the seminaries are full of people who don’t believe in God, and I think that’s true but why in the world are they teaching in SEMINARIES then?? Seems as if they are the very tool of the devil himself. And if you look at it THAT way: there is more “proof” for you. Of course the devil wants to put evil seed in the very seat of theological education: what a brilliant move on the part of the vile serpent who is the Enemy of God. COURAGE?? It takes COURAGE to believe in the afterlife??? This Reverend really needs to apologize to God, IMO. And he should start looking for men of Faith to be his friends. There are plenty of them: good, solid men of God really do exist. Dr David Jeremiah of In Touch Ministries is one of the best teacher/scholars of this generation. He is on tv every week and his website has daily audio broadcasts. Dr. Jeremiah is as solid as they come..","date":"2011-11-02","mins":"3:43 am","url":"https://shroudstory.com/2011/11/01/a-meditation-for-all-saints-day/","cat":"news_&_views","title":"A Meditation for All Saints Day"},{"id":"comment-6598","author":"anniecee","post":"Revelation chapter 3 describes the Church of Laodicea as being materialistic and self absorbed. Jesus is frustrated because he can’t MOVE them to care about anything. Their prosperity has made them deaf and dumb, unable to have compassion for others and unable to care about their own spiritual development. Jesus begs them to pray for spiritual help for themselves! Laodicea is the final church in the list of churches. It seems to describe the current condition of not only the Church but also of society itself. I have become aware of this because I’m trying to help a small orphanage in Haiti, with which I have direct connections. I can’t find anybody to give a darn about these kids. It wasn’t like this when I was growing up; society was much more caring back in the 1960’s in my opinion. I think the changes are very distressing. I’m especially disappointed in my own family who completely ignore my reports of progress on the kids. My experience with trying to help this orphanage makes me more aware of how absolutely COLD people have become. This attitude can be analyzed in many different ways and there are some valid reasons for some of the cynicism, but it doesn’t excuse us in God’s eyes for catering to our own pleasures constantly rather than show a little compassion when the opportunity presents itself. Christians will be judge for their compassion, so if we want to lay up treasures for ourselves in heaven this is what we need to be doing. The “So What” attitude is prevalent in secular AND Christian society and it’s very alarming, in my opinion..","date":"2012-01-06","mins":"12:01 pm","url":"https://shroudstory.com/2012/01/06/and-so-is-the-shroud-of-turin-another-so-what/","cat":"news_&_views","title":"And so, is the Shroud of Turin another “So What?”"},{"id":"comment-6600","author":"anniecee","post":"And I disagree with the Right Rev. Mariann Edgar Budde who says these people are honest. I would say they’re selfish..","date":"2012-01-06","mins":"12:05 pm","url":"https://shroudstory.com/2012/01/06/and-so-is-the-shroud-of-turin-another-so-what/","cat":"news_&_views","title":"And so, is the Shroud of Turin another “So What?”"},{"id":"comment-7202","author":"anniecee","post":"LOL. :).","date":"2012-01-19","mins":"8:54 pm","url":"https://shroudstory.com/2012/01/19/comment-promoted-unicorns/","cat":"off_topic","title":"Comment Promoted: Unicorns"},{"id":"comment-4418","author":"anniecee","post":"LOL, I love your comment at the end. Isn’t that the truth!!!.","date":"2011-10-27","mins":"8:19 pm","url":"https://shroudstory.com/2011/10/27/copy-of-the-shroud-of-turin-in-georgia-no-russ-not-the-peach-state/","cat":"news_&_views","title":"Copy of the Shroud of Turin in Georgia. No, Russ, Not the Peach State"},{"id":"comment-4867","author":"anniecee","post":"I never paid any attention to that movie, and I was disappointed that Tom Hanks was in it. Soo ridiculous. I figure Da Vinci must be rolling over in his grave..","date":"2011-11-18","mins":"11:48 am","url":"https://shroudstory.com/2011/11/18/from-the-i-didnt-know-that-dept-lynn-picknett-and-clive-prince-appeared-in-the-da-vinci-code/","cat":"news_&_views","title":"From the I Didn’t Know That Dept: Lynn Picknett and Clive Prince Appeared in The Da Vinci Code"},{"id":"comment-7433","author":"anniecee","post":"Great comments here, I love what people are saying!! There’s no way a “lens” would stand up in the hand like that: the hand is cupped to hold a ball, not a flat disk. The way the hand is cupped helps to give “dimension” to the ball or globe. If he was holding a lens it would be necessary to grip it with finger and thumb. I guess people see what they want to see…..","date":"2012-01-23","mins":"4:08 pm","url":"https://shroudstory.com/2012/01/23/has-playful-leonardo-left-us-a-clue-in-the-salvator-mundi/","cat":"news_&_views","title":"Has Playful Leonardo Left Us a Clue in the Salvator Mundi?"},{"id":"comment-9562","author":"anniecee","post":"Hi Antonella, These men know so much about the research surrounding the Shroud that sometimes I think they lose perspective. If Yannick is completely right, then what he’s saying is that he is not willing to take a leap of faith but is waiting for more proof. Which is not what he means at all, because he IS a man of faith as well. It always comes down to a leap of Faith, and you “leaped” a lot sooner than he would. But I think even if we traveled down his road of research we would eventually come to another “leap” anyway. In other words, sometimes these manly scientists really lose the poetry of the Shroud. I think this is one of those times. I thought your comments were lovely. Cyndy.","date":"2012-03-23","mins":"10:21 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","title":"Is it Reasonable to Believe in the Resurrection?"},{"id":"comment-3477","author":"anniecee","post":"“… only assertion acceptable to science.” ???? If “science” has already DETERMINED the outcome or results of the research … then that is some really bad science. These skeptics say the word “science” as if it actually means something. They indicate that “Science” has the only true answers. “Science” is the only objective source of knowledge. Well, if “Science” is deliberately BIASED in its perspective, then I would say that such “Science” is completely worthless. And yet, this guy is willing to place the worth of his eternal soul on such wobbly foundations as Science with an Agenda? Science is bad enough even when it DOESN’T have an agenda!! Fifty years ago “Science” told us all to eat oleomargarine because butter was bad for us. Recently they determined that oleo might be worse than butter because it has “bad” cholesterols and butter has “good” cholesterols. Thank goodness I never gave up butter, it would have been 50 years wasted. They also told us that chocolate and coffee were bad for us but have recently decided otherwise. Thank goodness I’m committed to my evil vices… which it turns out were not so evil after all. In fact, it might even be healthy to eat chocolate, drink coffee and smear real butter on my bread… in moderation. Obviously Science does not know everything, and to depend entirely on the wisdom of Science is, well, it’s a little astonishing. The skeptics hold up Science as if it’s the ultimate virtue, but it doesn’t even take close inspection or analysis to know that the wisdom such Skeptics rely on is all an enormous crutch or diversion. They use it to skitter away from facing the real Truth. The poor, sorry Skeptics have no idea how foolish they sound to people who know their God and walk with Him every day. I am alarmed for their future, I can actually see them cowering before God’s wrath someday and I wish I could turn them from it — but there seems to be very little we can say or do that will make a difference. For one thing, they lack honesty. I’ve heard of a few who HONESTLY dug into research and learned some things. One guy was intent on discrediting the Resurrection of Christ and set out to prove it never happened. Instead, he became impressed by the fact that every one of the 11 disciples who knew Christ during His ministry suffered hideous tortures: and all but one died as martyrs. He concluded that the original Disciples really DID believe the things they were saying, to the point that they were willing to die for the Truth they preached. So he ended up turning to Christ as his Savior, too. And recently I read about a guy (here on this blog somewhere) who was convinced of the reality of Christ because of his study of the Shroud, which he initially believed was a fake. This is good news, it is very encouraging. I wish more of the pseudo Skeptics would stop their mocking and get serious about doing some research of their own..","date":"2011-07-29","mins":"3:10 pm","url":"https://shroudstory.com/2011/07/29/is-my-mind-closed-or-is-it-the-other-guy/","cat":"news_&_views","title":"Is my mind closed? Or is it the other guy?"},{"id":"comment-3466","author":"anniecee","post":"Have you noticed recently how some people are determined to make a case that there are “Christian” terrorists and “Christian” terrorist cells? Which is completely absurd of course and I’m sure the people who are pushing the idea KNOW it’s absurd, but I think they like to provoke response. And I think they like to plant slanderous ideas and hope they stick. This relentless badgering also seems to be a form of brainwashing, hoping to train the minds of the public to eventually embrace stupid ideas as truth. The relentless attacks against the Shroud seem to be very similar. Doesn’t matter if it makes sense. Doesn’t matter if the facts have been verified. They’re not looking for truth or else they would be willing to engage in intelligent, honest conversation. IMO they just want to discredit the Shroud for the sake of discrediting the Shroud — and it has nothing to do with a Quest for Truth..","date":"2011-07-29","mins":"6:17 am","url":"https://shroudstory.com/2011/07/29/leonardo-da-vinci-forged-the-shroud-of-turin/","cat":"news_&_views","title":"Leonardo da Vinci Forged the Shroud of Turin?"},{"id":"comment-3493","author":"anniecee","post":"What I think is hilarious is: it’s Leonardo da Vinci. AGAIN. And AGAIN. And again…. I wonder if that old artist is laughing in his grave. How many conspiracies and weird things has he been associated with anyway? Historically I don’t think there’s any real evidence he ever did anything other than paint pictures and yet he’s typecast as some kind of magic man. Reminds me of the Isuzu commercial guy who had a hard time getting work as a serious artist because all anybody could see, after that, was the crazy Isuzu guy. If Da Vinci was here today, I think he’d be sick of all the silly rumors because I doubt all the theories have anything to do with the real Da Vinci. They lost credibility with ME as soon as they used his name. What a joke..","date":"2011-07-30","mins":"6:44 pm","url":"https://shroudstory.com/2011/07/29/leonardo-da-vinci-forged-the-shroud-of-turin/","cat":"news_&_views","title":"Leonardo da Vinci Forged the Shroud of Turin?"},{"id":"comment-8085","author":"anniecee","post":"“reverse sun bleaching of the cloth under a painted piece of glass” At least that one is really creative. :).","date":"2012-02-09","mins":"6:29 am","url":"https://shroudstory.com/2012/02/09/more-on-dont-confuse-him-with-facts-his-mind-is-made-up/","cat":"news_&_views","title":"More on don’t confuse him with facts, his mind is made up"},{"id":"comment-5673","author":"anniecee","post":"Has this retired bishop explained why he did this? And why does he think he can wear bishops robes if he’s retired? That photo is rather bizarre. I was sympathetic with the “Occupy” movement at first because I have plenty of reason to complain about the financial situation in this country, myself. But I don’t think Occupy is accomplishing anything or heading in any direction except Complaining. And being obnoxious. Any fool can complain: it takes a real man to build..","date":"2011-12-18","mins":"7:32 am","url":"https://shroudstory.com/2011/12/18/occupy-my-local-parish-church/","cat":"news_&_views","title":"Occupy my local parish church"},{"id":"comment-3632","author":"anniecee","post":"I’ve been thinking about Jesus’ story of the Rich Man and the beggar Lazarus. When the Rich Man found himself in a place of suffering, he begged Abraham to send Lazarus back and warn his brothers. Abraham told him that, for one thing, it wasn’t even possible to do send Lazarus back. But even if it was possible to send Lazarus back, it wouldn’t make a difference. Abraham told the Rich Man that his brothers had plenty of evidence already and if they wouldn’t believe the witness of the prophets, then they wouldn’t be convinced by anybody even if they saw Lazarus raised from the dead. So that’s the story Jesus told, and it directly addresses issues of faith, from the point of view of the afterlife. Apparently the witness of those who DO believe is considered very valuable in the eyes of Heaven. If people on earth insist on rejecting the witness of believers, they will have no excuse when they stand before God. So this should encourage Christian believers, at any rate. Your testimony is a powerful thing: what God has done for you is important. Don’t feel hurt when people belittle it. That Rich Man in hell certainly regretted his callousness, but there was nothing he could do about it by then. One thing I have always enjoyed is listening to others tell the story of how they got saved: the steps that lead them there to that point. I am always touched by the sincerity, the tenderness, the love of God that comes through. I think Atheists and Agnostics should spend less time scoffing and mocking, and more time listening. Blind faith is a very inaccurate term. Perhaps it appears to be “blind” for those who haven’t tried it but it’s anything but “blind” for true Christian believers. And if people think it’s cop out to be a Christian, then I dare them to try it. Armchair Quarterbacks don’t actually know anything about the strain and pain of the game, and that’s the truth..","date":"2011-08-19","mins":"7:20 pm","url":"https://shroudstory.com/2011/08/19/not-believing-in-the-absence-of-evidence/","cat":"news_&_views","title":"Not Believing in the absence of evidence"},{"id":"comment-6513","author":"anniecee","post":"I agree with YOU that it’s a hodge podge of good and bad information. And I don’t know what the point of the article is. In fact, I’m really puzzled. What is he trying to SAY? One point to make: the Old Testament says that the body of Jesus did not suffer decay. “Rotting corpse” is not right, according to scripture. “And after that’s gone, what’s left?” ….. The Risen Lord!! Christ risen from the dead is glory enough for anyone anytime anywhere. If he can’t see THAT, then his faith is barely blipping on the faith o meter, I’d say..","date":"2012-01-03","mins":"5:33 pm","url":"https://shroudstory.com/2012/01/03/opinion-reliability-of-shroud-of-turin-fails-on-faith-not-science/","cat":"news_&_views","title":"Opinion: Reliability of Shroud of Turin fails on faith, not science"},{"id":"comment-9260","author":"anniecee","post":"I was editing a picture of the four Beasts of the book of Revelation yesterday: trying to turn a black and white image into one with some color. The lion with wings, the bear, the cat with several heads and of course the fearsome Beast with all those nasty horns, especially the large horn with the arrogant, blasphemous speech. I don’t know what these beasts mean, I think the book of Revelation is frustrating with it’s odd symbolism. But I do think that the large prominent horn with the big bold ugly haughty blasphemous speech surely seems to represent modern day Atheism..","date":"2012-03-12","mins":"2:31 pm","url":"https://shroudstory.com/2012/03/12/regrettably/","cat":"news_&_views","title":"Regrettably"},{"id":"comment-5815","author":"anniecee","post":"“but that is no reason to resort to supernatural explanations.” Ohhh… why not? Loosen up a little. “And so because those dewy eyed dopes keep building up impossible hopes, IMPOSSIBLE!! Things are happening every day!” That song quote is from Rogers & Hammerstein’s Cinderella and yes, it’s a fairytale, but I like it because it accurately describes the phenomenon of Faith. Supernatural things happened all the time around Jesus Christ. It’s more LIKELY that the Shroud has a supernatural explanation, than not. Jesus could not do many miracles in Galilee because the people had little faith. Lack of faith is disappointing to Jesus and to God the Father. The more faith, the more likely that prayers will be answered and supernatural things might happen. Supernatural or Divine assistance is far more common than people realize. So… I think the scoffers and the skeptics and the doubters can continue to drive themselves crazy looking for a “natural” explanation, but considering that the Shroud of Christ (if it’s real) was and is directly connected to the supernatural event known as the Resurrection, I highly doubt there will EVER be a natural explanation for that Shroud. Assuming it’s real, which I think it probably is because of the way the Shroud has got so many people all annoyed and irritated with it. :D.","date":"2011-12-21","mins":"5:17 am","url":"https://shroudstory.com/2011/12/21/shroud-of-turin-quote-for-today-by-sharon-hill/","cat":"news_&_views","title":"Shroud of Turin Quote for Today by Sharon Hill"},{"id":"comment-6549","author":"anniecee","post":"It’s easy enough to find these wackos. I skip out of their websites as fast as I can. Of course, they never address their videos to ME personally so I’m a little jealous that you’re Special. :D.","date":"2012-01-04","mins":"4:48 pm","url":"https://shroudstory.com/2012/01/04/shroud-of-turin-tinfoil-hat-alert/","cat":"tinfoil_hats","title":"Shroud of Turin Tinfoil hat alert"},{"id":"comment-4848","author":"anniecee","post":"Wow, that is a very startling change in wording..","date":"2011-11-16","mins":"2:15 pm","url":"https://shroudstory.com/2011/11/16/so-whats-going-on-here-indeed-crossbeam-vs-yoke/","cat":"news_&_views","title":"So, what’s going on here, indeed? Crossbeam vs Yoke"},{"id":"comment-4968","author":"anniecee","post":"It is sad that the Vatican is so unresponsive about assisting with testing. But I’ve heard this about the Vatican before, that they are difficult to deal with. I think this is regrettable because their resistance and all their long delays give a bad appearance to the Church and makes them seem even less relevant, in an age when the Church really NEEDS to be relevant..","date":"2011-11-24","mins":"10:24 am","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","title":"The Belt of Mary"},{"id":"comment-7647","author":"anniecee","post":"I don’t understand what most of you are talking about.. Or should I say: griping about. Seems to be mostly a conflict between “regulars.” I do like the post from Buck in Florida though. Seems like a nice sensible intelligent guy with solid faith and even a dose of wisdom in his perspective..","date":"2012-01-28","mins":"4:31 pm","url":"https://shroudstory.com/2012/01/28/the-most-intelligent-thing-anyone-can-say-with-regards-to-the-shroud-is-i-dont-know/","cat":"news_&_views","title":"The most intelligent thing anyone can say with regards to the shroud is, \"I don’t know.\""},{"id":"comment-4483","author":"anniecee","post":"I think the auction listing got deleted already. Ebay is real tough, I’m sure they closed it as soon as they got wind of it because it would surely be a hoax or fraud. It’s a clever idea for a Halloween auction though. But I doubt the family would see any humor in it..","date":"2011-10-31","mins":"11:46 am","url":"https://shroudstory.com/2011/10/31/the-shroud-of-michael-jackson/","cat":"other_blogs","title":"The Shroud of Michael Jackson"},{"id":"comment-4754","author":"anniecee","post":"That’s a lovely, unbiased review stating the basic Facts regarding the Shroud. Sometimes the barebones Truth is the best. And sometimes the barebones Truth is the hardest for people to accept..","date":"2011-11-12","mins":"10:07 am","url":"https://shroudstory.com/2011/11/12/the-shroud-of-turin-is-number-one-on-this-list/","cat":"news_&_views","title":"The Shroud of Turin is Number One on This List"},{"id":"comment-4758","author":"anniecee","post":"That is a very interesting article!! Fun to read. I noticed a trend: it seems that things which cannot be explained are dismissed by “experts” as being a hoax. Why is it so hard to just leave something as “unexplained.” Or “not confirmed.” I enjoy the mystery. Some of those artifacts hint at extra terrestial life. How fun is that?? I’m not someone who looks for UFO’s and I don’t collect books or belong to clubs. Not interested in getting silly about it… but I do think that if God wanted to put humanoid creatures on other planets He certainly could and can do whatever He wants to do. It might explain why the planets are so unbelievably far apart: so we don’t corrupt other inhabited planets or influence them. I don’t think the human race would be good for any other “peoples” that might be out there. But there’s no way of knowing what God might have done elsewhere. He’s not saying..","date":"2011-11-12","mins":"1:46 pm","url":"https://shroudstory.com/2011/11/12/the-shroud-of-turin-is-number-one-on-this-list/","cat":"news_&_views","title":"The Shroud of Turin is Number One on This List"},{"id":"comment-6007","author":"anniecee","post":"Maybe not trying to be sneaky… it appears to me to be an honest effort to tweak the article for accuracy. I don’t think it’s fair to assign motive to Mr. Chivers because we don’t really know WHY he did it. There may have been noble intentions in revising the article, and at least he DOES mention that he has revised it. I think it’s amusing that some news agencies have announced there is proof that the Shroud was produced by supernatural means. That oughta drive the skeptics out of their minds. And for all we know, it may be the truth. Maybe God is in this more than you know. Especially if it’s His Shroud. :D Besides, it’s very typical of UK news media to exaggerate things for sensationalism. Even worse than the USA news media, apparently. This was quite predictable. Perhaps there is Divine method behind this madness. At least people are talking about the Shroud and that’s probably a good thing..","date":"2011-12-23","mins":"4:49 am","url":"https://shroudstory.com/2011/12/23/tilt-tom-chivers-sneaks-in-a-correction/","cat":"news_&_views","title":"Tilt: Tom Chivers Sneaks in a Correction"},{"id":"comment-4852","author":"anniecee","post":"Yes, I know what you mean about how it hurts the heart. Bless you for that, it shows you have the spirit of God in you. I pray for my friends and family a lot too, I worry about them for the same reasons..","date":"2011-11-16","mins":"11:39 pm","url":"https://shroudstory.com/2011/11/16/tis-the-season-of-anti-christmas-billboards/","cat":"news_&_views","title":"Tis the Season of Anti-Christmas Billboards"},{"id":"comment-4846","author":"anniecee","post":"I have to work at not being angry with all the blasphemy. As the Bible says, “In professing to become wise they have become fools.” Anyone who has actually worked at being a Christian and KNOWING Christ in personal salvation and relationship knows how wrong these blasphemers are. But they can’t be convinced, and one of the main reasons is because they forcefully reject the testimony of believers. It was quite a revelation for me when I read the story Jesus told about a beggar and a rich man. The rich man in hell begged Abraham to send Lazarus back to warn his brothers on earth of the judgment to come: but Abraham told him that the brothers have the testimony of the prophets. And if that’s not enough for them, nothing is. There is enough evidence of God, right here. Nature itself speaks of the glory, care, compassion and glory of God. In addition, there is the testimony of those who love God and know Him. If these things are not enough, then Jesus HIMSELF said (through the parable) that nothing else will do it. For one thing, this gives confidence to those who believe in Jesus. Our testimony is not a little thing, in fact: the testimony of believers is everything. It is the testimony of believers that has caused Christianity to endure against all odds. This is amazing power, when you read the history of the church. I’ve been reading the Seventh Day Adventist histories by Ellen White: I don’t agree with their legalism, I’d be reluctant to join the SDA: but she did write some fascinating books on church history. Anyway… the blasphemers will not be stopped even though they walk on very dangerous ground. They heat up their own punishment with their relentless mockery, I am truly concerned for them and I wish I could put some sense in their heads. But I also figure this is another symptom of the end times, and so I am learning to look up when all these distressing things happen around the world. The rise of atheism is just another symptom, and if this is the way it has to be until the Lord Returns, then let it heat up. The sooner Jesus returns, the better. The Bible does say that God will speed things up toward the end (shorten the days or hasten the days), so I think we’re on a roller coaster ride now. Sure feels like it..","date":"2011-11-16","mins":"12:58 pm","url":"https://shroudstory.com/2011/11/16/tis-the-season-of-anti-christmas-billboards/","cat":"news_&_views","title":"Tis the Season of Anti-Christmas Billboards"},{"id":"comment-4232","author":"anniecee","post":"Oh, that would be nice. I have plans for the day but if they get interrupted by heavenly trumpets and the second coming of Jesus, I really will not complain. That would definitely make my day!! :) Actually, the people who study prophecy say that Jesus could return during the Feast of Tabernacles, which is going on now (Jewish holiday.) And there are a lot of people who think this year is a significant year. Harold Camping is not the only one who pointed to this week as a possibility for the return of Christ, or the Rapture, or both. But Camping is the only one who keeps setting dates and announcing them as if he knows something. We’re not supposed to do that, the Bible is clear about it..","date":"2011-10-21","mins":"9:28 am","url":"https://shroudstory.com/2011/10/21/today-is-the-end-of-the-world-watch-the-today-show-tomorrow-for-details/","cat":"off_topic","title":"Today is the End of the World: Watch the Today Show Tomorrow for Details"},{"id":"comment-3891","author":"anniecee","post":"So the Debate itself will be limited to a few knowledgeable participants: with outsiders being able to read the “conversation”… is that the idea? I think it’s unique and interesting. I’m glad the participants will be limited, otherwise it’s bound to degrade into emotional outbursts from all sides. Controlled participation is more likely to end up with a very intelligent and indepth discussion, with a Full Presentation of ideas from both sides. I don’t care to participate but I’d like to Lurk and see how the discussion plays out. It’s a noble effort, in my opinion. :).","date":"2011-09-16","mins":"2:58 am","url":"https://shroudstory.com/2011/09/15/update-on-the-debate-blog-proposal/","cat":"news_&_views","title":"Update on the Debate Blog Proposal"},{"id":"comment-6146","author":"anniecee","post":"Yes, that is excellent. I love the “faith” viewpoint, how refreshing! Faith is what the skeptics despise and ridicule, but it is the cornerstone of those who are spiritual. How tragic that skeptics ONLY have THIS, the damaged, defective world that they can see with their own eyes. Whereas those of faith have hope of so much more: Skeptics see an ancient Shroud: we see a risen Lord. Skeptics see a painful death: we see a miraculous resurrection. Skeptics see an unsolved mystery: we see confirmation of all we believe and hope for..","date":"2011-12-26","mins":"1:36 pm","url":"https://shroudstory.com/2011/12/26/whether-it-is-genuine-or-not-its-miraculous/","cat":"news_&_views","title":"Whether it is genuine or not, it’s miraculous"},{"id":"comment-4710","author":"anniecee","post":"It would be interesting to see a complete list of relics, wouldn’t it? I think the Scots have St. Andrews’ fingers somewhere. And, there’s the “Stone of Destiny”, believed to be the stone that Jacob slept on when he had the vision of a ladder to heaven. The Stone is or was in Westminster Abbey, but I believe it was returned to the Scots and will be borrowed for future coronations. There’s a lot of doubts about the Stone but it’s still an important part of English culture. All these relics have a fascinating history, some of it entirely fabricated – but others might be based on truth. And people don’t really care anymore if the relic is real or not, the legend itself has become part of their culture and identity, so why mess with it. The Seventh Day Adventists have a story that one of their own found the Ark of the Covenant. The stories and legends surrounding the Ark are incredible: I think every continent claims to have it hidden somewhere. I’ve come across some legends that are quite extensive and elaborate, and yet they turn out to be fake. British Israel had a very elaborate (fake) story about Tea Tephi, and some people are still completely convinced the Ark is in Ireland. But the most amazing story of all is by a Seventh Day Adventist explorer, a very devout man, who claims to have found it and brought back a fuzzy picture of it. The story is compelling, I haven’t decided yet what to make of it, but I’ve corresponded some with the guy who ran the Explorer’s museum and Pinkowski is so convinced of what his friend found, that I’ve bounced it around my head quite a bit lately. The Explorer, Ron Wyatt, is not without credibility: he did find the authentic for real Mount Sinai in Saudi Arabia and there’s a documentary or movie about it that will be out soon. Ron Wyatt, died in 1999. But he claimed to have found Sodom and Gomorroh (fascinating story) and the place where the Israelites crossed the Red Sea: a movie documentary has been made about this as well, and is supposed to be released soon. I’m not saying I believe it, about the Ark: this is the most astonishing story of all. I do find it to be very interesting, especially since people who knew Mr. Wyatt are staunch defenders of his character. There are a number of websites that mention Ron Wyatt: http://www.wyattarchaeology.com/ http://pinkoski.com/ http://www.wyattmuseum.com/ http://jonah135588.wordpress.com/2008/10/22/deathbed confession of ron wyatt discoverer of the ark of the covenant/ BTW, I think that toy from Raiders of the Lost Ark is disgusting. It shows they know nothing of the enormous significance of the Ark of the Covenant..","date":"2011-11-11","mins":"9:24 am","url":"https://shroudstory.com/2011/11/11/while-contemplating-the-ridiculous/","cat":"news_&_views","title":"While Contemplating the Ridiculous"},{"id":"comment-4711","author":"anniecee","post":"I want to add… Ron Wyatt said he found the Ark of the Covenant INSIDE Golgotha Hill, directly underneath the crucfixion site (they also found archaeological evidence of the site for the three crosses, and the earthquake) AND, in the same vicinity as a tomb with a groove for the enormous rock. Ron Wyatt found the huge rock nearby, too. So all of this is directly connected with the Shroud of Turin, and equally as mysterious. If Ron Wyatt’s discoveries are authentic, the Shroud is part of the story..","date":"2011-11-11","mins":"9:44 am","url":"https://shroudstory.com/2011/11/11/while-contemplating-the-ridiculous/","cat":"news_&_views","title":"While Contemplating the Ridiculous"}],"opinion":[{"id":"comment-5614","author":"anniecee","post":"An avowed atheist… that hurts, doesn’t it. Unbelievers don’t know the frustration that Christians feel, knowing how different it could have been. The Bible says, “Precious in the sight of the Lord is the death of His saints.” This verse makes me think that God Himself is on the other side of the chasm, waiting and anticipating each precious soul when it’s their time to die. He wants to see this transition for Himself, and be the first to welcome His spiritual children. People who have had near death experiences often say that Jesus is there to meet them. What a relief to know this! But… what if God wasn’t waiting for me? In fact, what if nobody was there. They say that hell is the absence of God. What if I died and I found myself unbelievably ALONE. And none of the comforts that God has so lavishly provided on this earth to provide for every need? I don’t know if the typical description of hell is accurate. Some people say that the demons will torment us. How can that be right, when the demons will share in the same punishment that we do? I wonder if each will suffer in torment alone, and without comfort, until the spiritual light goes out. Jesus said, “Do not be afraid of those who kill the body but cannot kill the soul. Rather, be afraid of the One who can destroy both soul and body in hell.” Spiritual death must be a far worse process than the kind of death we experience in our own flesh. Atheists want to believe that death is merely sleep and annihilation, but the Bible makes it clear that it’s not that easy. Not by any means. I do hope and pray that Mr. Hitchens made his peace with God in the past year..","date":"2011-12-16","mins":"9:34 am","url":"https://shroudstory.com/2011/12/16/rip-christopher-hitchens/","cat":"news_&_views","title":"RIP Christopher Hitchens"},{"id":"comment-5617","author":"anniecee","post":"Wikipedia already has his date of death and past tense phrasing. Amazing. Wikipedia has this to say about Christopher Hitchens: Identified as a champion of the “New Atheism” movement, Hitchens described himself as an antitheist and a believer in the philosophical values of the Enlightenment. Hitchens said that a person “could be an atheist and wish that belief in god were correct,” but that “an antitheist, a term I’m trying to get into circulation, is someone who is relieved that there’s no evidence for such an assertion.”[17] He argued that the concept of god or a supreme being is a totalitarian belief that destroys individual freedom, and that free expression and scientific discovery should replace religion as a means of teaching ethics and defining human civilization. He wrote at length on atheism and the nature of religion in his 2007 book God Is Not Great. — I can’t help but wonder if Mr. Hitchens would like to add another chapter to his book, now..","date":"2011-12-16","mins":"10:02 am","url":"https://shroudstory.com/2011/12/16/rip-christopher-hitchens/","cat":"news_&_views","title":"RIP Christopher Hitchens"},{"id":"comment-3712","author":"anniecee","post":"Jesus said, “I would that you were hot or cold, but because you’re lukewarm I will spit you out of my mouth.” At least we completely know where the “New Atheists” stand. I don’t think the Atheists are much different from the New Atheists in their basic beliefs: it’s just that the New Atheists are more confrontational or Evangelical. Possibly the “regular” Atheists were fooling themselves. Their views ARE extreme, it’s just that they didn’t want to create waves so they stayed low key in promoting their philosophies. The New Atheists are not shy, they’re out and about, loud and clear. They’re obnoxious, they know it and they love it. So are the satanists, they’re coming out of the closet now as well. Lots of fringe groups are showing up, showing off and PROUD of their anti Christian behaviors and beliefs. According to Jesus’ own words, He would rather have it this way. The gray areas of morality are disappearing. People are polarized in their beliefs. This is GOOD because it leaves far less room for hypocrites who want to play it both ways. Atheists: you wanted an anti God society and you’re getting it. Just see what good it’s going to do this world, without the moral constraints of Jesus’ teachings (AND the influence of the Holy Spirit) to keep mankind’s impulses in check. Things are already getting very interesting, and it’s because the self sacrificing nature of a Christian culture is disappearing quickly. It all began with the rebellions of the 1960’s. The hippies raised their kids with the new moralities, and those kids are raising their children with even newer moralities. Each generation grows up to be totally selfish and self centered, in addition to being increasingly more violent. The Atheists don’t have alternative moralities to offer these kids. The only suggestion they have is to continue to reject whatever God might have to say about anything. So far it’s not working out very well at all..","date":"2011-08-28","mins":"3:45 pm","url":"https://shroudstory.com/2011/08/28/aggressive-and-unapologetic-new-atheists-or-righteous-sinners/","cat":"news_&_views","title":"Aggressive and Unapologetic New Atheists or Righteous Sinners"},{"id":"comment-4860","author":"anniecee","post":"That’s almost as difficult as reading C.S. Lewis’s “Mere Christianity” or that book by M. Scott Peck about “The Road Less Traveled” which was a bestseller in the late 70’s, 80’s. In fact, this Andrew Sullivan seems to have similar views as Peck. Overall, how would you summarize Andrew Sullivan? I’m not familiar with him. That’s rather deep theology that he’s wading around in. And, I think he has complicated it by mixing the Catholicism in with it. OF COURSE the Catholics do not understand salvation by pure Grace, Mercy and Love: they have made a lot of money on all their requirements for Works. The Catholics are not alone in that, I think every church organization imposes a system of requirements that help to bind their followers in commitment to the church. And in some ways that is good, but the understanding of God’s love becomes all the more difficult to grasp. I think, due to our own innate selfishness, it’s almost impossible for us to grasp God’s kind of love anyway. One thing that I believe is MISSING from Andrew Sullivan’s summary: all our efforts to explain God are like trying to explain the tip of the iceberg. Whatever little bit we understand about Jesus Christ: he is much MUCH more in His own realm. Whatever little bit we understand about heaven and eternity: it is all soooo much more glorious than we can imagine. The teensy bit that we understand about real LOVE is only a tiny drop in an enormous bucket. And ALL of it is much nearer, closer than we think. In the next five minutes we could all drop dead for some reason or other, and there we’d be with God (for better or worse)!! Just like that it could happen, so I don’t think God is as distant as we think He is. I’m afraid that all our fine, complicated theological arguments tend to lose the “magic”, although that’s definitely the wrong word for it but what other word can we use that people would understand easily? I think the appropriate word is most likely: GLORY. The glory of God. Which is something else we don’t understand very well..","date":"2011-11-17","mins":"2:38 pm","url":"https://shroudstory.com/2011/11/17/andrew-sullivan-on-what-is-god/","cat":"news_&_views","title":"Andrew Sullivan on What Is God?"},{"id":"comment-4868","author":"anniecee","post":"Twice yesterday I came across religious theories about the Love of God. And so the question I have about Andrew Sullivan is this: does he believe in judgment & punishment or doesn’t he? Does he think that God’s love covers everybody? That the love of Christ covers all peoples and all religions? This is where he seems to be vague, at least in this article. If it were true that Jesus love covers all, then the New Testament would not mention judgment or punishment – after the death of Christ. But the NT most certainly does speak of God’s judgment, and the coming wrath in many places all the way to the end of the Bible. The book of Revelation written by the Apostle John himself, is all about coming doom. If God’s love means that everyone gets to heaven, then Jesus didn’t need to die on the cross for our salvation. And if the only thing the Cross meant was a symbol of how much God loves us, then I think God could have chosen a symbol that was not so horrific. The Shroud, if it means anything, is about the terrible death Jesus died. It is a symbol that tells us: Sin is real and so are judgment and punishment. It is also about resurrection Life: the Life that we can have when we accept Jesus in our hearts. I honestly don’t know how God is going to work things out on Judgment Day but I know that He does all things well, and it will be fair. It is our task to respond to the gospel, not to worry about how judgment will pan out. If we have heard the gospel of Jesus Christ, then we need to embrace it with repentance and commitment..","date":"2011-11-18","mins":"12:04 pm","url":"https://shroudstory.com/2011/11/17/andrew-sullivan-on-what-is-god/","cat":"news_&_views","title":"Andrew Sullivan on What Is God?"},{"id":"comment-4862","author":"anniecee","post":"I’ve been reading it again… yes, I like it very much. I can see that he comes from a Catholic background, and therefore he has struggled with some perspectives that people from a non orthodox or non Catholic background don’t have a problem with. Martin Luther threw off a lot of that, a long time ago. But this guy came to these conclusions on HIS OWN, which is really great. It shows that God is leading him into “all truth” as the New Testament says. I especially like this statement: “But if you believe, as I do, that the human mind is inherently incapable of grasping the reality of the highest consciousness except through acceptance of mystery, then it is not a dodge.”.","date":"2011-11-17","mins":"3:27 pm","url":"https://shroudstory.com/2011/11/17/andrew-sullivan-on-what-is-god/","cat":"news_&_views","title":"Andrew Sullivan on What Is God?"},{"id":"comment-4275","author":"anniecee","post":"That’s a totally WIMPY effort, isn’t it: Maybe kinda sorta. I really think he could have TRIED a little HARDER than THAT. But I’ve noticed that rich people aren’t very motivated to do it. In the book of Revelation, Jesus complains about the Church of Laodicea where the Christians were prosperous. And they were so selfish and self centered that He couldn’t get them interested in the things they SHOULD be interested in. They could not be MOVED to make the effort. The Lord Jesus didn’t know what to do with them. It’s interesting that God expresses real frustration in those verses. Seems as if Steve Jobs could hardly be bothered, even when faced with the reality of his own imminent Death. I wonder what Steve Jobs would say to us NOW, today, if he could??? I betcha it would be a real earful. Jesus said at one time that poor people should glory in their low position. I really thought Jesus was being ironic when He said that, but maybe He wasn’t. Because poor people are more likely to learn to pray and to lean on God. When we get to the afterlife, we might see how truly lucky we were, that we had to rely on God and were thus forced to develop our spiritual side..","date":"2011-10-24","mins":"7:14 am","url":"https://shroudstory.com/2011/10/24/steve-jobs-belief-in-god-maybe/","cat":"news_&_views","title":"Steve Jobs’ Belief in God. Maybe."},{"id":"comment-4311","author":"anniecee","post":"Yes, I hope so too. I think it’s “cheating” to make a deathbed decision for the Lord but it’s better than nothing. I hope something real and genuine did happen before he died..","date":"2011-10-25","mins":"12:48 am","url":"https://shroudstory.com/2011/10/24/steve-jobs-belief-in-god-maybe/","cat":"news_&_views","title":"Steve Jobs’ Belief in God. Maybe."},{"id":"comment-3541","author":"anniecee","post":"I’ve run into a whole slew of pseudo athiests who are most likely young men in their teens. I’ve noticed they have no real desire for learning anything and it’s obvious their presence on chat threads is not about learning Truth. It appears to me that they really like to swagger and bully others. I’ve also had some conversations with possibly “real” athiests who are more mature and more educated but after a number of indepth conversations I don’t think their philosophies and questions are a genuine, honest search for truth either. They want to skitter around some topics, there are some things you cannot force them to address. Such as whether there are real, supernatural phenomena (such as sightings of angels.) And if the supernatural exists then WHY do athiests demand proof of what is supernatural on their own terms? Maybe, if they’re really interested in knowing what’s behind the countless stories of supernatural experiences, they need to create a different set of criteria than what they use for exploring the Natural world. I think of it as aliens studying aliens. If we went to Mars and actually found little humanoid beings on that planet, would we insist that they learn things OUR way?? Or would we make an effort to learn about them in THEIR terms, in THEIR environment? If the supernatural is somewhere on a different plane than our own human experience, then we need to learn about THAT plane in order to learn what’s there and how it works. And it’s not unreasonable to suggest that there are other planes of experience: science already suspects it. Another thing athiests go berserk over is the topic of Noah’s flood. To me this is almost humorous, if you want to set off a roomful of athiests then just casually mention the Flood and it pretty much doesn’t matter what you say about it, the place will be hoppin’ with athiests having temper tantrums. Why does this matter SOOOO much, I wonder?? It’s my own theory that they hate the story because it’s a story of God’s judgment. And if there truly is a God, those who celebrate the “International Day of Blasphemy” have really set themselves up for a truckload of Trouble with the God they have blasphemed..","date":"2011-08-08","mins":"10:23 pm","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","title":"The Evangelical New Atheist Movement"},{"id":"comment-3542","author":"anniecee","post":"I appreciate what this guy Reza Aslan has to say. (His name is Aslan, really? How cool.) He is obviously very intelligent, a true philosopher and his analysis is very refreshing. Thank you for posting it..","date":"2011-08-08","mins":"10:29 pm","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","title":"The Evangelical New Atheist Movement"},{"id":"comment-3570","author":"anniecee","post":"I can’t see that Athiests have any kind of plan. They mostly love dialogue. Love it. Our politicians get paid a lot to do the same thing, and they don’t get much done either. My arguments are not so empty as you seem to think. It’s just that you don’t want to go down the road I am pointing out to you. I am showing you the path to God, the very gate where you may begin the journey. Consider a debate between Pro Life and Pro Choice… The Pro choicers insist the debate is about Choice. The Pro Lifers insist the debate is about Life. The debate goes nowhere because the two sides cannot agree on what the 1 core issue is so it’s a stalemate every time. Both sides are equally convinced of their position, both sides have their compelling arguments which they continue to refine, so the issue is very polarized. And it will never be resolved, it cannot be resolved under these circumstances. That’s what the conversation between Christians and Athiests is like. We’re on two different platforms, two different starting points entirely. I’m asking you to jump platforms, essentially. It’s the only way to learn what I’m saying. You’ll never learn it if you stay over there on your platform. Saying my responses are “vacuous” and I’m only reciting what I’ve learned from childhood… those are false insults and aren’t productive to the discussion. This is where your youth is showing. You’re frustrated because you can’t engage in the format that you enjoy. I know what you wanted to do, you wanted to engage discussion on YOUR platform, not mine. So this was possibly a new experience. I have prayed for you today, I do hope you’ll think about these things..","date":"2011-08-11","mins":"3:49 am","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","title":"The Evangelical New Atheist Movement"},{"id":"comment-3604","author":"anniecee","post":"Atheist… as in anti theist. Ordinarily I’m a good speller so thanks. Jesus told a story about a rich man, I’m sure Kyle knows the story. How the rich man ignored the poor beggar at his door, but when they both died, the rich man went to a place of suffering and Lazarus was comforted in the bosom of Abraham. The rich man begged Abraham to send someone back to warn his brothers. Abraham said it wouldn’t do any good. Abraham said there was plenty back there to warn anybody who was willing to listen, and the rich man’s brothers wouldn’t have any excuse when they died. There’s quite a bit in this thread for anybody who is truly searching, so I think Kyle is skipping right over the good stuff. And I’m a little worried about that actually. It didn’t turn out so well for the rich man and his brothers, when they did that. Kyle says there’s No proof of the supernatural. Well, I’ll address that one. Here are some documented miracles that I have personally seen: A cafeteria full of people were fed 100 hot dogs and there were 97 left over. The packages were hauled out of the garbage and counted and recounted, there were multiple witnesses and it was very thoroughly observed by many people who were there. This was a classic “Loaves & Fishes” miracle at a church camp. The three cooks in the kitchen were afraid there wasn’t enough food to go around, especially when even more people showed up than expected. So the three cooks prayed. There were more than three people who knew about it after lunch was over, and helped do all the counting. I was there, too, watching them doublecheck everything. My mother was one of the cooks. There were 75 people at lunch, they all had hot dogs and three people had two hot dogs. We figured that was why there were 97 leftover… Free gas. We were driving to visit my grandparents and it was the middle of the night and we were in the middle of nowhere with a station wagon, five kids and two adults (my parents.) The gas tank had been on E for a very long long time. My folks prayed of course. Finally they saw a gas station that was open. They pulled in. The owner was there, filling up his boat so he could go fishing – but he let my folks buy gas. That in itself could be considered a miraculous coincidence, but my folks put two or three gallons more in the gas tank than it could hold. If it was a 15 gallon tank, then they put in more than 17 gallons. My Dad knew how much that tank could hold. My folks figured God had given them some gas on loan, God’s sense of humor. You can dismiss these things easily just by saying “Where’s the Proof?” But they happened and there was no doubt about it. In fact, my folks got in trouble with their church for sharing about the gas tank episode and had to go to another church after that because people didn’t think God still did miracles. My folks were such new Christians they actually believed you could pray and God would answer… which He did..","date":"2011-08-14","mins":"4:20 am","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","title":"The Evangelical New Atheist Movement"},{"id":"comment-3550","author":"anniecee","post":"As I said, it may be necessary to learn about other planes in order to find out what’s there. As long as athiests refuse to keep an open mind about the existance of the supernatural, they will know absolutely nothing. God left us a trail of clues. In the Bible God says, “Those who come to God must believe that He is, and that He rewards those who diligently seek Him.” So God is giving an invitation here, but He makes it clear that in order to learn what He’s got to offer, you must do it on H Is terms and in His “space” so to speak. The leap of faith is actually a very simple matter, therefore: it’s a willingness to go to God on H Is terms. If God is truly God, He is not being unreasonable in requiring this. But why does He do it this way, instead of coming into the Natural World and giving off displays of all his amazing powers? Why doesn’t He provide proof on demand? I think it’s because He’s looking for something among mankind. For one thing, God doesn’t want a lot of rebels, which I think is what athiests basically are because of their blasphemies. If there is no God, then what’s the purpose of deliberately insulting Him? To me, a true athiest would be above that. A true athiest would not be concerned about God at all, ever. But nobody talks about God more than the athiests, I think. So this guy is right that athiests have become very evangelical. It’s an anti God campaign, and it’s very ugly. They say a lot of very negative things against God and anyone who believes. They love doing it, apparently it FEELS GOOD doing it, so they do more of it. And they’ve attracted a whole lot of young men who don’t have a clue what they’re talking about but these kids love, absolutely love, the negativity of it all. What a breed the athiests have spawned. I am not impressed..","date":"2011-08-09","mins":"4:17 pm","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","title":"The Evangelical New Atheist Movement"},{"id":"comment-3565","author":"anniecee","post":"I deal with doubts. For me, working through doubts has led to greater understanding of God and His ways. Athiests want to bog down the conversation with so many questions that there’s no way to finish a discussion. Mass confusion is a favorite tactic: throw in a whole pile of questions for every 1 statement that the “opponent” makes. Changing the subject is a favorite tactic: switch to something else and something else and something else with each comeback. This is why I totally question the honesty of any athiest I’ve talked to. How honest do you think YOU are? I’m very busy this week and I truly don’t have time to play such games, which I think would not get us anywhere anyway. Like Jesus said, it was all about knowing His Father. He said this over and over: it was the core of His message. He wants us to know His Father. You think there is no God. I know you’re wrong, I’ve got way too much mileage with God to ever doubt that. If I was smart enough, maybe I could beat down all your philosophies but that would not convince you anyway so what’s the point. I have a decent IQ and I know the B Ible fairly well and I’ve studied apologetics some and I love CS Lewis’ book called “Mere Christianity” which lays out in brilliant fashion how the only truly smart thing to do is to be a Christian. So if you’re honest and you want to know what the arguments are then I think you should go to Amazon or ebay right now and get that book and read it at least twice. Lewis’s book is accepted by most Christian churches as being very good for basic apologetics. It’s not an easy read, there’s a lot to chew on. But that is only for starters… I wonder if you’re willing to do what it takes to know Truth: which is to kneel before God, all by yourself, and tell Him you’re sorry. And the Bible says that we totally have to mean business when we do it. And we might have to come back a few times until all the attitudes are really straightened out before God will be willing to get down to business. If I want to know the truth about God, it can’t be done how I want it. We do have to come to God on His terms, always. This isn’t a bad thing..","date":"2011-08-10","mins":"11:57 pm","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","title":"The Evangelical New Atheist Movement"},{"id":"comment-3567","author":"anniecee","post":"You have been Catholic… and you have apparently applied yourself to extensive study of Christianity. And yet, you have not met with God? I can see how that would happen. You have known religion. Jesus Himself was up against Religion, in fact it was Religion that killed Him. I have plenty of complaints against Religion myself. I’m not trying to frustrate you. I’m trying to cut through everything to help you find your way to God. As Jesus said, the Kingdom of God belongs to those who approach Him as a little child would. I’m very sorry you’ve tangled yourself in such a mental cage, it’s as if you’ve become trapped in your brain somehow and can’t find the way out. I’m not mocking you. If you spent that much time learning about Christianity, you must have been searching for something. You didn’t start out with the idea that you would end up where you are now. My Father has a good friend who eventually did become a Christian but it was a struggle for him to take the leap of faith because it just didn’t make any sense to him, and he tried to process that for a long time. He finally did become a Christian. He was an extremely intelligent guy who found it really, really hard to understand why Salvation works the way it does. He doesn’t have any problems with it now though. He’s convinced, he got his proof. Seems as if you need to get your proof, yet. That’s what I’ve been trying to explain. Trying to point you down the right path. Maybe I, myself, am the proof you’ve asked for. I’m telling you, God is for Real. I know it. You can know it, too..","date":"2011-08-11","mins":"12:57 am","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","title":"The Evangelical New Atheist Movement"},{"id":"comment-3563","author":"anniecee","post":"Athiests have more questions than answers. More complaints than solutions. Look at all your question marks up there… ???? And if somebody attempts to respond to all those question marks, they come up with a zillion more. Talk about circular reasoning! Athiests are really good at running people around in circles without EVER breaking the cycle and actually coming to some CONCLUSIONS. I will not enter into that endless game again, I’ve done it and it’s a huge waste of time. Athiests can waste of ton of time getting absolutely nowhere. I call athiesm a religion of DOUBT. The professional doubters. They love their doubts, they invent new ones constantly. The compare their doubts among each other and admire them and improve upon them. They build enormous libraries of all these illustrious doubts. Obviously you have a good library of them, too. Do I know what God wants?? Of course, it’s all in the Bible. It’s not a huge leap, it’s right there for any mere mortal to read. Thanks to Martin Luther and others who sacrificed to get the Word of God into the hands of common folk. I can’t prove God exists but you can’t prove He doesn’t exist, either. I have my own proof, you have to get your own. That’s how it has always worked. Until a person is willing to settle down before God and be willing to do things God’s way, they’ll never have any proof of their own. I can’t give you my proof. I would if I could, really… and I wish it was that easy – but it doesn’t work that way. The first requirement is to be willing to get down on our knees and show respect. I have a friend who is an athiest, raised by Christian parents who were prominent and very well respected. It was not an abusive home, it was a loving home that she came from. If anything she was too spoiled. Now this woman is in her 50’s and she’s gone down this long long path of rebellion for so long, I don’t know if it’s possible to eat that much crow and find her way back. I’m rather appalled at the corner she’s painted herself into. And she’s struggling with health issues too, so she may need to meet her Maker sooner than expected. I mention her only because I know the pride that’s in her life and I can see how difficult it would be to “repent”, to change, to return to her roots. To make things right. I truly hope she can find the courage to do it. You say that I am arguing from a very privileged position; I’m not quite sure what you mean by that but I kind of like it. I’ve been a Christian since I was a child. I was saved before my parents were, so it wasn’t due to influence in the home. I can’t relate to you all my “proof” but a lifetime of walking with God is so precious to me, and His Bible is so living to me, that I do feel very privileged, yes. I know how easy it would have been to make other choices, other decisions. It’s all in the little stuff, I believe that. Our lives turn on a tiny choice, sometimes. I marvel that I made the choice I did when I was 8, and I beg God even yet to forgive me for almost making the mistake that I did. I could have been selfish, I could have lied… I could have walked away and nobody would have known. Would it have been so awful, I was only 8 and it was only a small thing. But I did the right thing, and I think my whole life turned in that moment. I am very grateful to God that I have known Him all my life. It is in the small things, I believe that. Which is why I am grieved for all the small words of blasphemy that harden the heart only a little bit more and a little bit more… until there is possibly no way back..","date":"2011-08-10","mins":"9:36 pm","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","title":"The Evangelical New Atheist Movement"},{"id":"comment-4379","author":"anniecee","post":"With the discovery of nutrinos I think science has proved to the world that they basically don’t know much of anything yet. Barely scratched the surface. And they don’t know the essence of LIFE itself, they haven’t come close. I believe that the essence of Life comes from the mysterious breath of God (Biblical language study reveals this hint) and if that’s so, it also tells us that LIFE itself is not of this earth. LIFE is not natural, it is supernatural. So it’s amusing or ironic or something, that Atheists who scoff at the existance of God actually have a mysterious bit of God’s supernatural LIFE within them. Somehow. I don’t have any worries that the Shroud will lose it’s mystery. I think that the image was probably made through means that are not possible for us to analyze or duplicate. It’s not a natural process, anymore than the Resurrection of Christ was a “natural” event. Mankind cannot raise themselves from death. But Jesus was not an ordinary man. Obviously I am inclined to believe that the Shroud is real. :).","date":"2011-10-26","mins":"8:24 pm","url":"https://shroudstory.com/2011/10/26/destroying-the-magic-of-the-shroud-of-turin/","cat":"other_blogs","title":"Destroying the Magic of the Shroud of Turin"},{"id":"comment-3342","author":"anniecee","post":"“Age of Enlightenment.” Barf. Has anyone bothered to analyze how we became so “enlightened”? As far as I can tell, it started with pure rebellion. The rebellion of the 60’s flared into a rejection of everything traditional, whether cultural or religious or even political. And now, for those of us whose lives span the 1950’s to the year 2011, we honestly don’t see any improvements in our world: cultural, religious and political affairs are much worse off since this experimental age of Enlightenment began. If they had actually accomplished something I might be impressed but I’m afraid that along with so called enlightenment came greed and corruption which has nearly brought our country to ruin in the past 60 years. We were affluent due to the labors of that stuffy and traditional culture that the hippies despised. Now, analysts tell us we are facing a time of great austerity. We have ruined ourselves through the folly of our enlightenment. Yes, I agree that it’s time for mankind to get off the high horse of their own wisdom and ask God for some of His. In James chapter 1, God says He will give wisdom liberally to those who ask for it. We really need to start asking, IMO..","date":"2011-07-14","mins":"2:20 pm","url":"https://shroudstory.com/2011/07/14/faith-and-challenge-in-our-age-of-enlightenment/","cat":"other_blogs","title":"Faith (and Challenge) in Our Age of Enlightenment"},{"id":"comment-3343","author":"anniecee","post":"By the way, I do think that the human rights advances are worth noting as tremendous improvements. But I don’t think of the hippies as having done that. Human rights victories were won earlier by other soldiers and martyrs; and although there have been many victories since, the foundations were already laid for the most part..","date":"2011-07-14","mins":"2:26 pm","url":"https://shroudstory.com/2011/07/14/faith-and-challenge-in-our-age-of-enlightenment/","cat":"other_blogs","title":"Faith (and Challenge) in Our Age of Enlightenment"},{"id":"comment-6499","author":"anniecee","post":"These Shroud theories continue to circulate don’t they? It’s like hoaxes that go around on email: nobody checks it out, they just forward the hoax to everyone they know and as a result, everybody believes the Lie rather than digging to find out the truth for themselves. (Basically: you should NEVER believe ONE WORD you get on Email.) I always check things out on Snopes.com or… there’s another site like that but I can never remember it’s name. I wonder what Snopes has to say about the Shroud..","date":"2012-01-03","mins":"10:59 am","url":"https://shroudstory.com/2012/01/03/is-it-leonardo-or-jesus/","cat":"other_blogs","title":"Is it Leonardo or Jesus?"},{"id":"comment-6500","author":"anniecee","post":"The other site is URBAN LEGENDS at about.com, or: http://urbanlegends.about.com/ Neither one of those sites had anything about the Shroud of Turin. But they’re a good reference if you care to check out the crazy emails you get..","date":"2012-01-03","mins":"11:02 am","url":"https://shroudstory.com/2012/01/03/is-it-leonardo-or-jesus/","cat":"other_blogs","title":"Is it Leonardo or Jesus?"},{"id":"comment-3708","author":"anniecee","post":"Pew shaped hineys. I think it was all the “pew shaped hineys” that got America through two world wars and THEN laid foundations for their children that ultimately brought about the unprecedented prosperity the USA has enjoyed since the 1970’s. The pew shaped hineys have mostly retired or died off now — and the Baby Boomers rule the world. You can see how well we are doing without all those devout hineys….","date":"2011-08-28","mins":"5:27 am","url":"https://shroudstory.com/2011/08/28/pew-shaped-hineys-and-feigned-enlightenment-about-the-shroud-of-turin/","cat":"other_blogs","title":"Pew-Shaped Hineys and Feigned Enlightenment About the Shroud of Turin"},{"id":"comment-7657","author":"anniecee","post":"Oh yeah, that’s the internet culture all right. It happens every day on email. I ran a forum for a few years, and people were always posting stuff they got on email. I tried and tried and tried to get them to CHECK IT OUT on Snopes or Urban Legends FIRST, but there’s no way they would do it. It would come in on email, so they’d post it on our forum as a fact. And 100% of those crazy stories were hoaxes. But would they learn? NEVER. I’m surprised that the mis information only got copied 2800 times..","date":"2012-01-29","mins":"7:58 am","url":"https://shroudstory.com/2012/01/29/ridiculous-claim-x-2820-fact/","cat":"other_blogs","title":"Ridiculous Claim x 2820 = Fact"},{"id":"comment-3407","author":"anniecee","post":"Yes, I follow it. The AB negative type is so extremely rare that there’s a high probability Michelle’s family is related to Mary’s family somehow. Especially since they are also Jewish, and narrowing it down even further: Michelle’s family are Levites as Mary was. And, because Michelle donated bone marrow for her brother, he now has female chromosomes because bone marrow is what MAKES our blood cells. So it’s Michelle’s bone marrow that is now making her brother’s blood for him. That’s why he has female AB blood instead of male AB blood. She’s right, this is a good joke on him..","date":"2011-07-25","mins":"11:54 am","url":"https://shroudstory.com/2011/07/25/tales-of-blood-type-ab-negative/","cat":"other_blogs","title":"Tales of Blood Type AB Negative"},{"id":"comment-3644","author":"anniecee","post":"I’ve been doing a lot of thinking about the “End of the World”, because when we read the passages about end times, it’s very clear that Jesus, especially, indicated that His return was imminent. And the prophets of the Bible also indicated that it was better to believe Jesus was coming anytime soon, than it was to deny it. The angel told the prophet Daniel that people would deny it all the way up to the end and THEN they would get caught short because of their denials. Apparently Jesus wanted us to live BELIEVING it. Yeah, it’s more Faith stuff again, whatta drag. But the thing is, that’s what Abraham was given credit for: Abraham BELIEVED and it was credited to him for righteousness. (Hebrews 11.) Abraham believed the promise, even though it didn’t happen in this lifetime. The only thing that happened was Isaac born of Sarah. Otherwise the rest of God’s covenant with Abraham was not fulfilled. And yet, Abraham believed it. His son Isaac was so convinced of the power of this blessing that Isaac’s fervor was relayed to his twin sons Esau and Jacob. The blessing and the promise belonged to Esau by birthright, but Jacob really wanted it for himself and he wanted it bad. Isaac BELIEVED it, and he taught his sons to BELIEVE it. I think we have the same obligation about the Lord’s return: we are obligated as good Christians to believe it and LIVE as if we believed it, because we do behave differently if we think Jesus is going to show up at any minute. If we choose to live this way, there is a blessing in it for us: the blessing for those who live by Faith. Besides… there are a few things that we can’t deny. Israel is in their land, and this is the MAIN thing that cannot be swept under the rug. It’s a miracle beyond any other miracle, that a race of people returns to their homeland 2000 years later. It’s impossible. And Jesus said that, when you see these things begin to happen then he will return within the span of a man’s lifetime. So…. Israel is the thing we dare not ignore. There have always been trials, disasters, wars and other traumas and tragedies, but Israel is what makes everything different in our time. Therefore, it’s necessary to sit up and take notice. Here’s a list of 101 End Times prophecies. It’s a terrific list. I don’t agree with all his interpretations, but the list is great. Http://www.understandthetimes.org/101prophecy.shtml Yes, Harold Camping was a flake for setting a date for Christ’s return, back in May. No doubt about it. But maybe God used Camping for a “trial run” so to speak. Camping’s prediction got everybody’s attention. And therefore, the reaction to it also revealed what’s in people’s hearts. Some people tried to prepare themselves for the Lord’s return (just in case), whereas others thought the whole thing was just an opportunity for mockery. So Camping’s “trial run” did some sorting and sifting. I’m sure God must have noticed what kind of response there was. Maybe God even USED Camping’s prediction as a way to warn us: not yet, but Soon. It’s time to be serious about the return of Jesus Christ, I think. Israel is the reason why..","date":"2011-08-21","mins":"7:06 am","url":"https://shroudstory.com/2011/08/21/the-shroud-of-turin-and-the-end-of-the-world/","cat":"other_blogs","title":"The Shroud of Turin and The End Of The World"},{"id":"comment-4004","author":"anniecee","post":"I agree. Very well put. I think the same is true of many of the Catholic saints. Some of the saints were early martyrs. I’m not Catholic but I’ve been interested in all of Church history recently and I’ve been very moved by the witness and dedication of the early martyrs. Who can say that those saints were only “Catholics”, especially if it happened before Constantine. All of Church history merges together at some point. And the death of Christ is certainly common to us all, so the Shroud (if it is Christ’s Shroud) would be something that all Christian sects and denominations would find intriguing..","date":"2011-09-22","mins":"8:31 pm","url":"https://shroudstory.com/2011/09/21/the-shroud-of-turin-real-or-fake-does-it-matter-if-you-are-catholic/","cat":"other_blogs","title":"The Shroud Of Turin: Real Or Fake? Does it matter if you are Catholic?"},{"id":"comment-7181","author":"anniecee","post":"In times past, a skeptic was a person who didn’t know if something was true, but they were willing to keep an open mind. Today’s atheists are not skeptics, they don’t even attempt to be skeptics. They are totally closed. They claim to subscribe to science, but true science does not jump to conclusions. There is such outrageous dishonesty and hypocrisy among the “new atheists” that I don’t even attempt to engage them on their terms. Most of them don’t want to know the truth, they just want to batter down believers with their endless doubts for which there are no answers. They are like the Pharisees who tried to trick Jesus with complicated questions. His response was to point out their error rather than to engage in their ridiculous debate. Jesus said that His sheep hear His voice. And the Bible says that we will hear a voice behind us saying, “This is the way, walk ye in it.” And, without faith it is impossible to please God. And, those who come to God must believe that HE IS, and that He rewards those who diligently seek Him. (Those of you who know your Bible are familiar with all those verses.) According to the Bible we can’t even get started with God unless we drop the blasphemy and approach Him with a willingness to do this on His terms. I’m very glad this blog is here to hold down the Fort, defending the integrity of the Shroud: because obviously it is being used to reach some of these hardheads. And that’s a great thing, it is amazing and astounding that God shows mercy even to those who blaspheme Him, by perserving the Shroud as a sign for a faithless generation..","date":"2012-01-19","mins":"1:52 pm","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","title":"The State of Skepticism: Ridicule works. Right?"},{"id":"comment-7187","author":"anniecee","post":"Stephen E. Jones, I suppose you’re right about the unicorns but a wild bull is not nearly as romantic. Women LOVE the dainty, sensitive creature known as the unicorn… And I think you are right about the Troll..","date":"2012-01-19","mins":"3:03 pm","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","title":"The State of Skepticism: Ridicule works. Right?"},{"id":"comment-4639","author":"anniecee","post":"Recently Pastor David Jeremiah gave a message on how Christ is being increasingly diminished and denied in our society AND even among Christian religious people. The more we conform to the demands (and doubts) of secular viewpoints, the more diminished Christ is: and not only in society, but in our own personal lives as well. Recently you posted a bit by a Reverend who stated that it took courage to believe in the afterlife. My goodness, has Christ been so diminished in this man’s life that he has a hard time believing even THAT? This is a classic example of the erosion I’m concerned about. We watched a new TV show last night. They had blatant swearing: taking God’s name in vain. Characters used the name of Jesus as an angry expletive, and more than once. It was many times throughout the movie. The Muslims do not allow their religion to be mocked or diminished. In some ways I can appreciate and even admire this. At the same time, I’m glad that Christians are not so violent about defending their faith. (Most of the time anyway, I know there are exceptions which are not flattering.) Jesus allowed himself to be mocked and diminished, tortured, slandered, humiliated. He let them do it. I’ve been collecting Jesus pictures: old illustrations. The pictures of Christ’s passion have really affected me, but not in the same way as Mel Gibson’s violent, brutal movie. Through the pictures I’ve seen how Christ was humiliated, and endured it. How he dreaded what was coming, so that in Gethsemane an angel had to come strengthen him. I’ve seen more of the Lord’s inner struggle. It was excruciatingly difficult for the Lord Jesus to endure what he did. I wish Mel’s movie had been more subtle and showed us more of the Lord’s inner struggle, because that’s where the biggest battle (and the greatest triumph) took place. Jesus was not a victim: he endured it all and he did it deliberately so he could finish what the Father wanted for mankind. As I’ve seen a small measure of this inner struggle, I realize with renewed clarity what an awful thing it is to diminish what Christ did for us. Considering what it cost Him, we as believers must not deny or downplay any part of what Christ accomplished. Rather, we need to speak it more clearly, more fervently and with more determination. The real TRUTH behind the Shroud is NOT whether it is real or not: but that Christ really did die an awful death and was then miraculously raised to life again. It is an empty Shroud. There is suffering in what happened to Jesus Christ, but there is also certain Victory. Whether or not the Shroud is confirmed is not nearly as important as whether Jesus Christ is affirmed and confirmed within us. John the Baptist was a great prophet whose life and ministry had been long predicted. But, when Jesus appeared on the scene, John the Baptist said, “He must increase and I must decrease.” So it is with the Shroud: if it points the way to a greater Truth than itself, then the Shroud has been affirmed and confirmed by it’s fruit — and it doesn’t really matter if it’s real or not. The greater Truth is the one that must not be diminished..","date":"2011-11-07","mins":"10:26 am","url":"https://shroudstory.com/2011/11/07/when-it-comes-to-the-shroud-i-am-right-and-you-are-wrong/","cat":"other_blogs","title":"When it comes to the Shroud I am right and you are wrong"}],"researchers":[{"id":"comment-5954","author":"anniecee","post":"Sounds as if the professor was misquoted or only partially quoted by Michael Day. It may not be Luigi Garlaschelli’s fault..","date":"2011-12-22","mins":"3:07 pm","url":"https://shroudstory.com/2011/12/22/quote-for-today-luigi-garlaschelli-on-the-enea-report/","cat":"news_&_views","title":"Quote for Today: Luigi Garlaschelli on the ENEA Report"},{"id":"comment-9656","author":"anniecee","post":"I do understand his “Eureka Moment” … it doesn’t really matter what a person says about the Shroud: if you write it, it will sell. So, his take is that the Shroud is real but the Resurrection isn’t? Yes, that will go over very well with the anti Shroudies. The Shroud becomes the mechanism that confused all those poor dumb disciples into thinking they saw a ghost. There’s definitely something laughable about that. Yes, the Eureka Moment could very well become a Bestseller, most likely. After all, it’s written by a Cambridge professor who did his “research.” Research… The Gnostics? They were discredited long ago. In fact, the mainstream Christian church had to clarify many doctrines in order to combat the heresy. Obviously the Eureka Moment is not aimed at mainstream Christians. Acts of Thomas? I can see why he likes Thomas, the doubting apostle. But I read an article recently on the National Geographic website (of all places) that explained Thomas’ ministry. Thomas was a very diligent and powerful Evangelist after the Ascension of Christ. Thomas did not suffer from any more doubts, in fact he is known for miraculous signs and wonders. They believe Thomas traveled more and farther than Paul did. Thomas likely had nothing to do with the Book of Thomas, he traveled way way off to India and died there as a martyr..","date":"2012-03-26","mins":"8:00 am","url":"https://shroudstory.com/2012/03/26/get-thee-upset-or-not-thomas-de-wesselows-new-book-on-the-shroud/","cat":"art","title":"Get Thee Upset! Or Not: Thomas de Wesselow’s New Book on the Shroud"},{"id":"comment-9627","author":"anniecee","post":"The subject of the Shroud is seen as “toxic” ?? And these are the people who TEACH the next Generation? Toxic. TOXIC! Why can’t the Shroud simply be, as de Wesselow says: an intellectual puzzle? Which it certainly is! The Shroud has people around the globe baffled and puzzled and even bent out of shape. I think somebody could write a book on the psychological impact of the Shroud, because it is obvious there is something about the Shroud that gets people’s nerves all twangled. And why should that BE, I wonder?? Unless…. There really IS a God and He is deliberately trying to goad people into spiritual awareness? If people could set aside their resistance to God and religion, they would see how stupid they are. I’m glad de Wesselow was able to wise up. That’s very encouraging, I have considerable respect for his honesty..","date":"2012-03-25","mins":"11:54 am","url":"https://shroudstory.com/2012/03/25/telegraph-article-on-cambridge-shroudie-thomas-de-wesselow/","cat":"books","title":"Telegraph article on Cambridge Shroudie Thomas de Wesselow"},{"id":"comment-9651","author":"anniecee","post":"Angry that the Shroud is HERE? I suppose that is a very strong indication that it truly IS the Sign of Jonah for this generation. I’ve forgotten now who said that… Oh yes, Dr. Peppler. I was so impressed with his statement, I actually wrote it in notes. Dr. Peppler quotes this verse, which is a perfect description of society now, “A wicked and adulterous generation asks for a miraculous sign! But none will be given it except the sign of the prophet Jonah.” Mat 16:4 Jesus himself said it. And it’s scary to read it, especially in connection with the Shroud. I think Dr. Peppler was incredibly on target with that observation..","date":"2012-03-26","mins":"3:01 am","url":"https://shroudstory.com/2012/03/25/telegraph-article-on-cambridge-shroudie-thomas-de-wesselow/","cat":"books","title":"Telegraph article on Cambridge Shroudie Thomas de Wesselow"}],"resources":[{"id":"comment-7738","author":"anniecee","post":"Recently they discovered a new Da Vinci. Nobody knew it existed. So that makes it a fake, BECAUSE it wasn’t documented somewhere? The Shroud is an ancient artifact, same as any other artifact. Why does he demand a paper trail? I don’t see why he’s got a beef with the discovery of the Shroud. It was lost, now it’s found. What’s the big deal. This happens a lot, and people are usually very happy to find amazing ancient things rather than GRIPING about it. I still kinda suspect that God was saving the Shroud just for us. Obviously it causes the atheists a great deal of stress, since they bring it up so often. Noah’s flood stresses them out a whole lot, too. The resurrection makes them go bonkers as well. I think we should make a list of things that ESPECIALLY drive the atheists crazy. I like to know the things that punch their buttons. :D.","date":"2012-01-31","mins":"6:21 am","url":"https://shroudstory.com/2012/01/31/bent-spoon-article-on-the-shroud-of-turin/","cat":"news_&_views","title":"Bent Spoon Article on the Shroud of Turin"},{"id":"comment-7849","author":"anniecee","post":"“I fully realize that the Bible is not a very good history book, just as it is not a good science book.” That’s an interesting statement. I like it. What kind of book do you think the Bible is? It’s not a really good handbook for religion either because it swaps focus in midstream which is kinda bizarre when you think about it. First God teaches to observe religion one way, then God changes his mind and teaches how to do it another, better way. Pretty funny when you think about it. I think of the Bible as a biography, the story of Jesus Christ as told by Himself to others. But that’s not entirely it either. Maybe it’s the Story of Faith… the thread of Faith, the heroes of Faith… starting with Faithful Noah, then Abraham and ending with the Faithful Apostles, especially John who encouraged the Believers in the 7 Churches to be more Faithful than they already were. The Bible skips around so much, from one topic to another, that’s it’s very hard to classify. Mainly, the Bible is what it is. This is what God gave us to work with and He expects us to use it. That’s the main thing: ARE WE USING IT? READING IT? MEMORIZING IT? Jump in and make it PART of our lives, that’s what we’re supposed to do with it. Well, I’m just thinking out loud. Your statement got me to thinking…. :).","date":"2012-02-01","mins":"8:11 pm","url":"https://shroudstory.com/2012/02/01/burden-of-proof-on-the-shroud-of-turin/","cat":"books","title":"Burden of Proof on the Shroud of Turin"},{"id":"comment-9693","author":"anniecee","post":"Unbelievable. And they want to get it out before EASTER? Why, because it’s so SPECIAL or because three idiots at Penguin want to SHOVE this trash in the FACES of all Christian Believers and make them CHOKE on it? Right in the midst of the most Holy of all Christian holidays? This whole thing, every bit of it, could be labeled Blasphemy..","date":"2012-03-27","mins":"10:15 am","url":"https://shroudstory.com/2012/03/27/penguin-we-wanted-to-get-it-out-before-easter/","cat":"books","title":"Penguin: We wanted to get it out before Easter"},{"id":"comment-6259","author":"anniecee","post":"I like his introduction to Thomas, which is appropriate. I want to point out that it is BECAUSE Thomas doubted that all the rest of us who believe in Jesus Christ have received a blessing, “Blessed are those who have not seen and yet have believed.” (This could be added to the list of Beatitudes actually.) I also want to point out that those who dare to BELIEVE are more blessed than those who doubt. There are many who are very proud of their Doubts and work at inventing new ones, thinking that there is wisdom in this. But the Bible says that the “Fear of the Lord is beginning of wisdom.” And, “The Fool has said in his heart; there is not God.” Thomas corrected his mistakes and died for the Lord Jesus, holding fast to faith until his death as a martyr. We need to follow THIS example in Thomas, not the other one. Personally, I am challenged by the verse in Revelation 3 that says, “I know you have little faith and yet you have kept my Word and have not denied my Name.” It horrifies me to think that I might deny the Lord Jesus and disappoint Him in such a way. I need to read the entire PDF carefully but I did skip to the end, about the Quantum Christ. I don’t know where he’s headed with that, but I’ve encountered many false doctrines which attempt to strip away the physical humanity of Christ. One theory is that the entire Bible is only an allegory: a philosophy to learn from. Another theory is that it’s all about LOVE and we don’t need to fear judgment (or hell.) All these theories (also known as false doctrines) attempt to get rid of the Crucifixion. To get rid of a God of judgment. To get rid of the ugly images of Christ on the cross. To get rid of a God who requires sacrifice from us personally. The Shroud sends us hurtling back to reality! Christ was PHYSICAL. Christ died a horrible death. Christ did not keep that Shroud but for a very short time, after that He didn’t need it. The Shroud tells us that all those THEORIES are LIES. And the Shroud reminds us once again that it is better to BELIEVE than to doubt. I collect thousands of digital images of Jesus art, ancient and recent. One day I was thinking, “I wonder which images are the ones that Jesus likes?” Immediately I knew that the baby pictures are of no interest to Him. The story that Christ passionately wants to tell is the one of His death, burial and resurrection. That was why He came, that was His huge accomplishment: and we fail Jesus if we try to belittle that in any way..","date":"2011-12-29","mins":"11:19 am","url":"https://shroudstory.com/2011/12/29/the-coming-of-the-quantum-christ/","cat":"books","title":"The Coming of the Quantum Christ"},{"id":"comment-6271","author":"anniecee","post":"Ok, I did read the whole chapter carefully and I liked the whole thing UNTIL I got to the part about the Quantum Christ. He’s looking for Universal Love apparently? By blending all these philosophies together into a magic cocktail? The Bible actually predicts what Mr. Klotz is hinting at, and the quantum christ is known as: the Antichrist, the one who is a fake and a fraud and a deceiver. The angels told the disciples at the Ascension that Jesus would return in the same way He left. This will be a physical event, not metaphysical or symbolic. When it happens there will be absolutely no doubt that this is it, the real thing..","date":"2011-12-29","mins":"8:17 pm","url":"https://shroudstory.com/2011/12/29/the-coming-of-the-quantum-christ/","cat":"books","title":"The Coming of the Quantum Christ"},{"id":"comment-3516","author":"anniecee","post":"I get daily email devotionals from Joni, another person who is a quadrapalegic and is, therefore, severely handicapped. Not that the handicaps of Joni or Hawkins qualifies them as an authority on God, but I find the contrast between these two personalities to be stark and opposite to the extreme. Joni is just as convinced of God’s existance as Hawkins is convinced of the opposite. Her daily messages not only encourage faith in God but they also strongly encourage Discipleship, which is the discipline of making your actions line up with the example of Christ. Joni is a hard core Believer, just as Hawkins is a hard core Unbeliever. Both people are famous. Both are respected. So, which one is right? IMO, I think it’s very sad that Hawkins has had to endure all these years of suffering without God’s help and comfort. I wonder if there is some bitterness that feeds his denial of God? Is there some resentment, is this how he lashes out at a God who so confined him to such an awful disease? I can’t help but wonder, because why does Hawkins need to bring it into the discussion at all? What does it MATTER, if God does not exist? Keep God out of it, if THAT is what you believe. It’s interesting, to me, that athiests seem to enjoy talking about God and the Bible even more than Christians do. I really doubt Hawkins is as dedicated to athiesm as he thinks, or he would not feel compelled to convince himself so often and so vehemently..","date":"2011-08-04","mins":"6:29 pm","url":"https://shroudstory.com/2011/08/04/hawking-to-appear-on-the-discovery-channel/","cat":"science","title":"Hawking to Appear on the Discovery Channel"},{"id":"comment-9742","author":"anniecee","post":"Thank you for that! We will put it on our calendar..","date":"2012-03-29","mins":"6:17 am","url":"https://shroudstory.com/2012/03/29/the-real-face-of-jesus-airs-good-friday/","cat":"video","title":"The Real Face of Jesus Airs Good Friday"},{"id":"comment-3865","author":"anniecee","post":"I found this video that explains about the Video. From Good Morning America: they took the image to the streets to find out what people thought about it. Maybe you’ve seen this already, but I’ll post it anyway. It’s kinda fun to watch: http://abcnews.go.com/GMA/video/face jesus revealed 10248139.","date":"2011-09-15","mins":"12:37 am","url":"https://shroudstory.com/2011/09/14/real-face-of-jesus-dvd-on-sale-at-the-history-channel-shop/","cat":"video","title":"Real Face of Jesus DVD on Sale at the History Channel Shop"},{"id":"comment-3429","author":"anniecee","post":"What I’ve noticed is there’s a whole bunch of young men in the current generation who want to style themselves as agnostics or athiests and think of themselves as philosophers. And they are incredibly BAD at it. They don’t have their facts straight. They are not actually interested in learning anything, they mostly like to swagger. That’s the way it seems to me, anyway. They think of themselves as superior because they question everything. However, they don’t have anything to offer. What they offer is a lot of Doubts about anything they don’t like. They’re skilled in offering criticisms and blasphemous doubts and that’s about all they’re good at. They’re not builders, they are destroyers. Catherine Marshall wrote an interesting phrase in her book, Christy. “Any fool can destroy but it takes a real man to build.” I think such young men should settle down and get real. If they are TRULY interested in finding TRUTH, then join those who are digging for it instead of scoffing and mocking on the sidelines. IMO..","date":"2011-07-26","mins":"2:53 pm","url":"https://shroudstory.com/2011/07/26/%e2%80%aaan-invitation-to-discuss-the-shroud-of-turin-youve-got-to-be-kidding/","cat":"video","title":"‪An invitation to discuss the Shroud of Turin. You’ve got to be kidding."}]}
