{"dating":[{"id":"comment-50586","author":"anomymous","post":"Hugh wrote: “I shall never heat carrots again…” My reply: I think it would be better for you to start trusting the profesionnal judgment of guys like Rogers, Adler, Fazio and Mandaglio instead! ; ).","date":"2013-11-09","mins":"7:09 pm","url":"https://shroudstory.com/2013/11/06/blowing-the-antonacci-proposal-to-bits/","cat":"carbon_14_dating","title":"Blowing the Antonacci Proposal to bits"}],"history":[{"id":"comment-51960","author":"anomymous","post":"I didn’t followed the discussions on this topic but I would like to urge you to read the excellent paper presented at the Valencia conference by Ada Grossi, an Italian researcher (link: http://www.academia.edu/2427474/Jewish Shrouds and Funerary Customs a Comparison with the Shroud of Turin in 1st International Congress on the Holy Shroud in Spain   Valencia April 28 30 2012 ed. Centro Espanol de Sindonologia CES ) In this paper, the author talk specifically about the supposed 2 X 8 cubits evidence and conclude that we must be extremelly careful before taking such a supposition for granted because in ancient time, the cubit measurement unit was not standard everywhere and all the time. The author state: “The debate about ancient cubits is no easy matter: the length of common cubits varies between 44.5 and 45.7 cm and that of royal cubits between 50.3 and 52.4 cm; as for the “Syrian cubit”, more correctly called “Assyrian cubit”, its measure is uncertain as much, and it’s seem therefore UNWISE TO IDENTIFY IT AT ALL COST WITH A SUBMULTIPLE OF THE SHROUD’S DIMENSION.” Folks, I AGREE 100% with such a prudent conclusion. And I would add another important possibility to back up this conclusion: nobody can be certain if the actual dimensions of the Shroud were the same originally. On this subject, the simple presence of the side strip (which presence has never been fully explained beyond any doubts by textile experts) is enough to at the very least make us very cautious concerning the question of the Shroud’s original dimensions..","date":"2013-11-18","mins":"9:29 pm","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"},{"id":"comment-51961","author":"anomymous","post":"By the way, this author also indicates that it was NOT part of a normal Jewish burial to bind the enshrouded corpse with linen strips. The most common burial procedure was simply to make a loose stitching at the edges of the cloth to make sure the body would not fall off the cloth (note: this procedure is still in use during orthodox Jewish burial as it was described by Barrie Schwortz himself in a recent interview while talking about his father’s burial). This particular conclusion is another good clue to support the hypothesis of a loose configuration of the Shroud around the dead body of the Shroud at the time of the image. On this subject, we can say that historical evidence support the conclusions of Jackson et al. And Latendresse studies, which found out that a linen cloth drapped pretty loose over a dead body really seeem to be the most probable configuration of the Shroud in regard of the very slight distortions of the frontal image..","date":"2013-11-18","mins":"9:37 pm","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"},{"id":"comment-51962","author":"anomymous","post":"Here, some people could say: this seem to contradict the Gospel accounts that seems to talk about many cloths. Not necessarily. It is possible that other linen cloths (smaller for sure) could have been used during the burial procedure of Jesus as “bags” that could have contained the aloes and myrrh described by John (probably in powder) and such “bags” could have been placed all around the enshrouded body (outside or more probably inside the Shroud) in order, as Barbet said in his book, to retard a bit the putrefaction process and more importantly, to prevent bad smellings in the context of an incomplete burial, which needed a return to the tomb some 36 hours later. It’s also possible that the Sudarium of Oviedo could also have been part of the “other cloths” inside the tomb, along with the main Shroud….","date":"2013-11-18","mins":"9:43 pm","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"}],"image":[{"id":"comment-52460","author":"anomymous","post":"Quote: “…SOME of the blood stains are medieval touch ups made with the motivation of making the relic appear ‘more authentic’.” If that would be true, STURP would have easily found strong evidence to support this hypothesis. The truth is precisely the opposite. In the present state of our knowledge, I don’t see any good reason to agree with such a scenario. For example, the only red ochre that was found was in microscopic quantity and scattered everywhere and not particularly more in the bloodstains regions. And the most logical hypothesis to explain these minute traces of red ochre on the Shroud is the historical fact that various medieval copies of the Shroud were made and artists were then allowed to put their painting in direct contact with the Shroud to sanctify their “replica”… I think we can forget any idea of a “touch up” that could have been made during Medieval time for the body image as well as for the bloodstains..","date":"2013-11-22","mins":"9:32 pm","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"id":"comment-52459","author":"anomymous","post":"Quote : “and others have carried out observations that suggest the opposite.” Who? Where can I read what they wrote about this topic?.","date":"2013-11-22","mins":"9:25 pm","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"id":"comment-51811","author":"anomymous","post":"The fact that most bloodstains on the Shroud are made of exudates of moistened (or re moistened) blood clots instead of whole blood in liquid form explain why certain properties of it are somewhat different than what can be normally expect… Again, that’s one reason why I wrote this other comment today: https://shroudstory.com/2013/11/17/barrie schwortz on ewtn recently/#comment 51783 People very often forget this crucial aspect of the Shroud blood… but not Adler, nor Barbet!!!.","date":"2013-11-17","mins":"6:12 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51810","author":"anomymous","post":"If Dan would have done something as mean as this (blocking the account of a blogger who contributed to elevate the level of some debates related to the Shroud, that would be a total shame!!! I repeat: I’m not Yannick, I’m his phantom. I’ll let you figure out what this could mean….","date":"2013-11-17","mins":"6:09 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51809","author":"anomymous","post":"Ordinary blood mean that the blood would present all the properties of whole blood that would have stained the cloth while in liquid form. On the Shroud, the reality is very different for the vast majority of the bloodstains and that’s precisely where the most definitive piece of evidence in favor of authenticity is hidding… But when people (like you obviously) don’t want to see the evidence, they will always deny what is obvious..","date":"2013-11-17","mins":"6:07 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51796","author":"anomymous","post":"Thibault say: “Yes, there is a problem with potassium….in whole blood.” That’s PRECISELY why I wrote this new comment of mine regarding Barrie’s interview (see: https://shroudstory.com/2013/11/17/barrie schwortz on ewtn recently/#comment 51783) and what he said versus the nature of the blood on the Shroud, which is NO ORDINARY BLOOD!.","date":"2013-11-17","mins":"5:36 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51659","author":"anomymous","post":"Quote: “The blood is not that hard to duplicate.” Let me laugh at this one! No one has ever come close to deplicate the blood and serum stains on the Shroud (not even Garlaschelli, Allen or Nickell) and you know why? Simply because it takes a real tortured corpse (yes, a dead body – because there are both pre and post mortem bloodstains) to replicate all these blood and serum stains and not only that, it takes a bloody corpse that must be covered with clotted wounds and not with fresh blood that would still be in a liquid state. Also, people always forget that it is a fact that the blood and serum stains were on the cloth before the image. Consequently, the only possible scenario involving a man made forgery for the image is one that involve a forger who would have artificially created (with a scorch technique or something else) the body images (back and front) with a real bloodstained burial cloth of a real crucified man. And our hypothetical forger would have been so genius that he would have succeed to create perfect body images (forensically speaking) while being able (we don’t know by what miracle) to not distrurb or damage at all the blood and serum stains on the cloth! This is so ridiculous as a hypothesis that I don’t understand some people still believe the Shroud can be the product of a man made forgery… The answer to the Shroud image formation must lie in some form of interaction (most probably natural) between the corpse of a real crucified man and the surface of his real burial cloth. Period. There’s no other rational possibility than this one and, by the way, that’s one of the main conclusion of STURP’s final report about the Shroud..","date":"2013-11-16","mins":"7:11 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51667","author":"anomymous","post":"In the case of the Shroud, when I use the word “perfect” is in the sense of “looking authentic” or, if you will, “looking real”. So much in fact that almost every medical or forensic experts were convinced, just like the ENTIRE STURP team, that these images must have been formed by an interaction between the cloth and a real crucified corpse. And it’s the same thing for the blood and serum stains..","date":"2013-11-16","mins":"8:25 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51674","author":"anomymous","post":"David, any transfer process that can “scorch” the linen fiber imply automatically a high amount of energy, which, because of its high intensity, cannot produce a discontinuous distribution of colored fibers like it has been noted in the image area of the Shroud. So, here’s my advice to you: forget about Corona discharge or UV light or any other burst of high energetic radiation has a possible solution for the Shroud image. It is simply scientifically impossible for such energetic processes to produced a discontinuous distribution of colored fibers like we see on the Shroud. And again, for the same reason I just mentioned and also because of the evidence of the bloodtains, you can also completely forget the idea of a forgery made with a scorch technique. I repeat myself but I can’t shut up about that: the answer for the Shroud image formation must have something to do with a natural process coming from the corpse that was enshrouded for less than 48 hours Inside that cloth. The solution cannot be found outside of this….","date":"2013-11-16","mins":"10:59 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51676","author":"anomymous","post":"I must write again the last sentence with an important addition: the answer for the Shroud image formation must have something to do with a natural AND VERY MILD process coming from the corpse that was enshrouded for less than 48 hours Inside that cloth. The solution cannot be found outside of this… All the data coming from the Shroud (and particularly the fact that the blood and serum stains outside the immediate vicinity of the 1532 fire holes were not disturbed or damaged by the image formation process, along with the discontinuous aspect and extreme superficiality of the image) points in direction of a mild process, which have all the chances in the world to have been natural. Nature is very surprising at times!.","date":"2013-11-16","mins":"11:04 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"}],"researchers":[{"id":"comment-51801","author":"anomymous","post":"On the contrary to you, I NEVER claim being a scientist. So if I made some mistakes versus the scientific method, pardon me please! ; ) But the claim you make that my position is magic based is ridiculous. I simply follow the most solid data coming from the Shroud, reflect upon them for a while using only rationality (and no magical thinking) in order to extract all the possibilities given by those data, while at the same time, leaving aside all the other scenario that cannot fit with them (like your hypothesis of the scorch by the way)..","date":"2013-11-17","mins":"5:48 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-51804","author":"anomymous","post":"The fact that there are both pre and post mortem blood material on the Shroud, the fact that there is a much higher than normal level of bilirubin in the blood, the fact that there are serum stains around many bloodstains, the fact that most of these bloodstains come from exudates of moistened (or re moistened) blood clots and the fact that these stains are consistent with someone who died in a vertical position of crucifixion and was later on transferred to the tomb and laid in the Shroud in an horizontal position, should be enough for you to understand what I meant by saying that “The bloodstains on the Shroud are both physically and chemically typical of any highly traumatized body that was tortured, scourged and who died by crucifixion.” By the way, you must read Fazio and Mandaglio’s reply to the highly critical review you wrote the other day versus their work: https://shroudstory.com/2013/11/09/video barrie schwortz at the pikes peak prophesy summit/#comment 51786.","date":"2013-11-17","mins":"5:53 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-51781","author":"anomymous","post":"Charles wrote: “There is just one simple point I want to add it seems. From these debates, that if the Shroud is not authentic, it must be a forgery. In fact there is a third possibility, that it was a painted cloth made for some other function that became venerated (as an icon) and was then ADOPTED as the genuine burial shroud of Jesus.” Charles, you can forget that one! The evidence of the bloodstains is there to contradict completely such a scenario. Read the paper written by Yannick about that (link: http://www.shroud.com/pdfs/n76part5.pdf) and, at the end of your reading, I hope an intelligent and rational guy like you will agree with him that, because of this important evidence coming from the bloodstains (which is too often forgotten or left aside or denied by the skeptics) there are only 4 possible scenarios to explain the Shroud and not a single one of those include the possibility of a man made forgery. This path is a dead end my friend. Concerning the forgery thesis, I’m affraid the Shroud image can only be a natural (and most probably) accidental product of a forger who would originally tried to replicate the bloody stigmata of Christ by enveloping for some time the real crucified corpse of a man who suffered the same tortured than Jesus as reported by the Gospels (including the crowning with a cap of thorns) in a burial cloth. Then, after a certain time (which must have been of something between 24 and 48 hours), it is possible that our very gruesome and hyper realistic forger would have found, most probably to his astonishment, that he not only succeeded to replicate the stigmata of Christ but also to imprint a body image of the crucified man on the cloth. It is also possible, because the Shroud image is possibly a latent sort of image that could have taken decades to become visible, that our highly hypothetical forger would only have discovered the body image many years later. Seriously, in face of all the data coming from the Shroud, if someone pretend it to be the work of a forger, I don’t think he has the right to defend another scenario than the one I just describe (except a similar scenario involving the same kind of forgery but with a forger who would have been aware of the fact that he would get a body image of his crucified victim on the cloth). Seriously, when you analyze the level of probability for such an extravagant scenario to be true, you end up with a very low result! In my mind, it’s much more plausible to think the Shroud is just want tradition say it is: the authentic burial cloth of Jesus of Nazareth. Note: this statement doesn’t imply that some form of miraculous process must have been active in order to produce the body imprint on the cloth. And concerning your statement “I still haven’t found anyone who has ever seen bright red blood used in a criminal trial as evidence that the injured/deceased was tortured before death – yet it seems to be Barry’s clinching argument.”, I think you misunderstood a bit the heart of what Barrie meant because I think that all he wanted to express was precisely the opposite of what you said. Yes, I think that Barrie wanted to say that it’s only when he found out a real credible and rational explanation for the reddish aspect of the blood that he became fully convinced that the Shroud was really authentic. In the end, it’s not the reddish aspect of the blood that was understood by him “as evidence that the injured/deceased was tortured before death” but the opposite: it’s the fact that there is a much higher than normal level of bilirubin in the bloodstains (which is a sign of a great suffering of the Shroud man prior to his death and which caused the blood to remain read until this day with maybe the help of possible presence of saponaria residues on the cloth, which still need to be proven) that was understood by Barrie as a sort of “definitive” evidence of the authenticity of the cloth (but only after he put it alongside all the other solid pieces of evidence that exist to support such a conclusion)..","date":"2013-11-17","mins":"4:44 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-51783","author":"anomymous","post":"By the way, after having seen and heard a lot of interviews done by Barrie, it was the first time I heard him say clearly that the bloodstains on the Shroud are made of exudates of moistened blood clots, which is a very good thing, because it is a crucial aspect of the bloodstains (and, by extrapolation, of the serum stains) that should help the public to understand that the blood on the Shroud is NO ORDINARY BLOOD! This is much too often forgotten or misunderstood by people interested in the Shroud, while it is probably the most important data coming from the Shroud to support the authenticity of the relic as the real burial cloth of Jesus of Nazareth! So, bravo Barrie for your presence of mind concerning the very particular nature of the bloodstains on the Shroud and I surely hope that, in future interviews and public lectures, you will keep on emphasizing the fact that what’s as stained the Shroud is NO ORDINARY BLOOD. This is VERY IMPORTANT..","date":"2013-11-17","mins":"4:49 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-51795","author":"anomymous","post":"The bloodstains on the Shroud are both physically and chemically typical of any highly traumatized body that was tortured, scourged and who died by crucifixion. Therefore, it cannot be anything else than a burial cloth that enveloped for less than 48 hours a real dead body of a real crucified man and this could have been done by a forger who wanted to replicate the bloody stigmata of Christ (highly improbable scenario) or by some persons during a real Jewish burial procedure involving the corpse of Jesus or of another person looking like him. So, I don’t know what you tried to express with me using two different mode of expression..","date":"2013-11-17","mins":"5:33 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-51787","author":"anomymous","post":"Precision Emmett: The Shroud is a man made object (most probably manufactured during the Antiquity), the image on it is not….","date":"2013-11-17","mins":"5:09 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-57172","author":"anomymous","post":"Of course, I was talking about the same material (or a reserved portion of it) he first dated with his new method. I know C14 destroy the material but I think that would have been the only way to learn if his new method can produce any reliable result..","date":"2013-12-07","mins":"7:32 pm","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-57189","author":"anomymous","post":"What I was talking about was dating Fanti’s sample with C14, not Julls’ samples..","date":"2013-12-07","mins":"9:26 pm","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-57165","author":"anomymous","post":"No matter if we talk about Fanti’s method or a new C14 dating that could be performed under better conditions, in my mind, if such a method produce a bullseye result about the Shroud’s age like the result published by Fanti did, I have to be highly skeptical about that. On this subject, this is exactly what is thinking an expert in C14 dating like William Meacham, who wrote in his book The Rape of the Turin Shroud that, in 1988, he was expecting a result around the 4th or 5th century, even though he was convinced of the authenticity of the Shroud. Why? Because there are too much possibilities of contamination with a relic like the Shroud who was held by numerous hands (many of which we don’t know anything about) in numerous conditions (again, many of which we don’t know anything about) and I think this is ever truer in the particular case of Fanti’s highly suspicious samples (taken with a vaccuum from the space between the Holland cloth and the backside of the Shroud, which could well have traped a lot of alien material that have nothing to do with the original cloth over the centuries). So, in such a context, it is almost scientifically impossible to expect the dating result will give a pretty 30 AD result! And in the particular case of Fanti’s dating, here’s a very good question that I don’t think was ever asked: Why in the world he did not ALSO dated his samples with the well accepted C14 method in order to compare the results and see if his new method could have some chance to yield accurate results in the case of ancient textiles?.","date":"2013-12-07","mins":"6:55 pm","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-54544","author":"anomymous","post":"Just as it is meaningless to still try to disprove the “scorch theory” while every one who knows the data very well (especially concerning the blood and serum stains) and have two cents of intelligence knows that such a man made forgery CANNOT be what have caused the body image on the Shroud….","date":"2013-12-01","mins":"6:47 pm","url":"https://shroudstory.com/2013/12/01/remembering-shroud-blood-scientist-dr-john-h-hellera-guest-posting-by-kelly-kearse/","cat":"uncategorized","title":"Remembering Shroud Blood Scientist Dr. John H. Heller–A Guest Posting by Kelly Kearse"},{"id":"comment-54606","author":"anomymous","post":"If the blood evidence is approved, then the skeptics should rely of the only forgery scenario that is possible, which imply the use of a real crucified corpse in order to produce a false relic of the Shroud of Christ with all his bloody stigmata (and with a body imprint in extra). That’s the only possible forgery scenario that exist once you accept that the blood on the Shroud is real blood and came most certainly from the Shroud man himself… But I repeat myself over and over again. Sorry. It’s just that people don’t seem to get it..","date":"2013-12-01","mins":"8:50 pm","url":"https://shroudstory.com/2013/12/01/remembering-shroud-blood-scientist-dr-john-h-hellera-guest-posting-by-kelly-kearse/","cat":"uncategorized","title":"Remembering Shroud Blood Scientist Dr. John H. Heller–A Guest Posting by Kelly Kearse"}],"resources":[{"id":"comment-51786","author":"anomymous","post":"Here’s the reply of Mr. Fazio and Mandaglio concerning the highly critical review of Hugh Farey that we can find just above (link: https://shroudstory.com/2013/11/09/video barrie schwortz at the pikes peak prophesy summit/#comment 50952): “ Dear Hugh Farey, we have read your intervention on our Shroud papers. Your approach shows that you do not know the stochastic processes. Besides, you do not use the language of the ”true scientist”, you write as a teacher of Natural Science. Therefore, WE INVITE YOU TO PRODUCE A SHROUD ARTICLE ON THESE QUESTIONS IN A INTERNATIONAL REVIEW. Later, we will answer and if your ideas are without mistakes, we will accept the results that you have obtained. THE COMPARISON OF THE IDEAS (the one among “true scientists”) HAPPENS BY INTERNATIONAL JOURNALS. In a blog, on the web, in a bar, on the beach, a person can write and say anything. We are nuclear physicists and our articles are, generally, published in: Phys. Rev. , Phys. Rev. Lett. (USA), J. Phys. , Eur. Phys. J., Phys. Lett. , Nucl. Phys. , Few Body System , Europhys. Lett. (EUROPE)), Yadernaia Fizica , Izv, Rossiiskoi Ak. Nauk (RUSSIA) , J. Phys. Soc. Jpn. , Prog Theor. Phys. (JAPAN) ,Nucl. Science Tech. (CHINA) Mod. Phys. Lett. , Int. J. Mod. Phys. Therefore, as you can understand, the comparison for us is necessary and, when it is the case, we admit the errors. So, we continue to believe, without presumptuousness, our Shroud papers while, WE WAIT FOR AN ARTICLE OF YOURS IN AN INTERNATIONAL REVIEW. Sincerely, G: Fazio and G: Mandaglio “ Note from me: After this post of Mr. Fazio and Mandaglio, I hope there will not be anyone left (not even Hugh!) to believe these 2 nuclear physicists don’t know what they are talking about when they categorically say that no known form of high energetic radiation (whether it be a scorch, a burst of UV light, a Corona discharge, a burst of protons, of neutrons, etc.) can produce the kind of body image we see on the Shroud with all its very particular characteristics, especially the spatial encoding, the highly superficiality of the image AND the discontinuous distribution of colored fibers in the image area..","date":"2013-11-17","mins":"5:08 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50589","author":"anomymous","post":"On Youtube, the title of the video is “Shroud of Turin: Hoax or Proof of Resurrection?” How many times do we see such titles associated with the Shroud? I’m always amazed to note how most people (including most Shroud researchers these days) don’t seem to understand that the most probable answer for the Shroud can well be hidden right between these two extreme positions (i.e. Not a hoax and not a by product of the Resurrection, but more likely a natural (but amazing nevertheless) product of the dead body of Jesus of Nazareth)! As long as most people will only seek the answer for the Shroud and its body image in these 2 extremities, I have a feeling that we’ll never found the real cause for the image. Look people, the Shroud is a real bloodstained burial cloth of a real crucifed man that suffered the same set of tortures as Jesus of the Gospel and the image on it represent what look like Jesus Christ right after his Passion and death. Taking that into account, don’t you think the most logical and rational (and thus probable) cause for this body image has to be some kind of natural interaction between the dead body and the cloth? And finally, when you also take into account (without any religious or anti religious preconceive notions) the professional judgment of radiation experts like Rogers, Fazio and Mandaglio (who all categorically stated that the image cannot be the product of any kind of high energetic radiation and cannot be the product of a forger), then you are kind of “forced”, like me, to come to the sad conclusion that most people today don’t understand the Shroud correctly as they only tend to see an hoax or a proof of the Resurrection while looking at this cloth, when they should see instead a possible proof of God’s Incarnation in our humanity and a proof of the validity of the Gospel accounts concerning the Passion and death of Jesus (and, by extension, a pretty good clue that Christ’s disciples were truly convinced of the reality of Jesus’ Resurrection). Last thing: I have not watch the video of Barrie’s presentation but I will and I’m sure that, as usual, it is well done and interesting….","date":"2013-11-09","mins":"7:58 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50681","author":"anomymous","post":"First, the paper of Fazio you mention talks mainly about a hypothesis he proposed (which I don’t think is the most probable by the way!) concerning one aspect of the Shroud’s dorsal image that is mainly based on the possible presence of burial ointments on the back part of the Shroud. In this context, the fact that a nuclear physicist ask some questions to a biblical scholar about the ancient Jewish method of burial and burial ointments is completely normal and part of the proper way to do a good scientific research. I don’t see any problem there and, in fact, I see this as another proof of the professionalism of this person. And secondly, you can be certain that the Giovanni Fazio I often refer in my comments, as well as his colleague Mandaglio, are two real experts in radiations and, therefore, we must listen very carefully to what they have to say about the image formation that, in their opinion of expert (as well as the opinion of the late Rogers, who was another true expert in radiations), cannot have been caused by a man made forgery (including a scorch), no more than a release of some high energetic radiations by the dead body of the Shroud man, but on the contrary, must have been caused by a natural interaction (still undetermined) between the cloth’s surface and the dead body. And if you don’t believe me when I say that both Fazio and Mandaglio are true experts in the field of radiations, take a good look at the details of where Fazio and Mandaglio are currently working: Fazio: 1. Istituto Nazionale di Fisica Nucleare, Sezione di Catania, I 95123 Catania, Italy. 2. Dipartimento di Fisica e di Scienze della Terra, dell’Università di Messina, I 98166 Messina, Italy. Mandaglio: 1. Istituto Nazionale di Fisica Nucleare, Sezione di Catania, I 95123 Catania, Italy. 2. Dipartimento di Fisica e di Scienze della Terra, dell’Università di Messina, I 98166 Messina, Italy. 3. Centro Siciliano di Fisica Nucleare e Struttura della Materia, 95125 Catania, Italy. Last thing: I know Fazio personally via emails and, as he told me, he and Mandaglio have absolutely no pro religious or anti religious agenda behind their backs (just like Rogers by the way) and the only motivation they have is to explore the mystery of the Shroud in a purely scientific way, which is only based on all the pertinent data related to the relic..","date":"2013-11-10","mins":"7:36 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50684","author":"anomymous","post":"Additional comment: Unfortunately for the diehard skeptics and the supernatural and religious fanatics, the professional conclusions of radiation experts like Roger, Fazio and Mandaglio concerning the nature of the image formation do not fit at all with their preconceived ideas. And since the major part of those interested by the Shroud comes from these two “extreme” categories, I think that explain why these particular conclusions have generally not been well accepted by most Shroud researchers as well as by most shroudies..","date":"2013-11-10","mins":"8:07 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"}]}
