{"art":[{"author":"artscience","post":"menedemus :Cautious as I am by nature, I am,= not convinced that the Shroud is there, partly because I do not understand why anyone would want to copy it without making it very clear, from the size of the cloth and the double image, what they were wanting to show their audience.Hi menedemus, like you I also was not totally won over by the PM. But…I grant you that its not the best of pen and ink drawings (btw a very difficult medium as unlike most artistic mediums you’re sort of stuck with your crap lines if you make a mistake….I speak as one who has done pen and ink exhibitions). But the reason I single out your quote about the small size of the shroud is that I have seen it mentioned many times and even in WIkipedia as evidence against the PM representing the Shroud. There are many things about the PM that are ‘suggestive’ of a connection, but I think the last image on Steve Jones page about the PM is the most impressive and is almost completely ignored by all.http://theshroudofturin.blogspot.ie/2012/05/my-critique-of-pray-codex-wikipedia-1.htmlHave a look at the two figures attending to the left and to the right. Steve Jones emphasizes with a green line the flow of the shroud around the two figures. This is the only sensible understanding I can make of the two figures who otherwise seem to be playing a bit of tug of war with some strange material in the background. Without Steve’s lines I would have completely ignored what these two were up to, but now my attention is grabbed, there seems to be no other proper explanation than they are holding onto the lengths of a rather extended shroud (if anything its now too long!). Notice how the cloth bunches up towards the head and flows over to be draped over the man on the left. I’m sorry to say I originally dismissed Steve Jones as an evangelical nutter but he has pinpointed a very strong and hidden bit of evidence that what is depicted is actually very large piece of material. (For those who disagree, please explain to me what the two guys to left and right are up to and whats in their hands). Whilst I’m at it, can anyone also explain what is being depicted other than the shroud in the image here of Emperor Romanus receiving some large piece of cloth with a disembodied head. This illustration also have a pre-1300 date. O, I do like a mystery….and trying to sense of it!","date":"June 20, 2012 at 7:00 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"artscience","post":"Meant to include this link to illustration of Emperor Romanus receiving his “laundry”…see image half way down the pagehttp://shroudofturinnews.com/documented-proof-of-shroud-of-turin/","date":"June 20, 2012 at 7:05 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"artscience","post":"Hi David, again an excellent reply. Yes, the Heures, Vie de sainte Marguerite image really does show the use of iconographic templates to achieve folding cloth depictions, but it does then beg the question why did the artist go to the trouble of showing the two attendants on right and left in an apparent tussle with the surplus material….what other explanation is there for whats in their hands other that material from the shroud, though I’m open to suggestions.  I suppose your point is that the artist might not necessarily be illustrating the shroud but might be trying to do a copy of something similar to  Ingeeburg Psalter.I think that my original point that the shroud depicted in the PM is actually very long, is still valid whether the artist is trying to do something like the Ingeeburg Psalter or attempting a depiction of the shroud. Though whether the top and bottom images on the PM  are both actually the shroud seems debatable. Some nice puzzles to think over.BTW Do you know what is being depicted but the long extended cross extending from the bottom image to the top image? There almost seems to be a detached hand holding the cross.","date":"June 21, 2012 at 4:13 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"artscience","post":"Thanks Menedemus, I’m just curious as to the truth of the Turin Shroud and have no real bias either way. I come from a physics background but also studied art and researched into old master techniques so I was curious as to how the image was formed. It would be nice if there were some truth to its claims, but getting reliable evidence for or against seems tricky as there often seems to be an agenda behind the evidence. I’ve only a very cursory knowledge of the Shroud but it does stand out as  unusual in art history (and it also stands out from its copies as it seems to be very obviously of a different level of skill and detail involved). I have a couple ideas of how it might have been made if indeed  it was.Yes, I have noticed that there is a fair level of rough and tumble in the forum …. just got to laugh it off if possible!  Nevertheless I’ve learnt a lot by snooping in here every so often, and am thankful for people’s opinions, as I feel it has helped me better formulate my own opinions. Nice hearing from you, best wishes.PS Thanks for the explanation of the origin of the name you use.","date":"June 21, 2012 at 3:59 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"artscience","post":"David Mo :As the Mandylion was a sacred image the man can not touch it directly. So he holds it with his cloak.Nice explanation, David…I can go with that! That enlarged image helps clarify that. Thanks. One mystery solved.What is your opinion of the green line on the PM as extolled by Steve Jones? That certainly still seems to be indicating a long shroud. Though I might not have made the final green connection on the right that he does (giving a continuous cylinder of cloth!)","date":"June 21, 2012 at 4:01 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"artscience","post":"HI David thanks for your reply. I must admit I’m not so persuaded this time by your arguments.I’m not entirely sure why its extraordinary that a Hungarian monk might have gone to Constantinople and seen shroud with herringbone pattern from say a couple feet way, then returned and after months/years tried to recollect what he could.  He might have decided that his skill in drawing a body imprint on the cloth was not sufficient to distinguish it from an image of a dead and singularly unrisen Christ resting on shroud, so decided that herringbone texture was the next best thing. I think its an established fact we are dealing not the most versatile of artists and to add to his pains the necessity of showing what is a faint human body image flattened …now that would have been extraordinary!  We know that witness testimony and memory can be unreliable, so he might have painted the nail wounds where people expected and also he was more interested in conveying the crucifixion and resurrection story than igniting an anatomical controversy. (poor bastard, if only he knew his drawing would be subjected to this level of forensic detail, he’d be squirming in his grave!).  So I’d downgrade your extraordinary to mildly unusual, but then I dont know medieval art like you do.","date":"June 22, 2012 at 2:25 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"artscience","post":"Had a spare moment on a Friday afternoon to check out his statement “his eyes are located too high. In addition to making faces too large, amateur artists tend to place the eyes about 2/3 to 3/4 up from the base of the chin to the top of the head.Human eyes are actually located close to the middle of the head.”I’m an amateur artist and the position of the eyes on the Shroud didnt seem wrong to me, but being a scientist decided to measure, and the position of eyes on the Shroud were just about half way up the head as they should be (NOTE: this is measuring the head as being from the top where there is a bit of uncertainty where the top is exactly, to the position of where the beard splits. This lower position ie where beard splits is about right otherwise you end up with a Jesus with an abnormally large jaw).  Makes me wonder if he actually tried to measure these.","date":"March 1, 2013 at 11:37 am","url":"https://shroudstory.com/2013/03/01/observations-consistent-with-a-medieval-artist/","cat":"art","title":"Observations Consistent with a Medieval Artist?"},{"author":"artscience","post":"Hi Davor, can you provide a link to your likeness of Jesus on your blog as I couldnt find it? I think you’d be amazed with how much much the brain can be tricked by putting into key markers in a portrait to achieve a resemblance. In fact those key markers can be as minimal as a hairstyle (eg see Dali’s Mao Marilynn portrait, where he makes Marilynn Monroe look like Mao with just a hairstyle!!), or a moustache type (eg Hilter and Freddie Mercury impersonators). So I wouldnt be so dismissive of the Vignon markers as they would be a lot easier to add into a portrait than getting the proportions right which really is a harder proposition (I say this as an occasional portrait painter). Getting the proportions right are only important when you are trying to match a known person, where people with automatically feel something is wrong, but whey you are going for a iconic Jesus, I guess you can just rely on beard, moustache, flowing hair and some perhaps a hardful of these markers. Also Vignon markers would be a lot easier  to transmit over the ages than a set of proportions.  If I were to try to test out the validity of these markers, I’d try and see how many of these markers appear in other medieval portraits vs the Christ portraits. Though I am not entirely convinced by the Vignon markers myself, I still cant totally dismiss them either as there does seem to be some sort of purposeful attempt to work at least some of these into the Christ portraits. Thats why I’m interested to see what you achieved by following these markers only. Thanks","date":"September 9, 2012 at 7:22 am","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","title":"Quote for Today: Hans Belting and commentary"},{"author":"artscience","post":"David, just to clarify…unlikely doesnt imply illogical. For someone who uses it a lot to imply a faulty argument, its only fair that you use your words correctly. Thanks","date":"September 11, 2012 at 8:47 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"author":"artscience","post":"No problem, David. I just thought I better make sure you knew that incorrect use of words can lead to difficulty understanding. I take it that you meant to say its improbable rather than illogical.The reason I bring it up is in regard to above you mention above your point 3.2. I think it concerns whether a barely described artifact can have a big cultural effect. Many years ago, I got  interested in the effect of optical instruments on the history of art (see Hockney-Falco thesis). There seems to be a number of art historians (including Martin Kemp), who think it likely that artists such as Carravaggio, Holbein and others used mirrors, lens etc to project an image onto a surface for easy rendition of features, and this radically changed the history of art. However there is precious little documentary evidence of this. And you are talking about a number of centuries.  David Hockney describes it as “Secret Knowledge”, a secret passed on from studio to studio. And even in the cases where this knowledge isnt known, the new style of painting still becomes pervasive (see the followers of Carravaggio who tried to emulate the style without knowing the secret). So I think Yannick idea that a small showing of a naked Christ on a shroud could have a large ripple effect and without its cause been widely known, is entirely possible as an explanation of how come naked Christs come into vogue. Thats why I’d be a bit careful about disparaging unlikely ideas….change often only happens when something extraordinary comes along. I’m not saying this in necessarily the case, but art shifts often come from exposure to something different (eg primitive cubism from Picasso’s exposure to African sculpture in the Louvre).BTW I tried out some of the optical techniques myself and people were amazed at my much improved artistic skills, until I told them how I’d done it! Artists generally guard their secrets more wisely!!","date":"September 12, 2012 at 3:04 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"author":"artscience","post":"Hi Charles, when you mention shrouds, were these all with an image and blood etc. and are one of these the Shroud of Turin? I must say I’d be more than surprised that the Shroud (of T) itself didnt garner more interest than relics of cross, thorns etc. I cant understand how a large cloth with an  image, showing nail wounds in hands, and feet, side wound, real blood, indications of a crown of thorns, a summation of death and resurrection, plus an image of what Jesus looked like would be outclassed by any of these others (which are very easily faked). Any ideas of why this might be as it doesnt make the remotest bit of sense to me.","date":"September 12, 2012 at 9:15 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"author":"artscience","post":"Hi David, sorry you are clearly missing the point of my mention of “Secret Knowledge”. I’m not suggesting Caravaggio had anything to do with the shroud at all – that makes me laugh,  as thats off by a couple centuries!  No, my point was that the use of optical instruments in the history of art is almost completely undocumented even though very influential – so I was drawing an analogy to Yannick’s theory that there might have been a showing of the shroud,  that was undocumented, and yet had an influence on future depictions of the burial of Christ. If I understood you correctly, you dismissed Yannick’s theory because you thought it an oxymoron for an undocumented artifact to have a large cultural influence. I disputed that with the counter-example above.","date":"September 13, 2012 at 5:53 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"}],"blood":[{"author":"artscience","post":"I’m not entirely sure what is the nature of Colin’s claim on the markings, but I will address the one detail that was mentioned about the leather between the lead weight leaving a mark whereas the leather attaching the lead weights to the handle apparently not. Its an interesting observation but easily explained by Newton’s physics. The momentum of the lead weights makes them travel deep into the flesh, dragging the leather between them inspite of the leather having too little momentum by itself to penetrate the flesh. However the bit of leather attaching to the handle and near the point of attachment to the lead though dragged with the weight will flex back on hitting the flesh as it hasn’t got sufficient momentum to penetrate (in contrast to the leather between the weights which is constrained to be between the lead weights and so cant flex back). So that would explain the absence of the marking of the tether leather. However as with many things in physics its often worth experimenting to see whether the reality matches the theory.","date":"June 22, 2012 at 5:56 pm","url":"https://shroudstory.com/2012/06/20/berry-shroud-was-scourged-not-the-man-a-critical-look-at-faccini-and-fanti/","cat":"blood_studies","title":"Berry: Shroud was Scourged, Not the Man. A Critical Look at Faccini and Fanti"},{"author":"artscience","post":"Thank you again, Kelly for your balanced and clear answers. You mentioned the fact that the blood appears to be on the cloth before the image,  hence ruling out (or at least making it highly difficult to get proper registration between blood marks and body). Just to drill down a bit into this bit of information:1)how do we know for sure that the blood was there before the body image – I saw mention of blood being scraped off in one place to reveal no image underneath. Do you know if this was done in a number of places or just the one? 2)and how do we know that the blood didnt dissolve the image material underneath it? To answer my own last question, I think I saw Ray Rodgers tried various solvents unsuccessfully  on this outer coating material, but did he try blood as a solvent? 3)do you know if the whip marks are a combination of welt marks (eg dumbell shapes etc) and blood marks. If whip marks are such a combination, they make a good study to whether it was likely that blood was painted onto the cloth separate to the body image. There was a method (certainly known during the Renaissance if not earlier) called pouncing by means of which a flat drawing could be transferred to another surface (by pricking holes along the outline and important contour lines on the original drawing, placing the drawing on top of final surface and pouncing with charcoal dust in a bag through the holes), so it is theoretically possible that a forger could know where a flat 2d body image would eventually lay, and hence put blood at the appropriate places before the image is transferred. This however would only work accurately for a flat image transfer, whereas a 3d or bas-relief would pull linen away from those originally sketched positions….Not to mention that it would be a very awkward way for any artist to work.Sorry if I appear to have a sceptical mind, but its more to determine how much wiggle room there is for doubt. Thanks","date":"February 17, 2012 at 8:58 am","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"author":"artscience","post":"Yes, Colin, I am also puzzled by the ability of the blood to still wet a Shroud hours after the event. Perhaps Kelly might have some ideas here as well. Just an idea, does blood fully clot in the rain? or perhaps in washing down a body in preparation for burial it allowed a fresh leakage of blood. From my own minor and brief experience in trying to get a hit and run victim to hospital (in a country with no ambulances!), I was surprised to find in the back seat where he had rested a quivering mass of very soft jellylike blood at least an hour  later.","date":"February 17, 2012 at 10:15 am","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"author":"artscience","post":"Thanks Deuce and Kelly, for your replies. I could imagine some bloodstains are due to semi-dried blood and some due to fresh leaking when laid flat….I suppose if one could distinguish between the two, say by correlating those that penetrated through to the other side of the cloth with what one reckons should be the fresh leakage, whereas the semi-dried ones wouldnt be expected to penetrate as deeply into the cloth, this could help build a bit a substance to the theory of the two types of blood flow (pre and post mortem).Yes Kelly I have seen the uv light images of skin abrasions that arent normally visible (in fact these were what I was thinking of when I thought it might be interesting to match these up with visible bloody whip marks). I find these hidden artifacts (along with the hidden blood serum halos) some of the most articulate bits of evidence against a forgery.","date":"February 17, 2012 at 6:10 pm","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"author":"artscience","post":"Thanks Max on your comment about the halakhic ritual of washing down remoistening wound areas and it seems consistent with Rons’ reference to Zugibe’s paper. That would help explain some of the body blood stains, though the hair bloodstains still seem problematic. I notice in the description of halakhic ritual that the hair is combed, so perhaps if the body had been washed, the damp hair whilst being brushed would have picked up blood oozing from disturbed thorn wounds, giving rise to the streaky, ringlet nature of some of the bloodstains in the hair.","date":"February 18, 2012 at 6:29 am","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"author":"artscience","post":"Thanks Kelly, that was very informative. Whilst we have someone as knowledgeable as your self in our midst, do you mind me asking you whether you can corroborate the story about the Shroud’s blood being able to retain its red color (rather than turn black or brown), due to a reaction with bilirubin released during extreme stress? I’ve heard this or something similar being mentioned but no authorative report on this. Thanks","date":"February 16, 2012 at 5:51 pm","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"author":"artscience","post":"Thank you Kelly for your patience in replying so speedily. Would this necessarily rule out the idea of blood being painted on during a hypothetical forging of a Shroud? I presume first of all that they have already determined it is human, rather than say animal blood. How easy would it be to get bilirubin infused human blood and keep it liquid whilst painstakingly creating all the blood marks before clotting sets in?Also does the Oviedo cloth display the same level of red for the blood ie is it bilirubin rich as well?","date":"February 16, 2012 at 6:28 pm","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"author":"artscience","post":"Hi Matthias, like Hugh I also think this is a very interesting experiment and might open up a new explanation for the mysterious double blood trails at the back. I am generally a sceptic but this sort of subtle unexpected blood trail would start moving my stance a bit or at least make the explanation by means of a cunning forger more difficult to swallow. Well done for actually trying out this out … I might even be inspired enough when I’m having my birthday celebration drinks tonight to try it with some tomato juice to see how close to the intertwining pattern you can get (yes, my wife already thinks I’m bonkers;).","date":"February 20, 2013 at 12:18 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"}],"forensic":[{"author":"artscience","post":"I’ve always been curious about those two strands of hair coming down from the hair line ….it seems quite widespread in depictions of Jesus from 500 onwards, but looking at the Shroud, they are not the most obvious of features. I’m looking at the picture of the Shroud’s head via the ShroudScope (cool name!) viewerhttp://www.sindonology.org/shroudScope/shroudScope.shtmland can just about make out two darker areas (on the negative image) in the middle at the hairline (one strand of which leads into the blood stain shaped like a reflected 3). Is this what inspired the two strands to appear in the depictions? Not exactly damning evidence, but intriguing. A good trick from my artist days, if you want to see broad tonal differences and not be distracted by details, is to squint through semi closed eyelids…then I can just about see the two strands or at least vaguely convince myself I do.","date":"February 16, 2012 at 3:36 pm","url":"https://shroudstory.com/2012/02/16/more-over-at-stephen-jones-blog-on-the-vignon-markings/","cat":"image_theory","title":"More over at Stephen Jones’ blog on the Vignon markings"}],"history":[{"author":"artscience","post":"Hi Yannick, Oh I’m more than willing to admit pure speculation but its always a good way to start (I’m a pure novice to Shroud studies but sometimes coming from a different background might reveal something…most probably that I’m an complete idiot, but who knows!). I did a very brief google search for ancient coins trying to find collars or lapels with that distinctive flex. Well the first thing that struck me was how rare a frontal portrait was on an ancient coin (rough estimate 1 in 200). I was looking for a double line collar with a flex. I only found one double line so far (google “ancient coins front portrait” near the bottom of the page). I agree with your assertion that an artist could quite easily create such a collar without seeing the shroud, but on viewing the coins I’ve seen on google so far, it mightn’t  be so daft an idea to query whether this might have happened. I’ll just state again what I find peculiar about this collar is that inflection….artists will normally use an economy of means to indicate form (ie a simple arc would have sufficed, so why the flourish of an inflection particularly if you are doing double close  lines where you have to be careful to keep lines roughly same distance apart in a wax original). Just an idea!","date":"February 3, 2012 at 8:48 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","title":"Ben Wiech’s video about the Justinian coin from AD 692"},{"author":"artscience","post":"The other observation (very minor) is that the heft sheen on the top side of the beard in the right coin image does correspond to the sheen on the shroud image’s beard (admittedly on the negative image of the Shroud). Doesn’t sound impressive until you have the two images side by side and its about the first thing that catches the eye!","date":"February 3, 2012 at 7:22 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","title":"Ben Wiech’s video about the Justinian coin from AD 692"},{"author":"artscience","post":"Hi Yannick,  sorry to disagree but the Christ Pantocrator you reference has a single black line lapel but the image  on the coins have a double line (and they are not fold lines, because horizontal fold lines on the edge of garment wouldnt flow like that through the inflection). I also looked at the the icon from St Catherine’s, and there is no line there at all. I also googled early images of Jesus and again couldnt find any double line lapels (also on coins a rarity). So I do still think one can ask a valid question, did those double lines on the coin get inspired by viewing the Shroud directly or are they just an artist’s whim or perhaps a sign of regality added distinguish a ruller? I dont know what the answer is, but given the relative uniqueness of the double line it seems to beg the question.Yannick,perhaps you can help me with an unrelated question: where did the two fork like hair strands on the forehead come from, as I see them in many subsequent images of Jesus but they are not on the Shroud as far as I can see? Thanks","date":"February 4, 2012 at 5:46 am","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","title":"Ben Wiech’s video about the Justinian coin from AD 692"},{"author":"artscience","post":"Yannick, I dont really know the Mandylion theory, but I do know that even in contemporary times an art object of great value will be hidden away in vaults whilst a poor substitute is displayed (and in times before photography this might go unnoticed and unremarked). I could imagine that  eventually the substitute (the Mandylion) becomes the icon of veneration whilst the original glides along unnoticed and unwanted and so preserved for generations.","date":"February 3, 2012 at 7:43 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","title":"Ben Wiech’s video about the Justinian coin from AD 692"},{"author":"artscience","post":"The double lines for the collar do seem to have a correspondence with the double line creases on the shroud as Dan mentions. They both have a similar inflection (ie a flex in the normal artistically simplified flow of the garment, or if you’re a mathematician the double derivative of line changes sign in the similar way). This isnt that impressive as the flex is almost inevitable in real life but often artists will simplify especially if working on a small scale  like a coin. Why flex when a simple arc would do? I suppose comparing to other contemporary coins of other rulers who help resolve whether the artist went out of his/her way to add the inflection.This does however lead on to a more interesting observation: if the Shroud did exist in 692 AD, and was displayed revealing mainly the head,  such that artists would quite naturally confuse a crease in the cloth of the shroud for the top of a garment worn ( you wouldnt make this mistake if the whole were revealed), would this help support Ian Wilson’s theory that the shroud was displayed folded in 8, just revealing the head.  If one presumes only the head was shown for reasons of convenience of size (the shroud isnt the most convenient of sizes and at 4.4m compares with Jackson Pollack paintings on width and awkwardness on finding suitable displaying venues) and mainly propriety (ie a nude would be scandalous at the time), it is quite understandable that  an artist might confuse the double lines of the crease as a  part of a garment worn by Jesus.","date":"February 3, 2012 at 7:09 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","title":"Ben Wiech’s video about the Justinian coin from AD 692"},{"author":"artscience","post":"hi Charles thank you for that informative reply.I’ve thought about your shadow idea and though ingenuous has some problems/advantages in that,1) in order to make shadows on the cloth it has to penetrate the gesso layer which is a high reflectance surface (but again there’s a good test of this, hold up a gesso covered canvas to strong light to see whether there is a discernible glow, showing at least some light getting through). Next put a simple image (again say a 5 cm black X say from cut out card) and see if you can read it through the other side of your canvas with bright light passing through, testing image fidelity.2)there might a natural negativity of shades produced because say dark pigments on the surface, absorb light, so not allowing much to get through to the canvas, whereas light pigments reflect light and so perhaps allowing more onto the canvas and darkening the canvas there. So you might expect tone reversal as on the shroud.The Zittau Veil, yes looks interesting in the areas where pigment has fallen off. I suspect not all the pigment has fallen off (a close up photo would be nice if you have) giving the faint image. You mention that it was keep in a steamy environment, so it is quite possible the pigments have leaked past the sizing boundary (weakened by steam) onto the cloth.The shroud image seems to be mainly composed of darken fibrils with minimal contribution to pigments that have been detected on its surface. My own theory about how I might go about making a shroud would be to get a front and back facing low relief brass effigies made (i.e. just like those used in brass rubbing but not so flat, maybe having slightly more relief differentials in the surface to try to capture some of the face subtlety).  These I’d heat to a glowing heat and the allow to cool and give time for  heat to become more uniform, to a scorching temperature. Then I’d apply the shroud on top but only touching the surface by means of a roller mechanism  (e.g. like an etching press). This allow a nice uniform contact time to be achieved and pressure deferential scorch image to be produced. Some tentative bits of evidence to this method is the presence of those awkward fold lines across the shroud….this is very typical of what you get if you use an etching press and don’t use the prerequisite number of blankets to press down on your paper – without the blankets the paper rides up ahead forming a buckle what is eventually squashed down as the roller proceeds, giving those awkward folds.  The shroud has a number of these running roughly sideways across the length (there are some longish ways that I can’t explain so easily). The other bit of evidence for this approach is that the areas with the smallest cross-ways width tend to be darker (i.e. as the weight of roller is applied over a smaller elevated section, the pressure is higher…..hence for example the head seems darker). This technique has all the relevant technologies available at the time form brass plates, to rollers. However there still seem to be lots of other subtleties about the shroud (e.g. the presence of fine almost invisible whip marks, no image under blood (if true)) that make me not completely won over to my theory.","date":"November 22, 2014 at 8:36 am","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","title":"Charles Freeman’s theory now in Wikipedia"},{"author":"artscience","post":"Thanks Charles. Yep, only problem with trying to produce the shroud how it might have been say 7 centuries ago is we have no clear idea of what it looked like….was it in colour, were the outlines delineated, was there a background image, what medium was used, was there rabbit skin glue sizing applied? Still the fundamental question is how to get the faint yet detailed image onto  the cloth.With the Antikythera Mechanism, we know for sure that its ultimate form was not to be a corroded mess of gears, but a fully functioning astronomical instrument whose predictions we will be able to verify as accurate by tallying up to know astronomical data. Whereas the Shroud in its present form is able to function as an object of veneration and wonder and who is to say it is definitely different to what it was 7 centuries ago (ok burnt holes etc and most probably fainter are different, but whether a full blown painting, I’m not sure but you might be right….I just can’t see the mechanism to get the painting transformed onto the bare cloth with such high fidelity)  Without seeing the Zittau Veil in detail its hard to know how it compares to the shroud but I’d caution about jumping to conclusions that because on cursory  look it appears similar to shroud, its the same mechanism at work.  I know that when I try and reuse a canvas by scraping down, you are left with a faint image but it is still composed of pigments, not a shadow.","date":"November 22, 2014 at 2:13 pm","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","title":"Charles Freeman’s theory now in Wikipedia"},{"author":"artscience","post":"Oh and the other aspect of the roller theory is that it would also might make a faint secondary image on the opposite side of the cloth (such an image seems to be there in high pressure areas like head). The image here would be less do with scorching (as its not against the brass panel) but more due to pressure crushing the opposite surface differentially. However if the roller was hot as well, this might help image formation. Again….I’m not totally convinced but it does have a number of things going for it.Though I would like the Shroud to be authentic, brutal truth must win out unfortunately.","date":"November 22, 2014 at 9:06 am","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","title":"Charles Freeman’s theory now in Wikipedia"},{"author":"artscience","post":"Hi Charles, I hardly ever comment here but I had to ask about the Cellini method of sizing canvas and your idea that that it seems to tie in to the shroud’s image on the outer fibrils of the linen. Now from the description of Cellini’s method it just sounds like the standard way I used to size my canvases (in fact most artists used to until modern methods came along within last 40 years). So here’s the method: what I’d do is heat up rabbit skin glue till dissolved in water, and apply this solution thinly to the surface of the stretched canvas. Applying thinly allows the dried sizing to make a thin flexible protective layer (flexible so canvas can take knocks and recover and indeed can even be rolled up – Titian if I remember correctly, often sent paintings far and wide this way), and protecting the fibres from any corrosive action of the paint or paint medium. An additional gesso layer adds not only another protective layer but most importantly a reflective white surface that the semi-translucent paints within a medium (oil or egg tempera) could be applied to.Now the problem I have with your theory (unless I’ve understood it wrong) about the shroud being a flaked painting done in some similar such manner to the above, is that you seem to be saying that the painting done on top of these protective layers somehow penetrated through to affect the outer fibrils, such that when flexed over the centuries all that is left, after the painting/gesso/rabbit skin size layer falls off, is an imprint of the painting onto the linen a couple layers below. Can you see why I have a problem with this cornerstone of your theory?And additionally the imprint has 3d information within. I am a physicist and not very good painter (but I try!)  plus bit of an amateur art method historian e.g. studying how Vermeer, Carravagio achieved their realism. Whenever I see the shroud dismissed as a just painting I weep because that sweeping statement will convince many yet completely hides the many difficulties in creating the shroud. I’m not convinced the shroud is authentic but my scepticism also is honest enough to say that it is by far the most baffling artwork in existence…size, technique, novelty, subtlety, realism, surprises, details.BTW I did have a painting flake off in parts, and though I wasn’t really looking for it, I can’t remember seeing any imprint of the painting coming through. But in true scientific manner, rather that dismiss your idea out of hand, I suggest you try doing the rabbit skin glue, gesso, then oil paint (though perhaps in 13/14th century oil paints weren’t in regular use then, perhaps egg tempera instead) a nice big black X on the surface, leave for a couple months and then flex like hell until all the sizing comes off and see if the X appears on the canvas. You never know I might get a surprise!","date":"November 21, 2014 at 2:40 pm","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","title":"Charles Freeman’s theory now in Wikipedia"},{"author":"artscience","post":"Hi Charles, thanks for the nice clear reply. As I mentioned I most probably am leaning towards the C14  date being correct, but got curious whether anything can be made of the evidence going against this. I’ve never read Ian Wilson or the Acts of Thaddeus so most probably am missing the point, but from my (perhaps confused) understanding of this, I built up a picture of a possible sequence of events: that the Shroud (with image on it, and neatly folded and stitched) was interpreted as a towel and the burial clothes were some other cloths (perhaps the strips of linen, whether real or fake, the gospels mention). So the burial cloths looked the part (ie what they expected to see) so were mentioned as such and the folded Shroud looked like a towel and so mentioned as such. An easy enough mistake for the writer of the Acts, if he didnt have recourse to unpick the stitching and determine that he had got it wrong. If I remember correctly one gospel mentions strips of linen and another mentions Joseph of Arimathea buying a large expensive cloth. Might these be distinct – why  buy an large expense cloth only to cut it up into strips. Perhaps the strip are to bind the shroud together onto the body. So I dont really see a cut and dry reason to dispense with this evidence completely, but neither am I totally persuaded by it. I put it in the “hmm, that’s curious” category.I might wonder how come no one around the time of Thaddeus thought to unpick the stitching and have a little peek, but then again it seems that it also took a couple centuries for them to unpick the backing layer of the present TS recently for cleaning and find the faint image (Fanti’s claim at less) on the back hidden side.","date":"September 21, 2012 at 1:47 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"author":"artscience","post":"I’m sort of surprised by Matthias description of Stephen Jones folding as strange. If you actually tried it (I did with a large bath towel), its actually very easy. But what I noticed, if it was folded this way, you might have to hold it together by stitches both to the top and bottom of the folded form. However if you folded it as Dan’s original graphic there is no necessity to stitch the bottom as the folds contain each other and hold together at the bottom but not at the top.So you’d expect for Dan’s folding, there be stitching at the top, but isnt strictly necessary for the bottom, whereas for the Jones approach you need to stitch both top and bottom. I noticed that the illustration of Agbar has diagonal tassels at the bottom which might be due to stitching. I cant notice any at top but they would not be visible if you were doing a perspecitve view.  I also noticed that the image of the fresco show some sort of folded image (I’ve put the horrendously long link below), which seems to show very faint diagonal tassels as well at least at the bottom ( I’m not sure what the hell’s going on at the top, but I note that the sides seems to attempt to show some sort of folding…you got to zoom in to see it.)I also remember that there was another image of Emperor Romanus being given some sort of cloth with a head image also with tassels (at top this time, not sure at the bottom). So the Jones’s folding has a slight evidential advantage.I’m not sure what the Acts of Thaddeus are but I’m sort of perplexed that they being taken either verbatim or as complete nonsense. Now I’m not a historian, I’m a physicist, but I could imagine that the imagination could play a fair part you are  describing how an image might have gotten onto a cloth 400 years previous, but you might be a bit more precise about the foldings if the cloth were there to be viewed.  So I find it strange that Charles seems to say the tetradiplon description is rubbish much like the confused hearsay sequence of how the image  got on there. One is hearsay, the other you might be able to verify. Forgive me Charles if I’ve interpreted you wrong. As a scientist  I’m more biased to believe the C14 dating, but I got to admit there are many puzzling bits of counter evidence that make me put a question mark to my certainty ….The history of science is one of change when the evidence speaks loud enough. There are so many tantalizing bits of “half evidence”, that I cant quite accept completely, no dismiss readily. I’ve got to say, you couldnt quite make up the twists and turns in the unfolding story of the evidence – there’s been no knock down argument either side (unless you include the C14 but even then I’m curious as to the spread of the 3 different dates from the different labs, as you start to wander into  3 sigma territory ). http://www.google.com/imgres?imgurl=http://img442.imageshack.us/img442/8884/redman.jpg&imgrefurl=http://deumvidere.blogspot.com/2012_06_01_archive.html&h=420&w=646&sz=83&tbnid=y2t_N2M3T2qZAM:&tbnh=77&tbnw=118&prev=/search%3Fq%3DThe%2BImage%2Bof%2BEdessa%2B(11th%2Bcentury),%2BSakli%2Bchurch,%2BGoreme,%2BTurkey%26tbm%3Disch%26tbo%3Du&zoom=1&q=The+Image+of+Edessa+(11th+century),+Sakli+church,+Goreme,+Turkey&usg=__mGVC_0Y1apBGr5g-Od5M56xmdF4=&docid=KkCdUjcAys1L3M&itg=1&sa=X&ei=BsxYUMS5EYnOhAeO4IGwDA&ved=0CCQQ9QEwAQ&dur=432http://www.google.com/imgres?q=emperor+romanus+shroud&um=1&hl=en&client=safari&sa=N&rls=en&biw=2171&bih=1201&tbm=isch&tbnid=R5z4pDiIRpDAIM:&imgrefurl=http://shroudofturinnews.com/documented-proof-of-shroud-of-turin/&docid=lAkn95HXYr9BlM&imgurl=http://shroudofturinnews.com/wp-content/uploads/2011/08/Shroud-passed-to-Emperor-Romanus.jpg&w=274&h=184&ei=BNVYUOvsDNSyhAfE7oGoCw&zoom=1&iact=hc&vpx=206&vpy=179&dur=599&hovh=137&hovw=191&tx=117&ty=68&sig=108957755986079293482&page=1&tbnh=130&tbnw=174&start=0&ndsp=91&ved=1t:429,r:0,s:0,i:75","date":"September 18, 2012 at 4:44 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"author":"artscience","post":"edit: “no dismiss readily” should be “nor dismiss readily”.(start to understand a little of where Max’s manic editing comes from!)","date":"September 18, 2012 at 5:01 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"author":"artscience","post":"Another thing to bear in mind is that in the story about the Jesus’ face appearing when he wiped it with a towel, is that perhaps it was also an attempt to explain why the eyes appear shut (as you do when you wipe with a towel).Nowadays most face cloths have a thickness to aid absorption – might an 8 folded cloth stitched together be seen as an attempt at a towel?","date":"September 19, 2012 at 2:06 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"}],"image":[{"author":"artscience","post":"I like the theory, Colin…I never knew that the outer casing was darkened all the way around like that (but I’m fairly new to this). A run away reaction could explain that and traversing along the fibril. However I still think the explanation of the image on the other side is weak, as whatever heat is conducted has to go through the body of the material and if its hot enough the pyrolyse the hemicellulose on the other side, its hot enough  to pyrolyse the hemicellulose of the in-between fibres and darken them as well(which it doesn’t).  And again I think you’re pulling a fast one with the supposed high conductivity of cellulose, which the tables show isnt the case.","date":"February 18, 2012 at 2:05 pm","url":"https://shroudstory.com/2012/02/18/a-new-hypothesis-leapfrogging-luigi-garlaschelli/","cat":"image_theory","title":"A New Hypothesis: Leapfrogging Luigi Garlaschelli"},{"author":"artscience","post":"Well the sheets where meant to show that the intervening layers of threads will do a fair bit of reflecting back. But stick to a sheet of linen if it helps…you still got major problems to address but perhaps one you can try to solve is how you going to heat up the sand enough just from your faint difference in ir, to distinguish an image on the backside of the linen. And all this without burning through more than 200nm of the top layer.Better start on Plan C","date":"February 19, 2012 at 5:51 pm","url":"https://shroudstory.com/2012/02/18/a-new-hypothesis-leapfrogging-luigi-garlaschelli/","cat":"image_theory","title":"A New Hypothesis: Leapfrogging Luigi Garlaschelli"},{"author":"artscience","post":"Well I’m keen on getting workable hypotheses and at least one didnt seem to come within that category ( involving dubious heat flows in wrong direction)  but please go ahead and test, its always the best way as nature will often surprise us.Anyway I might have another hypothesis, but I need to find out from you (as you have access to Fanti’s paper about the 2nd image)…are we sure that 2nd image is also due to the same mechanism (ie the darkening of the outer sheath of the fibril). If it wasnt, perhaps if the linen were wet whilst touched on the  bas-relief, any impurities in the cloth or loose scorch marks would be steam blasted, where contact was greatest, through to the other surface, appearing as a faint image there (but not on outer sheath of fibres). I’m not sure if this is any better(making a mess of the blood stains as well), but it would perhaps explain why the internal material isnt darkened.","date":"February 19, 2012 at 7:00 pm","url":"https://shroudstory.com/2012/02/18/a-new-hypothesis-leapfrogging-luigi-garlaschelli/","cat":"image_theory","title":"A New Hypothesis: Leapfrogging Luigi Garlaschelli"},{"author":"artscience","post":"Colin, I even think, for your theory to work to sustain the exothermic reaction until it reacts all the way around the cylinder, it needs that cellulose have low thermal conductivity because otherwise the heat gets removed from your reaction zone. Still I like the theory’s ability to explain the “full on/ full off” image characteristics.","date":"February 18, 2012 at 4:06 pm","url":"https://shroudstory.com/2012/02/18/a-new-hypothesis-leapfrogging-luigi-garlaschelli/","cat":"image_theory","title":"A New Hypothesis: Leapfrogging Luigi Garlaschelli"},{"author":"artscience","post":"colinsberry :Methinks someone has forgotten the difference between heat and temperature, It’s not enough to have the right temperature. There has to be sufficient thermal capacity for the hemicellulose-coatings to be “ignited” – possible with hot backing sand, with ample mass, probably not with light cellulose fibres en route (but the latter can still conduct, as they do to high thermal capacity water in that trick with the bag.…Err, no. Your science is skewed again, Colin. For heat to flow from hot metal side of cloth to hot sand side of cloth, there has to be a temperature gradient, so if its hot enough to send facial information and pyrolyse onto  the sand side, its hot enough through the middle of the cloth to pyrolyse as well. So if metal is say 350 and sand is 300 and pyrolysis kicks in at 320…for the sand side to get a facial marking, it must have risen to above 320 due to heat flow from the metal side (and any cloth in between will be similarly scorched as due the temp gradient it must be above that 320 temp). So you are asking of your forger to not only be a superb artist, anatomist, historical expert but also a thermodynamicist capable of making heat go in the wrong direction from cold to hot. A tall order if I may say so!So though I like part of your theory, it only partially explains the Shroud image and I think it would also struggle with the blood markings as well. I know it a bit like asking you to gnaw off your own leg, Colin, but would you concede that the Shroud is not just a mystery to the gullible as your blog implies, its a puzzle to seasoned observers, sceptics and scientists as well?","date":"February 19, 2012 at 8:56 am","url":"https://shroudstory.com/2012/02/18/a-new-hypothesis-leapfrogging-luigi-garlaschelli/","cat":"image_theory","title":"A New Hypothesis: Leapfrogging Luigi Garlaschelli"},{"author":"artscience","post":"Still doesnt make much sense to me, Colin…One of the good things about your theory was that hemicellulose was exothermic, and so it had a good ability to self sustain once above the pyrolysis temperature.  But now you’re saying that though the energy supply through the thickness of material is enough to bring the sand interface up enough degrees to pyrolyse but its not enough to keep in pyrolysis any reaction inside the material (that should have some ability to self sustain in any case)? Remember that  the sand bed is still effectively a large heat sink relative to the pyrolysis temperature, more likely to keep the temperature of cloth next to it below pyrolysis. If the energy coming from the metal side is enough to raise this heat sink temperature sufficiently, then its enough to keep internal pyrolysis going.I am await your Plan B with anticipation.","date":"February 19, 2012 at 1:53 pm","url":"https://shroudstory.com/2012/02/18/a-new-hypothesis-leapfrogging-luigi-garlaschelli/","cat":"image_theory","title":"A New Hypothesis: Leapfrogging Luigi Garlaschelli"},{"author":"artscience","post":"“principles, so let’s not get too bogged down in the detail”Well thats the big problem is that the devil is in the details. Concerning Plan B, let me give a simplified model of what you mean (do tell me if this is not what you mean). Suppose for simplicity we have some simple image say shaped like a letter E, and replace the cloth by layers of paper. Then we get a darkened E shape scorched onto the top surface of first sheet of paper, and then this heats up more and re-radiates ir light, say through 3 more sheets of paper at the bottom of which is a black sheet of paper (representing the sandbed), that black sheet gets a bit hotter where a fuzzy image of the E would be, and that extra heat is enough to trigger pyrolysis on the back surface of the final white sheet (which has been kept at a temperature just below pyrolysis normally). Nice idea but with some big problems;1)the intervening light layers of paper who reflect much of the ir back, perhaps with multiple reflects giving a very fuzzy image2)the faint scorched E is only very faintly different from the rest of the paper so the temp difference is going to be very slight on the black sheet, and additionally during most of the scorching time there is even less difference.3)the black sheet (ie the sand bed unlike the metal) is hard to evenly heat, and ensure is just below pyrolysis (and we are talking about the days before decent thermometers)4)the ir heat that gets to the black sheet has to first heat this up (and we’re talking a heat sink of sand), before it can start to pyrolyse the last sheet.I’m not sure this is any better than Plan A, sorry.","date":"February 19, 2012 at 4:56 pm","url":"https://shroudstory.com/2012/02/18/a-new-hypothesis-leapfrogging-luigi-garlaschelli/","cat":"image_theory","title":"A New Hypothesis: Leapfrogging Luigi Garlaschelli"},{"author":"artscience","post":"Nice experiment, and easy to do, Dr. Lazzaro. Thanks.I suppose the next obvious experiment would be: how about heating the coin up away from the cloth and then place it down on the cloth for 1, 2, 3, 4,  5 seconds, then 10s, then 15s etc.  Getting a series of scorchingIt seems as though it should be possible to catch a partial scorch, no?","date":"February 21, 2012 at 5:14 pm","url":"https://shroudstory.com/2012/02/21/colin-berrys-idea-is-untenable-and-heat-cannot-produce-a-superficial-coloration/","cat":"image_theory","title":"Colin Berry’s idea is untenable, and heat cannot produce a superficial coloration"},{"author":"artscience","post":"I wasnt sure why they set the arbitrary time of 5 seconds, but I suppose to manoevre a big hot statue up and down might take 3 seconds minimum. Does the hemicellulose pyrolyse at a lower temp? I suppose you could try the minimum temp and say 3 seconds, see what you get.","date":"February 21, 2012 at 5:53 pm","url":"https://shroudstory.com/2012/02/21/colin-berrys-idea-is-untenable-and-heat-cannot-produce-a-superficial-coloration/","cat":"image_theory","title":"Colin Berry’s idea is untenable, and heat cannot produce a superficial coloration"},{"author":"artscience","post":"Good point, Deuce, though potentially you could have a cold pre-run to get the space in the sand ready (though that itself has drawbacks because the moment you have a prepared negative shape in which to sink into, you are losing any potential pressure differential against the cloth to get the features distinguished).","date":"February 21, 2012 at 6:46 pm","url":"https://shroudstory.com/2012/02/21/colin-berrys-idea-is-untenable-and-heat-cannot-produce-a-superficial-coloration/","cat":"image_theory","title":"Colin Berry’s idea is untenable, and heat cannot produce a superficial coloration"},{"author":"artscience","post":"Hi Dave, I do think your objections are valid and the creation of the shroud by means suggested with a life size bas relief does seem like the equivalent of mobilising entire US armed forces in order to kill a gnat, if we are to believe the reports of the gullibility of medieval people for relics! But as Colin mentioned that isn’t really a scientific objection, we just want to see could it be done with technologies available. The imprint characteristics hint more strongly to a scorch than any other approach, however I doubt that it FULLY explains the image like Colin is already claiming, but I do think it is worthwhile investigating to be sure the claims are robust to attack.  I agree that there is no other recorded art form of a similar type using heated statues, though there is an ancient art practised in many cultures going by the name of pyrography of creating burnt image art.!","date":"February 14, 2012 at 3:58 am","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","title":"Quote for today on why the shroud image is not a scorch"},{"author":"artscience","post":"Well  I cant take much credit for the term pyrography, though I must admit I’m quite a wizz at googling! And you are quite right that the Shroud is not very subtle in appearance when viewed with the naked eye, so that makes it all the more startling to find hidden in it information that would have been wasted on the medieval or modern unaided eye! So why the hell would a medieval forger  go to that elaborate extent to put that incredible detail in given that it wouldnt be noticed by his contemporaries? There’s a question you could pose on your shiny new blog, Colin if you are actually trying to find the truth about the Shroud (which I’m completely undecided about myself), rather than give the solace to those who have already decided that its a fake.","date":"February 14, 2012 at 3:08 pm","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","title":"Quote for today on why the shroud image is not a scorch"},{"author":"artscience","post":"colinsberry :@ArtScience“…said that God does not play dice”. No disrespect to one of the greatest minds of all time but…..That’s quite alright, Colin, no disrespect taken, but I certainly cant remember saying that, especially since I do actually play dice ;)But seriously, Colin, how on earth can you can yourself a rational scientist when every rational argument against your cause is either ignored or put down with some stupid remark (like using terms such as ‘so-called’,  witchdoctor, gullible or pseudo-science etc )? If just strikes me as totally dishonest. You might be too set in your ways to be open to argument.It reminds me of a quote by another great mind, Max Plank (one of Einstein’s greatest influences): Science advances one funeral at a time.Anyway, I hope that you carry on with your experiments because nature always seems to do a better job of convincing than humans do.PS by the way, Bohr had a nice retort to Einstein’s quote, something like:”Don’t you go telling God what he can and cant do”.  Though I might sometimes have similar thoughts to yourself regarding the nature of the Shroud, I think we should also bear in mind Bohr’s words.","date":"February 14, 2012 at 5:38 pm","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","title":"Quote for today on why the shroud image is not a scorch"},{"author":"artscience","post":"Hi Colin, actually I feel as though I rather under represented your words as you seem to sprinkle phrases like Mickey Mouse science (Adler’s work for instance), pseudo-science, and various other belittling put  downs rather liberally, and almost entirely without justification. But I dont want to get into that…I prefer to stick as close to the science as possible. Now going back to the birefringence problem, and Ray Rogers claims about the cellulose fibres in the image area retaining their birefringence and hence ruling out strong heat as the cause of the image. I’m not so sure now that I disagree with his conclusions….he has a paper that seems to show cellulose’s susceptibility to heat and radiation and the loss of birefringence….that loss seems to be permanent (he gives examples of ancient cellulose which bear birefringence marks of cosmic rays or radiation from radon). I think I remember you mentioning  something about the possibility of repair of this loss by active oxygen….can you give more details, so I can clarify this point, and determine whether we can hold on to this evidence or have to dump it. Thanks","date":"February 15, 2012 at 2:21 pm","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","title":"Quote for today on why the shroud image is not a scorch"},{"author":"artscience","post":"Of all the forgery theories the scorch one is the only one that bears a chance of being able to partly explain the image on the Shroud. However, to avoid the distortions in the image the underlying statue would have to be a bas relief (as has already been tested before by numerous experimenters but might be worth a revisit).  I also think it would have to be a low relief as well, because any bedding down movement might show as a blurring of markings. I think that rather than using a sand bed, instead a bed of dense but compressible wool, would help transfer the depth information into an increase in pressure of the linen against the hot surface (as I dont think the sand bed would be responsive enough to achieve a linear relationship between the depth and the pressure). The scorching on the top surfaces of fibres and the ability to scorch some fibres and not neighbouring fibres might all be down to pressure difference as Colin mentioned. I’m not sure whether that level of responsiveness in possible with a scorch image to give the subtlies in the Shroud, but some experimentation might give some indication of this. I disagree with Colin that just showing the principle is enough and the rest is arts and crafts – I spent many years working in transferring  theoretical results into workable technologies with sufficient fidelity ….sometimes its not possible. But I agree with Colin that I wouldnt be too confident about the UV fluorence results if you are not comparing like with like pyrolysis results (ie image and 1500’s fire pyrolysis results as they were created under different circumstance).  I’d like to see the proper report on this as it seems like an important result to establish. However I still think the bas relief method would struggle to explain the faint image on the other side of the head given that the fibres in between dont appear to affected. Also the blood patterns apparently being created before the image (how sure are we of this?) I’d like to see a comparison of the intricate blood and whip marks, to see if these correlate exactly as they are precise enough as markers – I saw somewhere some very faint images (only visible after image processing) of the leather parallel strip marks that lead towards the actual whip wounds – that was very impressive to me.  There are a number of other physical results I’ve come across whilst researching in only the last month that I found to be perplexing if you work on the hypothesis that its a fake, and thats not to mention some of the historical documents.  So I cant dismiss the Shroud as easily as Colin does.","date":"February 12, 2012 at 8:14 pm","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","title":"Quote for today on why the shroud image is not a scorch"},{"author":"artscience","post":"Hi Colin, glad you felt that way about the comment and wish you success on your new blog. I’d contribute if I felt you were going to be fair in admitting positive aspects to the pro-Shroud evidence where fitting, as well pointing out what the science seems to be saying, but I haven’t been encouraged so far by your sense of fairness nor actually your level of science (yes it was me who commented on your original blog about not being impressed by your claims of 3d from what looked like 2 level grey scale image, nor the claims of cellulose being a good conductor, when a moments thought about why one is able to hold a burning match, would say otherwise… A startling  omission from a biochemist … Makes one thinking about excommunication from the world of science for such ;) Joking of course!However if you were willing to put up with my thoughts and recommendations and my fuming against rabid sceptics like yourself (as opposed to enlightening refreshing scepticism) and a healthy amount of good natured humorous snipes, I’d be willing to join in and id like to see where the science leads and perhaps re-examine the uv data and also try and get a decent scorch print. Perhaps we might even get round to discuss the merits of Dutch group Focus!","date":"February 13, 2012 at 11:11 am","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","title":"Quote for today on why the shroud image is not a scorch"},{"author":"artscience","post":"” I’m afraid your attempts to switch the focus from cellulose to water do not stand up…” Well perhaps you are right, but not according to Wikipediahttp://en.wikipedia.org/wiki/List_of_thermal_conductivitiesand a couple other references I checked! In fact water has 10 times the thermal conductivity of paperWater – 0.56 W per m per deg KPaper – 0.05 W per m per deg KThe table seems to show that paper has one of the lowest thermal conductivities of the solids listed. On the face of it, it seems to be saying the exact opposite of what you are saying about cellulose….Care to comment on that disparity?But I suppose the really important question regarding your scorch theory ….the big gorilla in the room, is the lack of UV response in the image area as Barrie Schorwtz kindly points out. In science, it is important to try to not necessarily jump to conclusions….I dont know whether your scorch theory is correct or not… but the best guide we have is to see how well it fits the facts, or in the case where it doesnt, give a good explanation why not ( and with backing experimental proof). So for example, to help save your theory, could you suppose show that the scorch marks reabsorbs oxygen (or is it water?) over time in such a way that the image still remains in visible light, but  its UV response disappears (I doubt it but until you try, you never know for sure)","date":"February 11, 2012 at 2:20 am","url":"https://shroudstory.com/2012/02/10/the-image-on-the-shroud-of-turin-is-not-a-scorch/","cat":"image_theory","title":"The image on the Shroud of Turin is not a scorch"},{"author":"artscience","post":"My point was to show that the major effect in your paper bag experiment could be explained by the conductivity of water, not of cellulose (which was the point of your experiment….so it was a  false conclusion you drew from your experiment).I did not say that the conductivity of water was the only thing going ….I even mentioned perhaps its was the thinnest of the barrier that allowed sufficient heat flow to stop hotspots developing. So you are putting words into my mouth. Going on to the rubber balloon experiment, the tables show that rubber to have more than 3 times the thermal conductivity of paper, so though rubber survived the heating, you can not conclude paper (without being water saturated) would as well. So I think your logic is skewed as well as your science, and I say this kindly.  I left it an open case, in need of further checking. So to re-iterate, you got to be careful in science to jumping to conclusions.However the figures in the table fairly demolish your argument about cellulose being a good conductor, which was your main contention. But these are diversions….I’d like to  focus on the point about the lack of UV in the scorch images. BTW I am generally a sceptic myself but only really started to look at the Shroud following the Tom Chivers article in Dec. The one think that struck me is actually how good some of the Shroud research and evidence is….I’ll most probably remain a sceptic, but more out of habit after 40 years in physics, its my mindset, but I’m honest enough to admit that the Shroudies seem to have the upper hand and pretty good evidence. I’m particularly impressed by the correspondences in the Hungarian Pray Manuscript, which I note you dismissed with some remark about the need to show puffs of smoke if its a set of burnt holes – that’s ridiculous (you assume the artist believe it ignited at burial?), it made me laugh out loud, I thought to myself “Here’s a man who really knows how to shoehorn data to fit his worldview”.  I do think the Shroudies have a point in saying that the sceptics avoid dealing fairly with the data, and claim too easily “Eureka, I’ve done it, I’ve shown the Shroud to be a fake” though missing much of its characteristics. Science has to be sceptical but also fair.","date":"February 11, 2012 at 5:31 am","url":"https://shroudstory.com/2012/02/10/the-image-on-the-shroud-of-turin-is-not-a-scorch/","cat":"image_theory","title":"The image on the Shroud of Turin is not a scorch"},{"author":"artscience","post":"sciencebod :“The only (my italics) conclusion possible from these observations is that the Shroud image is NOT the product of scorched or heated linen.”I would just leave you with the thought that cautious scientists learn, often the hard way, to distinguish between experimental evidence that is suggestive rather than conclusive, and to avoid giving ‘most favoured’ status to findings that just happen to fit with preconceived notions….…Errr, like claiming 99.9% certainty of it being a fake based on some very basic experimentally suggestive scorch data! I wouldnt call your experimental results conclusive at all…sorry, you really need more work on it to prove the case.  Science cant be so slap dash!","date":"February 11, 2012 at 6:08 am","url":"https://shroudstory.com/2012/02/10/the-image-on-the-shroud-of-turin-is-not-a-scorch/","cat":"image_theory","title":"The image on the Shroud of Turin is not a scorch"},{"author":"artscience","post":"Isnt that a case of the bag getting damp and the water being a good conductor as well? Or that it is sufficiently thin that heat can get through at a fast enough rate to stop hot spots forming….you can do the same experiment with a rubber ballon and water (though I never took it to boil point…the kids were too bored after 15s!). But, if as you claim cellulose is such a good conductor as well, wouldnt the heat then more easily get through to scorch more than 200nm?And I still cant understand how your thermal model would give the faint image on the other side of the same cloth. Perhaps elaborate that part of your theory more, so I can get a proper understanding of it as it does have many pluses in its favour, but also some minus as mentioned by Dan above.  You mentioned somewhere about the lack of UV fluorescence as not problem…I wasnt clear why, perhaps expand on that as well.","date":"February 10, 2012 at 5:19 pm","url":"https://shroudstory.com/2012/02/10/the-image-on-the-shroud-of-turin-is-not-a-scorch/","cat":"image_theory","title":"The image on the Shroud of Turin is not a scorch"},{"author":"artscience","post":"Hugh Farey :The secondary image on the back side. Well yes and no.Fanti and Maggiolo did a lot of deconvolution of some photographs of the back side, and managed to derive a faint correspondence of the hair, moustache and nose, an even fainter correspondence of the hands area, and nothing resolvable from anywhere else. Given that the ‘normal’ image is entirely superficial, they assumed that the ‘back’ image was also entirely superficial, and consequently that the fibres between the two images did not carry the image through. They also show that the image on the back is not due to the frontal image “showing through,” as it might if it were much darker. They do not describe the back image as ‘smaller’; the correspondence of the bloodstains (which appear clearly) is accurate. They do describe it as having some slight differences from the front (specifically the nose appears more symetrical).Hi Hugh, I notice that you are that relatively rare breed of being a physicist interested in investigating the shroud (as am I but without much time to spare) and you seem to know about Fanti’s back image. I was intrigued by this back image as my favoured theory (scorching) didnt easily fit with this nor with the claim that the blood stains seem to have come first. How certain are the claims that this back image has no intermediate image in the  fibre strands in between and likewise for the blood stain having no body image beneath them.Also I noticed a little while back you had some experiments questioning the validity of the fluorescence claims though I wasnt sure what the conclusions were. I’d be grateful for a summary if you have the time. Thanks","date":"December 30, 2012 at 2:38 pm","url":"https://shroudstory.com/2012/10/21/thibault-heimburger-now-i-know-for-sure-that-the-ts-body-image-is-not-a-scorch/","cat":"image_theory","title":"Thibault Heimburger: Now, I know for sure that the TS body image is not a scorch"},{"author":"artscience","post":"Thanks for that, Hugh. You seem to be having fun with your experiments! … I have images of the HeadMaster of your school returning after the Christmas break to find you’ve turned his boiler-house and science labs into a scene from Silence of the Lambs as you search for putrescine (is that a substance/chemical for real?)Also donkey’s years ago, I first heard of the Shroud via the Dean of my college who so happened to be Rev John Robinson, but I didnt really follow it until last Christmas and wondered why the uncertainty about it hadn’t been resolved one way or other over the intervening years. One of my interests over the years has been artistic techniques and trying to unravel how various artists created their astonishing works. So I started to look at the Shroud from that perspective whilst taking in the information that seemed to indicate an earlier than 1300 date (much of it mildly persuasive). Without carrying out experiments its hard to know for sure but it did seem to look like a mild scorch. To get the projective image it had to be either contact with a flattened plate or something like Roger’s theory (I’m not sure about Fanti’s discharge theory nor the seismic discharge theories either as neither seemed to be have appropriate directionality). My problem with Roger’s theory is 1)resolution 2)turbulence and 3)being gravity dependent it only seemed to work for the upper body image, as I can’t see how the warm gases could move downwards. Its great that you are at least experimenting with some aspects of possible image formation mechanisms.So am I to take it from your experiments that it might be possible to scorch and the fluorescence might be masked or will it always show? Thanks","date":"December 31, 2012 at 7:12 am","url":"https://shroudstory.com/2012/10/21/thibault-heimburger-now-i-know-for-sure-that-the-ts-body-image-is-not-a-scorch/","cat":"image_theory","title":"Thibault Heimburger: Now, I know for sure that the TS body image is not a scorch"},{"author":"artscience","post":"Thanks for that reference Anoxie as I’ve only really skimmed through Roger’s theory. I’ll have to read it in detail….but by mean free path is he saying the image forming gases diffuse randomly, and the darkness of the image due to any particular path is inversely proportional to distance gone (or some such like mechanism)?","date":"December 31, 2012 at 8:12 am","url":"https://shroudstory.com/2012/10/21/thibault-heimburger-now-i-know-for-sure-that-the-ts-body-image-is-not-a-scorch/","cat":"image_theory","title":"Thibault Heimburger: Now, I know for sure that the TS body image is not a scorch"},{"author":"artscience","post":"I think normally gold leaf is applied to a surface that is first covered with size (animal skin glue). So any fiddly details that have to done (eg illuminated lettering) is usually done by brushwork of the size glue and when dried to a suitable level of tackiness, the gold leaf is laid down and any excess not adhering to the size underneath is brushed off easily. The point being is that the size is not particularly thin, even if the gold leaf is. However one could argue that size might be diluted down very thin, so when it dries it becomes a thin layer. Which leads on to what I remember of Ray Roger’s theory that about the image layer (forgive me if my memory serves me wrong and please correct if you know better):1)the linen material was washed in some liquid for softening (cant remember exactly the reason), and left to dry.2)the water dries from both the front and back surfaces of the sheet, transporting the solute material (within the water solvent), to the upper most parts of the threads where evaporation is greatest, and slowly leaving the solute residing on the top creasts of the threads. This explains the thinnest of the image layer and its apparent appearance mainly on the creasts of the upper most sub-fibres. Apparently this layer can be removed by scraping or adhering to tape.3)Ray then proposed another theory regarding the image formation onto this thin layer by the Maillard reaction caused by vapour given off by a decomposing body (which apparently heats up causing some sort of convention current) within a very still air cavity. This seemed a bit more wacky to me as it didnt seem to have the necessary resolution, but then I remember from my josh stick days that whilst studying in a very still room, I was astonished to see a thin vertical line of smoke extend at least 20 cm from the burning stick before turbulence set in. Ray apparently have done some tests on a heated hand manikin and got encouraging results before he pass away. 4) the vapour also permeated through the cloth and again was able the react (less strongly), with the solute material again residing on the thread crests of the other side of the cloth (hence explaining the faint other image). 5)though I dont think this explains the bottom image ( as the convection currents work in wrong direction) unless that is all due to surface contact. Nice enough theory…worth further investigation to see if it has any more mileage","date":"February 8, 2012 at 6:52 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","title":"Why do we think the Resurrection was a process? What if it was not?"}],"misc":[{"author":"artscience","post":"“small step to infer” ….not so sure as you….but certainly worth chasing up the idea.  I don’t know about Veil of Veronica (is this same as The Manoppello Image?), but are you saying that the Shroud was someone trying to do one better i.e. full body image and trying to look like a sweat imprint. Maybe.But then why all the crazy detail invisible to the eye and only appearing on image enhancement?I wish we had a list of all the definitely know facts about the shroud (e.g. 3d info, are there whip marks invisible to eye yet appear on image enhancement, the blood serum images real) as oppose to wishful thinking facts (e.g. coin details over the eye that no one else can see).Sorry Colin, though I admire your attempts to get further with this (and I don’t discourage you from pursuing it), at moment the fake sweat imprint theory is still just a good guess. Do you know if it was early on described as a sweat imprint if that was what the creators of this image had in mind? Earliest mention seems to say it was a painting (though perhaps thats was just a generic term for image on canvas)","date":"November 22, 2014 at 4:16 pm","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","title":"Second Annual Bertrand Russell Award in Sindonology"},{"author":"artscience","post":"Hi Charles, though Colin’s scorch using a low relief does have the advantage of encoding 3d data into the image. I can’t see how your flaked painting theory can produce this at all unfortunately. As I mentioned previously, going with your shadow theory, there might be a mechanism by which dark pigments produced greater of a shadow than light pigments and so giving a negative image on the linen (which is different to the Zittau Veil – that being a faded positive image from what I can make out) but I can’t see a mechanism to encode 3d information.","date":"November 23, 2014 at 8:27 am","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","title":"Second Annual Bertrand Russell Award in Sindonology"},{"author":"artscience","post":"hi Colin, yes I sort of gave up around that time over 2 years ago though occasionally drop in to see what new developments were happening. I think it was soon after the Italian scientist did the coin scorch demo and said how difficult it would be to get it uniform, I could see that having a roller contact at a constant speed running up the length of the shroud would enable a sort of uniformity of imprint (note however that the contact pressure varies according to the contact size and smaller areas like head and feet, ankle might then produce a darker image….I know the head is darker but not sure of the others). I couldn’t figure out how all the other details appeared on shroud and being busy normally didn’t give me time to write up properly.Colin, do you know of any brass rubbing plates that have say the subtlety of modelling for the person of say a coin? Most seem to be binary (raised or depressed levels), and linear (i.e. clearly outlining figure and anatomical details)….these would not be appropriate for giving the subtlety of the shroud.","date":"November 22, 2014 at 1:27 pm","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","title":"Second Annual Bertrand Russell Award in Sindonology"},{"author":"artscience","post":"“there’s scarcely any written record regarding the TS in the mid-14th century, apart from the irate letters from the local bishop asserting it was “cunningly painted” and a forgery”I suppose that was my point is that it is first described as a painting say around mid 1300s not as a sweat print as you say the creators intended. Then 250 years later its described as having sweat and blood (not necessarily as you say being formed of sweat and blood), but I can accept that it does look like sweat and blood.Are you saying that the phrase “cunningly painted” hints that it is not an ordinary painting involving pigments? Maybe","date":"November 23, 2014 at 4:24 am","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","title":"Second Annual Bertrand Russell Award in Sindonology"},{"author":"artscience","post":"Hi Colin, I can’t remember exactly the instance but yes sorry if I   came across as defending pseudo-science (which I don’t, though I distinctly remember that you did have an awful way of rubbing people up the wrong way unnecessarily, so perhaps I was pissed off enough as to contradict you …hehe! ) ….but additionally I did feel at the time that the shroud needed more than a dismissive “its just a painting/scorch” which seemed to me to be sloppy science. Follow up data is necessary. You have shown through your persistence that you like myself are not willing to settle at that explanation without some sort of physical/chemical mechanism backing that claim. The scorch imprint theory initially had some problems but I think I have some solutions to them. I’m not sure if my ideas are right but they might explain some of the markings on the shroud. Testing is important of course.","date":"November 22, 2014 at 3:22 pm","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","title":"Second Annual Bertrand Russell Award in Sindonology"},{"author":"artscience","post":"BTW why did you thing I was Dutch? I grew up in South America but educated at same college as the guy in this award named after and it also appear Charles Freeman also.","date":"November 22, 2014 at 1:38 pm","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","title":"Second Annual Bertrand Russell Award in Sindonology"},{"author":"artscience","post":"Concerning Bertrand Russell….I’d think he’d be aghast to know that his helpful insights into the Kennedy Assassination has given birth to a worldwide industry of obfuscation and conspiracy theories. There’s a fictional short story by writer Will Self called The Quantity Theory of Insanity, that makes a claim that there’s only some much rationality in the world and if you try and become more rational in one place, elsewhere there is a plague of irrationality. Its fiction but I sometimes think there’s a nugget of truth in it. Industrialized, rational countries seem to be plagued by conspiracy theories, mental problems, ufo sightings (I had one on a beach in Brazil but it turned out to be an controlled explosion in the upper atmosphere).I haven’t really followed Colin’s latest of many theories but there is a nice playfulness about them that keeps me amused and perhaps coming in from a different perspective you get a new insight….I don’t believe them but then I also don’t believe in Newton’s biblical ramblings but he was highly rational in a couple other fields.","date":"November 22, 2014 at 3:25 pm","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","title":"Second Annual Bertrand Russell Award in Sindonology"},{"author":"artscience","post":"Hi Charles, interesting about the section widths of Veil and Shroud corresponding to medieval loom.At a quick glance you might be taken in by the sepia tints to think its similar to the shroud, but one immediate difference is the shroud is negative (normally light tones are shown dark, and vice versa). The veil just looks like typical first layer of “blocking in” areas in thinned tones (normally umber but I’ll take your word for it red madder) as the first stage There’s an unfinished Leonardo, the Adoration of the Magi, that shows some of this blocking in but at a more developed stage. If you look at the less developed figures you see this tonal blocking. Normally the blocking in is done in relatively flat tones within a well define outline, with very little modelling and thats what I seem to see on the Veil Is there a close up of the Veil anywhere to see if you can see the gesso itself as distinct from the linen? From the close ups I’ve seen of the shroud there doesn’t appear to be any such gesso on the fabric, the image making darkening is directly onto the outer facing surface of the fibrils themselves. The other aspect that is different is that the veil image is linear – i.e. there is a distinct outline  whereas the shroud shows no such outline whatsoever http://www.sachsen-tourismus.de/en/service/points-of-interest/poi/poi/kulturhistorisches-museum-franziskanerkloster-small-zittau-lenten-veil-zittau/In fact this one aspect of the shroud makes it distinctly different from all medieval painting that I know of and I’m surprised more hasn’t been made of this point in the shroud literature.Most painting techniques until the modern age, starts with the line, defining an outline, which is then filled in, first with thin layers and increasing fatter layers of paint. The shroud image shows very little evidence of a linear boundary between forms e.g. between the body and the background, or even the fingers where they should be most evident. Instead the shroud has a blurred boundary between forms indicating that it is not created by a conventional medieval painting technique.","date":"December 6, 2014 at 8:02 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"}],"opinion":[{"author":"artscience","post":"Well I did give my rival steam hypothesis, assuming scorching was the only game in town (which it might not be), but it was as much rubbish as yours. Anyway go ahead and test then, its just that I fail to see how a very faint image is expected to re-radiate giving infra-red strong enough 1)to go through the intervening reflective threads and heat up the sand on the other side strong enough to pyrolyse an image there  2)whilst standing out from the already over strong infra-red already coming off from the bas-relief. I think you know this is also pie in the sky…","date":"February 21, 2012 at 12:33 pm","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","title":"Image by scorching heat? Or science by hot air?"},{"author":"artscience","post":"I’m sure heat and ir are gonna get through! That’s not the problem, but will it get through whilst not pyrolysing the intervening fibrils, in sufficient amount to heat up the sand, in such a way as to distiguish that bit of sand from the rest of the sand which is already being bombarded by ir straight from the metal! I don’t think I’m getting through to you, am I?","date":"February 21, 2012 at 1:03 pm","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","title":"Image by scorching heat? Or science by hot air?"},{"author":"artscience","post":"And what the heck is secondary thermal effects and how does this explain the colouring in furrows, striations, and continuation of pattern across to separate threads?","date":"February 21, 2012 at 12:50 pm","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","title":"Image by scorching heat? Or science by hot air?"},{"author":"artscience","post":"colinsberry :I do think you have to (attempt to) refute the idea of scorching by direct contact at a more general level, if you don’t mind my saying, and not try to conjure up killer arguments that depend on speculation about the incidental details.I think you misunderstand me, Colin. I actually think the theory has potential and so like any good  scientist I want to become my own worse critic and find any possible flaws…I want to be able to see problems and have answers to them, or if need be readjust my views  (which are always a bit in flux until I really feel as though I’ve nailed it). This approach has made me re-adjust a couple of times….most notably with the Hungarian Pray Manuscript which I cant see really how any honest scientist cant be at least willing to put a question mark over the C14 dates.A straight out question to you, Colin….arent you just a teeny weeny bit disconcerted by the Hungarian Pray Manuscript? An itsy witsy bit maybe? I think we’re alone here, you can just whisper your answer in my ear ;)BTW even if the Manuscript were taken on face value, it could all be done with a bas-relief still (just added that in to allow  some face saving!)","date":"February 21, 2012 at 7:06 pm","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","title":"Image by scorching heat? Or science by hot air?"},{"author":"artscience","post":"colinsberry :  And if he had been so keen to incorporate details from the Shroud for the sake of authenticty, why did he not show the nail hole in the wrist, the blood trails on the forearms, the pierced side etc etc.….and here’s a little clue for you, Colin…an illustration is not a photograph. We already know in the gospels that Jesus had been nailed and then pierced with a lance….and its not shown on the body illustrated…does that imply its not Jesus being illustrated. Nope, it means that artists dont put in everything, especially when somethings are a given as understood….making it all the more striking why include the details like the poker holes and the blood on the shroud and herringbone pattern, plus illustrate a Jesus naked and with crossed hands with missing thumbs (never before seen in christian illustration).Sorry Colin, you give all signs of being from the raving bonkers school of scepticism, which refuses to admit anything at all to the other side (btw arent you glad I established that cellulose has a low conductivity inspite you resisting like I was extracting teeth from you without anaesthetic…cellulose having a low conductivity might help explain why there is only surface scorching that doesnt penetrate into cellulose)","date":"February 22, 2012 at 5:17 am","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","title":"Image by scorching heat? Or science by hot air?"},{"author":"artscience","post":"I’m at work at moment so dont have time to address this properly, but I found Fanti’s paper that I think Colin got the information about the nature of the image and the hemicellulose.http://www.ligklaedet.dk/images/SUPERFICIALITY%20published%20JIST.pdfIn the paper Fanti et al goes out of his way show (in Figure 7), that the image have many characteristics that dont seem to tally with the contact theory.In particular coloured fibrils going into furrows (not just being on the crests of the threads as was implied). Other peculiar aspects like abrupt striations (interruptions of the colouring) on many parallel fibrils, and the continuation of a colouring pattern across separate parallel threads (with a gap between), make the fuse wire theory struggle a bit there. I think the biggest problem is the double image on the other side, which Colin made two very lame attempts to explain, but to my mind are totally inadequate for the job. Fanti also dismisses another explanation that perhaps the image wraps around along the fibrils to the other side.Personally I’m still keen on the theory as it has the possibility of accounting for some but not all of the characteristics. However unlike Colin, I am not willing to ignore data that doesnt fit in with the theory (that it is what I also call being in denial!), and I dont think its enough to say its done and dusted until experimental proof is furnished.","date":"February 21, 2012 at 6:27 am","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","title":"Image by scorching heat? Or science by hot air?"},{"author":"artscience","post":"Colin, I think again you are doing your normal rant and not addressing the problems with the theory. Again try the second image on the back…is that a secondary thermal effect as well?Explain.","date":"February 21, 2012 at 8:58 am","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","title":"Image by scorching heat? Or science by hot air?"}],"resources":[{"author":"artscience","post":"I’m a bit confused as to Martin Kemp’s (and others) attribution of the style to Byzantine or Medieval, as I cant think of a single example of a painting in either style that do not have strong linear outlines (unlike the Shroud appears to have no such outline anywhere I can detect). Perhaps Martin Kemp’s attribution of the style is due to the thin limbs etc. but surely that is more an artifact of there being no outline, so it being hard to determine how fat are the limbs.","date":"January 19, 2012 at 5:54 pm","url":"https://shroudstory.com/2012/01/18/new-book-christ-to-coke/","cat":"books","title":"New Book: Christ to Coke"},{"author":"artscience","post":"Max, Well I’m not completely won over by conspiracies of thought brought about by being in one institution or another but being a graduate of the other institution, I’m willing to believe anything of Oxford Uni (joking!). But seriously, having a physics  background, I tend to believe the C14 normally correctly dates a sample … but I’m stumped as to why the various labs arent scratching their heads when the Hungarian Pray Manuscript (1195) tells them that something must have gone wrong in that date ie that perhaps they have correctly dated an unrepresentative bit of cloth, either that or the Pray Manuscript is incorrectly dated.  The Pray Manuscript also blows a hole in the story quoted by Martin Kemp about Henri de Poitiers attesting (<1389) to having met the artist who created the shroud as the artist would have to be close to two hundred years old to still be alive. A proper scientist or art historian would try to sort out this extreme contradiction, and not just stick their head in the sand.  But what I find disappointing about Martin Kemp's remarks (bearing in mind that Martin Kemp wrote excellent books about optics and art techniques and collaborated with David Hockney with investigating the possible and speculative use of the camera obscura in shaping art history) dismissing the object as being of painterly origins \"however it was made\". For an art historian, who has specialized in trying to work out how various paintings were created, to add those last dismissive words to an object that defies proper explanation by even the most ardent skeptics is a bit lame. Maybe that wasnt necessarily his intent ie to dismiss it, but perhaps he should have at least noted that of all the pictorial objects of virtually any era, it is the most baffling (and I say that without necessarily going along with the religious element). The Shroud of Turin stands out of the normal cannon of representational art, there is simply nothing that comes remotely close …and that should set art historians alive with excitement and not to just give the party line that it must be of painterly origin.","date":"January 20, 2012 at 7:51 pm","url":"https://shroudstory.com/2012/01/18/new-book-christ-to-coke/","cat":"books","title":"New Book: Christ to Coke"},{"author":"artscience","post":"Well, Max, thinking about it, you do have a point…if I were associated with a particular university and I heard that our guys down the road in  such and such department proved this or that, I’d tend to give it more weight than otherwise, particularly if its a reputable university. We also know that most institutions, even reputable institutions can be hard to change their minds or even open their minds to the possibility that they might have gone wrong somewhere….way too embarrassing. To me it seems clear that earlier references to the Shroud, particularly the illustration in the Prayer Manuscript, shows Oxford, Arizona, and Zurich are right to attribute the date band to the samples they were given but wrong in attributing the date band that they did to the entire shroud, unless those dastardly cunning medieval minds also invented a time machine as well. As a physicist, I’d say the problem lies in finding a mechanism that would explain the discrepancy. That is really hard to do without further testing, so Turin would have to be more flexible there to resolve this.","date":"January 22, 2012 at 6:22 pm","url":"https://shroudstory.com/2012/01/18/new-book-christ-to-coke/","cat":"books","title":"New Book: Christ to Coke"}]}
