{"art":[{"author":"ashlee","post":"I just stumbled upon this site after reading Heaven is for Real and then googling Akiane as a result. I also had the same reaction at first to that painting titled “The First.” It bothered me as well and turned me off. Then I thought about it some more with a different perspective. For one, yes, they look like a young couple, perhaps teenagers, or they could also be in their young 20’s – either way, I questioned “perhaps they are just married and it was their first union?” God does condone and encourage sex after marriage and it is a beautiful union. Whether she meant the painting to portray that or not, I do not know. She left it up for all of us to create our own story – as adults and humans, sadly our thoughts will wander first to the worst…but maybe that is not how this painting is. Or maybe it points out to us how negative we can be in general and maybe we should think good, heavenly thoughts first instead. Again, I don’t know how she meant it. It is just a different perspective to consider – and it is the one I am choosing to accept :)\nWIth that said, I have only just started looking at her gallery on her site. Someone on here mentioned how she seems to be too universal in her thoughts on other religions and wanting them all to come together. That would bother me too, since I believe that Christ is the only way. However, I have not thoroughly gone through her gallery to come to my own conclusions on her beliefs. Regardless, I do believe that God has given this child a wonderful gift and He is using her for His purpose in some of her paintings. We are all human however and therefore not perfect. I believe this child should be prayed for that she does understand that Christ is the only way – and that she will be protected from once atheist beliefs, etc.\n\n","date":"August 31, 2011 at 1:40 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
