{"researchers":[{"author":"bbv_publishing","post":"What I fail to understand is: Why do people “fear” the authenticity of the Shroud so much. I know that the study of human behavior shows, with continuous denial, there is a sub-consciousness occurrence taking place. I surmise that the misinformation created by the media is strongly involved with creating this manifestation. As Barrie Schwortz stated in his presentation at St. John’s University, the media has misinformed all of us so that this story can continuously be sensationalized and produce profits. If the media reported the facts, this story would no longer be debated.\n\n","date":"March 2, 2014 at 3:20 pm","url":"https://shroudstory.com/2014/03/02/jones-the-turin-shroud-is-authentic-get-over-it/","cat":"other_blogs","title":"Jones:  The Turin Shroud is authentic. Get over it!"}],"events":[{"author":"bbv_publishing","post":"Dan, thanks for the confirming reply about Barrie Schwortz. \nL.J. c/o BBVpublishing \nOn Tue, Jan 27, 2015 at 8:25 AM, Shroud of Turin Blog  wrote: \n>    Dan commented: “L. J. Williams wrote: “Then when the presentation > concluded, time and space seemed to have stood still. This attribute can > only describe presentations that are professional, exciting, intriguing, > joyous, serious, factual, casual and astonishing.” I hav”   Respond to > this comment by replying above this line >       New comment on *Shroud of Turin Blog * >       > > *Dan* commented >  > on Barrie Schwortz’ Lecture Schedule for 2015 > . > > >  in response to *Dan*: > > With the latest update to shroud.com, Barrie Schwortz has published his > lecture schedu\n\n","date":"January 30, 2015 at 2:13 pm","url":"https://shroudstory.com/2015/01/26/barrie-schwortz-lecture-schedule-for-2015/","cat":"lectures","title":"Barrie Schwortz’ Lecture Schedule for 2015"}],"resources":[{"author":"bbv_publishing","post":"Hi Dan, John,\nJohn, we met at St. John’s University in February, when Barrie Schwortz gave his presentation. My degree is in Environmental science. Perhaps I can assist with certain facts and details for your chapter “The Apocalypse of Selfishness.”\nBest wishes,\nBill, GTG\nhttp://www.goingtruegreen.com\n\n","date":"April 5, 2014 at 2:24 pm","url":"https://shroudstory.com/2014/04/05/the-extinction-of-humanity/","cat":"books","title":"The Extinction of Humanity?"},{"author":"bbv_publishing","post":"Check out the Historical Novel: Upper Room, The Way: 33AD to 57AD. Explains several very obvious reasons why the Gospels don’t have information on the shroud’s image. TY\n\n","date":"June 16, 2014 at 2:57 pm","url":"https://shroudstory.com/2014/06/16/warning-the-sunglasses-will-win-you-over-as-the-old-fart-rants-about-the-shroud-of-turin/","cat":"video","title":"Warning:  The Sunglasses Will Win You Over as The Old Fart Rants About the Shroud of Turin"}]}
