{"art":[{"id":"comment-3392","author":"beth","post":"Wow this is great to read. Colton story sounds a lot like the ones i have had. I have been really sick over the last 5 years and the Lord has been so faithful. It’s all real. I am blessed to have read this book.","date":"2011-07-24","mins":"1:58 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3400","author":"beth","post":"Does the book change how we live after we read it? or do we just read another book? i’m pointing at me and i know it takes Jesus changing me (us) but how willing are we (am I).","date":"2011-07-24","mins":"11:45 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-4344","author":"beth","post":"I read “Heaven is for Real” and LOVED it! I was so moved by this little boy’s story. When I was a young teenager, my life was a mess (divorced parents, abusive father who I lived with) and I just wanted out of life. My dad used the old fashioned razors, the kind that you had to replace old, dull blades with new, sharp ones. I took one of the new ones and got into the tub. While crying and shaking, fed up with life and what I had to go through and just wanting to be done with it all, I drew the blade over my left wrist. Suddenly felt a hand close over my right hand stopping me. In that one touch I felt such love and compassion and understanding! I knew instantly who it was – JESUS! I didn’t see Him clearly but I definitely heard Him clearly. He said “Don’t. I love you too much! Call your mother. She is the answer.” Then my right hand was lifted up and made to drop the blade on the floor. I immediately started to cry harder and looked to see Him. Again, I didn’t see Him clearly but I knew, I KNEW it was Him and that He loved me and wanted me to live. I felt such love and peace! Needless to say that I got out of the tub, called my mother (who lived about 4 states away) and the wheels were put into motion to save me, in so many ways. Thank YOU Jesus!!! When I look at Akiane’s painting of Jesus, I feel like I’ve seen that face before, but I’m not certain where. I believe her painting is of the face that I couldn’t see clearly enough that night. I can’t be certain, but it just feels right, you know? I get such a calm and peaceful and loving feeling when I look at the painting..","date":"2011-10-25","mins":"10:08 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}],"events":[{"id":"comment-171784","author":"beth","post":"Sure. How do I get ahold of you.","date":"2014-11-17","mins":"9:39 pm","url":"https://shroudstory.com/2014/10/30/shroud-expo-to-open-in-san-antonio/","cat":"exhibition","title":"Shroud Expo to Open in San Antonio"}]}
