{"art":[{"author":"blessed","post":"My 4 year old told me about a year ago that she has “friends” that fly. When I asked her to tell me about them, she told me that they fly down to earth (earf at the time she was 3, lol) She would always talk about them to me and to to them in front of me. There are 2 that she talks about alot, a male and a female. I never took her to church or school or a babysitter. So one day I was brushing her hair and she was talking to her “friend”, I allowed her to talk to her freely as I had brought this up to her doctor and I was told not to discourage her so I didnt. So anyway, I asked her, If your friend can fly and she has wings then she must know  Jesus right? (by the way, both of her friends have names and when I researched the names they were of Hebrew decent). So my daughter whips her head around and tells me, Yeah! She know Jesus. So being that she was 3 and I never talked to her about him because I didnt think a 3 year old would be able to comprehend and at the time Jesus sadly wasnt the topic of our discussions. So I asked her who he was and she told me he was on wood. So I asked her why was he on wood and she told me because he saved the world. Long story short she could tell me everything in detail about he crucifixion from when he was beaten to when he “walked away” from his “cave”. She even describe how there was alot of blood. I cried for about a week after this. I felt like I was started to doubt in God and it makes me feel guilty that this had to happen for me to have faith. Now that she is a little older she can describe what happened. She still talks to her “friends” and tells me that she sometimes dreams of something and then it comes true. I asked her what she meant and she told me she had a dream about her friends and that they came true the next day. They took her to “Jesus’ world and thats where she met Jesus and was shown the story of Jesus’ crucifixion. One thing that stuck out about Jesus was that she says he has blue eyes. I would never try to exploit her in any way. I just know it has change my perception (and my families too) on everything. I dont doubt anyones story :)\n\n","date":"March 30, 2012 at 6:18 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"blessed","post":"Have you tried asking him what they look like or what they say to him? I had this issue too with my daughter and I posted my story up above. I was scared at first too until my daughter described them to me and told me what they say to her. Only good things. One thing that my daughter told me was that my Grandpa lives in the sky and that she missed him. I never told her that he passed but she already knew from her “friends”. She was 3 at the time also and still to this day talks and plays with them.  :)\n\n","date":"March 30, 2012 at 6:35 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
