{"art":[{"author":"c_c_low","post":"So many people here have related their personal experience of either having a vision of Jesus or be in his presence that I feel compelled to add my own experience too, but not so much as to lengthen the catalog list on them, but rather to let readers out there know that there is another dimension when such experience happen, and this is the dimension of emotion which most of the accounts do not relate upon. I can tell you that when you are in his presence, suddenly your mortality shows and it is not joy that immediately surfaces as one would think it does. Let me relate my own experience.\nSometime back in 1985 I was feeling very despondent due to an incident and on one particular night it took me quite a while to come to terms and then having fallen asleep a had a very special “dream”. Although I was not a staunch and regular church-going Christian, to my surprise in my dream I was evangelising for Jesus to a non-believer and was in the process of explaining to him who Jesus was when suddenly the scenerio was changed to be in my bedroom (I lived at an apartment on the 7th floor at that time) and looking out of my window suddenly the vision of Jesus appeared, at first floating outside my 7th floor bedroom window and then floating towards my window. Immediately I cried out to the non-believer “Look our Lord Jesus is right there!”, upon which Jesus flew into my bedroom. Immediately I woke up literally finding myself sitting on my bed with cold sweat dripping all over the body. I realised I was trembling in fear and in awe as I never ever expected to have such a dream.\nThe next few minutes my head was spinning with so many wild thoughts over this surprise “visit” to the stage that I was even wondering whether it was a dream or not and why I had arisen from my sleeping position to a sitting one immediately at the point of Jesus’ entry from the bedroom window. It took me quite a while to take control over my visibly shaken emotional self.\nAfter that experience I asked a lot of my friends and colleagues as to whether anyone of them had ever experience having a dream about Jesus and the answer was none. I then realised that very few people actually ever dreamed of Jesus or having a vision of him as the case may be. I was one of the few who had the privilege of having the experience of his presence and I am very thankful for that. I have had several other experiences involving what people would term as intercession of a “guardian angel” which I would not want to relate here because I am not proud of the actions of mine which required the saving grace of my “guardian angel”. What I can say is that most people who term the spiritual being as “guardian angel” is grossly mistaken.  I think that it is actually Jesus who is that very “guardian angel” that people speak of.\n\n","date":"June 19, 2013 at 5:50 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
