{"art":[{"id":"comment-19160","author":"cass","post":"Actually, Jesus was a Jew. Jews aren’t black. Tan maybe, but not black.And if I’m not mistaken, the reason we have different colors of skin and speak different languages is because of the Tower of Babel incident in Genesis..","date":"2012-11-17","mins":"5:01 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-19163","author":"cass","post":"Jesus himself said “I am the way, the truth, and the life. No one comes to the Father BUT BY ME”. If you look closely at all religions you will see how they contradict each other. For example, Christianity says you have to accept the free gift of salvation through Jesus by trusting and walking with Him rather than trying in vain to earn your way to Heaven by somehow being “good enough” (which is impossible because we have all fallen short multiple times). Nearly every other religion says that you have to do A B and C to hopefully earn your way in. Chip Ingram (pastor of Venture Christian Church in Los Gatos, CA ) wonderfully putts it this way: all other religions are about having to “do” something, whereas the truth of Jesus is that it has already been “done” for you… you just have to choose to receive it from Him. So in conclusion, all religions don’t lead to God. Only Jesus does. The rest of them are tools of Satan to lead you astray and straight to Hell..","date":"2012-11-17","mins":"5:38 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-19164","author":"cass","post":"Like when the sun shines brightly through the moisture still in the air after it rains (acting as a prism) you get to see the beautiful colors of a rainbow :).","date":"2012-11-17","mins":"6:23 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
