{"art":[{"id":"comment-9006","author":"charet","post":"I just read the book “Heaven is For Real”… this is how i found this blog, i am touched by many testimonies shared by people especially by Joe! I am raised as Catholic and a believer of Jesus. My mother (a big believer and a Catholic devotee) passed away almost 2 months ago ( one day before I gave birth to my daughter )… yes so much pain … and so much joy!!!! When my Mother died unexpectedly (high blood + heart failure), i somehow question God and His power, and somehow losing my faith!!!!! I was talking to my mother at Sunday morning and that was it., she left after going to church!!!! No goodbyes! Nothing!!!! I was mad at myself for I wasn’t able to call back!… we did not see each other for 5 years (she lives in the Philippines) but i’d call her every other day! We are very close! I am a Mama’s girl… But then we grew big and we left our parents house and have our own lives!!!! Though I talked to her a lot and say I love you, i still have lots of unexpress love for her!!! Our last conversation was about raising kids and about the Holy Spirit the Divine Mercy! i told her that I do believe and pray to the Holy Spirit everyday, and she said that she is very happy that I do so…. And gave me her motherly advise on how to raise my kids!!! After reading the book, it makes my faith more stronger…. I know where my mother now!!! and I know that i’ll see her again… Before i was scared of dying!!! But now, death doesn’t scare me anymore!!! I know i’ll be with Jesus and i’ll see my mother, my baby brother, and my grandmothers!:) Praying hard helps me go through this!!! I still have my ups and downs, and a bit of meltdowns, but i can feel the Holy Spirit right there…. Love and peace to everyone!!!!.","date":"2012-03-06","mins":"4:01 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9036","author":"charet","post":"So true!!! Amen….","date":"2012-03-07","mins":"4:02 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8895","author":"charet","post":"Joe, i am so touched with your testimony! Jesus Christ forever and God Bless….","date":"2012-03-02","mins":"11:22 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
