{"art":[{"author":"christopher_kelley","post":"The great Russian iconographer, Leonid Ouspensky, was convinced the Shroud of Turin was NOT the burial cloth of Christ BECAUSE the left leg appeared shorter, making Christ lame.  I have this directly from one of his students in Paris, under whom I studied.  I took her, very much a doubter, to a film on the Shroud in London; at the end of the film, she declared, “Ouspensky must have been wrong!”\nLook earlier than the conversion of Russ, in 988.  Sts Cyril & Methodios, the Apostles to the Slavs, carried this Cross with them.  They grew up, secretly Orthodox, in Thessaloniki during the reign of the Iconoclasts.  Thereafter, having lived among Slavs in their native city, and conversant in Slavic, they set out for the Slavs’ homelands, bearing a zeal for Orthodoxy, and the Triumph of Orthodoxy over the Iconoclast heresy.  That heresy carried a profound misunderstanding or disregard for the Incarnation.  815 began a second stage of Iconoclasm, mild and “liberal” at first, but increasingly severe and tyrannical, in Cyril & Methodios’ youth.  Yet, by a sudden turn of events, the Triumph of Orthodoxy was achieved in 843.\nThis design of the Cross is PRIOR TO the arrival of the Mandylion /Image of Edessa (Shroud of Turin) in Constantinople.  The Image of Edessa was “the Prize” to be brought to the Imperial City for the Centennial of the Triumph; the Emperor desired to have it by 943.  But it took longer to secure from Edessa (Urfa), so it came a year late, 944, and was first displayed to the public on August 16, when it is still annually commemorated.\nHowever, at its arrival, the Cloth was still pinned to a board, folded in such a way that only the Face was visible, as had been characteristic of the Mandylion in Edessa.  It may have been as late as 1025 that the Cloth was first unpinned, and the full length of the Shroud seen in Constantinople — well after 988.  (We do see ikons changed as a result of this disclosure; eg., “Weep not for Me, Mother” – illustrating the Ode for Holy Saturday morning.)\nIF it was Christ’s LEFT leg that was shorter, or lame, then the angle of the bar would have been in the opposite direction.  That idea of lameness is not the answer.\nRather, whenever there is any change in iconography, it is with Purpose, not mere idle whim.\n9th Century Byzantium faced a new heresy, not only Iconoclasm within, but its inspiration, beyond the borders.  The new design of the Cross was a visual Answer to that heresy, which denied that Christ actually suffered in the flesh; it was a novel form of old Gnosticism.  It was said, by Orthodox Christians in answer to that heresy, that Christ suffered SO MUCH that He wrenched the footrest loose.  His suffering was not figmentary; it was Real!\nThe footrest then, like a scale, was “up” to the Good Thief on His right, and “down” to the other thief on His left.  You will often see the “Russian Cross” standing upon a lunar crescent.  The new form of the Cross, I suppose, did not “catch on” in quite the same way where the traditions were already fixed; but in Russia, it was the standard from the first.\nWho was the new heretic, the originator of Iconoclasm?  It was Muhammad.  The Qu’ran denies the Crucifixion.  This derives from Gnostic thought still lingering in Arabia.\n[We see today certain strains of a desire to minimize focus on Christ’s Sacrifice, dubbed “a slaughterhouse religion” by some.  It is another instance of the old Gnostic heretical twist.}\nThe Shroud makes clear that, after the Left foot was placed over the Right, and both nailed with a single spike, another spike was hammered through the Right Heel. A fourth nail.  This was the last wound Christ received before dying.  It achieved no necessary ‘structure’ for the hanging of a body; its only purpose was to dramatically increase Pains and Suffering to the Victim.  The Roman soldier pounding it in could hardly have known that he was thus fulfilling the Oldest Prophecy of Redemption: The LORD spoke to the Serpent saying, “He shall crush your head, and you shall crush His heel.”\n[PS. In truth, as Muhammad’s earliest Arabic biographies clearly attest, when, by brigandage, terrorism, and breaking of pacts, he seized Mecca in 630, he entered the Ka’aba to destroy all its 360 idols; he personally placed his hands over an ikon of the Virgin Mother of God holding her Child, Jesus, to protect it, while even a mural of Abraham there on the inner wall he ordered destroyed.  This same ikon of the Theotokos was known to exist even 50 years later.\nBut Islam still denies the reality of the Cross.  Scientists raised in Islam are stunned by the verifiable facts arising from the Shroud.  They see the errors of the Qu’ran.]\n\n","date":"February 7, 2014 at 2:14 am","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame"},{"author":"christopher_kelley","post":"You must think like a BYZANTINE.  TETRA = four; DIPLA = doubled.  Now if you fold a paper in half, you have two halves.  If you fold it again, you have four; but if you fold the whole thing once more, you have eight.  It is Exponential.  Very simple.  Observe the act. There it is.  Once unfolded, there are Eight sections.\nDo this with the length of the Shroud, and the Face appears on the top 1/8th.  This longitudinal arrangement, rather than the standard vertical setting of a portrait, is ally testified to by Byzantine art.\n\n","date":"February 7, 2014 at 11:58 am","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame"},{"author":"christopher_kelley","post":"You must think like a ‘Roman’ Byzantine.  If there are eight sections, that’s Tetradipla.  Try folding it like an accordion, then count.  But think Byzantine!\n\n","date":"February 7, 2014 at 8:02 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame"}]}
