{"art":[{"author":"chrisb","post":"When I measure from what looks like the major knuckles on the middle finger to the centre of the “wound” on Shroud Scope, I get 54mm. When I measure the same distance on my own hand, the wound is almost in the middle of the back of the hand, nowhere near the wrist.","date":"February 25, 2015 at 1:01 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","title":"Maybe the Nails Didn’t Go Through the Wrists"},{"author":"chrisb","post":"The HPM artist made a very crude drawing and managed to include at least three indisputable matches with the Shroud – fully naked, arms crossed and missing thumbs. Do the sceptics think that the artist arrived at this simply by chance or whether some established convention was being followed? If yes to the latter, then what do they think the source of that convention is?","date":"June 23, 2014 at 11:37 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"chrisb","post":"How did the HPM artist arrive at a naked Christ with arms crossed and thumbs missing? Any sceptic of the HPM/Shroud link care to answer?","date":"June 23, 2014 at 5:12 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"chrisb","post":"I think you can look at this too scientifically and come to a conclusion such as Hugh’s.We have no idea what was in the mind of the artist of the HPM, whether or not he/she had even seen the Shroud or was just producing an image from hearsay. For me, any representation of Christ lying in his burial position showing crossed arms with missing thumbs (where thumbs really should be visible) indicates something very specific that the artist has seen or heard, and it must be from a significant relic/icon otherwise why copy it? There must be a source for this kind of representation. The question becomes is the Shroud that source or is it just another representation?","date":"June 21, 2014 at 12:09 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"chrisb","post":"Last point first, without searching, I believe there are a few sculptures/images showing crossed arms and missing thumbs.I think any discussion concerning Shroud and HPM needs proper context addressing. Did the HPM artist see the Shroud or not? This fact could drastically affect your probability weighting. Some aspects of the HPM are more certain than others when comparing to the Shroud. e,g.1. There are certainly missing thumbs on the HPM and Shroud.2. It is uncertain whether or not the HPM depicts a tomb lid with a zigzag pattern or whether it is the Shroud with its herringbone weave.How do you go about weighting these perceived similarities when calculating probabilities? It seems to be highly subjective and not amenable to this type of comparison.","date":"June 21, 2014 at 12:47 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"chrisb","post":"The most telling part about the HPM is surely the four fingered hands. Why on earth would the artist miss the thumbs off? The artist is following a template laid down by something much greater. I wonder what that could be??","date":"June 21, 2014 at 5:05 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"chrisb","post":"Really? I can see one thumb underneath the jar, the other is obscured through perspective. Now tell me why both thumbs are missing on Jesus when at least one should be seen?","date":"June 21, 2014 at 5:51 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"chrisb","post":"“I have never seen anything resembling the Shroud and its images in the Pray Codex..”.  What about the naked Christ with crossed arms and thumbs missing? Was the Shroud just another piece of artwork depicting these features, or was it the source of them?","date":"September 12, 2013 at 9:12 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"author":"chrisb","post":"Some of the entombment scenes from 11th century show crossed arms and missing thumbs. There has to be a source for this kind of depiction, which I think must be the Shroud. I doubt the Shroud was made as an icon to depict this scene.","date":"September 8, 2013 at 8:27 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"author":"chrisb","post":"I am inclined to believe that the rectangular shape beside the tomb is the lid. It bears too much resemblance to other works with a similar scene, e.g the Champleve Armlet in the Louvre. The lid in this scene is the same shape as the one in the Pray Codex, and Christ is shown stepping out of the tomb holding what appears to be his shroud. However, there are other works which show Christ lying on his Shroud on top of the tomb lid pre-entombment, so perhaps the Shroud is somehow affixed to the tomb lid in the Pray Codex?","date":"September 10, 2013 at 1:42 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"}],"blood":[{"author":"chrisb","post":"Would God the Father deliberately skew the evidence well away from a 1st century date? By using this method of irradiation, an all knowing God would foresee the problems this would create for those in the future searching for evidence.","date":"October 31, 2015 at 5:29 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"author":"chrisb","post":"I read a paper on Shroud.com by August D. Accetta, Kenneth Lyons and John Jackson investigating apparent x-ray qualities on the Shroud. From the paper “The Shroud image suggests quite strongly the presence of many skeletal details e.g. carpal andmetacarpal bones, some 22 teeth, eye sockets, left femur, left and possibly right thumbs flexed under the palms of the hands, as well as soft tissue and soft tissue injuries; all presumably originating from some form of radiation emitted from the body enshrouded.”Has this line of enquiry been discredited? If indeed these phenomenon can be observed on the Shroud, then seems overwhelmingly in favour of a supernatural burst of energy.","date":"August 6, 2012 at 4:54 pm","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","title":"Giulio Fanti Responds. Are you listening Yannick and Colin?"},{"author":"chrisb","post":"Yannick, there’s already a Catholic Church that has been around for nearly two thousand years. You’ll have to give your cult another name other than “Catholic”.","date":"November 27, 2012 at 11:53 am","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","title":"MUST READ:  Cloning the man on the Shroud of Turin"},{"author":"chrisb","post":"Don’t know if anyone has considered this scenario, but the blood flows maybe a result of the body reanimating during the resurrection. The body was washed prior to being wrapped in the clean shroud, so there wouldn’t be any blood on the shroud prior to the resurrection event. During the resurrection, the heart begins beating and blood flows from the wounds. There isn’t enough time for the blood to pool because the reanimated body is about to leave the shroud, and it is this “leaving” which causes the body image. Simples.","date":"February 20, 2013 at 11:46 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"author":"chrisb","post":"Trickles along the arms are from the wrist wounds after the heart started beating, as are all the other blood stains. Assuming a “dematerializing” resurrection took place not long after the heart began beating then this could explain why there is no pooling.Of course to believe this scenario one has to believe that a resurrection actually took place.","date":"February 20, 2013 at 2:42 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"author":"chrisb","post":"A possible scenario. His heart would have started beating from the resurrection event, making blood flow for a short time before the body leaving the cloth. The resurrection event could also have sealed the wounds.","date":"February 21, 2013 at 2:29 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"author":"chrisb","post":"sorry there’s more.  In the above scenario he would have been wrapped in a clean cloth in the tomb – the shroud.","date":"February 21, 2013 at 2:32 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"author":"chrisb","post":"If the sheet was pulled taut just before being imaged as per Izabel Piczek, assuming the blood is already there, you wouldn’t expect a secondary blood image.","date":"July 14, 2014 at 4:17 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"}],"dating":[{"author":"chrisb","post":"Or the blood may have come after the image assuming the resurrected body had a beating heart and open wounds for a small period of time.","date":"February 13, 2014 at 10:23 am","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"author":"chrisb","post":"Louis :Kelly # 40:“I don’t think he’s omitting clinical death or the typical crucifixion, death, resurrection sequence-my take on it was that he was saying that when Christ’s dead body came back to life, the heart was restarted as part of the process, hence some bleeding occurred.”This doesn’t sound convincing. How did the bleeding stop? Did Jesus go to a doctor before he allowed doubting Thomas to feel his resurrected body?Just a hypothesis Louis, it doesn’t deny Christ’s death. Developing it a little further, I envisage the body was washed and placed in a clean Shroud. It assumes the resurrection consists firstly of the heart beginning to beat, and open wounds would cause blood to flow out of them onto the Shroud (Jesus would still be lying in situ). Then after a short while, the ‘Light of God’ if you will, caused the resurrection proper, fixing the image, blood and wounds.","date":"February 14, 2014 at 1:48 pm","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"author":"chrisb","post":"It wasn’t clear in my earlier post, but I envisage that the blood would be fixed on the Shroud, and that the risen Lord would no longer be bloodied.","date":"February 14, 2014 at 3:27 pm","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"author":"chrisb","post":"Louis, Dave, thanks for your comments. Like you say, we have no idea really how the resurrection happened. Don’t know were it came from but I thought it was a given that the risen Jesus had a real physical heart","date":"February 14, 2014 at 3:37 pm","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"author":"chrisb","post":"Neither are you making any sense Colin. Have you really managed to eliminate all possibilities that blood second means it’s a fake?","date":"June 22, 2013 at 4:56 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"author":"chrisb","post":"Excellent point. I’ve often thought that there must have been some attempt at preservation earlier on in the Shroud’s life.","date":"November 5, 2013 at 2:17 pm","url":"https://shroudstory.com/2013/11/05/overheard-behind-us-during-barries-talk-thats-only-listerine/","cat":"carbon_14_dating","title":"Overheard behind us during Barrie’s Talk: “That’s only Listerine”"},{"author":"chrisb","post":"Wouldn’t the heat from the various fires the Shroud has been exposed to affect the strength of the fibres? If so, the result would be younger than 400AD.","date":"September 20, 2013 at 7:24 am","url":"https://shroudstory.com/2013/09/20/paper-chase-giulio-fantis-new-flax-fiber-dating-machine/","cat":"carbon_14_dating","title":"Paper Chase:  Giulio Fanti’s New Flax Fiber Dating Machine"}],"events":[{"author":"chrisb","post":"There are two witnesses in the Apocalypse 11:1-14.Perhaps the Shroud has an end times role?","date":"May 23, 2013 at 11:21 am","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","title":"A kind of witness?"},{"author":"chrisb","post":"This isn’t a surprise. How on earth were they going to deal with potentially hundreds of millions of concurrent requests for the site?","date":"March 30, 2013 at 10:58 am","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","title":"Awaiting Live Stream from RAI Uno"},{"author":"chrisb","post":"Why, Yannick, would God, who is love and mercy only, torture his son on the cross, if it wasn’t as a sacrificial act?","date":"March 1, 2013 at 5:10 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"author":"chrisb","post":"Jesus glorified the Father by his death on the cross (John 17). Unless what John has written is wrong, then God the Father must have demanded this sacrifice. Do you believe in Hell and that people can be condemned? If so, how would you reconcile this with God who is only loving and merciful. Surely God is to be feared in equal measure?","date":"March 1, 2013 at 6:44 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"author":"chrisb","post":"The seers of Fatima described a vision of hell in which souls are dropping in like snow flakes. Jesus told his disciples not to be afraid of those who can kill the body but not the soul, but fear the one who can kill both body and soul in hell.The Good Shepherd knows his flock and they know him. I think you know the rest.","date":"March 3, 2013 at 7:28 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"author":"chrisb","post":"If Universal Salvation is accepted, then I think it will be a marker that the Church really has been infiltrated. It is a dangerous doctrine which gives a false sense of freedom.","date":"March 3, 2013 at 8:02 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"}],"history":[{"author":"chrisb","post":"Unless Jesus was buried naked contrary to the Gospels, there were definitely some burial cloths of his, and ones that bore his blood. Given the magnitude of the resurrection, I doubt the apostles/disciples would have promptly incinerated or disposed of his burial cloths. So it is reasonable to assume that they must have been/still are in existence. No early references to them is moot.","date":"October 7, 2012 at 5:25 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","title":"Davor Aslanovski: Sindonology a Heresy"},{"author":"chrisb","post":"He is fully God and man. If he had a wife, then what need was there for him to be born of a virgin, whom we are told was free from original sin? It is heresy and attempts to deny the Son of God his rightful place. It shouldn’t be overlooked but condemned.","date":"September 20, 2012 at 5:46 pm","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","title":"Hot New Topic: The Wife of Jesus"},{"author":"chrisb","post":"Interesting Yannick. It strikes me that you tend to go for more naturalistic explanations which leads me to think why you would accept the accounts of the resurrection as opposed to the body being stolen?","date":"September 22, 2012 at 6:43 pm","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","title":"Hot New Topic: The Wife of Jesus"},{"author":"chrisb","post":"Does it matter? I suppose not if you don’t believe the church is his bride. How could he be a perfect sacrifice after he had become “as one” through marriage with a woman?","date":"September 20, 2012 at 7:30 am","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","title":"Hot New Topic: The Wife of Jesus"},{"author":"chrisb","post":"I think the artist of the HPM has inadvertently, or possibly deliberately, put the weave of the Shroud along with L shaped holes onto the sepulchre lid, thinking that the pyramid type pattern was on the inside of the sepulchre. When looking at the Shroud from above, one could imagine the uncovered Christ lying in the sepulchre surrounded by the herringbone pattern which the artist has drawn as the inner pattern of the sepulchre.","date":"September 22, 2013 at 8:13 am","url":"https://shroudstory.com/2013/09/21/so-is-that-the-shroud-of-turin-depicted-in-the-hungarian-pray-codex/","cat":"history","title":"So is that the Shroud of Turin depicted in the Hungarian Pray Codex?"},{"author":"chrisb","post":"At the end of Mesarites quote “In this place He rises again and the sudarium and the burialsindons can prove it”. It sounds quite possibly as though he is alluding to an image/blood, otherwise how could the cloths prove it? The problem then is that the cloths are described as having a common weave, which would appear to exclude the TS.","date":"May 12, 2014 at 8:35 am","url":"https://shroudstory.com/2014/05/11/the-three-byzantine-burial-cloths-of-jesus/","cat":"history","title":"The Three Byzantine Burial Cloths of Jesus"}],"image":[{"author":"chrisb","post":"Hi Colin, thanks for referencing my comment on your blog. One thing that strikes me about your theory about how the Shroud image was formed (effectively plunging a 250c statue into a sand bed covered with a linen sheet as I understand it) is that there should be on the Shroud a correlation between the superficiality of the image and intensity of grey scale. On this point, for your theory to hold, it seems to me the image depth should be greater on places like the tip of the nose than on the side of the nose for example, as you pointed out more pressure would be exerted there. I don’t know if this is the case with the Shroud as I’m not sure where image samples were taken from.","date":"September 10, 2012 at 10:13 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/09/09/how-long-before-the-grey-scales-fall-from-peoples-eyes-and-the-shroud-image-accepted-as-a-thermal-imprint-scorch/","cat":"medieval_hoax","title":"How long before the grey scales fall from people’s eyes, and the Shroud image accepted as a thermal imprint (“scorch”)??"},{"author":"chrisb","post":"The last thing I would expect to see is a crease of this nature resulting from a hot template being applied to a piece of cloth. Or, as in Colin’s experiments, the linen being applied over a hot template. Creases like this are usually ironed in which is counter intuitive to the LOTTO method. I’m not convinced that they are creases in the first place. Do we have any data showing a continuous deformity in the weave which would be characteristic of a crease, or is it simply because it looks like a crease?","date":"March 23, 2014 at 5:48 pm","url":"https://shroudstory.com/2014/03/23/baked-in-creases-really/","cat":"image_theory","title":"Baked-In Creases. Really?"},{"author":"chrisb","post":"Sorry, it was a comment for Hugh’s posting re: ‘Myth busted’","date":"November 22, 2013 at 10:57 am","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"author":"chrisb","post":"You believe that God can raise Jesus from the dead, yet is unable to colour an impurity layer without affecting the underlying fibers?","date":"October 30, 2012 at 3:07 pm","url":"https://shroudstory.com/2012/10/29/big-deal-peer-reviewed-scientific-paper-soon-to-be-published/","cat":"image_theory","title":"Big Deal Peer-Reviewed Scientific Paper Soon to Be Published"},{"author":"chrisb","post":"Do those creases come out with time? Any thoughts also on how the forger managed to handle a full size heated statue.","date":"November 22, 2013 at 3:45 pm","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"author":"chrisb","post":"colinsberry :Creases? Did you mean to say scorches?There appears to be an outline crease where the heated object has come into contact with the linen. It’s perhaps a marker for a recent scorch. It probably falls out with time but may leave some tell tale sign enough to be measured?","date":"November 23, 2013 at 6:04 pm","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"author":"chrisb","post":"Are those deeper threads “discoloured” due to a lack of light reaching them perhaps?","date":"November 21, 2013 at 5:49 pm","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"author":"chrisb","post":"Would you expect the blood to be different if the donor didn’t have a human father?","date":"November 17, 2013 at 2:13 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"author":"chrisb","post":"Is that you Yannick?","date":"November 15, 2013 at 10:28 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"author":"chrisb","post":"We’ve been through all this before haven’t we? Didn’t Thibault show that a contact scorch like this just doesn’t have the same microscopic properties as the Shroud.As for the 3D, it looks to me like the crease in the fabric resulting from the heat has given rise to much of the 3D you can see there. Also, there’s far more of the image missing compared to the Shroud. I’d also like to see how superficial those feet scorches are. Do you have any microscopic images Colin?Hugh, am I right in recalling you dismissed the scorch theory not long back. If so, does this experiment convince you otherwise?","date":"November 15, 2013 at 8:02 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"author":"chrisb","post":"Could you not get any fluorescence from heavier scorches? If so, then perhaps the Shroud image could be a scorch and may have lightened over time?","date":"August 28, 2013 at 6:08 pm","url":"https://shroudstory.com/2013/08/26/nicely-done-you-must-download-this/","cat":"image_theory","title":"Nicely Done: You must download this"},{"author":"chrisb","post":"To me it looks as though a rectangular object blocked the imaging process in the yellow box highlighted. It’s too defined. I would expect a gradual transition into the imaged area.","date":"July 20, 2014 at 5:08 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?"},{"author":"chrisb","post":"Why would the nature of the object matter?It still remains that the non imaged area is too defined to be what you think it is.","date":"July 21, 2014 at 12:41 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?"},{"author":"chrisb","post":"What’s Hugh doing on the cover of History Today?","date":"November 12, 2014 at 3:44 pm","url":"https://shroudstory.com/2014/11/12/real-1st-century-or-simulated-14th-century-sweat-imprint/","cat":"image_theory","title":"Real 1st century or simulated 14th century sweat imprint?"},{"author":"chrisb","post":"I think you would have to compare the 3D properties of 14th century works or earlier to determine how special the 3D on the Shroud is.","date":"November 3, 2013 at 3:43 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"author":"chrisb","post":"How would the forger know to apply just the right amount of pigment for it not to soak through to the reverse side, but to occupy the very pinnacle of the fabric?","date":"September 25, 2014 at 3:01 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"author":"chrisb","post":"Contrary to Yannick stating that Thibault’s paper is a useless effort, I think it is a wonderful paper, with previously unseen information about the nature of a very light scorch. It was compiled in response to some genuine questions posed by Colin Berry. Credit to Colin for stating that a light scorch can be superficial, but I think Thibault has demonstrated convincingly that the TS cannot be such. The ball is back in Colin’s side of the court now.","date":"October 22, 2012 at 2:46 pm","url":"https://shroudstory.com/2012/10/21/thibault-heimburger-now-i-know-for-sure-that-the-ts-body-image-is-not-a-scorch/","cat":"image_theory","title":"Thibault Heimburger: Now, I know for sure that the TS body image is not a scorch"},{"author":"chrisb","post":"According to Acts 13:37, “But the one whom God raised from the dead did not see decay”. If there wasn’t any decay, then what part of the dead body reacted with the linen cloth?","date":"November 1, 2012 at 12:41 pm","url":"https://shroudstory.com/2012/10/21/thibault-heimburger-now-i-know-for-sure-that-the-ts-body-image-is-not-a-scorch/","cat":"image_theory","title":"Thibault Heimburger: Now, I know for sure that the TS body image is not a scorch"},{"author":"chrisb","post":"“… There is course no gap seen at all, but the frontal and dorsal images at the crown abut each other.” Unless I’m mistaken and I could well be, it appears the front and back head images meet according to DaveB. I don’t see this. What appears to be the dorsal head image I believe is a water stain, the top of the dorsal head image is very faint or missing but not touching the ventral head image.","date":"January 15, 2014 at 2:28 pm","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"author":"chrisb","post":"The front and back heads are separated by a gap of less than 1cm?? Dan, I think you should create a sticky entitled “Top of the head problem “.","date":"February 28, 2014 at 4:33 am","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"author":"chrisb","post":"Yes I know, I just couldn’t believe we are discussing it again after January’s article!!","date":"February 28, 2014 at 5:09 am","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"author":"chrisb","post":"If one can envisage an orthogonal radiation model, you would expect the top of the head to be missing.","date":"March 4, 2014 at 5:55 pm","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"author":"chrisb","post":"I’m looking for the tufts on Mark Evans pics where the more heavily scorched fibres broke away.They should be everywhere if Colin’s theory is right. So where are they? Also check out the heavily scorched areas near to burn marks. I cannot see any tufts there either.","date":"March 14, 2014 at 8:03 am","url":"https://shroudstory.com/2014/03/14/two-comments-promoted-colin-berry-has-cracked-the-shroud-enigma/","cat":"image_theory","title":"Two Comments Promoted:  Colin Berry Has Cracked the Shroud Enigma?"},{"author":"chrisb","post":"The scorch theory should be discountable by examining the range in grey-scale values. The Shroud should have a greater range in grey-scale values compared to a scorch, which would presumably have more uniform values.","date":"September 9, 2012 at 2:34 pm","url":"https://shroudstory.com/2012/09/08/wheres-the-evidence-colin/","cat":"image_theory","title":"Where’s the Evidence, Colin?"},{"author":"chrisb","post":"Do you believe the miracles like turning water into wine, feeding the five thousand, walking on water etc are allegorical?","date":"November 10, 2012 at 3:11 pm","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","title":"You shroudies and your fallacious thinking"},{"author":"chrisb","post":"Perhaps we could state why we think the Shroud is authentic then challenge those views?It will become a skeptic’s site.","date":"October 18, 2013 at 4:22 pm","url":"https://shroudstory.com/2013/10/18/how-do-we-know-no-directionality-of-light/","cat":"uncategorized","title":"How do we know? No directionality of light."}],"misc":[{"author":"chrisb","post":"Catechism 675 would suggest some of the events in Revelation are yet to happen.","date":"June 10, 2014 at 6:23 pm","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","title":"A Decline,  an Uptick and a Rise"},{"author":"chrisb","post":"I don’t think that link is it either. In fact, I don’t think there is a decent image of it.","date":"December 16, 2013 at 2:02 pm","url":"https://shroudstory.com/2013/12/16/a-thread-dedicated-to-vincenzo-giovanni-ruellos-proposal/","cat":"news_&_views","title":"A Thread Dedicated to Vincenzo Giovanni Ruello’s Proposal"},{"author":"chrisb","post":"Aren’t relics intended to bolster faith? As a relic the Shroud is tantalizing as it touches the heart of the Christian faith – The Resurrection. So I can understand why people have a lot invested in it.","date":"February 11, 2014 at 11:01 am","url":"https://shroudstory.com/2014/02/11/are-we-being-honest-with-ourselves/","cat":"news_&_views","title":"Are We  Being Honest With Ourselves?"},{"author":"chrisb","post":"Perhaps the nails were left in situ with the hands and feet being yanked off them?","date":"December 6, 2013 at 9:13 am","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes"},{"author":"chrisb","post":"Didn’t the Italian lab that fired uv photons at a piece of cloth and got a result similar to the image on the Shroud demonstrate that image formation is feasible when quantum mechanics is applied?","date":"January 17, 2014 at 6:47 am","url":"https://shroudstory.com/2014/01/16/royal-society-lecture-exchanges-in-science-and-religion/","cat":"science_and_religion","title":"Royal Society Lecture: Exchanges in science and religion"},{"author":"chrisb","post":"Well, I think it can be interpreted in a QED manner, certainly as an agent, as photons are traveling from one point to another point. They just happen to be having an effect on the cloth on the way. I’m not sure in which respect other commenters expect quantum mechanics to be involved in image formation.","date":"January 17, 2014 at 4:29 pm","url":"https://shroudstory.com/2014/01/16/royal-society-lecture-exchanges-in-science-and-religion/","cat":"science_and_religion","title":"Royal Society Lecture: Exchanges in science and religion"},{"author":"chrisb","post":"Yannick, when the Bible refers to Jesus shining brilliantly at the Transfiguration would you call that metaphorical, or do you believe he actually emitted radiation? Given that Jesus is so often referred to in electromagnetic terms in the Bible, why are you so against a radiant model for the image on the Shroud? And I’m quite sure that Rogers didn’t know the properties of this light from God so that he could dismiss it.","date":"February 24, 2014 at 5:44 pm","url":"https://shroudstory.com/2014/02/23/should-ssg-get-involved/","cat":"news_&_views","title":"Should SSG Get Involved?"},{"author":"chrisb","post":"Hugh, bit off topic but whilst on the subject of debating the veracity of alleged miracles, what are your thoughts on the miracle of the sun at Fatima?","date":"September 25, 2013 at 8:16 am","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","title":"The Eucharistic Miracle of Buenos Aires"},{"author":"chrisb","post":"I think this “false Christ” will struggle to deceive the inept, never mind the elect.","date":"September 10, 2014 at 8:48 am","url":"https://shroudstory.com/2014/09/09/tinfoil-hat-version-of-face-matching/","cat":"tinfoil_hats","title":"Tinfoil Hat Version of Face Matching"}],"opinion":[{"author":"chrisb","post":"Well, there has to be a mass falling away of people from the faith before the man of lawlessness is revealed. Perhaps we are closer to the end than we think?","date":"August 15, 2012 at 6:08 am","url":"https://shroudstory.com/2012/08/15/off-topic-major-shifts-in-religiosity-and-atheism-reported/","cat":"news_&_views","title":"Off Topic:  Major Shifts in Religiosity and Atheism Reported"},{"author":"chrisb","post":"Max Patrick Hamon :The miniature can be found at: http://digital.wlb-stuttgart.de/digitale-sammlungen/seitenansicht/?id=4870&tx_dlf%5Bid%5D=1517&tx_dlf%5Bpage%5D=90It’s difficult to make out, but is part of the hair tied up like a pigtail at the back of the head?","date":"October 9, 2013 at 8:30 am","url":"https://shroudstory.com/2013/10/06/one-persons-take-away-from-a-shroud-lecture/","cat":"other_blogs","title":"One Person’s Take Away from a Shroud Lecture"},{"author":"chrisb","post":"And if it is established finally that blood came first?","date":"March 2, 2013 at 11:27 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/03/02/shroudie-alert-day-12-time-now-to-write-that-long-overdue-letter-to-the-royal-society/","cat":"medieval_forgery","title":"Shroudie-Alert: Day 12: time now to write that long-overdue letter to the Royal Society…"},{"author":"chrisb","post":"It would help if you could highlight in your video what you say you can see, such as the lions head.","date":"May 20, 2013 at 5:24 pm","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"}],"researchers":[{"author":"chrisb","post":"On Shroudscope I measure 109mm from the tip of the middle finger to the top of the major knuckles. That is based on the lower hand as the one on top doesn’t appear flat like the lower one. My corresponding finger is about 95mm. On the upper hand, I measure about 45mm from the knuckles to the top of the blood mark. That would position it on my hand in the centre of the lower hand. My conclusion is that the Man on the Shroud has very strangely shaped hands. Or perhaps mine are?","date":"December 10, 2013 at 8:35 am","url":"https://shroudstory.com/2013/12/08/barbet-vs-zugibe/","cat":"other_blogs","title":"Barbet vs Zugibe"},{"author":"chrisb","post":"Looks like there has been some kind of foreshortening of the palm and lengthening of the fingers.","date":"March 25, 2014 at 5:37 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"author":"chrisb","post":"If it’s possible for Satan to be saved, then I have to wonder what it actually is that anybody needs saving from? I mean, why didn’t God just take everyone straight into Heaven rather than messing about with the earth? BTW, Do you think that Jesus radiated any form of light when he was resurrected?","date":"April 18, 2013 at 3:37 pm","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","title":"Why Giulio Fanti Matters"},{"author":"chrisb","post":"About Satan and his angels. Will they also be saved eventually?","date":"April 18, 2013 at 11:56 am","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","title":"Why Giulio Fanti Matters"},{"author":"chrisb","post":"I find most people are indifferent to the Shroud. Even when you explain the highly improbable image, the response is like ‘so what?!’","date":"March 4, 2014 at 6:03 pm","url":"https://shroudstory.com/2014/03/02/jones-the-turin-shroud-is-authentic-get-over-it/","cat":"other_blogs","title":"Jones:  The Turin Shroud is authentic. Get over it!"},{"author":"chrisb","post":"You are forwarding dangerous doctrine, Yannick. The bible is infused with warnings about the wrath of God. Ignore this at your peril!!","date":"April 26, 2014 at 7:34 am","url":"https://shroudstory.com/2014/04/25/some-advice-from-stephen-jones/","cat":"other_blogs","title":"Some Advice from Stephen Jones"},{"author":"chrisb","post":"Just Ray at the front and an ‘s’ on the end of your current name and you’ll be there, Yannick!!","date":"April 26, 2014 at 7:31 am","url":"https://shroudstory.com/2014/04/25/some-advice-from-stephen-jones/","cat":"other_blogs","title":"Some Advice from Stephen Jones"},{"author":"chrisb","post":"There is middle ground! It may be a piece of artwork produced as a tribute to 11th/12h century Byzantine artwork showing a naked, crossed arm Christ.","date":"October 7, 2013 at 5:47 pm","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","title":"What did Stephen Jones just say?"}],"resources":[{"author":"chrisb","post":"Many of us agree that the man on the Shroud is indeed Jesus and many of us believe that miracles are associated with him. I think therefore, that is entirely logical to make the assumption that the image is miraculous, and we shouldn’t be afraid or embarrassed to say so. As for exhausting naturalistic explanations, I think that in the main they have been. The chances of vapours arranging themselves to form a virtually non distorted image is highly improbable, and this method should be discounted. Scorches, applied substances such as pigments have also been discounted scientifically. There isn’t a great deal left apart from radiation models. I don’t buy secondary miracles as it just doesn’t seem to do justice to God’s majesty, and this comes back to my point about being embarrassed about professing a proper miracle. I believe that Jesus raised Lazarus from the dead without any naturalistic factors being involved, and that he walked on water without the aid of a strong wind for example. I also believe that he emitted pure light at the Transfiguration to show his true glorified state.","date":"February 27, 2014 at 3:12 pm","url":"https://shroudstory.com/2014/02/26/giulio-fantis-book-launched/","cat":"books","title":"Giulio Fanti’s Book Launched"},{"author":"chrisb","post":"Can you explain how vapours can cause a near non distorted image on an object as deep as a human body? It may well work on a pressed flower, but not I think on an object with significantly more depth. I also mentioned that it is not unreasonable to assume the image is miraculous because of its association with Jesus. What say you about this?","date":"February 27, 2014 at 6:56 pm","url":"https://shroudstory.com/2014/02/26/giulio-fantis-book-launched/","cat":"books","title":"Giulio Fanti’s Book Launched"},{"author":"chrisb","post":"Render unto science what is science, and to God what is God’s. I think the Shroud is God’s.","date":"February 28, 2014 at 12:01 pm","url":"https://shroudstory.com/2014/02/26/giulio-fantis-book-launched/","cat":"books","title":"Giulio Fanti’s Book Launched"},{"author":"chrisb","post":"Hugh Farey :No. Miraculous occurrences are not susceptible to any kind of theoretical deduction, being, by normal definition, beyond any necessity for rational explanation. I myself have no time for any kind of supernatural explanation for the formation of the shroud, not because such an explanation is not possible, but because, should I ever become convinced of it, then no further scientific exploration of the shroud would be sensible. A miracle does not need radiation, vapours or any kind of biochemical process to produce an image. Or a thousand loaves and fishes for that matter.Doesn’t nature come from the supernatural, and yet it is still scientifically explored? And is this not the reason that Jesus could perform all manner of miracles and indeed be resurrected? I’m sure the disciples who witnessed the Transfiguration called it a miracle, where he shone brilliantly.","date":"February 28, 2014 at 5:44 pm","url":"https://shroudstory.com/2014/02/26/giulio-fantis-book-launched/","cat":"books","title":"Giulio Fanti’s Book Launched"},{"author":"chrisb","post":"Your test misses a third option – an image of the Passion and death of Jesus Christ AND an image of the Resurrected Christ. Effectively what you are doing is precluding any miraculous event that could have formed the shroud image. Why, therefore, do you believe in any miracle where Jesus is concerned?","date":"December 18, 2012 at 3:14 pm","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"author":"chrisb","post":"If you believe something underhand went on, then where does this leave the patch/reweave theory? Do you still believe the C14 samples dated were a patch/reweave or that they weren’t from the Shroud at all?","date":"September 28, 2013 at 10:34 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"chrisb","post":"“If there’s anything thing we can say about the image on the cloth, it wasn’t the product of being wrapped around a head, let alone a corpse. I think we’re all familiar with the Mercator Projection?”So what’s your explanation? Orthogonal projection?","date":"September 29, 2013 at 12:06 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"chrisb","post":"“A 14th century icon.”That’s not an explanation of the image, is it?","date":"September 30, 2013 at 3:33 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"}]}
