{"art":[{"id":"comment-3252","author":"chris","post":"Because the end is near.","date":"2011-06-20","mins":"11:19 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7855","author":"chris","post":"I also see a lot of claims for things like flowers and writing that I personally don’t see when I look at the shroud or it’s photographic negative. I do see a lot of the details that some people point out, for example, teeth in the mouth. However, I am not quite sure if those teeth are actually teeth that are partially revealed in some way through what I perceive to be closed lips or just noise from the shroud itself. I have a hunch they’re noise but am open minded. I also do clearly see the hand bones but I am not sure why – did Jesus have very little body fat and his bones shown through his hands like I’ve seen with some older folks? That seems plausible to a degree even without knowing the probable mechanism of image creation. The abnormally long fingers on the right hand seems to be a distortion caused be the tenting effect of the left leg being raised. But as for flowers, words and secret symbols I am of the mind that if they are not as plain, visible and discernable as the image of the man himself they are probably just noise..","date":"2012-02-02","mins":"9:38 am","url":"https://shroudstory.com/2012/02/02/luciano-buso-whats-the-point-of-denying-my-theory/","cat":"art","title":"Luciano Buso: What’s the point of denying my theory"},{"id":"comment-11894","author":"chris","post":"Are there other scenes of a naked Christ in medieval art? These all seem to show what’s on the shroud, it’s all the same burial scene. It could be that the shroud was the inspiration for all these. To show that there was no taboo against showing a naked Christ I would think you’d have to see diverse and multiple depictions of it. If this is it I don’t think anyone should doubt there was a taboo..","date":"2012-06-04","mins":"11:42 am","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-11899","author":"chris","post":"Carlos, that would seem significant. I think it should be further studied to see how significant. I would think you’d need a lot of art historians etc to contribute and it would time quite a bit of time to come to a conclusion..","date":"2012-06-04","mins":"12:13 pm","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-8331","author":"chris","post":"Colin, the reference is something Peter used to highlight the abject terror that was in the hearts of Jesus’ followers, nothing more. When they all fled the guards happened to grab this man’s cloak and tore it off him as he ran. He was so scared of getting caught up in Jesus’ arrest he didn’t care about losing his clothes. Remember Peter is reading from Matthew here and he omits the portion about the scriptures because his audience is a group of Romans and the reference would be lost on them so he mentions a small detail that highlights the fear instead. His audience could definitely relate to the fear that a group of guards would instill. You will catch Peter doing this here and there in Mark’s accounting because he is remembering details or filling in details as he preaches to the Romans while reading from Matthew and Luke..","date":"2012-02-15","mins":"7:17 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","title":"The Shroud of Turin: a pale shadow of its former glory?"},{"id":"comment-8334","author":"chris","post":"Dave, I am very familiar with Markan Priority Theory. It’s a dying theory as it does not agree with the historical record, tradition, nor it’s own literary analysis. It is riddled with inconsistencies and flaws which cannot be easily explained and rely on itself for explanation. Scholars are starting to discard it and return the the Clementine tradition which predates the Jerome Tradition. The conclusion is that Matthew wrote first almost immediately after the Resurrection followed by Luke. Peter probably had both scrolls in front of him as he preached in Rome and Mark transcribed Peter’s words verbatim (as the historical record indicates) thus explaining the poor Greek of Mark (Peter does not speak Greek very well since it is not his first language). So Mark is third as the historical evidence alludes. Q doesn’t exist as it’s understood and is probably actually just Matthew in Aramaic. John wrote last to combat heresy. A lot of scholars don’t accept this yet but the numbers who do are growing because suffice it to say that the overwhelming bulk of the evidence comes down in favor of the Clementine Tradition and the Church Fathers..","date":"2012-02-15","mins":"9:18 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","title":"The Shroud of Turin: a pale shadow of its former glory?"},{"id":"comment-8355","author":"chris","post":"Dave, thanks for the reply, I appreciate it. It’s a fascinating subject indeed. We’ll just agree to disagree. As for Colin’s analysis, I think either way he’s making a mountain out of a mole hill. It’s just a detail that Peter remembers about someone running away. Peter spoke poor Greek and grasped at the word needed to describe the clothing, nothing more. Mark also was a Semitic and also spoke poor Greek so he just copied it down when Peter said it. The Gospels are chock full of miracles because these guys wanted you to believe Jesus was the real deal. If there was any hidden meaning via a foreshadowing of the supernatural behind the guy who ran away I think Peter would have said more. He inserts this detail memory and then goes back to reading Matthew’s account. Besides Jesus Himself does plenty of foreshadowing of His own death and Resurrection no need for a cryptic detail like a man dressed in a burial shroud to convey some hidden meaning. Being dressed in a burial shroud doesn’t make sense, even in this context. His audience is foreign to him but he picks a universally understood emotion, especially in the ancient world – abject fear, to convey the context of the situation. The other thing it highlights is that if they were so terrified then but are boldly preaching now there must be some real truth to what these guys are saying about the Risen Lord walking out of the tomb if they’re not afraid of the prospect of death by execution to tell folks about this story. On the whole of Peter’s account he is showing that from fear to no fear the story they are preaching is real..","date":"2012-02-16","mins":"11:12 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","title":"The Shroud of Turin: a pale shadow of its former glory?"},{"id":"comment-8405","author":"chris","post":"Easy Dave, there’s enough room for Matthew and Luke Priority theory. There’s a boatload written about the subject as there is about Markan Priority. There’s good and there’s bad regarding both theories, one has to distinguish between them. We’re not going to change anyone’s mind here about that but it is refreshing to see folks like yourself here who are well read and using that knowledge to help our understanding of the shroud in history. For that I am grateful..","date":"2012-02-17","mins":"11:11 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","title":"The Shroud of Turin: a pale shadow of its former glory?"},{"id":"comment-8451","author":"chris","post":"Dave, thanks for this. There is a website by a guy by the name of Dennis Barton that neatly sums up a different point of view. This is not the appropriate forum to discuss it here but it makes for good reading. Hope you enjoy and thanks again..","date":"2012-02-19","mins":"12:59 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","title":"The Shroud of Turin: a pale shadow of its former glory?"},{"id":"comment-8594","author":"chris","post":"Found Dennis’ site. It’s high level but presents the main arguments. Hope you enjoy. Http://www.churchinhistory.org/pages/booklets/authors gospels 1.htm.","date":"2012-02-21","mins":"3:40 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","title":"The Shroud of Turin: a pale shadow of its former glory?"}],"blood":[{"id":"comment-12786","author":"chris","post":"Dear Heavens, he does reach, doesn’t he?.","date":"2012-06-20","mins":"11:01 am","url":"https://shroudstory.com/2012/06/20/berry-shroud-was-scourged-not-the-man-a-critical-look-at-faccini-and-fanti/","cat":"blood_studies","title":"Berry: Shroud was Scourged, Not the Man. A Critical Look at Faccini and Fanti"},{"id":"comment-14449","author":"chris","post":"I think this constitutes hysteria, not science. A simple call for another test to either corroborate Adler et al’s findings or challenge them based on whatever valid reasoning would suffice and be honorable. But given the hysterical behavior on display it can be a foreseen that no conclusion that points to authenticity will be accepted and all such observations for authenticity are the product of a conspiracy at worst or like minded blindness at best. There can be no conclusion contrary to the opinion of the hysteric..","date":"2012-08-03","mins":"12:49 pm","url":"https://shroudstory.com/2012/08/03/did-the-bloodstains-really-precede-image-formation-on-the-shroud-of-turin/","cat":"blood_studies","title":"Did the bloodstains really precede image formation on the Shroud of Turin?"},{"id":"comment-39023","author":"chris","post":"Agree with Dave B. The real testament to the truth of the Resurrection lies in the fact that these Apostles spread out over the known world at the time and fearlessly faced martyrdom without even the slightest inclination to recant what they had saw. It doesn’t make sense to me that anyone who is knowingly spreading a lie about Eternal Life (professing to have witnessed a miraculous physical Resurrection as proof of that truth) as offered by Jesus would willingly suffer martyrdom. In fact, if Jesus did not rise from the dead they would have had no impetus to do anything. To them He would have been just another well meaning guy who got executed by the jealous powers at that time. No proof, really, that anything He said about Eternal Life was true. Why bother to leave everything to spread the Word? Missionary work was an unbelievably harsh life let alone life threatening when a hostile audience was encountered. There was no self enrichment incentive it was just brutal work. People who supposedly have had their Faith requirement disburdened from them just don’t do that sort of thing..","date":"2013-07-15","mins":"11:15 am","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","title":"Erase the fact from the list. It is not a fact. It never will be."},{"id":"comment-38906","author":"chris","post":"I was waiting for this. This is excellent information. However, I’d love to see a peer reviewed graphically illustrated paper showing the effects of removing a shroud at different phases of decay. How valid would it be may depend on the state of the cadavers used so this may be an impediment. But still if it could be done in an ethical and relevant way I’d like to see it..","date":"2013-07-11","mins":"7:39 pm","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","title":"Erase the fact from the list. It is not a fact. It never will be."},{"id":"comment-39986","author":"chris","post":"I am not sure. Yannick, Hugh, Ron et al make many good points. I’ve always thought that the body was unwashed because the most obvious blood flows are still present (down the arms). The Gospels mention Jesus was redressed after the scourging and crowning. I assumed that the garments he was redressed in became covered in this blood and clots. When He was stripped again at the crucifixion wouldn’t everything be dry? If so how would crucifixion open these wounds?.","date":"2013-07-28","mins":"8:40 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-9913","author":"chris","post":"Getting back to the original theme of Dan’s post I agree that the evidence of the Passion left upon the shroud is something worth meditating on for all Christians. It not only reflects the accuracy of the Gospels’ accounts but it also reflects the sinfulness that caused Christ’s suffering. Most importantly, it shows the length Jesus went to in His suffering to show us how much He loves us. Looking at the wounds inflicted upon Him I imagine what it must have felt like, the excruciating pain and humiliation. It is truly humbling to know that He who made the Heavens and the Earth was willing to go through this just to show us how much He loves us. It is also very disheartening to reflect on the cruelty and hate humanity is capable of when it refuses to embrace the uncomfortable truth. This is the meaning of Original Sin. Another thing I like to reflect on is that our current state of knowledge tells us that the universe is not infinite (John Klotz may agree with this point), it will most definitely end at some point and everything we know and see will cease to exist. Therefore, even if man should unlock the biological secret to perpetual life without aging no one will live forever, they will merely put off the day of reckoning. Our position is truly temporal in this realm. Jesus rescues us from that with the demonstration of Eternal Life through the Resurrection but He gets us there by also demonstrating that our death is also temporal. The shroud is the document of His death, it’s current emptiness begets the Hope of His Resurrection and with it our own invitation to Eternal Life..","date":"2012-04-03","mins":"10:43 am","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-9928","author":"chris","post":"It’s mine, Dave, but feel free to repeat it far and wide. The more of us who get the message the better off humanity is to greater glory of His Name..","date":"2012-04-03","mins":"6:55 pm","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-8418","author":"chris","post":"Ron, I read that and it was impressive but I am not sure what to think in the end. Part of me says Jesus would have a LOT of blood on him after the scourging and crucifixion but there doesn’t seem to be a corresponding amount of blood on the shroud as I would theorize there would be. In this sense I can agree with Zugibe but I am not a forensic expert in this regard and therefore don’t really know. But then there seems to be some blood left over from the crucifixion like the blood on the face, head and the arms. Part of me wonders if there was a quick wash with a wet cloth over most of the body along with a hasty wrapping in the shroud with the intent to finish the job on Sunday. The Gospels are not clear about when the spices were to be applied despite Max’s assertions. I tend to think what generally happened was Jesus had a hasty burial that was to be completed after the Sabbath on Sunday. I also wonder if that strip down the side of the shroud was used like John Jackson supposes which is to say it tied up the whole body or if in the case of a hasty burial where the ritual spices were to be used later it was used just to tie the arms in place to hold them down. It could then be easily untied and the burial ritual could be continued and completed fairly easy. One thing I’m coming away from this discussion is that it’s definitely real blood on the shroud regardless of the color of it. It’s really just a matter of determining what mechanisms make for the color. Truthfully, I was never really swayed about the bright red color objection from skeptics because anecdotally I’ve had plenty of bandaids come off my own body and the blood has remained bright red even after days. Don’t know how valid that is but it struck me as more probable that the blood in the shroud is authentic even with the color of the blood being so bright..","date":"2012-02-17","mins":"10:18 pm","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-8440","author":"chris","post":"Good observations! Yeah, I’m starting to think we’re closer to the truth than not. One thing I thought was a really interesting detail that Jackson pointed out in his video was the bloodstain off the right elbow and how it corresponded with the shroud being tucked under the arm during wrapping. Not a detail that speaks to forgery is it? But it certainly is indicative that the shroud was wrapped in some way instead of just loosely laid over the body. Also, there not being any traces of spices seems to negate Max’s assumptions though I respect that it was probably the intended burial ritual. I don’t think they had time to execute it and it seems very involved. I would also think that there would be more capillary evidence on the shroud with the blood spanning out had it been soaked. The blood on the hair doesn’t really bother me as I think Jackson is right when he supposes that it was not really on the hair but on the sides of the face and the cloth came away before the image was made. If the strip was used only to tie the arms to keep them from spanning out during rigor mortis then someone may have smoothed the shroud over the head and it eventually moved away or collapsed due to not being tensioned or tied. Pure conjecture on my part, but it crossed my mind..","date":"2012-02-18","mins":"1:45 pm","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-8495","author":"chris","post":"The last time that was famously used it didn’t work out too well for the person who quoted it..","date":"2012-02-19","mins":"11:18 pm","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-8534","author":"chris","post":"And who is speaking here? The pot or the kettle?.","date":"2012-02-20","mins":"11:01 am","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-8546","author":"chris","post":"Then let her speak for herself..","date":"2012-02-20","mins":"2:09 pm","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-8233","author":"chris","post":"Fascinating discussion. I would like to see if there’s anything that discusses what methods were used on the acnient blood in both cases to avoid getting false postives for different blood types. If all the known precautions were taken it would seem that any conclusions made would be strong. However, there doesn’t seem to be anything along that lines published for laymen, yet..","date":"2012-02-14","mins":"11:13 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","title":"New thread on type AB blood: Does all old blood become AB?"},{"id":"comment-38732","author":"chris","post":"Wouldn’t the possibility of blood being added on later be precluded by the fact that it’s not whole blood but blood from exudated blood clots? And also wouldn’t the speculation that the blood probably came before the image (since there is no observed image under the blood stains) also preclude this?.","date":"2013-07-08","mins":"11:29 am","url":"https://shroudstory.com/2013/07/06/reader-has-jackson-come-to-realize-this/","cat":"blood_studies","title":"Reader: Has Jackson come to realize this?"},{"id":"comment-25835","author":"chris","post":"If it is observed accurately that the bloodstains in the hair are actually aligned with the sides of the face or the temples of the shroud Man and not with the hair does that suggest that the blood transfer mechanism happened at a different time than the image forming mechanism? Before perhaps? I say this because the cloth had to be touching for the blood transfer on the head to have happened – how long might that take in a humid sepulcher? It would seem to follow that the image formation process had to kick in after the cloth came away from the head perhaps as the bindings came loose? Does it seem possible that they acted simultaneously? If they did wouldn’t the image on the face be more distorted and far less focused because the cloth would necessarily need to be against the sides of the head for a lot of the image forming time? The cloth would also have to be in motion, even if ever so slowly, to allow the blood stains to come away from the head and register in the hair image. I would think that would produce major distortion and lack of focus. Complete speculation of course. If they could not have happened at the same time I wonder how long each process took. And what kind of clue would this be in the image formation process?.","date":"2013-02-27","mins":"2:44 pm","url":"https://shroudstory.com/2013/02/26/that-is-not-what-one-would-expect-to-see-if-the-blood-first-dogma-were-true/","cat":"blood_studies","title":"That is not what one would expect to see if the blood-first dogma were true."},{"id":"comment-13885","author":"chris","post":"Ron : Now Colin is an expert in blood…unbelievable! Question is why Dan keeps rehashing this Sciencebod. R Ron, what I find interesting in Colin’s approach to many of these matters is his stance that many of the scientists were working out of their specialization (heretical is the term I think was mentioned) but he has no problem approaching matters out of his own specialization. Personally, I find nothing wrong with most scientists working out of their specialization so long as they’re wide open to have others scrutinize their work (especially scientists who are specialized in the field of study). This is how we all learn. It’s not a entirely valid argument in itself to criticize someone outside of a specialization unless one can conclusively show that such ignorance on it’s face is the cause of faulty findings. The work on the shroud is no different than work in other areas, you will have good hypotheses and bad hypotheses. It is up to the participants and the audience to sort them out together. It is clear to me that the shroud keeps Colin up at night, as I have stated before. I also think it also drives him to espouse some of his more biased arguments. In general though it is good for even folks from his point of view to look at and opine on these matters as it gives a different perspective which may be very valuable. It’s just that, as with all perspectives and approaches, the audience has to separate the faith and pure speculation from fact..","date":"2012-07-15","mins":"7:51 pm","url":"https://shroudstory.com/2012/07/15/why-not-carbon-date-the-blood-on-the-shroud-of-turin/","cat":"blood_studies","title":"Why not carbon date the blood on the Shroud of Turin?"},{"id":"comment-13898","author":"chris","post":"Yannick, I think it bothers a whole lot of folks that is might be real. This life is temporary in all cases. I think a lot of folks want this life to be the only one though because they love it and that is at direct odds with Jesus’ instruction: “He who loves his life will lose it. He who hates his life in this world will keep it to eternal life.” It’s all the trouble of letting go. The best we can do is to pray that they allow His Grace in to do it’s job and impart the Peace that the world cannot give..","date":"2012-07-16","mins":"12:00 pm","url":"https://shroudstory.com/2012/07/15/why-not-carbon-date-the-blood-on-the-shroud-of-turin/","cat":"blood_studies","title":"Why not carbon date the blood on the Shroud of Turin?"},{"id":"comment-14383","author":"chris","post":"Bravo, Yannick! Another excellent article..","date":"2012-08-01","mins":"10:19 am","url":"https://shroudstory.com/2012/07/28/yannick-delights-with-another-great-paper/","cat":"blood_studies","title":"Yannick Delights with Another Great Paper"}],"dating":[{"id":"comment-11035","author":"chris","post":"I think it might be good for scientists to review Rogers’ method of dating using the lignin method. It might be good to know if there are any circumstances that could skew that result. We already know Rogers came up with a date far older than the carbon dating, it would be good to see other’s corroborate this work in this area..","date":"2012-05-01","mins":"10:58 am","url":"https://shroudstory.com/2012/04/29/carbon-dating-the-shroud-of-turin-again/","cat":"carbon_14_dating","title":"Carbon Dating the Shroud of Turin Again?"},{"id":"comment-37484","author":"chris","post":"He’s as bad as the Kennedy conspiracy theorists. Red Herrings abound. In the end they are merely bolstering their faith. Christianity doesn’t need the shroud, it’s a “nice to have”. Even if the shroud is authentic it doesn’t prove anything other than that Jesus was crucified in the manner the Gospels indicate. I can see for some people it could be an alarming thing to even have to acknowledge the existence of Jesus because it then starts to lead down a road they are not comfortable traveling so we have the fevered attack on the shroud. Even acknowledging Jesus as a real person (though ample historical evidence abounds) is tough for some of these folks – it’s a hard stop at reality. If the shroud can be discredited then it puts off the day they will have to confront any implications it’s reality and authenticity presents..","date":"2013-06-20","mins":"2:20 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-34122","author":"chris","post":"There are many that come to the shroud to confirm their faith – Colin is among them..","date":"2013-05-20","mins":"10:33 am","url":"https://shroudstory.com/2013/05/16/dog-in-this-fight-or-pony-in-this-race/","cat":"carbon_14_dating","title":"Dog in this fight or pony in this race?"},{"id":"comment-174484","author":"chris","post":"There’s a white spot where the supposed loin cloth was??? Where?.","date":"2014-12-03","mins":"12:38 pm","url":"https://shroudstory.com/2014/12/03/jerry-coyne-pope-francis-endorses-the-fake-shroud-of-turin/","cat":"carbon_14_dating","title":"Jerry Coyne:  Pope Francis endorses the fake Shroud of Turin"},{"id":"comment-174652","author":"chris","post":"I have come to the conclusion that the claim is pure gaslighting..","date":"2014-12-04","mins":"3:24 pm","url":"https://shroudstory.com/2014/12/03/jerry-coyne-pope-francis-endorses-the-fake-shroud-of-turin/","cat":"carbon_14_dating","title":"Jerry Coyne:  Pope Francis endorses the fake Shroud of Turin"},{"id":"comment-10931","author":"chris","post":"I believe Ray Rogers said that any further C14 dating of the shroud would be impossible because of the preservative that is now used to keep insects from damaging it. It is an organic insecticide, I think, and cannot be removed during any cleaning process so it will always be a contaminant and will always skew the C14 results. If that is true you can forget any future testing of the main cloth. I think he said the only thing left to test is the charred bits removed during the restoration as they were removed before the new chemical preservative was used..","date":"2012-04-28","mins":"9:56 pm","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin."},{"id":"comment-11034","author":"chris","post":"This is picking a debate with a dead man. It’s a little hard to swallow too especially since Rogers’ observations have been corroborated to some degree..","date":"2012-05-01","mins":"10:44 am","url":"https://shroudstory.com/2012/04/30/paper-chase-new-paper-challenges-rogers/","cat":"carbon_14_dating","title":"Paper Chase: New Paper Challenges Rogers"},{"id":"comment-8838","author":"chris","post":"Colin, it’s only 200 nm thick, c’mon let’s get with the program. If gold leaf can be achieved at this thickness this should be no problem for a retired science bod with a heck of a lot more education and resources at his disposal than a medieval artist..","date":"2012-02-29","mins":"8:43 pm","url":"https://shroudstory.com/2012/02/28/paper-chase-to-know-a-veil-by-philip-ball/","cat":"carbon_14_dating","title":"Paper Chase: To know a veil by Philip Ball"},{"id":"comment-8808","author":"chris","post":"Colinsberry : This “contamination” defence is now standard in our courts of law, and it relies on the truism that “one cannot prove a negative”, placing the burden of proof on the litigant. Anyone deploying so shoddy and disreputable a defence argument – on websites as well as courts of law – without strong evidence to back it up can be certain of earning at least one individual’s undying contempt, not that anyone will notice… Yeah, kind of like a person claiming the image on the shroud is a scorch without any proof and even in the face of evidence to the contrary. Then the same person charging others to prove it’s not a scorch in order to refute him..","date":"2012-02-28","mins":"6:49 pm","url":"https://shroudstory.com/2012/02/28/paper-chase-to-know-a-veil-by-philip-ball/","cat":"carbon_14_dating","title":"Paper Chase: To know a veil by Philip Ball"},{"id":"comment-32800","author":"chris","post":"Now this is a fascinating discussion. Hope we get more of this..","date":"2013-05-03","mins":"8:00 pm","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","title":"Special Request from Hugh Farey"},{"id":"comment-8980","author":"chris","post":"Colinsberry :. . . And I might feel more inclined to talk to you, rather than at you… Colin, this is what you have done from day 1 here – talk at people. It’s plain to see you’re not interested in actual scientific exchange otherwise you would have accepted to join the other scientists in their association when offered. You won’t go there and debate them, you’d rather stay here and beat laymen over the head with your knowledge of science. Make you feel good? Why don’t you pick on someone you’re own size, huh? You don’t because you probably know you’ll get run out of town on a rail and therefore won’t dare tread amongst minds as keen as you fancy you’re own. Nice of you to pick on dead men as well, so honorable. One needn’t be as knowledgeable as the person who’s conning him in order to realize he’s being conned. The fact that you constantly talk with forked tongue about how easy it would be for a forger to have made the shroud and how all it’s observed characteristics are nothing to be in awe of but yet you refuse to undertake the effort to reproduce it speaks volumes about what you’re real intentions are here. It’s all so easy, just a bunch arts and crafts until you’re asked to get in the arena and reproduce it. The thought of actually having to turn something out which will then come under the withering scrutiny of other scientists probably gives you hives. You’d rather burn a few trinkets into a cloth, blithely declare it’s a fair demonstration and call it a day. Then comes the endless leaving, but not leaving and the carping about having to deal with us. But you can’t stay away. I think you love it and not for good reasons. And when all this bad behavior is pointed out to you, you cry “Ad hom, ad hom! No fair!” What are folks to make of you when you act this way? What kind of respect is anyone supposed to give a grown man, who is retired no less, who only likes debating his inferiors in matters of his discipline? You’re indignation at our responses is laughable. I don’t know what you expect to achieve at this point but in my opinion it’s moot. Good day to you..","date":"2012-03-05","mins":"8:58 pm","url":"https://shroudstory.com/2012/03/05/you-must-be-kidding-colin-berry/","cat":"carbon_14_dating","title":"You must be kidding, Colin Berry"},{"id":"comment-8952","author":"chris","post":"I think the labs must have been employing the “Suck it and see it” method in order to debunk the Mickey Mouse science on the Euro Disney Shroud. Makes sense..","date":"2012-03-05","mins":"10:49 am","url":"https://shroudstory.com/2012/03/05/you-must-be-kidding-colin-berry/","cat":"carbon_14_dating","title":"You must be kidding, Colin Berry"},{"id":"comment-8967","author":"chris","post":"Ron, he knows he can’t reproduce it. He’s an intelligent man and deep down inside he knows how long the odds are that he’s right. Something in the way he goes on tells me it may be that he needs the shroud to be fake far more than we want it to be real..","date":"2012-03-05","mins":"5:01 pm","url":"https://shroudstory.com/2012/03/05/you-must-be-kidding-colin-berry/","cat":"carbon_14_dating","title":"You must be kidding, Colin Berry"}],"events":[{"id":"comment-8141","author":"chris","post":"“To enter the Kingdom of Heaven, we must have the faith and trust of a little child.” I see this as the fundamental basis of all Faith. Your points along these lines are excellent..","date":"2012-02-11","mins":"10:57 am","url":"https://shroudstory.com/2012/02/11/upcoming-exciting-exhibition-on-the-shroud-of-turin-in-mlaga-spain/","cat":"event","title":"Upcoming, exciting exhibition on the Shroud of Turin in Málaga, Spain"}],"history":[{"id":"comment-8800","author":"chris","post":"Yeah, I agree with Dave as well, the preponderance of the evidence points to authenticity. But I also accept that we will never have “proof” because God requires an Act of Faith for most of us. I believe some folks are granted proof for whatever reason (i.e. The Apostles and those who saw the Risen Jesus ascend to Heaven, for them Faith is no longer required because they have seen and know). I also agree with the sentiment that Faith is not compulsory as it is quite clear from the Gospels that God will not abrogate our free will (demonstrated be Jesus instructing His Apostles to walk away from those that would not receive them and the Gospel). It is probably because of God’s respect for free will that He requires an act of Faith from most. Ron’s point about discussion regarding the shroud is spot on. It is a very polarizing subject even among Christians. It challenges folks to the very core of their world view in many ways and people do not like that being touched at all. Most folks, I think, seek validation of their world view and the shroud poses a huge problem for a lot of people comfortable in their outlook, even Christians. This is exactly why you get so much activity on the part of those who hold the shroud is irrelevant or inconsequential. They *need* to believe it’s not real while those of us who have Faith don’t need it at all. If it were definitively shown to be a fake tomorrow it wouldn’t mean a hill of beans to Christianity and it’s tenets. But as long as it is not falsified I believe it bothers some folks to no end because of what it implies..","date":"2012-02-28","mins":"12:25 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture"},{"id":"comment-7372","author":"chris","post":"Beautiful redesign! Hat’s off to Barrie and everyone who made it happen. Excellent job, men!.","date":"2012-01-22","mins":"2:44 pm","url":"https://shroudstory.com/2012/01/21/bravo-wonderful-facelift-of-shroud-com/","cat":"history","title":"Bravo! Wonderful Facelift of shroud.com"},{"id":"comment-7912","author":"chris","post":"Yeah, that was a fascinating thread. I have nothing materially to add because I am not read on the matter but I will offer one thought. I thought I read somewhere, and I thought it was in Rogers’ work, that the image on the shroud may not have been immediately visible because it was created through a function of accelerated aging of the carbohydrate coating on the linen. So both the linen and it’s coating started aging but the coating aged faster and produced the image in time. Maybe if it took some time for the image to show up the shroud was merely locked away somewhere and thought of as an old bloody burial sheet. It doesn’t really hold a place of prominence in the Gospels and really is just mentioned in passing when the Resurrection is discovered. I think folks would be most interested in the artifacts of the crucifixion itself. Prior to discovering an image on the shroud maybe it was taboo to show given its association to a dead body. Perhaps if the delayed image theory has any merit to it then it might explain the relation to the sudden change in art. Maybe someone finally opened up and looked at the shroud after a few centuries of being stored away and suddenly discovered the image. Weak I know, but it crossed my mind at one point..","date":"2012-02-04","mins":"8:29 am","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","title":"Calling all history buffs: Interesting comments from Yannick Clément"},{"id":"comment-16510","author":"chris","post":"As Andy mentioned this is old news. It will be celebrated by those who look for anything to cast doubt on the Christ Story. Even if the papyrus was genuine it still means nothing as it is an issue that’s been debunked a long time ago..","date":"2012-09-19","mins":"12:40 pm","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","title":"Hot New Topic: The Wife of Jesus"},{"id":"comment-9389","author":"chris","post":"Dave, even if you misquoted it’s clearly not directed towards anyone. What’s worth pondering is why someone would react as if they felt personally stung by the comment. Most times on sites like this someone would merely ask for clarification on the quote, a link perhaps, before offering sentiments regarding it’s authenticity and application. Not so with some..","date":"2012-03-16","mins":"8:24 pm","url":"https://shroudstory.com/2012/03/15/maybe-the-james-ossuary-is-jesus-brothers-tomb-maybe-not/","cat":"history","title":"Maybe the James Ossuary is Jesus’ Brother’s Tomb, Maybe Not"},{"id":"comment-9399","author":"chris","post":"Colinsberry : As I indicated, I found myself on the receiving end of that same misquotation back in February, which you can easily confirm by googling. If you know of Godwin’s Law of internet forums, you will understand the attraction that particular misquotation holds for those who indulge in misrepresentation or ad hom as so many do on this site. Indeed, you are guilty of misrepresentation yourself, in suggesting I took the “fascism” comment personally in the present context. I did not, as a careful re read should make clear. I have responded to your earlier “bankrupt scorch theory” on my own new site (http://strawshredder.wordpress.com). As indicated previously, I no longer feel this site to be a suitable forum for discussing technical and scientific detail given the sniping, the misrepresentation, the gratuitous and offensive ad hom and, more recently, the pre moderation and threatened editing of my comments. Who said I was talking about you? ;).","date":"2012-03-17","mins":"1:06 pm","url":"https://shroudstory.com/2012/03/15/maybe-the-james-ossuary-is-jesus-brothers-tomb-maybe-not/","cat":"history","title":"Maybe the James Ossuary is Jesus’ Brother’s Tomb, Maybe Not"},{"id":"comment-38735","author":"chris","post":"NBC is still on the air?!?!?! ;).","date":"2013-07-08","mins":"1:45 pm","url":"https://shroudstory.com/2013/07/07/nbc-news-on-the-archaeology-of-christianity/","cat":"history","title":"NBC News on the archaeology of Christianity"},{"id":"comment-9388","author":"chris","post":"I love how the whole banding drives Colin to distraction. It so completely undercuts his bankrupt medieval scorch theory he has to somehow discount it. So far, not convincing. . . At all..","date":"2012-03-16","mins":"8:16 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”"},{"id":"comment-9370","author":"chris","post":"I wonder what this process does to the rest of the body images. Seems to be spot on with the face..","date":"2012-03-16","mins":"10:25 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”"},{"id":"comment-14710","author":"chris","post":"I think it might be humble to say, “We don’t know” or “We cannot explain it with our current state of knowledge”. It is also humble as well and a leap of Faith to say, “I believe in Jesus’ Resurrection and I believe the image left on the shroud is a sign of it”. When we are born the only thing we have is Faith – Faith that our parents will love us and care for us to give us life because we are utterly incapable of doing so for ourselves as infants. It is this same Faith that Jesus has taught us is necessary to come to the Father because in every age there are things that we just cannot know. Perhaps we as humans may never “know” how the image was made on the shroud until the veil is lifted but perhaps, and more importantly, it is a great sign of Love from the Father to strengthen your Faith..","date":"2012-08-10","mins":"8:59 am","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","title":"Imagine the image as part of the resurrection and not the result of the resurrection"},{"id":"comment-28340","author":"chris","post":"Paulette, the narcissist is always right and everyone else is the problem. It’s always a conspiracy theory and everyone else is blind to it. They never want to show their cards when called on to do so but constantly want to see what hand everyone else is playing. It’s all a ploy for attention. It is folly to engage them on a continual basis for it feeds them. To do so is to be like a hamster on a wheel that thinks he’s getting somewhere when in reality he’s going nowhere. And the narcissist is so pleased to keep you on that wheel, spinning away..","date":"2013-03-25","mins":"12:35 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28344","author":"chris","post":"Colinsberry :There must be easier ways of doing this narcissism thing (180+ postings to date – only a relatively small number of which, not surprisingly, have been showcased on this site). Ever heard the origins of the word “blog”? Like, you know, weblog – a running account in real time of some interest one has picked up, and wishes to communicate to kindred spirits?Oh, and I do have other interests you know (current affairs, the EU, UKIP, Stonehenge, climate change, nutrition, astronomy etc etc). There’s no obligation to read, you know, if the ideas expressed are not to your liking… There are millions of other blogs out there you could visit. Or there again, maybe my iconoclasm has sown a seed of doubt, and you just can’t tear yourself away… Please know that I always remember you in my prayers..","date":"2013-03-25","mins":"1:05 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-11063","author":"chris","post":"Agree 100%..","date":"2012-05-02","mins":"8:43 am","url":"https://shroudstory.com/2012/05/02/two-thousand-year-old-ointment-residue-discovered-on-the-shroud/","cat":"history","title":"Two Thousand Year-Old Ointment Residue Discovered on the Shroud"},{"id":"comment-11897","author":"chris","post":"Yeah, this makes total sense. Were the positioning too perfect it would be a signal against authenticity. But I think you drew that one green line of the dorsal image too far down. I’m thinking it should be a tad closer to the edge of the cloth (still an asymmetrical orientation). Aren’t the toes visible above that line? Being a smaller image than I’m normally used to looking at you may have included them but I know they are definitely there on the shroud. The toes being present on the dorsal image does make me wonder if the shroud was tied in some way because if Jesus was laying on his back in the tomb, as we suppose, I imagine the cloth would have to have been held up against the soles of his feet somehow in order to get the image. Was there a foot rest in the tomb or was the shroud tied like in the Jackson hypothesis?.","date":"2012-06-04","mins":"11:55 am","url":"https://shroudstory.com/2012/06/04/yannicks-nice-surprise-folding-test-on-the-enrie/","cat":"history","title":"Yannick’s Nice Surprise:  Folding Test on the Enrie"}],"image":[{"id":"comment-8435","author":"chris","post":"In theory there is no difference between theory and reality. In reality there is..","date":"2012-02-18","mins":"12:20 pm","url":"https://shroudstory.com/2012/02/18/a-new-hypothesis-leapfrogging-luigi-garlaschelli/","cat":"image_theory","title":"A New Hypothesis: Leapfrogging Luigi Garlaschelli"},{"id":"comment-7866","author":"chris","post":"Colin’s sandbag theory seems like “Belling of the Cat”..","date":"2012-02-02","mins":"2:10 pm","url":"https://shroudstory.com/2012/02/01/a-new-theory-for-how-the-turin-shroud-was-faked/","cat":"image_theory","title":"A new “theory” for how the Turin Shroud was faked"},{"id":"comment-7876","author":"chris","post":"Tut, tut, Colin! You’re supposed to be “not responding” for a week! Back to the lab with you!.","date":"2012-02-02","mins":"3:20 pm","url":"https://shroudstory.com/2012/02/01/a-new-theory-for-how-the-turin-shroud-was-faked/","cat":"image_theory","title":"A new “theory” for how the Turin Shroud was faked"},{"id":"comment-8729","author":"chris","post":"Dan, you have to admit Colin has been very entertaining. And the old boy did try something though he came short of actually stepping in the arena. And even though all his experiments were invalid and he proved nothing he did put on a good show..","date":"2012-02-25","mins":"5:11 pm","url":"https://shroudstory.com/2012/02/25/bertrand-russell-comes-to-mind/","cat":"image_theory","title":"Bertrand Russell comes to mind"},{"id":"comment-8813","author":"chris","post":"Colinsberry : Only the dyed in the wool (thread?) denialista of the Shroudie world swallow the tale about invisible reweaving, spliced threads, alizarin dyed new threads etc… Oh, how grand, we’re starting to see true colors. Colin, tut, tut! Such ad hom from someone who so vigorously protests such arguments. Seems like there’s more evidence for the patch theory than the scorch theory..","date":"2012-02-28","mins":"9:37 pm","url":"https://shroudstory.com/2012/02/25/bertrand-russell-comes-to-mind/","cat":"image_theory","title":"Bertrand Russell comes to mind"},{"id":"comment-8798","author":"chris","post":"Ron, he’s just upset because he wasn’t able to prove anything and I think he notices that people are starting to get the notion that they ought not to take him seriously. Notice he keeps prattling on and on about it being a scorch without actually demonstrating that it is. It’s a shell game and he likes the attention..","date":"2012-02-28","mins":"11:00 am","url":"https://shroudstory.com/2012/02/25/bertrand-russell-comes-to-mind/","cat":"image_theory","title":"Bertrand Russell comes to mind"},{"id":"comment-16403","author":"chris","post":"I think he might be in a war with his heart..","date":"2012-09-17","mins":"1:07 pm","url":"https://shroudstory.com/2012/09/16/better-than-david-rolfes-dawkins-challenge/","cat":"image_theory","title":"Better than David Rolfe’s Dawkins Challenge?"},{"id":"comment-21793","author":"chris","post":"Nit picking is his only avenue since he cannot reproduce the cloth..","date":"2013-01-09","mins":"1:48 pm","url":"https://shroudstory.com/2013/01/08/colin-berry-takes-on-banding-and-more/","cat":"image_theory","title":"Colin Berry Takes On Banding and More"},{"id":"comment-11580","author":"chris","post":"Every time I read Yannick’s long posts it confirms a lot of what I have read and have speculated in my private mind – not all of it, but much of it. I also get the sensation that we all should be handed a diploma..","date":"2012-05-24","mins":"7:34 pm","url":"https://shroudstory.com/2012/05/21/creative-comment-of-the-day-by-colin-berry/","cat":"image_theory","title":"Creative Comment of the Day by Colin Berry"},{"id":"comment-8493","author":"chris","post":"Let Colin go on. I have a suspicion that through the absurdity of his arguments he may wind up showing the Resurrection was more probable..","date":"2012-02-19","mins":"10:58 pm","url":"https://shroudstory.com/2012/02/19/i-dont-get-it-writes-a-reader-about-colin-berrys-hypothesis/","cat":"image_theory","title":"I don’t get it, writes a reader about Colin Berry’s Hypothesis"},{"id":"comment-8533","author":"chris","post":"And here we have the crucial admission that it can’t be done. Sorry folks there’s nothing to see here and you won’t be seeing any arts and crafts to demonstrate these castles in the sky. He’s too intimidated to actually get in the arena. It’s up to everyone else to prove his negatives..","date":"2012-02-20","mins":"10:58 am","url":"https://shroudstory.com/2012/02/19/i-dont-get-it-writes-a-reader-about-colin-berrys-hypothesis/","cat":"image_theory","title":"I don’t get it, writes a reader about Colin Berry’s Hypothesis"},{"id":"comment-8542","author":"chris","post":"Colinsberry :Shame. Just when I was starting to warm (again) to this site. Time methinks to take another break (during which Dan will maybe see fit to lift the pre moderation on my comments too). Well, what do you expect? You have all these great ideas but not the will to demonstrate them? You are full of hubris yet very shy when you’re own words are trained back upon you to show the fly in your ointment. You want love and respect, show a little. I’m all for rigorous debate on the scientific merits but gosh, at some point you gotta show something beyond mere words..","date":"2012-02-20","mins":"1:20 pm","url":"https://shroudstory.com/2012/02/19/i-dont-get-it-writes-a-reader-about-colin-berrys-hypothesis/","cat":"image_theory","title":"I don’t get it, writes a reader about Colin Berry’s Hypothesis"},{"id":"comment-9250","author":"chris","post":"Less dictating and talking at people and more independent review of your claims, please..","date":"2012-03-12","mins":"9:55 am","url":"https://shroudstory.com/2012/03/12/irene-corgiats-shroud-of-turin-image/","cat":"image_theory","title":"Irene Corgiat’s Shroud of Turin Image"},{"id":"comment-8927","author":"chris","post":"Dr. Jackson, Thanks so much for your note. Great reading and very informative. To Colin’s experiments is it possible the medieval forger used a giant onion when making his forgery? Think of all the excellent French onion soup he could have made with the leftover parts! ; ).","date":"2012-03-04","mins":"3:24 pm","url":"https://shroudstory.com/2012/03/04/john-jackson-on-colin-berrys-highly-misleading-comments/","cat":"image_theory","title":"John Jackson on Colin Berry’s “highly misleading” comments"},{"id":"comment-16512","author":"chris","post":"I read somewhere that there is a body image on a burial tunic. I can’t put my finger on it right now but perhaps more study of that image might yield some clues? I wish I could recall it now..","date":"2012-09-19","mins":"1:00 pm","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","title":"Latest on David Rolfe’s Site on Maillard Reaction"},{"id":"comment-20146","author":"chris","post":"He is chasing rainbows. One day he shall rest..","date":"2012-12-10","mins":"1:10 pm","url":"https://shroudstory.com/2012/12/05/monsieur-the-scorch/","cat":"image_theory","title":"Monsieur the Scorch"},{"id":"comment-138945","author":"chris","post":"Was it finger lickin’ good? (couldn’t resist).","date":"2014-07-17","mins":"1:15 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?"},{"id":"comment-13796","author":"chris","post":"Shroudenigma : Nothing I say should suggests anything but the deepest respect for Ray Rogers. Neither does it follow that my criticism of the Maillard hypotheses indicates favoring any other particular image formation theory. The fact is that nowhere in history or indeed today can anyone point to any kind of image produced by a Maillard reaction. If its supporters deem it possible to create a 14ft evenly graduated image of both sides of a corpse then they should be able to show, say, a 6 inch version of anything. Until they can, I suggest that time spent theorizing and eulogizing would be better spent making one. This is reasonable and I think Rogers would agree. In short we need more experimentation with this hypothesis. I think Rogers hypothesis of a Maillard reaction is the most plausible but we need scientists to actually pursue it to see where it leads..","date":"2012-07-12","mins":"7:43 pm","url":"https://shroudstory.com/2012/07/11/rejecting-all-the-energetic-hypothesis-for-the-shroud-of-turin-image/","cat":"image_theory","title":"Rejecting all the “energetic” hypothesis for the Shroud of Turin image"},{"id":"comment-7640","author":"chris","post":"Ron, I’m beginning to think all he wants to do is talk and drive traffic to his own site by biting off Dan’s more popular blog. It’s a known technique for those managing less popular topics on their own site to drive traffic their way (this is rampant in political blogs). For all his claimed credentials he keeps missing minor details (like scorches fluoresce) when he makes his assertions. You would think that someone of his claimed caliber would pick up on the details before he makes his claims instead he says he has, ah, what did he call them?, “senior moments”. I can understand those but they seem too convenient in this context. Last week it was a cadaver that made the shroud, this week it’s bas relief with scorches, next week – who knows? One things seems near certain about his assumptions – it cannot be what it simply purports to be – an actual burial cloth that may have an image on it from a natural phenomenon, hence the swags. He’s grasping at straws. And when constructive criticism is leveled his response is more or less that someone else is blind, not him. It’s a pattern. It reveals, I think, something more about him than anything about the shroud. He can claim anything he wants with regard to his experiments as it is the internet but until he puts forth something that can be put in the hands of others and his work can be reviewed by peers the rubber has not met the road so to speak. Until then he might as well be the wind howling. I wish him peace and good will in his life..","date":"2012-01-28","mins":"2:29 pm","url":"https://shroudstory.com/2012/01/26/sciencebod-reacts/","cat":"image_theory","title":"Sciencebod reacts"},{"id":"comment-7609","author":"chris","post":"Well, looks like you’ve definitely convinced yourself, Colin. The only thing left to do is create a Euro Disney Shroud with all the gee whiz features from your arts and crafts skills and submit it for analysis. Should be easy now that you’ve got it all figured out. And now that you’re retired you should have plenty of time to get it right and put everyone in their place. Good luck..","date":"2012-01-27","mins":"6:22 pm","url":"https://shroudstory.com/2012/01/26/sciencebod-reacts/","cat":"image_theory","title":"Sciencebod reacts"},{"id":"comment-7714","author":"chris","post":"It may be appropriate to say that the effect of the process which created the image is 3 D encoding even though we do not know the exact mechanism of image formation. Does anyone know if tests were ever done with cadavers (morbid, I know) wrapped in shrouds (made like Ray Rogers had made)? I can’t find anything with regards to that. I don’t know how feasible such experiments would be but I’d be curious to see if by replicating the conditions of the burial with several specimens and examining the shrouds at different time intervals if anything might be learned..","date":"2012-01-30","mins":"2:00 pm","url":"https://shroudstory.com/2012/01/30/sciencebods-3d-problem/","cat":"image_theory","title":"Sciencebod’s 3D Problem"},{"id":"comment-10454","author":"chris","post":"Personally, I’m not so sure there AREN’T any eyebrows as I see faintly what I would consider could be taken as eyebrows..","date":"2012-04-16","mins":"1:29 pm","url":"https://shroudstory.com/2012/04/16/the-image-on-david-rolfes-website-absence-of-eyebrows/","cat":"image_theory","title":"The Image on David Rolfe’s Website:   Absence of Eyebrows?"},{"id":"comment-48252","author":"chris","post":"Meh, I’d be happy if someone well versed in ancient blood characteristics weighed in..","date":"2013-10-21","mins":"11:07 am","url":"https://shroudstory.com/2013/10/21/todays-how-do-we-know-the-image-is-not-painted/","cat":"image_theory","title":"Today’s How do we know? The image is not painted"},{"id":"comment-90086","author":"chris","post":"Forgive me if, as a layman, this sounds naive but if the image were a scorch then the image and the known scorches on the cloth of the same faintness should have the same characteristics, right? Given that the premise is that the cloth is of medieval origin then all the scorches, including the proposed image scorch, would be the same age. It should be a simple comparison that might lay the question to rest immediately if they are not comparable. And hasn’t this been done with Barry’s photography? All the known scorches fluoresce, correct? Yet the image does not, correct? If the image were a scorch of the same age and suffered the same effects of time, handling, etc then it should fluoresce like the others which are of the same intensity, right? If it doesn’t fluoresce then it’s not a scorch like the others. It’s tough to explain away the difference in characteristics. If the image were a scorch I’m thinking you would at least see some fluorescing, even intermittently, somewhere in that image..","date":"2014-03-17","mins":"12:59 pm","url":"https://shroudstory.com/2014/03/14/two-comments-promoted-colin-berry-has-cracked-the-shroud-enigma/","cat":"image_theory","title":"Two Comments Promoted:  Colin Berry Has Cracked the Shroud Enigma?"},{"id":"comment-8061","author":"chris","post":"After reading much on this after Helmut’s urging it became abundantly clear to me that the mattress image was most likely a contact image made by blood highly influenced by the cocktail of chemicals administered to the patient. For lack of a better phrase it seems to be a fused stain. This was evident to me by the fact that in image area scrapings blood constituents were detected on the fibers while non image area scrapings did not show any blood constituents on the fibers. The mattress image in my understanding is not comparable to the shroud image because it does not have the same physical and chemical properties. What is also implied by what I read about the mattress image was that the person need not have been alive when the image on the mattress was formed. I found that interesting because Helmut does believe that a live body is what was needed to make the shroud image. I find the unsmeared state of blood stains on the shroud to be evidence against this as I believe Helmut held forth that Jesus’ crucifixion survival would have been uncovered rather quickly while preparing Him for burial. And at that point Jesus would have been secreted away for recovery. I would think that the shroud would look highly smeared would that have been the case and in that case that Jesus survived in the tomb for any length of time the shroud would have been soaked with far more blood than we see. Either way, the mattress image is irrelevant..","date":"2012-02-08","mins":"2:53 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","title":"Why do we think the Resurrection was a process? What if it was not?"},{"id":"comment-8055","author":"chris","post":"I do not know what caused the image on the shroud but I know it shows the Passion of Christ. I am inclined to suspect that the image was a product of a natural phenomenon as yet not understood (also, didn’t Rogers rule out a scorch?). I am inclined to believe that the shroud does not show the Resurrection but I am in awe of the fact that we have an artifact from the most famous execution in all Man’s history documenting it. The fact that you have such tangible evidence from this historical event should make anyone pause to reflect what the probabilities are that we would have such an object from such a time. Is there a message that comes with such an improbable object even if it was formed naturally? One thing is clear, the cloth once wrapped a Body and that Body is now no longer wrapped in it. His followers testify that He walked out of the tomb under His own power and ascended to heaven before their very eyes. They were not afraid of death to spread that information. They had more than the gift of Faith, they knew what awaited them after this life..","date":"2012-02-08","mins":"12:47 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","title":"Why do we think the Resurrection was a process? What if it was not?"},{"id":"comment-23087","author":"chris","post":"Indeed, I think that for it’s time the shroud is overkill if it’s a forgery. As Yannick has pointed out the blood evidence alone would suggest authenticity as it is nearly inconceiveable that any medieval forger would have any incentive or knowledge to go to such lengths to create such an artifact. Given this the probability that this was created as a forgery in such detail – by accident – is extremely low..","date":"2013-01-31","mins":"11:45 am","url":"https://shroudstory.com/2013/01/31/how-could-a-medieval-mind-create-an-image-such-as-the-one-on-the-shroud/","cat":"uncategorized","title":"How could a medieval mind create an image such as the one on the shroud?"},{"id":"comment-34472","author":"chris","post":"I very much agree with this. The “why” will never be answered by science..","date":"2013-05-23","mins":"11:20 am","url":"https://shroudstory.com/2013/05/23/resurrection-what-happens-with-quantum-entanglement/","cat":"science","title":"Resurrection:  What happens with quantum entanglement?"}],"misc":[{"id":"comment-15076","author":"chris","post":"Just doing a google search on the matter I believe the XX claim comes from Frank Tipler a physicist. Supposedly the blood DNA on the shroud was analyzed with the results published in an “obscure Italian journal”. The results were a photocopy of the output of the analysis with no accompanying interpretation. Mr. Tipler claims to have been able to instantly interpret the data and the story it tells is that the DNA on the shroud came from an XX male which is completely consistent with a Virgin Birth. Fascinating to ponder but I wouldn’t put any stock in at all right now because in everything I’ve read I never saw a link or even a name reference to the Italian magazine it was supposedly published in. I did, however, see plenty of links to Mr. Tipler’s book (Physics of Christianity) where this is claimed. Perhaps he’s more forthcoming in his book, but I haven’t read it so I don’t know. I couldn’t find anything on Barry’s site except a reference in the British Society for the Shroud of Turin’s newsletter. That doesn’t mean that there’s not something more there just that I couldn’t find anything in the short search I did. If anything this is a far fetched claim that will need further study before it can even be considered. For what it’s worth overall this was a decent presentation but I think the presenter does get a few minor points wrong..","date":"2012-08-16","mins":"1:45 pm","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","title":"A Winning Shroud of Turin Expository Speech"},{"id":"comment-15097","author":"chris","post":"So apparently it is a exceedingly rare but a natural thing for a woman to pass on an XX genetic code with the Y gene imbedded in one of the X’s. From the very little I’ve read on this today it’s not a reach for this to happen. There’s something that’s called an “SRY” gene (I think) that gets turned on inside one of the X genes and it acts as the Y chromosome and at the same time the X gene it’s implanted in is “turned off”. This makes the person with this disposition a full male. I gather the gist of it is that he got that way by a round about approach. What’s being alleged is that this has been confirmed with the blood evidence on the shroud. I find it very hard to accept though because there is almost nothing to back up the claim. That and the fact that other scientists have claimed that the DNA on the shroud is too old and to fragmented to yield anything of worth make me very skeptical that any such information can be gleaned from the biological evidence left on the shroud. If it can be published, interpreted and reviewed in an acceptable scientific manner then it might be something worth looking at but otherwise I don’t see any merit to the claim. And I don’t think it wise that this lady should have included this claim in her presentation because it just cuts her credibility away to nothing. It does more harm than good to her cause of educating folks on the Shroud. Just my 2 cents..","date":"2012-08-16","mins":"8:08 pm","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","title":"A Winning Shroud of Turin Expository Speech"},{"id":"comment-25165","author":"chris","post":"Pray his heart is opened..","date":"2013-02-21","mins":"11:54 am","url":"https://shroudstory.com/2013/02/21/atchity-isnt-exactly-a-fan-of-benedict-xvi-or-the-shroud-of-turin/","cat":"news_&_views","title":"Atchity isn’t exactly a fan of Benedict XVI or the Shroud of Turin"},{"id":"comment-19076","author":"chris","post":"Well, I pray as Christ did that we as one and not let politics intervene in our relationships with one another. That said, Rome will never accept female priests or bishops. Such ordinations (and there are those on the Catholic side as well who have attempted female ordination) are completely invalid and therefore they cannot effect any sacrament in Rome’s eyes. This will be a major stumbling block to any reunification. Hopefully there can be a solution that’s acceptable to both sides one day..","date":"2012-11-15","mins":"1:54 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19209","author":"chris","post":"I would just like to point out one thing with regards to Yannick’s assertion that Jesus would have been stoned to death. I think it might be a slight oversight on his part. I mean this will all due respect but it is an obvious mistake. The assertion that Jesus would have been stoned to death is patently absurd because it was the Risen Jesus that ordained the Apostles. He had already suffered death and was resurrected at that point. There was absolutely no chance that he would have been stoned. Remember He remained for quite a while among them after His Resurrection. He had absolutely no fear of any repercussion at this point and if He instructed His Apostles to ordain women as well as men I think they would have done it. After all none of them feared preaching the Gospel, which is Truth, even under fear of being murdered. And all of them were murdered, save one, in the course of preaching the Truth as the Risen Lord instructed them..","date":"2012-11-19","mins":"2:31 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19238","author":"chris","post":"Yannick Clément : Chris, you get me completely wrong, the so called “ordination” I referred to was when he choose his 12 disciples ! And don’t you forget that the Resurrected Jesus appeared to some women well before he appeared to the 12 apostles ! Don’t you think there is a sign there ? And don’t forget that it was as much impossible to Jesus to “ordained” some women after his Resurrection as it was before he died because the time was still no good at all for this kind of drastic change that would never have been accepted by the Jewish people of that era ! And I still wait for someone to challenge my main argument : IT IS A FACT THAT SOME WOMEN HAVE RECEIVED A CALL FOR PRIESTHOOD JUST LIKE MEN !!! Don’t you think this is another great sign of the Holy Spirit ? If God really wanted to keep women out of priesthood, don’t you think it would be logical to expect that no women would get a call from him ??? But that’s NOT the reality. The truth is the opposite. There really are some Catholic women who are called for priesthood ! And I don’t see one good reason to reject their call… Yannick, Yes, I understand all that but my point is that the argument that He feared stoning is exceedingly weak. The same Jesus that was bold enough to tell the priests of the time that whores will enter the Kingdom of Heaven before them, tell them that they are a brood of vipers, smash their monopoly in the Temple market place by physically over turning the tables and avoid, at Will, their attempts to arrest Him before the appointed time is not likely to be suddenly timid on the subject of ordaining women. Also, Jesus didn’t hesitate to raise the status of women to that of men when he told the priests and men of the time that they could no longer divorce women at will like a piece of mere chattel. I am not arguing either way only pointing out that the arguments being employed are untenable. Better arguments must be pursued. I find it also rather contradictory the attitude that it is ambiguous that Jesus actually ordained anyone versus the conviction that female ordination is absolutely what Jesus would desire. Again not arguing either way it’s just untenable to hold both views at the same time. Of course, if one held the view that no one is “ordained” only “called to serve” and that there is nothing conferred with Holy Orders/ordination it might be more consistent in some ways but it also begs the question of why should anyone care about ordination at all? Why even bother to expend any effort on this issue at all? Folks can just go and do what they feel is in their hearts (and many have) and ignore the hierarchy of the Church. My suggestion is that a strong legitimizing argument is only going to be found in the Traditions of the Communities in the early Church. More research may need to be done in order to establish this. Everything else is speculation and projection and more importantly will not win converts. More importantly, this attitude amongst some Christians, with regards to this issue, of ‘I am right, you are wrong’, ‘it’s my way or the highway’, ‘you’re not evolved’ etc etc etc is not productive in fostering relationships among us. No one is willing to entertain “what if my point of view is actually wrong on this issue?” That’s a problem for both sides. Is it not more important that we, above all, love one another even in the faults we see in one another? Yes, to me, it’s more important to learn to love like Him because it is in learning to love like that in this life, which is incredibly short in the vastness of eternity, which connects us to the Divine Love of the Risen Christ which in turn rescues us from our temporal condition. Beating each other up over political issues like this cannot get us closer to that and therefore cannot get us closer to Him..","date":"2012-11-19","mins":"11:45 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19100","author":"chris","post":"Dave, you are illustrating the very thing I am pointing out in my post: both sides are very passionate about this issue and seemingly it is a huge political stumbling block to healing relationships among Christians of all stripes. Each side believes the other is just going to have to back down. That’s not a solution. I don’t purport to have one but I think whatever solution comes about will have to begin with humility on all sides. It all begins with praying “not my will but Thine be done”..","date":"2012-11-16","mins":"1:08 am","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19207","author":"chris","post":"So Dave, do you not have Faith that God will prevail? If any man is convinced of his position then pray God makes it so if it is His Will and leave it in His Hands. That’s what we are called to do, that is humility. It may not happen in our life times but if it is His Will it will surely happen..","date":"2012-11-19","mins":"12:45 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-8215","author":"chris","post":"I think to Ron’s point: what was published in Nature and what actually happened may be two different things in a lot of respects. Had the review process had all the facts in hand it may have gone another way..","date":"2012-02-13","mins":"9:52 pm","url":"https://shroudstory.com/2012/02/13/comment-of-a-superfluous-man-brought-to-the-top/","cat":"news_&_views","title":"Comment of A Superfluous Man Brought to the top"},{"id":"comment-8216","author":"chris","post":"Gabriel, I don’t think an analysis of a pony tail would yield any meaningful results. The hair on the back image is fainter than the body image on the same side and it’s very  undefined. So I don’t think a definitive outline could be ascertained. As an aside, this characteristic of the hair on the reverse image is something that proponents of forgery are going to have a hard time grappling with and explaining..","date":"2012-02-13","mins":"9:59 pm","url":"https://shroudstory.com/2012/02/13/comment-of-a-superfluous-man-brought-to-the-top/","cat":"news_&_views","title":"Comment of A Superfluous Man Brought to the top"},{"id":"comment-8217","author":"chris","post":"Mr Superfluous, I like the St. Thomas More picture. I think that’s by Holbein? He is one of my heroes and someone who’s courage I hope to imitate. There have been a few times in my life when I’ve had to depart from others in their path for moral reasons. There have been a least a couple of occasions where I was confronted and asked why I could not go along with others in their behavior when they didn’t see anything wrong with it. My response has always been to paraphrase More: “If you should die and go to Heaven for following your conscience and I should die and go to Hell for nor following mine, will you join me for fellowship’s sake?” The response is always the same as More received: silence. It’s good to know some things are eternal..","date":"2012-02-13","mins":"10:07 pm","url":"https://shroudstory.com/2012/02/13/comment-of-a-superfluous-man-brought-to-the-top/","cat":"news_&_views","title":"Comment of A Superfluous Man Brought to the top"},{"id":"comment-8300","author":"chris","post":"Should be interesting to see if the Wizard of Bod participates. I don’t think his goal is friendly debate though so I don’t expect much..","date":"2012-02-15","mins":"12:28 pm","url":"https://shroudstory.com/2012/02/15/friendly-patient-on-line-written-debate-about-the-shroud-of-turin/","cat":"news_&_views","title":"Friendly, patient, on-line, written debate about the Shroud of Turin?"},{"id":"comment-12574","author":"chris","post":"This is like reading War & Peace. . ..","date":"2012-06-15","mins":"10:40 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","title":"Gas Diffusion and the Banding Effect"},{"id":"comment-7425","author":"chris","post":"John, some people’s faith lead them to believe that Leonardo was the only person who could work miracles. ; ).","date":"2012-01-23","mins":"1:46 pm","url":"https://shroudstory.com/2012/01/23/has-playful-leonardo-left-us-a-clue-in-the-salvator-mundi/","cat":"news_&_views","title":"Has Playful Leonardo Left Us a Clue in the Salvator Mundi?"},{"id":"comment-13794","author":"chris","post":"Yep. “IT” wasn’t actually found. Years may pass before we know exactly what was found. At the same time it might be relatively quickly that we can rule out Higgy Baby yet still have a bosson on our hands. “Old Spice means quality said the Captain to the Bosson!” Gabriel : After all it may not be the bosson of Higgs yet…http://www.technologyreview.com/view/428428/higgs boson may be an imposter say particle/?ref=rss.","date":"2012-07-12","mins":"7:35 pm","url":"https://shroudstory.com/2012/07/07/higgs-boson-and-religion-and-science/","cat":"off_topic","title":"Higgs Boson and Religion and Science"},{"id":"comment-13795","author":"chris","post":"Chris : Yep. “IT” wasn’t actually found. Years may pass before we know exactly what was found. At the same time it might be relatively quickly that we can rule out Higgy Baby yet still have a bosson on our hands. “Old Spice means quality said the Captain to the Bosson!” Gabriel : After all it may not be the bosson of Higgs yet…http://www.technologyreview.com/view/428428/higgs boson may be an imposter say particle/?ref=rss Oh, forgot to say none of it, no matter what the outcome, has anything to do with Religion or Theology..","date":"2012-07-12","mins":"7:37 pm","url":"https://shroudstory.com/2012/07/07/higgs-boson-and-religion-and-science/","cat":"off_topic","title":"Higgs Boson and Religion and Science"},{"id":"comment-7094","author":"chris","post":"Sciencebod brings up an interesting point: I have read in many publications about there supposedly being many shrouds in history. Have any of them survived, I wonder? If so what do they look like? Or is it just conjectured that there were many shrouds due to the “relic industry” of the middle ages? If another shroud exists it would be good to have for comparison even if it was a blatantly bad attempt at relic forgery. It might give folks a sense of how bad or how good such efforts turned out in such times..","date":"2012-01-17","mins":"11:40 am","url":"https://shroudstory.com/2012/01/16/it-is-enough-to-make-you-want-to-become-a-skeptic/","cat":"news_&_views","title":"It is enough to make you want to become a skeptic."},{"id":"comment-7100","author":"chris","post":"Dan, these are fascinating. Thanks so much for answering my question. These really help to put a perspective on the Turin shroud..","date":"2012-01-17","mins":"1:37 pm","url":"https://shroudstory.com/2012/01/16/it-is-enough-to-make-you-want-to-become-a-skeptic/","cat":"news_&_views","title":"It is enough to make you want to become a skeptic."},{"id":"comment-21787","author":"chris","post":"Andy and Russ are spot on. I read a great phrase one time which I think was on Barry’s site which I’ll paraphrase: ‘Science by press release’, which is to say, meritless hype created for sake of doubt. The same thing applies here in my mind: this is research by press release with the sole purpose of creating doubt via hysteria. The devil has many tricks up his sleeve to extract his pain on man but he shall never prevail..","date":"2013-01-09","mins":"1:08 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","title":"Jesus’ Wife Papyrus Update"},{"id":"comment-38477","author":"chris","post":"Yeah, Rich, you should just hang out here we got beer and cocktails. :).","date":"2013-07-01","mins":"1:29 pm","url":"https://shroudstory.com/2013/07/01/jref-catholics-answers-and-the-like/","cat":"news_&_views","title":"JREF, Catholics Answers and the like"},{"id":"comment-21929","author":"chris","post":"John, my advice is not to publish this. From a layman’s perspective it just looks loony and quite frankly smacks of hysteria and extreme narcissism IMHO. It sounds like something Colin would write..","date":"2013-01-12","mins":"8:15 am","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part"},{"id":"comment-4134","author":"chris","post":"I am not a supporter of the multiverse theory. It is kind of pseudoscience that cannot be observed but yet theoretical physicists need something to do to keep sane I guess. In terms of the multiverse and Christianity, I always thought CS Lewis touched upon it in his Chronicles of Narnia. Aslan pretty much said that in our universe he goes by a different name, which means he is probably another incarnation of Christ. Also multiverse theories are aimed to destroy the fine tuned universe theory..","date":"2011-10-06","mins":"4:24 pm","url":"https://shroudstory.com/2011/10/06/more-on-this-will-hurt-your-brain/","cat":"news_&_views","title":"More on This Will Hurt Your Brain"},{"id":"comment-30517","author":"chris","post":"Chris : How do you know all this? I am not sure any of this can be gleaned looking at an HR image from the internet. To assert it with only the aid of a digital image makes one look a bit ’round the bend as they say. For clarification, this is directed at Hugh..","date":"2013-04-12","mins":"3:43 pm","url":"https://shroudstory.com/2013/04/11/neat-trick-with-the-shroud-2-0-app/","cat":"news_&_views","title":"Neat Trick with the Shroud 2.0 App"},{"id":"comment-30526","author":"chris","post":"Hugh Farey : It is quite an easy job to superimpose the front and back images, and to switch back and forth using an opacity toggle. I arbitrarily decided to match the bloodstains of the back of the head to the line of the eyebrows. The image of the deltoids roughly matches the image of the pectorals, and the blood trickle across the back is level with the elbows on the front. The big bloodstain (on the instep?) at the end of the ventral legs then appears more or less in the middle of the big footprint at the end of the dorsal legs. If we make a fold in the dorsal image, then either the ‘back of head’ bloodstains end up match up with the moustache, or the ‘instep’ stain now ends up matching the ‘toes’ end of the ‘footprint.’ Lesser distortion but at both ends simultaneously is also possible. If the man on the shroud had bent legs, then, of course, the front image (the cloth following his contours) should end up significantly longer than the dorsal image (the cloth being flat), but in that case it is difficult to explain how the back of his calves could have left a mark. Sorry, Chris, I was dragging in various comments from earlier postings for my comment about Dan’s i Pad photo. (a) comes from the Gilberts’ spectroscopy paper which has a diagram of the reflectance spectrum of exactly this bloodstain. (b) comes from Miller and Pellicori’s UV paper which has a photograph of this bloodstain under UV light with no fluorescent serum rim. (c) and (d) are apparent just by looking at Dan’s posting. I dare say I often appear a bit round the bend anyway, but my observations are nearly always based on reports of primary observations. As such, any niggling anomalies really do have to be explained before any indisputable conclusions can be arrived at. Hugh, OK, I can accept that. It looked like you were drawing conclusions based on Dan’s posted photo. I think you can appreciate how that looks. And about that photo I ordered my oldest to hand over her Ipod so I could run this experiment. I got the app and enlarged the face as much as possible and emailed the image to myself. It was not as large nor anywhere near as high a definition of even the shroudscope. I wonder if I’m not doing something wrong or perhaps the latest generation Ipod isn’t good enough? Anyway, I suspect your observations are probably easily addressed although I admit I am not versed in the science to do it. But then again they actually be very hard to address, I don’t know. My suspicion is just that though. It comes from that fact that I fall into the same category as Dan – the shroud is probably the real deal..","date":"2013-04-12","mins":"4:53 pm","url":"https://shroudstory.com/2013/04/11/neat-trick-with-the-shroud-2-0-app/","cat":"news_&_views","title":"Neat Trick with the Shroud 2.0 App"},{"id":"comment-30532","author":"chris","post":"Hugh, true and either way time will tell. On another note, disregard my comment about the Ipod image. Once I got some bourbon in me and played with it some more I realized I didn’t *buy* the higher res images – which is strange with a *free* app. What also helped was that the message I got while enlarging the pictures (again) changed from something about permissions to something about you need to pony up some cash for this free stuff. A pox on them! I don’t mind giving my fellow man his due but tell my up front the cost of the transaction! Don’t lie to me and tell me it’s free..","date":"2013-04-12","mins":"5:30 pm","url":"https://shroudstory.com/2013/04/11/neat-trick-with-the-shroud-2-0-app/","cat":"news_&_views","title":"Neat Trick with the Shroud 2.0 App"},{"id":"comment-30516","author":"chris","post":"How do you know all this? I am not sure any of this can be gleaned looking at an HR image from the internet. To assert it with only the aid of a digital image makes one look a bit ’round the bend as they say..","date":"2013-04-12","mins":"3:38 pm","url":"https://shroudstory.com/2013/04/11/neat-trick-with-the-shroud-2-0-app/","cat":"news_&_views","title":"Neat Trick with the Shroud 2.0 App"},{"id":"comment-11724","author":"chris","post":"I agree with a lot of what Yannick expresses here. In the end the actual date isn’t all that relevant. What the writers were trying to convey – mainly that they saw a man who proclaims to be “The Way, The Truth and The Life” suffer death and then rise from the dead. Jesus is the real deal, not some charlatan looking to get a following. Their primary purpose was to write down what was being passed on via oral tradition in the first few years after the resurrection and ascension. They needed to combat inaccuracies and set the record straight in their growing community. I will depart with Yannick and others here though: Matthew the apostle almost assuredly wrote his own gospel and he is an eye witness to the events. Mark copies Matthew and Luke not the other way around. And John wrote his gospel many years after the events so some details are probably not accurate with regards to peripheral facts but his recounting of Jesus’s words are probably very accurate given his age at the time of his following of Jesus. All the gospels were written before the revolt. It looks like the majority of you would probably disagree with this interpretation and I respect that but this is the perspective that I come from though..","date":"2012-05-30","mins":"1:39 pm","url":"https://shroudstory.com/2012/05/26/quake-reveals-day-of-jesus-crucifixion-or-something-like-that/","cat":"news_&_views","title":"Quake Reveals Day of Jesus’ Crucifixion (or something like that)"},{"id":"comment-36637","author":"chris","post":"The hands fascinate me as well, especially that right hand with the elongated fingers. That index finger is very intriguing and I have often wondered what it is that we are seeing. Was Christ’s fingers dislocated from perhaps someone pulling on them to get his arms spread more easily? That right hand is also under what I assume to be a draping effect from the raised left knee. Does this cause some sort of distortion? All the fingers of the right hand look as if they are sort of sweeping. I also wonder if there is a double exposure effect from the shroud loosening as Max asserts. Whatever it is I see it as evidence that is stronger for the argument of authenticity than for forgery. I don’t think it likely that a forger would get everything else with regards to the pathology of crucifixion and then completely get the right hand wrong. As for bones, I am fairly certain I see bones in the palm of the hand. This is the back of the left hand. Of course, Christ just may have been very skinny (which looks to be consistent with the rest of the body to my eye as I don’t see any indication of fat let alone excess fat). I have seen the hand bones of folks who are just as skinny so I don’t think it unusual that I should see bones on the back of the palm. Also, for where the nail wound comes out of the back of the palm – when I use the shroudscope tool to analyze the length from where I think the fingers meet the hand (this is the space between the middle finger and the ring finger – the point at which they meet) to where I think the nail hole is I get a different measurement depending on which image I look at. The negative image seems to yield a smaller measurement while the normal photograph yields a measurement more consistent with the back of my own thumb (meaning it’s entirely consistent with driving the nail straight through the hand at the base of the thumb). The left hand looks entirely normal to me otherwise..","date":"2013-06-10","mins":"1:46 pm","url":"https://shroudstory.com/2013/06/05/r-i-p-ben-wiech/","cat":"news_&_views","title":"R.I.P. Ben Wiech"},{"id":"comment-7889","author":"chris","post":"My own personal view is that online polls are completely invalid and any attempt to extract meaning from them is an exercise in frustration. Polls done by reputable firms have a hard time getting it right and they take great pains to do that over and above what online polls do. At best online polls reflect only who decided to respond to them out of the particular audience that visited at the time they were posted. Blogs etc draw types of people and that alone can skew the results because certain types may be far from representative of the target audience. If the author wants an opinion poll from a certain audience he would do best to commission such a poll from a reputable firm..","date":"2012-02-03","mins":"11:17 am","url":"https://shroudstory.com/2012/02/03/revisiting-the-cosmic-log-poll-one-more-time/","cat":"news_&_views","title":"Revisiting the Cosmic Log Poll One More Time"},{"id":"comment-7427","author":"chris","post":"I agree, Ron. If this author thinks that the shroud would lead folks away from Jesus he’s been sucker punched be the devil himself. It’s a classic judo movement of the evil one to use one’s own sin of pride to hide the truth before one’s lying eyes..","date":"2012-01-23","mins":"1:54 pm","url":"https://shroudstory.com/2012/01/23/satan-and-his-clever-shroud-of-turin-trickery/","cat":"news_&_views","title":"Satan and his clever Shroud of Turin trickery"},{"id":"comment-8419","author":"chris","post":"Ron, good point. Also, not believing in a physical resurrection does not square with the Apostles actions from there on out. They were zealous in carrying out Christ’s command to make believers of all men. What’s more telling is they did not fear death at all. What takes men from the abject terror they had after Jesus’ arrest and death and makes them unflinching of persecution and death to spread His story? If they had not seen the Risen Lord they would not have done what they did. It simply doesn’t make sense otherwise. I mean these guys suffered horrible tortures but remained unwavering. It’s one thing to die for something you have Faith in it’s quite another to die for something you have seen with your own eyes. That’s what sets Christianity apart from pretty much every other religion. It’s based on eye witness testimony..","date":"2012-02-17","mins":"10:27 pm","url":"https://shroudstory.com/2012/02/17/so-swings-and-roundabouts-darn-dawkins-didnt-ask-about-the-shroud/","cat":"news_&_views","title":"So, swings and roundabouts: Darn, Dawkins didn’t ask about the shroud."},{"id":"comment-8436","author":"chris","post":"Great comment, John! I love hearing about these kinds of things.Thanks for sharing..","date":"2012-02-18","mins":"12:47 pm","url":"https://shroudstory.com/2012/02/17/so-swings-and-roundabouts-darn-dawkins-didnt-ask-about-the-shroud/","cat":"news_&_views","title":"So, swings and roundabouts: Darn, Dawkins didn’t ask about the shroud."},{"id":"comment-7133","author":"chris","post":"Wow, looks like there’s updates there nearly every day. I am highly distrustful of Wikipedia since it’s so prone to manipulation but it does at least provide a primer on a subject..","date":"2012-01-18","mins":"10:05 am","url":"https://shroudstory.com/2012/01/18/so-you-need-to-access-wikipedias-shroud-of-turin-page-today/","cat":"news_&_views","title":"So you need to access Wikipedia’s Shroud of Turin page today"},{"id":"comment-21921","author":"chris","post":"Good point Gabriel! I thought the same thing. It takes some folks longer than others depending on the “non thinking” prejudices one holds, ahem! The thought of an old quote I’ve seen also came to my mind when I read this: the Titanic was built by experts while the ark was built by an amateur..","date":"2013-01-12","mins":"7:25 am","url":"https://shroudstory.com/2013/01/12/stop-taking-cudgels-to-each-other/","cat":"news_&_views","title":"Stop taking cudgels to each other?"},{"id":"comment-9074","author":"chris","post":"Not having watched the video the narrative reminds me of some of the ridiculous claims made by some a few decades back about the Ark of the Covenant was actually a primitive radio for talking to God. I also find it interesting that the Holy Ghost would not answer questions of who is where in the afterlife. Apparently Mary hasn’t been given the message as the children at Fatima reported that she answered their question regarding a local girl who had died recently. When they asked Mary if the girl went to Heaven Mary’s reply was that the girl had gone to Purgatory and would be there until the end of the world. Couple that with the vision of Hell Mary showed them and it’s hard to believe that the information would be classified for anyone communicating with a supernatural being. I get the feeling somebody’s got a ham radio or something and is having fun at others people’s expense..","date":"2012-03-08","mins":"10:23 am","url":"https://shroudstory.com/2012/03/08/the-holy-ghost-communications-channel-and-the-shroud-of-turin/","cat":"tinfoil_hats","title":"The Holy Ghost Communications Channel and the Shroud of Turin"},{"id":"comment-7641","author":"chris","post":"Excellent post, Dan. I like Buck’s last line about not knowing and admitting it. It’s OK to not know and to be curious and even to wonder. I think one day we will reach the end of what can be known about the shroud scientifically and beyond that each person, for themselves, has to assign meaning to it..","date":"2012-01-28","mins":"2:54 pm","url":"https://shroudstory.com/2012/01/28/the-most-intelligent-thing-anyone-can-say-with-regards-to-the-shroud-is-i-dont-know/","cat":"news_&_views","title":"The most intelligent thing anyone can say with regards to the shroud is, \"I don’t know.\""},{"id":"comment-9929","author":"chris","post":"Do you think these people make “Pope on a rope” soap? ;).","date":"2012-04-03","mins":"8:21 pm","url":"https://shroudstory.com/2012/04/02/the-soap-making-nuns-and-the-shroud-of-turin/","cat":"news_&_views","title":"The Soap-making Nuns and the Shroud of Turin"},{"id":"comment-16904","author":"chris","post":"Andy makes and excellent point and Mundabor’s point is well taken. The whole hoopla surrounding this papyrus fragment is just like when someone claims to create a replica of the shroud and it’s touted in the press before it’s even been fully vetted by someone else. It’s science by press release and it’s only point is to foster a negative attitude towards Christianity, the Church and it’s Sacred Traditions. Like in cases where someone has supposedly created a Shroud replica and you rarely see anything like the attention given to the announcement of it lavished on the follow up conclusion that, no, it’s really not like the shroud at all. All the audience remembers is that someone created a shroud replica and therefore the shroud is probably a fake. And really that’s the point of science by press release. It’s gets us all talking and arguing about nothing of any substance before we even know its not substantive. It’s an exercise in whipping up hysteria and casting aspersions. Had Ms. King done all the academic leg work ahead of time to evaluate the value and authenticity of this piece and then presented it to the press with proper context, i.e. It’s a fragment of Gnostic writings with no real bearing on Christian traditions because this was addressed back in the third and fourth centuries but it’s nice as a piece of history about the Gnostics, I would have had respect for her. But instead we get science by press release with no context and the complete conjecture that it has any bearing whatsoever on the Christ story and therefore the role of women in the Church. As Andy has alluded to, I think correctly, there is an agenda we should be aware of and that’s really the point of this, not science..","date":"2012-09-25","mins":"3:49 pm","url":"https://shroudstory.com/2012/09/24/when-asses-flew/","cat":"news_&_views","title":"When Asses Flew"}],"opinion":[{"id":"comment-6880","author":"chris","post":"“There are only two kinds of people in the end: those who say to God, ‘Thy will be done,’ and those to whom God says, in the end, ‘Thy will be done.'” – C.S. Lewis..","date":"2012-01-12","mins":"6:18 pm","url":"https://shroudstory.com/2011/12/16/rip-christopher-hitchens/","cat":"news_&_views","title":"RIP Christopher Hitchens"},{"id":"comment-7814","author":"chris","post":"CO, he doesn’t want to understand because he’s not interested. Notice he keeps supplying irrelevant answers. I think his sole purpose here is to agitate and drive traffic to his site because it’s nowhere near as popular as Dan’s site. If he’s truly interested let him put his money where his mouth is and make a copy of the shroud with all the same properties and submit it for analysis. He’ll probably need a blood donation as well since he’ll need to include real blood to make a copy. Think of the fame and fortune that will follow now that a real scientist has solved the shroud mystery! As icing on the cake he can find the shroud’s contemporary from the 14th century as well and mock all the other mickey mouse scientists and art historians in the process for not picking up on it sooner. It will all be quite the dream come true! But until all this comes to pass it’s probably best not to countenance his posts..","date":"2012-01-31","mins":"9:38 pm","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","title":"Badder Still: Bad Archaeology at Bad Archaeology"},{"id":"comment-11579","author":"chris","post":"Well, let me offer this: the only problem with “rationality” is humanity. What we simply don’t understand we offer prevarications for. When we understand we offer our ignorance as excuse for our previous prevarications. Humility is the only solution. There is an old saying: “Science is like climbing a mountain. When the scientists reach the summit they will find the theologians having a picnic.”.","date":"2012-05-24","mins":"7:30 pm","url":"https://shroudstory.com/2012/05/23/becky-garrison-article-in-killing-the-buddha/","cat":"other_blogs","title":"Becky Garrison Article in Killing the Buddha"},{"id":"comment-12993","author":"chris","post":"There is a waxing and waning of Faith in every age. One only need to look into the Old Testament to see this. This is nothing new. Atheism believes it will eventually triumph and that claim, also, is nothing new. It’s the eternal struggle restating itself in this age. Pride will always make it’s empty claims, Faith will always endure..","date":"2012-06-24","mins":"8:03 pm","url":"https://shroudstory.com/2012/06/22/atheism-lacks-humility-imagination-and-curiosity/","cat":"news_&_views","title":"Atheism Lacks Humility, Imagination and Curiosity"},{"id":"comment-7413","author":"chris","post":"Great read! Thanks for posting..","date":"2012-01-23","mins":"10:09 am","url":"https://shroudstory.com/2012/01/23/from-atheism-to-catholicism/","cat":"news_&_views","title":"From Atheism to Catholicism"},{"id":"comment-13797","author":"chris","post":"Andy Weiss : There’s absolutely no doubt the area tested in 1988 was a repair. Rogers proved that beyond a shadow of a doubt. According to all the medical experts that have studied the Shroud, the man enshrouded was without doubt dead. There is absolutely no chance of that person surviving. What’s interesting about the hypothesis that Jesus survived the crucifixion is that it necessarily requires a naturalistic image formation. The problem proponents of this “live body” theory immediately run into is that the image on the shroud does not show the tell tale signs that the man wrapped in it was alive. If he were alive there would be MUCH more image distortion, most especially in the areas of the face because he would be breathing. If a naturalistic image formation process was the cause of the image then you would most definitely see evidence of breathing interfering with that because the exhaust from the man’s lungs would disrupt the mechanism of image formation, especially around the nose and mouth. Plus there’s no image evidence of movement of ANY kind over it’s formation period, which would necessarily be many days. The man would have to remain dead still for the entire period. Also, the blood evidence that remains would negate a live body as the man in the shroud would continue to bleed, especially from the side wound. There’s not enough blood on the shroud to suggest this was even possible, even at rates of flow where the victim was in a coma. And lastly, though not comprehensively, there’s no evidence of smearing of blood from the removal of the body. Had he been alive and got up of His own physical power (or even with the aid of another), even after days, it would be most plausible that there would be massive smearing of blood evidence because the wounds would still be bleeding, especially if the body was moved because it would disturb any clots, especially in the head, wrist, and side wound areas. There’s just no trace of this anywhere on the shroud. Even if anyone intended to fool future generations by carefully removing the shroud I do not think it could be done. But then again, who would intend to do such a thing in the first century. The body wrapped in the shroud was dead..","date":"2012-07-12","mins":"8:25 pm","url":"https://shroudstory.com/2012/07/06/dawkins-challenge-noticed-by-ahmadi-muslim-researchers/","cat":"other_blogs","title":"Dawkins Challenge Noticed by Ahmadi Muslim Researchers"},{"id":"comment-8023","author":"chris","post":"It gave me a good chuckle when I read it. He gave it a college try so I can’t fault him (too much). He does strike me as the kind of guy you’d like to have a beer with because he has a colorful personality. Best of luck to him in life..","date":"2012-02-07","mins":"12:40 pm","url":"https://shroudstory.com/2012/02/07/dont-confuse-him-with-facts-his-mind-is-made-up/","cat":"other_blogs","title":"Don’t confuse him with facts, his mind is made up"},{"id":"comment-7492","author":"chris","post":"I read it. Snark and mockery – the mark of a true scientist. Talk is cheap, he should make a copy that matches the Turin shroud and put it to bed already. Or can’t he deliver?.","date":"2012-01-24","mins":"8:17 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","title":"He’s back and it’s a doozy"},{"id":"comment-8535","author":"chris","post":"Hey, I’ll give him this: maybe it IS a scorch but now he has to demonstrate how it was done by human hands. If it winds up being a scorch that cannot reasonable be made by medieval human hands he’s got a lot of splaining to do. My prediction is it can’t be done in the manner in which he’s suggested which is why he keeps begging out..","date":"2012-02-20","mins":"11:16 am","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","title":"Image by scorching heat? Or science by hot air?"},{"id":"comment-12080","author":"chris","post":"I’m going to disagree here. Looking at the Enrie negative in the vertical position I can clearly see the bands on the side of the face run right down into the chest and terminate pretty clearly. I also see them run up past the face (especially visible on the right eye socket) and through the hair up into the cloth where it sort of terminates in a fade. They are not as dark in some places (like the hair) but until we completely understand the image formation mechanism we cannot say for sure why there’s not a uniform variance. But I do see that variance. There is also a band that begins directly above the right eye and travels upward where it seems to terminate in the crown of thorns area. Who knows how large the hanks of linen yarn were? You can’t predict that they will terminate evenly or will produce a certain length of weave. I do think the banding effect is real and that it can be mitigated for to a certain degree. We will probably get better at it as time goes on..","date":"2012-06-08","mins":"12:16 am","url":"https://shroudstory.com/2012/06/07/marcel-alonso-on-rogers-impurity-layer/","cat":"challenge","title":"Marcel Alonso on Rogers’ Impurity Layer"},{"id":"comment-12093","author":"chris","post":"Ron :Chris at one time, I once thought the two areas in question were due too banding until I was made aware of the most likely way in which the Shroud was placed about the face/head area. Here again I cannot stress enough that people view the video I mentioned in my other comment where Jackson demonstrates how most probably the Shroud was bound to the body. R Ron, understood. And I have seen that video too, it’s a great video. There is a lot there that looks like I agree with it, I would even agree with how the head was wrapped. I do think there is a banding effect though as I don’t just see it in the face area but all over the shroud. I think it’s most pronounced in the face area because we as humans tend to focus on that feature and of course, everyone wants to see the face of God clearly. But again this is all just theory and I am open to other interpretations and definitely believe that more research is needed to help further develop answers to these questions. Understanding the image mechanism will probably be what is needed to fully understand. So I accept the possibility of what you and Colin are saying, but as of now I think the banding effect is a more probable explanation. Just my two cents..","date":"2012-06-08","mins":"10:09 am","url":"https://shroudstory.com/2012/06/07/marcel-alonso-on-rogers-impurity-layer/","cat":"challenge","title":"Marcel Alonso on Rogers’ Impurity Layer"},{"id":"comment-6733","author":"chris","post":"Some of the illustrations of how the nails were driven show that it would appear on the front of the victims hand as being at the base of the thumb but still above where the hand folds at the wrist and thus still in the palm. The nail enters there and is driven down and back towards the forearm and will exit on the back of the victim’s hand in the area which would be seen as the back wrist. This is why on the shroud it appears in the wrist because you are seeing an exit wound. If this hypothesis is plausible then anyone viewing a victim crucified realtime like this will witness it as the nails being driven through the palms..","date":"2012-01-09","mins":"5:43 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"},{"id":"comment-6816","author":"chris","post":"I defer to the academic points expressed by Yannick and others as I am not well read on this. It might be interesting to conduct further experiments with the nails being driven through the base of the thumb to gather more data on it’s plausibility. I’ll share my thoughts as a layman though for what it’s worth. When I saw the illustrations of the nails through the thumb base I immediately thought it was like hanging a picture. When I drive a nail into a stud in the wall to hang a picture I drive it down at an angle. To me this mitigates issues with the nail coming out of the wall or bending etc. It struck me as reasonable that an executioner practiced in crucifixions may also employ this technique. Is it true that in most crucifixions the victim hung for days before expiring? If that was the common outcome then nailing a victim for the long term might lead an executioner to employ such a technique. As for stigmatas on saints I would not be surprised to find them in areas that the saint perceived to be actual wound sites on Jesus. I don’t think it matters either. If stigmatas are genuine I would find it plausible that God would be working within the person’s perceptions of where the wound sites are. I would think an attribute (exact location) of the wounds is subordinate to the point God was trying to make through displaying them (I suffered at the hands of men, these agonizing wounds until death, to show you how much I love you). It is only through modern science can we more accurately fathom such agony by knowing all the aspects affected. One thing that seems very clear to me is that this subject raises that issue that it would be highly unlikely for a forger to deliberately place the nail marks through the wrist as it would contradict the perception of most of the faithful observers. If the point of a “fake” shroud was to pull in money it would seem to be counter productive wouldn’t it? Doesn’t the controversy within the Church at the time reflect a bit of this? (a 14c Bishop claiming it to be a forgery and to know the forger etc?) Whatever the shroud is it definitely does not fit exactly as folks have presumed it to be over its lifetime. Also, Thank you, Dan, for creating this site. I enjoy it immensely and hope to learn a lot..","date":"2012-01-11","mins":"1:47 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"},{"id":"comment-6821","author":"chris","post":"Yannick, thanks for the response, I appreciate it. The point about the nudity is spot on. Christ is always depicted in a loin cloth in everything I’ve ever seen so it goes against reason that he would be depicted nude on a fake shroud. Why bother to offend the audience’s sensibilities? It is a testament to the example of humility that Christ gave us..","date":"2012-01-11","mins":"3:31 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"},{"id":"comment-7062","author":"chris","post":"So here’s a question that I don’t think has been addressed: What explains the seemingly unnatural elongation of the index finger on the right hand? Indeed all the fingers look too long and seemingly do not follow the natural length pattern of a normal persons fingers. I have often wondered if this is because of how and where the nail was driven through. Any thoughts?.","date":"2012-01-16","mins":"3:17 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"},{"id":"comment-9983","author":"chris","post":"I see the father of all lies still finds willing accomplices in his work. Rest assured though, brothers and sisters “the jaws of hells shall not prevail against it”. We are stronger than them..","date":"2012-04-05","mins":"1:52 pm","url":"https://shroudstory.com/2012/04/05/nonsense-break-the-blog-is-actually-called-the-fight-against-nonsense/","cat":"other_blogs","title":"Nonsense Break: the Blog is actually called  … The Fight Against Nonsense"},{"id":"comment-9073","author":"chris","post":"I always understood the distinction as resurrection being something that Jesus does under his own power to Himself whereas “raising from the dead” is an Act of God upon one of His children. I don’t see Lazarus as resurrected but raised. Jesus acted upon him. Jesus is resurrected because He, even while His physical body was dead, acted upon Himself. The obvious point of these miracles, especially the Resurrection, is that anyone who has power of death enough to not only raise others from it but Himself is surely someone that can rescue any man from death. It is this rescue that Christ offers to man through the forgiveness of sins..","date":"2012-03-08","mins":"10:08 am","url":"https://shroudstory.com/2012/03/08/resurrection-as-proof-of-an-actual-god-man/","cat":"other_blogs","title":"Resurrection as proof of an actual God-man?"},{"id":"comment-9512","author":"chris","post":"This gave me a good laugh! Thanks, Dan..","date":"2012-03-22","mins":"10:44 am","url":"https://shroudstory.com/2012/03/22/the-secrets-of-mfol-revealed/","cat":"other_blogs","title":"The secrets of MFOL revealed"},{"id":"comment-7171","author":"chris","post":"I always see the sin of pride at work in these types of essays which tells me who’s really at work in them. As part of our baptismal rite we are asked if we reject the glamor of evil. Something like this with all it’s implications would fall into that category in my mind..","date":"2012-01-19","mins":"10:42 am","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","title":"The State of Skepticism: Ridicule works. Right?"},{"id":"comment-7373","author":"chris","post":"Regarding there being “something to this” I recall there was a paper or pdf I read over at Barrie’s site, I think, that said that there was an unauthorized carbon dating of a tiny sample of the shroud at some point (I may be completely misremembering details here so take it with a grain of salt) that came back with a date of around 200 AD for the shroud. I think that the sample was too small to really date all that accurately and had a very wide margin of error. I also remember the article stating that the lab involved vigorously denied that this dating ever happened. I vaguely remember reading this blurb and being stunned that anyone would even mention this since the lab denied it. But I always wondered if it was actually true and the lab was just CYA. I don’t think the main thrust of the paper was about this though but I can’t recall what it was about and I wish I could. Weren’t remnant pieces of the shroud retained for future study? I suppose it’s possible someone may have done some unpublished work on them however, I would not put stock in it until it’s published and vigorously reviewed. Still it’s tantalizing for those of us that would like to see actual work move forward on this..","date":"2012-01-22","mins":"3:18 pm","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","title":"The State of Skepticism: Ridicule works. Right?"},{"id":"comment-7424","author":"chris","post":"Ron/Dan, I found it. Http://www.shroud.com/pdfs/textevid.pdf It mentions Rossman’s unauthorized dating of a single thread of the Raes sample in 1982. Half the thread dated to 1200 AD and the other half to 200 AD. It says that Rossman personally confirmed this in a personal conversation with the author. It does not mention margins of error though as far as I can tell. Given the protocol for testing samples during the 1988 official testing one has to wonder what the MOE would be for a single thread. It also doesn’t address any potential contamination of the half which dated to the 2nd century. I could imagine if this were really true why some folks would seriously be knocked over by the 1988 findings. There is also another paper and this one is probably the original paper I read: http://www.shroud.com/pdfs/oxley.pdf It mentions the above paper and adds that Rossman vigorously denies any such testing took place in 1982 and even states that the equipment was not available at the time. So we have to take the original claim with a grain of salt. CYA means to “Cover Your (A) Derrier”. Meaning Rossman may be trying to avoid a legal situation or other liability created by admitting to an unauthorized CD. The first link mentions that there was an agreement STURP was obliged to follow. In the end it’s tantalizing at best..","date":"2012-01-23","mins":"1:42 pm","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","title":"The State of Skepticism: Ridicule works. Right?"},{"id":"comment-7478","author":"chris","post":"Another interesting tidbit from Barrie’s site: http://www.shroud.com/late02.htm Scroll down to see Caltech’s response to Benford and Marino’s claims that Rossman did the unauthorized radiocarbon dating on the Raes thread in 1982. THEN immediately afterward read Benford and Marino’s response to Caltech denial. Absolutely tantalizing..","date":"2012-01-24","mins":"10:57 am","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","title":"The State of Skepticism: Ridicule works. Right?"},{"id":"comment-7257","author":"chris","post":"Wow did you read some of the comments there? There’s a lot of hate in those comments. So sad..","date":"2012-01-20","mins":"6:22 pm","url":"https://shroudstory.com/2012/01/20/the-viral-hate-religion-but-love-jesus-video/","cat":"other_blogs","title":"The Viral Hate Religion But Love Jesus Video"}],"researchers":[{"id":"comment-30959","author":"chris","post":"Thank you, Barrie..","date":"2013-04-16","mins":"9:31 am","url":"https://shroudstory.com/2013/04/16/barrie-schwortz-would-like-to-see-reexamination-of-the-shroud-with-todays-technology/","cat":"news_&_views","title":"Barrie Schwortz would like to see reexamination of the Shroud with today’s technology"},{"id":"comment-9470","author":"chris","post":"Dan, I think the link might be broke. When I click on it I get a security redirect alert from About.com. Anybody else have trouble?.","date":"2012-03-20","mins":"9:50 am","url":"https://shroudstory.com/2012/03/20/interview-with-barrie-schwortz-in-intrepid/","cat":"news_&_views","title":"Interview with Barrie Schwortz in Intrepid"},{"id":"comment-9474","author":"chris","post":"Thanks, Dan. That was a great article, kudos to Barrie and his host..","date":"2012-03-20","mins":"11:34 am","url":"https://shroudstory.com/2012/03/20/interview-with-barrie-schwortz-in-intrepid/","cat":"news_&_views","title":"Interview with Barrie Schwortz in Intrepid"},{"id":"comment-9609","author":"chris","post":"God Bless Barrie and give a long and happy life!.","date":"2012-03-24","mins":"11:12 pm","url":"https://shroudstory.com/2012/03/24/schwortz-tells-how-shroud-science-has-influenced-his-own-faith/","cat":"news_&_views","title":"“Schwortz tells how Shroud science has influenced his own faith”"},{"id":"comment-20712","author":"chris","post":"Ah the false charge to pseudo science again. It soothes them so, doesn’t it? And again, the red herring of the scorch hypothesis. Keep trying to squeeze blood out of that stone, one day you shall tire. He’s got it worse than the guys with the excimer lasers..","date":"2012-12-19","mins":"10:38 am","url":"https://shroudstory.com/2012/12/19/colin-berrys-christmas-present/","cat":"uncategorized","title":"Colin Berry’s Christmas Present"},{"id":"comment-7555","author":"chris","post":"It is breath taking the attitude some of these skeptics take. One gets the vague feeling that they may be terrified of the idea of an authentic shroud. It doesn’t matter a hill of beans to Christianity if it’s genuine or a forgery because it proves nothing. I admit though that it’s nice to have should it be genuine which is why people are interested in it and why people study it. This attitude of “you shouldn’t even waste your time doing this because it’s silly” that some skeptics take is frightening. It confirms my notion that they should never be positions of authority, especially in government. Those that present such sentiments presume that they are entitled to determine what others SHOULD be doing. If the shroud is ever properly and officially radiocarbon dated again and if the results bear a first century origin I predict that main argument of skeptics will suddenly shift from “it’s a forgery” to: – “you can’t be certain it’s Jesus’ shroud” – “it’s OBVIOUS that the body was stolen” These are already preloaded arguments you hear from time to time. It’s so sad that some people cannot let others pursue their curiosity in this without getting upset and personal..","date":"2012-01-26","mins":"11:31 am","url":"https://shroudstory.com/2012/01/25/correcting-joe-nickell/","cat":"other_blogs","title":"Correcting Joe Nickell"},{"id":"comment-7137","author":"chris","post":"Interesting read. Reading this does raise a curiousity in my mind of how the hair left any image. I say this because I am of the opinion that it was a natural process that caused the image. I’d have to wonder though if that would also apply to the hair. Wouldn’t it take far longer to start breaking down and give off gases or whatnot? Are gases from the decaying body below the hair somehow affected by the hair causing the image? These are probably all questions that won’t necessarily be resolved until the image causing mechanism is positively identified but they do cross my mind..","date":"2012-01-18","mins":"1:34 pm","url":"https://shroudstory.com/2012/01/18/paper-chase-jones-republishes-jacksons-an-unconventional-hypothesis-to-explain-all-image-characteristics-found-on-the-shroud-image/","cat":"news_&_views","title":"Paper Chase: Jones republishes Jackson’s, \"An Unconventional Hypothesis to Explain all Image Characteristics Found on the Shroud Image\""},{"id":"comment-7170","author":"chris","post":"I wonder what evidence, if any, would remain on the shroud that it was removed from the body either by: 1. Whomever the shroud was wrapped around 2. By someone else attempting to remove the body within it. Also I guess we will not know exactly how long the shroud draped it’s occupant until we identify the image forming mechanism or is there a way to infer this?.","date":"2012-01-19","mins":"10:24 am","url":"https://shroudstory.com/2012/01/18/paper-chase-jones-republishes-jacksons-an-unconventional-hypothesis-to-explain-all-image-characteristics-found-on-the-shroud-image/","cat":"news_&_views","title":"Paper Chase: Jones republishes Jackson’s, \"An Unconventional Hypothesis to Explain all Image Characteristics Found on the Shroud Image\""},{"id":"comment-7178","author":"chris","post":"Thanks for the reply, Yannick, I appreciate it. Just one more question at this time: Couldn’t someone have just removed the body after 24 – 36 hours? Or would this have left some sort of evidence behind? I would think that by that time (which would coincide roughly with the 3rd day after the crucifixion) the blood would be all dried and removing the shroud without disturbing the blood stains would be easy. And the unintended “image” would have been formed..","date":"2012-01-19","mins":"1:05 pm","url":"https://shroudstory.com/2012/01/18/paper-chase-jones-republishes-jacksons-an-unconventional-hypothesis-to-explain-all-image-characteristics-found-on-the-shroud-image/","cat":"news_&_views","title":"Paper Chase: Jones republishes Jackson’s, \"An Unconventional Hypothesis to Explain all Image Characteristics Found on the Shroud Image\""},{"id":"comment-7662","author":"chris","post":"I love their “Shroud Scope” tool and use it all the time to look at details on the shroud – both raw and in the negative. Great site..","date":"2012-01-29","mins":"1:28 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","title":"Quote for today by Mario Latendresse"},{"id":"comment-7669","author":"chris","post":"Very true. I don’t know how to interpret some things so I tend not to assign any meaning to that which I don’t know about. I just look in wonder and form questions to be researched and/or asked. I assume there will be some questions which may never be answered..","date":"2012-01-29","mins":"7:18 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","title":"Quote for today by Mario Latendresse"},{"id":"comment-9608","author":"chris","post":"I am reminded of His admonition: “Blessed are you when men revile you and persecute you and utter all kinds of evil against you falsely on my account. Rejoice and be glad, for your reward is great in heaven. . .” He knew we would face this every day..","date":"2012-03-24","mins":"10:45 pm","url":"https://shroudstory.com/2012/03/24/someone-who-is-not-a-fan-of-russ-breault-and-the-shroud-of-turin/","cat":"news_&_views","title":"Someone who is not a fan of Russ Breault and the Shroud of Turin"},{"id":"comment-7953","author":"chris","post":"Great site. I always enjoy reading his thoughts on these things..","date":"2012-02-05","mins":"10:26 am","url":"https://shroudstory.com/2012/02/05/shroud-of-turin-news-from-stephen-e-jones/","cat":"news_&_views","title":"Shroud of Turin News from Stephen E Jones"}],"resources":[{"id":"comment-7371","author":"chris","post":"It may be that they arrived at the answer they had striven for..","date":"2012-01-22","mins":"2:43 pm","url":"https://shroudstory.com/2012/01/22/correcting-an-article-about-the-shroud-of-turin/","cat":"news_&_views","title":"Correcting an article about the Shroud of Turin"},{"id":"comment-9532","author":"chris","post":"Ron, point taken as it’s universally abused. I was referring to it’s roots in Nazism as articulated by it’s propaganda minister..","date":"2012-03-22","mins":"10:28 pm","url":"https://shroudstory.com/2012/03/21/bart-ehrmans-new-book-did-jesus-exist/","cat":"books","title":"Bart Ehrman’s new book: ‘Did Jesus Exist?"},{"id":"comment-9511","author":"chris","post":"Beware of the old leftist propaganda tactic of repeating a lie until it becomes the truth in order to achieve a political goal(s)..","date":"2012-03-22","mins":"10:38 am","url":"https://shroudstory.com/2012/03/21/bart-ehrmans-new-book-did-jesus-exist/","cat":"books","title":"Bart Ehrman’s new book: ‘Did Jesus Exist?"},{"id":"comment-9516","author":"chris","post":"Yannick I laugh heartily when I read this propaganda for it truly is propaganda. They are grasping at straws and preying on the more ignorant. I am also keenly aware that those who put it forth have a definite agenda. At this point in History Faith is needed tremendously..","date":"2012-03-22","mins":"1:52 pm","url":"https://shroudstory.com/2012/03/21/bart-ehrmans-new-book-did-jesus-exist/","cat":"books","title":"Bart Ehrman’s new book: ‘Did Jesus Exist?"},{"id":"comment-9533","author":"chris","post":"Yannick, I agree entirely! I have had this very same reflection many times over the years and in many conversations with friends. If we didn’t have free will, we would all be robots. The fact that He doesn’t control us shows how much He loves us as he has made us in His image – with a free will. All of Christianity is based on free will and no one person who calls themselves a Christian can compel another person to practice Christianity’s tenets. Always remember the Great Commission where Christ instructs His Apostles to walk away from those who reject the Gospel. He will not force Himself on us. We, as Christians now must imitate our Savior and give everyone we meet the same respect – freedom and liberty to run their own lives even within the Christian Community because we are all individuals. So very unique among all other religions..","date":"2012-03-22","mins":"10:38 pm","url":"https://shroudstory.com/2012/03/21/bart-ehrmans-new-book-did-jesus-exist/","cat":"books","title":"Bart Ehrman’s new book: ‘Did Jesus Exist?"},{"id":"comment-7858","author":"chris","post":"Annie, excellent observations. I’ve come to see the bible as a collection of testaments or testimonials from people and/or their chroniclers of how they had direct interaction with the living God. I come to regard those testimonials as highly reflective of each person’s expectations of God and what He represents to them at that time. Even though these testimonials are inspired by the Holy Ghost they are not dictated by Him. He will not abrogate our free will and that includes our core expressiveness. The Old Testament came from a time of survival and nation forging. Imagine the chaos of those times and all the abhorrent behavior that was rampant throughout human living conditions. Obedience in such times seems more valuable to a lawgiver than understanding and so the perspective of those who wrote many of books of the Old Testament was of a God who required obedience. They expected Him to impose order through obedience. And Faith undergirds obedience, like from the womb a child has Faith in it’s parents to take care of it. Where understanding is not possible, Faith bridges the gap. It seems to me God works within the human condition, knowing us better than we know ourselves. God would probably have not gotten anyone to follow His Will had he not worked within the human expectation that a society must be made obedient first before it can be made to understand the basis of that obedience (simply because man is ignorant of his own nature). The New Testament represents the next and eternal phase – understanding. We have Christ’s positive affirmation of the law and Heaven. He encourages us to understand the law through his explanations of it, He gives us it’s meaning. Now step back a moment and look at the overarching narrative of the Old and New Testaments. They are indelible marks on history and enormously unforgettable events. God works, I think, in broad undeniable strokes and recurrent themes. What’s the best way to get your message across not only now but through all history? Make a broad undeniable movement within history; it’s got to be big enough that people will remember it for all time. Think of the indelible mark the Exodus has left on the Israelites. Think of the indelible mark that Jesus’ Resurrection made on all human history. The Resurrection itself is extremely extraordinary and represents the ultimate mark of His benevolence and message. It’s pretty darn hard to ignore someone who gets up out of His own tomb under His own power. Nothing less than this will make men turn their attention away from themselves and provide a basis for conversion throughout human history. What is also unique about the whole narrative is that Christ doesn’t conquer or vanquish those who put Him to death, on the contrary He saves them from death itself. He demonstrates through His Resurrection what He meant when He said God is a God of the living not the dead. Anyone that has the power to raise His own body after death certainly has the power to raise anyone from the dead..","date":"2012-02-02","mins":"11:48 am","url":"https://shroudstory.com/2012/02/01/burden-of-proof-on-the-shroud-of-turin/","cat":"books","title":"Burden of Proof on the Shroud of Turin"},{"id":"comment-8860","author":"chris","post":"Yeah, I saw this the other day. Did you notice the critics who finally had a chance to unload on this ostensibly saying it’s a fantasy? They have no clue what they’re looking at yet the conjectures fly. The fact that they are willing to conjecture at this stage coupled with the nature of the conjectures themselves say a lot more about the motives of the individuals engaging in this than the artifacts themselves..","date":"2012-03-01","mins":"11:40 am","url":"https://shroudstory.com/2012/03/01/fasten-your-seatbelt-more-archeology-from-tabor-and-jacobovic/","cat":"books","title":"Fasten your seatbelt: More Archeology from Tabor and Jacobovic"},{"id":"comment-11033","author":"chris","post":"Bravo, you recognized his bait and switch! Turns out that in that theory what passes for “nothing” has properties. And where did those properties come from? How were those properties defined? How many other universes have we detected? Yep, thought so. I really wouldn’t pay any mind to any of this right now as it is quite obvious they only have an agenda. Besides some of what I’ve read recently may wind up overturning some of what we think we know..","date":"2012-05-01","mins":"10:41 am","url":"https://shroudstory.com/2012/04/30/krauss-i-dont-really-give-a-damn-what-nothing-means-to-philosophers-i-care-about-the-nothing-of-reality/","cat":"books","title":"Krauss:  I don’t really give a damn what \"nothing\" means to philosophers; I care about the \"nothing\" of reality.\""},{"id":"comment-7132","author":"chris","post":"I feel the love..","date":"2012-01-18","mins":"9:44 am","url":"https://shroudstory.com/2012/01/18/new-book-christ-to-coke/","cat":"books","title":"New Book: Christ to Coke"},{"id":"comment-6883","author":"chris","post":"Helmut, thank you for the detailed reply, I very much appreciate you taking the time to do it. It is a fascinating possibility to explore and I shall give it some thought. I understand the point about the Apostles thinking that they saw a genuine resurrection should Jesus have survived in the tomb. I just can’t get around the Ascension part though. Somewhere massive lies needed to have been propagated and 11 men would rather be murdered than admit to a lie? I just don’t see it. I see no profit for anyone who testified to Christ’s actions to preach and be martyred for a fraud. But it is an interesting theory. Thanks again..","date":"2012-01-12","mins":"8:29 pm","url":"https://shroudstory.com/2012/01/09/new-kindles-from-helmut-felzmann/","cat":"books","title":"New Kindles from Helmut Felzmann"},{"id":"comment-6822","author":"chris","post":"I have a few questions. My intention is not to be offensive but clarify a few things that pop into my head whenever I see this argument about Jesus surviving the crucifixion (moderator please delete this if you feel it’s too strong or offensive, thanks in advance): If Jesus survived the crucifixion wouldn’t the shroud be literally soaked with blood (especially in the back image area) as opposed to just stained with blood in places (assuming it’s His)? If a living body made the image where’s the example of a remake? Can anyone point to a shroud image with the same properties made with a living body? Why are all these other folks who are trying to show how the shroud was faked not even seeming to explore the option to create a fake with a living body? It would seem far easier to pursue that path than taking great pains to paint linens, wash them, heat them etc etc, right? Why not just create the live human version? Or would it require the nearly impossible hurdle of actually beating the living daylights out of someone, crucifying them and lancing them or do bodies make these kinds of images by some other means? If you have to put someone through that suffering to test the result (or multiple individuals to be repeatable) I’m guessing you’re not going to get too many volunteers therefore it’s not really all that testable. Where does one get the (implied) notion that the Vatican has kept a conspiracy alive for 2000 years? – that they knew that Jesus was alive and therefore would have been depicted as such on the shroud when it came time to carbon date the shroud. What’s the point of even contemplating carbon dating the shroud if you already know that it probably disproves resurrection and you want to cover up that fact because it ruins your whole business model? Was anyone even contemplating that the shroud showed a live man at the time? If so, was that viewpoint so prevalent that the church believed it too and felt the overriding need to publicly discredit the shroud in an elaborate plan? Why bother? If someone was aware of a conspiracy all these years wouldn’t it have made sense to accidentally let the shroud burn up in the 1532 fire or subsequently get the idea that, hey here’s a good way to get rid of the evidence maybe we need to have another accidental fire? Do you think that the Vatican didn’t have a conspiracy and only came to realize in the 20th century that the man on the shroud was supposedly alive? If that’s the case: as a Pope or a Bishop how do you make such a sure determination that he was alive in the face of all the differing opinions regarding the living status of the man on the shroud and then take the path of covering it up? Was someone just covering all their bases? Why bother with testing the shroud in any kind of way at all if you’ve realized this before the tests were conducted? It’s not like they have to let it be tested, it’s the private property of the church and they can do whatever they want with it. Wouldn’t the church be taking an awfully big risk, once deciding to carbon date the shroud even after determining that Jesus is depicted as alive in the image, of offering a contaminated sample that supposedly includes an invisible reweave from another century as well as original shroud material? Wouldn’t they run the risk of someone eventually discovering this? Wouldn’t it be a gamble as to what century would be returned by the carbon dating? Or was it only important that a non first century date be returned? What do you think they might have said if a 17th or 18th century date was returned?.","date":"2012-01-11","mins":"4:00 pm","url":"https://shroudstory.com/2012/01/09/new-kindles-from-helmut-felzmann/","cat":"books","title":"New Kindles from Helmut Felzmann"},{"id":"comment-20145","author":"chris","post":"I think this is just being used as vehicle to express veiled hate..","date":"2012-12-10","mins":"1:07 pm","url":"https://shroudstory.com/2012/12/05/so-we-are-fruitcakes-just-in-time-for-christmas/","cat":"books","title":"So we are fruitcakes, just in time for Christmas"},{"id":"comment-6878","author":"chris","post":"I think the concept is very interesting, I also think it may be irrelevant. A God that requires an Act of Faith for Salvation will not leave you any purchase on proof in this world which is not His Kingdom. Quantum mechanics will not show you anything of meaning and they will not show you the fingerprints of the Almighty. As an Act of Faith I accept that I will never have proof unless Christ reveals himself to me in an extraordinary form. One thing that remains a very open question is whether we can know the cause of our existence through science. At present many minds don’t think that may be possible. I am open but not hopeful that the question will ever be settled in my lifetime. Whatever caused the Universe, or our state of being is not necessarily subject to it’s constraints. Time itself, from a quantum point of view probably did not exist prior to this Universe coming into being. It is an intrinsic characteristic to this Universe and therefore may not have existed at all prior to it. From that we can surmise that the cause of the Universe’s coming into being need not necessarily be constrained by Time. . . Or any other characteristic of this state of being. How does one measure or come to know and understand something that is not necessarily subject to anything we can possibly learn from this state of being? We may never be able to know scientifically anything outside our own Universe if that’s the case. It may all end up in the realm of philosophical conjecture. Regarding the Shroud I don’t think it shows any evidence of Resurrection. I am a firm believer that God doesn’t break the laws of nature, the laws of nature obey Him. I am faithful that one day one or more viable hypotheses will be developed which will show how, through natural events, the image on the Shroud was created. The only thing we can surmise is that something interrupted the Shroud’s interaction with a dead body. It may be the Resurrection, it may be someone stole the body or some other unforeseen explanation. For me, Faith gives me the answer, the Shroud only poses the question..","date":"2012-01-12","mins":"5:55 pm","url":"https://shroudstory.com/2011/12/29/the-coming-of-the-quantum-christ/","cat":"books","title":"The Coming of the Quantum Christ"},{"id":"comment-21792","author":"chris","post":"There will be no end to these such fantasies so long as there are those who are dependent upon them. Most people, though, will see them for what they are..","date":"2013-01-09","mins":"1:39 pm","url":"https://shroudstory.com/2013/01/04/the-shroud-was-the-resurrection/","cat":"books","title":"The Shroud was the Resurrection?"},{"id":"comment-130005","author":"chris","post":"I am partial to the naturalistic process theory. I think any naturalistic theory has to explain why there is no side image though. I’m not sure any of them do now..","date":"2014-06-16","mins":"12:16 pm","url":"https://shroudstory.com/2014/06/16/clarification-of-the-stochastic-process-paper/","cat":"paper_chase","title":"Clarification of the Stochastic Process Paper"},{"id":"comment-130280","author":"chris","post":"Hugh and Dave, thanks. Interesting theories and definitely stuff worth pondering. One of the things I wonder about though is how can we determine tight wrap versus a loose draping. Some of the blood stains suggest a tight wrap (or even a close wrap) without anything else in there – take that elbow bloodstain for instance. I recall reading something recently from another post where that blood stain maps to the man’s elbow if the shroud was wrapped around him. One would have to assume that there would not be anything else in there. The other thing is the bloodstains in the hair. Seemingly they map to the sides of the face? It would suggest, if that were true, that the shroud had to be wrapped tight at some point but then loosened and draped loosely for the image formation process. One possibility is that Joseph had helpers and they were the ones who had to physically take the body into the tomb and lay it in the shroud. Maybe they were doing this while Joseph was getting other burial supplies to put in the tomb in anticipation of a later, fuller burial. Perhaps they weren’t all that familiar with what Joseph had in mind given the time constraints and so while waiting for him to arrive wrapped the body rather closely thinking they were helping and that Joseph would just carry in the burial stuff and lay it next to the body (on the floor or something) instead of placing it around the body. Joseph then comes in with the stuff and wants to give Jesus a modicum of respect with regards to burial ritual but doesn’t have time to do anything other than just lay the stuff closely against the sides of his body and drape the shroud over everything. After all he’ll be back after the Sabbath to finish the job. And having those spices there might help with the inevitable stench from the decaying corpse. I can’t imagine that would take all that long and it might be long enough to allow the blood transfer to happen and then the image formation could happen over the period of the next 48 or so hours. Pure speculation on my part but in any scenario I think for a naturalistic process theory to work you’ve got to have both a tight wrapping and a loose draping if those facial and elbow bloodstain mappings are correct..","date":"2014-06-17","mins":"1:05 pm","url":"https://shroudstory.com/2014/06/16/clarification-of-the-stochastic-process-paper/","cat":"paper_chase","title":"Clarification of the Stochastic Process Paper"},{"id":"comment-130316","author":"chris","post":"Hugh, yeah, it’s tough to explain. It may be even simpler than we’ve imagined. Thinking about it some more it may just be that the body was wrapped tightly in the shroud right off the cross, then transported in some fashion to the tomb where it was unwrapped, spices laid aside it and the top draped over to await the final burial..","date":"2014-06-17","mins":"2:52 pm","url":"https://shroudstory.com/2014/06/16/clarification-of-the-stochastic-process-paper/","cat":"paper_chase","title":"Clarification of the Stochastic Process Paper"},{"id":"comment-6825","author":"chris","post":"Notice there’s no instructions on tuning in to the future. Ain’t that always the case? I’m trying to tune the blasted thing in to show me next week’s Powerball numbers and I just can’t get it to work!.","date":"2012-01-11","mins":"6:00 pm","url":"https://shroudstory.com/2012/01/11/you-couldnt-make-this-up-no-you-couldnt-no-really-you-could-not/","cat":"video","title":"You couldn’t make this up. No you couldn’t. No. Really. You could not."}]}
