{"art":[{"id":"comment-7090","author":"christie","post":"Wow! I am in awe of your testimony Joe. Thank you for sharing this with everyone. I too believe that Jesus is doing everything HE can to convince the World that HE is real & for those of us that need to be saved, please repent in the name of the Father, the Son & of the Holy Spirit. Our Lord Jesus Christ loves us all & wants us to join HIM in HIS Kingdom of Heaven to have Everlasting Eternal Life. …The time to repent is NOW. Here is a prayer: “Father I believe that you sent Jesus for my sins. I have faith in HIS blood, that HE died for my sins & arose from the dead. I repent of all my sins, all my junk, all my trash. Jesus come into my heart now. Be Lord of my life. Thank you for saving me. In your precious name, Amen..","date":"2012-01-17","mins":"10:23 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7093","author":"christie","post":"Amen. Susan, “Thank you so much.” Yes, Jesus is Real & HE is coming back one day. We need to be ready. …When I was 20 years old, I was in a really bad car accident. My car spun around 6 or 7 times on the interstate one night in 1991. I wasn’t driving fast (going about 35 mph off the ramp), it was raining that night, no lights were lit up on the ramp to the interstate. There was a car up ahead stalled, half on half off the merging lane, I didn’t see it. Any way, I hit that car so hard. An eyewitness said that my car was spinning in the opposite direction & that I was lucky that no other cars hit mine. The whole time my car was spinning, “I felt like I was being cradled like a baby, being protected.” “Wow. I had my seat belt on. My car was totaled. I managed to walk away without a scratch.” I knew at that very moment that I had been saved. I always thought that it was my dad (who had past away at age 29 from cancer, when I was nearly 2 yrs old) that had saved me. I know that he had a great deal to do with that. Ultimately, looking back, it was definitely GOD himself that saved me that night. Wow! I definitely BELIEVE in GOD. I know that HIS son Jesus Christ is coming back one day soon. We must all be ready..","date":"2012-01-17","mins":"11:06 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
