{"art":[{"author":"chuck_hampton","post":"Thanks Mark, brilliant as always!Obvious correlation.  I love all the comments.Like the 3 yr-old said to me the other day, “It looks like Jesus.”","date":"July 11, 2015 at 6:42 pm","url":"https://shroudstory.com/2015/07/10/dirk-bouts-the-entombment/","cat":"art","title":"Dirk Bouts’ The Entombment"}],"blood":[{"author":"chuck_hampton","post":"Unfortunately the most neutron flux occurred where the image resides, not in a far corner (C-14 area) of the cloth unless that part was folded under or over the Body during image formation.However, a single 14 ft thread just off image would have been the best sample in this case.  That could provide an immense amount of information alla various isotopic ratios (not just carbon) to examine the nature and levels of the energy responsible for this unique Image.","date":"October 31, 2015 at 2:13 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"author":"chuck_hampton","post":"God wanted it open as an exclamation, like the Image.  Go tell","date":"November 4, 2015 at 10:42 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"author":"chuck_hampton","post":"I suggest the electrons collapsed into the nuclei emitting UV and/or soft X-rays.  A new force must be responsible for this. Unified theory maybe?  Colossians 1:17 and Hebrews 1:3 both indicate Christ’s authority over the 4 forces we know about.  In any event, the electrons were not in the way with His new Body. He could walk through walls so of course a cloth could collapse through that sort of matter, alla Jackson’s very elegant model.","date":"November 4, 2015 at 11:29 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"}],"dating":[{"author":"chuck_hampton","post":"I met privately with Dr. Herbert Haas of SMU while viewing a life-size transparency at the Biblical Arts Museum in Dallas back in 1990.  As a C-14 expert he was appalled at the 1988 fiasco and said the most useful sample would be a single thread running the length of the Shroud just off image.  He said hundreds of dates could be obtained along with the measure of other isotopes of different elements like Oxygen, etc which could provide a plethora of data on the “event” of image formation while at the same time leaving no visible mark on the cloth.","date":"April 21, 2015 at 12:46 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"}],"image":[{"author":"chuck_hampton","post":"Yet another “not even close” attempt at image formation.  Like so many others, he too will realize why it is futile. Collins tenacity, however, is to be envied.","date":"September 4, 2015 at 10:29 am","url":"https://shroudstory.com/2015/09/03/colin-berrys-latest-and-greatest-is-it-enough/","cat":"3d","title":"Colin Berry’s Latest and Greatest. Is it Enough?"},{"author":"chuck_hampton","post":"Kevin and I have spent many hours discussing image formation with other shroudies, usually via phone.  He is truly amazing. I also had the opportunity to use the VP-8  when Rev Dreisbach had it in his Atlanta exhibit (probably the same machine).  You are correct.  It is an antiquated method of showing image structure and distance correlation and Dr Jackson’s moment will forever stand as one of the 2 greatest moments in Shroud history along with the Pia photonegative.  Spectacular!!","date":"September 28, 2015 at 8:23 pm","url":"https://shroudstory.com/2015/09/26/the-vp8-cinderella-question/","cat":"3d","title":"The VP8 Cinderella Question"},{"author":"chuck_hampton","post":"The article is fun to read but leaves out the two insurmountable problems of the blood and the image depth and uniformity.","date":"June 24, 2015 at 10:49 am","url":"https://shroudstory.com/2015/06/23/a-shameless-plug/","cat":"image_theory","title":"A Shameless Plug"}],"misc":[{"author":"chuck_hampton","post":"I Cor 15:51-2 states a twinkling of an eye.  0.01 sec or less.  A bump of energy and a quick dissipation.  Like a lightning strike.Jesus warned the 3 disciples not to mention the transfiguration until after resurrection, linking the 2 events. (Synoptic gospels)","date":"November 20, 2015 at 4:19 pm","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"author":"chuck_hampton","post":"not dematerialize, a different kind of material.","date":"November 17, 2015 at 9:30 am","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"author":"chuck_hampton","post":"How much time elapsed and how far the cloth fell during image production is a current query.","date":"November 20, 2015 at 10:12 pm","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"author":"chuck_hampton","post":"I’m not sure where dematerialization notion came from but it is a bad inference.  Jackson does not believe a vacuum was created (I believe a small vacuum) which means a Biblical, bodily resurrection.  The same matter changed.  At that point we are groping as we do with the other side of the big bang.  This conundrum is humbling.","date":"November 20, 2015 at 11:57 am","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"author":"chuck_hampton","post":"John 21:12 indicates Jesus’ Body could change His appearance.  Again, a different kind of material, a different set of physical laws concerning matter.  The resurrected body is different.Drawing inferences from these scriptures and the Shroud seems to be perfectly acceptable.Going into a lab and duplicating the process is heretofore unimaginable.","date":"November 17, 2015 at 9:44 am","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"author":"chuck_hampton","post":"I like the probabilities.  1X10 to the nth power that it is, in fact (as Dr Adler use to say) the photograph of JESUS, the Son of God.  Suffering, death, burial and resurrection.Simply the perfect Gospel.","date":"September 26, 2015 at 11:31 pm","url":"https://shroudstory.com/2015/09/25/everything-we-know-about-the-shroud/","cat":"reader_inquiry","title":"Everything We Know About the Shroud?"},{"author":"chuck_hampton","post":"You mean, why do people believe in Koran and Mohammed which teach the killing of Jews and Christians.Answer: allah = satan","date":"November 16, 2015 at 9:29 am","url":"https://shroudstory.com/2015/11/14/paris/","cat":"news_&_views","title":"Paris"},{"author":"chuck_hampton","post":"Faith is the mustard seed leftover.  1X10 to the -n.He said He loves us.  Is there anything else?","date":"September 26, 2015 at 11:33 pm","url":"https://shroudstory.com/2015/09/25/everything-we-know-about-the-shroud/","cat":"reader_inquiry","title":"Everything We Know About the Shroud?"}],"opinion":[{"author":"chuck_hampton","post":"All “natural” models have failed. Every model has failed except Jackson’s.If it were “normal/natural” we would have at least one other example.  Let’s not kid ourselves.  We are talking about Jesus, not washington or pliny or even Moses.  Accept it.  The Image is one if a kind so far. The bloodstains even testify.","date":"November 8, 2015 at 6:13 pm","url":"https://shroudstory.com/2015/11/07/a-guest-posting-by-o-k/","cat":"guest_posting","title":"A Guest Posting by O.K."},{"author":"chuck_hampton","post":"Thanks again Joe!!    What? Jesus didn’t perform spectacular signs?  The Shroud (the sign of Jonah) is the sign He promised a wicked and adulterous generation.  The current generation qualifies. And the Burial Cloth of Jesus is far more spectacular than walking on water, raising Lazarus, or feeding 5000 with a sack lunch.","date":"October 24, 2015 at 11:08 am","url":"https://shroudstory.com/2015/10/24/and-now-you-have-something-to-do-this-weekend/","cat":"other_blogs","title":"And now you have something to do this weekend"},{"author":"chuck_hampton","post":"The Lord Himself still authenticates His burial cloth.  Truth (or even a ridiculous probability of what’s true) is certainly not dependent on anyone’s opinion.  The Pope agrees I might assume.  He may also agree that it is beginning to finally having its full intended effect, thanks to people like Joe Marino and John Jackson and so many other amazing shroudies around the Earth.“This Gospel of the Kingdom must be preached to all kingdoms.”  Imperative. Go!!","date":"August 13, 2015 at 8:27 pm","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"author":"chuck_hampton","post":"Nicodemus did not supply anything but myrrh and aloes; not linen.John 19:39 NASBNicodemus, who had first come to Him by night, also came, bringing a mixture of myrrh and aloes, about a hundred pounds weight.  Jn 19","date":"October 30, 2015 at 11:58 am","url":"https://shroudstory.com/2015/10/29/ye-denizens-of-shroudsponge/","cat":"other_blogs","title":"Ye Denizens of Shroudsponge"}],"researchers":[{"author":"chuck_hampton","post":"Dr Jackson is correct.No other image formation model explains EVERY observation.Now to figure out what the matter was doing during image formation to render such a beautiful record of the entire Gospel.What form of energy, UV and soft Xrays from electrons collapsing into the nuclei perhaps?That sounds like a new force or the unified force, a new physics and I like it.","date":"October 23, 2015 at 11:58 am","url":"https://shroudstory.com/2015/10/22/available-critical-summary-version-3-0/","cat":"critical_summary","title":"Available: Critical Summary Version 3.0"}],"resources":[{"author":"chuck_hampton","post":"My understanding was that there was a very faint image of the face on the reverse.  Has anyone else heard of this and if so why was it not mentioned in the interview above I wonder?Chuck Hampton – Dallas, TX","date":"April 18, 2015 at 5:07 pm","url":"https://shroudstory.com/2015/04/17/in-the-interest-of-scientific-openness/","cat":"press_coverage","title":"In the Interest of Scientific Openness"},{"author":"chuck_hampton","post":"Thank you Dan for your indispensible levity.  The Burial Cloth of JESUS seems to upset folks just like His Name does. Curious.","date":"October 16, 2015 at 2:09 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"author":"chuck_hampton","post":"All I know is that Mark has surprised every time. This will make you think about this conundrum again.  Image formation is really the crux and Mark Antonacci has brought this to our attention alla Dr John Jackson for the public to evaluate all over again.  As technology advances the secrets become apparent and exposed.  A new physics/ force.It’s a recording of the suffering, death, burial and Resurrection of The Son if God, the Gospel.  Let’s spread the news!!! Time is short","date":"October 23, 2015 at 2:36 am","url":"https://shroudstory.com/2015/10/22/new-book-by-mark-antonacci-is-available/","cat":"books","title":"New Book by Mark Antonacci is Available"},{"author":"chuck_hampton","post":"Mark means “proof beyond any reasonable doubt” in the legal sense, not 100% scientific proof (not sure that even exists) or like proving a math theorem. Mark’s a lawyer.     As far as the historicity of His Bodily Resurrection is concerned; that kind of proof has been long established, without the Cloth.  Mark is using the Shroud as exhibit A in this sort of line of evidence concerning this event.  History matches the observations.Occam’s razor.  Just like any jury member, you decide the best answer to ALL of the evidence.  Unbiased.Jackson himself would agree that the probability Jesus’ Resurrection being in some way responsible for the data is a very high probability.","date":"November 1, 2015 at 10:38 pm","url":"https://shroudstory.com/2015/10/31/proof-of-the-resurrection/","cat":"books","title":"Proof of the Resurrection?"},{"author":"chuck_hampton","post":"The coin(s) are an important data treasure concerning the nature of the image formation process, the energy responsible.  The energy passed through the coins, interacting with those atoms enough to leave an image with surprising resolution on a linen cloth.  WOW!","date":"November 7, 2015 at 8:00 pm","url":"https://shroudstory.com/2015/11/06/now-you-can-read-it-online/","cat":"paper_chase","title":"Now you can read it online"},{"author":"chuck_hampton","post":"Dr Haas (SMU) said to me back in 1990 that many ion ratios could be examined the next time a REAL sample(s) is made available.  The clues to the nature of the event are just waiting to be discovered.","date":"November 7, 2015 at 8:06 pm","url":"https://shroudstory.com/2015/11/06/now-you-can-read-it-online/","cat":"paper_chase","title":"Now you can read it online"},{"author":"chuck_hampton","post":"I meant isotope, not ion.","date":"November 7, 2015 at 8:07 pm","url":"https://shroudstory.com/2015/11/06/now-you-can-read-it-online/","cat":"paper_chase","title":"Now you can read it online"},{"author":"chuck_hampton","post":"Even when I “try” to see these with a larger than life 2nd generation negative from Enrie’s 1931 photo of the face and chest – nothing.  The coin over the right eye is the only other image detected by my eyes.Red herring?","date":"November 12, 2015 at 7:43 pm","url":"https://shroudstory.com/2015/11/11/psychological-influences-in-seeing-inscriptions-on-the-shroud-of-turin/","cat":"paper_chase","title":"Psychological Influences in Seeing Inscriptions on the Shroud of Turin"}]}
