{"art":[{"author":"clublu22014","post":"It may leave a lingering curiosity if the L-Markings on the Shroud were indeed  1st Century Gamma-Markings signifying a type of Light-Radiation (unknown then and now).  And, that the Gamma-Lumen Markings were created around the 1st century to either mimic the Light-Radiation of the Image on the Shroud or to enhance, brand, and claim the Shroud Image as the ultimate Sacrifice searing in the code of Bodily-Resurrection.  Even suggesting that what created the Image also created the L-Markings (Gammadia).\n\n","date":"July 25, 2014 at 10:00 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","title":"Origin of the Gammadia"}],"blood":[{"author":"clublu22014","post":"This may be a stupid question:  “Why is there not more random blood on the TS?”\n\n","date":"June 16, 2014 at 10:55 pm","url":"https://shroudstory.com/2014/06/14/paper-chase-a-natural-stochastic-process-may-explain-the-coexistence-of-bloodstains-and-an-image-on-the-shroud-of-turin/","cat":"blood_studies","title":"Paper Chase:  A Natural Stochastic Process May Explain the Coexistence of Bloodstains and an Image on the Shroud of Turin"}],"coins":[{"author":"clublu22014","post":"Right… I get your point Hugh… someone in the patchwork department back then had a case of bad nerves.  The blood being on the model first before the shroud is also interesting.  But what about the case of rigor mortis that so many medical doctors determined was apparent when studying the TS.  Would you say that was cause and effect of a statue or of a dead man?\n\n","date":"March 11, 2014 at 7:24 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","title":"Of Google Doodles and Other Coincidences"},{"author":"clublu22014","post":"Clarification of above in addressing Hugh’s gracious explanation of the TS image formation:  I meant to ask:  Would you say the image formation was the cause of a statue or of a dead man?\n\n","date":"March 11, 2014 at 7:45 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","title":"Of Google Doodles and Other Coincidences"},{"author":"clublu22014","post":"\nMike M :\nClublu22014, thank you for the nice words, I don’t think I deserve them. The image on the back of the cloth is still debated. A poor photograph of the backside of the shroud is available in the following link (hat tip to Hugh)\nhttp://shroud.wikispaces.com/PROPERTIES\nAs you can see, ( or can’t see) it doesn’t look that there is an image there. G. Fanti believes there is, and has published a paper describing that image. He used filters to decrease background noise and increase contrast, according to him the image on the back is:\n1- superficial (i.e doubly superficial)\n2- only for the ventral figure not the dorsal one.\n3- three dimensional.\n4- corresponds to the front image location.\n5-slightly different from the front image (e.g. the nose on the back presents “the same extension of both nostrils, unlike the front side, in which the right nostril is less evident.”\nI believe the church has in its posession high definition images for the backside that has not been published yet, lets hope they release it sometime in the future.\nI personally believe the veil of Manoplello to be a painting. There is clearly brush strokes evident around the lips and the eyes. To me, it looks like a work of art. However, I believe the Sudarium of Oveido to be the facecloth that was mentioned in (John 20:7) “and the face-cloth which had been on His head, not lying with the linen wrappings, but rolled up in a place by itself.” Mark Guscin has done a great Job bringing the sudarium to light. This video from YouTube explain a lot about the sudarium.\nhttp://m.youtube.com/watch?list=PLbBbBRYEFBb3hPo_cSF-9eikve1pENm5k&v=_ojyZX5_iyU&feature=plpp\n\nMike M:  You well deserve many kudos!  Thanks for responding and answering to all my neophytic questions.\n\n","date":"March 11, 2014 at 7:30 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","title":"Of Google Doodles and Other Coincidences"},{"author":"clublu22014","post":"Mike this is an amazing reconstruction from your insight into Dr. Jackson’s research!  Thank you for making us realize how lucky we are to view the Shroud more true to form!  (Just wondering, if you could help me out on answering if the patches and the Holland Cloth backing sewn on after the fire in 1532 were of cotton or of linen. I read conflicting reports.)\nThanks again, Mike!\nI’m not too sure what Hugh means by the Church removing (burn) marks showing signs of fakery.  How does cleaning up the Shroud show signs of fakery?\n\n","date":"March 10, 2014 at 8:41 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","title":"Of Google Doodles and Other Coincidences"},{"author":"clublu22014","post":"Thank you so much Mike… (You’re amazing!)  You’ve help me so much in understanding the Shroud better!  Do you have any insight into the slight image formation found after the Holland Cloth was removed?  Was it only surface fibers affected and was it an image suggesting the face?\nAnd, what do you think of Sr. Blandina’s theory of multiple funerary cloths used at the time of this burial, cf:  Sr. Blandina Schlöemer:  Website: SudariumChristi.com/uk/tomb/compare.htm,  Barrie doesn’t relate well to this.  He thinks the Shroud was the only burial cloth used.  What is your opinion?   Again, I am deeply grateful for any and all of your insights, Mike.\n\n","date":"March 10, 2014 at 9:29 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","title":"Of Google Doodles and Other Coincidences"},{"author":"clublu22014","post":"Hugh, this is a most interesting theory!  I’m wondering what’s the source… Picknett & Clive?’\nAnd, what then about the blood being placed first on the Shroud precluding the rendering of any artistic manipulation of the image?\n\n","date":"March 10, 2014 at 11:57 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","title":"Of Google Doodles and Other Coincidences"}],"dating":[{"author":"clublu22014","post":"Good deduction, Joe.  It leaves me frustrated how those in academia can collaborate and get a C14 date just the way they want it out to the public and close the door to further questioning of a non sequitur (400 years anon) reference to the Jesus of the Gospels while those in a conspiratorial circle can confound the real reference to Jesus (the 1st century Shroud) and keep the door open to controversy.\n\n","date":"April 11, 2014 at 8:16 am","url":"https://shroudstory.com/2014/04/10/carbon-dating-problems-with-the-jesus-wife-fragment/","cat":"carbon_14_dating","title":"Carbon Dating Problems with the “Jesus’ Wife” Fragment"},{"author":"clublu22014","post":"Thanks Max!  Can I find your paper on Shroud.com?\n\n","date":"May 20, 2014 at 1:14 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"},{"author":"clublu22014","post":"Max, this editorial of yours is so magnificent, so thoroughly thought out and researched!  Why don’t you publish it in English on Barrie’s Shroud.com?… It’s overdue for a wider audience!\nDo you plan to attend the St. Louis Shroud Convention this October?  Your paper should be presented there in any case!\n\n","date":"May 20, 2014 at 1:41 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"},{"author":"clublu22014","post":"Too bad, Max.  The work you’ve done is BRILLIANT!  I’d like your autograph!\n\n","date":"May 20, 2014 at 2:11 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"},{"author":"clublu22014","post":"Hi Max,  Google translates your excerpt well:  “\nNon- detection zone (if not both) has undergone invisible to the naked eye repairs\nAll this set of direct and indirect evidence is a consistent body of evidence: it tends to testify in said steeper and darker area, an intervention by a special technique inspired by the technique of ” reweaving the French “(well-known master – weavers as well as experts in the history of tapestry); technique he should not however be confused with that of a simple ” entissage ” a medieval patch, spotted, meanwhile, to the naked eye and natural daylight by a specialist.\nThe technique in question here is more precisely that of a ” reweaving by splice ” without seams or knots, made , apparently , in a shaving light and under a strong magnifying glass . It requires a lot of patience and great dexterity. It consists in, first, the foundations and the basic chain. To do this, either the weaver begins by identifying the fiber material constituting the son of the chain then provides either systematically uses cotton fibers. Then these fibers are spun to obtain the thickness of the original son then carefully twisted on themselves and on-site fiber son string extracted from the hidden part of the tissue to be repaired. Son of the replacement frame are then placed on top and below the chain son reconstituted fibers then are twisted on themselves, again with care, fiber of the son original frame so as to reproduce exactly texture or pattern of the fabric and so close, without knots, the hole or severely sheared zone.\nFinally to make this wire restoration wire completely invisible and consolidate splices, dyeing gum base resin is applied topically to the frame and rebuilt before it , from which the effect of texture or pattern is based on the original (in this case the yellowed patina ivory canvas by centuries ) . This intervention under grazing illumination and a magnifying glass, if it is well done and well hidden, can actually be visible on both sides of a piece of cloth to the point of sometimes escape even by hand and eye exercised by a skilled person who, to the naked eye and under inadequate light, tends to confuse these reconstructions with irregularities occurred during weaving. In fact, small-scale structure of the original linen of the Shroud, its strong enough and its tightly woven herringbone caliber are likely to perfectly integrate this type of intervention.\nAs for sample Zurich (and hence ” Sample 1 Arizona “) alleging the clear part of the official band of C14 Shroud , although it does not appear to have any or very little trace contamination any teinture14 , not least should be covered with a patina of microorganisms. By the abnormal appearance of the area where it was taken, it strongly suggests, in any case, a second type of response undetectable to the naked eye as done, too, it seems, under a grazing lighting and under a strong magnifying glass “to mending a loss.” This technique is very specific to insert, between the son of weft and warp, the son (cotton here), which in each case are cut off at both ends without knots, thus leaving literally lost in the fabric existing flax.\nThese two specific types of intervention (one in the sense of a replacement carbonaceous material, the other in both a replacement and a slight contribution) would account for the wide dispersion of observed results (1238-1407) on a small distance (just four centimeters of tissue).\nThe coating of gum arabic is soluble in water and present in this area of the upper left corner, there could not have been applied to the surface samples Raës son and C14 after the fire of the Holy Chapel of Chambéry 1532 dyeing had she been before, it would not have hidden the end of the upper edge of the large jagged halo because the water from the fire had driven the products of pyrolysis at the heart of local son. This late addition colored coating due to the lack of fluorescence observed in this particular area of the UV sheet.\nThe conservation history of the Shroud in 1532 after dating allows, in a very precise manner, at least one or both interventions. Only, in fact, the four sisters Clare in 1534, and Princess Clothilde of Savoy Bonaparte, in 1863/8, which intervened on the extended relic way, could make such repairs invisible hands as experts. Poor Clare sisters are entrusted with the views very specific spot repair and strengthen the damaged piece of cloth in the fire of 1532 , the Princess of Savoy Bonaparte thus proves to be for these delicate restoration work, the most highly probable candidate ( assisted or not it upholsterer master of the royal court at the time) . This all in 186, it was already more than five centuries at each exposition with bare hands, the relic is found to be stretched horizontally.\nThis explains (or explain ) why , when cutting the sample and lack of adequate lighting (UV light or grazing ), both local variants passed completely unnoticed textile experts to oversee the levy the official dating from 1988. All their attention was then absorbed either by the technical study of the sheet (they saw for the first time) by the annoying presence of the son of the thick seam bound residue of the upper Shroud fabric cutting. Thus they forgot to make a careful examination of the heart of the textile to collect site. The had they looked , they could not have missed, in fact, be identified early reconstruction of serpentine form , dyeing concealing the end of the upper edge of the large halo of water and the indented character more stiff and darker area .\nIn principle, an “invisible” restoration cannot escape the account over and a fortiori when the binocular eye behind is competent. Photos that show Francesco Testore and Gabriel Vial ( † 2005) Prs bustling with various instruments , however, it is little misleading in that they suggest that such experts were engaged in preliminary integrity checks said area when in fact their audits were not extended to the heart of the sample but were confined to one edge of the sheet. And believing he released the sample to any foreign frayed wire edges , they left to the operator, Giovanni Riggi di Numana ( † 2008), ” care ” to reduce to a slightly more regular rectangular strip coarse rectangle thereof, using scissors surgeon, had just extracted without protective gloves and more or less uneasily at the main room.\nObviously, this engineer (who fell the responsibility and choice of location and the sampling)! Textile expert was not any more than it was carbonologue or archéologue 15. It seemed indeed to ignore how, on radiocarbon, high technology Accelerator Mass Spectrometer (suitable for measurements on microarrays) appears to be susceptible to contamination including that of human sebum. This choice of an area that had been, over the centuries, many manipulations with bare hands during exhibitions was thus already, from that point of view, anything but wise. “\n\n","date":"May 20, 2014 at 4:33 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"},{"author":"clublu22014","post":"Well stated, Sir Dave B. of Wellington!\n\n","date":"May 21, 2014 at 8:12 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"},{"author":"clublu22014","post":"Loved reading your well-informed insights Dave re GJW… and wholeheartedly agree!\n\n","date":"April 11, 2014 at 10:02 am","url":"https://shroudstory.com/2014/04/11/more-on-the-carbon-dating-of-the-gjw-gospel-of-jesus-wife-fragment/","cat":"carbon_14_dating","title":"More on the Carbon Dating of the GJW,  ‘Gospel of Jesus’ Wife’ Fragment"},{"author":"clublu22014","post":"I’ve seen this video a few times but it is always nice to refresh the memory especially with the Shroud pioneers of a young Barrie Schwortz, Vern Miller, Don Lynn, Alan Whanger. portrayed with awe, continuity, and conviction.\n\n","date":"April 11, 2014 at 12:08 pm","url":"https://shroudstory.com/2014/04/10/ray-schneider-why-is-the-carbon-dating-wrong-i-dont-know-that-it-is-wrong-i-am-quite-certain/","cat":"carbon_14_dating","title":"Ray Schneider: Why is the carbon dating wrong? I don’t know. That it is wrong I am quite certain . . ."}],"events":[{"author":"clublu22014","post":"“I have not come to bring  peace a but a sword” / “I have not come to bring unity but division” (Matt. 10:34), is what the Shroud has done to those who have sought to take more from it than what is offered.\n\n","date":"April 24, 2014 at 5:47 pm","url":"https://shroudstory.com/2014/04/23/how-many-strange-statements-can-you-count/","cat":"lectures","title":"How many strange statements can you count?"},{"author":"clublu22014","post":"Right, Dave.  Thanks for pointing this out!  It’s way beyond Downing and Shroud CD’s…e.g. “The Alpha-Particle Irradiation Process Solving the Mystery of the Shroud” by Robert Villarreal is one topic amongst the many that made me sit up and say:  RREALLY!\n\n","date":"June 2, 2014 at 6:57 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"author":"clublu22014","post":"Wow, this is impressive!  Can’t believe Dr. Andrew Silverman is coming from England!  Dr. Petrus Soons, from Peru!  Plus, it ought to be fun watching the Italians Bruno Barberis and Giulio Fanti argue it out… better brush up on my Italian!   All the other many very credible and highly published notables, without repeating the list above just some of the many:  Barrie Schwortz (STURP), Russ Breault, Dan Scavone, Jack Markwardt, Mark Antonacci, Arthur Lind (STURP), Robert Villareal (STURP)!   Just wish that Dr. John Jackson (STURP) would have presented a paper!  Perhaps, though, he and his wife Rebecca have bought a ticket?   I’ve bought my ticket!\n\n","date":"June 1, 2014 at 6:29 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"author":"clublu22014","post":"Hugh, I’d give you more than my eye-teeth for you to be there!  I’d love to meet you in person and for you to sign my program-brochure!\n\n","date":"June 1, 2014 at 6:45 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"author":"clublu22014","post":"Andy, I respect your faith perspective, but that aside, not relying on the NT telling us about Jesus and salvation… just looking at the Shroud and all the abuse taken by this one individual, and that after death, this one man could project that abuse in a 3-D negative photograph on a burial sheet of linen, that can’t be duplicated and has been preserved ever since tells me that this is a force unknown to mankind.  I admire Pauline theology, but I think we could be asking more probing questions scientifically and theologically about this cause and effect after death.  I think the love behind it is truly unknown and obfuscated by the abuse of that concurrent culture.\n\n","date":"May 24, 2014 at 1:11 pm","url":"https://shroudstory.com/2014/05/24/shroud-presentations-in-silver-city-new-mexico/","cat":"event","title":"Shroud Presentations in Silver City, New Mexico"},{"author":"clublu22014","post":"Can someone please explain to me how the Shroud is “an act of God’s great love?”  I see the Image on the Shroud only as a mystery of how one person could have had such an amazing cause and effect not just in life but astoundingly in death!  I’m having difficulty in seeing this as a “receipt for our salvation” or as “an act of God’s great love.”  P.S. I am not an atheist or an anti-Christian…\n\n","date":"May 24, 2014 at 7:21 am","url":"https://shroudstory.com/2014/05/24/shroud-presentations-in-silver-city-new-mexico/","cat":"event","title":"Shroud Presentations in Silver City, New Mexico"},{"author":"clublu22014","post":"Leave it to Barrie & Joe and Dan to collaborate so nicely to serve all of us needy Shroudies!  Thanks guys, this move will be so much appreciated.  Will Russ Breault have the videos posted on Shroud.com as well or will they be sold individually on the WWW?\nWishing there could be another Shroud Convention next September/October in a vacation spot such as Cape Cod or Martha’s Vineyard but that might require a time period of more than four jam-packed days!\n\n","date":"October 25, 2014 at 4:18 am","url":"https://shroudstory.com/2014/10/24/st-louis-papers-to-be-archived-at-shroud-com/","cat":"conference","title":"St. Louis Papers to be Archived at shroud.com"},{"author":"clublu22014","post":"Dave, I’m infatuated with your reasoning!… I think Paul’s MO had to have been an occasional borrowing of the Shroud to draw an audience and be convincing.  (Any chance you could allow me to have your email address or FB me?)\n\n","date":"June 24, 2014 at 10:29 am","url":"https://shroudstory.com/2014/06/23/anticipating-the-conference-frederick-baltz-proposes-a-new-reference-to-the-shroud-of-turin-in-galatians/","cat":"st_louis_2014","title":"Anticipating the Conference:  Frederick Baltz proposes a new reference to the Shroud of Turin in Galatians"}],"history":[{"author":"clublu22014","post":"I haven’t read Jan’s book yet, but what I gather from Dan’s comments it is another of the many books that make “Jesus” seem ordinary, like a common hippie-guy having a common Seder with his friends… ponytail and all and then transferring this common energy onto an uncommon Shroud.  I don’t buy it.  If anything the man on the Shroud had a magnificent energy form which imparted long-lasting information.  The type of information that goes beyond the common beer-drinking crowd of today; the type of information that makes us wonder did he walk on water, did he heal the sick, and raise the dead, did he rise to new and everlasting life?  Wonder of Wonders… with the possibility of bringing us all to say one day:  I and the Father are One!\n\n","date":"March 18, 2014 at 7:11 am","url":"https://shroudstory.com/2014/03/18/an-image-to-hold-onto-until-eternity/","cat":"history","title":"An image to hold onto until eternity."},{"author":"clublu22014","post":"The scraping by a knife description by CF really made me laugh!  Right…like shredding threads by monotone painting….what artwork indeed!\n\n","date":"October 30, 2014 at 2:29 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science"},{"author":"clublu22014","post":"On canvas not on expensive linen.\n\n","date":"October 30, 2014 at 8:04 pm","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science"},{"author":"clublu22014","post":"Absolutely! DaveB why don’t you write a Shroud book correcting mistaken historians from then to now.\n\n","date":"October 30, 2014 at 2:26 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science"},{"author":"clublu22014","post":"Hey Dave, could you try emailing me again?\n\n","date":"October 30, 2014 at 10:31 pm","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science"},{"author":"clublu22014","post":"David, you can turn your attention to an aberration from the historical affirmation that the Mandylion/Shroud was an “acheiropoieta”, But if anything else, ANYTHING, ever showed up in history as a true “acheiropoieta”  it is the TS.  No other empirical evidence exists.\n\n","date":"May 10, 2014 at 10:37 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"author":"clublu22014","post":"Because the Shroud is not a painting… and the Mandylion if not the Shroud was a painting or woodcarving.\n\n","date":"May 10, 2014 at 6:25 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"author":"clublu22014","post":"Skepticism hold-out,,, or do you have another observable artifact that could be said to have been made “not with human hands”?   O.K., you can lose the thrill of not being able to face the unique Image of the Man on the Shroud, cause and effect– AFTER HIS DEATH (the only evidence of LIFE AFTER DEATH, i.e. the obvious miracle of the Shroud) and admit that the human mind can neither play with nor fathom its depths. Or, you can pretend to “scientifically” ATTEMPT to understand the nuts and bolts of it.  The Shroud is the only piece of evidence of LIFE AFTER DEATH—the only analytic viewpoint observable… cause and effect came NOT BEFORE DEATH but cause and effect came AFTER DEATH.\n\n","date":"May 10, 2014 at 12:07 pm","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"author":"clublu22014","post":"I’m sorry for you, too, Hugh.\n\n","date":"May 10, 2014 at 2:43 pm","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"author":"clublu22014","post":"To the effect that God is an “object” or an objective, Louis, there is always a resistance or an “edging out”.  But how nice to realize we needn’t concern our true selves with such matters… only with what really matters:  the abiding presence of God!  Oh Happy & Loving Day!  (As I’m sure you know.)  Thanks for the interview with J.A Fitzmyer.  What a great biblical scholar an a confere with G. W. MacRae, S.J.  Louis, I wish I could somehow get your email address… but thanks for feeding me so well on Dan’s blog!\n\n","date":"May 10, 2014 at 3:23 pm","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"author":"clublu22014","post":"Simcha Jacobovici is in the same camp as Dan Brown… and should take a course in Early Christian Gnosticism first before spouting off on its attributes.  Nowhere did a Valentinian codex such as the Apocryphon of John ever mention Jesus’ wife or beloved and surely none made direct reference to Mary Magdalene. The Gospel of Philip was not Valentinian.\nLouis, Paul, as I’m sure you know, wasn’t concerned about the earthly life of Jesus.  Paul was only concerned about Jesus’ mystical life–his Paschal Mystery:  Passion, Death, Resurrection.  So you and I agree that Jacobovici and all of the Dan Brown camp are far a field from the Truth and Core of the NT.\n\n","date":"May 8, 2014 at 9:53 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","title":"The Latest News on the Gospel of Jesus’ Wife"},{"author":"clublu22014","post":"Wished you lived in the States Louis,  We’d find a way of storming the hallowed halls of Harvard Divinity!\n\n","date":"May 8, 2014 at 10:52 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","title":"The Latest News on the Gospel of Jesus’ Wife"},{"author":"clublu22014","post":"King Conned!\n\n","date":"May 7, 2014 at 10:31 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","title":"The Latest News on the Gospel of Jesus’ Wife"},{"author":"clublu22014","post":"Professor George Windsor MacRae, S.J., would have left it up to Prof. Frank Cross…  George MacRae would have been disappointed in Karen King, and have advised her not to have not accepted the faux papyrus.  George’s field was Early Christian Gnosticism, and this piece didn’t fit the field.  Thanks for asking Louis.  I think King-Conned should have listened even a little to the voice who previously held her Divinity chair.\n\n","date":"May 8, 2014 at 9:37 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","title":"The Latest News on the Gospel of Jesus’ Wife"}],"image":[{"author":"clublu22014","post":"Hugh, would you kindly circle the inscription of Joannes Baptista de Rovere.\n\n","date":"December 14, 2014 at 12:24 am","url":"https://shroudstory.com/2014/12/13/is-there-an-art-historian-in-the-house/","cat":"3d","title":"Is there an art historian in the house?"},{"author":"clublu22014","post":"Boy oh Boy, Colin’s 3D-face picture of Jacques de Molay looks like a caricature of Barrie Schwortz!\n\n","date":"June 7, 2014 at 10:01 pm","url":"https://shroudstory.com/2014/06/07/colin-berry-is-up-with-an-interesting-posting-about-3d-enhancement/","cat":"3d","title":"Colin Berry is up with an interesting posting about 3D enhancement"},{"author":"clublu22014","post":"Wondering if the electromagnetic energy could have been induced by any ancient occultist practice as John Winslow Gibbons suggested in his recent book:  Shroud of Turin and the Origins of Christianity?\n\n","date":"June 9, 2014 at 7:15 am","url":"https://shroudstory.com/2014/06/09/anticipating-the-conference-andrew-silverman-on-the-shroud-and-a-relationship-between-mind-and-matter/","cat":"image_theory","title":"Anticipating the Conference: Andrew Silverman on the Shroud and a Relationship Between Mind and Matter"},{"author":"clublu22014","post":"Agree with you totally, Paulette!  WOW!\n\n","date":"June 5, 2014 at 12:14 pm","url":"https://shroudstory.com/2014/06/05/everymans-vp8/","cat":"image_theory","title":"Everyman’s VP8"},{"author":"clublu22014","post":"Like the blood, the Shroud came first before the Story (Stories) of the Man whose Image shocked and rocked that world into a world beyond the senses.  So whatever was written about the linen shroud in the tomb was not documented history and not “gospel” as we think of the word today  but “Story” and an announcement of the victory over death of a new conquering Lord.\n\n","date":"April 5, 2014 at 9:42 pm","url":"https://shroudstory.com/2014/04/05/image-on-the-outside-of-the-shroud/","cat":"image_theory","title":"Image on the Outside of the Shroud?"},{"author":"clublu22014","post":"Mike this is a most excellent insight!  Thank You!  \n(However I am having a bit of a quandary as to just exactly what the identification of the lumen is regarding the fibril of the linen… It seems obvious that it is the outside molecules of the fibril’s tubing not necessarily the inside.  Perhaps you could clarify this for me?)\n\n","date":"March 9, 2014 at 12:58 pm","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","title":"Scorching Onion Skins"},{"author":"clublu22014","post":"Mike M… You’re Magnificent!  This clears everything up for me so very well.  Imagine just a few coherent molecules on the outer surface of the linen fibril receiving the information!  Spectacular!  So I guess the debate is about whether or not soap wart is the culprit or the actual first cells of the linen are. Could be both in cahoots with Image formation?\n\n","date":"March 9, 2014 at 4:56 pm","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","title":"Scorching Onion Skins"},{"author":"clublu22014","post":"I’m with you, Mike!  Magnificent! Majestic! Mighty!\n\n","date":"March 9, 2014 at 11:18 pm","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","title":"Scorching Onion Skins"},{"author":"clublu22014","post":"But I don’t understand any heat hypothesis when Barrie Schwortz has stated over and over again that the Image doesn’t fluoresce that means it wasn’t heat induced.\n\n","date":"March 9, 2014 at 8:55 am","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","title":"Scorching Onion Skins"}],"misc":[{"author":"clublu22014","post":"Me too… we must be in the same light, Dave.\n\n","date":"November 29, 2014 at 11:31 am","url":"https://shroudstory.com/2014/11/29/a-warning-about-what-we-perceive/","cat":"science","title":"A warning about what we perceive"},{"author":"clublu22014","post":"Right on Dan!  Peter Berger was revered at Boston College when I was a student there in the 1970’s… I rather thought he might have petered out.  Nice to see he’s still going so strong and leading a charge for a Social Construction of Reality at age 85!\n\n","date":"May 5, 2014 at 12:28 am","url":"https://shroudstory.com/2014/05/04/everyone-goes-to-heaven/","cat":"news_&_views","title":"Everyone Goes to Heaven?"},{"author":"clublu22014","post":"Just tempted to quote Augustine, Confessions:  “Our hearts are restless”… (uncomfortable, diseased, in hell).. until they rest in Thee… Augustine believed in a Trinitarian God:  Holy Spirit-Son-Father…\n\n","date":"May 5, 2014 at 12:37 am","url":"https://shroudstory.com/2014/05/04/everyone-goes-to-heaven/","cat":"news_&_views","title":"Everyone Goes to Heaven?"},{"author":"clublu22014","post":"I agree wholeheartedly with Dan!  I never knew how to respond to such lack of love and care as the camp of Colin Berry shows.  I’m in favor of letting the Dan camp handling it.  I’m sure Barrie would never sue Colin for libel or slander.  Barrie has too much genuine love and care going for him!\n\n","date":"April 9, 2014 at 10:29 am","url":"https://shroudstory.com/2014/04/09/i-too-can-be-a-practitioner-of-peudocience/","cat":"news_&_views","title":"I, too, can be a practitioner of p$eudo$cience"},{"author":"clublu22014","post":"Irritatingly insane… starts in the dark… then pretends to throw some light on it with false C2 (info) then wraps it up with more insanity… And, how is the Shroud related to the JFK assassination in front of the book repository?  Did someone die for this insanity?\n\n","date":"May 24, 2014 at 4:55 pm","url":"https://shroudstory.com/2014/05/24/insanity-break-it-is-about-the-shroud-or-maybe-well-i-cant-be-sure/","cat":"tinfoil_hats","title":"Insanity Break:  It is about the shroud or maybe, well I can’t be sure"},{"author":"clublu22014","post":"Oh Dan, thank you sincerely for making the Shroud come alive for me all these 7 years.  What a marvelous person you are!  And, just as you will never truly “know” whether or not the Shroud is ‘authentic’ but believe it to be, so you will never really “know” the depth of goodness and grace, curiosity and intelligence, insight  and esteem, you have given to all those participating in your beautiful and enriching blog:  ShroudStory.com!\nI feel as if I am losing a ray from the Light of Christ in losing you now.  But I shall the rest of my days bask in the Light you have allowed to shine!\nAnnette Cloutier, a devoted fan\n\n","date":"December 15, 2015 at 9:37 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"author":"clublu22014","post":"But we know the TS Image was not made from sweat and blood, so why the supposition?\nWhy bring up the Besancon Shroud when there is no current comparison?\n\n","date":"November 27, 2014 at 8:30 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"}],"opinion":[{"author":"clublu22014","post":"Too funny!  Hopefully someday we can look back and laugh together!\n\n","date":"May 26, 2014 at 4:17 pm","url":"https://shroudstory.com/2014/05/26/here-is-a-too-long-one-minute-trailer/","cat":"other_blogs","title":"Here is a too long one minute trailer"},{"author":"clublu22014","post":"Does anyone know the opinions of Wright, Fitzmyer, Crossan, Borg, on the Shroud?\n\n","date":"July 29, 2014 at 10:16 pm","url":"https://shroudstory.com/2014/07/27/penn-tellers-hateful-bullshit/","cat":"other_blogs","title":"Penn & Teller’s Hateful Bullshit"},{"author":"clublu22014","post":"It’s a shame that ignorance rules in matters of faith.  It is even more shameful that in the pursuit of Truth, even more ignorance abounds.\n\n","date":"July 27, 2014 at 5:33 pm","url":"https://shroudstory.com/2014/07/27/penn-tellers-hateful-bullshit/","cat":"other_blogs","title":"Penn & Teller’s Hateful Bullshit"}],"researchers":[{"author":"clublu22014","post":"While Barrie took the photo… the Image was already created.  Barrie is not in the business of “creating images”.\n\n","date":"April 3, 2014 at 8:50 am","url":"https://shroudstory.com/2014/04/03/barrie-schwortz-so-why-is-a-good-jewish-boy-like-me-doing-this/","cat":"news_&_views","title":"Barrie Schwortz:  So why is a good Jewish boy like me doing this?"},{"author":"clublu22014","post":"Like!\n\n","date":"March 9, 2014 at 12:21 am","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"},{"author":"clublu22014","post":"Like!\n\n","date":"March 8, 2014 at 8:40 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"}],"resources":[{"author":"clublu22014","post":"Shouldn’t Wikipedia be informed?\n\n","date":"October 24, 2014 at 2:08 am","url":"https://shroudstory.com/2014/10/23/430-wikipedia-articles-mention-the-shroud-of-turin/","cat":"article","title":"430 Wikipedia Articles Mention the Shroud of Turin"},{"author":"clublu22014","post":"How can anyone of gnosis respect DR’s drivel?\n\n","date":"April 9, 2014 at 11:29 am","url":"https://shroudstory.com/2014/04/08/lawrence-e-schauf-for-the-prosecution-the-trial-of-the-shroud/","cat":"article","title":"Lawrence E. Schauf for the Prosecution: The Trial of the Shroud"},{"author":"clublu22014","post":"More drivel.\n\n","date":"April 9, 2014 at 12:30 pm","url":"https://shroudstory.com/2014/04/08/lawrence-e-schauf-for-the-prosecution-the-trial-of-the-shroud/","cat":"article","title":"Lawrence E. Schauf for the Prosecution: The Trial of the Shroud"},{"author":"clublu22014","post":"Excellent Dave!\n\n","date":"April 9, 2014 at 7:58 pm","url":"https://shroudstory.com/2014/04/08/lawrence-e-schauf-for-the-prosecution-the-trial-of-the-shroud/","cat":"article","title":"Lawrence E. Schauf for the Prosecution: The Trial of the Shroud"},{"author":"clublu22014","post":"Hi Dan.  Guess you agree entirely with Hugh?  Why would you call these statements made by King Umberto… a quoting Tomfoolery?  It seems to me that there is some legitimate authority behind the quotes.  Hope I’m not off-base in assuming so.\n\n","date":"May 22, 2014 at 8:46 am","url":"https://shroudstory.com/2014/05/22/more-tomfoolery-the-carbon-dating-results-are-worthless/","cat":"books","title":"More Tomfoolery: The carbon dating results are worthless"},{"author":"clublu22014","post":"Thanks for the heads-up on Dihydrogen Monoxide, Hugh.  I’ll be on guard.  I guess Water & Spirit are no longer Divine!\n\n","date":"May 23, 2014 at 8:28 pm","url":"https://shroudstory.com/2014/05/22/more-tomfoolery-the-carbon-dating-results-are-worthless/","cat":"books","title":"More Tomfoolery: The carbon dating results are worthless"},{"author":"clublu22014","post":"God Almighty, more free radical rationalization on the Shroud!\n\n","date":"May 23, 2014 at 8:04 am","url":"https://shroudstory.com/2014/05/22/more-tomfoolery-the-carbon-dating-results-are-worthless/","cat":"books","title":"More Tomfoolery: The carbon dating results are worthless"},{"author":"clublu22014","post":"This was in response to PHPL’s hand-genitalia observation not to DaveB’s nor to Thomas’ and thank God for Charles’ in depth observation!  So sorry for my knee-jerk response to PHPL.  As to Thomas’ querry, I think the Gospels hagiographers were perhaps instructed not to make any mention of the Shroud lest it become confiscated by religious authorities claiming it to be a “craven image”.\n\n","date":"May 23, 2014 at 8:12 am","url":"https://shroudstory.com/2014/05/22/more-tomfoolery-the-carbon-dating-results-are-worthless/","cat":"books","title":"More Tomfoolery: The carbon dating results are worthless"},{"author":"clublu22014","post":"You were clear, Dan… I just needed to make sure.  Thanks so much for all the clarity you provide!\n\n","date":"May 22, 2014 at 10:24 am","url":"https://shroudstory.com/2014/05/22/more-tomfoolery-the-carbon-dating-results-are-worthless/","cat":"books","title":"More Tomfoolery: The carbon dating results are worthless"},{"author":"clublu22014","post":"Hugh, you seem to have a question with authoritative and expert findings.  In particular here, are you also questioning the validity of Madame Mechthild Flury-Lemberg’s finding that the side seam of the Shroud was stitching used only by the 1st century Jews of Masada? To me your “scientific” approach to the Shroud is like asking: “Are you sure water is made from H20?”\n\n","date":"May 22, 2014 at 12:31 pm","url":"https://shroudstory.com/2014/05/22/more-tomfoolery-the-carbon-dating-results-are-worthless/","cat":"books","title":"More Tomfoolery: The carbon dating results are worthless"},{"author":"clublu22014","post":"Hugh, what insight have you gleaned on the “the chemical basis of the colours of the quad mosaics” that are irrefutable to your conclusion?\n\n","date":"May 26, 2014 at 1:23 pm","url":"https://shroudstory.com/2014/05/22/more-tomfoolery-the-carbon-dating-results-are-worthless/","cat":"books","title":"More Tomfoolery: The carbon dating results are worthless"},{"author":"clublu22014","post":"Hugh, thank you so much for your pdf file on shroud.com, very informative.  However, in a French-reweave/invisible mending the skill is such not only to fool the naked eye but to incorporate the main body of the garment. So the areas patch with a French reweave would have been more than a simple patchwork area.  Also, you mention that the dark greenish area chosen (incidentally chosen for the C14 testing) were not a designation of an contaminated and inconsistent chemical area of the Shroud but rather of a light effect:  “The colour is fairly obviously much more to do with the light source than it has to do with the material of the Shroud.”  Wow!  Really, Hugh?  Did you fact-check that with Barrie?\n\n","date":"May 26, 2014 at 2:23 pm","url":"https://shroudstory.com/2014/05/22/more-tomfoolery-the-carbon-dating-results-are-worthless/","cat":"books","title":"More Tomfoolery: The carbon dating results are worthless"},{"author":"clublu22014","post":"But his point of view, Louis, deserves respect and some honest review… not to simply brush it off as “garbage”.\n\n","date":"May 30, 2014 at 5:32 pm","url":"https://shroudstory.com/2014/05/21/new-book-the-shroud-of-turin-and-the-origins-of-christianity/","cat":"books","title":"New Book:  The Shroud of Turin and the Origins of Christianity"},{"author":"clublu22014","post":"Who really can fathom the occult practices of any of the ancient mystery religions, except to say that they had some very strange and perverse practices.\n\n","date":"May 30, 2014 at 8:26 pm","url":"https://shroudstory.com/2014/05/21/new-book-the-shroud-of-turin-and-the-origins-of-christianity/","cat":"books","title":"New Book:  The Shroud of Turin and the Origins of Christianity"},{"author":"clublu22014","post":"Beautiful Dave.\n\n","date":"May 31, 2014 at 6:47 am","url":"https://shroudstory.com/2014/05/21/new-book-the-shroud-of-turin-and-the-origins-of-christianity/","cat":"books","title":"New Book:  The Shroud of Turin and the Origins of Christianity"},{"author":"clublu22014","post":"John Winslow Gibson is researched and brilliant!  He offers a distinct possibility of the Shroud’s Image being formed by an occult group from one of the many mystery religions thriving and competing for supremacy in first century Judaism.  Human engineering did something rash by forming a Jewish Messiah from that which had heretofore been formless esoteric information from Scripture.  His book is not “garbage”, but plausible thought.\n\n","date":"May 30, 2014 at 8:01 am","url":"https://shroudstory.com/2014/05/21/new-book-the-shroud-of-turin-and-the-origins-of-christianity/","cat":"books","title":"New Book:  The Shroud of Turin and the Origins of Christianity"},{"author":"clublu22014","post":"All this so-called “holiness” you refer to, Mike, is deep within human nature, and also elucidated by Scripture, wither it be the Talmud, NT, Qu’ran, Upanishads, Mahayana texts, but something here with the Shroud sparks a bridge between supernatural/mythical heroes  and the idea of the holy in the captured in 3-D.  Gibson:  “All in all, we have a quandary. How can we receive from the Shroud of Turin a Jesus who must have died and from the Bible a Jesus who could not have lived?”\n\n","date":"May 30, 2014 at 10:30 am","url":"https://shroudstory.com/2014/05/21/new-book-the-shroud-of-turin-and-the-origins-of-christianity/","cat":"books","title":"New Book:  The Shroud of Turin and the Origins of Christianity"},{"author":"clublu22014","post":"Hi Louis, are we not on the same page/book here… the above:  John Winslow Gibson, author of The Shroud of Turin and the Origins of Christianity,  (typo above/delete second in; in 3-D… just captured in 3-D.\n\n","date":"May 30, 2014 at 1:12 pm","url":"https://shroudstory.com/2014/05/21/new-book-the-shroud-of-turin-and-the-origins-of-christianity/","cat":"books","title":"New Book:  The Shroud of Turin and the Origins of Christianity"},{"author":"clublu22014","post":"Oh, Louis, this is so not true!  People can be out of the loop of academic “Biblical scholarship” and be in the right stream of exegesis.  Many of todays biblical scholars are just putting out more slop about Jesus and Mary Magdalene to appease their classroom attendance and book publication.  I prefer a person who has no attachments to an agenda other than spending time to objectively speak truth to power.  However, I appreciate your concern for my elucidation.\n\n","date":"May 30, 2014 at 2:08 pm","url":"https://shroudstory.com/2014/05/21/new-book-the-shroud-of-turin-and-the-origins-of-christianity/","cat":"books","title":"New Book:  The Shroud of Turin and the Origins of Christianity"},{"author":"clublu22014","post":"Hi Louis,\nSorry I’m so tardy with my response to your always thorough and in depth replies. I was with relatives from abroad most of this past Saturday and Sunday.\nI’m wishing that perhaps I may have the opportunity of meeting you in person one day and we can discuss the Jesus Family Tomb with the Shroud Connection and the origin of the Gospel of Mark (first Gospel).   Perhaps, too, add a new insight to NT studies that would do the Harvard Divinity Charles Chauncey Stillman Professor of Roman Catholic Studies and first Catholic Dean of HDS, The Reverend Professor George Windsor MacRae, S.J. proud.  Are you perhaps a Jesuit yourself?  Will you be attending the St. Louis Shroud Convention in October?  Louis should be in St. Louis at that most appropriate time don’t you think?  Perhaps we could meet for a more thorough discussion then and there?\n\n","date":"May 4, 2014 at 11:15 pm","url":"https://shroudstory.com/2014/05/03/new-fictional-book-blood-doctrine/","cat":"books","title":"New Fictional Book: Blood Doctrine"},{"author":"clublu22014","post":"So Louis, where are you now?  How can I email you?  I’m not too sure about blogging on Dan’s blog about my gnawing insights over many years of study into the origins of the canonical Gospels, (Mark in particular), even though these insights emanate from the Shroud itself.  But suffice it to say, I am very grateful for your own insights even though they appear to be in opposition to my own.  And, I might add, I am sure you have many  in your camp.  I’d be lucky to find one scholar in mine.\n\n","date":"May 4, 2014 at 11:53 pm","url":"https://shroudstory.com/2014/05/03/new-fictional-book-blood-doctrine/","cat":"books","title":"New Fictional Book: Blood Doctrine"},{"author":"clublu22014","post":"Selfishness while right on the mark (money) seems more like a “60’s” term.  In today’s lingo, John, it is more commonly expressed as Duality vs. Non-Duality of Spirit.  Quantum Christ like the Christ of Scripture should possibly emphasize John 17:21):  That that all may be One, Father, as I in Thee and Thou in Me.”  No room for duality there unless one wants to remain outside the Bun.\n\n","date":"April 5, 2014 at 10:05 pm","url":"https://shroudstory.com/2014/04/05/the-extinction-of-humanity/","cat":"books","title":"The Extinction of Humanity?"},{"author":"clublu22014","post":"I’m in the same camp you’re in Yannick… with one exception, I hope I never get physically beaten to a pulp, crucified, or leave a shroud behind to have to prove this!\n\n","date":"March 28, 2014 at 7:42 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"author":"clublu22014","post":"Really!\n\n","date":"March 28, 2014 at 7:44 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"author":"clublu22014","post":"O.O.\n\n","date":"March 29, 2014 at 7:56 am","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"author":"clublu22014","post":"Right, I was rather bemused at Barrie’s frankness about this on air.\n\n","date":"March 28, 2014 at 7:40 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"}]}
