{"art":[{"author":"co","post":"¡Impresionante fotografía!\n\n","date":"March 11, 2012 at 8:32 am","url":"https://shroudstory.com/2012/03/11/amazing-technology-and-ecumenical-developments/","cat":"art","title":"Amazing Technology and Ecumenical Developments"},{"author":"co","post":"Dan, ese solidus NO es del año 652 en que el emperador de Bizancio era Constante II.\nEl solidus es de Justiniano II, que fue emperador dos veces, entre el 685-695 y entre el 705-711.\nProbablemente (“lapsus mentis”) habeis querido poner el año 692.\n\n","date":"February 7, 2012 at 11:44 am","url":"https://shroudstory.com/2012/02/06/another-justinian-this-one-circa-652/","cat":"art","title":"Another Justinian, this one circa 652"},{"author":"co","post":"¡Deberíais prestar más atención a los los linkas de los comentarios! ¡Ja, Ja!\nEscribí:\nFebruary 3, 2012 at 6:18 pm | #4 Reply | Quote\n“Una mejor imagen de un solidus de Justiniano II, este de la colección del “Deutsche Bundesbank”\nhttp://www.moneymuseum.com/imgs/xcoins/image/2009/7/I_O_3847_2.jpg “\n\n","date":"February 6, 2012 at 7:39 pm","url":"https://shroudstory.com/2012/02/06/another-justinian-this-one-circa-652/","cat":"art","title":"Another Justinian, this one circa 652"},{"author":"co","post":"Disculpame Dan, prestaste buena atención, creí que la imagen procedía del amigo Klotz….\n\n","date":"February 6, 2012 at 7:45 pm","url":"https://shroudstory.com/2012/02/06/another-justinian-this-one-circa-652/","cat":"art","title":"Another Justinian, this one circa 652"},{"author":"co","post":"“Early 13th century”.\nEs decir entre los años 1200- 1250.\n\n","date":"December 11, 2011 at 2:26 pm","url":"https://shroudstory.com/2011/12/11/more-on-great-armenian-art-and-possible-shroud-of-turin-connections/","cat":"art","title":"More on Great Armenian Art and Possible Shroud of Turin Connections"},{"author":"co","post":"En 1979 el doctor Gilbert R.Lavoie se puso en contacto con la Universidad de Harvard, solicitando que le indicaran el nombre de un profesor que fuera especialista en iconografía antigua.\nLe dieron el nombre del Dr. Ernst Kitzinger. ¿Quién era este especialista?\nErnst Kitzinger, judío-alemán nacido en Munich en 1912, uno de los grandes historiadores del arte , especializado en arte antiguo, medieval y bizantino, perteneció al pequeño grupo prodigiosamente dotado de Historiadores del Arte alemanes, que incluyó a Richard Krautheimer, Erwin Panofsky y Kurt Witzmann, y que desarrollaron la mayor parte de su actividad en los Estados Unidos.\nDurante su paso por la Universidad de Harvard dirigió los doctorados de varios de sus estudiantes que como Christine Kondoleon, Irving Lavin, Henry Maguire, Lawrence Nees y Willian Tronzo, serían a su vez muy importantes historiadores del arte.\nEl lector interesado puede encontrar la referencia bibliográfica de su importante obra y su biografía el el “Dictionary of Art Historians”, Diccionario de Historiadores del Arte asociado a la Universidad de Duke\nhttp://www.dictionaryofarthistorians.org/kitzingere.htm\nLavoie tuvo suerte, pues pudo encontrarse con Kitzinger justo antes de que éste partiera para Inglaterra, en la que planeaba vivir su retiro.\nLa consulta de Lavoie, que estaba trabajando sobre las marcas de sangre, fue:\n-¿Puede usted mostrarme trabajos de artistas que hayan pintado marcas de sangre como las que usted ve en la Sábana Santa de Turín?.\nY esta fue la contestación de Ernst Kitzinger:\n“La Sábana Santa de Turín es única en el arte. No entra en ninguna categoría artística.\nPara nosotros, un grupo muy pequeño de expertos en todo el mundo, creemos que la Sábana Santa de Turín es realmente la Sábana Santa de Constantinopla. Ustedes saben que los cruzados tomaron muchos tesoros de regreso a Europa durante el siglo XIII y creemos que la Sábana Santa es uno de ellos.\nEn cuanto a las marcas de sangre hechas por los artistas, no hay cuadros que tengan marcas de sangre como los de la Sábana Santa. Usted es libre de buscar…..pero no los encontrará”.\n\n","date":"December 27, 2011 at 8:28 am","url":"https://shroudstory.com/2011/12/27/waldemar-januszczak-doesnt-think-the-shroud-of-turin-is-real-but/","cat":"art","title":"Waldemar Januszczak doesn’t think the Shroud of Turin is real, BUT . . . (Updated)"}],"blood":[{"author":"co","post":"¡MAGNÍFICO comentario de Kelly!\n\n","date":"February 16, 2012 at 6:18 am","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"}],"dating":[{"author":"co","post":"Zurich sample, Z1-Z1.1 Z1.2\nhttp://archiv.ethlife.ethz.ch/e/articles/sciencelife/turin.html\n\n","date":"January 7, 2011 at 10:37 pm","url":"https://shroudstory.com/2011/01/06/is-this-the-other-side-of-the-same-fragment/","cat":"carbon_14_dating","title":"Is this the other side of the same fragment?"},{"author":"co","post":"Domenico:\nProf. Donahue a Fr.Bonnet-Eymard, en carta de 5 Diciembre 1989.\nhttp://lasabanaylosescepticos.blogspot.com/2006/01/de-arizona-casi-mejor-no-hablar.html\n\n","date":"January 10, 2011 at 6:17 am","url":"https://shroudstory.com/2011/01/06/is-this-the-other-side-of-the-same-fragment/","cat":"carbon_14_dating","title":"Is this the other side of the same fragment?"},{"author":"co","post":"Reverse and anverse Zurich\nhttp://lasabanaylosescepticos.blogspot.com/2006/01/zurich-1988-buscad-y-encontrareis.html\n\n","date":"January 7, 2011 at 11:09 pm","url":"https://shroudstory.com/2011/01/05/was-the-sample-used-in-the-jull-paper-not-from-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Was the sample used in the Jull paper NOT from the Shroud of Turin?"}],"history":[{"author":"co","post":"Una mejor imagen de un solidus de Justiniano II, este de la colección del “Deutsche Bundesbank”","date":"February 3, 2012 at 6:18 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","title":"Ben Wiech’s video about the Justinian coin from AD 692"},{"author":"co","post":"Anatomical correctness:\n-Accetta A. Nuclear Medicine and its relevance to the Shroud of Turin.\n-Baima Bollone.P. The Shroud under the microscope: Forensic examination\n-Ball DA. The crucifixion and death of man called Jesus.\n-Barbet P. La Passion de Jésus-Christ selon le chirurgien.\n-Belcet F, Filippa-Borrono-Bona, Manfredi, Mattio. Riflessioni del chirurgo sull ferita toracica.\n-Bucklin R. An autopsy on the Man of the Shroud.\n-Brillante C. La fibrinolisi nella genesi delle impronte sindoniche.\n-Davis CT. The crucifixion of Jesus: the passion of Christ from a medical point of view.\n-Delfín Villaláin J. Estudio de la rigidez cadavérica que presenta la Sábana de Turín.\n-Canale M. Rilievi e considerazione sul DNA presente sulla Sindone.\n-Caminals A. Estudio de la crucifixion según la Sábana Santa.\n-Cappi M. La Sindone dalla A alla Z.\n-Cinquemani N, Cicchetti S. Le dopple immagini sulle mani dell´Uomo della Sindone.\n-Coppini L. Le lesione da punta ed il colpo di lancia visibili sulla Sindone. Rilievi di anatomia topografica e radiologica.\n-Dellesite G. Cause fisiche della morte della Sindone: medicina e certezze.\n-Domínguez J J. La Síndone. Estudio médico.\n-Edwards WD. On the physical cause of death of Jesus.\n-Fiori R. La lesioni da inchiodamento ai piedi dell´Uomo della Sindone.\n-García Blazquez M. La búsqueda científica de Dios.\n-Garza-Valdes L. Wood remnants in the blood of the occipital region of the Man on the Shroud of Turin.\n-Gilly R. La Pasión de Jesús. Conclusiones de un médico.\n-Giraud F. Le Saint Suaire, étude medicale et scientifique.\n-Goldoni. Estudio hematológico sobre las muestras del Sudario tomadas en 1978.\n-Guillaud Vallee O. Position en opposition du ponce chez l´homme du linceoul étude critique des travaux de Barbet.\n-H. Ur Rerhman. Did Jesus Christ die of pulmonary embolism? a rebuttal.\n-Hynek R W. Lo que revela el Sudario a un convertido.\n-Huisman H. The Holy Shroud of Turin. Injury of the right eye.\n-Judica Cordiglia G. L´Uomo della Sindone e il Gesu dei Vangeli?\n-Larato G. L´ignominiosa flagellazione secondo la Síndone: rilievi di fisiopatologia clinica.\n-LeBec A. The death of the cross: a physiological study of the passion of Our Lord Jesus Christ.\n-Legrand A. Du Gibet du Golgotha a ceux de Dachau.\n-Lavoie G. Forensic studies of the blood marks on the Shroud of Turin.\n-Lévêque J. Le Saint Suaire revisité.\n-Lorente J A. Examen forense al cuerpo de Jesús.\n-Mérat P. The nailing of the feet on the Cross.\n-Milanesio A. Le lesioni da inchiodamento agli arti dell´Uomo della Sindone.\n-Novelli G. La Síndone un caso ancora aperto.\n-Palacios Carvajal J. La Sábana Santa.Estudio de un cirujano.\n-Puorrat O. The localization of the chest wound on the right side.\n-Revidatti D. Anatomía de la Crucifixión. Las manos.\n-Rodante S. Medico-necroscopic enquiry of wounds from the crowning with thorns on a medieval painting. Comparison with corresponding image on the Shroud.\n-Rubén Darío Camargo R. Fisiopatología de la muerte de Jesucristo.\n-Thibault Heimburger, Le Suaire et la Science.\n-Signorini R. Alla ricerca della prova provata.\n-Suárez Lledó Alemany J. Informe médico legal sobre el Sudario de Oviedo y la Síndone de Turín.\n-Solas J. Blood stains on the Shroud.Distinctive characteristics. The problem of their transfer.\n-Truman D. The crucifixión of Jesús. The passion of Chris from a medical point of view.\n-Whanger A. Radiological aspects of the Shroud of Turin.\n-Wilkinson J. The physical cause of the death of Christ.\n– Barragán Jain, Caselli, Cameron, Clerq J M, De Vicentiis, Delgado Roig, Gambescia J, Igartus, Jewell H J, La Cava, Lagraña R, Liébana J, López Gómez L, Marchand, Michel W, Morano H, Novelli, Notowski, Pugeaut R, Sáez Rodriguez, Sava Anthony , Stroud Willian, Terraes A, Tarantini D, Valdés, Wasenar R, Willis D .\nRepresentan tan sólo la “punta del iceberg”, pues son un sinfín los médicos profesionalmente muy bien acreditados,entre los que me cuento, los que hemos reconocido en la figura del Hombre de la Sábana, cruelmente martirizado, todas las características propias de un ser humano que la Sábana envolvió, Jesús de Nazaret.\nhttp://lasabanaylosescepticos.blogspot.com/2010/11/los-medicos-y-la-sabana.html\nDr.C.Otal Vazquez\n\n","date":"February 1, 2011 at 6:47 pm","url":"https://shroudstory.com/2011/02/01/more-on-antonio-lombattis-latest-paper/","cat":"history","title":"More on Antonio Lombatti’s Latest Paper"},{"author":"co","post":"El asunto de la supuesta carta de Pierre D´Arcis ( no lleva firma, no lleva fecha y no lleva sello) que el canónigo Chevalier quiso datar en 1389, se soluciona con una simple RESTA o SUBSTRACCIÓN.\nEscribe D´Arcis ( Paris, Bibliothèque Nationale. Collection de Champagne, v 154, fol 137) una carta en LATIN con el siguiente encabezamiento que NO se figura en la traducción inglesa de Herbert Thurston, razón por la que utilizo la traducción francesa:\n“Verité sur le linge de Lirey qui, après avoir été longtemps exposé à une époque antérieure, vient de l´être derechef, au sujet duquel j´entends écrire á notre seigneur Pape dans les termes qui suivent et aussi brièvement que possible”.\nY después:\n“ ….loin de se limiter au royaume de France, cela fut répandu pour ainsi dire dans le monde entier, tellement que, de tous les points de l’univers, les peuples affluaient en masse. Pour séduire ces multitudes et leur extorquer leur or par astuce, on forgeait là des miracles en faisant mentir certains individus payés à cet effet: ils feignaient d’avoir été guéris lors d’une ostension dudit suaire, que la croyance universelle attribuait au Seigneur.”\nY después:\n“Ceux-là, quand ils virent leur ruse percée à jour, firent disparaître et recelèrent ledit linge pour qu’il échappât aux investigations de l’ordinaire; depuis, ils ne l’ont plus sorti de sa cachette pendant trente-quatre ans, ou à peu près, jusqu’à cette année.”\n-La iglesia de Lirey se fundó en 1353.\n-El culto en Lirey fue aprobado por el obispo Henri de Poitiers el 28 de mayo de 1356.\n– Si hacemos la resta 1389 – 34 = 1355\n¡Cómo podía en el año 1355 haber sido expuesta la Sábana durante mucho tiempo, no limitar su fama al reino de Francia sino al mundo entero (Europa estaba con muchas guerras) y además con afluencia de multitudes……\nLas fechas NO COINCIDEN con lo que la carta pretende.\nPuede verse el documento en Latín a buena resolución y sus traducciones al francés y al  inglés en mi blog:\nhttp://lasabanaylosescepticos.blogspot.com/2006/02/traduccin-latn-francs-del-memorandum.html\nhttp://lasabanaylosescepticos.blogspot.com/2006/02/traduccin-latin-ingls-del-memorandum.html\n\n","date":"January 26, 2012 at 4:42 pm","url":"https://shroudstory.com/2012/01/26/promoted-comment-on-correcting-joe-nickell/","cat":"history","title":"Promoted Comment on Correcting Joe Nickell"}],"image":[{"author":"co","post":"“In addition, a well known optics law tells us the penetration depth of the interaction between radiation and medulla cannot be smaller than the wavelength, that is, not smaller than 6 micrometers in this case. This fact alone explain why infrared radiation cannot produce a superficial coloration of fibers.”\n\n","date":"February 21, 2012 at 5:42 pm","url":"https://shroudstory.com/2012/02/21/colin-berrys-idea-is-untenable-and-heat-cannot-produce-a-superficial-coloration/","cat":"image_theory","title":"Colin Berry’s idea is untenable, and heat cannot produce a superficial coloration"},{"author":"co","post":"Colin nos ha mostrado en su blog:\n1.- Que la quemadura realizada con la máscara de metal sobre el lino NO tiene ningún parecido con la máscara de metal que la produce.\n2.- Que la imagen 3D de la quemadura tiene todavía MENOS PARECIDO con la máscara de metal y está HORRIBLEMENTE distorsionada.\n3.- Que ello EVIDENCIA que esa técnica NO funciona.\n4.- PESE a ello insiste en contarnos “una película de romanos”, pues todos conocemos que los metales calientes chamuscan las telas……\n5.- Ya que MACROSCÓPICAMENTE su experimento NO funciona, podía al menos mostrarnos el aspecto MICROSCÓPICO de la quemadura …….\n6.- ¿Y dice Colin que las experiencias de Di Lazzaro son ciencia Mickey Mouse?\n\n","date":"February 19, 2012 at 7:38 pm","url":"https://shroudstory.com/2012/02/19/i-dont-get-it-writes-a-reader-about-colin-berrys-hypothesis/","cat":"image_theory","title":"I don’t get it, writes a reader about Colin Berry’s Hypothesis"},{"author":"co","post":"Bla, bla, bla…….\nEstimado Colin, la distorsión de Mercator NO puede eludirse en ninguna imagen de contacto.\nLo han demostrado los intentos FALLIDOS de Broch, de Blanrue, de Nickell, y eso que era tan SOLO sobre el rostro…… sobre el cuerpo completo la distorsión habría sido HORRIBLE.\nEl propio Garlaschelli, que utilizó un modelo humano, tuvo que terminar “quemando a mano” con una mezcla de azul de cobalto y ácido SULFURICO , a modo de pintura, para evitar las DISTORSIONES. \nNo mezcle usted “la velocidad con el tocino”.\nUtilice una máscara de ROSTRO HUMANO NORMAL y enséñenos unos resultados que superen las distorsiones.\nEn tanto no muestre eso, hace usted ciencia-ficción……..\n\n","date":"February 19, 2012 at 8:34 pm","url":"https://shroudstory.com/2012/02/19/i-dont-get-it-writes-a-reader-about-colin-berrys-hypothesis/","cat":"image_theory","title":"I don’t get it, writes a reader about Colin Berry’s Hypothesis"},{"author":"co","post":"La formación de las manchas de sangre es un proceso DINÁMICO en el tiempo.\n La evolución en el tiempo del coágulo sanguíneo hasta su completa lisis tiene una CRONOFISIOLOGÍA.\nLas manchas de sangre de la Sábana de Turín NO son observables en la práctica médica, porque precisarían en un DETERMINADO MOMENTO de su génesis de la desaparición, DESMATERIALIZACIÓN, del cuerpo que las generó.\nNO son reproducibles, ni siquiera en el Laboratorio.\nLas características observables de las manchas de sangre de la Sábana SI demuestran la desaparición o desmaterialización del CUERPO envuelto en la Sábana, la  RESURRECCIÓN de Jesús de Nazaret.\nhttp://lasabanaylosescepticos.blogspot.com/2011/03/pero-entonces-amigo-miojesucristo-ha.html\nCarlos Otal.\n\n","date":"October 31, 2011 at 1:16 am","url":"https://shroudstory.com/2011/10/28/paper-chase-sight-and-brain-and-shroud-of-turin-images/","cat":"image_theory","title":"Paper Chase: Sight and Brain and Shroud of Turin Images"},{"author":"co","post":"Es difícil saber lo que se entiende por “judíos piadosos” (pious Jews) \n¿Los que COMÍAN con publicanos y pecadores? Marcos 2.13-17. Mt  9.9-13. Lc 5.27-32\n¿Los que NO ayunaban?. Marcos 2.18-22. Mateo 9.4-17. Lc 5.33-39\n¿Los que ROMPÍAN el reposo del sábado?. Marcos 2.23-28. Mt. 12.1-8. Lc. 6.1-5.\nSon leptones las monedas que echa la viuda del Evangelio de Marcos (Mc 12, 38-44) en el arca del Tesoro del Templo, 2 monedas (leptones) que sumaban 1/4 de as.\nEl lepton valía 1/8 de as.\n¿Qué monedas NO PAGANAS echarían los RICOS en el arca del Tesoro?\nCarlos Otal\n\n","date":"November 2, 2011 at 12:02 am","url":"https://shroudstory.com/2011/10/28/paper-chase-sight-and-brain-and-shroud-of-turin-images/","cat":"image_theory","title":"Paper Chase: Sight and Brain and Shroud of Turin Images"},{"author":"co","post":"Si el rito hubiera sido pagano se habría realizado de manera CORRECTA.\nEl pago a Caronte para cruzar el río Aqueronte (para Virgilio la laguna Estigia) estaba establecido en 1 a 3 obolos, según la condición social del difunto.\nEl obolo venía a valer unos 16 leptones, así que Caronte habría considerado un INSULTO el pretendido pago de 2 leptones y habría retenido durante 100 años al difunto hasta pasarlo gratis (eso hacía Caronte con los que no pagaban).\nNo quiero decir con ello si existen o no existen monedas en los ojos, sino que el argumento de que era una ceremonia pagana NO es válido.\nNo debemos REINVENTAR el Evangelio. Los discípulos de Cristo no se caracterizaban por la observancia estricta de la Ley: no ayunaban, no guardaban el reposo del sábado, se relacionaban con recaudadores de impuestos y pecadores, etc, etc.\nNO eran judíos piadosos a los ojos de fariseos y otros grupos  observadores estrictos de la Ley.\nCarlos Otal\n\n","date":"November 10, 2011 at 7:36 am","url":"https://shroudstory.com/2011/10/28/paper-chase-sight-and-brain-and-shroud-of-turin-images/","cat":"image_theory","title":"Paper Chase: Sight and Brain and Shroud of Turin Images"},{"author":"co","post":"Aunque Barry no lo tenga recogido en su web (creo), Giulio Fanti respondió a la hipótesis de difusion gaseosa de Rogers:\nhttp://www.dim.unipd.it/fanti/diffusion.pdf\n\n","date":"November 22, 2011 at 9:08 pm","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin"},{"author":"co","post":"Y la ausencia de signos de difusión gaseosa (5.7a No signs of gas exhalation on face image) se reiteraba en:\n“The death of the Shroud Man: an improved review” 2008\nhttp://ohioshroudconference.com/papers/p07.pdf\nEs de hacer notar que uno de los coautores, Delfín Villalaín, es catedrático de Medicina Forense.\n\n","date":"November 22, 2011 at 9:38 pm","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin"},{"author":"co","post":"Desde 1900 han sido muchos los intentos de obtener imágenes por CONTACTO remedando las posibles condiciones del enterramiento.\nVignon, Colson y Delage, Judica Cordiglia, Romanese, Rodante, utilizaron diversas combinaciones, vapores de amoniaco, aloe, mirra, sudor y sangre, otras especies aromáticas que pudieran haberse utilizado ( dalla y rhusumah), diversos grados de humedad,etc, etc.\nTODAS resultaron un FRACASO al no poder eludir graves y grotescas deformaciones que son INHERENTES al CONTACTO, muy lejos de la calidad FOTOGRÁFICA de la imagen que presenta la Sábana de Turin.\n[fracaso que no han mejorado las pretendidas con pigmentos colorantes por Nickel, Broch, Blanrue o Garlaschelli]\nRogers, junto a Arnoldi, escribía en 2002: “The chemistry of the color does not answer all questions about how the “photographic” image formed”.\nLas imágenes de contacto no pueden eludir la deformación de Mercator.\n\n","date":"November 23, 2011 at 12:27 pm","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin"},{"author":"co","post":"Rigor mortis y produccion de aminas cadavéricas ( cadaverina , putrescina etc) son INCOMPATIBLES.\nSólo cuando desaparece el rigor mortis se inicia el proceso de descomposición.\n\n","date":"November 20, 2011 at 7:42 pm","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin"},{"author":"co","post":"……Y sin DESCOMPOSICIÓN NO HAY REACCIÓN DE MAILLARD.\n\n","date":"November 20, 2011 at 7:44 pm","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin"},{"author":"co","post":"Comenté hace días que las elevadas cifras de ácido láctico que se mantienen mientras dura el rigor mortis impiden la proliferación de las bacterias responsables de las primeras fases de la putrefacción.\nLa teoría de los vapores de amoniaco a partir de la UREA contenida en las diversas secreciones, sudor, sangre de las heridas, etc, etc, fue la PRIMERA estudiada durante años por Paul Vignon (biólogo), desde el 1900:\n“Thus M.Vignon´s idea, to which I completely subscribe, is that the body…..was covered with a febrile sweat rich in urea; that the urea formed ammonium carbonate which, in a calm atmosphere, emited vapours more and more diluted as they were farther from the emitting surface;that the shroud was soaked in a emulsion of aloes which became brown under the influence of these alkaline vapours and formed a tint the more intense the nearer this surface; whence the negative image whose characteristics I described before”. Delage 1902.\nPaul Vignon realizó muchos experimentos bajo muy diversas condiciones, las improntas de la imagen tenían graves deformaciones y no habrían resistido el estudio microscópico moderno.\nYa entonces fue rechazada la teoría AMONIACAL por varios especialistas, en base a que los fermentos orgánicos en la superficie del cuerpo serían INSUFICIENTES para transformar la UREA, entre ellos Dezani, profesor de Farmacología de la Universidad de Turín. La presencia de aloe añadiría más obstáculos a la fermentación de la urea.\nOtros muchos han experimentado a lo largo del siglo con muy diversas combinaciones, Judica-Cordiglia, Rodante, Caruso, etc. pero los resultados son similares, graves deformaciones macroscópicas y ninguna semejanza microscópica…… \nAunque se hubiera utilizado en todas esas experiencias lino tratado con Saponaria, los resultados macroscópicos hubieran sido similares.\nRespecto de los microscópicos el propio Rogers admite:\n “However, identification of a probable chemical process does not explain one of the most perplexing observations on the Shroud, the discontinuous distribution of the color on the topmost parts of the weave.”\nSi a ello se añade el que la imagen de la Sábana NO presenta signos de esa difusión gaseosa, sería necesaria una DIFUSION GASEOSA SOBRENATURAL para formar la imagen de la Sábana.\n¿Dónde queda pues el mecanismo NATURAL mantenido por Rogers?\nNo pudiendo explicar la formación de la IMAGEN ni Rogers ni Di Lazzaro, veamos lo que precisan las teorías de ambos para justificar el COLOR:\nRogers :     REACCIÓN DE MAILLARD+CAPA DE IMPUREZAS (residuos de Saponaria) + PUTREFACCIÓN JESÚS \nDi Lazzaro:  RADIACIÓN ULTRAVIOLETA\n…….así que por aquello de seguir la “navaja de Occam” prefiero a Di Lazzaro.\n[Desde el punto de vista teológico la Iglesia Católica NO admitiría la PUTREFACCIÓN del cuerpo de Jesús. Las palabras del Salmo: “…..ni permitirás que tu Santo vea la corrupción” SE HACEN HISTÓRICAS en el discurso de Pedro que es TESTIGO de Jesús resucitado, Hechos: 2, 31-32.]\nFeliz Navidad\n\n","date":"December 24, 2011 at 7:40 pm","url":"https://shroudstory.com/2011/12/23/surprising-live-poll-on-the-shroud-of-turin/","cat":"image_theory","title":"Surprising Live Poll on the Shroud of Turin"},{"author":"co","post":"¡Me resulta muy curioso el empeño de Yannick en que el cuerpo de Jesús de Nazaret sufriera la PUTREFACCION !\nNo es esa la opinión de casi todos los expertos en la Sábana……con la excepción de Rogers, magnífico químico pero poco conocedor de los aspectos medico-forenses.\nLa putrefaccion ( y el desprendimiento de amoniaco es signo de putrefacción) no se inicia hasta la desaparición del rigor mortis (llamada Ley de Brouardel), y la imagen de la Sábana no muestra ningún signo de descomposicion incluida la difusion gaseosa.\nMe parecen muy DESAFORTUNADOS los comentarios sobre Di Lazzaro, Fanti y “other guys”, que incluye entre otros a su “amigo” el Dr. Heimburger, colega mío.\n\n","date":"December 23, 2011 at 11:10 pm","url":"https://shroudstory.com/2011/12/23/surprising-live-poll-on-the-shroud-of-turin/","cat":"image_theory","title":"Surprising Live Poll on the Shroud of Turin"},{"author":"co","post":"Dan, ¿cree usted que esa bella imagen fetal que muestra contiene información 3D codificada?\nMe atrevo a asegurarle ( no tengo software al respecto) que NO la contiene, no hay relación de proporcionalidad en sus “puntos” entre distancia e intensidad de la imagen.\nA partir de esa imagen, coherente en 2D, creo que NO podría obtenerse una imagen coherente en 3D…….\n\n","date":"January 17, 2012 at 8:34 am","url":"https://shroudstory.com/2012/01/16/the-3d-images-on-the-shroud-of-turin-are-not-unique/","cat":"image_theory","title":"The 3D images on the Shroud of Turin are not unique"},{"author":"co","post":"“Note incidentally that the 1532 burn marks also show up in glorious 3D on the graphics which accompany the above article (featuring the 1976 work of Jackson and his NASA imaging project team). The authors remain silent on that little source of potential embarrassment …”\nLos “autores” (authors) SI ENTIENDEN cómo funcionaba el VP-8…….otros NO lo entienden.\nEl VP-8 al asignar altura o bajura a las distintas densidades de una imagen fotográfica proporciona una FALSA 3D por lo que NO se utilizaba para estudiar la OROGRAFIA planetaria:\n“The purpose of the isometric display was to make it easier to follow patterns of changes in shades of gray within an image. Particularly, the light pattern changes in reflection of light from soils and vegetation near a fault line were of interest. Following patterns of soil types and vegetation types was also of interest. But in no case was there ever any indication on the isometric display of how high or low, how tall or short something was.” Peter M. Schumacher ( el ingeniero que programaba los VP-8).\n1-En un soporte gráfico (la película fotográfica que contiene la imagen planetaria o cualquier otra imagen) no existe información sobre las DISTANCIAS entre el soporte gráfico y la imagen real, y al someterla al VP-8 y transformar las intensidades en distancias NO PUEDE existir COHERENCIA entre esa imagen y la imagen REAL:\n“The isometric display was never intended to produce a “real-three-dimensional” display.\nA snow-covered peak would look like a high, flat surface, while a rock sitting on top of the snow would look like a deep hole in the high surface. Light reflecting from a stream at the bottom of a valley would appear to be a high elevation, perhaps even higher than the snow on the peak of the mountains. Dull rocks and dark vegetation would appear to be lower than the water of the stream. In other words, objects are not as tall or short, high or low, as their reflectance of light might indicate. There is no correlation between reflectance and altitude.” Peter M. Schumacher (el ingeniero que programaba los VP-8).\n2-Artefactos en la Sábana:\nCuando el VP-8 proporciona una FALSA 3-D a la imagen fotográfica de las marcas del incendio de 1532 ( u a otros ARTEFACTOS sin relación con la IMAGEN CORPORAL) , está funcionando correctamente, ES LO ESPERADO del VP-8.\nAl transformar el VP-8 las intensidades en distancias NO existe COHERENCIA entre la imagen del ARTEFACTO (marca de la quemadura) y la marca de la quemadura REAL.\n3-Imagen Corporal en la Sábana:\nCuando una fotografía de la Sábana (soporte gráfico de la impresión de un cuerpo) es sometida al VP-8 se produce en la imagen corporal lo NO ESPERADO del VP-8.\nAl transformar el VP-8 las intensidades en distancias SI existe COHERENCIA entre la imagen CORPORAL del soporte gráfico (Sábana) y el cuerpo de un HOMBRE REAL.\n4-Demostrandose que INTENSIDADES y DISTANCIAS guardan en la Sábana relación de proporcionalidad, y generando el VP-8 una VERDADERA 3-D\nEn ese soporte gráfico (Sábana) las densidades de la imagen corporal tienen proporcionalidad con las distancias en cada punto SOPORTE-HOMBRE, cada punto del soporte (Sábana) tiene información codificada sobre su distancia al punto REAL CORPORAL que quedó impreso, a eso se le llama TRIDIMENSIONALIDAD, 3D. \n[ esa 3D, tridimensionalidad fue enunciada por Delage y Vignon en 1902, estudiada por Gabriel Quidor en 1913 con un densitómetro mecánico, estudiada por Paul Gastineau en 1974 que realizó el primer bajo-relieve del rostro a partir de la fotografía de la Sábana mediante un estilete acoplado sobre un sistema óptico, estilete que actuaba sobre una materia maleable. En 1976 es demostrada mediante el VP-8 por Jackson, Jumper, Stevenson, Charter y Schumacher.]\nLa mejor o peor DECODIFICACIÓN de esa dimensión (distancia) para obtener un modelo volumétrico es un tema intimamente relacionado pero DIFERENTE, dependiente del avance de las tecnologías al respecto.\n\n","date":"January 17, 2012 at 2:10 pm","url":"https://shroudstory.com/2012/01/16/the-3d-images-on-the-shroud-of-turin-are-not-unique/","cat":"image_theory","title":"The 3D images on the Shroud of Turin are not unique"},{"author":"co","post":"No creo que puedan existir DUDAS razonables sobre quien es el Hombre de la Sábana.\nComo ya se ha dicho aquí las manchas de sangre NO son reproducibles (precisan de la desmaterialización del cuerpo en un DETERMINADO momento), NO son observables (NADIE podría haber visto NUNCA unas manchas de sangre similares) y por tanto NO son falsificables.\nY del único SER del que nos ha llegado noticia de que desaparició de su mortaja funeraria es Jesús de Nazaret……y ello gracias a un evento sobrenatural, la Resurrección.\nHay otras muchas razones, algunas ya mencionadas aquí que van en la misma dirección ( corona o casco de espinas al REY de los judíos, tumefacción de la mejilla y rotura de nariz, herida del costado con gran salida de suero, barba arrancada, flagelación, etc concordantes con el relato evangélico) .\nYa el SIMPLE hecho de que un condenado a muerte fuera envuelto en una sábana de gran valor y sepultado en una tumba familiar es un hecho EXCEPCIONAL.\nPersonalmente CREO que la Sábana NO ESTABA en la sepultura cuando Pedro y Juan entran el ella.\n¿Se apareció Jesús DESNUDO a María Magdalena?\n¿Qué vió Juan al entrar en la tumba que le hizo CREER que Jesús había resucitado?.\nEl “Evangelio de los Hebreos” (apócrifo no significa falso) relata que Jesús se apareció a su hermano, Santiago el Justo que había hecho voto de no comer hasta no ver a Jesús resucitado de entre los muertos : ” Más el Señor, después de haber dado la sábana al criado del sacerdote, se fue hacia Santiago y se le apareció”.\n¿Era sacerdote José de Arimatea?. Parece justo que la sábana volviera a su dueño.\nRecogí en mi blog una bella ilustración bastante excepcional ( iconográficamente hablando) de un manuscrito armenio obra de Avetik que representa a Jesús resucitado con una túnica, la Sábana, manchada de sangre:\nhttp://lasabanaylosescepticos.blogspot.com/2009/07/armenia-2.html\n\n","date":"December 7, 2011 at 9:08 pm","url":"https://shroudstory.com/2011/12/07/why-do-we-think-it-is-an-image-of-jesus-on-the-shroud-of-turin/","cat":"image_theory","title":"Why do we think it is an image of Jesus on the Shroud of Turin?"}],"misc":[{"author":"co","post":"Dorothy, puede usted encontrar una imagen de gran resolución del Salvator Mundi atribuido a Leonardo en:\nhttp://www.thehistoryblog.com/wp-content/uploads/2011/07/Salvator-M…\nUna magnífica iconografía comentada (en francés) de OTROS Salvator Mundi con “bola” de cristal (¿) en:\nhttp://www.arretsurimages.net/vite.php?id=11679\nUn magnífico foro con muy interesantes comentarios (en español) y muy buena iconografía en :\nhttp://terraeantiqvae.com/forum/topics/anuncian-el-descubrimiento-de?groupUrl=historiadelarte&groupId=2043782%3AGroup%3A16225&id=2043782%3ATopic%3A128261&page=1#comments\n\n","date":"January 24, 2012 at 8:11 am","url":"https://shroudstory.com/2012/01/23/has-playful-leonardo-left-us-a-clue-in-the-salvator-mundi/","cat":"news_&_views","title":"Has Playful Leonardo Left Us a Clue in the Salvator Mundi?"},{"author":"co","post":"El primer link parece no funcionar.\nPruebe con:","date":"January 24, 2012 at 8:17 am","url":"https://shroudstory.com/2012/01/23/has-playful-leonardo-left-us-a-clue-in-the-salvator-mundi/","cat":"news_&_views","title":"Has Playful Leonardo Left Us a Clue in the Salvator Mundi?"},{"author":"co","post":"Los ojos del Salvator Mundi tienen un ligero ESTRABISMO convergente que producen el efecto de estar siempre MIRÁNDONOS desde cualquier posición que lo veamos.\nLa bola NO es de cristal, no produce ninguna deformación en los pliegues del ropaje ni de la palma de la manos vistos a través de ella.\n\n","date":"January 23, 2012 at 1:46 pm","url":"https://shroudstory.com/2012/01/23/has-playful-leonardo-left-us-a-clue-in-the-salvator-mundi/","cat":"news_&_views","title":"Has Playful Leonardo Left Us a Clue in the Salvator Mundi?"},{"author":"co","post":"Joe Nickell tiene muy mala memoria.\nOLVIDA que los experimentos con la técnica de frotamientos de bajo-relieves, como los realizados por Henri Broch y con SIMILAR TÉCNICA por el propio Joe Nickell, por Eric-Paul Blanrue, y  por LUIGI GARLASCHELLI (en el caso del profesor Garlaschelli es un modelo humano el que hace el role del bajo-relieve para el cuerpo y un bajo- relieve para el rostro), fueron DESAUTORIZADOS por el propio Walter McCrone.\nEste documento desautorizando esa técnica es poco conocido por los lectores, y es probablemente lo ÚLTIMO que McCrone escribió sobre la Sábana de Turín:\n“Carta al Director aparecida en el Volumen 24 nº 5 (Septiembre/Octubre 2000) de la revista Skeptical Inquirer (páginas 67 y 68).\nEl número de Mayo/Junio 2000 del Skeptical Inquirer incluía un artículo entristecedor donde se mostraba hasta que punto se han convertido en habituales las ideas paranormales, especialmente en Francia.\n El autor, Henri Broch, describía “como reproducir sábanas con todas las características de la sábana de Turín”. Estaría de acuerdo con él si se añadiese la siguiente salvedad, “si se observa a simple vista”.\nAcabo de escribir un artículo, actualmente en prensa (1) demostrando que la técnica de frotamiento de un bajo relieve produce una imagen que, bajo ampliaciones superiores a 500X, resulta muy diferente de la de la sábana de Turín.\nEllo quiere decir que la “Sábana” turinesa no pudo haber sido realizada mediante tal procedimiento, dejando como única alternativa convencional el empleo del pincel; sólo así se puede obtener una imagen con todas las características físicas microscópicas observadas en la “Sábana”.\nAmbas imágenes fueron realizadas con pigmentos artísticos (ocre rojo y bermellón) pero los pigmentos en las imágenes sobre la Sábana de Turín se encuentran bien dispersos por todas las fibras de lino, casi en su totalidad como agregados de entre 1 a 5 partículas individuales de tamaño inferior a una micra; por contra, en las imágenes obtenidas por frotamiento de un bajo relieve, el pigmento se dispersa en agregados de entre 100 a 1000 (o más) partículas individuales.\nWalter C. McCrone\nMcCrone Research Institute\nChicago, Illinois\n(1) Enviaré una copia de este artículo a cualquiera que lo solicite.Teléfono (312) 842-7100; Fax (312) 842-1078; correo electrónico: wmccrone@mcri.org “\n\n","date":"December 24, 2011 at 10:29 pm","url":"https://shroudstory.com/2011/12/24/second-update-to-msnbcs-cosmic-log-posting-on-the-shroud-of-turin/","cat":"news_&_views","title":"Second Update to MSNBC’s Cosmic Log Posting on the Shroud of Turin"}],"opinion":[{"author":"co","post":"Es DIFÍCIL entender como alguien que se titula con formación científica no comprende algo tan SIMPLE.\nLa propiedad 3D de la sábana que demostró el VP-8, NO consiste en que proporcione una imagen  con VOLÚMENES, alturas y bajuras, del Hombre de la Sábana, sino en que esos volúmenes sean COHERENTES con la imagen de un hombre REAL.\nLas imagen 3D de las quemaduras de la Sábana, con sus volúmenes, NO son coherentes con las quemaduras reales, pues las quemaduras reales SON PLANAS, es una FALSA 3D\nCualquier foto o pintura NORMAL que usted someta a un programa 3D tipo VP-8, proporcionará siempre imágenes con VOLÚMENES que serán NO COHERENTES, falsa 3D, con el objeto o persona que represente la foto o pintura.\nEl VP-8, se ha repetido hasta la saciedad, NO estaba programado para ver las fotos NORMALES porque siempre proporcionaría resultados ABERRANTES, no coherentes con la realidad.\n“The isometric display was never intended to produce a “real-three-dimensional” display. A snow-covered peak would look like a high, flat surface, while a rock sitting on top of the snow would look like a deep hole in the high surface. Light reflecting from a stream at the bottom of a valley would appear to be a high elevation, perhaps even higher than the snow on the peak of the mountains. Dull rocks and dark vegetation would appear to be lower than the water of the stream. In other words, objects are not as tall or short, high or low, as their reflectance of light might indicate. There is no correlation between\nreflectance and altitude.\nThe purpose of the isometric display was to make it easier to follow patterns of changes in shades of gray within an image. Particularly, the light pattern changes in reflection of light from soils and vegetation near a fault line were of interest. Following patterns of soil types and vegetation types was also of interest. But in no case was there ever any indication on the isometric display of how high or low, how tall or short something was.”.Schumacher, el ingeniero que programó el VP-8.\n¿ENTIENDE?\n\n","date":"January 31, 2012 at 8:26 pm","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","title":"Badder Still: Bad Archaeology at Bad Archaeology"},{"author":"co","post":"A estas fechas, 2012, no tenemos certeza de qué es lo que se “quemó” en la prueba del C14.\nComo usted creo conoce, sciencebod, el Prof.Hull ( laboratorio de Arizona) nos sorprendió recientemente publicando en su revista, Radiocarbon, que estaba en posesión de uno de los fragmentos de la Sábana que TODOS creíamos, porque así lo contaba Nature, que había sido “quemado”……….\n\n","date":"January 31, 2012 at 4:51 pm","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","title":"Badder Still: Bad Archaeology at Bad Archaeology"},{"author":"co","post":"Yannick, para completar su comentario, un muy buen trabajo sobre sangre de Carlo Brillante, Universidad de Bologna y también interesante la bibliografía que aporta en el mismo\n“Bloodstains characteristics to be considered in laboratory reconstruction of the Turin Shroud”\nhttp://xoomer.virgilio.it/bachm/BRILLAN2.PDF\n\n","date":"January 25, 2012 at 8:12 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","title":"He’s back and it’s a doozy"},{"author":"co","post":"El Prof. Carlo Brillante ya trató el tema en 1981, “La fibrinolisi nella genesi delle impronte sindoniche”, el que usted hable de la ciencia de Mickey Mouse al referirse a Brillante, profesor de la Universidad de Bologna le da méritos suficientes para hacerse acreedor al término “bocazas”, hablar con la boca muy abierta de aquello que se desconoce……\nLos muertos no sangran de modo ACTIVO, la sangre de las grandes heridas que aparecen en la Sábana, clavos y herida del costado, son producto del derrame o volcado PASIVO de sangre líquida, que no ha iniciado la coagulación, y de COAGULOS ya formados, todo ello normal  en el CADÁVER cuando la sangre queda retenida o acumulada (cavidades derechas del corazón, cavidad pleural con hemotorax post-mortal, cavidad y retención tras la extracción de los clavos…).\nEn las necropsias los forenses diferencian los TROMBOS (coágulos de sangre en el árbol arterio-venoso producidos en VIDA) de los COAGULOS (coágulos de sangre producidos POST-MORTEM ya en el árbol arterio-venoso o FUERA de él). La estructura de ambos es distinta.\nSi se dan las circunstancias adecuadas (entre ellas un determinado ESPESOR de la capa o volumen de sangre) se producirá la coagulación y la fibrinólisis del coágulo, en el VIVO y en el MUERTO.\nEn el VIVO este ESPESOR es muy inusual en una herida o lesión externa porque se ponen en marchas los mecanismos de retracción de la herida y se contiene la hemorragia taponando la herida; pero cuando se produce el acúmulo en una cavidad natural con salida al exterior NO se producen las costras protectoras y SI se produce el coágulo y su fibrinólisis si el coágulo se mantiene y no es eliminado ( coágulos en la endometriosis, en la sangre menstrual de la mujer, en la epixtasis nasal mantenida etc, etc).\nEn el MUERTO la sangre POST-MORTAL , que procede siempre de derrame pasivo y/o volcado de la acumulada en cavidades, NO forma costras en el sentido que usted pretende, el coágulo se va endureciendo desde la superficie por la red de fibrina, se exprime reduciendo su tamaño y eliminando suero al exterior formando un halo y finalmente se reblandece y licua mediante el mecanismo de fibrinólisis.\nLe guste o no le guste a usted.\nPaul Vignon, biólogo, experimentó mucho tiempo con los COÁGULOS y el LINO, ¿cree que esos coágulos se transformaban en costras?. Los coágulos de sangre de Vignon, cuando se iniciaba la fibrinólisis producían improntas en el lino muy pobres y si la fibrinólisis se completaba emborronaban el lino, para desesperación de Vignon.\nEse ”momento exacto” en que la imagen es tan definida y nítida como se presenta en la Sábana no se ha podido conseguir en el laboratorio.\nMario Latendresse llamó la ATENCION sobre 4 marcas en la imagen dorsal  y en la baja espalda del Hombre de la Sábana en un bonito artículo:\n “ Why would a forger be so precise? The four circle blood marks on the back of the man of the Shroud”.  \nhttp://www.sindonology.org/papers/bloodMarksButts.shtml\nCon independencia de que sean o no sean causadas por el sedile,  la IMAGEN de esas marcas es IMPACTANTE y recogí en mi blog junto a las imágenes de Barrie Schwortz 1978, las de Secondo Pía 1988, Enrie 1931 y Durante 2002 para COMPARARLAS.\nhttp://lasabanaylosescepticos.blogspot.com/2010/11/son-las-marcas-del-sedile.html\nEsas imágenes que propone Latendresse:\n1.- NO pueden observarse en la práctica médica.\n2.- NO pueden obtenerse en el Laboratorio.\n3.- NO han podido por tanto ser OBSERVADAS por ningún artista falsario.\n4.- Son por tanto IRREPRODUCIBLES e INFALSIFICABLES .\nProbablemente usted, amigo de la buena ciencia, podrá dar alguna explicación para esas imágenes que sea MINIMAMENTE COHERENTE.\n\n","date":"January 26, 2012 at 2:47 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","title":"He’s back and it’s a doozy"},{"author":"co","post":"Yannick, la coagulación y la fibrinólisis son temas de extraordinaria complejidad por la enorme cantidad de factores que intervienen, los propios de los tejidos, de la propia sangre, de los órganos con ello relacionados, de la forma y causas de muerte (en el caso de cadáveres) y de un montón de factores externos…..\nLa fibrinólisis NO tiene NADA que ver con la putrefacción.\nY como caso EXTREMO la coagulación de la sangre y su FIBRINOLISIS pueden acontecer en el cortísimo plazo de 2 horas.\n\n","date":"January 26, 2012 at 3:14 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","title":"He’s back and it’s a doozy"},{"author":"co","post":"Totalmente de acuerdo, Yannick.\nEl trabajo de Barbet es impecable, sólo una “mala lectura” y un “peor entendimiento” pueden justificar la crítica de Zugibe ( y yo prefiero no hacer una crítica al trabajo de Zugibe porque sería muy DURA).\nEs muy difícil encontrar un trabajo técnico tan ASEQUIBLE al lector sin conocimientos anatómicos como hace Pierre Barbet.\nEl último trabajo interesante sobre el tema es “Anatomía de la Crucifixión” (sale en el Google) de Lagraña, Terraes y Revidatti. Catedra II de Anatomía de la Universidad de Buenos Aires. La entrada del clavo es MUY CERCANA a la propuesta por Barbet.\n– el clavo se desliza por el lado interno o medial del “hueso grande” (capitate) según Barbet\n– el clavo se desliza por el lado externo o lateral del “hueso grande” (capitate) según Lagraña y col.\nLa opinión médica mayoritaria, en el caso concreto de la Sábana, es a favor de la hipótesis de Barbet, pues SÓLO él realizó sus experiencias con “manos vivas”, recién amputadas, que conservaban la propiedad de responder a los estímulos nerviosos.\n(Sobre la obra de Barbet gravita además la figura de una gran anatomista, el Prof. Hovelacque.)\nPara los lectores que encuentren dificultad en encontrar información sobre el espacio de Destot (es un espacio de interés RADIOLÓGICO sin importancia anatómica):\nhttp://www.anatomyatlases.org/AnatomicVariants/SkeletalSystem/Text/WristHand.shtml\n\n","date":"January 12, 2012 at 4:23 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"},{"author":"co","post":"Ron, yo soy médico, pero parece que hace usted poca estima de la opinión de los médicos europeos ya que no sabemos distinguir el carpo del metacarpo.\nVea usted la portada del libro “The Wrist” para hacerse una mejor idea de la situación de los huesos del carpo:\nhttp://www.amazon.com/Wrist-Diagnosis-Operative-Treatment/dp/1608313905\nZugibe plantea un trayecto absurdo en la SUPERFICIE (para salvar los estigmas), porque SU clavo TAMBIÉN penetra en PROFUNDIDAD por el CARPO y sale por el CARPO.\nEl Dr. Domenico Tarantini, cirujano del Ospedale Generale di Trani, realizó la misma experiencia y confirmó plenamente la tesis del Dr. Barbet.\nYves Delage, que era médico y biólogo, Profesor de Anatomía Comparada en la Sorbona, con quien la Sábana Santa entró en el mundo de la Ciencia, escribía en 1902:\n“Les mains percées au CARPE et non au métacarpe, conformément aux nécessités anatomiques et contrairement à la tradition.”\nYves Delage ” Lettre à M. Charles Richet ” Revue scientifique, n° 22 du 31 mai 1902, pp. 683-687\n(y trabajaba, como Barbet, con imágenes a tamaño NATURAL de la Sábana)\n\n","date":"January 12, 2012 at 7:03 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"},{"author":"co","post":"“I see the wound nowhere near the wrist or Destot´s spot”\nRon, su comentario es ININTELIGIBLE.\n¿Dónde cree usted que ve Zugibe la SALIDA del clavo en la imagen de la Sábana?\n¡En el CARPO, en la MUÑECA (wrist).!\n(¿Quiere que hagamos una ANATOMÍA de la muñeca (wrist) a su gusto?)\nDe los 2 espacios propuestos por Zugibe ninguno ATRAVIESA la palma de la mano.\n(para atravesar la palma de la mano tiene que pasar el clavo por los espacios intermetacarpianos, y Zugibe NO lo propone)\nEntendió usted mal el trabajo de Barbet y entendió mal el trabajo de Zugibe.\n.\n\n","date":"January 15, 2012 at 9:06 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"},{"author":"co","post":"La crítica que hace Zugibe es muy DESAFORTUNADA.\nPierre Barbet NO cometió ningún error en su trabajo y la grave dislocación de la estructura osea del carpo al penetrar un clavo de 1 cm de sección (como muestra en la radiografía) justifica más que sobradamente la lesión directa del lado sensitivo del nervio mediano y la lesión indirecta del lado motor, sometido a una enorme presión.\n\n","date":"January 9, 2012 at 11:07 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"},{"author":"co","post":"“Indeed all the fingers look too long and seemingly do not follow the natural length pattern of a normal persons fingers.”\nChris, creo que si le contesto se va a COMPLICAR mucho el debate………….\nEn mi modesta opinión la imagen de la mano izquierda (la que muestra la herida del clavo) es una de las “claves” del mecanismo de formación de la imagen.\n\n","date":"January 16, 2012 at 4:26 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"},{"author":"co","post":"Yannick, las manos son normales, prácticamente normales…….pero hay que saber QUÉ ES lo que se está viendo.\nBarbet era extraordinariamente cuidadoso en sus afirmaciones.\nFíjese en estas frases:\n“La dernière fois que j’ai disposé d’une main fraîche, j’ai pris un bistouri à lame de 8 millimètres. Je l’ai piqué dans le pli de flexion du poignet et en poussant, sans effort, j’ai traversé le carpe sans rencontrer de résistance pour ressortir au dos de la main, toujours au même endroit. Cet endroit, sur u main d’homme normale, est toujours à environ 8 centimètres de la tête de 3e métacarpien. C’est la même distance que j’ai mesurée sur le Linceul.”\n¿Cómo podía Barbet medir desde la cabeza del III metacarpiano?\nLa respuesta es muy SENCILLA…… pero demasiado FUERTE.\n[es muy fácil hacer medidas en la Sábana gracias a Mario Latendresse]\nhttp://people.bridgewater.edu/~rschneid/FocusProjects/Shroud/ShroudMeasure/enrieImg.html\nMedítelo.\n\n","date":"January 17, 2012 at 3:15 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"}],"researchers":[{"author":"co","post":"Yannick:\nDice un viejo refrán que “el hábito no hace al monje”.\nTodos somos libre de pensar como queramos, pero si en un debate usted se presenta como cristiano católico CONFUNDE a los lectores.\nEl evangelio no deja lugar a duda de que Jesús RESUCITADO dice tener carne y huesos, muestra sus heridas ( pide a Tomás que lo compruebe ), y además Jesús come y bebe para mostrar que NO es un espíritu.\nYo, personalmente NO voy a llevar la contraria a lo que los evangelistas ponen en boca de Jesús.\n¿ Cree usted que un cuerpo ESPIRITUAL? tiene carne y huesos, presenta heridas y come y bebe?\n¿Qué cree usted que sucedió con el CUERPO de Jesús?\n\n","date":"November 7, 2011 at 4:17 pm","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","title":"A Guest Posting by Giulio Fanti"},{"author":"co","post":"Yannick:\nNo me interesan los aspectos teológicos, soy librepensador que creo en Jesús de Nazaret, en su mensaje y en su Resurrección, y este último aspecto incide en el tema de la Sábana.\nLa resurrección FÍSICA y la ESPIRITUAL son hechos ambos COMPATIBLES en los últimos días de Jesús de Nazaret.\nUsted parece admitir, como yo, que Jesús desapareció de sus envolturas (las manchas de sangre lo significan) y ello supone la DESMATERIALIZACIÓN de su cuerpo, su Resurrección Espiritual.\nCuando tiene que mostrarse, aparecerse a sus discípulos, su cuerpo se MATERIALIZA, tiene carne y huesos, muestra heridas y come y bebe como indica el Evangelio, los discípulos lo ven físicamente, no espiritualmente y por lo menos al principio con el rostro terriblemente deformado por el suplicio sufrido y las heridas abiertas.\nDesmaterialización y materialización son hechos SOBRENATURALES que involucran a la MATERIA y que por lo tanto pueden afectar a la naturaleza FÍSICA del entorno, cosa que en mi parecer sucedió con la Sábana de Turín, testigo de la Resurrección.\n(Ruego disculpe no poder expresarme en su idioma)\n\n","date":"November 7, 2011 at 8:09 pm","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","title":"A Guest Posting by Giulio Fanti"},{"author":"co","post":"Muy interesantes e inteligentes los comentarios de Ron y Yannick, pero personalmente, he estudiado y estudio la Sábana desde hace casi 20 años, coincido plenamente con Ron.\nTranslated by Microsoft Bing: Very interesting and intelligent comments from Ron and Yannick, but personally, I have studied and study the Shroud for almost 20 years, I fully agree with Ron.\nhttp://lasabanaylosescepticos.blogspot.com/2011/02/pero-entonces-amigo-miojesucristo-ha.html\nhttp://lasabanaylosescepticos.blogspot.com/2011/03/pero-entonces-amigo-miojesucristo-ha.html\nhttp://lasabanaylosescepticos.blogspot.com/2011/01/un-hecho-extraordinario.htm\nCarlos Otal\n\n","date":"August 30, 2011 at 7:16 pm","url":"https://shroudstory.com/2011/08/25/john-and-rebecca-jackson-to-speak-on-the-shroud-of-turin-at-saint-james-the-just-parish-in-ogden-utah/","cat":"news_&_views","title":"John and Rebecca Jackson to Speak on the Shroud of Turin at Saint James the Just Parish in Ogden, Utah"},{"author":"co","post":"Yannick, fue usted muy hábil para no contestar a mi última pregunta sobre cómo pudo Barbet medir la distancia DESDE la cabeza del III metacarpiano…….\nLa respuesta era muy sencilla, colocando el inicio de la regla o la punta del compás en la cabeza del III metacarpiano.\nSi entiende lo que ESO significa, aunque usted pueda no estar de acuerdo, entenderá fácilmente por qué, además de otras varias cosas, MUCHOS estamos más cerca de Jackson y más lejos de Rogers en cuanto la interpretación del mecanismo de formación de la imagen.\n[quede claro que TODOS tenemos un gran respeto por la ENORME aportación de Rogers al estudio de la Sábana]\nIntente ENTENDER el significado de mi pregunta y respuesta.\n\n","date":"January 18, 2012 at 6:02 pm","url":"https://shroudstory.com/2012/01/18/paper-chase-jones-republishes-jacksons-an-unconventional-hypothesis-to-explain-all-image-characteristics-found-on-the-shroud-image/","cat":"news_&_views","title":"Paper Chase: Jones republishes Jackson’s, \"An Unconventional Hypothesis to Explain all Image Characteristics Found on the Shroud Image\""},{"author":"co","post":"Yo quisiera conocer la opinión de Mario Latendresse al respecto……..\nNO son 3 puntos simétricos, son 4 marcas en las 4 “esquinas” aproximadamente de la fotografía, y no hay eje de simetría.\nLa forma de las “manchas de agua sería” completamente absurda de explicar, alguna de las  marcas tiene “submarcas” con su halo de “agua”?………….\nNo veo otras “quemaduras” parecidas por la Sábana.\n\n","date":"January 29, 2012 at 7:02 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","title":"Quote for today by Mario Latendresse"},{"author":"co","post":"Cada PEQUEÑO tema relacionado con la Sábana da lugar a GRANDES problemas de interpretación.\nHay marcas o manchas de sangre cuyos márgenes NO emiten fluorescencia, como la sangre que cruza la espalda (DORSAL) y la sangre del pie izquierdo (DORSAL).\nAsí que la NO presencia de fluorescencia en las 4 marcas referidas por Mario Latendresse ( DORSAL) no tiene forzosamente que significar que no sean marcas de sangre.\nSu apariencia es de sangre y , en mi opinión, el que sean marcas de quemaduras sobre las que se ha echado agua o vino de manera “tan  particular” me parece ABSURDA.\n\n","date":"January 31, 2012 at 4:30 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","title":"Quote for today by Mario Latendresse"},{"author":"co","post":"Yannick, yo no invento nada, siempre me documento en la medida posible. \nNo tenido acceso a los trabajos de Miller y Pellicori, pero si a un buen artículo de A.Rodriguez-Saldaña de 2009 muy bien documentado sobre los trabajos de Miller y Pellicori:\n—Miller, V.D. – S.F. Pellicori – Ultraviolet Fluorescence Photography of the Shroud of Turin – Journal of Biological Photography, Vol. 49, No. 3, July 1981, pp. 71-85.\n—Pellicori, S. – M.S. Evans – The Shroud of Turin Through the Microscope – Archaeology 34, January/February 1981, pp. 34-43.\n—Pellicori, S.F. – Spectral Properties of the Shroud of Turin – Applied Optics Vol. 19, No. 12, June 15,1980, pp. 1913-1920.\n—Pellicori, S.F. – Chandos R.A. Portable Unit Permits UV/vis Study of “Shroud”. Industrial Research & Development, Feb, 1981, 186-189.\nNo tengo ninguna razón especial NO CREER lo que escribe Rodriguez-Saldaña en su artículo “El STURP: Un completo estudio científico” . \nhttp://www.lasabanasanta.org/docs/sturp.pdf\nY escribe textualmente en el apartado:\n11. Fluorescencia fotográfica:\n“En algunas manchas de “sangre” (herida costal, herida de la muñeca, herida del pie derecho dorsal) se rodea de márgenes fluorescentes (Figs. 30b y 30c). De estas zonas no hay micrografías, espectro de reflectancia ni cuantificación de la fluorescencia, por ser posteriores estos estudios (a la vista de estos resultados hubiera sido importante realizar esas pruebas, pero el S.T.U.R.P. ya no disponía de tiempo para ello). Miller y Pellicori interpretaron que esos márgenes fluorescentes podrían deberse a la presencia de suero, el cual retardaría las reacciones de formación de la imagen.\nLOS MÁRGENES DE OTRAS HERIDAS ANALIZADAS ( SANGRE QUE CRUZA LA ESPALDA O SANGRE DEL PIE IZQUIERDO DORSAL) NO EMITEN FLUORESCENCIA.”\n(Las mayúsculas son mías) \nAlejandro Rodriguez-Saldaña es profesor asociado de la Universidad de Murcia (España) en el Departamento de Biología Celular e Histología.\n\n","date":"January 31, 2012 at 6:37 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","title":"Quote for today by Mario Latendresse"},{"author":"co","post":"………. y en el mismo sentido que A.Rodriguez- Saldaña, escribe el siempre MAGNÍFICAMENTE documentado Dr. Heimburger Thibault en su página “Suaire & Science”:\n“ on détecte autour de CERTAINES taches de sang, la présence d’un halo fluorescent à limite nette. Ceci pourrait correspondre à un exsudat de sérum formé lors de la rétraction du caillot: le sérum sanguin est en effet légèrement fluorescent.”\nhttp://www.suaire-science.com/sang.htm\n\n","date":"January 31, 2012 at 7:43 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","title":"Quote for today by Mario Latendresse"},{"author":"co","post":"Vemos las marcas de manera muy diferente……\nLas 4 marcas que refiere Mario Latendresse, y a las que yo también me refiero, tienen una ESTRUCTURACION completamente distinta a las otras marcas que usted propone.\nEn lo que SI estamos de acuerdo es que el tema es lo suficientemente interesante para ser investigado en profundidad.\n\n","date":"January 29, 2012 at 11:37 pm","url":"https://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/","cat":"news_&_views","title":"Quote for today by Mario Latendresse"},{"author":"co","post":"Las manchas de sangre se han producido por contacto…..pero hay manchas de sangre que aparecen FUERA de la imagen corporal, como el largo reguero que sale del codo izquierdo.\nEl Dr.Gilbert Lavoie ha demostrado de una manera SENCILLA, al alcance de cualquiera que desee repetir la experiencia, que la Sábana estuvo en 2 posiciones distintas:\nLa primera posición envolviendo el cuerpo, responsable de las manchas de SANGRE por contacto y siendo su posición HORIZONTAL.\nLa segunda posición en la que se produce la IMAGEN CORPORAL, en que el cuerpo (y la Sábana por tanto) están en posición VERTICAL.\nhttp://www.acheiropoietos.info/proceedings/LavoieWeb.pdf \nhttp://lasabanaylosescepticos.blogspot.com/2010/07/una-simple-y-sencilla-demostracion.html\nNo existe NADA en la Ciencia que pueda justificarlo, y ello demuestra un evento SOBRENATURAL.\nCarlos Otal.\n\n","date":"November 11, 2011 at 10:23 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","title":"Paper Chase: The Findings of Robert Bucklin"},{"author":"co","post":"Escribí en anterior comentario:\n“La presencia del RIGOR MORTIS, patente en la imagen, indicando la persistencia de elevada cifras de ácido láctico NO es compatible con el inicio de la DESCOMPOSICIÓN de las proteinas y producción de las aminas CADAVERINA, PUTRESCINA y afines, necesarias en la reacción de Maillard que propuso Rogers.\nLa descomposición se inicia una vez ha CESADO el rigor mortis.\nRogers, al que tanto debemos en el estudio de la Sábana, se equivocó en este punto, el cuerpo de Jesús de Nazaret NO sufrió la corrupción, no pudo producir cadaverina, putrescina y afines, y por tanto no pudo haber ninguna reacción de Maillard que diera color a la Sábana.”\nhttps://shroudofturin.wordpress.com/2011/10/25/more-on-max-patrick-hamon-and-the-coin-on-eye-issue/#comments\nCarlos Otal\n\n","date":"November 12, 2011 at 1:31 am","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","title":"Paper Chase: The Findings of Robert Bucklin"},{"author":"co","post":"Las manchas de sangre se han producido por contacto…..pero hay manchas de sangre que aparecen FUERA de la imagen corporal, como el largo reguero que sale del codo izquierdo.\nEl Dr.Gilbert Lavoie ha demostrado de una manera SENCILLA, al alcance de cualquiera que desee repetir la experiencia, que la Sábana estuvo en 2 posiciones distintas:\nLa primera posición envolviendo el cuerpo, responsable de las manchas de SANGRE por contacto y siendo su posición HORIZONTAL.\nLa segunda posición en la que se produce la IMAGEN CORPORAL, en que el cuerpo (y la Sábana por tanto) están en posición VERTICAL.\nhttp://www.acheiropoietos.info/proceedings/LavoieWeb.pdf\nhttp://lasabanaylosescepticos.blogspot.com/2010/07/una-simple-y-sencilla-demostracion.html\nNo existe NADA en la Ciencia que pueda justificarlo, y ello demuestra un evento SOBRENATURAL.\nCarlos Otal.\n\n","date":"November 12, 2011 at 1:35 am","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","title":"Paper Chase: The Findings of Robert Bucklin"}]}
