{"art":[{"author":"corlia","post":"On the 22nd of March 2011 I had surgery, which went very well.  It wasn’t until I got home three days later that I got really really sick.  I got major infection in my glands.  I had tremendous pain in my neck at first and then I had a black out.  My husband got such a fright and went to get the doctor.  The next thing I remember was our gp examining me in my bedroom.  In South Africa doctors don’t do housecalls at all.  The doctor said he wouldn’t send me back to hospital as there are too many germs and Iexposure to it could mean the end of me.  Later that night I was sitting up on the couch as it was too painfull to lie down on a pillow.  My hubby opted to sleep on the other couch that night, which he didn’t do as he stayed up to keep an eye on me.  Just before midnight I went to the bathroom and I remember looking in the mirror and I saw death in my own eyes.  I was very sick and to the Lord:  “So this is the way I’m going to leave here to go to you!”  I went out and sat on the couch.  I heard my husband pray for me in the kitchen  at that moment.  The next second I was standing in the middle of a green field with bright blue sky.  The first thing I noticed was the extraordinary, beautiful beautiful colours.  It’s like nothing I’ve ever seen on earth, too fantastic to describe.  I turned my head and saw a big wooden cross and Jesus embracing it with both arms, looking at me with indescribable sympathy and love as if to say:  “Just embrace Me and remember My cross, I’ve carried this sickness and pain when they nailed Me to it!”  It was absolutely amazing.  Immediately after that a lot of teenage boys emerged from behind Him and formed a circle around me and they prayed for me there in my living room.  Hubby saw nothing at all.  These boys were wearing striped shirts, each stripe an extraordinary beautiful colour, like nothing on earth.  I fell asleep after that.  I was very weak for the next three weeks, but came through and I now tell this story wherever I go.  Colton also describes the colours in heaven in his book, and that to me was just wonderful!  I love Jesus with all that I am!  I thank Him for all I am!\n\n","date":"October 27, 2012 at 1:41 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
