{"blood":[{"author":"corneliotel","post":"“ASSESSED URINARY LEVELS OF HYDROXYPROLINE 24, 48 AND 72 HOURS AFTER MAXIMAL STRECHING EXERCISE”. Rafaella.Bauerfeldt1.Antonio J.Luque Rubia2 José Villegas García…y otros.\nThe purpose of this study was to investigate the degree of catabolism of collagen as measured by levels of urinary excretion of hydroxyproline (HP) after static stretching exercise.\nStudy participants were 37 firefighters from the 1st GMAR of the State of Rio de Janeiro of the male gender, who are doing regular physical training, = + 29 years old, divided into two groups: control group (n = 17) which has not undergone any type of intervention and the experimental group (n = 20) which was submitted to static stretching exercise. As a methodological procedure was performed 4 urine samples for each individual.\nThe first collection was performed before the procedure to verify the level of HP as reference of the sample group (basal). The second, third and fourth collections were performed 24h, 48h and 72 hours after stretching static, with a fasting of 12 hours before sampling. For the determination of urinary levels of HP,was used ClinRep (complete kit for hydroxyproline in urine) by the method colorimetric. The results found on the levels of HP: Δ basal-24h=1,99 mg/24h. ; Δ 24h-48h= 9,01 mg/24h ; Δ 48h-72h= – 9,90 mg/24h e Δ Basal-72h= 1,09 mg/24h.\nFor the results it is concluded that there was a difference in the concentrations of HP between the baseline and 24h (p = 0,001 <0.05), with a significant increase in 48h (p = 0,001  0.05), matching it to the original level of the basal time, thereby\ndetermining that HP may be a biochemical index in the process of tissue repair and remodeling after exercise.\n—————————————————————————————————————–\nMi mal inglés no me permite seguir con “claridad” varios aspectos del debate.\nEn Jesús se daban todas las circunstancias que hacían posible un DIC,no he tenido acceso al trabajo de Bergeron que debe ser interesante:\n-Bergeron JW (2011).The crucifixion of Jesus Review of hypothesized mechanisms of death and implications of shock and trauma-induced coagulopathy. J. Forensic Legal Med.19, (3):113-116.\nAdemás de todo ello, con DIC o sin DIC, es muy posible que la CELULOSA del lino haya jugado un muy importante papel como “factor de coagulación”:\n-Másová L, Rysavá J, Krízová P, Suttnar J, Salaj P, Dyr JE, Homola J, Dostálek J, Myska K, & Pecka M (2003). Hemostyptic effect of oxidized cellulose on blood platelets. Sbornik lekarsky, 104 (2), 231-6 PMID: 14577133\n-Krízová P, Másová L, Suttnar J, Salaj P, Dyr JE, Homola J, & Pecka M (2007). The influence of intrinsic coagulation pathway on blood platelets activation by oxidized cellulose. Journal of biomedical materials research. Part A, 82 (2), 274-80 PMID: 17274026\nCarlos Otal\n\n","date":"April 4, 2013 at 5:44 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"author":"corneliotel","post":"Colin Berry ha ido EVOLUCIONANDO, empezó quemando las telas con planchas de metal caliente y ahora, poco tiempo después, mantiene la hipótesis de la quemadura por LUZ. ¡ ja, ja, ja, ja !.\n¡Colin terminará siendo defensor de la autenticidad de la Sábana!\nEstoy en ese punto, la quemadura por LUZ, de acuerdo con Colin Berry.\nHay que tener mucho cuidado con la utilización de las palabras, asociar la palabra quemadura (SCORCH)  sólo con ALTA TEMPERATURA es una fuente de ERROR.\nUna quemadura es una oxidación-deshidratación y existe la oxidación- deshidratación producida por CALOR (alta temperatura), la oxidación-deshidratación producida por FRIO (baja temperatura), la oxidación-deshidratación por una sustancia química QUÍMICA ( sin tener relación con la temperatura)……..y otras probables maneras.\nDi Lazzaro obtiene la oxidación-deshidratación de la fibrilla del lino mediante luz ultravioleta al parecer sin aumento apreciable de la temperatura.\n[“Yo soy la luz del mundo; el que me sigue, no andará en tinieblas, sino que tendrá la luz de la vida”. Juan 8.12:  ]\nCarlos\n\n","date":"July 30, 2012 at 9:26 pm","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But."},{"author":"corneliotel","post":"El SUDARIO DE OVIEDO, 83×53 cm, está bien documentado desde el siglo VII d.C, y estando  lleno de manchas de sangre de distintas intensidades y tonos es un buen ejemplo para establecer comparaciones.\n\nCarlos Otal\n\n","date":"April 6, 2013 at 10:26 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"author":"corneliotel","post":"Si Colin consigue reproducir manchas de sangre, alguna con halo de suero, de manera similar a las que aparecen en la Sábana Santa, habrá realizado el MEJOR TRABAJO realizada hasta ahora sobre la Sábana.\n¡Inténtelo, Colin!. Vale cualquier método.\nOtros estudiosos lo han intentado durante muchos años.\n\n","date":"July 15, 2012 at 11:15 am","url":"https://shroudstory.com/2012/07/15/why-not-carbon-date-the-blood-on-the-shroud-of-turin/","cat":"blood_studies","title":"Why not carbon date the blood on the Shroud of Turin?"},{"author":"corneliotel","post":"¡Congratulations, Yannick!\nDaveb, es una “desmaterialización-rematerialización”, probablemente instantánea en el tiempo que eludiría el “burst” de energía…….\n\n","date":"July 28, 2012 at 9:23 pm","url":"https://shroudstory.com/2012/07/28/yannick-delights-with-another-great-paper/","cat":"blood_studies","title":"Yannick Delights with Another Great Paper"}],"dating":[{"author":"corneliotel","post":"“…..it is understood that 3 cm2 has been retained by Prof. Gonella, and additional unnconsumed material may still be in the hands of the three laboratories that performed the dating measurements”. \n“Draft Protocol for future examinations of the Shroud of Turin”.(3 october 1988).\nhttp://freepages.religions.rootsweb.ancestry.com/~wmeacham/sturp88.pdf\n\n","date":"July 27, 2012 at 9:35 am","url":"https://shroudstory.com/2012/07/27/savage-treatment-in-randi-land/","cat":"carbon_14_dating","title":"Savage Treatment in Randi Land"}],"events":[{"author":"corneliotel","post":"Aunque no tiene relación con el post, creo muy interesante este vídeo que muestra la actitud de los cardenales alemanes con el Papa Benedicto XVI……..\n¡Vaya “basura” de cardenales!\n\nCarlos Otal\n\n","date":"March 1, 2013 at 3:35 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"author":"corneliotel","post":"Yannick escribe: “…….. a burst of light or a burst of another form of energy …..”\nBurst!\nBurst?\nPor qué “a burst”?\n¿quizás para intentar DESACREDITAR a los que creen en la posibilidad de una energía física?\nCarlos Otal\n\n","date":"March 3, 2013 at 5:37 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"author":"corneliotel","post":"¡Muy bien, Kelly y Daveb!\nCarlos Otal\n\n","date":"March 4, 2013 at 3:45 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"}],"history":[{"author":"corneliotel","post":"Lo he contado ya hace unos días en el blog de Dan, ahora lo cuento en el mío\nhttp://lasabanaylosescepticos.blogspot.com.es/\nCualquiera que haya sido el mecanismo de formación de la imagen, natural o sobrenatural, de naturaleza física o de naturaleza química, la imagen es posible (y muy probable) que haya tenido un periodo de latencia de meses, años e incluso siglos.\nTanto los experimentos del ENEA con radiación UV (hipótesis física), como la “para mi improbable” reacción de Maillard propuesta por Rogers (hipótesis química) contemplan periodos de latencia en la aparición del COLOR.\n¿Siglos?\nIncluso la propuesta excéptica lo contempla; para el profesor de química Luigi Garlaschelli, para quien la imagen fue en principio una PINTURA, las impurezas ácidas acompañantes del pigmento ocre rojo con el que se pintó la imagen serían las responsables de la oxidación-deshidratación de las fibrillas del lino que proporcionan el color amarillo de las fibras que configuran la imagen ACTUAL, que sería muy distinta de la pictórica original.\n¿Qué cabría esperar de una imagen que hubiera tenido un periodo de latencia de siglos?\n– Una Sábana que no mostraría imagen en principio, sino sólo las manchas de sangre. \n– La cabeza y el rostro sería lo primero en ser reconocible al cabo de unos siglos en tanto el resto de la figura no sería todavía interpretable como tal figura corporal, (sólo una imagen del rostro producto del sudor y de la sangre de un Jesús vivo) aunque se iría abriendo la idea de que la gran mancha de sangre sería consecuencia de la lanzada en el costado y se relacionaría con las otras manchas de sangre de la Sábana.\n(no hay elementos de juicio para sospechar que los ojos están cerrados)\n-Las primeras interpretaciones no habrían pues relacionado la sábana con una mortaja funeraria al no ser reconocible la figura corporal, ya que sólo después del año mil, y ya en Constantinopla toda la imagen TERMINARÍA siendo visible y siendo reconocible como mortaja funeraria, la Sábana de Constantinopla.\nBajo esta óptica, una imagen latente que tardó varios siglos en empezar a ser visible y varios siglos en completarse, las contradicciones entre las diversas narraciones parecen ya no ser tales y se entendería perfectamente la evolución de la iconografía al respecto con anterioridad al 1350.\nCarlos Otal\n\n","date":"August 15, 2012 at 6:34 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"author":"corneliotel","post":"Me he tenido que volver a “loguear” y ahora aparezco como “corneliotel\nSoy “co”, Carlos Otal\n\n","date":"March 15, 2012 at 9:39 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”"},{"author":"corneliotel","post":"Dan, hay un fenómeno MUY curioso que describió hace algunos años un comentarista de nick Tony. Solicitó ayuda pero sólo obtuvo burlas.\nSe produce en las pantallas de los ordenadores portátiles, ignoro si son TFT o LCD (entiendo muy poco de ordenadores). El portatil mío es un HP Pavilion de 17 pulgadas y tendrá 6 o 7 años (ignoro si en los modernos se produce el fenómeno).\nSi observamos el rostro del Hombre de la Sábana ( por ejemplo el “Face only vertical” en el Shroud Scope de Mario Latendesse) y vamos inclinando la pantalla del ordenador hasta el máximo y luego el propio ordenador, vamos como la imagen pasa del negativo al positivo ( o viceversa) paulatinamente, “como si” se fueran SELECCIONANDO por CAPAS las intensidades tonales permitiendo observar MEJOR detalles que pasan inadvertidos.\nEl fenómeno, además de BELLO, creo que merecería atención por parte de los que entienden del tema (pantallas de ordenadores)\n\n","date":"March 15, 2012 at 9:36 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”"},{"author":"corneliotel","post":"La PRIMERA imagen de Jesús “loin-Cloth” es del año 420-430, como muestro en mi blog:\nhttp://lasabanaylosescepticos.blogspot.com.es/2009/03/la-lanzada-en-el-costado-1.html\nCarlos\n\n","date":"July 26, 2012 at 6:50 pm","url":"https://shroudstory.com/2012/07/17/paper-chase-all-sorts-of-papers/","cat":"history","title":"Paper Chase: All sorts of papers"},{"author":"corneliotel","post":"Muy interesante, Max.\n\n","date":"March 17, 2012 at 4:54 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”"},{"author":"corneliotel","post":"Gabriel:\na.-Las 36-48 horas post-morten ( probablemente menos horas) marcan el límite en que la Sábana comenzaría a impregnarse por los líquidos de la DESCOMPOSICIÓN, lo cual no se observa en la Sábana.\nb.-Creo que Rogers pensaba en una reacción de Maillard de inicio MUY RÁPIDO, con temperatura corporal muy alta y aminas pesadas MUY PRECOCES (cadaverina y putrescina):\n“The bodies are quite dry as a result of the hyperthermia. Many bodies are found at high temperature in closed automobiles or lying on the desert in the sun. Materials that are stable at normal room temperatures (about 22°C) can react rapidly at 41-43°C. Many simple chemical processes double (or even triple) their rates for each 10°C (18°F) increase in temperature. A dehydration-type of reaction could be expected to be about three times faster at normal body temperature than at room temperature and four to nine times faster at about 41°C.”\n“Scientific method applied to the Shroud of Turin. A review”Raymond N. Rogers* and Anna Arnold \ny\n“The sample was then treated for 10 minutes with ammonia vapour: a very light colour could be observed on the top surface after standing 24 hours at room temperature. To increase the reaction rate, a sample was treated at 66 ºC for a few minutes (Figure 2 above). In these conditions the development of colour is very clear and the most intense colour appears in the ring on top. Some colour appears around the ring on the back surface; however, the centre of the back is nearly white.”\n“The Shroud of Turin: An Amino-Carbonyl Reaction (Maillard Reaction) ” Rogers, Arnoldi\nc.-Pienso que Rogers NO SABÍA como INTERRUMPIR de manera NATURAL su reacción de Maillard. ( ya he comentado tiempo atrás que no se dan las circunstancias apropiadas en el Hombre de la Sábana para una reacción de Maillard).\nCreo haber leído lo que indica Dan, pero no recuerdo en dónde. Las objeciones a esa hipótesis parecen elementales:\nNO HAY AGOTAMIENTO de sacáridos reactivos. Sólo 1 a 3 fibrillas por hilo están afectadas por el color ¡POR CADA HILO AFECTADO POR EL COLOR!, por lo que quedarían INFINIDAD de fibrillas CON RECUBRIMIENTO de polisacáridos reactivos que NO HAN SIDO AFECTADAS .\nNO HAY DISMINUCIÓN de aminas reactivas, por el contrario su concentración va aumentando.\nCarlos Otal\n\n","date":"August 9, 2012 at 7:26 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?"},{"author":"corneliotel","post":"Yannick:\nYa he comentado en muchas ocasiones que no se dan en el Hombre de la Sábana las circunstancias apropiadas para una reacción de Maillard….. y por el momento es una hipótesis NO demostrada el que en el tejido de la Sábana se encuentre el revestimiento de sacáridos reactivos necesarios para esa reaccción.\nPero la finalidad de mi comentario, yo soy “perro viejo”, era que el LECTOR tuviera una idea clara de QUÉ SE ESCONDE detrás de cada propuesta, en este caso qué se esconde tras la hipótesis de la reacción de Maillard.\nSuponía cúal era el pensamiento de Rogers y me alegra el que usted me lo confirme.\n[Quote from Carlos : “-To the Rogers proposal be scientific, the Maillard reaction would have been interrupted suddenly by the withdrawal or the theft of the corpse of Jesus within 36-48 hours of their stay in the Sepulchre.”\nMy answer : Effectively, that’s what Rogers was assuming with his hypothesis, with the exception of one thing : The assumption of the maximum time before the body had to leave the Shroud is in fact 72 hours instead of 36-48 hours, because many studies have showed that the liquid phase of putrefaction can start between 36 to 72 hours, DEPENDING ON MANY FACTORS. In page 116 of his book, Rogers say : “Vass et al. also report that putrefaction (structural degradation) starts between 36 and 72 hours after death…” And he add : “Perhaps we can assume that the cloth could not have been in contact with the body for more than about three days.”]\nEl científico honesto no debe dejarse influenciar por ningún aspecto religioso, Delage fue un magnífico ejemplo, y Rogers honestamente manifestó que su hipótesis NO JUSTIFICABA la imagen corporal, sino tan sólo el COLOR de la fibrilla afectada en su recubrimiento de impurezas.\nUna reacción de Maillard que NO parece ser viable y que NO justifica la imagen.\nSi la formación de la imagen se debiera a la reacción de Maillard propuesta por Rogers:\n1.- El Hombre de la Sábana ( Jesús de Nazaret) NO HABRÍA RESUCITADO, su cuerpo habría sido retirado o robado.\n2.- Los Evangelios contarían GRANDES MENTIRAS ( apariciones de Jesús, ascensión, etc, etc).\n3.- El Cristianismo se basaría pues en una GRAN MENTIRA.\nPara ser la reaccion de Maillard una hipótesis que NO justifica la imagen , admitirla como válida resulta bastante MÁS DAÑINA al pensamiento cristiano que las hipótesis de los ADVERSARIOS de la Sábana, McCrone, Nickell, Garlaschelli, Lombatti etc, etc, o que los resultados de la datación por el C14, ya siendo la Sábana una falsificación medieval, no afecta a aquellas cosas que son los pilares de la Fe cristiana.\n¿Comprenden los lectores?\nCarlos Otal.\n\n","date":"August 10, 2012 at 7:25 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?"},{"author":"corneliotel","post":"Todo esto suena a PATALETA escéptica ¡ja, ja, ja..!\nLos científicos favorables a la autenticidad de la Sábana son siempre “pseudo científicos”, carentes de formación académica, hacen mal las cosas…¡ja, ja ja…!\n¡Y esto suelen decirlo los escépticos que CARECEN de formación científica generalmente !\nEscribía William Meacham en 1983:\n“Beyond misunderstanding lies invective, and the comments of Cole, Nickell, Schafersman, and Mueller are phrased in an emotive tone not conducive to reasoned discussion. They bristle with intemperate rhetoric: “gullibility,” “credulous bias,” “notoriously subjective,” “sheer whimsy,” “blatant example of human credulity,” “conceit,” and “so-called evidence,” to mention but a few examples. Doubts about personal competence or expertise emanate from Schafersman (graduate student) and Nickell (English instructor) like stones from inside a glass house: Frei’s work is “questionable,” STURP members may be pseudo-scientists, Heller and Adler are “nonforensic scientists,” Filas and Whanger “nonexperts,” and Bucklin and Gambescia “religious devotees of the ‘relic.’ ” Those with views supporting the skeptics are mirabile dictu described in lavish terms: the Turin Commission consisted of “forensic experts;” McCrone is “probably the best-known forensic microbiologist in the world” and “a distinguished expert”; Baden is not only “one of America’s foremost medico-legal experts,” but “one of the world’s most distinguished pathologists.” Naturally, the former group are subject to a pro-authenticity bias, make “subjective inferences,” and find “artifacts of their own hopes,” whereas the latter conduct “impressive analyses” and make discoveries and “positive identifications.” I leave it to the reader to decide whether this is the type of rhetoric usually associated with a carefully reasoned argument, not to mention a “powerful case.””\nYo no soy un científico, pero soy médico y TENGO una formación científica y un “curriculum vitae” bastante envidiable, que abarca entre otras muchas cosas desde la medicina clinica hasta la docencia como profesor universitario.\nCreo que teniendo en cuenta el GRAN NÚMERO de médicos que HABIENDO ESTUDIADO la Sábana están convencidos de su autenticidad ( la opinión SIN ESTUDIAR tiene un valor nulo), debo llegar a la conclusión de que hay que ser MUY ESTÚPIDO ( me refiero a NOSOTROS LOS MÉDICOS) para dejarse ENGAÑAR por la pretendida impronta de un ser humano ¡que es una falsificación!.\nUna profesión, la Medicina, llena de estúpidos ignorantes que no distinguen una impronta humana de una falsificación pictórica o realizada con una escultura….¡ ja, ja, ja…!\nDesde que la Sábana Santa “entró” en el estudio científico de mano del Profesor Delage en 1902, médico, zoólogo, Profesor de Anatomía Comparada en la Sorbona, miembro de la Academia de Ciencias de París y acreditado agnóstico, numerosísimos profesionales de la Medicina se han sentido atraídos por ella.\nHe confeccionado una relación de médicos ilustres, muchísimos de ellos catedráticos o profesores de Universidad, que avalan la concurrencia en el Hombre de la Sábana de aspectos médicos que no son reproducibles por vía del arte, que corresponden a la existencia real de un ser humano que ha tenido contacto con la Sábana, que ha dejado en ella las huellas de su sangre y que por una vía que escapa al conocimiento actual de la Ciencia, ha dejado impresa en ella la impronta de SU imagen.\nIndico en muchos de ellos algún trabajo relevante para una mejor identificación por el lector.\n-Accetta A. Nuclear Medicine and its relevance to the Shroud of Turin.\n-Baima Bollone.P. The Shroud under the microscope: Forensic examination\n-Ball DA. The crucifixion and death of man called Jesus.\n-Barbet P. La Passion de Jésus-Christ selon le chirurgien.\n-Belcet F, Filippa-Borrono-Bona, Manfredi, Mattio. Riflessioni del chirurgo sull ferita toracica.\n-Bucklin R. An autopsy on the Man of the Shroud.\n-Brillante C. La fibrinolisi nella genesi delle impronte sindoniche.\n-Davis CT. The crucifixion of Jesus: the passion of Christ from a medical point of view.\n-Delfín Villaláin J. Estudio de la rigidez cadavérica que presenta la Sábana de Turín.\n-Canale M. Rilievi e considerazione sul DNA presente sulla Sindone.\n-Caminals A. Estudio de la crucifixion según la Sábana Santa.\n-Cappi M. La Sindone dalla A alla Z.\n-Cinquemani N, Cicchetti S. Le dopple immagini sulle mani dell´Uomo della Sindone.\n-Coppini L. Le lesione da punta ed il colpo di lancia visibili sulla Sindone. Rilievi di anatomia topografica e radiologica.\n-Dellesite G. Cause fisiche della morte della Sindone: medicina e certezze.\n-Domínguez J J. La Síndone. Estudio médico.\n-Edwards WD. On the physical cause of death of Jesus.\n-Fiori R. La lesioni da inchiodamento ai piedi dell´Uomo della Sindone.\n-García Blazquez M. La búsqueda científica de Dios.\n-Garza-Valdes L. Wood remnants in the blood of the occipital region of the Man on the Shroud of Turin.\n-Gilly R. La Pasión de Jesús. Conclusiones de un médico.\n-Giraud F. Le Saint Suaire, étude medicale et scientifique.\n-Goldoni. Estudio hematológico sobre las muestras del Sudario tomadas en 1978.\n-Guillaud Vallee O. Position en opposition du ponce chez l´homme du linceoul étude critique des travaux de Barbet.\n-H. Ur Rerhman. Did Jesus Christ die of pulmonary embolism? a rebuttal.\n-Hynek R W. Lo que revela el Sudario a un convertido.\n-Huisman H. The Holy Shroud of Turin. Injury of the right eye.\n-Judica Cordiglia G. L´Uomo della Sindone e il Gesu dei Vangeli?\n-Larato G. L´ignominiosa flagellazione secondo la Síndone: rilievi di fisiopatologia clinica.\n-LeBec A. The death of the cross: a physiological study of the passion of Our Lord Jesus Christ.\n-Legrand A. Du Gibet du Golgotha a ceux de Dachau.\n-Lavoie G. Forensic studies of the blood marks on the Shroud of Turin.\n-Lévêque J. Le Saint Suaire revisité.\n-Lorente J A. Examen forense al cuerpo de Jesús.\n-Mérat P. The nailing of the feet on the Cross.\n-Milanesio A. Le lesioni da inchiodamento agli arti dell´Uomo della Sindone.\n-Novelli G. La Síndone un caso ancora aperto.\n-Palacios Carvajal J. La Sábana Santa.Estudio de un cirujano.\n-Puorrat O. The localization of the chest wound on the right side.\n-Revidatti D. Anatomía de la Crucifixión. Las manos.\n-Rodante S. Medico-necroscopic enquiry of wounds from the crowning with thorns on a medieval painting. Comparison with corresponding image on the Shroud.\n-Rubén Darío Camargo R. Fisiopatología de la muerte de Jesucristo.\n-Thibault Heimburger, Le Suaire et la Science.\n-Signorini R. Alla ricerca della prova provata.\n-Suárez Lledó Alemany J. Informe médico legal sobre el Sudario de Oviedo y la Síndone de Turín.\n-Solas J. Blood stains on the Shroud.Distinctive characteristics. The problem of their transfer.\n-Truman D. The crucifixión of Jesús. The passion of Chris from a medical point of view.\n-Whanger A. Radiological aspects of the Shroud of Turin.\n-Wilkinson J. The physical cause of the death of Christ.\n– Barragán Jain, Caselli, Cameron, Clerq J M, De Vicentiis, Delgado  Roig, Gambescia J, Igartus, Jewell H J, La Cava, Lagraña R, Liébana J, López Gómez L, Marchand, Michel W, Morano H, Novelli, Notowski, Pugeaut R, Sáez Rodriguez, Sava Anthony , Stroud Willian, Terraes A, Tarantini D, Valdés, Wasenar R, Willis D .\nRepresentan tan sólo la “punta del iceberg”, pues son un sinfín los médicos profesionalmente muy bien acreditados, entre los que me cuento, los que hemos reconocido en la figura del Hombre de la Sábana, cruelmente martirizado, todas las características propias de un ser humano que la Sábana envolvió, Jesús de Nazaret.\n\n","date":"July 1, 2012 at 1:59 pm","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"author":"corneliotel","post":"El angel tiene 6 dedos ( 5 dedos se ven + 1 dedo pulgar que está oculto).\nCarlos Otal\n\n","date":"March 19, 2013 at 1:29 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","title":"The Curious ‘a’ in the Hungarian Pray Manuscript"},{"author":"corneliotel","post":"” He is often aware that experts have refuted some of his claims, but refuses to change his mind – because these experts are generally not very inspiring to him.”\n¿Qué expertos?.\n\n","date":"June 30, 2012 at 12:44 pm","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."}],"image":[{"author":"corneliotel","post":"1.- Es OBVIO que SIN RESURRECCIÓN no podríamos contemplar la impronta corporal de Jesús. Los productos de la descomposición del cuerpo hubieran producido una mancha informe.\n2.- Leyendo los interesantes comentarios de Heimburger y Colin sobre la reacción de Maillard, iba  a participar con algún comentario……….. pero me ha surgido una REFLEXIÓN que creo va a suscitar POLÉMICA.\n3.- Sea cual fuere el mecanismo de formación de la imagen, químico o físico, el periodo de LATENCIA ha podido ser ( y probablemente ha sido) EXTRAORDINARIAMENTE LARGO, incluso de SIGLOS.\n4.- Esto explicaría que en DISTINTAS ÉPOCAS la Sábana habría presentado ASPECTOS DISTINTOS. ( las zonas de MAYOR SATURACIÓN serían las primeras en aparecer)\n5.- Épocas en que la Sábana SÓLO mostraría las MANCHAS DE SANGRE.\n6.- Épocas en que la Sábana SÓLO mostraría las MANCHAS DE SANGRE, el  ROSTRO de manera DIFUSA y algunas manchas corporales no coherentes y por tanto POCO INTERPRETABLES por el observador.\n7.- Etc, etc, etc…….\n8.- Relatos como el de Gregorio Referendarius (SABIO RELATO) ofrece un nuevo significado bajo ÉSTA perspectiva……..\nCarlos Otal\n\n","date":"August 12, 2012 at 7:18 am","url":"https://shroudstory.com/2012/08/11/colin-berry-so-how-could-ray-rogers-have-got-it-so-wrong/","cat":"image_theory","title":"Colin Berry: So how could Ray Rogers have got it so wrong?"},{"author":"corneliotel","post":"Matt:\nA Colin Berry le sobra SAGACIDAD……pero le falta CONOCIMIENTO.\nEn 1534 el Papa Clemente VII ordenó al cardenal Luis de Gorrevod que verificara el estado de la Sábana Santa tras el incendio de 4-XII-1532.\nLa verificación se celebró el 15-IV-1534. Se abrió la caja-relicario que contenía la Sábana ( desde el incendio NO se había abierto al parecer por temor de que se hubiera destruído), se extendió sobre una mesa y 12 testigos que conocían bien la Sábana Santa, la habían tocado y mostrado al público antes del incendio, testificaron que era la misma Sábana que ellos conocían con anterioridad al incendio.\nY esa Sábana anterior al incendio de 1532 ( la copia de Lier es de 1516) ya MOSTRABA las manchas de sangre que nosotros conocemos.\nExiste un precioso documento escrito por la Abadesa del convento de las clarisas de Chambéry, Louise de Vargin en que se relatan los hechos de la reparación de la Sábana y su descripción e incluso la interpretación de lo observado. Las monjas clarisas estuvieron en contacto permanente con la Sábana durante 15 días, si bien sólo 4 monjas podían tocar y remendar la Sábana ( entre ellas Louise de Vargin).\nEste documento demuestra 2 cosas:\n1.- La enorme IMPORTANCIA que tenía la Sábana Santa como RELIQUIA para la Iglesia Católica.\n2.- La presencia de las MANCHAS de sangre en los sitios en que hoy las conocemos.\nEl precioso y extenso documento escrito por la  madre Abadesa Louise de Vargin :\nhttp://www.shroud.it/CLARISSE.PDF\nhttp://www.shroud.it/CLARES.PDF\nCarlos.\n\n","date":"July 29, 2012 at 10:05 pm","url":"https://shroudstory.com/2012/07/28/is-the-non-fluorescent-body-image-on-the-shroud-of-turin-a-valid-indicator/","cat":"image_theory","title":"Is the non-fluorescent body image on the Shroud of Turin a valid indicator?"},{"author":"corneliotel","post":"La hipótesis de Rogers, aunque a Yannick le DISGUSTE, es insostenible……Veremos que cuenta el químico Denis Mannix en la reunión de la BSTS.\n-La producción de aminas “pesadas”, cadaverina y putrescina se inician en la fase de PUTREFACCIÓN, y esa fase NO comienza hasta que desaparece el  RIGOR MORTIS. El hombre de la Sábana presenta rigor mortis.\nLa fase de putrefacción necesita el concurso de bacterias aerobias y anaerobias y el ph ácido por las elevadas cifras de ácido láctico mientras dura el rigor mortis inhibe el crecimiento de las bacterias.\nNO hay formación de cadaverina y putrescina que precisa la hipótesis de Rogers porque NO hay putrefación.\nRigor mortis y putrefacción NO son compatibles. Así se estudia en el Cronatodiagnóstico, determinación del tiempo transcurrido desde la muerte.\n-En las muertes traumáticas y con shock múltiple la “Tríada de la muerte” la constituye la ACIDOSIS, HIPOTERMIA y COAGULOPATÍA.\nLa HIPOTERMIA suele establecerse entre los 34- 30 grados centígrados.\nPero aún admitiendo en el momento de la muerte todo lo contrario, una HIPERTERMIA de 41 grados centigrados, la temperatura corporal disminuye 1 grado centigrado por cada hora transcurrida después de la muerte durante las primeras 12 horas, y 1/2 grado centigrado por cada hora transcurrida después de la muerte después de las primeras 12 horas.\n– Así que a las pocas horas de la muerte la TEMPERATURA NO PARECE SER COMPATIBLE con una reacción de Maillard que además CARECE de la participación de aminas pesadas (cadaverina, putrescina etc)……….\n\n","date":"July 8, 2012 at 10:01 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis"},{"author":"corneliotel","post":"Ignoro el por qué en mis comentarios aparezco unas veces como “corneliotel” y otras veces como “carlos”.\n\n","date":"July 8, 2012 at 10:04 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis"},{"author":"corneliotel","post":"La imagen de la CARA por contacto es IMPOSIBLE.\n[la demostración es ELEMENTAL, SIMPLE Y SENCILLA y creo que usted y otros muchos NO lo entienden]\nMida usted con el Shroud Scope cualquier distancia en la cara entre puntos equidistantes, desde uno a otro lado y que pasen por la nariz, por ejemplo ENTRE LA PARTE MÁS EXTERNA DE AMBOS PÓMULOS.\nLa distancia obtenida, menor de 11 centímetro, es IMPOSIBLE en una imagen por contacto.\nPuede hacer MUCHAS otras mediciones, por ejemplo la línea externa del cabello desde un lado al otro lado de la cabeza, etc,etc, etc. TODAS las medidas que obtenga serán IMPOSIBLES en una imagen de contacto, porque la imagen NO ES POR CONTACTO.\nCarlos\n\n","date":"July 10, 2012 at 5:10 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis"},{"author":"corneliotel","post":"“I really don’t think that Ray Rogers hypothesis goes against the idea of a vertical projection that COULD have caused that kind of result…”\nRogers no habría admitido una proyección ORTOGONAL al plano de la Sábana……..\nLa “vertical projection” sólo es posible si la Sábana está plana ( Mario Latendresse disiente), pero son las MEDIDAS las que deben decidirlo.\nLa nariz (NOSE) no son unos PUNTOS, es una gran MASA de color, vertical, en el centro de la cara.\nLos PÓMULOS Y MEJILLAS no son unos puntos, son 2 grandes MASAS de color a ambos lados de la nariz.\nEl CABELLO no son unos puntos, son 2 grandes MASAS de color a ambos lados de la cara.\nNO SON PUNTOS, son  GRANDES MASAS las que habrían tenido contacto con la Sábana para admitir la imagen por contacto y la PROYECCION VERTICAL…….pero las medidas realizadas entre puntos opuestos en la cara que ATRAVIESEN la nariz (NOSE) dan resultados NO POSIBLES en la imagen de un SER REAL que sea una proyección vertical por contacto con la Sábana.\nSÓLO son coherentes esas medidas con una proyección ortogonal al plano de la Sábana.\nLas medidas realizadas sobre la cabeza que da Mario Latendresse en “The Turin Shroud Was Not Flattened Before….” son medidas NO POSIBLES en un SER REAL en contacto (imagen por contacto) con la Sábana.\nEn la Fig 1  de su trabajo, Mario determina los vectores F, G y H, que atraviesan la nariz (NOSE).\nF.- Width of face, tip nose……11,6 centímetros. NO POSIBLE en imagen por CONTACTO.\nG.-Width of face-hair………….21,1 centímetros.¡NO POSIBLE! en imagen por CONTACTO.\nH.-Head height…………………..25,1 centímetros. NO POSIBLE en imagen por CONTACTO.\nCualquier medida que se haga sobre la Sábana atravesando la nariz (NOSE) pone en EVIDENCIA que el contacto no ha podido producirse para generar la imagen.\nPara la demostración NO SE PRECISA un Laboratorio ni grandes científicos.\nSE PRECISA SÓLO una cinta de medir, el rostro propio o el rostro de familiares o amigos……y la voluntad de realizar la medición.\n¿Conoce algún adulto de conformación normal, de estatura entre 1,70-1,80 metros, con abundante cabello, que presente esas medidas apuntadas F, G y H  sobre su cabeza?\nNo lo encontraría porque no son posibles.\nEsas medidas sólo SON COMPATIBLES con la proyección ORTOGONAL de un cuerpo al PLANO de la Sábana.\nCarlos\n\n","date":"July 12, 2012 at 7:43 am","url":"https://shroudstory.com/2012/07/11/rejecting-all-the-energetic-hypothesis-for-the-shroud-of-turin-image/","cat":"image_theory","title":"Rejecting all the “energetic” hypothesis for the Shroud of Turin image"},{"author":"corneliotel","post":"Yannick ¿ha medido la distancia entre la parte más externa del PÓMULO DERECHO y la parte más externa del PÓMULO IZQUIERDO?\nTiene alguna EXPLICACIÓN que justifique la distancia, inferior a 11 centímetros, que se mide entre ellos?\n¿Sobrenatural?\n\n","date":"July 11, 2012 at 6:28 pm","url":"https://shroudstory.com/2012/07/11/rejecting-all-the-energetic-hypothesis-for-the-shroud-of-turin-image/","cat":"image_theory","title":"Rejecting all the “energetic” hypothesis for the Shroud of Turin image"},{"author":"corneliotel","post":"Creo que llamar temperatura ambiente ( room temperature) a la temperatura de 37C es un EXCESO.\nEn Wikipedia en español se lee para “Temperatura ambiente”:\n“Para cálculos científicos, la temperatura ambiente es usualmente tomada como 25 grados Celsius (293 o 298 Kelvin, 68 o 77 grados Fahrenheit).Por conveniencia numérica, 300.00 K (26.85 °C, 80.33 °F) es utilizado ocasionalmente, sin ser especificada como “temperatura ambiente”. Sin embargo, la temperatura ambiente no es un término científico uniformemente definido, a diferencia de la Temperatura y Presión Estándar, o TPE, que tiene definiciones ligeramente diferentes.\nLa temperatura media anual en Jerusalén es de 16 C, la media del mes de Enero es en torno a los 10 C y en Agosto en torno a 27 C.\nLas casas-cueva, arquitectura “troglodítica”, en España mantienen temperaturas entre 17-23 C ( son muy famosas entre otras las cuevas del Sacromonte en Granada, España).\nEn pleno desierto de Tabernas, Almería, España, la Casa-cueva Calatrava, mantiene la temperatura en torno a los 20 C.\nParece que la cueva en que fue sepultado Jesús no debiera tener temperatura ambiente por encima de estas cifras…….\nCarlos Otal\n\n","date":"August 13, 2012 at 8:57 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature."}],"opinion":[{"author":"corneliotel","post":"-La existencia de la “pared celular primaria” es un hecho CIERTO.\n-La existencia de una capa de impurezas es una HIPÓTESIS.\n¿Pueden tener la misma credibilidad las hipótesis que se sustenten en ello?\n\n","date":"May 14, 2012 at 12:49 pm","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","title":"Comment of the Week by Thibault Heimburger"},{"author":"corneliotel","post":"Aceptar la autenticidad de la Sábana implica forzosamente, por un principio de COHERENCIA, aceptar el carácter sobrenatural de la impresión de la imagen, porque ninguna explicación natural puede darse al DESPLAZAMIENTO de la Sábana preciso para esa impresión.\nBarbet y Rogers NO son demasiado compatibles…..\nBarbet creía en el carácter sobrenatural de la Sábana, que demostraba la Resurrección de Jesús.\nLas manchas de sangre son REALES y han precisado del contacto íntimo con el cuerpo para poder “calcarse”.\nLos “regueros” o “calcos” de sangre sobre el cabello en la imagen frontal son IMPOSIBLES.\nDe ser posibles la Sábana sería una falsificación, y NO es así.\nMidamos la distancia horizontal entre cualesquiera puntos, a uno y otro lado del rostro, de los “regueros” de sangre que corren por los cabellos del Hombre de la Sábana utilizando la magnífica herramienta que nos brinda Mario Latendresse en su Shroud Scope:\nhttp://www.sindonology.org/shroudScope/shroudScope.shtml\nYo he utilizado la fotografía de Durante del 2002. Entre los 2 puntos medidos ( se pueden utilizar los que el lector quiera) obtengo una distancia de 15,47 cm, casi quince centímetros y medio.\nEsa distancia es IMPOSIBLE que medie entre “esos” puntos del cabello a uno y otro lado de la cara. Sobre mi cabeza, con estatura cercana al 1,80, utilizado una cinta métrica flexible ni siquiera alcanzan esos 15,47 cm desde el cabello a la punta de la nariz…..\nEsas manchas de sangre que aparecen en el cabello estaban cuando se produjeron sobre LAS MEJILLAS y la Sábana ENVOLVÍA el rostro de Jesús.\nEn el evento de la Resurrección la Sábana se ha DESPLEGADO y las manchas de sangre que estaban sobre las mejillas, al imprimirse la imagen, han quedado desplazadas a la zona en que se ha impreso la imagen del cabello.\n¿Alguna otra explicación posible?\n[He abierto un post en mi blog para mostrar fotografías de una medición, por aquello de que “más vale una imagen que cién palabras”\nhttp://lasabanaylosescepticos.blogspot.com.es/2012/05/natural-o-sobrenatural.html ]\nCarlos Otal.\n\n","date":"May 13, 2012 at 6:03 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","title":"Comment of the Week by Thibault Heimburger"},{"author":"corneliotel","post":"Aceptar la autenticidad de la Sábana implica forzosamente, por un principio de COHERENCIA, aceptar el carácter sobrenatural de la impresión de la imagen, porque ninguna explicación natural puede darse al DESPLAZAMIENTO de la Sábana preciso para esa impresión.\nBarbet y Rogers NO son demasiado compatibles…..\nBarbet creía en el carácter sobrenatural de la Sábana, que demostraba la Resurrección de Jesús.\nLas manchas de sangre son REALES y han precisado del contacto íntimo con el cuerpo para poder “calcarse”.\nLos “regueros” o “calcos” de sangre sobre el cabello en la imagen frontal son IMPOSIBLES.\nDe ser posibles la Sábana sería una falsificación, y NO es así.\nMidamos la distancia horizontal entre cualesquiera puntos, a uno y otro lado del rostro, de los “regueros” de sangre que corren por los cabellos del Hombre de la Sábana utilizando la magnífica herramienta que nos brinda Mario Latendresse en su Shroud Scope:\nhttp://www.sindonology.org/shroudScope/shroudScope.shtml\nYo he utilizado la fotografía de Durante del 2002. Entre los 2 puntos medidos ( se pueden utilizar los que el lector quiera) obtengo una distancia de 15,47 cm, casi quince centímetros y medio.\nEsa distancia es IMPOSIBLE que medie entre “esos” puntos del cabello a uno y otro lado de la cara. Sobre mi cabeza, con estatura cercana al 1,80, utilizado una cinta métrica flexible ni siquiera alcanzan esos 15,47 cm desde el cabello a la punta de la nariz…..\nEsas manchas de sangre que aparecen en el cabello estaban cuando se produjeron sobre LAS MEJILLAS y la Sábana ENVOLVÍA el rostro de Jesús.\nEn el evento de la Resurrección la Sábana se ha DESPLEGADO y las manchas de sangre que estaban sobre las mejillas, al imprimirse la imagen, han quedado desplazadas a la zona en que se ha impreso la imagen del cabello.\n¿Alguna otra explicación posible?\n[He abierto un post en mi blog para mostrar fotografías de una medición, por aquello de que “más vale una imagen que cién palabras”\nhttp://lasabanaylosescepticos.blogspot.com.es/2012/05/natural-o-sobrenatural.html ]\nCarlos Otal.\n\n","date":"May 13, 2012 at 6:08 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","title":"Comment of the Week by Thibault Heimburger"}],"researchers":[{"author":"corneliotel","post":"Summary. — The first goal of this inquiry, carried out on sources of the history of Christic relics, was to discover those among them which might involve the Shroud of Turin, notably so as to fix the vocabulary used. It has thus been established that the frequent identification of the Shroud of Turin with the Mandylion coming from Edessa in Constantinople in 944 was impossible, the two relics being simultaneously conserved in Constantinople from an unknown date on, perhaps from the 11th c. on. Later testimony describing the image on the Mandylion as being of a body and not just of a face rely on an erroneous interpretation of a Latin text, oft repeated at the end of the Middle Ages. The texts (in Latin and in Greek) are cited within a context wide enough to clarify their meaning, and they are translated.\nThey attest the presence of the shroud at Constantinople before 1204.\nEmmanuel Poulle, Les sources de l’histoire du linceul de Turin. Revue critique\nRevue d’Histoire Ecclésiastique, 2009/3-4\n\n","date":"June 15, 2012 at 4:12 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"corneliotel","post":"Menedemo, Poulle estima en efecto que las 2 reliquias son DIFERENTES.\nYo no he estudiado el tema y no tengo por lo tanto un criterio propio.\nLe sugiero la lectura de:\nhttp://www.suaire-turin.com/skylitzesyl.htm\n\n","date":"June 15, 2012 at 5:33 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"corneliotel","post":"¡La desinformación de que hacen gala los escépticos es patética!\n¿De dónde salen los 40 ” burial cloths of Jesus”?\nEl escéptico italiano Antonio Lombatti se refiere al canónigo Ulysse Chevalier, historiador de la Iglesia más conocido por el hallazgo del “Memorandum DÁrcis” (documento no firmado, no sellado y no fechado atribuido al obispo Pierre DÁrcis, y que Chevalier dató en 1389 porque así le convenía).\nUlysse Chevalier escribía en su obra “Le st. suaire de Lirey-Chambéry-Turin et les défenseurs de son authenticité”, p.10. A.Picard et fils, 1902: \n“Le nombre des suaires connus atteint la quarantaine: je laisse a M. de Mély le soin de donner une description de chacun d´eux et d´indiquer les autorités qui attestent son existence.”\nNo eran pues 40, sino 38 los sudarios… como aclara el escéptico Maurice Vernes en la famosa “Controversia de París de 1902”,  Revue scientifique, n° 20 du 17 mai 1902, pp. 613-623: \n“L’abbé Ulysse Chevalier, fort compétent en la matière, a énuméré dix-neuf localités où étaient conservés, soit le linceul du Christ en son entier, soit de très notables portions du drap funéraire. Un archéologue de valeur, M. F. de Mély, est en mesure, pour sa part, d’en citer dix-neuf autres ; un petit nombre sont porteurs d’effigies ou empreintes, notamment celui qu’on exhibait jadis à Besançon et qui a disparu lors de la Révolution.”\n[ La “Controversia de Parí de1902” entre Maurice Vernes y Paul Vignon, con una carta al director de Ives Delage ha sido editada por Dominique Autié (q.p.d), es muy interesante pues se plantea la que será a partir de entonces la postura ESCÉPTICA respecto a la Sábana de Turín\nhttp://blog-dominique.autie.intexte.net/blogs/index.php/2006/04/16/title_9\nDe los 19 “sudarios” que estudió Chevalier solo merecieron su atención 2:\n– la Sábana de Cadouin ( que no tenía ninguna IMAGEN).  \n– la Sábana de Besançon que está documentada desde 1523 (copiada probablemente de la de Lirey y que mostraba sólo la imagen frontal).\nDe los 19 “sudarios” que citó el arqueólogo M. de Mély,  Ulysse Chevalier no valoró ninguno .\nEscribía el escéptico Maurice Vernes en 1902:\n“Parmi les nombreux linceuls du Christ qui ont été vénérés en Europe, celui de Turin, en raison des empreintes qu’il porte, a donné lieu à un rapprochement avec une pièce d’étoffe également désignée à l’attention par la présence d’une effigie, le suaire jadis conservé à Constantinople.”\nEs justamente y precisamente la excepcionalidad de la presencia de la IMAGEN CORPORAL en una pretendida mortaja de Jesús lo que distingue a la Sábana de Turín, al igual que siglo y medio antes había sucedido con la Sábana de Constantinopla, y justa y precisamente esa excepcionalidad la que apunta a su misma identidad. La que hoy conocemos como Sábana Santa.\nLos escépticos MODERNOS han distorsionado lo escrito por Ulysse Chevalier.\nSi el señor Chevalier, Mély o quien fuera hubieran propuesto en 1902 la existencia conocida de cuarenta sudarios, enteros o fragmentarios, no pueden estar fuera del listado de los conocidos en el año 2012 , y NO es conocida la existencia en la Edad Media de sudarios que pretendieran ser la mortaja de Jesús y tuvieran la imagen corporal de Jesús, a excepción de los apuntados, Constantinopla y Turín.\n\n","date":"June 12, 2012 at 6:26 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"corneliotel","post":"Max, entre 1205 y 1308 el ducado de Atenas (tras el saqueo de Constantinopla por los cruzados) fue gobernado por la familia La Roche:\nOtón de la Roche (1205-1225)\nGuido I de la Roche (1225-1263)\nJuan I de la Roche (1263-1280)\nGuillermo I de la Roche (1280-1287)\nGuido II de la Roche (1287-1308)\n\n","date":"June 12, 2012 at 11:44 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"corneliotel","post":"¿Top Secret?\n¿Cúal es esa ” unpublished information”? \n¿Nadie conoce esos contenidos de  “The Night of the Shroud”?\n\n","date":"June 9, 2012 at 11:03 am","url":"https://shroudstory.com/2012/06/09/barrie-schwortz-writes-2/","cat":"news_&_views","title":"Barrie Schwortz writes"},{"author":"corneliotel","post":"El Prof. Giulio Fanti sabe bien lo que hace……y es un RETO a Turín.\nTurín tiene suficiente “material” recogido de la Sábana para poder REPETIR los estudios de Fanti sin necesidad de “tocar” la Sábana.\n¿Realizará Turín los estudios ? Nooooooooooo…….\nCarlos Otal\n\n","date":"March 29, 2013 at 5:41 am","url":"https://shroudstory.com/2013/03/29/barrie-schwortz-biggest-issue-so-far-seems-to-be-the-validity-of-fantis-samples/","cat":"news_&_views","title":"Barrie Schwortz:  Biggest issue so far seems to be the validity of Fanti’s samples"},{"author":"corneliotel","post":"La teoría de la conspiración fue favorecida por la actitud y declaraciones de los responsables de los propios laboratorios……\nEl laboratorio de Zurich preparó para la BBC un montaje fotográfico IMPOSIBLE mostrando las muestras y submuestras que fueron datadas. Aunque se conocía por la descripción que de él hizo Bonnet-Eymard cuando se lo mostró el Prof: Woelfli que lo tenía en su despacho, la foto no fue publicada hasta el 2005 por ETH Life International, newsletter del Swiss Federal Institute of Technology Zurich, al que pertenece el laboratorio que dató la Sábana por el C14.\nhttp://archiv.ethlife.ethz.ch/e/articles/sciencelife/turin.html \n\nLas 3 submuestras Z1.1.1, Z1.1.2 y Z1.1.3  NO PUEDEN PROCEDER  de la muestra Z1.1 (entre otras varias cosas la “raspa” de la “espina de pez” típica del tejido y que aparece en Z1 y en Z1.1, tenía que aparecer en alguna de las 3 submuestras que se “quemaron”……)\nSi alguien conoce la SOLUCIÓN del puzzle, probablemente Colin, que la explique…….\nY si hay ERRORES, que no se han reconocido, en algo tan simple como realizar ESE montaje fotográfico para la BBC, cualquiera sabe qué fue lo que se “quemó”……\n[El Prof. Hull, del laboratorio de Arizona nos sorprendió a todos hace poco tiempo al decirse poseedor de una submuestra que según Nature estaba “quemada” (DATADA)]\n\n","date":"March 18, 2012 at 7:12 pm","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","title":"Welcome to Colin Berry’s new Straw Shedder blog"},{"author":"corneliotel","post":"Pregunta para colinsberry, experto en Industria Alimentaria:\n¿ Inhiben las cifras altas de ácido láctico la producción de vapores de amoniaco y de aminas aromáticas (cadaverina y putrescina)?.\nGracias por la respuesta.\nCarlos Otal.\n\n","date":"May 20, 2012 at 8:41 am","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","title":"The Valencia Dawkins Challenge:  No Consensus on Consensus"},{"author":"corneliotel","post":"+ a.lactico——- INHIBIT———vapor amoniaco, cadaverina, putrescina, etc etc\n(Gracias Dan)\n\n","date":"May 20, 2012 at 9:32 am","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","title":"The Valencia Dawkins Challenge:  No Consensus on Consensus"},{"author":"corneliotel","post":"a.-Yannick CONFUNDE a los lectores:\n-Para ser CIENTÍFICA la propuesta de Rogers, la reacción de Maillard tendría que haber sido INTERRUMPIDA BRUSCAMENTE por la RETIRADA o el ROBO del cadáver de Jesús antes de las 36-48 horas de su permanencia en el sepulcro.\n-De no interrumpirse bruscamente la reacción de Maillard, la “imagen” habría sido una gran MANCHA INFORME por la acción de los productos de la DESCOMPOSICIÓN y la PUTREFACCIÓN del cuerpo de Jesús.\nb.-Yannick SE CONFUNDE:\n-Yannick dice ADMITIR la resurrección de Jesús, la “desmaterialización” del cuerpo de Jesús antes de las 36-48 horas de su permanencia en el sepulcro.\n-Yannick dice admitir la INTERRUPCIÓN SOBRENATURAL de la reacción de Maillard ( la reacción propuesta por Rogers).\n-La hipótesis de una interrupción SOBRENATURAL de la reacción de Maillard NO ES CIENTÍFICA.\nc.- Yannick debe APRENDER a ser coherente.\n-La hipótesis de Rogers es CIENTÍFICA si se interrumpe por un medio NATURAL la reacción de Maillard.\n[lo que NO SIGNIFICA que sea cierta]\n-La hipótesis de Yannick es NO CIENTÍFICA ( interrupción de la reacción de Maillard por la Resurreción ).\nd.-Siendo la Sábana Santa un OBJETO FÍSICO REAL, todo científico que estudie los posibles efectos sobre la Sábana Santa de reacciones “químicas” ( sea Rogers o sea Garlaschelli, etc) o de reacciones “fisicas” ( sea Fanti, Di Lazzaro, Antoacci o el que fuera), será un BUEN científico o será un MAL científico en razón de la METODOLOGÍA que aplique, NO en razón de sus creencias religiosas .Todo científico, creyente o no creyente, sabe que NO EXISTE ninguna energía física o química que pueda RESUCITAR a los muertos.\nCarlos Otal\n\n","date":"August 9, 2012 at 12:05 am","url":"https://shroudstory.com/2012/08/07/and-yannick-responds-to-giulios-comments/","cat":"news_&_views","title":"Yannick Reacts to Special Issue"},{"author":"corneliotel","post":"Gabriel:\nUna vez cesados los procesos de AUTOLISIS, e incluso en ocasiones sin haber cesado, se inician los auténticos fenómenos de DESCOMPOSICIÓN, entre los cuales SÓLO voy a mencionar los que serían RECONOCIBLES en el Hombre de la Sábana:\n1.- la infiltración gaseosa o enfisema, afectando a párpados y labios.\n2.- flictenas pútridas, elevaciones de la epidermis con líquido en su interior.\n2.- desprendimiento de la piel al romperse las flictenas.\n4.-salida del contenido gástrico por la boca y a veces el intestinal por el ano a consecuencia de la presión gaseosa.\nMás de 36-48 horas la producción de GAS es máxima, el ENFISEMA es máximo y la piel empieza a soltar un LÍQUIDO NEGRUZCO propio de la putrefacción.\nLa reacción de Maillard es aquí IRRELEVANTE en la producción de una MANCHA INFORME relacionada con la descomposición cadavérica.\nCarlos\n\n","date":"August 9, 2012 at 6:18 am","url":"https://shroudstory.com/2012/08/07/and-yannick-responds-to-giulios-comments/","cat":"news_&_views","title":"Yannick Reacts to Special Issue"},{"author":"corneliotel","post":"Colin es un individuo MUY INTELIGENTE…….. es lástima que milite en el lado “equivocado”, aunque para él sea más divertido.\nColin escribe:\n“How odd that Shroudology showed not the slightest interest in hydroxyproline, except as “evidence” against scorching, despite Rogers himself flagging it up as possibly of animal origin.”\nYo también estoy SORPRENDIDO.\nColin ha entendido MUY RÁPIDO el  GRAN INTERÉS de mi comentario sobre la hidroxiprolina.\nLa presencia de hidroxiprolina  en la sangre sería una PRUEBA IMPORTANTÍSIMA de autenticidad, probablemente la MAYOR…….\n1.- Autenticidad de la SANGRE como sangre humana.\n2.- Sangre procedente de un SER que fue sometido a un enorme desgaste y estiramiento muscular :\na.-intensas contracciones musculares por el suplicio del látigo….con muy probables micro-lesiones musculares por la acción directa del látigo.\nb.-inicio del transporte del madero de la cruz para el que la fuerza muscular ya no le responde.\nc.-intenso y mantenido estiramiento muscular a consecuencia de la crucifixión.\nEn los años en que escribió Rogers NO se habían realizado estudios sobre la hidroxiprolina en relación a los esfuerzos musculares, estudios desarrollados fundamentalmente en relación con la medicina del  DEPORTE y de gran interés sobre todo en la “contracción muscular excéntrica”……..\n¿Será Colin el ÚNICO interesado en el tema de la hidroxiprolina? \n¡Ja,ja,ja,ja…..!\nCarlos Otal\n\n","date":"August 9, 2012 at 7:30 am","url":"https://shroudstory.com/2012/08/07/and-yannick-responds-to-giulios-comments/","cat":"news_&_views","title":"Yannick Reacts to Special Issue"},{"author":"corneliotel","post":"¡Hidroxiprolina!\n¡Un MAGNÍFICO argumento a favor de la AUTENTICIDAD!\n-En el individuo normal, SANO, la hidroxiprolina se encuentra como TRAZAS en el suero sanguíneo, y en mayor cantidad en la orina como hidroxiprolina libre y hidroxiprolina conjugada con péptidos.\n-En el individuo ENFERMO con diversas patologías que aquí no interesan, la hidroxiprolina aumenta en el suero sanguíneo y sobre todo en la orina.\n-¿Adivinan en qué situaciones AUMENTA de forma considerable la hidroxiprolina tanto en el suero sanguíneo como en la orina?\n-La hidroxiprolina aumenta de manera muy considerable en suero sanguíneo y en orina en los INTENSOS ESTIRAMIENTOS MUSCULARES MANTENIDOS, lo que es bien conocido por la medicina del deporte.\n– No se me ocurre un ESTIRAMIENTO MUSCULAR MANTENIDO MÁS INTENSO que el proporcionado por 3 horas de CRUCIFIXIÓN.\n[el pico de hidroxiprolina en la muestra procedente del talón me sugiere “contaminación” por la orina. En el tipo de muerte que sufrió Jesús sería normal la emisión de orina…. incluso de heces y líquido seminal]\n– Yo soy médico clínico, sugiero que un médico mejor cualificado que yo en bioquímica de la sangre y la orina como el Dr. Heimburger retome el tema de la hidroxiprolina.\nCarlos\n\n","date":"August 8, 2012 at 3:47 am","url":"https://shroudstory.com/2012/08/07/and-yannick-responds-to-giulios-comments/","cat":"news_&_views","title":"Yannick Reacts to Special Issue"}],"resources":[{"author":"corneliotel","post":"Algunos escépticos deben tener un serio problema para alcanzarse los genitales estando tumbados……..lo que en determinados casos debe ser bastante frustrante.\nEs lo más TONTO que se puede decir del Hombre de la Sábana, llevan años repitiéndolo pero lo CUENTAN MAL, no acaban de aprendérselo y lo REPITEN como loros.\nLa condición “sine qua non” para que FUNCIONE esa estupidez es que LOS CODOS NO SE DESPEGUEN DEL SUELO.\n¡Ya que cuentan una estupidez, al menos que la cuenten bien!\n“Cualquier persona que quiera simular la posición del supuesto “cadáver”, puede hacer lo siguiente: acostarse en el suelo boca arriba, dejar reposar los codos sobre el suelo, tomar una de las muñecas con la otra mano, y sin despegar los codos del suelo, tratar de ocultar los genitales… lograr esta posición es tan imposible como morderse el codo.” Lo refería en un deplorable artículo el escéptico colombiano Hernan del Toro en la revista “Pensar” n1, v 1 Enero-Marzo 2004.\nEs obvio que si se INMOVILIZA la articulación del codo apretándolo contra el suelo no puede alcanzarse los genitales, ni el ombligo, ni la nariz, ni la boca, ni NADA.\nStephen Wagner, NO TE SUGESTIONES, eres normal y puedes alcanzar tus genitales perfectamente estando tumbado, eso si, cuando lo intentes no te empeñes en apretar los codos contra el suelo………\nCarlos Otal\n\n","date":"April 2, 2012 at 5:13 am","url":"https://shroudstory.com/2012/04/02/a-silly-why-the-shroud-of-turin-is-fake-article/","cat":"news_&_views","title":"A Silly “Why the Shroud of Turin is Fake” Article"}]}
