{"resources":[{"author":"daniel_carter","post":"Sorry, Dr. Schwortz. You say, “Adler never said that the bilirubin is what made the blood still red.”\nBut in “The Origin and Nature of Blood on the Turin Shroud” by Alan D. Adler published in “The Orphaned Manuscript: A Gathering of Publications on the Shroud of Turin”, Dr. Adler did actually say, “You now mix bilirubin which is yellow-orange with methemoglobin in its para-hemic form which is an orangey- brown and you get blood which has a red color.” \nWhat am I missing? \nYou put a great deal of emphasis on Dr. Adler’s expertise. Fair enough. I don’t doubt it. But if you do so you should also consider the expertise of Dr. Colin Berry and his questioning of Dr. Adler in his blog posting, “It’s clever, some might say pretty, but is it science?” at https://shroudofturinwithoutallthehype.wordpress.com/ (2012/4/20). To wit,\n“re Alan Adler’s protocols: it’s easy to be impressed by lists of the tests he did perform to confirm “real” blood, albeit degraded. But one has to be a specialist in the area of tetrapyrroles, whether cyclic, like the porphrins, or linear like the bile pigments, to know that uv.visible and fluorescence spectra alone do not provide proof positive. For two years I was a bile pigment specialist, working on Philadelphia on the phototherapy of neonatal jaundice, and teamed up with a then major drug company (SKF) to use state-of-the-art methodology for identifying bilirubin photo-derivatives. key among those were initial thin layer chromatography, followed by derivitization to form volatile TMS-derivatives, followed by mass-spectometry. We were not content to look just for finger-printing fragments – we regarded detection of the molecular ion as our goal.\n“That was in 1972, well before the STURP studies, but nowhere have I seen Alan Adler using such rigorous methodology to confirm that he was detecting porphyrins, as distinct form substances with porphyrin-like spectra and fluorescence. Nor have I seen any real evidence for the existence of bilirubin, apart from diazo-reactivity and fluorescence. Why no chromatography? Why no mass spec? Why inflict a quirky conjecture involving a trauma induced bilirubin and “para-hemic” methaemoglobin to explain the permanent red colour of the “blood”? That is not science – that is daydreaming and pure fantasy.”\n\n","date":"March 29, 2015 at 2:54 am","url":"https://shroudstory.com/2015/03/28/is-bilirubin-still-accepted-as-an-explanation-for-the-red-blood/","cat":"article","title":"Is Bilirubin Still Accepted as an Explanation for the Red Blood?"}]}
