{"image":[{"author":"david","post":"my idea after having seen “the real face of jesus” is this:\nAs it was said in the film, focused beams coming upright or expandingly from the body would make the reflection fuzzy. Beam of light coming horizontally (like in scanner) is the only one which can make the image in 3D\nassuming that\n1. the negative of the shroud is the original image which could have been seen from the angle of THE SHROUD\n2. brightness of an scanned object depends on the distance (closeness) between an object and a scanner light, the further an object stays the darker the image is because of the dispersion of the light.\nI would like you to imagine the shroud as a huge scanner which did a scan of the body ITSELF and “saved the image down” on its own surface by the heat. Places which had  better contact to the shroud (nose, forehead, cheeks, hair, beard, mustache) are lighter on the negative – darker on the shroud. Darker places on the negative (eyeholes) were not scorched on the shroud. The face is long and its sides are “cut” – there must have been gaps between hair and the face and the light didn’t get there or got there but the heat didn’t reflect.\n\n","date":"May 8, 2013 at 5:11 am","url":"https://shroudstory.com/2013/05/04/a-mysterious-work-of-art/","cat":"image_theory","title":"A mysterious work of art?"}],"misc":[{"author":"david","post":"It is a problem, but there is a greater problem that I have never heard addressed. If you take a curved surface and wrap a plane (i.e. a piece of cloth) around it to take an impression of it, when you flatten it out it warps the image. (Think of a cylinder projection map of the Earth.) If anyone knows of an examination of this issue, please let me know.\n\n","date":"June 5, 2011 at 6:45 am","url":"https://shroudstory.com/2011/05/17/quote-of-the-day-on-skeptical-websites-about-the-shroud-of-turin/","cat":"quotations","title":"Quote of the Day on Skeptical Websites About the Shroud of Turin"},{"author":"david","post":"Angel Wynton…….Can you provide contact information so that I can follow-up with you regarding the youtube movie entitled, “Solid Proof Turin Shroud is 1rst Century”?\n\n","date":"April 21, 2014 at 11:15 am","url":"https://shroudstory.com/2014/04/19/its-called-circumstantial-evidence-anybody-have-a-better-idea/","cat":"news_&_views","title":"It’s called circumstantial evidence. Anybody have a better idea?"}],"researchers":[{"author":"david","post":"Barries new site has a huge wealth of information in regards to the Shroud.  2nd to none. This is where immaculate details and facts regarding the Shroud can be found. On this site alone a person could learn everything that we currently know regarding the Shroud of Turin and the Head Cloth in Spain.  (Items from the same tomb)  The deeper a person goes into the research, eventuallly they will find themselves backed into a corner where only 1 possibility remains  The Shroud of Turin is the burial cloth of Jesus.  Think of all the odd items of historical significance that people save.  Sports Memorabilia, items from famous people, I cannot in my wildest imagination visualize someone actually disposing of the burial cloth of Jesus and NOT PRESERVING IT.  The fact that the burial cloth of Jesus still exists should not come as a surprise, but something you would expect would be intact and preserved to this day,  And it is.   We have items much older than the Shroud that no one disputes as being authentic on far less evidence and scientific study.\n\n","date":"August 29, 2012 at 1:08 pm","url":"https://shroudstory.com/2012/08/26/barrie-schwortz-announces-latest-changes-to-the-shroud-of-turin-website-stera-inc/","cat":"news_&_views","title":"Barrie Schwortz Announces Latest Changes to the Shroud of Turin Website (STERA, Inc.)"}],"resources":[{"author":"david","post":"I became Christian based on entirely unexpected conversion experience from usual scientific skepticism as an adult, then became Catholic based on reading the “Apostolic” tradition of the early Church Fathers, whose experience and teaching seemed to confirm my own experience. This was furthered confirmed by early Jewish tradition of the Second Temple era about how Jews understood revelation. Paul’s experience (reported by Luke or Paul) about summarizes this as the earliest and only NT account of conversion. This is a supernatural thing.\nThis does not persuade me one way or another about the reality of the Shroud. It simply makes me wonder about the possibilities. (I have to say that many commentators here about the Shroud have no scientific competence beyond having a degree however advanced in mostly irrelevant subjects. They are lousy engineers with a target. But they simply don’t have the data or competence. Neither do I. I wish the Vatican would allow another study, one which is more carefully considered in methodology. (I have proposed this.) I have no prejudice about the outcome and it would not change my faith, which is based on other things. No matter what the Shroud image may be, it is at least a remarkable and faithful image.\nI have an open mind, because first of all, I have sufficient faith already.\n\n","date":"June 13, 2015 at 8:44 pm","url":"https://shroudstory.com/2015/06/13/also-because-of-the-shroud-of-turin/","cat":"press_coverage","title":"Also Because of the Shroud of Turin"}]}
