{"art":[{"id":"comment-12895","author":"davor_aslanovski","post":"You might be interested in the following two posts on my blog: http://deumvidere.blogspot.co.uk/2012/06/image of edessa and turin shroud part.html http://deumvidere.blogspot.co.uk/2012/06/image of edessa and turin shroud part 22.html.","date":"2012-06-22","mins":"8:10 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12901","author":"davor_aslanovski","post":"@ menedemus: I cannot discuss Nicolotti’s (I suppose you meant Nicolotti rather than Lombatti) work before I have read it. If I have indeed only retold in English what he had already published in Italian, I will delete my posts. For the time being, though, I think I can safely assume that our arguments are not exactly identical. @ Max Patrick Hamon: I, naturally, don’t think that there is anything erroneous in that article. I will explain why you are wrong on the Robert de Clari’s testimony, but before I do so, I must ask: is it really only ‘one example among many’ and, if so, what else do you object to?.","date":"2012-06-22","mins":"10:12 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12917","author":"davor_aslanovski","post":"Is there anything in relation to my posts, rather than to the perils of Coca Cola consummation, that you would like to discuss?.","date":"2012-06-22","mins":"2:41 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12925","author":"davor_aslanovski","post":"Would you kindly put all these and any other comments/questions you may have together and post them on my blog? Let’s not lead this conversation in two places. Also, can you please explain the distinction you are making between the ‘Image of Edessa’ and ‘The Holy Face of the Holy Mandylion’?.","date":"2012-06-22","mins":"5:08 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-13497","author":"davor_aslanovski","post":"Exactly how many times would it take for me to repeat that I do not believe the image in the Shroud to be a painting before you can finally hear me? Tell me the figure, and I’ll quote myself the necessary number of times… In any case, let’s get it over with..","date":"2012-07-05","mins":"10:35 am","url":"https://shroudstory.com/2012/07/05/davor-aslanovski-is-right-for-once/","cat":"art","title":"Davor Aslanovski is right for once"},{"id":"comment-13495","author":"davor_aslanovski","post":"No, absolutely not. And I never said anything to the effect. Whatever gave you such an idea?.","date":"2012-07-05","mins":"9:04 am","url":"https://shroudstory.com/2012/07/05/davor-aslanovski-is-right-for-once/","cat":"art","title":"Davor Aslanovski is right for once"},{"id":"comment-13544","author":"davor_aslanovski","post":"Daveb, if you don’t mind me asking, do you consider yourself to be a Christian?.","date":"2012-07-06","mins":"2:35 pm","url":"https://shroudstory.com/2012/07/05/davor-aslanovski-is-right-for-once/","cat":"art","title":"Davor Aslanovski is right for once"},{"id":"comment-13499","author":"davor_aslanovski","post":"Btw, I’m glad to see that Mr Porter CAN take a joke..","date":"2012-07-05","mins":"10:41 am","url":"https://shroudstory.com/2012/07/05/davor-aslanovski-is-right-for-once/","cat":"art","title":"Davor Aslanovski is right for once"},{"id":"comment-15948","author":"davor_aslanovski","post":"Let’s start at the beginning: where is this quote from? Because it isn’t from page 9 of that book..","date":"2012-09-06","mins":"4:35 pm","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","title":"Quote for Today: Hans Belting and commentary"},{"id":"comment-15972","author":"davor_aslanovski","post":"1.) I have noted myself that Belting has made some very interesting changes to the various editions of his book – especially between the German original and the French and English translations. I have pointed out one such peculiarity that ‘sindonologists’ might find particularly interesting here: http://deumvidere.blogspot.com/2011/05/i.html It was a paper that I actually e mailed and asked Dan Porter to promote in these circles, as I thought it had to a lot to offer on the matters discussed here. But, of course, since it says absolutely nothing about imaginary Vignon markings, doesn’t pick out one among tens of thousands of Byzantine neologisms (‘tetradiplon’) and then pretend it is the only one, and doesn’t even mention the Cherubim gates in Antioch – no one here read it. I do admit that it doesn’t read like a fairytale, doesn’t have any mythological creatures or cryptological puzzles in it, doesn’t even come with pretty pictures. But I once again suggest that you have a look at it. If for no other reason, then at least to give you an idea of what is really wrong with certain academic approaches to Christian art. And how a Christian art historian (with proper training and proper understanding of what the academic world really is) would begin to solve these issues. If he only wasn’t always so stranded for time. 2.) It proves nothing that there is no mention of the burial cloth’s arrival to Constantinople. The first mention of a relic at the capital usually coincided with either the foundation or a restoration of a shrine in which it was/would be housed. We rarely find that the one is recorded without some mention of the other. Of course, you would only know and understand this if you had any training in Byzantine history. 3.) The reason why Wilson only needed 3 months to do all the research for his books, while it takes us silly academic people so much more is that we worry too much when an ancient author makes claims that are not substantiated elsewhere. And we go and check. And we check ALL the relevant sources. And we compare. For instance, we don’t just read one ancient author and go: ‘AHA! So the heads of Cyril and John were buried in the Hagia Sophia – Anthony of Novgorod says so!’ No, we are read on and often find that the author himself contradicts this when he says: ‘there is no tomb in Hagia Sophia except for that of St Anthenogenes.’ So, in a word, reconstructing Byzantine history takes a little more time and a little more work than you people think it does. Just imagine if, for instance, medical diagnoses were established and medicines administered the way that things are done here. You have some pain in your belly, you say? That must be appendicitis. We must operate immediately. Wait here while I call our surgeon. What is that? You have had tea while you were waiting and the pain is now gone? Oh great, so now we know a simple cure for appendicitis and surgeries will no longer be necessary. Thank God that a little more thought and effort goes into that and thank God the first book that came into Mr Belz’s hands wasn’t something that said Jesus never existed. We would now have to be listening to his ‘editorializing’ about how the shroud cannot be authentic because there never was a crucifixion victim crowned with thorns. 4.) When one has so very little understanding of the Byzantine world that he doesn’t even know that the Turks were not Arabs (see above), is he really equipped to wrestle with questions of the true motivation of the Byzantine military and diplomatic campaigns? It may seem like a small mistake to someone who doesn’t know much about this world, but to anyone who has ever read even the shortest introduction to Byzantine history – this is the same the same as if they were being asked to discuss whether George W. Bush was right to attack Egypt after 9/11. 5.) About the Vignon markings. As Mr Belz has noted above, I have recently posted a likeness of Jesus Christ made with the help of these markings on my blog. The idea was to show that that is not how you achieve likeness in visual art. What you do (and I cannot believe that I have to say this!) is you measure the features and proportions of the face – e.g. Length of nose, distance between the eyes, width of mouth, and how they relate to each other. Anyone who has any artistic ability and a sound mind knows this. If all the ancient icons of Christ showed the same facial proportions – you would have a case. But with Vignon markings you have nothing but a drawing made by someone who is either psychologically or neurologically unwell..","date":"2012-09-07","mins":"3:38 am","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","title":"Quote for Today: Hans Belting and commentary"},{"id":"comment-15992","author":"davor_aslanovski","post":"Dan did post that paper here. I have nothing to reply to the rest of your comment. You are an adolescent in your sixties and I will from now on ignore you completely..","date":"2012-09-07","mins":"11:48 am","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","title":"Quote for Today: Hans Belting and commentary"},{"id":"comment-15840","author":"davor_aslanovski","post":"Dear Mr Belz, What in the world gave you the idea that I was a single discipline specialist? And what would that have to do with the question whether the image reverently transferred to Constantinople in 944 can be identified with the Turin Shroud?.","date":"2012-09-04","mins":"10:39 am","url":"https://shroudstory.com/2012/09/04/so-what-is-the-problem-ian-wilson-freeman-jones-or-this-cult-of-ours/","cat":"art","title":"So what is the problem: Ian Wilson, Freeman, Jones or this “cult” of ours?"},{"id":"comment-15864","author":"davor_aslanovski","post":"1) I will form my views on ‘scientific matters concerning the Shroud’ if the object is examined by scientists, lege artis, and if the results are published in peer reviewed journals. In the meantime, I believe the only thing we CAN discuss is the object’s history. Which, based on what we know at the moment, doesn’t seem to stretch any further than the late 1300’s. And I wasn’t pathetically psychoanalysing anyone. Recognizing that people are psychologically unwell, feeling sorry for them, and asking yourself ‘Aren’t relics supposed to bring healing?’ is no psychoanalysis. 2) Wilson’s theory is a scientific heresy in relation to the kind of history we do in the academic world today. Once again, I have restricted myself to the subject of history because it is the only subject where we possess enough information to form any opinion. And I think I have both addressed this question myself and pointed to others who have dealt with different aspects of it. So, QUOD erat demonstrandum? You are not making any sense..","date":"2012-09-05","mins":"2:49 am","url":"https://shroudstory.com/2012/09/04/so-what-is-the-problem-ian-wilson-freeman-jones-or-this-cult-of-ours/","cat":"art","title":"So what is the problem: Ian Wilson, Freeman, Jones or this “cult” of ours?"},{"id":"comment-15881","author":"davor_aslanovski","post":"Discussing here how scientific research should be conducted and where and how the results of it should be presented would be a waste of time. The idea that academic historians today could be ‘conspiring’ against the Shroud shows how little Markwardt understands what the academic world is and what historians do – despite the fact that he calls himself a historian. And the case that he mentions dates from a hundred years ago and has to do with nothing but the d’Arcis memorandum. And Wilson’s theory has not been rejected on the basis of the d’Arcis memorandum. (In case it still isn’t clear, it was rejected because there is no evidence for it. It is a piece of historical fiction. And if it’s historical fiction you want, give me five pounds and I’ll tell you a dozen more amusing stories to ‘explain’ the ‘provenance’ of the Shroud. And for a tenner, I’ll let you see where the aliens probed my spine.) And as for Dreisbach, these few lines will exemplify why I don’t hold his writings in very high regard: ‘On that first Easter morning the Magdalene “saw two angels in the place where Jesus had lain…one at the head and one at the feet.” (John 20:2l). Could this be the very first description of the ventral and dorsal images of the Man of the Shroud?’.","date":"2012-09-05","mins":"7:50 am","url":"https://shroudstory.com/2012/09/04/so-what-is-the-problem-ian-wilson-freeman-jones-or-this-cult-of-ours/","cat":"art","title":"So what is the problem: Ian Wilson, Freeman, Jones or this “cult” of ours?"},{"id":"comment-15882","author":"davor_aslanovski","post":"‘In the beginning God created the heavens and the earth.’ – could this be a prefiguration of the ventral and dorsal images that His Son would one day leave on the burial Shroud? The heavens foreshadowing the wound in Jesus’ side, because water comes down from heaven just like it came out of this wound? And the earth symbolising His back, because His back would one day be laid on the ground, when He is taken down from the cross?.","date":"2012-09-05","mins":"7:59 am","url":"https://shroudstory.com/2012/09/04/so-what-is-the-problem-ian-wilson-freeman-jones-or-this-cult-of-ours/","cat":"art","title":"So what is the problem: Ian Wilson, Freeman, Jones or this “cult” of ours?"}],"events":[{"id":"comment-17120","author":"davor_aslanovski","post":"Why on earth would you announce my attendance like this? (Or at all?).","date":"2012-10-01","mins":"10:32 am","url":"https://shroudstory.com/2012/10/01/davor-aslanovski-to-attend-b-s-t-s-british-society-for-the-turin-shroud-meeting/","cat":"event","title":"Davor Aslanovski to attend B.S.T.S. (British Society for the Turin Shroud) Meeting"}],"history":[{"id":"comment-12969","author":"davor_aslanovski","post":"Santa Pudenziana? What about it?.","date":"2012-06-23","mins":"11:34 am","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"id":"comment-12967","author":"davor_aslanovski","post":"But I HAVE answered. On my blog, this morning..","date":"2012-06-23","mins":"11:25 am","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"id":"comment-12980","author":"davor_aslanovski","post":"The Disciplina Arcani has nothing to do with the question whether the Image of Edessa and the Turin Shroud can be shown to be one and the same object. So can we please stick to the subject? Byzantine Greek is full of peculiar neologisms, and the word tetradyplon is not a particularly interesting one. And I HAVE dealt with it, you just haven’t read my posts very carefully. I said: ‘What remains to be examined now is the impression that some authors have believed that the image of Edessa was preserved on a large cloth and/or that the cloth bore the imprint of Jesus’ entire body and not just his face. And the essential thing to notice here is that these two notions cannot be divorced from one another. In other words, it cannot add any credence to Wilson’s theory that John Damascene used the word himation, which does indeed denote a large cloth, if this fact is contrasted with the saint’s beliefs about the image’s appearance and formation. For how can a clear statement that the image was formed when Jesus washed his face with water, and an attendant absence of any mention of either blood or full body image, be completely disregarded on the strength of a single word that does not normally denote a face towel? If a text is to have any bearing on our conception of what the image of Edessa was, three elements need to be speaking in unison: (i) the narrative of the image’s formation, (ii) the words or phrases describing the cloth’s size, and (iii) the account of what the image really portrays. And if this filter is applied to the extant sources, it quickly becomes obvious that the only account which comes even close to corroborating Wilson’s theory is that of Gervase of Tilbury.’ As this is obviously not clear enough, I will briefly explain. The ‘Acts of Thaddaeus’ mention the ‘sindon tertradiplon’, but the image is said to be formed when Jesus asked to wash Himself, upon which a towel was handed over to Him and He wiped His face with it. So that’s why this text cannot pass through my ‘filter’. The Menologion entry for Aug 16 likewise says ‘tetradiplon’, but the account of the image formation is the same (Jesus wiping His face after washing it with water). Neither the full body image nor the presence of blood is mentioned in any account, and both expressly state that the image was formed while Jesus was alive. Gregory Referendarius is, just like Nicholas Mesarites, one of the few authors who have actually had first hand, up close familiarity with whatever the image of Edessa was. And they were both men of considerable learning. And their testimonies do not mention anything like the double imprint of a dead man on a 14 foot cloth. (Nicholas Mesarites in fact expressly distinguishes the burial shroud (‘sindones Christou’) from the towel (cheiromakterion) with the prototypal image.) As for the bishop Arculf, let me quote what Wilson himself says: ‘he had seen in Jerusalem “the sudarium of Our Lord which was palced over His head in the tomb”. (…) It was apparently about 8 feet long, so its measurements do not appear to match our Shroud (…) But Arculf mentioned no imprint.’ How Arculf’s testimony is then relevant to this discussion – you tell me. Just as in the case of tetradyplon, I HAVE addressed the Vignon markings – once again the problem is that you have not read my posts very carefully. I said: ‘As is immediately obvious upon close inspection of both the “icon evangelizing” and the “Vignon markings” claim, Wilson and his supporters do not understand that certain copies in Byzantium were precisely not to be identical. Far from being a case of meticulous examination, exact replication, and zealous dissemination of a venerated archetype, the story of the Mandylion in Byzantine art is one of virtually inexhaustible variation.” And then I corroborated that claim with close inspection of precisely those images that Wilson (and other ‘sindonologsist’) offered as proofs of their theses. I have also pointed out that the two images that predate all the other Mandylion reproductions by several centuries do not show any of these markings. And I have stressed that a fresco of Abraham in the Karanlik Kilise ‘bears at least the following “markings”: quiffs of hair falling on the forehead; heavily accentuated owlish eyes; accentuated cheeks; asymmetrical nostrils; forked beard’. So I don’t see how ‘the topic is not addressed at all’. Yes, the report commissioned by Constantine Porphyrogenitos, if not in fact written by himself, says that the Lekapenoi usurpers were unable to see the image. And anyone who knows the story of Constantine’s struggle to regain the throne knows that this is most likely only his imperial propaganda. But, in any case, the account once again does not say that this was an image of a full body. As for this part: ‘One further aspect is that the arrival of the Mandylion in Constantinople was marked by a general rejoicing, the institution of a major feast day observed annually throughout Orthodox Christianity, but no corresponding feast day for the arrival of the Shroud, a much more notable relic, which only seems to have become slowly manifest in Constantinople over a period of time, very likely when the Mandylion was removed from its framework. However the Byzantines were not about to give up on their precious Abgar legends, the stories which had become woven into their liturgies, and so the myth of the Mandylion as a separate object persisted.’ I have nothing to say other than that such an account depends entirely on your personal beliefs and not on any evidence. You may be right. Or, to be more precise, Daniel Scavone may be right, because, if I’m not mistaken, it is his theory. In any case, this may be right. Or it may be wrong. But there is no evidence for it. And I could just as well, off the top of my head, come up with another theory: there was no feats day for the arrival of the burial shroud because the burial shroud was a relic forged in Constantinople itself. I have no evidence for such a claim, of course, but that doesn’t seem to matter here. Or, to be more serious, I could say ask you this: was there a feast day for the arrival of EVERY relic in Constantinople? Or this: was every relic transferred to Constantinople on the 100th anniversary of the Triumph of Orthodoxy, and was every relic so prominently mentioned by the iconodules during the iconoclastic controversy? Or was every relic used as a piece of imperial propaganda by an emperor who has been deprived of his birthright for a quarter of a century? If you have any further questions, please first read my two posts and see if they haven’t already been dealt with there..","date":"2012-06-23","mins":"8:22 pm","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"id":"comment-12981","author":"davor_aslanovski","post":"And I do hope that when you guys say ‘I have not changed my mind’ you know that that says nothing about the cogency of my arguments..","date":"2012-06-23","mins":"8:31 pm","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"id":"comment-12963","author":"davor_aslanovski","post":"Thank you, Dan! I will gladly enter any serious discussion, based on arguments and direct references to the sources. I will, of course, ignore insulting comments on my writing style and facial features, generalising remarks about the shortcomings of academics, and appeals to cryptography, steganography, and/or to misconstructions such as this Markwardt’s take on the Disciplina Arcani. (For the simple reason that these things are entirely fanciful and have no direct connection to Christian relics and art.) What I wrote is this: the Hymn of the Pearl, the Mozarabic rite Inlatio, the homily of Gregory Referendarius, and the Otia Imperalia, often cherished as major proofs that the Image of Edessa and the Turin Shroud CAN be identified, have been grossly misinterpreted in the so called sindonological circles. And Wilson’s interpretation of Early Christian and Byzantine art is equally mistaken. I have put a lot of time in explaining why I think that, and have built my arguments solely on the close reading of the actual documents. And if I can get the same level of seriousness and argumentation from my critics, I will gladly debate them. If not, I will, naturally, ignore them. And one more point. I think it is quite obvious from my two papers that I am not interested in the debate over the authenticity of the Shroud. What I wanted to say was simply this: there is no evidence, textual or visual, that the Shroud and the Image of Edessa are really one and the same. The Shroud, for all that we know, might be authentic. And it might even be the Image of Edessa. But, for the time being, there is no EVIDENCE for either. And the discussion of EVIDENCE, on the Image of Edessa, is what my two papers are about. Personal beliefs, ‘spy clues’, and cryptographical protocols of the ‘Da Vinci Code’ type are not what I call evidence..","date":"2012-06-23","mins":"10:56 am","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"id":"comment-12973","author":"davor_aslanovski","post":"I agree and disagree with you. I share your opinion that some people involved in this debate have misinterpreted, misused, and/or misrepresented the evidence. But I don’t think there is any reason to think of anything like deliberate deception. After all, these documents and images are (in one way or another) widely accessible today and there is nothing stopping anyone from examining them and forming their own opinion. And there is certainly nothing to be gained from such a ‘deception’ or ‘fraud’. My image of an average sindonologist is, therefore, more like this: he has come to the (accurate) conclusion that the image in the Shroud is like no other in the history of human art, and that it, at least for the time being, escapes scientific explanation; he has, through various experiences in his life, become fed up (and rightly so) with the skepticism, rationalism, agnosticism, and the general disbelief that permeate the academic world today; he has done some research and has found a number of things in various scientific disciplines (in at least some of which he has no expertise of his own) that could conceivably be used to prove that the relic is authentic; he has most probably always had a healthy passion for mysteries; and he is, more often than not, passionate about his religion as well. Through a combination of these factors, he continues to been drawn to this enigmatic object. And, far from resorting to deception or fraud, he genuinely believes his own claims. He is often aware that experts have refuted some of his claims, but refuses to change his mind – because these experts are generally not very inspiring to him. Their skepticism, rationalism, and agnosticism, mentioned above, is in fact repulsive to him, and, to a great degree in deliberate opposition to them, he chooses to believe. He chooses a wonderfully mysterious fantasy over the dreary, cheerless reality. And who can possibly blame him? I certainly don’t – in the eyes of many, I am guilty of the same for my being a Christian. The one thing that I don’t understand about him, and cannot relate to, is that he somehow thinks that his study of this relic is directly connected to his Christianity. An ‘average sindonologist’ spends hours and hours on blogs and websites like this rather than to read his Bible, say his prayers, love and help his neighbors, and grow in the discipleship of Christ. One does not exclude the other, no, but we are only afforded so much time in this world and spending it on endless debates such as by what stretches of imagination the ‘Hymn of the Pearl’ can be seen to have anything to do with the Turin Shroud cannot be the best way of spending that portion that should be dedicated to religion. The Shroud is a fascinating object, but the study of the textual and visual records pertaining to it must be like any other – scientific. Belief should be left for other areas of human existence. Venerating the crucified Jesus, whether in the Shroud or in any other way needs no evidence. Studying the Shroud needs nothing but evidence. And if the Shroud is authentic, my guess (based on ‘spy clues’ and ‘cyptographic examinations’ of how God seems to like to conduct His business) is that evidence for that will never be found. All the best!.","date":"2012-06-23","mins":"2:58 pm","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"id":"comment-13090","author":"davor_aslanovski","post":"@ Menedemus and David Mo: I have read and I appreciate your comments. I don’t have time to read through all the nonsensical backtalk that get posted here, though, and will not take an active role in internet debates. I did get that you took your pseudonym from Erasmus, but what is needed here is not a Menedemus the Catholic skeptic, but an Iranaeus the hammer of the Gnostics; not a satirical ‘A Pilgrimage for Religion’s Sake’ but a detailed ‘Adversus Haereses – The Detection and Subversion of Knowledge Falsely So Called’..","date":"2012-06-27","mins":"10:12 am","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"id":"comment-12970","author":"davor_aslanovski","post":"You see, if any art historian would be likely to take the Disciplina Arcani into consideration, it would in fact be precisely a Roman Catholic one. Because it was precisely the Roman Catholic scholars, when debating their Protestant brethren on the silence of the early Church Fathers on certain important matters, that first brought up this concept in modern times. So why you would bring up my denomination is entirely beyond me. As is why you would think that this practice of reserve would be employed in late 12th century Pray manuscript..","date":"2012-06-23","mins":"11:46 am","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"id":"comment-13137","author":"davor_aslanovski","post":"Max, please take this piece of friendly advice: take it easy, relax. I hear (and somehow do understand) what you’re saying, but it is your personal conviction and nothing more. As I said before, the Mandylion and the Shroud MIGHT very well be one and the same, but there is no EVIDENCE for that. (If the textual and visual references to the Image of Edessa we do possess can be seen as evidence at all, then that evidence points to the contrary conclusion. But to what extent it CAN be considered as evidence is a topic that goes way over your head, because you are not trained in any relevant discipline.) But the bottom line is this: YOU MIGHT BE RIGHT. And I am not discussing whether you are right or not. We can not know that. For the last time, I am ONLY interested in whether there is, at present, any EVIDENCE for Wilson’s hypothesis. For some reason, you are taking this all too personally and I am sorry to see you working yourself up like this. Your very vivid imagination, as revealed both in your reading of the sources and in the endless misspellings of my name, could be put to much better use. You’ll never be taken seriously as a historian, but you could definitely make it as a writer of fiction. I am not being sarcastic. Stop wasting your time on history – there are genres of writing where eccentricity IS valued..","date":"2012-06-28","mins":"9:37 am","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"id":"comment-13138","author":"davor_aslanovski","post":"In any case, relax. I wish you all the best..","date":"2012-06-28","mins":"9:38 am","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"id":"comment-12965","author":"davor_aslanovski","post":"And do you have any evidence for your claim?.","date":"2012-06-23","mins":"11:21 am","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"id":"comment-17296","author":"davor_aslanovski","post":"Ron, I don’t think that you are blowing hot air. I believe that you’re speaking sincerely and from the heart, which is nothing to be sniffed at, but you are deeply mistaken on these issues. Calling something a heresy has nothing to do with the speck of sawdust in your brother’s eye. According to your interpretation, St Paul already, in passages like 1 Tim 6:20, directly contradicts the Lord’s instruction ‘not to judge.’ And what you would have to say of people like St Irenaeus, who have put together vast tomes precisely entitled ‘On/Against Heresies’ – I don’t even want to know. As for the question of prosecutions and ‘anything to do with the faith (…) being destroyed by the pagen rulers who would endlessly conquer throughout the early centuries!’ – I’m not even going to go into the fact that persecutions did not happen *throughout* the early centuries. In a word, I am not going to give you a historian’s answer. I am just going to ask you, one Christian to another, if this secret was lost along with those very select few who knew it, how many other secrets were also lost? And what would Christianity look like today if we could recover those ‘lost secrets’?.","date":"2012-10-07","mins":"3:12 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","title":"Davor Aslanovski: Sindonology a Heresy"},{"id":"comment-17302","author":"davor_aslanovski","post":"Can you be more specific, please?.","date":"2012-10-07","mins":"4:20 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","title":"Davor Aslanovski: Sindonology a Heresy"},{"id":"comment-17301","author":"davor_aslanovski","post":"OK, I don’t have time for this. I thought for a moment that I could and should clarify some things for you, but this sort of a thing I don’t do. Especially not on the internet..","date":"2012-10-07","mins":"4:18 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","title":"Davor Aslanovski: Sindonology a Heresy"},{"id":"comment-17328","author":"davor_aslanovski","post":"Just to make it absolutely clear: the above was in response to Ron, not to Louis..","date":"2012-10-08","mins":"7:23 am","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","title":"Davor Aslanovski: Sindonology a Heresy"},{"id":"comment-17327","author":"davor_aslanovski","post":"I will deal with this in the next part of this series of posts..","date":"2012-10-08","mins":"7:22 am","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","title":"Davor Aslanovski: Sindonology a Heresy"},{"id":"comment-17325","author":"davor_aslanovski","post":"Thanks for the clarification, Louis..","date":"2012-10-08","mins":"4:38 am","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","title":"Davor Aslanovski: Sindonology a Heresy"},{"id":"comment-17417","author":"davor_aslanovski","post":"Dear Mr Belz, I hope it brings you some consolation that, though I will continue to ignore you here, such will by no means be the case on my blog. Quite to the contrary, you will find that I have already written a few things that address you directly..","date":"2012-10-10","mins":"10:53 am","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","title":"Davor Aslanovski: Sindonology a Heresy"},{"id":"comment-17286","author":"davor_aslanovski","post":"It’s not my fault that you are unwilling to read the whole thing, or that Dan happens to think that the ‘heresy’ part is more important than this part: ‘(…) first Christians thought so very little of this cloth that bore not only the image of their Lord but His most sacred BLOOD that they let it slip out of memory.’ But if you’re just going to read and comment on one line, then let it please be this one: ‘We, Christians, have once FORGOTTEN that there was a cloth, in some niche above some city gate, that bore Christ’s BLOOD.’ Thank you..","date":"2012-10-07","mins":"11:16 am","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","title":"Davor Aslanovski: Sindonology a Heresy"},{"id":"comment-17288","author":"davor_aslanovski","post":"Louis : his message as read out by Bishop Kevin Vann of Forth Worth, Texas at the last Shroud conference in Dallas?.","date":"2012-10-07","mins":"12:23 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","title":"Davor Aslanovski: Sindonology a Heresy"},{"id":"comment-17295","author":"davor_aslanovski","post":"Yes, I’ve read it, but I don’t see how it relates to what my post is about. Can you please explain?.","date":"2012-10-07","mins":"2:47 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","title":"Davor Aslanovski: Sindonology a Heresy"},{"id":"comment-13187","author":"davor_aslanovski","post":"‘Given all textual and iconographic evidences, what was the most likely location of the Shroud between 5xx 944?’ – Neverland..","date":"2012-06-29","mins":"1:28 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"id":"comment-13210","author":"davor_aslanovski","post":"Daveb of wellington nz demonstrates the limitations of non specialists in coming to any kind of rational decision on complex problems. He could start at the beginning, say by asking himself what the meaning of the word ‘specialist’ is..","date":"2012-06-30","mins":"9:08 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"id":"comment-15537","author":"davor_aslanovski","post":"“In 1973, there were only three British people involved in any kind of Shroud research at all. They were Dom Maurus Green, Dr David Willis, and Ian Wilson. There were no others.” Yes, there was! There was a Scout Mistress!.","date":"2012-08-28","mins":"7:27 am","url":"https://shroudstory.com/2012/08/23/scholarly-incompetence-or-dishonesty/","cat":"history","title":"Scholarly Incompetence or Dishonesty?"},{"id":"comment-13264","author":"davor_aslanovski","post":"What is the point of this, Dan? I believe you are intelligent and cool headed enough to see that the only topic I have addressed is the plausibility of the link between the Image of Edessa and the Turin Shroud. Eminent scholars such as Averil Cameron, Sebastian Brock, Hans Belting, Robin Cormack, and Ewa Kuryluk; as well as some others who are not as advanced in their careers as to be called ’eminent’, but are certainly trained in relevant disciplines and have based their opinions on diligent research and much reflection – such as Andrea Nicolotti or my own humble self; have expressed their expert opinions on the topic and have rejected the idea as entirely fanciful. But our opinion is not valued within the ‘sindonological’ circles, and is rejected with intelligent and well argued explanations such as: ‘Rather turgid prose, straining at gnats, swallowing camels, he doesn’t see the woods, too focused on the trees, twigs and leaves. I can see why academic specialists are unsuitable candidates for jury trials. There’s rather a lot more to it than he’s considered, I should say yet another victim of over specialisation.’ ‘I trust that DA has had “the last part he has to say on the matter”, as despite his extensive verbiage he has contributed nothing to our understanding of the Shroud. He may return to his ivory tower where no doubt a trail of sycophants may admire his further efforts on Byzantine scholarship, and other such related topics.’ You yourself have read my two papers, admitted that they were products of serious study, and then granted them with no other comment but ‘I have not changed my mind’. And you go out and ask yourself: ‘What could he possibly mean by this ‘disrespect and distrust for the orthodox academia?’ I have been thinking about refuting the idea that the Pray ms illustrations are somehow depictions of the Turin Shroud, or that the Disciplina Arcani is what Markwardt thinks it is – but, frankly, I don’t even know where to begin. So many things have been misunderstood here that I would have to start with questions like ‘So what is art?’. And even if I found a way of debunking these syndonological myths – what would the reactions be? ‘You haven’t changed my mind, you iconologically blind, over specialized, archskeptical sycopanth. Go back to your ivory tower.’ For the hundredth millionth time: I don’t know what the Shroud of Turin is. I don’t know what the worth of chemical, physical, botanical, or any other research on it is. I don’t even know much about C 14 dating. Because I am not a specialist in any of those fields, and have not had any first hand information on the subject. So I have no opinion on these issues. But I am trained as an art historian, at a university that prides itself with being one of the first in the world to have introduced the subject of art history, and where it takes you at least 6 years to complete your undergraduate degree – so extensive are the reading lists. And I am currently sponsored by the University of Oxford’s most prestigious scholarship and am reading Late Antique and Byzantine Studies under the supervision of the world famous Jaś Elsner. And, after having dedicated many, many hours to examining both the textual and the visual sources, I have come to the conclusion that there is nothing in them to support Wilson’s hypothesis. And I am not saying that Wilson isn’t right. I am only saying that, at the present moment, there is no evidence to support his thesis. So, rather than pretending not to know why I would say that there is disrespect and distrust for the orthodox academia here, you either start accepting my views as informed judgments made by a sincere and serious person, or let me back go to my ivory tower to mingle with my fellow sycophants whose testimony would be valueless in New Zealand courts of law and whose over specialized camel swallowing will never convince you..","date":"2012-07-01","mins":"7:12 am","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"id":"comment-13265","author":"davor_aslanovski","post":"And, yes, it is irritation that all these typing mistakes show. It doesn’t irritate me when people disrespect the world of academia, but it does when they pretend not to see what disrespect I could possibly mean..","date":"2012-07-01","mins":"7:23 am","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"id":"comment-13268","author":"davor_aslanovski","post":"John Klotz : It’s Sunday morning and I really shouldn’t be thinnk this way, but does this guy have a phallic complex or what? See what I mean?.","date":"2012-07-01","mins":"7:31 am","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"id":"comment-13267","author":"davor_aslanovski","post":"And the stress in the sentences starting with ‘But I am trained as an art historian’ is mean to be on the ‘AM’… So: ‘But I AM trained as an art historian’, ‘And I AM currently sponsored’ etc. – in contrast to ‘I am NOT a physicist/chemist/botanist etc’.","date":"2012-07-01","mins":"7:30 am","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"id":"comment-13275","author":"davor_aslanovski","post":"Quite to the contrary, I think that my case was very much understated. In my opinion, it was a reticent, meticulous, and objective examination of a very particular question. Followed by an equally understated examination of the history of scientific heresy, with particular focus on Velikovsky and Wilson. If anything has backfired on me, it was rather my decision to discuss this outside the academic world..","date":"2012-07-01","mins":"9:38 am","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"id":"comment-13283","author":"davor_aslanovski","post":"Yes, David, you are right. But these believers believe that they are scientists. And that’s why I brought up Velikovskianism and exoheresy. I wouldn’t walk into a village where simple peasants worship an icon that they believe was painted by St Luke and lecture to them on the improbability of such a thing. But this is something else. This is: ‘St Luke was a painter and all the Christian art drew on what he painted and we can prove it scientifically. We have found a crack in the paint on an old icon in the shape of the philtrum – the philtrum was not painted, it is a crack in the paint, but it was misinterpreted by the artists and copied as a philtrum, which you will find on a number of old icons of Our Lady – both on the Virgin AND ON CHRIST! And this proves that every icon stems from this one source, which was painted by St Luke. And we have analyzed the wormholes in the wood on which the original icon was painted. And if you connect the wormholes (consistently with the paleographic and steganographic data made widely known to us by a retired dental surgeon who made several trips to Mount Athos in his life, both alone and in the company of his plumber who is an expert on the Disciplina Arcani), you will get the letters MP ΘY – which you will find on almost EVERY old icon of Our Lady!!! ‘M’, as was conclusively shown at our 1999 international conference in Las Vegas, stands for the Latin ‘mecum’ – we are still working on the rest of the letters in this arcane message.’ I don’t know about you, but I am a weak man and find such temptations very hard to resist..","date":"2012-07-01","mins":"12:23 pm","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"id":"comment-17596","author":"davor_aslanovski","post":"And do you have any other advice? I mean, after all, I have never published anything in my life… Either as a visual artist or as a writer… Well, I have, but so very little… And you… You… Well, OK, maybe you haven’t published anything, but you are… seventy something? And so if there’s anything from your rich life experience that comes to mind… and could help me… if you’d be so kind. Or if you don’t have any tips, maybe you could just call me a pompous sycophant again… That’s something too… And then maybe Ron the carpet salesman can tell you he seconds your opinion of me… And Dan can ‘promote’ the part of your comment that says that ‘the Turks were Arabs’, and Max Patrick Hamon can write something like ‘Mr Asslickovsky the infallible Catholic anticryptohistorian’, and Yannick can try and turn the conversation to ‘extrapolations, speculations, and suppositions?’ Yeah, let’s do that. Let’s do that for a long time. Good luck to you, guys. Good luck and goodbye..","date":"2012-10-13","mins":"4:45 pm","url":"https://shroudstory.com/2012/10/13/the-beast-is-sindonology/","cat":"history","title":"The beast is ‘sindonology"},{"id":"comment-13639","author":"davor_aslanovski","post":"Daveb of wellington nz : A May 2010 article on Ian Wilson with bio and personal interview in the Australian Catholic Weekly can be rapidly found from Google. For me, this interview speaks more profundly on the honest motives of Ian (…) It provides a moving insight into the motives of the man. Indeed! It says some things very clearly: ‘He studied Modern History at Magdalen College, Oxford, a degree he hoped would lead to a career in journalism, but it was not to be.’ (…) ‘I had absolutely no inclination to become an academic: a history degree was simply a passport to a better job. (…) ‘However, because the job of a junior reporter was poorly paid I opted first to go into advertising, then in 1969 joined the Bristol Evening Post newspaper group as head of its publicity and promotions department. So although for a decade I worked closely with journalists, I never became one.’ So, by his own admission, he studied history with no real interest in it – he just hoped he could get a job in journalism. And when that didn’t come through, he had to find something else. That’s when he met Maurus Green (who needs no introduction here), David Willis (‘a family doctor who had converted to Catholicism largely as a result of his medical studies of the Shroud’ (???!!!)), and Vera Barclay (a popular Scout Mistress). And he embarked on ‘a three month historical research project in the old Reading Room of the British Museum’. (Other people spend years and years grappling with Byzantine sources, which are notoriously difficult to use, as they are largely couched in a theologically or hagiographically inflected language of apology and polemic that is not only very distant from modern habits of mind but also nearly impossible to pin down in factual terms. But this young man, to whom a history degree was only a passport to a better job, did all the research in 3 months.) And ‘…this led in 1978 to the publication of the book which launched me as a full time author.’ And ‘The Turin Shroud was an international bestseller.’ And that was it. The journalism career that he was hoping for never came through, but his family GP and a Scout Mistress helped him find his way..","date":"2012-07-09","mins":"5:47 am","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","title":"The Shroud of Turin: A Modern Relic Cult?"},{"id":"comment-13640","author":"davor_aslanovski","post":"Daveb of wellington nz : His assertions denigrating Ian Wilson’s motives come close to being libellous, and do him no credit. The same can be said about the personal insults hurled here at every scientist who doesn’t agree with even a part of Wilson’s theories..","date":"2012-07-09","mins":"5:52 am","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","title":"The Shroud of Turin: A Modern Relic Cult?"},{"id":"comment-13207","author":"davor_aslanovski","post":"The second and the last part of what I have to say on the matter: http://deumvidere.blogspot.co.uk/2012/06/more on heresies and why they persist.html All the best to everyone!.","date":"2012-06-30","mins":"8:22 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."}],"image":[{"id":"comment-609","author":"davor_aslanovski","post":".","date":"2012-09-05","mins":"2:46 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/09/05/corona-discharge-for-shroud-of-turin-advance-notice-of-my-paper-for-presentation-at-the-quantum-theology-2012-conference-instituto-polytecnica-of-mamma-mia-italy/","cat":"corona_discharge","title":"Corona discharge for Shroud of Turin – advance notice of my paper for presentation at the Quantum Theology 2012 Conference, Instituto Polytecnica of Mamma Mia, Italy"},{"id":"comment-606","author":"davor_aslanovski","post":"Fantastic! You had me laughing so hard I thought I’d make a Corona discharge in my underwear!.","date":"2012-09-05","mins":"12:36 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/09/05/corona-discharge-for-shroud-of-turin-advance-notice-of-my-paper-for-presentation-at-the-quantum-theology-2012-conference-instituto-polytecnica-of-mamma-mia-italy/","cat":"corona_discharge","title":"Corona discharge for Shroud of Turin – advance notice of my paper for presentation at the Quantum Theology 2012 Conference, Instituto Polytecnica of Mamma Mia, Italy"}],"researchers":[{"id":"comment-15721","author":"davor_aslanovski","post":"Charles Freeman has offered the only thing that anyone writing on this subject can do: yet another autopsy of a joke that had already been done to death. In comparison to your autopsy, dear Andrea, Freeman’s is incomparably less exhaustive. In comparison to mine, it is much more general. In comparison to Yannick’s, much more anodyne. In comparison to those of Professors Gramaglia, Brock, or Cameron, Robin Cormack or Hans Belting, it is substantiated by far less of an academic career. So why is Stephen E Jones dissecting this particular one in so many parts, while others have not been granted such dignity? Is it not primarily because Freeman’s article was published on a website ‘Dedicated to Free Inquiry, Naturalistic Humanism, Freethought, and the Philosophies of Naturalism, Empiricism, Rationalism, and Skepticism: The Heritage of the Enlightenment that Produced Science and the Modern World?’.","date":"2012-09-02","mins":"10:53 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15722","author":"davor_aslanovski","post":"In other words, is it not because Jones believes that ‘there is a deeper and darker dimension to these attacks on the Shroud and on Shroud pro authenticists?’ Just read these few lines: ‘Freeman and his anti Christian ilk don’t realise that in so doing they are acting out their part in Christs’ Play. In “The Parable of the Weeds” (Mt 13:24 30) He whose image is on the Shroud told us that He allows these weeds to “grow … until the harvest” at which time (if they don’t repent) He “will tell the reapers, Gather the weeds … and bind them in bundles to be burned.’ Now, Jones doesn’t know whether you are a Christian or not, because your book wasn’t published by a publisher that openly peddles anti Christian pamphlets and eulogies to human reason that produced the horrors of the French Revolution. Hence, your silly book is not of much interest to him. But he positively knows that Freeman (the following is a quote from part one of Jones’ six part bravura) ‘is evidently an atheist/agnostic having published papers critical of Christianity in the New Humanist online magazine, the subtitle of which is “Ideas for godless people”, and is “produced by the Rationalist Association … dedicated to reason, science, secularism and humanism.” Freeman in his review of philosopher James Hannam’s book, “God’s Philosophers: How the Medieval World Laid the Foundations of Modern Science” (2009), describes Hannam as “a Catholic convert,” in contrast to himself, “(I have passed the other way),” so presumably Freeman is now an ex Catholic and an anti Christian.’ And he knows that ‘Therefore, according to Freeman’s presumed personal atheist/agnostic philosophy, Christianity must be false, supernatural miracles are impossible, and the Shroud of Turin must be a fake!’ And he positievly knows that Freeman was mentioned both in the Gospel according to Matthew and in the Apocalypse of John. And he knows that his duty as a Christian is to speak up against this beast. Yannick and I, who claim to be Catholic, although we don’t agree with Wilson (?!?!) are a different thing. There may be some little hope for us. But Freeman is the anti Christ. And Jones will put on his shiny armour and battle this dragon in however many parts it may take to quote the entire ‘Catechism According to Wilson’ and the Wikipedia’s entire entry on logical fallacies. So, no, Andrea, the problem isn’t that your book is in Italian. You are simply not the devil..","date":"2012-09-02","mins":"11:17 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-783","author":"davor_aslanovski","post":".","date":"2012-09-22","mins":"7:49 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/09/22/needed-urgently-scorch-scanner-gd-wkg-cond/","cat":"horse_brass","title":"Needed urgently – scorch scanner (gd wkg cond)"},{"id":"comment-17552","author":"davor_aslanovski","post":"Great news. So now he will no longer aim his quotes at a specific person, in an attempt to ‘refute’ him, he will simply quote because he likes to. He has nothing new to say, but he has nothing better to do either..","date":"2012-10-12","mins":"1:40 pm","url":"https://shroudstory.com/2012/10/12/stephen-e-jones-starting-a-new-series-of-posts/","cat":"other_blogs","title":"Stephen E. Jones Starting a New Series of Posts"},{"id":"comment-17561","author":"davor_aslanovski","post":"And I somehow think Jones hadn’t conducted any recent research in that, or any other, area. Ergo, I expect he has nothing new to say. As is the case with most people who imagine they are involved in Shroud ‘studies’..","date":"2012-10-12","mins":"5:16 pm","url":"https://shroudstory.com/2012/10/12/stephen-e-jones-starting-a-new-series-of-posts/","cat":"other_blogs","title":"Stephen E. Jones Starting a New Series of Posts"}],"resources":[{"id":"comment-13641","author":"davor_aslanovski","post":"David Belz: ‘My main reference source for this article is “The Turin Shroud” by Ian Wilson, Victor Gollancz, 1978’ Dan Porter: ‘It is excellent.’.","date":"2012-07-09","mins":"6:40 am","url":"https://shroudstory.com/2012/07/09/new-article-on-the-shroud-of-turin/","cat":"news_&_views","title":"New Article on the Shroud of Turin"},{"id":"comment-13741","author":"davor_aslanovski","post":"DB, I am sorry, but your name is too difficult for me to spell… so I’ll just use initials. But I’m glad I finally know your full name. Since you were the first to start personally insulting me when I disagreed with your view of history, you will always hold a special place in my heart. Others came after you, with more imaginative insults, but you were my first. So it’s good to know your name. Nice to meet you, DB. They call me DA. And we’re both Catholics. With some interest in the Turin Shroud. Interesting. I will remember you in my prayers and I suggest you remember me before you go to your next confession. Have I spoken ill of someone? Remember that one? Well, in this day and age, it should probably be rephrased into something like: ‘Have I ran off at the mouth in my internet debates?’ But, to business… I don’t understand why you’re working yourself up like this. My only intention was to point out that what Dan rated as ‘excellent’ was nothing but a quote from the ‘sindonological’ catechism. It looks like I touched a delicate point there. I guess we tend to be sensitive when someone lightly dismisses something we’ve put a lot of work in. I’m sorry, but, hey, now you know how it feels, so maybe there’s a chance to learn something. Plus, I didn’t know that it was you who wrote that article. And now I do. As for ‘history’ vs (white coat) ‘science’ in ‘sindonology’, let me use your qualification: I don’t think either would be fit to offer testimony in a New Zealand court of law. I have already confessed that, upon my first reading of Wilson, I thought he presented a pretty strong case. And I have felt very much the same upon reading many other ‘sindonological’ papers. Sure, I noticed that Markwardt doesn’t understand what Disciplina Arcani is, that Vignon has never taken a life drawing lesson, that Dreisbach can’t tell a theological from a historical interpretation, and a couple of million small problems like that… but, in the main, I thought the current ‘sindonological’ story was sound. Then, of course, I examined the historical evidence for myself. That was the part about which I could form my own opinion, because I had both the necessary training and direct access to the object of examination. And I found out that everything was wrong. Indeed, I would be very hard pressed to think of a single thing that the ‘sindonological’ account of history got right. (Perhaps that there was an image in Edessa that was reverently transferred to Constantinople. Or that a look into Byzantine texts and art would be a good place to start. But any further than that and we’re completely off the chart.) And if history has been so terribly misinterpreted, how am I to know that the same has not been done with every other type of ‘evidence?’ I don’t possess the specialist knowledge to go into questions like the bilirubin in the stains on the Shroud. (And, btw, neither did Herbert Thurston, so I don’t know why you’re dragging him out.) What do I know about bilirubin? I can only listen to what others tell me. And after I have seen what violence has been done to history, I cannot trust the (white coat) ‘science’ part of ‘sindonology’ either. In words of George W. Bush, ‘fool me once, shame on you… fool me twice… uhmm… you’re not gonna fool me twice.’ This, I believe, answers all your questions. But just to make sure. A) I do not believe that it is the authentic image of ‘rabbi Yeshua’. Neither do I like it when Christians call Him that (does any New Testament or patristic text call Him that?), nor do we have any RELIABLE evidence for that identification. It MIGHT BE an authentic image. Or it might not. In order to know the truth, the investigation should be conducted within the confines of the academic world, and not the way that it has been conducted by ‘sindonologists’. And the more it is conducted by ‘sindonologists’, the less likely it is to ever be conducted by serious scientists. B) Wilson is at least a good and original writer. Markwardt and Scavone have equally misinterpreted history, but are not even particularly good wordsmiths. So between them and Wilson, I choose Wilson. C) I have shown what I think of the Vignon markings here: http://deumvidere.blogspot.co.uk/2012/07/picture normally says thousand words.html D) As for your last paragraph, the Byzantine attitude towards the sacred is exactly what I am researching. Most particularly, I am looking at anthropomorphic conceptions and representations of the transcendental in Byzantium. So, yes, I’d say I’ve given this some thought. It’s when you go from ‘Byzantines concealed the liturgy of the Eucharist from the common gaze’ to ‘The texts on the Image of Edessa really talk about the Turin Shroud’ that you are pushing a square peg of nonsense into a round hole in my mind. Let me rephrase that last bit. It’s a non sequitur. Oh, and did you not end your article with: ‘In a subsequent article, I hope to outline the evidence for some of the theories concerning the early history of the Shroud prior to its first emergence in France in about 1350.’ Isn’t it pretty obvious what you’re next article will say? So why point out that this part doesn’t yet touch upon the Mandylion theory? Here’s a piece of advice, one Catholic to another: apologize to me and mention your rash words in a confession; give a good thought to the fact that experts have rejected Ian Wilson’s theory; and then be very careful what you tell your ‘diverse community of “ordinary” Catholics’ about historical ‘evidence’..","date":"2012-07-11","mins":"12:13 pm","url":"https://shroudstory.com/2012/07/09/new-article-on-the-shroud-of-turin/","cat":"news_&_views","title":"New Article on the Shroud of Turin"},{"id":"comment-13657","author":"davor_aslanovski","post":"Poor, because it would also have consulted only one source..","date":"2012-07-09","mins":"2:40 pm","url":"https://shroudstory.com/2012/07/09/new-article-on-the-shroud-of-turin/","cat":"news_&_views","title":"New Article on the Shroud of Turin"},{"id":"comment-13680","author":"davor_aslanovski","post":"And I note that daveb, blinded by his personal dislike for me, has once again totally missed my point. It’s not that the article doesn’t PRESENT a full bibliography – it’s that it USES only one reference source. And so it does not ‘inform a modern diverse community of “ordinary” Catholics of an important aspect of their heritage’, but of what Ian Wilson believes and teaches. Judging from what I see here, the author will have achieved his goal if at least one reader is willing to blindly accept Wilson’s teaching and to make it his or her way of imitatio Christi to personally insult anyone who dares to differ..","date":"2012-07-10","mins":"5:16 am","url":"https://shroudstory.com/2012/07/09/new-article-on-the-shroud-of-turin/","cat":"news_&_views","title":"New Article on the Shroud of Turin"},{"id":"comment-11699","author":"davor_aslanovski","post":"Dear Yannick, I agree with you, and I am aware that English is not your first language, but please do get a thesaurus. You have used the words ‘speculations, extrapolations, and assumptions’ in that same order of appearance so many times it’s turning into a mantra. ;).","date":"2012-05-29","mins":"4:42 pm","url":"https://shroudstory.com/2012/05/29/scientific-study-of-the-shroud-of-turin-hampered-by-sturp/","cat":"books","title":"Scientific Study of the Shroud of Turin hampered by STURP?"}]}
