{"art":[{"author":"dennis","post":"when you look at how natured is so well engineered and all forms perfectly together, and the heavens so perfect how can one come to doubt. When a small child looks directly into your eyes and is so trusting, and a persons spirit, you can immediately sence the presence of good and bad people in an instant. When I think of what Jesus did for all people and how he suffered for us… it blows my little mind. Jesus shows Himself in little and big ways so often, especially when I don’t expect Him to be in my time of need!. The fact that Israel is a major country literally a garden in a barren land is reason enough for me to believe in Jesus. Thank you Father for your son Jesus..\n\n","date":"August 13, 2012 at 7:19 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}],"key_evidence":[{"author":"dennis","post":"I love this question. \nFor me, it is the apparent fact that the Shroud shows that a real crucified man was wrapped in the cloth, not a representation of a crucified man, and that man suffered the cruelties of the Cross as described in the Gospels down to the smallest detail. His back shows the beating by the Romans, but it also shows that He bore the Cross for some period of time across his shoulders and his knee shows that the Cross was much to bear in His weakened state. Small details that I don’t think you’d fake.\nAnd all this sits somewhat superficially on the top most fibers of the Shroud. \nI believe when you look at the Shroud, you are looking at the image of Christ at the moment of His Resurrection. It is a snapshot, for lack of a better term, of the Hope that is in us for those that believe.\n\n","date":"January 5, 2014 at 2:55 am","url":"https://shroudstory.com/2014/01/04/what-one-single-characteristic-about-the-shroud/","cat":"uncategorized","title":"What one single characteristic about the shroud  . . . ?"}],"resources":[{"author":"dennis","post":"Where is your evidence for that? \nYour position is that the disciples touched a cloth, spoke with a cloth,and ate with a cloth that contained an as of yet unexplained image of Jesus. The apostle Paul converted when he was made blind by a cloth?\nThe disciples gave their lives believing the Shroud was the Risen Christ? \nThomas was poking his finger in the Shroud when he needed convincing of Christ being alive. \nThere is no factual basis for this belief. \nThink what you will about the authenticity of the Shroud, the disciples believed they saw, touched, and experienced a walking, talking Jesus.\nTheir actions post Crucifiction cannot be explained otherwise.\n\n","date":"December 30, 2013 at 7:45 pm","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","title":"New Video: Discovering Jesus in His Holy Shroud"}]}
