{"art":[{"author":"diane_bowden","post":"So I purchased this book while traveling in Africa. I ran out of reading material during our long travels. I really enjoyed the book and had intended to return with home with it to share with my daughter who just turned 21. As I left our room Jesus revealed to me he wanted me to leave the book behind. I may never know if the book will change the direction of someone’s life in Africa, just as I may never know what the guy in church thought when Jesus prompted me to give him a devotional that I cherished. I do hope someday to thank my savior in person for all he has done. I look forward to being with Jesus and know suffering will no longer exist, or the tempation to sin and fall short. I am afraid to die. I fear when I get to heaven I may regret the life I have lived. I think it is wonderful Jesus has revealed himself to so many of you. Thank you for sharing.","date":"October 26, 2012 at 3:28 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"diane_bowden","post":"When my youngest daughter was 4 I had just finished tucking all 3 children in. They were excited to spend the next day visiting my best friend from college on thier small farm in Stanwood Washington. As I settled into get some rest the holy spirit came to me in a voice that is unexplainable. The voice was crystal clear. The voice told me when you go tomorrow, keep Sarah away from the dog. The voice echoed throughout the night. It awoke with me in the morning. It prompted me on the drive to share with my husband. I sat in silence, perplexed. As I contemplated the notion knowing full well the dog had never been agressive toward anyone we arrived. It was a cold Seattle day. I layered the kids up in boots and sweaters. As my girlfriend and I were preparing things in the kitchen I asked her where the dog was. She said he is in the garage, why? I knowing her faith, told her with out going into detail that I hoped we could keep him in there while the kids played outside. What I did not know was that her husband let him out. Moments later I heard the shriek of my Sarah. As my heart dropped to the floor I ran out the door to see what I knew to be my worst horror. The dog on top of my tiny little girl shaking his head viciously from side to side. He had the meat of her tiny arm in his mouth. We got her in the house and peeled away all 3 layers of clothing. Her tiny arm was purple and you could see indentations of his teeth but her skin was not penetrated due to the thick wool sweater that swallowed her tiny frame. What I have to share with you is why this happened to us. I vowed that if I ever heard this voice again, and it told me to scream the world is ending, I would do just that. A year and a half later Sarah was in first grade but the size of a 4 year old. I was working managing my clothing business that allowed me to work while the kids were in school. Usually I would take them to and fro but being it was conference week the kids had made plans with friends to walk to the boys and girls club from the bus until I picked them up. As I worked that day, the voice came to me again. I began to tremble. It was Sarah again. The voice clearly said, be at the bus to pick Sarah up. I picked up the phone and called my part time employee. I asked her to come as soon as possible and I would explain later. The voice never ceased. As I drove to the bus stop a half an hour early I decided to walk to the boys and girls club to see if anything there was peculiar. The club director was chatty and I found myself growing more and more nervous. I explained I had to go and he followed me out the door talking. I just kept walking faster and faster. What I saw next changed my life forever. The bus stopped. The driver was a substitue I had never seen before. None of Sarah’s friends were with her. 3 children got off the bus. The first boy ran ahead leaving her behind and all alone, the second girl walked to her house. Sarah was alone, head down kicking the rocks as she walked with her tiny Dr. Marten’s. The bus driver pulled away leaving my little girl all alone. As I walked toward her a car came around the corner. It was a cream colored Jaguar. It slowly drove until it was going the same speed she was walking but when it got passed her it did a u turn in the middle of the road. My jaw dropped as I began to run screaming her name. The car crossed over to the wrond side of the road. As it turned I saw a man in the car about 50. The car was heading towards her. If I would not have been there screaming and waving my arms to this day I believe I would never have seen my little girl again. I wrote the liscence plate down and went to the police. The told me since no attempt was made they had no reason to run the plate. Devastated I left. I wish today I would have called the media. What I did to was have a friend at the DMV to run the plate. It was a dealer plate so to this day the name I got back is questionable. Over the years I have tried to check the name on searches that I got back. Sarah is in her first year of college and is on a full ride scholarship for volleyball, she is all of 4’10. I never tell this story. It is just emotional for me to share. A few of my really close friends and family know. Thank you Jesus for saving me and my daughter from a life of torment.","date":"October 26, 2012 at 4:16 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
