{"events":[{"author":"diana_fulbright","post":"Charles – Your explanation of the tetradiplon by the peplos is not very convincing.  First, I doubt a Christian writer of the sixth century would imagine the luster of a pagan festival would somehow increase the glory of Christ.  This is a dubious proposition, if not utterly absurd.  Then I ask if, indeed, the author of the Acts of Thaddeus really meant to imbue his cloth with the aura of the Panathenaea, why would he use tetradiplon, an obscure word with no connection to the peplos.  Clearly, this word tetradiplon, not listed in the unabridged LSJ, was never used to refer to the peplos.  Moreover, in my opinion it is unlikely that a Christian writing in the sixth century would have been so familiar with the Panathenaea, which was banned along with the Olympic games by the Roman Emperor Theodosius in 393.BTW, tetradiplon means 4 x 2, or “four doubled,” not “four doublings.”  Thus, a cloth folded three times yields eight layers, as shown in Wilson’s sketch.  (No doubt you obtained copyright permission.)","date":"October 19, 2012 at 10:10 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"author":"diana_fulbright","post":"Professor Freeman (#36) wrote: “I am simply not convinced by the argument based on the Vignon markings that the Byzantine images of Christ are derived from the Turin Shroud…. the fully frontal faces of Christ are derived from imperial art.”  He refers to the Santa Pudenziana apse mosaic in Rome “where Christ is shown in full, front on and with a beard,as an imperial magistrate.”I support the authenticity of the Shroud of Turin as the cloth that wrapped the body of Christ in the sepulcher.  Yet I agree with you that the Vignon markings and other features of Byzantine Christological iconography cannot credibly be attributed to features of the Shroud facial image.  In several papers, I have shown that these various features are found as standard motifs in Graeco-Roman portraiture.  One such motif, the so-called “topless box,” I also observed on two statues of Sesostris III (12th Dynasty, †1818 BCE).The earliest depictions of Christ drew upon pagan themes and forms (e.g., Christ Helios).  But it is not necessary to point to one area alone of Hellenistic imagery – whether to imperial portraiture, to pagan religious art, or to an often-posited “philosophical,” type – as the inspiration for Christian iconography.  Rather, motifs and conventions of the entire gamut of Hellenistic and Classical portraiture – pagan, imperial and private – provided the foundation for the development of the great body of Christian art.The standard media for paintings from this period were encaustic on wood panel, and thus, unfortunately, few have survived.  (Imperial magistrates?)  Yet  a treasure from the Fayum necropolis – more than one thousand portraits of ordinary upper-class persons of Graeco-Roman Egypt – attests to these frequency of these motifs.I deplore wilshful claims which unwittingly undermine credibility for the Shroud’s authenticity, which is supported by an abundance of valid evidence.  Regarding your comment, “If the bloodstains are AB, then we need to square this with the evidence that AB only appears in the historical record after AD 900.”Recently on this blog, Dr. Kelly Kearse posted information concerning when the AB blood type first appeared in history.  He reports, “AB blood type has been reported in skeletal remains that are approximately 1,600-2,000 years old.”Usually a different objection is raised – that all very old blood will type AB, which Dr. Kearse has refuted, pointing out that the blood of Tutankhamen (18th dynasty, 1322 BCE) was typed A.  You might also want to read his paper, “Blood on the Shroud of Turin: An Immunological Review,” available at http://www.shroud.com/pdfs/kearse.pdf.","date":"October 15, 2012 at 11:20 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"author":"diana_fulbright","post":"You might have noted Maurus Green advanced this hypothesis in support of Ian Wilson’s “attractive theory that the Turin Shroud was the Image of  Edessa.” (“Enshrouded in Silence,” p. 343.)","date":"October 19, 2012 at 11:02 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"}],"history":[{"author":"diana_fulbright","post":"Dear Casabianca Tristan,As an historian, I would like to read your article assessing the historicity of the Turin Shroud.  The Heythrop Journal allows acces only to subscribers or via payment by non-subscribers.  Will you kindly send a copy of your paper to me at sindon@globalweb.net, perhaps with permission to make it available to SSG members, or you might ask Dan to publish the paper on his blog.  Many thanks.  Diana Fulbright","date":"April 14, 2013 at 4:45 pm","url":"https://shroudstory.com/2013/04/09/paper-chase-new-peer-reviewed-article/","cat":"history","title":"Paper Chase:  New Peer Reviewed Article"}]}
