{"dating":[{"author":"doctor_e_hypnosis","post":"It’s always safe to hide behind extremes of terms: this has been “proven” or that has “disproven”. Despite the intense heat and smoke generated by shrodists, little light exists.Most of us seem to agree that it isn’t a painting. It’s a photograph. It’s either a pious piece of mummery or it’s a supernatural photograph. Good to go on that debate.The dimensionality of the image either shows soft, 180 degree backlighting or supernaturally intended artistic preference. Done and done.The original cloth presented was from the 13th century. It isn’t what was asked for it’s what was given. It’s the best we (are permitted by the owners) to have. The very people who first offered it as proof now denounce it as fraud. Guess whose fraud?Other factors: hanging on two threads, an argument that might or might not prove anything except leaving the door open to date, some more. Flower pollens, cloth composition & weave, the same. It looks like a photograph of Leonardo DiVinci to mnay, many people – again, nothing proven – just another open door. A head too big, an arm too long – ok, maybe Jesus was a circus freak, too. I can see how his followers would forget to mention it. Maybe the cloth was stretched as much as the truth, and metersticks just don’t measure up when the presence or absence of God is at stake.Most elements of the photograph have been faithfully reproduced by modern technology – technology DiVinci and his peers may be expected to have had the likes of. But not every element has been reproduced. We also cannot rebuild the Saturn V rocket. It is well known that much of that technology has been lost and can’t be simply back-engineered.Or maybe the Saturn V was built by God. Yeah. That.You know what Occam’s Razor says? It says Bigfoot and the little fairies came and danced a merry dance on MY back lawn last night, around 3:00 am. I have evidence to support this. More than two slender threads. Prove it couldn’t have happened. This is the will of God: Believe what you will, o’ ye of little faith!One splinter of Christianity.I am a Pagan Pantheist, and I approve of this “debate.” My laughter is loud and long. Keep me entertained.Oh. And I seriously doubt the concession stand or the parking is free. If this is not generating money for Mother Church and other Christian agencies, I’ll just ask to see their OTHER set of books.Which I can, with my puissant and condign powers of Witchcraft, can predict, they will be as unwilling to show as they were and still are to present a swatch of the Shroud that would end this debate FOREVER.Thank you.","date":"April 1, 2010 at 2:17 pm","url":"https://shroudstory.com/2010/03/31/a-good-review/","cat":"carbon_14_dating","title":"A Good Review"}]}
