{"art":[{"id":"comment-2453","author":"domenico","post":"About this topic: “CSOCSAN DE VARALLJA, Eugene – The Turin Shroud and Hungary”. According to De Varallja are not the Justinian II coins related with the Shroud but the bezantes subsequent the 944 AD when the Edessa Mandylion came to Constantinople. Http://epa.oszk.hu/01500/01536/00015/pdf/UJ 1987 001 049.pdf.","date":"2011-02-12","mins":"3:01 pm","url":"https://shroudstory.com/2011/02/12/more-on-two-coins-two-lines-two-questions/","cat":"art","title":"More on Two Coins, Two Lines, Two Questions"}],"blood":[{"id":"comment-19055","author":"domenico","post":"Mr Freeman you write in one of your articles that AB ” is the newest blood group in evolutionary terms and results from the mingling of Caucasian blood group A and Mongoloid blood group B. At first such a mutation would have been very rare and is virtually unknown before AD 900″. As you are an historian and not an expert scientist anthropologist or evolutionary biologist, could you give me your source for this statements? where have you read that there was a ‘mutation’ around AD 900 and that AB group resulted from the mingling of Caucasian and Mongoloid?.","date":"2012-11-15","mins":"4:51 am","url":"https://shroudstory.com/2012/11/14/early-evidence-of-ab-blood/","cat":"blood_studies","title":"Early Evidence of AB Blood"},{"author":"domenico","post":"As often D'Adamo's theory is quoted in order to criticize the authenticity of the Shroud (if AB blood is recent the Shroud or the blood can not be 2000 years old)I would point out that Dr. D'Adamo is not a scientist. Dr. D'Adamo has no scientific publications and his theory about recent AB blood is published in a diet book!Prof. Gregory Thiemann from York University published an article criticizing this theory.\"Evolution, blood types, and weight loss: A critical examination of a popular diet\", Proceedings of the Nova Scotian Institute of Science 43.\"While it seems odd that Type AB didn't emerge until very recently despite the coexistence of Types A and B for at least 10000 years, D'Adamo & Whitney base their timelime on the fact that \"prehistoric graves in Hungary show a distint lack of this blood groop\".It would be interesting to know precisely how many graves were examinated considering that blood group AB is quite rare in the modern human population\". (p.61)\"the various blood types therefore evolved before humans, chimpes or gorillas\".. \"It is clear that blood groups pre date the exsistence of Homo spp.\" (p.63)http://fatlab.biology.dal.ca/docs/data/thiemann NSIS 2005.pdf.","date":"2011-08-02","mins":"3:08 PM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n"}],"dating":[{"id":"comment-4552","author":"domenico","post":"Well, contrary to those who are writing these comments, Giulio Fanti has personally examined many fibers and threads coming from the TS. He Also Studied fibers from C14 area in proximity of the “reserve” sample. Do not you think that if he had found something to support Rogers or Benford Marino’s theory he would be the first to be happy?.","date":"2011-11-04","mins":"6:41 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","title":"A Reaction to Giulio Fanti’s Suggestion"},{"id":"comment-2266","author":"domenico","post":"The handwriting is by Dr.Colntet who corrected the data given by Donahue. At the top of the letter I can guess to read: “Claude a M.. Le total de 52.36 etait faux; c’est moi qui à rectifiè sur cette copie; j’ai d’autres lettres manuscrites de Donahue. Amitiès, Claude” “Claude to M. The total of 52.36 was false: I made the changes on this copy; I have other handwritten letters from Donahue”. The change was 14.27 to 14.72 according with Dr. Van Haelst’s paper and Prof. Jull’s letter to Prof. Fanti..","date":"2011-01-23","mins":"9:32 am","url":"https://shroudstory.com/2011/01/23/arizona-radiocarbon-dating-samples-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Arizona Radiocarbon Dating Samples of the Shroud of Turin"},{"id":"comment-2155","author":"domenico","post":"I know that the two sides of the Shroud are very different; unfortunatly I can not find a close up photo of the backside from another source. A question for Jull: how could his laboratory preserve a piece of the Shroud if they did not know wich sample was the original Shroud?.","date":"2011-01-07","mins":"8:09 am","url":"https://shroudstory.com/2011/01/06/is-this-the-other-side-of-the-same-fragment/","cat":"carbon_14_dating","title":"Is this the other side of the same fragment?"},{"id":"comment-2165","author":"domenico","post":"The image from Zurich sample is very interesting: it shows the differences between the two sides of the Shroud (Z1.1.1 is from the top, the others photos seems from the backside). The photo shows also a reweaving. Halfsample Z1.1 (25.9 mg.) was divided in three subsamples (4.8+7.2+11.2): is there something wrong? are 2.7 mg missing?.","date":"2011-01-08","mins":"8:48 am","url":"https://shroudstory.com/2011/01/06/is-this-the-other-side-of-the-same-fragment/","cat":"carbon_14_dating","title":"Is this the other side of the same fragment?"},{"id":"comment-2166","author":"domenico","post":"We know that Zurich laboratory made 5 datations; in the photo we see three subsamples; where are from the other two subsamples dated? Have they divided Z1.2 in two? but a ca. 13 mg. Sample is a waste of material if they have dated a 4.8 mg sample. So it’s very likely that also Zurich laboratory retained a Shroud sample..","date":"2011-01-08","mins":"9:06 am","url":"https://shroudstory.com/2011/01/06/is-this-the-other-side-of-the-same-fragment/","cat":"carbon_14_dating","title":"Is this the other side of the same fragment?"},{"id":"comment-2179","author":"domenico","post":"According to Dr. Remi Van Haelst in the Arizona laboratory: “The sample was cut in four pieces, who were weighted after chemical cleaning, by Dr. Toolin : 13.86, 12.39, 11.83 and 14.72. Mg”. Http://www.shroud.com/vanhels5.pdf Who gave this information to Dr. Van Haelst? I think that an information so precise could came only from the laboratory itself. But is the 12.39 mg. Sample weighed by Toolin the same that now Jull have analyzed (Jull’s sample has the same weight)? This is very important because this information says us that this sample was chemical cleaned! In the Tucson laboratory there is much confusion..","date":"2011-01-10","mins":"5:16 am","url":"https://shroudstory.com/2011/01/06/is-this-the-other-side-of-the-same-fragment/","cat":"carbon_14_dating","title":"Is this the other side of the same fragment?"},{"id":"comment-2263","author":"domenico","post":"Look at this technical book about French reweaving : http://shrouduniversity.com/frenchreweavinginstructionbook.pdf.","date":"2011-01-23","mins":"6:30 am","url":"https://shroudstory.com/2011/01/21/link-to-tyrers-significant-paper/","cat":"carbon_14_dating","title":"Link to Tyrer’s Significant Paper"},{"id":"comment-2264","author":"domenico","post":"Arizona laboratory had four pieces wich weighed: 12.39, 14.72, 11.83 and 13.86. Let’s remember that Donahue writing to Fr. Bonnet Eymard gave the weight of 14.27 instead of 14.72. Http://www.crc internet.org/shroud3.htm This is important because it shows that the weights provided by Prof. Van Haelst on page 5 of the paper “RADIOCARBON DATING THE SHROUD OF TURIN THE NATURE REPORT” (http://www.shroud.com/vanhels5.pdf) were the right ones and they came directly from the Laboratory.. But Prof. Van Haelst writes also that those weights were taken after the cleaning procedure by Dr. Toolin. Is this information also from the Laboratory? is it correct? or this is one of the many inaccuracies given by the Laboratory?.","date":"2011-01-23","mins":"7:33 am","url":"https://shroudstory.com/2011/01/21/mark-oxleys-paper-is-a-must-read/","cat":"carbon_14_dating","title":"Mark Oxley’s Paper is a Must Read"},{"id":"comment-2008","author":"domenico","post":"According to the Nature’s article: “All laboratories examined the textile samples microscopically to identify and REMOVE any foreign material….. AFTER these initial cleaning procedures, each laboratory split the samples for further treatment. The Arizona group split each sample into four subsamples…”. Jull in his recent paper states that he found cotton fibers in his sample. But that’s impossible if Nature tell us the truth! from Nature’s: “The Arizona group split each sample into four subsamples. One pair of subsamples from each textile was treated with dilute HCL, dilute Na OH and again in acid, with rinsing in between (method a). The second pair of subsamples was treated with a commercial detergent (1.5% SDS), distilled water, 0.1% HCL and another detergent (1.5% triton X 100)…”. Again: How could prof. Jull have found in his sample wax, spores, iron oxide if the 4 subsamples were treated?.","date":"2010-12-24","mins":"9:30 am","url":"https://shroudstory.com/2010/12/24/more-about-julls-paper-in-radiocarbon-journal/","cat":"carbon_14_dating","title":"More About Jull’s Paper in Radiocarbon Journal"},{"id":"comment-2028","author":"domenico","post":"Ann Hedlund, the textile expert consulted by Jull, established that the warp fabric count is 30 yarns per cm (76 per inch) and the weft is 40 yarns per cm (102 inch). That is very strange since other experts counted differently: Timossi: warp/40 weft/27 Raes: warp/38,6 weft/25,7 Vial: Warp/37,6 weft/25,8 Vercelli: warp/36 weft/24 Hedlund/Jull: warp/30 weft/40.","date":"2010-12-27","mins":"7:47 am","url":"https://shroudstory.com/2010/12/24/more-about-julls-paper-in-radiocarbon-journal/","cat":"carbon_14_dating","title":"More About Jull’s Paper in Radiocarbon Journal"},{"id":"comment-2251","author":"domenico","post":"It’s amusing to recall that Jull writes in his recent paper: “an excellent objective technical description of the shroud, its possible origins and weaving technologies, is given by Tyrer (1981).”.","date":"2011-01-20","mins":"12:06 pm","url":"https://shroudstory.com/2011/01/20/more-stll-on-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"More Still on Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-2252","author":"domenico","post":"The link for Tyrer’s article: http://www.sindone.info/TYRER1.PDF.","date":"2011-01-20","mins":"12:14 pm","url":"https://shroudstory.com/2011/01/20/more-stll-on-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"More Still on Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-2064","author":"domenico","post":"It’s a bit unbelievable that Jull and Freer Waters are working on this small sample since the 2008 (http://uanews.org/node/22384) and after two years have produced a paper so poor: only microscopical analysis at max 320x (Rogers observations were at max 800x); no chemical analysis (Rogers made many chemical analysis); fiber unidentified! and they can not tel us if the cotton is on or in the threads!.","date":"2011-01-01","mins":"8:57 am","url":"https://shroudstory.com/2011/01/01/the-danger-in-abstracts-of-scientific-papers/","cat":"carbon_14_dating","title":"The Danger in Abstracts of Scientific Papers"},{"id":"comment-2449","author":"domenico","post":"Raes examined the so called “Raes Corner”; as the name suggests it’s a piece of textile even more external that this of the carbon dating; So when Raes writes “main cloth” he means the border, an area that could have easily been manipulated. Only in this area we have a verified presence of cotton inside the linen threads. Http://www.ohioshroudconference.com/a17.htm Rogers writes: “Cotton fibers are easy to find mixed intimately with the linen fibers of Part I Raes threads….I do not attempt to make a quantitative cotton comparison between Raes and radiocarbon threads and Shroud tapes, because there was too little cotton of any kind on Shroud samples. We had been puzzled by the Raes report at the time of the 1978 STURP observations in Turin. We could not find more than traces of cotton on the Shroud. The cloth appeared to be pure linen.” (Rogers, “A Chemist’s Perspective On The Shroud of Turin”, p.66).","date":"2011-02-12","mins":"2:41 am","url":"https://shroudstory.com/2011/02/11/the-question-of-cotton-in-the-shroud-of-turins-yarn/","cat":"carbon_14_dating","title":"The Question of Cotton in the Shroud of Turin’s Yarn"},{"id":"comment-2141","author":"domenico","post":"1) I think this is the reverse of the sample. 2) We know that also Zurich laboratory preserved a piece of the sample. 3) I would remember a previous observation I made about Jull’s sample: Ann Hedlund, the textile expert, established that the warp fabric count is 30 yarns per cm and the weft is 40 yarns per cm. But other experts who studied the textile of the Shroud counted differently: Timossi: warp/40 weft/27 Raes: warp/38,6 weft/25,7 Vial: Warp/37,6 weft/25,8 Vercelli: warp/36 weft/24 Hedlund/Jull: warp/30 weft/40 Vercelli’s count is very important because was made on a c14 sample..","date":"2011-01-06","mins":"6:48 am","url":"https://shroudstory.com/2011/01/05/was-the-sample-used-in-the-jull-paper-not-from-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Was the sample used in the Jull paper NOT from the Shroud of Turin?"},{"id":"comment-2154","author":"domenico","post":"A moment: the threads count was made by Freer Waters or by textile expert Ann Edlund? or by both? Gian Marco Rinaldi is a mathematician but he seems to know the textile topic better. Anyway: and the peer review process?.","date":"2011-01-07","mins":"7:54 am","url":"https://shroudstory.com/2011/01/06/what-is-going-on-at-the-ams-laboratory-at-the-university-of-arizona/","cat":"carbon_14_dating","title":"What is going on at the AMS Laboratory at the University of Arizona?"}],"history":[{"id":"comment-12996","author":"domenico","post":"And what is Freeman’s interpretation or explanation of ‘tetradiplon’?.","date":"2012-06-25","mins":"3:11 am","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"id":"comment-2415","author":"domenico","post":"And do not forget: 1) Jesus’burial was not a completed burial; 2) it was the burial of a man who died violently and was covered with blood. I quote from Ian Wilson: “As any true expert in Jewish burial tradition will point out, the particular deceased person whom we see on the Shroud will have needed some very different funerary arrangments, because he self evidently died a violent death – i.e. Crucifixion – during wich his body became extensively stained with his life blood. […] As explained by Victor Tunkel [Faculty of Laws, Queen Mary College, University of London], in the case of a heavily bloodstained corpse the ritual required as much avoidance as possible of any disturbing of the blood… The sovev [the shroud/sheet] therefore had to be an all enveloping cloth that is a single sheet used to go right round the entire body.” (Ian Wilson, The Blood and the Shroud, p. 64 65) Archaeologically speacking, we don’t have any incomplet first burial or a first burial of a man violently deceased..","date":"2011-02-08","mins":"3:47 am","url":"https://shroudstory.com/2011/02/07/paper-chase-a-clean-cloth-by-diana-fulbright/","cat":"history","title":"Paper Chase: A Clean Cloth by Diana Fulbright"},{"id":"comment-2230","author":"domenico","post":"Who is interested can find the article about the radiocarbon dating at this link (p.303): http://onlinelibrary.wiley.com/doi/10.1111/j.1475 4754.1987.tb00421.x/pdf.","date":"2011-01-18","mins":"10:03 am","url":"https://shroudstory.com/2011/01/18/templecombe-and-the-shroud-of-turin-continued/","cat":"history","title":"Templecombe and the Shroud of Turin (Continued)"}],"image":[{"id":"comment-2140","author":"domenico","post":"I would to thank Prof. Garlaschelli for his work. He has clearly shown that even a competent professor of chemistry with all modern technologies and knowledge could not reproduce the Shroud. He failed to do what some say would have done an unknown medieval craftsman!.","date":"2011-01-06","mins":"6:33 am","url":"https://shroudstory.com/2011/01/04/paper-chase-in-case-you-still-thought-the-garlaschelli-technique-might-have-been-used-to-create-the-shroud-of-turin/","cat":"image_theory","title":"Paper Chase: In Case You Still Thought the Garlaschelli Technique Might Have Been Used to Create the Shroud of Turin"},{"id":"comment-2406","author":"domenico","post":"Prof. Mc Crone claims to be familiar “with pigments, media and artist’s paintings”. He is a real expert unlike all others. At this point why do not recall that in 1997 Mc Crone declared “100 percent unadulterated Rembrandt” some chips from paintings that after subsequent tests were found as fakes? http://pqasb.pqarchiver.com/bostonherald/access/18373418.html?FMT=ABS&FMTS=ABS:FT&date=Oct+15%2 C+1997&author=Tom+Mashberg&pub=Boston+Herald&edition=&startpage=004&desc=Art+expert+says+paint+chips+are+Rembrandt%27s+ +Analysis+could+aid+return+of+Gardner+paintings http://articles.latimes.com/1997/dec/06/news/mn 61112.","date":"2011-02-07","mins":"3:17 am","url":"https://shroudstory.com/2011/02/06/thoughts-for-a-sunday-morning-if-i-am-right-then-i-am-right/","cat":"image_theory","title":"Thoughts for a Sunday Morning: “If I am right, then . . . I am right.”"}],"misc":[{"id":"comment-6988","author":"domenico","post":"Could you be more specific? “I have seen many papers being published on the Shroud in such journals (claimed as peer reviewed)”… Names please….","date":"2012-01-15","mins":"5:47 am","url":"https://shroudstory.com/2012/01/13/and-you-thought-you-knew-all-about-peer-reviewed-journals/","cat":"news_&_views","title":"And you thought you knew all about peer reviewed journals."},{"id":"comment-6989","author":"domenico","post":"I was referring to this: http://mcri.org/home/section/71 72/the microscope journal.","date":"2012-01-15","mins":"5:49 am","url":"https://shroudstory.com/2012/01/13/and-you-thought-you-knew-all-about-peer-reviewed-journals/","cat":"news_&_views","title":"And you thought you knew all about peer reviewed journals."},{"id":"comment-2108","author":"domenico","post":"William, reading this blog you could find information about Emmanuel Poulle’s articles: https://shroudofturin.wordpress.com/2011/01/01/historian emmanuel poulle and the shroud of turin/ About Chevalier you can read: “Le Linceul de Turin victime d’Ulysse Chevalier”. If you don’t know Emmanuel Poulle you can read: http://fr.wikipedia.org/wiki/Emmanuel Poulle http://www.aibl.fr/fr/membres/academ/poulle.html.","date":"2011-01-04","mins":"4:40 am","url":"https://shroudstory.com/2011/01/02/let-the-debates-begin/","cat":"news_&_views","title":"Let the Debates Begin"}],"opinion":[{"id":"comment-160349","author":"domenico","post":"” … for the simple reason that it was more common at that time for the bones to be placed in ossuaries. ” the bones were placed in the ossuaries after one year of burial. In tombs excavated we find both skeletons in their coffin or loculus and the ossuaries..","date":"2014-10-08","mins":"4:48 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-3707","author":"domenico","post":"Only a brief note to the claim that the Shroud shows a “man about six feet tall, which would make this “Jesus” a Goliath by first century standards”. This claim is from Nickell’s books.. Does the writer know that in Jericho, Israel, there is a famous tomb from Second Temple Period known as “Goliath Tomb” in wich skeletons height 1,8 m. Were found (one of them was 1,88)?.","date":"2011-08-28","mins":"5:02 am","url":"https://shroudstory.com/2011/08/27/freethought-shroud-be-accurate-and-factual/","cat":"other_blogs","title":"Freethought Should Be Accurate and Factual"},{"id":"comment-157716","author":"domenico","post":"Yannick Clément, please ask Mr. Zias (who as an expert in the crucifixion in antiquity can not fail to know) where we can read this: “In two cases — I/ 1 and III/2 — the presence of a salty liquid at the top of the ossuary had preserved bunches of withered flowers (in the first case) or plaited bundles of cereal spikes (in the second case). In I/1, two skulls (male and female) ) and the long bones were found at the top of the ossuary, with the flowers.”.","date":"2014-09-29","mins":"12:23 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-158560","author":"domenico","post":"I give a more complete quote: “In two cases — I/ 1 and III/2 — the presence of a salty liquid at the top of the ossuary had preserved bunches of withered flowers (in the first case) or plaited bundles of cereal spikes (in the second case). In I/1, two skulls (male and female ) and the long bones were found at the top of the ossuary, with the flowers.The long bones belonging to the two individuals where fastened togheter with a plaited bundle of plant stems. This ossuary was labelled: ‘Simon, builder of the Temple’. In the second case (III/2) … a number of carbonized seeds (barley = hordeum perlatum) were found among the bones).” As we can read Haas is very accurate non only in the identification of the seeds but in to specify why only these ossuaries had preserved the flowers, the plants and the seeds. Mr. Zias, if you do not mind, I can not think that Haas was unable to recognize a flower from a root (he specifies that it was all ‘well preserved’) and to recognize the presence of infiltrating roots in stone ossuaries (there were visible cracks in the case of infiltration). I can not think about infiltrating roots that could wrap only the long bones but not the skulls which where at the top of the ossuary too and in any case the bundles of cereal spikes and the carbonized seeds of barley did not arrive there by infiltration..","date":"2014-10-02","mins":"5:25 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-159752","author":"domenico","post":"On behalf of Mr. Zias: 1) Kokhim/loculi and burial chambers were carved into the rock. To write about “decayed roots from plants/ trees which had infiltrated from above the tomb” does not make sense as there are no infiltrated roots in those chambers. It suffices to search google image for ‘Kokhim’ to realize that it is impossible any infiltration of roots ‘from above the tomb’. 2) Vassilios Tzaferis confirms in his report published on BAR that “One ossuary also held a bouquet of withered flowers.” Was he mistaken too?.","date":"2014-10-06","mins":"4:33 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-160611","author":"domenico","post":"Zias: “There is some evidence in but a few ossuaries that some liquid was poured over the bones, but no one ever tried to find which.” Few ossuaries. Really? Let’s read Haas’ article. “Fifteen limestone ossuaries were found… In the 13 completely filled ossuaries, considerable moisture was found, bringing about a peculiar kind of preservation of the packed bones… A syrupy fluid was found filling the lower third of 13 ossuaries. The bones and other material immersed in this fluid were coated with a limy sediment. On the surface of some bones dark brown blotches were occasionally observed, or even a thick, adherent black brown crust.” Do you really call 13 of 15 ‘few’? p.s. In my previous comment I quoted Tzaferis’ article on BAR. It is on line: http://www.biblicalarchaeology.org/daily/biblical topics/crucifixion/a tomb in jerusalem reveals the history of crucifixion and roman crucifixion methods/.","date":"2014-10-09","mins":"5:50 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-159766","author":"domenico","post":"Dan, I would not talk about ‘exceptions’ regarding the issue of the flowers. The fact is, that ossuaries still closed and intact with their liquid inside are very few and incidentally inside one of the few discovered there were flowers! Please note that Tzaferis and Haas writing plainly about ‘withered flowers’ seem not to consider an oddity their finding and they were of course expert of Jewish customs. It is true that we do not have flowers or plants associate with a burial shroud but are you aware how many burial shroud have been discovered in conditions to allow the preservation of plant material?.","date":"2014-10-06","mins":"5:13 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-160072","author":"domenico","post":"David, I offer you this counterexample. In the thousands of tombs excavated in Jerusalem were found only three examples of burial shrouds (actually one certain and the other two dubious). Should we conclude that the burial shrouds were not a Jewish common practice?.","date":"2014-10-07","mins":"4:54 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-159778","author":"domenico","post":"Please ask Dr Lombatti: of the three thousand tombs explored how many were untouched by robbers and were still closed at the time of investigation?.","date":"2014-10-06","mins":"6:25 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-160344","author":"domenico","post":"David, the coins attract thieves, degraded tissues do not. Do you see the difference? And in any case in arid climates tissues, though in fact degraded, could be preserved quite well..","date":"2014-10-08","mins":"4:42 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"}],"pollen":[{"author":"domenico","post":"Mr. Jones,prof. Danin quotes in his last book prof. Litt sayng: \"I cannot make a precise identification of the pollen at the genus level, even less at the species level. However, with a high level of probablility, I can exclude that the pollen I have seen from the sticky tapes belong to Gundelia.\".but from your post I understand that prof. Litt made indeed an indentification at the genus level (cardus) even if he has previously said it was not possible..So, prof. Litt has changed his mind?.","date":"2010-08-13","mins":"4:12 PM","url":"http://theshroudofturin.blogspot.com/2008/11/did-max-frei-misidentify-carduus.html","title":"\nDid Max Frei misidentify Carduus argentatus Shroud pollen as Gundelia tournefortii?\n"}],"researchers":[{"id":"comment-12268","author":"domenico","post":"Let’s remind to Mr. Lombatti Emmanuel Poulle’s articles: http://cat.inist.fr/?a Modele=affiche N&cpsidt=18512573 http://www.rhe.eu.com/pages/rhe195.asp.","date":"2012-06-12","mins":"9:11 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"id":"comment-12496","author":"domenico","post":"Could Dr. Lombatti prove that Geoffroy de Charny was given a ‘fake’ relic made in France and not a ‘true’ relic carried by crusaders returning from Turkey?.","date":"2012-06-15","mins":"3:29 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"id":"comment-12504","author":"domenico","post":"Lombatti writes: “I’d like to let you know that the same version of my paper has been accepted in the Journal of Biblical Literature”… This is a little puzzling. As far as I know the JBL does not accept articles appeared elsewhere even in another language. Could Dr Lombatti clarify this point?.","date":"2012-06-15","mins":"5:04 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"id":"comment-12346","author":"domenico","post":"“I cannot understand why here so many people is speaking about what is not yet published”… good question Mr Nicolotti. But where or by whom the journalist of the Daily Mail has taken this story?.","date":"2012-06-13","mins":"4:30 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"id":"comment-12348","author":"domenico","post":"“But I could not omit to say how was wrong your statement about the value of “Studi medievali”, one of the most renowed reviews about medieval history on the world .” I agree of course; but I have to disagree with Mr Lombatti’s claim that “lots of claims have been around lately on the Turin Shroud and none of them underwent the evalution of scholars in a journal”. Supposing that Mr Lombatti was talking about the historical field and not the scientific field he can not dismiss Emmaunell Poulle’s article “Les sources de l’histoire du linceul de Turin. Revue critique” published in the peer reviewed ‘Revue d’Histoire Ecclésiastique’..","date":"2012-06-13","mins":"4:40 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"id":"comment-12261","author":"domenico","post":"There is one thing I would appreciate. If, as Lombatti claims, ”the shroud was most likely given to French knight Geoffroy de Charny as a memento from a crusade to Smyrna” and if the Shroud “appears to have originated in Turkey” this means that the D’Arcis memorandum (where the Shroud is said made in France by an artist who lived there and procured by the Dean of the Lirey Collegiate for gain) loses any historical value. So, Mr. Lombatti with his peer review article completely dismisses the D\\’arcis memorandum and backs the Shroud in the East. The question is: what Geoffroy de Charny received ? something done then or something that was over there long time?.","date":"2012-06-12","mins":"8:16 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"id":"comment-4633","author":"domenico","post":"I think this is Fanti’s answer: http://www.dim.unipd.it/fanti/diffusion.pdf.","date":"2011-11-07","mins":"6:27 am","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","title":"A Guest Posting by Giulio Fanti"},{"id":"comment-4627","author":"domenico","post":"But if these ‘forces of nature’ occurred only once in history to form an image in a cloth (as we do not know other cloths with a same image) we should ask why this happened….","date":"2011-11-07","mins":"3:04 am","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","title":"A Guest Posting by Giulio Fanti"},{"id":"comment-6244","author":"domenico","post":"“bishop’s report of the forger’s confession”? first: a report without the name of the forger: very strange indeed! second: the bishop who reports the confession was not the bishop who listened the ‘forger’: very strange indeed!.","date":"2011-12-29","mins":"3:33 am","url":"https://shroudstory.com/2011/12/28/put-another-nickell-in-in-the-nickelodeon-2/","cat":"news_&_views","title":"Put another Nickell in . . . In the nickelodeon"},{"id":"comment-4595","author":"domenico","post":"Could Yannick Clément tell us if he knows an ‘all natural’ physical/chemical method that could form an image with all the features of the Shroud image? And statistically how many possibilities there were tha this natural method (whatever was) happened only once in history ?.","date":"2011-11-05","mins":"9:37 am","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","title":"A Guest Posting by Giulio Fanti"},{"id":"comment-3463","author":"domenico","post":"Has Prof. Bernstein read or cited Heller, Adler, “A chemical investigation of the Shroud of Turin”, Canadian Society of Forensic Science Journal 14(3), 81 (1981)?.","date":"2011-07-29","mins":"2:19 am","url":"https://shroudstory.com/2011/07/28/stephen-e-jones-report-on-the-lecture-by-joel-bernstein/","cat":"news_&_views","title":"Stephen E. Jones’ Report on the Lecture by Joel Bernstein"}],"resources":[{"id":"comment-2050","author":"domenico","post":"I would point out that the threads of the sample from the C14 area were given to Rogers by prof. Gonella (the Archbishop of Turin’s scientific adviser); Gonella died in 2007, two years after Rogers’ paper, and he has never denied the Rogers’ version: Gonella excised the threads from the centre of the radiocarbon sample A. For Episcopalian: please note that Jull in his paper writes “radiocarbon samples” in inverted commas; Nickell in the article linked by william does the same: coincidence?.","date":"2010-12-31","mins":"6:06 am","url":"https://shroudstory.com/2010/12/30/outstanding-response-to-recent-carbon-dating-paper/","cat":"books","title":"Outstanding Response to Recent Carbon Dating Paper"},{"id":"comment-3440","author":"domenico","post":"Nickell is a real hypocrite. Frei “made a fool of himself authenticating the notorious Hitler Diaries.”? Nickell never remember when speaks or writes about the Shroud that to authenticate the diaries was also Ordway Hilton who was according NYT “One of the nation’s foremost authorities on detecting forged documents”. Http://www.nytimes.com/1998/05/10/us/ordway hilton 84 authority who detected forged papers.htmll Let’s read as NYT justify Hilton’s mistake: “Given what he was told were photostatic copies of pages from the diaries and examples of Hitler’s writing, Mr. Hilton said that both sets of documents had been produced by the same hand. Indeed, they had, though the common hand turned out not to have been Hitler’s but the forger’s.”. It is evident that the same justification should be given to Frei if someone is honest! But there is other. Nickell is very very hypocrite because in his book “Detecting forgery: forensic investigation of documents” writes; “in 1983 three examiners declared the diaries genuine. Unforunatley they had allowed Stern magazine, who commissioned them, to supply the alleged standards; it turned out that some of those were also Kujau forgeries”. So Nickell knows the thruth but when he needs to attack Max Frei forget it! And Ordway Hilton is one of the handwriting expert most quoted in Nickell’s books about forensic science!.","date":"2011-07-27","mins":"3:41 am","url":"https://shroudstory.com/2011/07/26/%e2%80%aaan-invitation-to-discuss-the-shroud-of-turin-youve-got-to-be-kidding/","cat":"video","title":"‪An invitation to discuss the Shroud of Turin. You’ve got to be kidding."}],"textile":[{"id":"comment-3795","author":"domenico","post":"According Atanasius, Pope Sylvester I (314/335) ordinated that the Sacrifice should be offered not on a silk or colored cloth but only on a white linen cloth. “Constitutio sancti Silvestri papae statuit ut sacrificium altaris non in serico, neque in panno tincto celebretur, nisi tantum in lineo terreno procreato, sicut corpus domini nostri Jhesu Christi in syndone munda sepultum est”. In 382 St. Optatus Bishop of Milevis in Numidia (4th century) presupposes that their use is universally known, exclaiming: “Who among the faithful are ignorant of the fact that in the celebration of the Divine Mystery the wooden altar is covered with a linen cloth ?”...","date":"2011-09-06","mins":"1:48 am","url":"https://shroudstory.com/2011/09/05/more-on-the-tablecloth-of-turin-linen-cloth-used-for-the-eucharist-communionmass/","cat":"news_&_views","title":"More on the Tablecloth of Turin: Linen Cloth Used for the Eucharist (Communion/Mass)"}]}
