{"dating":[{"author":"don","post":"I guess whoever fried de Charny must have added the burn holes after seeing the Hungarian Pray Manuscript! yeah right\n\n","date":"January 26, 2014 at 11:19 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"don","post":"I couldn’t careless about the carbon dating of the shroud. It failed. If we carbon dated the known age of the Hungarian Pray Manuscript Illustrations, it would have failed to have the date within range. Would you trust the dating method?\n\n","date":"February 1, 2014 at 11:02 pm","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?"}],"history":[{"author":"don","post":"“And so Simon Peter also came, following him, and entered the tomb; and he saw the linen wrappings lying there, and the face-cloth which had been on His head, not lying with the linen wrappings, but rolled up in a place by itself.” John 20:6. Off topic, I believe that the Sudarium of Oviedo is the face cloth of Jesus. How is it possible to not show any smearness of blood on the TS if Jesus removed the face cloth and wrapped it before He projected His likeness on the burial shroud? Since there are no image on the face cloth?\n–\n\n","date":"August 12, 2014 at 11:42 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"author":"don","post":"Charles Freeman is just another Joe Nickell.\n\n","date":"October 25, 2014 at 9:12 am","url":"https://shroudstory.com/2014/10/23/the-guardian-notes-the-history-today-article-by-charles-freeman/","cat":"history","title":"The Guardian Notes the History Today Article by Charles Freeman"},{"author":"don","post":"Colin’s scorch theory is the most ridiculous absurd thing I have ever heard. And he’s a scientist??  A theory best fit for front cover of World Weekly News!\n\n","date":"February 5, 2014 at 6:11 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"}],"image":[{"author":"don","post":"They keep forgetting about the blood. Blood would have to go on the cloth before dye imprint. Can a medieval artist do that? Maybe, but why would he??? If that was the case, the dye would have been mixed in with the blood. We would have detected the mixture.\n\n","date":"March 17, 2015 at 7:31 pm","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"author":"don","post":"Question-does the hands and feet produce less sweat than lets say chest? Face?\n\n","date":"November 13, 2014 at 12:32 pm","url":"https://shroudstory.com/2014/11/13/a-sweat-imprint-that-is-a-negative-which-is-comparable-to-a-brass-rubbing/","cat":"image_theory","title":"A sweat imprint that is a negative which is comparable to a brass rubbing"},{"author":"don","post":"The question was asked because from what I understand from this blog, the image show continuous uniform distribution. So if the sweats are uneven, then it would be impossible to have continuous distribution. Is Colin saying sweat imprint from both contact and non contact? Heat from sweat? Diffusion? I’m scratching my head on this. Sweat imprints similar to mailliard reaction?\n\n","date":"November 13, 2014 at 3:29 pm","url":"https://shroudstory.com/2014/11/13/a-sweat-imprint-that-is-a-negative-which-is-comparable-to-a-brass-rubbing/","cat":"image_theory","title":"A sweat imprint that is a negative which is comparable to a brass rubbing"},{"author":"don","post":"Figuring out which is worse-Freeman’s paint flaking or Colin’s charred de Molay. Wow. Funny how human minds work. Sort of like Einstein failing school but a genius at Theory of Relativity.\n\n","date":"March 4, 2015 at 2:50 pm","url":"https://shroudstory.com/2015/03/03/checking-in-on-colin-berry-a-new-image-model-forming-in-my-mind/","cat":"image_theory","title":"Checking In On Colin Berry:  A New Image Model  ‘forming in my mind’"},{"author":"don","post":"Colin is getting desperate…\n\n","date":"May 17, 2015 at 2:53 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"author":"don","post":"Question-the applications that Colin used in his latest experiment, would it have been detected let’s say STURP?\n\n","date":"April 26, 2015 at 8:21 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","title":"Might tactile chemography prove to be the super-model?"},{"author":"don","post":"I have read what Adrie posted in your blog’s comments section about Adler and Heller investigating whether nitric acid was presented on the linen fiber-   “a) diphenylamine b) fast blue salt B” for the detection of “nitro derivatives” and\n“a) ninhydrin b) fluorescamine” for detecting “amines, primary” and more tests for other nitrogen-containing substances and got negative results from image fibers (A Chemical Investigation, 1981). Their table 7 listed all their tests for organic structures and functional test is online.” So with your experiment, don’t you think nitric acid or whatever would have been detected?\n\n","date":"April 26, 2015 at 6:31 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","title":"Might tactile chemography prove to be the super-model?"},{"author":"don","post":"Whatever happened to Colin’s “light scorch theory”. Now its “sweat imprints”. Is there a difference?\n\n","date":"November 12, 2014 at 3:09 pm","url":"https://shroudstory.com/2014/11/12/real-1st-century-or-simulated-14th-century-sweat-imprint/","cat":"image_theory","title":"Real 1st century or simulated 14th century sweat imprint?"},{"author":"don","post":"Are there any paintings out there from medieval times that show no brushstroke whatever?\n\n","date":"September 28, 2014 at 9:28 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"author":"don","post":"correction: whatsoever\n\n","date":"September 28, 2014 at 9:31 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"author":"don","post":"Off topic, Dan, if you go to a website earthfiles.com and scroll down until you see a picture of a very complex, beautiful crop circle that was just recently formed outside of Torino, Italy. Its the second crop circle, not the first one as you scroll down. The article mentioned the Shroud of Turin.  I thought maybe there’s a correlation between the shroud and the crop circles. Laser? Radiation? Plasma?  I just find it interesting. No one has been able figure out how the circles were form. Same as the shroud.\n\n","date":"July 19, 2015 at 8:34 am","url":"https://shroudstory.com/2015/07/18/those-gee-whizz-radiation-models/","cat":"image_theory","title":"Those Gee Whizz Radiation Models"},{"author":"don","post":"typo Hugh, sheesh\n\n","date":"July 19, 2015 at 9:01 am","url":"https://shroudstory.com/2015/07/18/those-gee-whizz-radiation-models/","cat":"image_theory","title":"Those Gee Whizz Radiation Models"}],"key_evidence":[{"author":"don","post":"Why is carbon dating a question for pro-authenticity camp?  Remember the Hungarian Pray Manuscript Codex? It predate the 1260-1390AD range.  The only question for pro authenticity camp would be the history gap.\n\n","date":"January 5, 2014 at 6:57 pm","url":"https://shroudstory.com/2014/01/04/what-one-single-characteristic-about-the-shroud/","cat":"uncategorized","title":"What one single characteristic about the shroud  . . . ?"}],"misc":[{"author":"don","post":"This site is going to lose its credibility with these absurd hypotheses. Colin’s back and forth scorch (burnt body) or sweat imprints (how? I don’t know), Freeman’s flaky paint. I;m surprise this isn’t in the World Weekly News.\n\n","date":"November 23, 2014 at 4:33 pm","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","title":"How to Become Famous"},{"author":"don","post":"Read “An Autopsy on the Man of the Shroud”, by Robert Bucklin, a forensic pathologist who have examined over 25,000 bodies. He went into great detail explaining everything that happened to the man on the shroud before, during and after death. After examination, he said there was no indication of anything that didn’t look right or out of place, blood flows, wounds, etc. It was actually like examining the real human body! Using your hypothesis, you don’t think Bucklin would know there’s something with the “picture”?\n\n","date":"November 23, 2014 at 7:38 pm","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","title":"How to Become Famous"},{"author":"don","post":"correction-something WRONG with the picture\n\n","date":"November 23, 2014 at 7:41 pm","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","title":"How to Become Famous"},{"author":"don","post":"What technology? There is a technology out there that will produce exact image of Shroud of Turin??\n\n","date":"April 10, 2014 at 6:35 am","url":"https://shroudstory.com/2014/04/09/i-too-can-be-a-practitioner-of-peudocience/","cat":"news_&_views","title":"I, too, can be a practitioner of p$eudo$cience"}],"opinion":[{"author":"don","post":"You know, I’m just a regular guy here. As I sit here looking at the portrait of Jesus (a negative image of just the face I purchased 10-12 years ago from Barrie Schwortz with the caption that read-“Contemporary Insights To An Ancient Paradox”), the image’s so vivid, real, anatomically accurate. Everything I see of the image is perfect, Its a photographic snapshot of a scourged, beaten body. I can’t believe some of you are hanging on to ‘scorch theory’. Its ridiculous. If you look at the image long enough, you would be shaking your head thinking-“no way its a scorch because its too REAL!\n.\n\n","date":"April 3, 2014 at 7:49 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","title":"Am I the only one?"},{"author":"don","post":"Question-would flour have been detected on the shroud? I know that Colin’s flour imprint theory would not hold water because there are too many other questions he would need to answer especially the blood.\n\n","date":"June 28, 2015 at 7:59 am","url":"https://shroudstory.com/2015/06/28/extreme-blogging/","cat":"other_blogs","title":"Extreme Blogging"},{"author":"don","post":"Eventually we will know if the carbon dating was flawed or not (I believe it is flawed) because it was done by man but we will not know how the image was created because it was done by God. John 9:5 ‘As long as I am in the world, I am the light of the world.’  The image was created by supernatural light! Scientist Di Lazarro so far have the best hypothesis.\n\n","date":"November 14, 2014 at 8:26 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","title":"God in his lab"},{"author":"don","post":"Please Colin, I’m begging you, create one exactly like the TS. I’m losing my patience.\n\n","date":"August 18, 2014 at 12:52 pm","url":"https://shroudstory.com/2014/08/18/into-a-world-not-cut-off-from-reality/","cat":"other_blogs","title":"Into a World Not Cut Off from Reality?"},{"author":"don","post":"“simple, uncomplicated man-made contact one I favour” Simple? Uncomplicated? C’mon Colin really. lol\n\n","date":"September 22, 2014 at 10:12 am","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","title":"Samuel Johnson Meets His Match"}],"researchers":[{"author":"don","post":"First of all, what make Colin think it’s an imprint?? Secondly, isn’t it true that the reason STURP caught interest to investigate the shroud is because they knew that in no way the image is a painting because paintings do not create negative images and have 3 dimensional qualities? Didn’t STURP use most of its technology to see how the image was created? Not just painting? To find out if it was a painting, you don’t really need a whole lot of technology.\n\n","date":"May 30, 2015 at 4:38 pm","url":"https://shroudstory.com/2015/05/30/colin-berry-on-sturp/","cat":"other_blogs","title":"Colin Berry on STURP"},{"author":"don","post":"Well, from what I see, at least 95 percent of the paint are still on the first century Roman period linen shown above. Charles thinks that ALL of the paint flaked off the Turin Shroud?\n\n","date":"June 14, 2015 at 7:46 pm","url":"https://shroudstory.com/2015/06/12/thomas-de-wesselow-on-why-the-image-is-unlikely-by-an-artist/","cat":"video","title":"Thomas De Wesselow On Why the Image is Unlikely by an Artist"},{"author":"don","post":"Can someone tell me what is the definition of ‘imprint’? The dictionary define imprint as;\n1. impress or stamp (a mark or outline) on a surface or body. “tire marks were imprinted in the snow”\nsynonyms:stamp, print, impress, mark, emboss, brand, inscribe, etch “patterns can be imprinted in the clay.”\nWould gas diffusion, radiation or light that may have form the shroud image be part of the definition of imprint?\n\n","date":"June 16, 2015 at 5:15 am","url":"https://shroudstory.com/2015/06/12/thomas-de-wesselow-on-why-the-image-is-unlikely-by-an-artist/","cat":"video","title":"Thomas De Wesselow On Why the Image is Unlikely by an Artist"}],"resources":[{"author":"don","post":"I find it hard to believe that most of the paint flaked off the shroud. A shroud thread contain many fibers (I don’t know the approximate number of fibers per thread), there would have been paint residues between fibers. It would have been very difficult to remove the all residues even if you try. If it did flake off, wouldn’t there be damage to the fibers at microscopic level? Like a slight pull from the body of the thread?\n\n","date":"November 6, 2014 at 8:10 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"author":"don","post":"I’m still waiting to see an exact replica of the shroud. What’s taking so long? Come on, with all the technology we have today, should have had the replica by now. But seriously, that’s not going to happen. This blog will be the oldest, longest continuous blog on the internet.\n\n","date":"November 6, 2014 at 12:59 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"author":"don","post":"It will be interesting to see how Colin will add the actual blood, blood image and serum onto the linen.\n\n","date":"August 18, 2015 at 8:54 am","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"author":"don","post":"I mostly read the blog and rarely comment because I’m not a scientist but a postal worker!  I’m starting to lose interest in this blog because of this ridiculous painting theory that just goes on and on. Charles is not a scientist, so can we just please move on to something more plausible?\n\n","date":"November 9, 2014 at 5:43 pm","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"author":"don","post":"Then why did Jesus leave a likeness of Himself on the shroud? I was a non-believer until I saw a picture of a photographic negative, my first thought was that’s impossible. After 30 years of following the shroud research, it changed my life completely. I think Jesus left an imprint because he knew there was going to be many Doubting Thomases.\n\n","date":"April 5, 2015 at 3:32 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","title":"Easter Ink"},{"author":"don","post":"Proven as a fake??  Couldn’t careless about Joe Nickel. He’s not even a scientist. Just another Charles Freeman with no background in science.\n\n","date":"April 25, 2015 at 5:34 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"author":"don","post":"Tell me folks, which question will finally get answered during future shroud research? 1988 Carbon dating? Or how image was formed? Of course, the carbon dating! It was done by man. Humans makes mistakes. There will be another STURP like research project down the road. Vatican will give in to pressure from researchers/scientists from around the world.\n\n","date":"March 11, 2015 at 7:40 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"author":"don","post":"The first nineteen hundred years, the positive image didn’t look too great not to be a work of art. After Secundo Pia photograph, suddenly its too great to be a work of art!\n\n","date":"May 14, 2015 at 4:19 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","title":"Too Great to Be a Work of Art"},{"author":"don","post":"typo-positive image didn’t look too great to be a work of art. Got a little confused there!\n\n","date":"May 14, 2015 at 4:23 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","title":"Too Great to Be a Work of Art"},{"author":"don","post":"When Jesus was here on Earth 2000 years ago, he performed many miracles-raising of Lazarus, turning water into wine, cured the sick and blind, sudden abundance of bread and fish  Did these miracles happened naturally? No. I believe the Resurrection was one of his many miracles. The image was not created naturally. Do we know how He turned water into wine? Do we know how He raised Lazarus from the dead? No, we don’t know. I don’t think we’re ever going to know how the image was formed either. Its a miracle!\n\n","date":"June 18, 2015 at 5:32 pm","url":"https://shroudstory.com/2015/06/17/the-shroud-on-nbcs-today-show/","cat":"television","title":"The Shroud on NBC’s Today Show"}]}
