{"image":[{"id":"comment-5228","author":"donald","post":"“Donald, something must have been lost in translation from American to Australian. In America a moron is someone who is perceptive, bright and very intelligent. I’m sure that is what Ron meant. ” A wonderful and well written apology that leaves me feeling that I should somehow be a moron … what choice do I have but to accept it, well done. : ) No need for the larger images thanks, last night I managed to find a way to expand the image without losing resolution although I shall not be pursuing any further studies on it, there are things there I did not like and shall never mention again. Personally I wish I had never looked at the thing. I am sorry I did. Once again, nice site : ).","date":"2011-12-04","mins":"4:38 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor"},{"id":"comment-5236","author":"donald","post":"Yannick – That I know of, no research has been done on the “armoured” side of the shroud, however even though I am no expert in the field of chemistry, I do know that it would be impossible for anyone to claim the stuff on the shroud is blood. According to the little research I’ve done, the stuff they found is not blood as such but only porphyrins, a type of colored compound which may not only be found on blood but also chlorophyll, and many other natural products, nobody has ever claimed it to be actual blood except religious fanatics, no expert has ever said “Yes, it is definitely blood”. In fact, any test on porphyrins which is more than 100 years old will always yield an AB positive blood type even if it isn’t real blood because the stuff is organic and contains a chemistry which is also known to be a part of the same chemistry as blood. This is well known in police forensics, did you know that? Several claims have been made about the blood and many claims have been made about DNA testing but only a fool would accept them as conclusive, no claim has ever been confirmed (or denied), in fact the apparent blood appears to be so old that the DNA is badly fragmented. Dr. Andrew Merriwether has said that “… anyone can walk in off the street and amplify DNA from anything. The hard part is not to amplify what you don’t want and only amplify what you want (endogenous DNA vs contamination).” It is doubtful that good DNA analyses can be obtained from the Shroud. As for what you guys think of what I see or don’t see, I don’t care, my opinion has been accepted by many in the past, including courts, so frankly I rather tend to think that here on this site I am only up against a bunch of religious contraries who would do and say anything to justify their beliefs even if that means not believing a truth when it is put in front of them. I am not so blind yet that I cannot tell a sword from a broomstick, already hundreds of others have emailed me to tell me that they too see the sword and the light shinning of it; so thankfully I can now claim to be one of many, not just the only one. Also I might add that with regards the blood, when looking at the “hair” on the image with the face, (which is not really his hair, but some kind of a hood) the “blood” streaks down “towards” his face. How can this be when everybody knows that first everybody knows that at that time Jesus was dead and his heart was not pumping and Jesus body was laid to rest in a prone position and then washed clean. There should be no blood whatsoever; If anything the streak should be towards one side or another of his face, not towards the chin. Again forensics will tell you this is wrong, it cannot be. And frankly, that is only one streak, why is the rest on top of the hair/hood? there are no other signs of cuts or abrasion to the head at all, not one. Then there is the thoracic cavity … what a joke that is … please, that is really a laugh. Here is a link to an over expanded view of the face and body, please mark the blood streaks for me and show me cause to believe that is his hair and not a hood. I could tell you why I know it is not hair, a question of both gravity and the prone position of the body but I’ll wait for your answer first. Http://wisdomblogsdotcom1.files.wordpress.com/2011/12/shroudofturinextralarge.jpg?w=1000&h=1927 also .. The bodies are not the same .. The image with the face has wider hips, I checked and measured it. Why don’t you do the same before replying, just make sure you use the original negative.. My zooms are of different size. : ).","date":"2011-12-04","mins":"7:38 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor"},{"id":"comment-5243","author":"donald","post":"Actually judging by what little research I’ve done it has become obvious to me that nobody has ever proven there is true blood on the cloth. As an example .. “And later on, there was even some DNA tests on blood samples coming from the Shroud proving once more that the blood is human and even male. ” So what were previous tests done on, toilet paper? Dr. Andrew Merriwether clearly stated it, “NO DNA test is possible on such an old piece of rug” … I did not say this, but somebody who tested the shroud sure did. But regardless, considering the history of the thing it is not only more than likely that the whole thing is a fraud (although I do not dispute that the image is authentic) and still … I notice that you guys like to change the subject quite a bit; you haven’t answered a single question I put to you yet, what are you, mindless fools or something? … So I shall ask a positive question here, … have any of you ever done any tests on the shroud yourself or is it possible that you, like many others, are all nothing but complete stupid fools who are willing to believe any bullshit you are told and remain mindless donkeys praying to a old rug? (just a bit of self defense here seeing as how you ignorant idiots like to show your complete lack of education by insulting complete strangers) I’d call you dickheads but that would be too rude, so stuff your vigour, I’ve come to the conclusion that you are nothing but morons yourselves, you’d have to be to rely on the things you mention. Have a nice day..","date":"2011-12-05","mins":"12:37 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor"},{"id":"comment-5217","author":"donald","post":"Hope you guys don’t mind if I defend myself a bit here….. Nice site First, the picture I used was from wiki, in the public domain, they say so at the bottom of their site, the one you use here is mine, did you ask me if you could use it? , don’t forget to send me either an apology or $5000 bucks for using my “very expensive” work which took effort to produce and post for my readers, not yours. I check for copyright on all the pictures on my site, so should you. : ( Five minutes is a lot of work you know, you shouldn’t steal from me in that manner, I thought you guys were Christians, that is hard to believe considering how much you insult me here. I rather take the money but if you can’t afford it then just give $5 to charity and then come on over to my site and leave there a nice apologetic comment, kiss butt and all that. Nah, I’m just kidding you guys, I’m an Aussie and we always stir, don’t let it bother you : ) Second, I did nothing to the picture, I took the one from wiki, opened it with Photo Editor and then clicked on the “Negative Effect”, I didn’t colour it in any way, it is an exact job as that which was done by scientists in the past. You can do it yourselves if you wish. Secondly, I am blind, that is why I zoomed it. But I did nothing else so …. Can you see the sword or not? already I have had hundreds of emails from others telling me they do. Personally I wish they didn’t as I am religious, I believe in God and Jesus and wish it were a picture of Jesus but it isn’t; I have a lot more evidence on this but why post it, I only posted enough to generate discussion and no more.. I certainly never expected to be libeled as well by been called a “Moron” online .. Considering I am a scientist I take offense to that too .. Maybe … nah, I’ll let that one slide. Thankfully I would never breach God’s trust by worshiping a piece of rug and turning it into a religion icon which just happens to be against the second commandment. Those of you who do, do so at the risk of your own souls, not mine. Have a nice day, thanks for the write up, gave me lots of hits : ).","date":"2011-12-04","mins":"5:39 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor"},{"id":"comment-5245","author":"donald","post":"I am interested in finding the truth, what I was not prepared for was the number of insults you and your colleague have thrown my way .. Let’s see, what were they … moron, ignorant, lier, suffers from pareidolia and so on and not only that, you even say that you have to “force” yourself to be polite. Well, it is more than obvious that you have to force yourselves, else your total lack of civility you have to offer might shine right through you, you have clearly shown that you have no ability to conduct a proper debate without resorting to insults. No brain fools is what you are. Insults which were clearly designed not only to not have to answer any questions I put to you, but also designed to get me angry and throw it all right back at you so that then you could say … : I had you pegged” … mate, you are not a fool, you are actually quite smart for an idiot. Quite frankly fellows, with the type of debate you put on, in the world of science you wouldn’t amount to the DNA of a slug. You are as useless as debating an issue as teats on a bull and quite frankly not even worth the bother of another return from me. How on earth the owner of this site allows you to diminish his reputation with your insults and innuendos is beyond me; rude, arrogant, ingrates .. I doubt if there is a single IQ point between the lot of you. You call yourselves Christians? you wouldn’t know the meaning of the word..","date":"2011-12-05","mins":"2:58 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor"},{"id":"comment-5250","author":"donald","post":"Yeah, but unlike them I enjoyed it, so it goes to prove a point, scientists are the equivalent of a redhead, these lot are all brunettes : ).","date":"2011-12-05","mins":"6:52 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor"},{"id":"comment-5288","author":"donald","post":"First I became an electronics engineer, Martin, then with the advent of computers I went back to school to learn programming but somehow ended up a computer scientist. Somewhere after that I became a professional BS artist blogger : ) Right or wrong, I am glad I stirred debate, it’s what blogging is all about. PS: normally I have long black curly locks to show off my “extreme handsomeness” : ) but like many Aussies, because of the extreme heat I shave it all off once a year, always at the beginning of spring..","date":"2011-12-06","mins":"10:40 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor"},{"id":"comment-5218","author":"donald","post":"One more thing, should have mentioned this … I am an expert on computers, I am in fact a computer scientist and an engineer. The Shroud is not a fake, I still maintain that it is not the image of Jesus; but the shroud itself is not and cannot and has never been a fake. I don’t know who or what made the imprint on the cloth, as well you know I have my own theories on that but science demands that I tell the truth … it is impossible for this to be a fake just as it is impossible for anyone to have somehow photographically faked the image because there is more than enough proof that that same image was already there back in 1300 AD. A wonderful scientific mystery, I shall look into it some more. : ).","date":"2011-12-04","mins":"5:57 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor"},{"id":"comment-5219","author":"donald","post":"I’m back : ) Here’s a link for you, I made the picture much bigger without losing resolution, it’s what us “experts” do .. Http://wisdomblogsdotcom1.wordpress.com/2011/12/04/the shroud of turin part ii/ Now you can really pick on me : ).","date":"2011-12-04","mins":"7:24 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor"}]}
