{"art":[{"author":"donn_reile","post":"To those of us that have followed the research on the shroud through the years, we all know that its not a painting. So who cares what Joe Nickell says. He’s not even a scientist. And this artist, he never bothered to explain how the image was painted.","date":"March 1, 2013 at 11:28 am","url":"https://shroudstory.com/2013/03/01/observations-consistent-with-a-medieval-artist/","cat":"art","title":"Observations Consistent with a Medieval Artist?"},{"author":"donn_reile","post":"And we all know that the result from the VP8 Image Analyzer show that the image is encoded with 3-D dimensional properties. No paintings or photographs in the world can produce a 3-D image using the VP* Analyzer. This proves its not a painting.","date":"March 1, 2013 at 11:40 am","url":"https://shroudstory.com/2013/03/01/observations-consistent-with-a-medieval-artist/","cat":"art","title":"Observations Consistent with a Medieval Artist?"}],"blood":[{"author":"donn_reile","post":"Who quoted this-“There is no science for Christ”. Was it Adler or Heller? We will forever search for answers. Maybe one day Jesus himself will reappear and tell us how He did it.","date":"October 16, 2013 at 9:06 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","title":"Holding the Shroud to an impossible standard?"},{"author":"donn_reile","post":"Can anyone please translate the above comment? This is a great thread.","date":"February 20, 2013 at 11:38 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"author":"donn_reile","post":"Donn Reile :Can anyone please translate the above comment? This is a great thread.Comment from Escipion","date":"February 20, 2013 at 11:39 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"}],"dating":[{"author":"donn_reile","post":"This paper is a must read! Pam Moon did a lot of research for this paper. Great job!","date":"February 13, 2013 at 11:58 am","url":"https://shroudstory.com/2013/02/13/special-paper-chase-new-possibilities-why-the-c14-dating-of-the-shroud-may-be-wrong/","cat":"carbon_14_dating","title":"SPECIAL PAPER CHASE: New Possibilities Why the C14 Dating of the Shroud May Be Wrong"}],"events":[{"author":"donn_reile","post":"Thank You!","date":"March 30, 2013 at 12:36 pm","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","title":"Awaiting Live Stream from RAI Uno"},{"author":"donn_reile","post":"My apologies for the site’s language. I used keywords to search sites and I did not notice the site’s address. But it does have some information on why this is happening. Unless it is resolved.","date":"March 30, 2013 at 10:35 am","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","title":"Awaiting Live Stream from RAI Uno"},{"author":"donn_reile","post":"http://forum.hidemyass.com/index.php/topic/11551-rai-italy-unavailable/Go to above site. This is not the first time RAI had this problem.","date":"March 30, 2013 at 10:19 am","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","title":"Awaiting Live Stream from RAI Uno"},{"author":"donn_reile","post":"aaargh! Ok thanks Russ, I’ll be watching your schedule.","date":"February 1, 2013 at 10:11 pm","url":"https://shroudstory.com/2013/01/30/russ-breault-and-shroud-encounter-also-in-west-simsbury-connecticut/","cat":"event","title":"Russ Breault and Shroud Encounter also in West Simsbury, Connecticut"},{"author":"donn_reile","post":"I would love to see his presentation. When will he come to upstate New York? Albany, Syracuse, or Rochester area","date":"January 30, 2013 at 11:39 am","url":"https://shroudstory.com/2013/01/30/russ-breault-and-shroud-encounter-also-in-west-simsbury-connecticut/","cat":"event","title":"Russ Breault and Shroud Encounter also in West Simsbury, Connecticut"}],"history":[{"author":"donn_reile","post":"It does not look an ‘a’ at all. What I see are 3 separate marks, ‘c’ with what looks like a crescent moon above it and a curved letter ‘l’ as in ell in lower case. The marks are not connected at all. From the distance, it looks like an ‘a’, but up close, its actually 3 separate marks. The ‘cresent moon’ mark shows end points tapered. Same with the curved ‘l’. The ‘c’ is slightly squared at the ends.","date":"March 18, 2013 at 8:50 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","title":"The Curious ‘a’ in the Hungarian Pray Manuscript"},{"author":"donn_reile","post":"I have followed the shroud research for the last 20 years. I have not yet seen one shred of evidence that would have led me to believe the shroud is a fake. I’m no scientist but after reading just about every comments Colin Berry have posted on this blog, I think there is only one way for me to see if Colin Berry’s so called scorch-charcoal painting theory would hold up. Colin, would you kindly please present your findings or result of your experiment (must be photographic negative image) so that I can make a comparison between yours and the photographic negative image of the shroud? Right now I don’t care about the blood. I just want to see the image.Thanks","date":"March 25, 2013 at 9:29 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"author":"donn_reile","post":"I think there is no science for Christ.  Its virtually impossible to reproduce the exact image of the shroud in addition with all of the other problems associated with it. Like you said, it will remains forever unknown. I was an atheist once. The TS has completely changed my life. It has giving me hope and happiness. The reason I still follow the Shroud is hopefully someday the truth will come out that it is authentic, probably not in my lifetime.","date":"March 26, 2013 at 10:35 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"author":"donn_reile","post":"Great find, Max. I have been looking at medieval manuscript symbols. How were you able to locate the symbols?","date":"March 20, 2013 at 10:52 am","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","title":"The Curious ‘a’ in the Hungarian Pray Manuscript"},{"author":"donn_reile","post":"I wanted to bring this up. It doesn’t have anything to do with this topic. Does anyone know anything about the Balatlar Church in Turkey? It was built in the year 660. One of the image show a similarity of the Shroud. Its the fifth picture along the bottom of the screen. I have never seen it before. Your thoughts? http://www.fotopedia.com/albums/NT-pD7R48GM","date":"August 1, 2013 at 10:00 am","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","title":"Bible Archeology: The mystery continues"},{"author":"donn_reile","post":"I have seen your banner before. What i was hoping for was an exact replica of shroud using bas-relief as the model for your experiment. I find that its impossible to create a bas-relief statue because the image on the shroud is so anatomically perfect. No sculpturist can do this. If one did, it would be in a museum as the greatest artwork ever in the history of mankind.  As for my theological views, they are mine and I am welcome to them, as they had no relevance to the question I proposed. I am still interested in the scientific findings, seeing as I have no access to the shroud myself, and even if I did, I lack the scientific intellect and background to bring fourth results. As for your comment as a “dreaded internet time-waster”, this is an open to the public blog (if you will) and I challenge you to change my mind, and see me as a devils advocate rather than an individual wasting your time; especially considering my depth of interest on the topic.","date":"March 27, 2013 at 12:31 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"}],"image":[{"author":"donn_reile","post":"This is a waste of time. We all know gas diffusion will spread uniformly and show distortion. It will look look a inked thumb rolled across paper during fingerprinting. No detailed image whatsoever.","date":"October 24, 2012 at 11:39 am","url":"https://shroudstory.com/2012/10/24/comment-promoted-denis-mannix-on-his-proposal/","cat":"image_theory","title":"Comment Promoted: Denis Mannix on his proposal"},{"author":"donn_reile","post":"Even if the gas diffusion contacted the cloth, it will still be blurred and distorted. Its IMPOSSIBLE to created a detailed image with either the distant or contacted gas diffusion mechanism.","date":"October 26, 2012 at 2:03 pm","url":"https://shroudstory.com/2012/10/24/comment-promoted-denis-mannix-on-his-proposal/","cat":"image_theory","title":"Comment Promoted: Denis Mannix on his proposal"},{"author":"donn_reile","post":"Donn Reile :aEven if the gas diffusion contacted the cloth, it will still be blurred and distorted. Its IMPOSSIBLE to created a detailed image with either the distant or contacted gas diffusion mechanism.After reading my comment, you all would probably know I’m not a scientist. I can’t back up my claim. I’m just using common sense","date":"October 26, 2012 at 2:25 pm","url":"https://shroudstory.com/2012/10/24/comment-promoted-denis-mannix-on-his-proposal/","cat":"image_theory","title":"Comment Promoted: Denis Mannix on his proposal"},{"author":"donn_reile","post":"Still waiting for someone to create an exact image of the shroud. C’mon you guys, you’re telling me you can’t create something that was created probably 2000 years ago? I’m disappointed.","date":"October 28, 2013 at 10:15 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"author":"donn_reile","post":"I have been following the Shroud since the Vp-8 image analyzer. It just blew me away. I’m confident that this enigma will never be solved. Its beyond science.","date":"October 26, 2012 at 10:05 pm","url":"https://shroudstory.com/2012/10/24/comment-promoted-denis-mannix-on-his-proposal/","cat":"image_theory","title":"Comment Promoted: Denis Mannix on his proposal"},{"author":"donn_reile","post":"I’m not a scientist but I do love this blog. Great research by you scientists. I wish everyone in the world would read this blog! Just fascinating stuff. Keep up the good work!","date":"October 29, 2013 at 10:51 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"author":"donn_reile","post":"I see desperation from both sides. One side with malliard reaction theory, a thin layer of gas diffusion between body and cloth. IMPOSSIBLE to do especially when the whole cloth is anatomically perfect. The other side, a combination of scorch and painting, yeah sure, I guess the artist knew what the photographic image would look like 800 years later. Absurd theories and a waste of time.","date":"March 17, 2013 at 5:02 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","title":"Scorching Theory: Pseudoscience or Miracle?"},{"author":"donn_reile","post":"Question, the images posted by Hugh Farey,  the TS show image in ‘raise relief’ because it is 3D encoded? The others does not show raise relief, why?","date":"November 4, 2013 at 5:27 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"author":"donn_reile","post":"For Hugh Farey from what I understand about raise relief: In addition, the scientists had confirmed a startling new earlier finding that the image had 3-d information encoded on it. The clumping of degraded fibers was so uniform and precise that a computer could translate the lighter and darker groupings into mathematically precise values. Which enabled STURP members Dr John Jackson and Dr Eric Jumper to make a 3-dimensional model of the man in the shroud. They did this by feeding the encoded values of the various groupings into a VP-8 image analyzer, a device normally used by NASA to make raised relief maps from non traditional, electronic photos of distant planets. Because the distances were so far, such photos were not taken by conventional cameras using traditional light sensitive film, but by cameras tabulating emitted light photons.With the encoded information, a computer could plot exactly how the shroud lay over the figure; where it touched and didn’t touch. The computer did this by revealing minute but precise distances between the man and the cloth. Where the shroud touched his body, the degraded fibers were clumped the most; less so where there was space between the cloth and body. The lightest parts of the image had the least number of clumped fibers. In this way, the computer plotted the peaks and valleys on the head, torso, arms, and other aspects  of frontal, dorsal, and side images.Jackson said that relief 3-d image on the analyzer’s screen looked anatomically plausible, even down to the subtle details of the face. No known paintings or traditional photographs have ever yet yielded such encoded values and do not produce 3-d images. “Eyes protrude, nose sink, and other distortions graphically testify to the uniqueness of the shroud image,”  quoted by Kenneth Stevenson and Gary Habernas in their book-Verdict on the Shroud.The 3-d encoding also appeared to negate the image being like a conventional photograph. Traditional cameras  reflections of light (more light causing brightness, less causing shadows) to make an image. But the shroud images didn’t depend on light (unless light had caused the precision degrading of the fibers grouped like pixels together determining lightness or darkness and hereby etching the image. The image just happened to look like a photographic negative. In reality, it was a mathematically precise map of how the body contacted the cloth.","date":"November 4, 2013 at 9:40 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"}],"researchers":[{"author":"donn_reile","post":"Great video. Job well done Bailey!","date":"January 2, 2013 at 7:23 pm","url":"https://shroudstory.com/2013/01/02/david-rolfe-some-hip-dude-in-england/","cat":"other_blogs","title":"David Rolfe, some hip dude in England"},{"author":"donn_reile","post":"I don’t understand, how is it that ‘for’ and ‘against’ evidences is balanced?? I only see ONE inconsistency which is the radiocarbon dating. Everything else we have tried to duplicate the image have NOT worked. Its that simple.","date":"November 2, 2013 at 9:41 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"}]}
