{"misc":[{"author":"dorothy_gauvin","post":"Thank you for your kindly and tactful answer. Oh dear! Mea culpa – for not following my own rule of not accepting one opinion before checking at least three other sources. A lesson relearnt.At your impressive and informative website, I could’ve lingered for hours but that I have my own work to (joyfully) do. There, I recognised the images of Picknett and Prince as the authors of the televised documentary my comment relied on.Thanks especially, Dan, for pointing out what should’ve been blindingly obvious – the date of Leo’s birth with reference to the date of the Shroud’s display.Still, the item that most intrigues me remains unanswered. The crystal object in the hand of the ‘Salvatore Mundi’ is labelled a ‘globe’ and I wonder: to your knowledge, has anyone examined the painting or taken a really high resolution photo of it, so as to identify its nature?Looking forward to future posts, thanks again,Dorothy Gauvin","date":"January 24, 2012 at 5:16 am","url":"https://shroudstory.com/2012/01/23/has-playful-leonardo-left-us-a-clue-in-the-salvator-mundi/","cat":"news_&_views","title":"Has Playful Leonardo Left Us a Clue in the Salvator Mundi?"},{"author":"dorothy_gauvin","post":"Thanks to the contributors whose comments have gone to helping answer my query about the crystal object in the painting. Especially, for sending me to my bookshelves to check Sir Kenneth Clark on a globe as the appropriate attribute and for observations on the posture of the figure’s hand. Amusing too, the ‘Sputnik’ by Salimbeni. It seems artists always have been playful and, like our audiences, a little bit nuts. To the relief of serious Shroud students, I’ll now confine myself to reading the Leo entries on this wonderful site. Thanks for the fun and the info.","date":"January 28, 2012 at 12:03 am","url":"https://shroudstory.com/2012/01/23/has-playful-leonardo-left-us-a-clue-in-the-salvator-mundi/","cat":"news_&_views","title":"Has Playful Leonardo Left Us a Clue in the Salvator Mundi?"}]}
