{"dating":[{"author":"dr_tibor_szarvas","post":"Once again on radiocarbon dating of the Shroud\nWrong radiocarbon dating of the Shroud in the consequence of biological isotopfractionation\nIt is well known that the cellulose molecules of the linen can change seriously, particularly after a long time. The following chemical processes are responsible for these changes:\n1) Oxidation\n2) Depolimerisation\n3) Substitution of hydroxyl radicals with organic or inorganic radicals\n4) Hydrolysis\n5) Replacement of alcoholic hydrogen\n6) Graft addition reaction with free radical sites, generated via various free radical reaction initiators\n7) Base exchange reactions. Fundamental glucose units liberates from the cellulose macromolecules (depolimerisation)\n8) Addition reaction with free radicals  (effect of UV radiation)\nThese chemical reactions can proceed in the presence of bacteria and fungi, which were clearly identified on the Shroud. A thick komplexum of Lichenotelia, which consists of bacteria and fungi was verified by Leoncio Garza Valdes on the Shroud. The aldehyde and carboxyl groups produced in the above mentioned reactions resulted in a stable bond of fresh 14C on the Shroud (e.g. Chambery fire in 1532). The exchange reactions of different – COOH and – CHO groups containing organic molecules with 14CO2 support the probability of this phenomenon. Nevertheless, these fresh impurities were not more than 1 % which could not removed by the  3 laboratories in the cleaning process before the AMS measurements.\nThere is a further significant factor. It was verified that the end-product of decomposition reaction caused by microorganism (bacteria, fungi) is glucose. They produce CO2 and H20 during their glucose metabolism. Taking into account the isotopic effect in the splitting of 14C – 12C bond, the microorganisms could build 12C from cellulose (glucose) of the Shroud into their organism as energy substrate to a higher degree than 14C. 12C was then metabolised and emitted as 12CO2 in higher amount than 14CO2. It is also known, that the discrimination against 14C in biological systems can achieve more than 15 %. Many scientific publications supported this phenomenon. This isotopfractionation  could cause a relative increase of the 14C in the Shroud during the centuries resulting in the change of isotope ratio and the “rejuvenation” of the Shroud. This enrichment could not be affected by any of the cleaning procedures applied. Although the 3 laboratories (Zürich, Oxford, Arizona) carried out precise measurements, there was no chance to accomplish the radiocarbon dating of the Shroud correctly due to the effects discussed above.\nCalculations\nTheoretical 14C/12C ratio in 1988.                        Presumed isotopfractionations\n(linen was produced 1 year befor Christ’s death)                     11 %, 12 %, 13 %\n                    0.7885\nCalculated 14C/12C ratio owing to isotopfractionation\n                    0.8752, 0.8831, 0.8910\nNormalised ratio for inorganic world (Stuivert-Pollack)\n                    0.9154, 0,9184, 0.9266\nRadiocarbon age  Calendar age\n      728, 700, 666       1260,1288,1322\nResults of the 3 laboratories\nZürich  : pooled  radiocarbon age  :  676,  calendar age :1312\nOxford : pooled  radiocarbon age  :  689,  calendar age : 1299\nArisona :pooled, radiocarbon age  :  642,  calendar age : 1346\nIt is highly probable, that  the 3 laboratories measured  like  14C/12C ratio owing to mentioned and  presumed microbiological isotopfractionation. Consequently, the real age of the Shroud cannot be exactly determined   when we ignore this phenomenon.  \nIt is well known that normalization of the measured values  of – d 13C is necessary because there is a differences between the concentration of 13C and 14C in the inorganic world (atmosphere) and biological world (living matter). The relationship is: -d14C/(2x-d13)/%.  It is important, that the value of -d13C assumed to be constant. Recent 13C measurements in plants indicate that the concentration in 14C is not constant as it was assumed in Libby’s time.\nConclusions\nThere is a possibility to measure of this isotopfractionation factor on the Shroud.First : it would be necessary to identify microscopically the real thickness of the bacteria and fungi colony. Second : collect more microbiological samples from the Shroud particularly in the neighbouring of the location of the previous sampling  for the correct determination of the main factor: microbiological isotopfractionation. The microbiological sampling would be not at all harmful for the Shroud. 14C radioisotope labeled glucoses can be use for the determination of isotopfractionation.\n\n","date":"April 19, 2014 at 11:03 am","url":"https://shroudstory.com/2014/04/10/ray-schneider-why-is-the-carbon-dating-wrong-i-dont-know-that-it-is-wrong-i-am-quite-certain/","cat":"carbon_14_dating","title":"Ray Schneider: Why is the carbon dating wrong? I don’t know. That it is wrong I am quite certain . . ."}]}
