{"dating":[{"author":"egm","post":"“That’s backward science”\nJones can speak for himself of course, but it’s not backward if say for instance you originally start with honest skepticism then investigate the Shroud and discover it’s authenticity is backed up in spades save an anomalous C14 test that, upon investigating beyond the compliant mainstream news with headlines plastering the world over yearly, points to sabotage from the inside to discredit the Shroud. Then you can move to the next level after arriving at the Shroud’s authenticity and attempt to explore how widespread the fraud really is which some don’t want to be discussed it seems. It’s naturally going to lead into colluding elements if that’s what really happened, possibly strange bed fellows as well, that’s human nature I’m afraid, you don’t get to claim it debunked just because it sounds strange, absurd, ridiculous, etc to your (hopefully not closed) mind. Reality is absurd and ridiculous and over the top sometimes. If hacking the labs is really so off base as some would like to paint it, then it should easily be debunked with verified facts and the world will continue. So far there seems to be only more questions raised and clarifications needed from the responses from representatives of two of the three labs involved in the 1988 C14 tests.\n\n","date":"March 11, 2014 at 3:46 am","url":"https://shroudstory.com/2014/03/09/comment-promoted-on-the-hacking-hypothesis/","cat":"carbon_14_dating","title":"Comment Promoted:  On the Hacking Hypothesis"},{"author":"egm","post":"Wow! So Ramsey puts out what looks like disinfo on a crucial question regarding how/if the numbers could have been fudged in the C14 tests (whether intentionally or it was just a ‘senior moment’ you can decide) — thus appearing to discredit himself — yet Stephen Jones is the one looked askance at and receiving cheap pot shots for pointing it out and daring to pursue the important questions! I guess the saying is true about knowing you’re over the target when you’re getting lots of flak! “Whoever misleads the upright into an evil way will fall into his own pit, but the blameless will have a goodly inheritance.” Proverbs 28.10\n***\nMatthew 17:1-2 And after six days Jesus taketh with him Peter, and James, and John his brother, and bringeth them up into a high mountain apart: and he was transfigured before them; and his face did shine as the sun, and his garments became white as the light.\nMark 9:2-3 And after six days Jesus taketh with him Peter, and James, and John, and bringeth them up into a high mountain apart by themselves: and he was transfigured before them; and his garments became glistering, exceeding white, so as no fuller on earth can whiten them.\nLuke 9:29 And as he was praying, the fashion of his countenance was altered, and his raiment [became] white [and] dazzling.\nLuke 24:3-4 And they entered in, and found not the body of the Lord Jesus. And it came to pass, as they were much perplexed thereabout, behold, two men stood by them in shining garments\nMatthew 28:1-4 In the end of the sabbath, as it began to dawn toward the first day of the week, came Mary Magdalene and the other Mary to see the sepulchre. And, behold, there was a great earthquake: for the angel of the Lord descended from heaven, and came and rolled back the stone from the door, and sat upon it. His countenance was like lightning, and his raiment white as snow: And for fear of him the keepers did shake, and became as dead men.\nRevelation 21:23 And the city had no need of the sun, neither of the moon, to shine in it: for the glory of God did lighten it, and the Lamb is the light thereof.\nEphesians 5:14 Wherefore he saith, Awake thou that sleepest, and arise from the dead, and Christ shall give thee light.\nPsalm 17:15 As for me, I will behold thy face in righteousness: I shall be satisfied, when I awake, with thy likeness.\nMalachi 4:2 But unto you that fear my name shall the Sun of righteousness arise with healing in his wings; and ye shall go forth, and grow up as calves of the stall.\nDaniel 10:5-6 Then I lifted up mine eyes, and looked, and behold a certain man clothed in linen, whose loins were girded with fine gold of Uphaz: His body also was like the beryl, and his face as the appearance of lightning, and his eyes as lamps of fire, and his arms and his feet like in colour to polished brass, and the voice of his words like the voice of a multitude\nRevelation 1:14-16 His head and his hairs were white like wool, as white as snow; and his eyes were as a flame of fire; And his feet like unto fine brass, as if they burned in a furnace; and his voice as the sound of many waters. And he had in his right hand seven stars: and out of his mouth went a sharp twoedged sword: and his countenance was as the sun shineth in his strength.\nExodus 34:29-35 And it came to pass, when Moses came down from mount Sinai with the two tables of testimony in Moses’ hand, when he came down from the mount, that Moses wist not that the skin of his face shone while he talked with him. 30 And when Aaron and all the children of Israel saw Moses, behold, the skin of his face shone; and they were afraid to come nigh him. […] And till Moses had done speaking with them, he put a vail on his face. 34 But when Moses went in before the LORD to speak with him, he took the vail off, until he came out. And he came out, and spake unto the children of Israel that which he was commanded. 35 And the children of Israel saw the face of Moses, that the skin of Moses’ face shone: and Moses put the vail upon his face again, until he went in to speak with him.\nNumbers 6:24-27 The LORD bless thee, and keep thee: The LORD make his face shine upon thee, and be gracious unto thee: The LORD lift up his countenance upon thee, and give thee peace. And they shall put my name upon the children of Israel; and I will bless them.\nDaniel 12:2-4 And many of them that sleep in the dust of the earth shall awake, some to everlasting life, and some to shame and everlasting contempt. 3 And they that be wise shall shine as the brightness of the firmament; and they that turn many to righteousness as the stars for ever and ever. 4 But thou, O Daniel, shut up the words, and seal the book, even to the time of the end: many shall run to and fro, and knowledge shall be increased.\n\n","date":"April 1, 2014 at 11:13 am","url":"https://shroudstory.com/2014/04/01/developing-a-hacking-theory/","cat":"hacking","title":"Developing a Hacking Theory"}],"events":[{"author":"egm","post":"There are layers of meaning in Paul’s use of a veil in 2Cor 3.18, the most obvious reference perhaps being the glory of Moses’ face from being in the presence of the glory of God’s face (from glory to glory):\nExodus 34:29-35 (NAS) “It came about when Moses was coming down from Mount Sinai (and the two tablets of the testimony were in Moses’ hand as he was coming down from the mountain), that Moses did not know that the skin of his face shone because of his speaking with Him. So when Aaron and all the sons of Israel saw Moses, behold, the skin of his face shone, and they were afraid to come near him. Then Moses called to them, and Aaron and all the rulers in the congregation returned to him; and Moses spoke to them. Afterward all the sons of Israel came near, and he commanded them to do everything that the LORD had spoken to him on Mount Sinai. When Moses had finished speaking with them, he put a veil over his face. But whenever Moses went in before the LORD to speak with Him, he would take off the veil until he came out; and whenever he came out and spoke to the sons of Israel what he had been commanded, the sons of Israel would see the face of Moses, that the skin of Moses’ face shone. So Moses would replace the veil over his face until he went in to speak with Him.”\nThere’s also the veil the bride wears over her face until she becomes the wife. The wife of Christ does not wear a veil and is exposed to the glory of God. (“Did I not say to you that if you believe, you will see the glory of God?” John 11.40)\nThe veil can also be referencing the Sudarium (or a darkness) placed over the face of the dead, to be removed in the resurrection, when they are to put on the glory of God. (“Beloved, now we are children of God, and it has not appeared as yet what we will be. We know that when He appears, we will be like Him, because we will see Him just as He is.” 1John 3.2) (Wherefore he saith, Awake thou that sleepest, and arise from the dead, and Christ shall give thee light. Ephesians 5.14) (As for me, I will behold thy face in righteousness: I shall be satisfied, when I awake, with thy likeness. Psalm 17.15)\nThe veil of the most holy place also applies. The image in the most holy place was the covering cherubim on opposite ends of the mercy seat representing where God’s glory resided on earth, just as the image of the shroud represents Christ’s glory and the tomb where it was found had two angels on opposite ends of where he was laid. (“and she saw two angels in white sitting, one at the head and one at the feet, where the body of Jesus had been lying.” John 20.12)\nPaul was a top tier proto-rabbi (Pharisee of the Hillel school) and was well aware of all these interconnections and multidimensional streams of thought and more which we (I) entrained to the western mode of thinking can barely scratch the surface of, except by the Spirit. It’s a shame his Hebrew poetic genius isn’t clear in the Greek translations as shown in the Aramaic.\n\n","date":"May 23, 2013 at 11:15 pm","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","title":"A kind of witness?"},{"author":"egm","post":"As important as the shroud would be, or seem to be, would we not expect it to be alluded to in some fashion in the old testament as were other significant events surrounding Yeshua and the Passion narrative? Behold:\n“When Elisha came into the house, behold the lad was dead and laid on his bed. So he entered and shut the door behind them both and prayed to the LORD. And he went up and lay on the child, and put his mouth on his mouth and his eyes on his eyes and his hands on his hands, and he stretched himself on him; and the flesh of the child became warm. Then he returned and walked in the house once back and forth, and went up and stretched himself on him; and the lad sneezed seven times and the lad opened his eyes. He called Gehazi and said, “Call this Shunammite.” So he called her. And when she came in to him, he said, “Take up your son.” –2 Kings 4.32-36 (NAS)\nMouth to mouth, eyes to eyes, hands to hands: analogous to a mirror image and associated with a death and resurrection. Is not the shroud as a mirror image associated with a death and resurrection?\n“But we all, with unveiled face, beholding as in a mirror the glory of the Lord, are being transformed into the same image from glory to glory, just as from the Lord, the Spirit. […] And even if our gospel is veiled, it is veiled to those who are perishing, in whose case the god of this world has blinded the minds of the unbelieving so that they might not see the light of the gospel of the glory of Christ, who is the image of God. […] For God, who said, “Light shall shine out of darkness,” is the One who has shone in our hearts to give the Light of the knowledge of the glory of God in the face of Christ. But we have this treasure in earthen vessels [“a fragile vase of clay” per Weymouth; “a vase of earth” per Etheridge; “an earthen vessel” per Murdock], so that the surpassing greatness of the power will be of God and not from ourselves”  –2Corinthians 3.18; 4.3-4, 6-7 (NAS)\n\n","date":"May 23, 2013 at 8:49 am","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","title":"A kind of witness?"}],"history":[{"author":"egm","post":"My very first two posts on this blog touched on the subject of canonization of the NT in apostolic times by the apostles themselves and hinted at the problem of the translation of phelonen (https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/#comments). As the late Ernest L. Martin showed in the volume I referenced in that thread, the canonization process was started by Peter and Paul as various clues reveal in the NT itself, including a big one when the word in question is rightly understood in context in 2Tim 4.13.\nEven the Catholic Church’s highest saint, Augustine of Hippo, who was instrumental in canonizing the NT as accepted in the Catholic church understood the NT canon to have existed in the time of the apostles:\n“Distinguished from the books of later authors is the excellence of the canonical authority of the Old and New Testaments; which, having been established in the time of the apostles, hath through the succession of overseers and propagators of churches been set as it were in a lofty tribunal, demanding the obedience of every faithful and pious understanding.”\n-Contra Faustum Man\nThe original Aramaic NT in the Peshitta has the word for “bookcase” not cloak. This is important to consider because it provides a clue Paul was in the process of collecting texts for a new canon and needed the materials he requested to do so.\nHere are some relevant paragraphs from Martin’s book that summarize this issue:\n***\nThe Cloak, the Scrolls, and the Parchments\nTimothy and John Mark were asked by Paul to fetch three important items and bring them to Rome. “When you come, bring the cloak [Greek: phelonen] I left with Carpus, and the scrolls, especially the parchments” (2 Timothy 4:13). It is interesting that the phelonen, usually considered to be a heavy outer garment, would be mentioned alongside the paper scrolls (actually scrolls made from the papyrus plant) and the parchments (these were animal skins on which permanent documents were normally written).\nIt seems odd that a heavy coat would be in the same context with literary documents. Most scholars, however, point out that Paul wanted Timothy and Mark to hurry to Rome before winter (verse 21) and that he probably wanted the phelonen which he left with Carpus in order to keep himself warm when the cold would set in. This may be the case, but there are some difficulties with this interpretation. The truth is, the word phelonen had another meaning in the Greek world at the time, one that was intimately connected with scrolls and parchments.\nVincent, in his Word Studies in the New Testament, has this to say about the word phelonen.\n   “Hesychius explains it as originally a case for keeping the mouthpieces of wind-instruments; thence, generally, a box. Phrynicus, a Greek sophist of the second half of the third century, defines it as `a receptacle for books, clothes, silver, or anything else.’ Phelonen was a wrapper of parchments, and was translated figuratively in Latin by toga or paenula `a cloak,’ sometimes of leather; also the wrapping which a shopkeeper put round fish or olives; also the parchment cover for papyrus rolls. Accordingly it is claimed that Timothy in 4:13 is bidden to bring, not a cloak, but a roll-case. So the Syriac Version.” 1\nThe fact is, the word phelonen can mean either a cloak (and it is commonly used that way in Greek literature) or it could mean a receptacle for the placement of scrolls and parchments. It is the context which must determine what the apostle Paul meant by the use of phelonen in 2 Timothy 4:13. Since the word is found right next to scrolls and parchments, the immediate context would suggest a “book cover,” a “book case,” or “book slip” into which scrolls or pages of books were placed. As Vincent stated, the Syriac Version of the New Testament understood it in that manner. Chrysostom, in the 4th century, commented on this very reference of Paul’s and stated that some thought Paul meant a “book case” — a receptacle for books. 2 Even Jerome mentioned this point. 3\nhttp://www.askelm.com/restoring/res031.htm\nPeter talks of leaving behind the testimonies for people to recall them when they needed to, and how was that done? By leaving a written record.\nIn short, it was the apostles themselves who saw the need for a New Testament canon of scriptures and it was they who produced it. When the 1st century Christians finally came to the realization that Christ was not returning to earth in their generation, they began to write accounts of Christ’s life and documents about his teachings for posterity, and they were doing it in the manner they thought best. Luke referred to this and said that “many” were composing such Gospels (Luke 1:1). While this might appear a good thing at first sight, it must be remembered that these written Gospels were being produced within an environment of religious and political insurrection.\nHow could one be certain the various accounts were presenting an accurate narration? It is because of this that Peter and John began to show concern about the matter. If any people were fully aware of what Christ did and taught, and if any people were able to sanction the accuracy of any written history of Christ’s life, it was the apostles. Something had to be done to provide a shining light of truth to those of the future. It was within this background that Peter wrote what we call today his Second Epistle. Let us see what Peter did to secure for those of the succeeding centuries the purity of Christian teaching.\nThe principal subject of Peter’s Second Epistle was “the precious and exceeding great promises” of Christ (2 Peter 1:12). To preserve these for posterity he explained what he was about to do.\n   “Wherefore, I shall be ready, always, to remind you of these things [the promises of Christ], though you know and are firmly fixed in the present truth [the truth that Peter was presently giving them]. And I think it right, as long as I am in this tabernacle [this mortal body], to stir you up by reminder, knowing that the putting off of my tabernacle comes swiftly, even as our Lord Jesus Christ showed me. But I will also give diligence that at each time [notice this phrase ‘at each time’] you may be able after my death to recall these things to remembrance. For not by following cunningly devised fables, made we known to you the power and presence of our Lord Jesus Christ, but we were eyewitnesses of his majesty.\nhttp://www.askelm.com/restoring/res023.htm\n***\nThe irony is that Martin understood Western politics influenced the modern bible layout (OT and NT) and has corrupted academia, yet he still trusted in the party line that the original texts were in Greek even while turning to the Aramaic (“Syriac Version”) to clinch the argument over the intended meaning of the Greek “phelonen” in support of his larger thesis — the Apostles canonized the NT. Martin was brilliant, but not infallible. To his credit he was known to change his mind on important subjects in light of new information — to what degree if any he studied the arguments for Aramaic primacy is unknown to me.\nHis book also shows how the canon would have been finalized by St John in accordance with Torah law (being a priest like Ezra who finalized the OT canon — yes the biblical evidence shows John was from a priest family as was Judas) and creates a symmetry of 49 books (7×7) with 7 divisions mirroring the 7-branched menorah. \nThe fact that the Peshitta NT does not include 2 Peter, 2 John, 3 John, Jude and Revelation may actually help date it prior to these letters being written and finalized by St John who lived to be almost 100 according to early tradition. The church of the East have always maintained that one of the 70 disciples, Addai (Thaddeus), sent by St Thomas, introduced the nascent NT to King Abgar in Edessa, the same who is said to have brought the image of Christ (Mandylion) to King Abgar to heal him. Western NT scholars would typically disregard the validity of this information as they would the validity of the shroud thanks in no small part to the 1988 C14 “tests”.\nNow to put the original NT language in historical context, Josephus makes abundantly clear that writings by Jews during this time would most definitely have been in Aramaic not Greek. Anything Greek was shunned especially after the Maccabean revolt with subsequent recognized Jewish autonomy and was rarely used by Jews (like Paul) with the exception of “Hellenized-Jews” — as it’s said, the exception establishes the rule. The highly educated Josephus himself wrote his works in Aramaic and admits it was tough to learn and translate into the foreign and unaccustomed language (Greek). This would not be the case if Greek really was the lingua franca of Jewish communities that we are always assured it was in NT time by Western NT scholars, why else would the Roman commander posted in Jerusalem be surprised when Paul was able to address him in Greek, then proceeded to address the Jews in “the Hebrew tongue” (ie, Aramaic) in Acts 21.37-22.2?\n“Antiquity of the Jews” 1:7 but because this work surrounded a great deal… in process of time, as usually happens to such as undertake great things, I grew weary and went on slowly, it being a large subject, and a difficult thing to translate our history into a foreign, and to us unaccustomed, language.\n1:129 for such names are pronounced here after the manner of the Greeks, to please my readers; for our own country language does not so pronounce them;\n20:262 And I am so bold as to say, now I have so completely perfected the work I proposed to myself to do, that no other person, whether he were a Jew or foreigner, had he ever so great an inclination to it, could so accurately deliver these accounts to the Greeks as is done in these books.\n20:263 For those of my own nation freely acknowledge that I far exceed them in the learning belonging to Jews: I have also taken a great deal of pains to obtain the learning of the Greeks, and understand the elements of the Greek language, although I have so long accustomed myself to speak our own tongue, that I cannot pronounce Greek with sufficient exactness;\n20:264 for our nation does not encourage those who learn the languages of many nations,\nIn Against Apion, Josephus also shows that “Antiquity” was originally written in his own national tongue and only subsequently translated into Greek (with great effort as stated above):\n1:1 My books of the “Antiquity of the Jews” … Those Antiquities contain the history of five thousand years, and are taken out of our sacred books; but are translated by me into the Greek tongue.\n1:50 Afterward I got leisure at Rome; and when all my materials were prepared for that work, I made use of some persons to assist me in learning the Greek tongue.\nJewish War preface:\n“I have proposed to myself, for the sake of such as live under the government of the Romans, to translate those books into the Greek tongue, which I formerly composed in the language of our country”\nAfter the exile to Babylon, the lingua franca among the Jews who returned to the land (and stayed in Babylon) was Aramaic. This is why they always used the Aramaic Targumim, Talmuds, Mishna, and Midrash. Even the Hebrew bible relies on Aramaic (Syriac) after the exile and tells how Ezra translated the Hebrew bible for the Jews during readings, where the Targum tradition begins.\nRelated:\nJewish Talmud Confirms an Early Gospel of Matthew\nhttp://www.southcoasttoday.com/apps/pbcs.dll/article?AID=/20030419/OPINION/304199940&cid=sitesearch\nThe Aramaic Solution to Jesus’ Conflicting Genealogies\nhttp://thelivingtorah.com/wp-content/uploads/2012/02/Aramaic-Genealogy.pdf\nDoes the Peshitta stem from the Old Syriac?\nhttp://www.aramaicpeshitta.com/Peshitta%20FAQs/peshitta_old_syriac.htm\n\n","date":"May 20, 2014 at 9:16 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"author":"egm","post":"Try #2:\nMay 20, 2014 at 9:16 pm\nReply\nYour comment is awaiting moderation.\nMy very first two posts on this blog touched on the subject of canonization of the NT in apostolic times by the apostles themselves and hinted at the problem of the translation of phelonen (https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/#comments). As the late Ernest L. Martin showed in the volume I referenced in that thread, the canonization process was started by Peter and Paul as various clues reveal in the NT itself, including a big one when the word in question is rightly understood in context in 2Tim 4.13.\nEven the Catholic Church’s highest saint, Augustine of Hippo, who was instrumental in canonizing the NT as accepted in the Catholic church understood the NT canon to have existed in the time of the apostles:\n“Distinguished from the books of later authors is the excellence of the canonical authority of the Old and New Testaments; which, having been established in the time of the apostles, hath through﻿ the succession of overseers and propagators of churches been set as it were in a lofty tribunal, demanding the obedience of every faithful and pious understanding.”\n-Contra Faustum Man\nThe original Aramaic NT in the Peshitta has the word for “bookcase” not cloak. This is important to consider because it provides a clue Paul was in the process of collecting texts for a new canon and needed the materials he requested to do so.\nHere are some relevant paragraphs from Martin’s book that summarize this issue:\n***\nThe Cloak, the Scrolls, and the Parchments\nTimothy and John Mark were asked by Paul to fetch three important items and bring them to Rome. “When you come, bring the cloak [Greek: phelonen] I left with Carpus, and the scrolls, especially the parchments” (2 Timothy 4:13). It is interesting that the phelonen, usually considered to be a heavy outer garment, would be mentioned alongside the paper scrolls (actually scrolls made from the papyrus plant) and the parchments (these were animal skins on which permanent documents were normally written).\nIt seems odd that a heavy coat would be in the same context with literary documents. Most scholars, however, point out that Paul wanted Timothy and Mark to hurry to Rome before winter (verse 21) and that he probably wanted the phelonen which he left with Carpus in order to keep himself warm when the cold would set in. This may be the case, but there are some difficulties with this interpretation. The truth is, the word phelonen had another meaning in the Greek world at the time, one that was intimately connected with scrolls and parchments.\nVincent, in his Word Studies in the New Testament, has this to say about the word phelonen.\n“Hesychius explains it as originally a case for keeping the mouthpieces of wind-instruments; thence, generally, a box. Phrynicus, a Greek sophist of the second half of the third century, defines it as `a receptacle for books, clothes, silver, or anything else.’ Phelonen was a wrapper of parchments, and was translated figuratively in Latin by toga or paenula `a cloak,’ sometimes of leather; also the wrapping which a shopkeeper put round fish or olives; also the parchment cover for papyrus rolls. Accordingly it is claimed that Timothy in 4:13 is bidden to bring, not a cloak, but a roll-case. So the Syriac Version.” 1\nThe fact is, the word phelonen can mean either a cloak (and it is commonly used that way in Greek literature) or it could mean a receptacle for the placement of scrolls and parchments. It is the context which must determine what the apostle Paul meant by the use of phelonen in 2 Timothy 4:13. Since the word is found right next to scrolls and parchments, the immediate context would suggest a “book cover,” a “book case,” or “book slip” into which scrolls or pages of books were placed. As Vincent stated, the Syriac Version of the New Testament understood it in that manner. Chrysostom, in the 4th century, commented on this very reference of Paul’s and stated that some thought Paul meant a “book case” — a receptacle for books. 2 Even Jerome mentioned this point. 3\nhttp://www.askelm.com/restoring/res031.htm\nPeter talks of leaving behind the testimonies for people to recall them when they needed to, and how was that done? By leaving a written record.\nIn short, it was the apostles themselves who saw the need for a New Testament canon of scriptures and it was they who produced it. When the 1st century Christians finally came to the realization that Christ was not returning to earth in their generation, they began to write accounts of Christ’s life and documents about his teachings for posterity, and they were doing it in the manner they thought best. Luke referred to this and said that “many” were composing such Gospels (Luke 1:1). While this might appear a good thing at first sight, it must be remembered that these written Gospels were being produced within an environment of religious and political insurrection.\nHow could one be certain the various accounts were presenting an accurate narration? It is because of this that Peter and John began to show concern about the matter. If any people were fully aware of what Christ did and taught, and if any people were able to sanction the accuracy of any written history of Christ’s life, it was the apostles. Something had to be done to provide a shining light of truth to those of the future. It was within this background that Peter wrote what we call today his Second Epistle. Let us see what Peter did to secure for those of the succeeding centuries the purity of Christian teaching.\nThe principal subject of Peter’s Second Epistle was “the precious and exceeding great promises” of Christ (2 Peter 1:12). To preserve these for posterity he explained what he was about to do.\n“Wherefore, I shall be ready, always, to remind you of these things [the promises of Christ], though you know and are firmly fixed in the present truth [the truth that Peter was presently giving them]. And I think it right, as long as I am in this tabernacle [this mortal body], to stir you up by reminder, knowing that the putting off of my tabernacle comes swiftly, even as our Lord Jesus Christ showed me. But I will also give diligence that at each time [notice this phrase ‘at each time’] you may be able after my death to recall these things to remembrance. For not by following cunningly devised fables, made we known to you the power and presence of our Lord Jesus Christ, but we were eyewitnesses of his majesty.\nhttp://www.askelm.com/restoring/res023.htm\n***\nThe irony is that Martin understood Western politics influenced the modern bible layout (OT and NT) and has corrupted academia, yet he still trusted in the party line that the original texts were in Greek even while turning to the Aramaic (“Syriac Version”) to clinch the argument over the intended meaning of the Greek “phelonen” in support of his larger thesis — the Apostles canonized the NT. Martin was brilliant, but not infallible. To his credit he was known to change his mind on important subjects in light of new information — to what degree if any he studied the arguments for Aramaic primacy is unknown to me.\nHis book also shows how the canon would have been finalized by St John in accordance with Torah law (being a priest like Ezra who finalized the OT canon — yes the biblical evidence shows John was from a priest family as was Judas) and creates a symmetry of 49 books (7×7) with 7 divisions mirroring the 7-branched menorah.\nThe fact that the Peshitta NT does not include 2 Peter, 2 John, 3 John, Jude and Revelation may actually help date it prior to these letters being written and finalized by St John who lived to be almost 100 according to early tradition. The church of the East have always maintained that one of the 70 disciples, Addai (Thaddeus), sent by St Thomas, introduced the nascent NT to King Abgar in Edessa, the same who is said to have brought the image of Christ (Mandylion) to King Abgar to heal him. Western NT scholars would typically disregard the validity of this information as they would the validity of the shroud thanks in no small part to the 1988 C14 “tests”.\nNow to put the original NT language in historical context, Josephus makes abundantly clear that writings by Jews during this time would most definitely have been in Aramaic not Greek. Anything Greek was shunned especially after the Maccabean revolt with subsequent recognized Jewish autonomy and was rarely used by Jews (like Paul) with the exception of “Hellenized-Jews” — as it’s said, the exception establishes the rule. The highly educated Josephus himself wrote his works in Aramaic and admits it was tough to learn and translate into the foreign and unaccustomed language (Greek). This would not be the case if Greek really was the lingua franca of Jewish communities that we are always assured it was in NT time by Western NT scholars, why else would the Roman commander posted in Jerusalem be surprised when Paul was able to address him in Greek, then proceeded to address the Jews in “the Hebrew tongue” (ie, Aramaic) in Acts 21.37-22.2?\n“Antiquity of the Jews” 1:7 but because this work surrounded a great deal… in process of time, as usually happens to such as undertake great things, I grew weary and went on slowly, it being a large subject, and a difficult thing to translate our history into a foreign, and to us unaccustomed, language.\n1:129 for such names are pronounced here after the manner of the Greeks, to please my readers; for our own country language does not so pronounce them;\n20:262 And I am so bold as to say, now I have so completely perfected the work I proposed to myself to do, that no other person, whether he were a Jew or foreigner, had he ever so great an inclination to it, could so accurately deliver these accounts to the Greeks as is done in these books.\n20:263 For those of my own nation freely acknowledge that I far exceed them in the learning belonging to Jews: I have also taken a great deal of pains to obtain the learning of the Greeks, and understand the elements of the Greek language, although I have so long accustomed myself to speak our own tongue, that I cannot pronounce Greek with sufficient exactness;\n20:264 for our nation does not encourage those who learn the languages of many nations,\nIn Against Apion, Josephus also shows that “Antiquity” was originally written in his own national tongue and only subsequently translated into Greek (with great effort as stated above):\n1:1 My books of the “Antiquity of the Jews” … Those Antiquities contain the history of five thousand years, and are taken out of our sacred books; but are translated by me into the Greek tongue.\n1:50 Afterward I got leisure at Rome; and when all my materials were prepared for that work, I made use of some persons to assist me in learning the Greek tongue.\nJewish War preface:\n“I have proposed to myself, for the sake of such as live under the government of the Romans, to translate those books into the Greek tongue, which I formerly composed in the language of our country”\nAfter the exile to Babylon, the lingua franca among the Jews who returned to the land (and stayed in Babylon) was Aramaic. This is why they always used the Aramaic Targumim, Talmuds, Mishna, and Midrash. Even the Hebrew bible relies on Aramaic (Syriac) after the exile and tells how Ezra translated the Hebrew bible for the Jews during readings, where the Targum tradition begins.\nRelated:\nJewish Talmud Confirms an Early Gospel of Matthew\nhttp://www.southcoasttoday.com/apps/pbcs.dll/article?AID=/20030419/OPINION/304199940&cid=sitesearch\nThe Aramaic Solution to Jesus’ Conflicting Genealogies\nhttp://thelivingtorah.com/wp-content/uploads/2012/02/Aramaic-Genealogy.pdf\nDoes the Peshitta stem from the Old Syriac?\nhttp://www.aramaicpeshitta.com/Peshitta%20FAQs/peshitta_old_syriac.htm\n\n","date":"May 21, 2014 at 9:24 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"author":"egm","post":"Biophotons – The Light in Our Cells\nWhat are biophotons ?\nBiophotons, or ultraweak photon emissions of biological systems, are weak electromagnetic waves in the optical range of the spectrum – in other words: light. All living cells of plants, animals and human beings emit biophotons which cannot be seen by the naked eye but can be measured by special equipment developed by German researchers.\nThis light emission is an expression of the functional state of the living organism and its measurement therefore can be used to assess this state. Cancer cells and healthy cells of the same type, for instance, can be discriminated by typical differences in biophoton emission. […]\nAccording to the biophoton theory developed on the base of these discoveries the biophoton light is stored in the cells of the organism – more precisely, in the DNA molecules of their nuclei – and a dynamic web of light constantly released and absorbed by the DNA may connect cell organelles, cells, tissues, and organs within the body and serve as the organism’s main communication network and as the principal regulating instance for all life processes. The processes of morphogenesis, growth, differentiation and regeneration are also explained by the structuring and regulating activity of the coherent biophoton field. The holographic biophoton field of the brain and the nervous system, and maybe even that of the whole organism, may also be basis of memory and other phenomena of consciousness, as postulated by neurophysiologist Karl Pribram an others. The consciousness-like coherence properties of the biophoton field are closely related to its base in the properties of the physical vacuum and indicate its possible role as an interface to the non-physical realms of mind, psyche and consciousness.\nThe discovery of biophoton emission also lends scientific support to some unconventional methods of healing based on concepts of homeostasis (self-regulation of the organism), such as various somatic therapies, homeopathy and acupuncture. The “ch’i” energy flowing in our bodies’ energy channels (meridians) which according to Traditional Chinese Medicine regulates our body functions may be related to node lines of the organism’s biophoton field. The “prana” of Indian Yoga physiology may be a similar regulating energy force that has a basis in weak, coherent electromagnetic biofields.\nBackground\nFirst discovered in 1923 by Russian medical scientist Professor Alexander G.Gurvich (who named them “mitogenetic rays”) and in the 1930s widely researched in Europe and the USA, biophotons have been rediscovered and backed since the 1970s by ample experimental and theoretical evidence by European scientists. In 1974 German biophysicist Fritz-Albert Popp has proved their existence, their origin from the DNA and later their coherence (laser-like nature), and has developed biophoton theory to explain their possible biological role and the ways in which they may control biochemical processes, growth, differentiation etc. Popp’s biophoton theory leads to many startling insights into the life processes and may well provide one of the major elements of a future theory of life and holistic medical practice based on such an approach. The importance of the discovery has been confirmed by eminent scientists such as Herbert Froehlich and Nobel laureate Ilya Prigogine. Since 1992, the International Institute of Biophysics, a network of research laboratories in more than 10 countries, based in Germany, is coordinating research in this field which promises rapid development in the next decade. […]\nFull report:\nhttp://transpersonal.de/mbischof/englisch/webbookeng.htm\nLuke 24:3-4 And they entered in, and found not the body of the Lord Jesus. And it came to pass, as they were much perplexed thereabout, behold, two men stood by them in shining garments\nMatthew 28:1-4 In the end of the sabbath, as it began to dawn toward the first day of the week, came Mary Magdalene and the other Mary to see the sepulchre. And, behold, there was a great earthquake: for the angel of the Lord descended from heaven, and came and rolled back the stone from the door, and sat upon it. His countenance was like lightning, and his raiment white as snow: And for fear of him the keepers did shake, and became as dead men. \nRevelation 21:23 And the city had no need of the sun, neither of the moon, to shine in it: for the glory of God did lighten it, and the Lamb is the light thereof.\nEphesians 5:14 Wherefore he saith, Awake thou that sleepest, and arise from the dead, and Christ shall give thee light.\nPsalm 17:15  As for me, I will behold thy face in righteousness: I shall be satisfied, when I awake, with thy likeness.\nMalachi 4:2  But unto you that fear my name shall the Sun of righteousness arise with healing in his wings; and ye shall go forth, and grow up as calves of the stall. \nDaniel 10:5-6  Then I lifted up mine eyes, and looked, and behold a certain man clothed in linen, whose loins were girded with fine gold of Uphaz: His body also was like the beryl, and his face as the appearance of lightning, and his eyes as lamps of fire, and his arms and his feet like in colour to polished brass, and the voice of his words like the voice of a multitude\nRevelation 1:14-16  His head and his hairs were white like wool, as white as snow; and his eyes were as a flame of fire;  And his feet like unto fine brass, as if they burned in a furnace; and his voice as the sound of many waters. And he had in his right hand seven stars: and out of his mouth went a sharp twoedged sword: and his countenance was as the sun shineth in his strength. \nExodus 34:29-35  And it came to pass, when Moses came down from mount Sinai with the two tables of testimony in Moses’ hand, when he came down from the mount, that Moses wist not that the skin of his face shone while he talked with him.  30 And when Aaron and all the children of Israel saw Moses, behold, the skin of his face shone; and they were afraid to come nigh him. […] And till Moses had done speaking with them, he put a vail on his face.  34 But when Moses went in before the LORD to speak with him, he took the vail off, until he came out. And he came out, and spake unto the children of Israel that which he was commanded.  35 And the children of Israel saw the face of Moses, that the skin of Moses’ face shone: and Moses put the vail upon his face again, until he went in to speak with him.\nNumbers 6:24-27  The LORD bless thee, and keep thee:  The LORD make his face shine upon thee, and be gracious unto thee:  The LORD lift up his countenance upon thee, and give thee peace.  And they shall put my name upon the children of Israel; and I will bless them. \nDaniel 12:2-4  And many of them that sleep in the dust of the earth shall awake, some to everlasting life, and some to shame and everlasting contempt.  3 And they that be wise shall shine as the brightness of the firmament; and they that turn many to righteousness as the stars for ever and ever.  4 But thou, O Daniel, shut up the words, and seal the book, even to the time of the end: many shall run to and fro, and knowledge shall be increased.\netc etc..\n\n","date":"March 20, 2013 at 12:03 pm","url":"https://shroudstory.com/2013/03/20/was-the-shroud-of-turin-a-tablecloth/","cat":"history","title":"Was the Shroud of Turin a Tablecloth?"}],"image":[{"author":"egm","post":"\ndaveb of wellington nz :\nthis marvellous creation cannot be called miraculous, if we stick to the strict meaning of the word.  For all that we ordinarily see is in accord with its own nature.  A miracle can only be said to occur when something happens that transcends its nature, and it requires divine intervention to bring it about.\n\nThat’s the point, the miracles that happen are in accordance with nature and not in violation of it. Let’s not mistake breaking the laws of nature with “freak” occurrences at just the right moment which is foretold or signaled somehow, ie, Christ fulfilling 100s of minute details of prophecy/laws/calendar feasts/foreshadowing/astronomical signs the magi saw and we can see with professional software giving powerful signs, etc, or Moses told to raise his staff, then a strong wind blew all night until the sea parted (wind setdown) and “congealed” just long enough for them to pass — and there just happens to be a narrow underwater ridge with a gentle slope still seen today — til the waters finally crashed down on the Egyptians behind them, etc.\nRe: transcending nature – Man some 500 years ago would’ve said huge mechanical metal birds cruising through the air 1000s of miles carrying tons of cargo would be in violation of the laws of nature/transcend nature – but that doesn’t make it so. Miracles do not transcend nature simply because they are a part of nature, and must be, otherwise how does one witness them in the first place via natural phenomena (sight, hearing, touching?). Saying miracles must not be able to have a logical/scientific explanation is to rig the deck from the start; it’s almost miraculous how widespread such an absurd idea has caught on. As far as I know, it was Thomas Aquinas who first popularized (re-popularized?) this schizophrenia and we’ve been plagued ever since. Nature itself (as we know it) required “divine intervention” because before law and order existed in the universe (as we know it) via the Word/Logos or as in the Aramaic NT, “Miltha” (meaning “word”, “matter”, “manifestation”, “power”, “utterance”, etc.), there was chaos/darkness. \nAnd as an aside because this goes back to something brought up before: the “Logos” idea is widely assumed to be a Greek concept, however this ignores the fact that the primordial “Word” was already mentioned in the Hebrew OT, for example: \nPsalm 33:6  “By the word [dabar] of YHWH the heavens were made, And by the breath of His mouth all their host.” \nPsalm 147:15 “He sends forth His command [imrah] to the earth; His word [dabar] runs very swiftly.”\nThis “Word” took on extensive anthropomorphic development in the Aramaic Targumim which were read side by side with the Hebrew as a paraphrase/explanation in ancient synagogue after the return from Babylon when everyone spoke Aramaic and most forgot Hebrew. This tradition goes back to Nehemiah 8.8 “So they read in the book in the law of God distinctly, and gave the sense, and caused them to understand the reading.”\nAlso, from Gill’s Exposition: \n“The phrase, “the word of the Lord”, so frequently used by the Targumists, is well known: and it is to be observed, that the same things which John here says of the word, they say likewise, as will be observed on the several clauses; from whence it is more likely, that John should take this phrase, since the paraphrases of Onkelos and Jonathan ben Uzziel were written before his time, than that he should borrow it from the writings of Plato, or his followers, as some have thought; with whose philosophy, Ebion and Cerinthus are said to be acquainted; wherefore John, the more easily to gain upon them, uses this phrase, when that of the Son of God would have been disagreeable to them: that there is some likeness between the Evangelist John and Plato in their sentiments concerning the word, will not be denied. Amelius (f), a Platonic philosopher, who lived after the times of John, manifestly refers to these words of his, in agreement with his master’s doctrine” … “In which words it is easy to observe plain traces of what the evangelist says in the first four verses, and in the fourteenth verse of this chapter [ch 1]; yet it is much more probable, that Plato had his notion of the Logos, or word, out of the writings of the Old Testament, than that John should take this phrase, or what he says concerning the word, from him; since it is a matter of fact not disputed, that Plato went into Egypt to get knowledge: not only Clemens Alexandrinus a Christian writer says, that he was a philosopher of the Hebrews (g), and understood prophecy (h), and stirred up the fire of the Hebrew philosophy (i); but it is affirmed by Heathen writers, that he went into Egypt to learn of the priests (k), and to understand the rites of the prophets (l); and Aristobulus, a Jew, affirms (m), he studied their law; and Numenius, a Pythagoric philosopher (n), charges him with stealing what he wrote, concerning God and the world, out of the books of Moses; and used to say to him, what is Plato, but Moses “Atticising?” or Moses speaking Greek: and Eusebius (o), an ancient Christian writer, points at the very places, from whence Plato took his hints: wherefore it is more probable, that the evangelist received this phrase of the word, as a divine person, from the Targums, where there is such frequent mention made of it; or however, there is a very great agreement between what he and these ancient writings of the Jews say of the word, as will be hereafter shown..”\nhttp://gill.biblecommenter.com/john/1.htm\nI think, as Daniel prophesied, knowledge would be increased in latter generations and this is what is happening. Many of the prophecies in the bible sounded impossible in previous generations, but nowadays they are feasible, such as the whole world seeing the two witnesses killed and resurrect three days later in Jerusalem — possible now with satellite tv — or every Israelite sniffed out in every corner of the world and brought back to Israel  –possible now with the world wide DNA database and Genetic Anthropology spearheaded by IBM and National Geographics Society.. btw IBM (Thomas Watson) were the ones who set up and ran the punchcard system Hitler employed to track and profile the Jews, see “IBM and the Holocaust” by Edwin Black. Probably just a coincidence tho.\n\n","date":"November 10, 2012 at 3:40 am","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","title":"You shroudies and your fallacious thinking"},{"author":"egm","post":"\nChrisB :\nDo you believe the miracles like turning water into wine, feeding the five thousand, walking on water etc are allegorical?\n\nI certainly do think they are allegorical, but that doesn’t mean they didn’t really happen either. The bible/God uses our physical world as a metaphor to express higher spiritual meaning. I find it interesting how water plays a such prominent role in the miracles of the bible, NT and OT, from God calling forth the earth and animals out of water to Christ turning it to wine, and is used extensively to express spiritual ideas (baptism/born again, water of life, etc). It’s the most abundant chemical on earth’s surface and in the human body and it’s probably the most versatile and exotic in chemistry. Scientists are at a loss to explain exactly why it should expand its crystalline structure after dropping below 4 degrees Celsius, yet it is crucial for supporting life on earth. There have been some recent discoveries about H2O including that it is able to retain “memory” and the magnetic fields put out by our brains can effect it (such as when you are angry or when saying a prayer). Linus Pauling talked about “structured water” as well. People will always ridicule who aren’t ready for this and unfortunately for those a little too eager for this there are some new age spin off products and disinfo surrounding this research, so take heed. I found an interesting documentary on this subject “Water: The Great Mystery” you can check at http://www.youtube.com/watch?v=b_j-R7swwWY\nAfter I first watched this film I was reminded of a passage from Ecclesiastical History (AD 323) by Eusebius\nCHAPTER IX.\nThe Miracles of Narcissus.\nThe citizens of that parish mention many other miracles of Narcissus, on the tradition of the brethren who succeeded him; among which they relate the following wonder as performed by him. They say that the oil once failed while the deacons were watching through the night at the great paschal vigil. Thereupon the whole multitude being dismayed, Narcissus directed those who attended to the lights, to draw water and bring it to him. This being immediately done he prayed over the water, and with firm faith in the Lord, commanded them to pour it into the lamps. And when they had done so, contrary to all expectation by a wonderful and divine power, the nature of tim water was changed into that of oil. A small portion of it has been preserved even to our day by many of the brethren there as a memento of the wonder. They tell many other things worthy to be noted of the life of this man, among which is this.\nhttp://www.ucalgary.ca/~vandersp/Courses/texts/eusebius/eusehe6.html\nApologies for the delayed response, the email alerts for this thread don’t seem to be working for me.\n\n","date":"November 12, 2012 at 6:16 pm","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","title":"You shroudies and your fallacious thinking"},{"author":"egm","post":"This is a popular mental illness that insists a miracle must be an event that cannot be explained naturally because the moment you do it ceases to be a miracle. Perhaps this idea itself needs to be reevaluated? \nAs a Christian I believe nature itself is miraculous. The more we learn about it, the more mysterious and bizarre it all is — counter-intuitive you could even say. Ever heard of the “miracles of science”? 600 years ago the common man would’ve called our smart phones a “miracle” or “magic.” Being able to explain how it works (to an extent) doesn’t make it any less amazing as we see how the faithful, impalpable and invisible laws of nature — implicating such a faithful law giver — work together and are amenable to our sensorium, nay, our very existence and reality. “Miracles” become all the more impressive when studied with the tools of science/logic, not despite them. \n“Supernatural” is not a biblical term anyway. \nRather, miracles of the bible are very often rare, unusual, highly ‘synchronistic’ events (“signs”) that bear witness to a higher authority in control of events or time/space (interestingly the Hebrew term מוֹעֵד ‘moed’ can mean time or space). Miracles occur in nature because we are in nature, otherwise how could one bear witness to a miracle without using natural phenomena (sight, hearing, touching, etc)? But miracles don’t have to be one-off events in history — human reproduction itself is a miracle, yet it happens constantly. Science by itself cannot explain why it should happen at all, or how it does what it does; we can just tell a bit about what happens as it occurs, muck around with various processes and given materials, but we cannot recreate it from scratch (reproduce reproduction?) with sheer ingenuity, which would only be a product of our nature anyways. This is not to say we never could. As a Christian I also believe we will inherit all the mysteries of nature and be One with Elohim in YHWH as Christ is One body. But before this power is fully invested, one must be purified to enter in the inheritance, born of the spirit, otherwise you have chaos and confusion: \nGenesis 11:6-9  “And the LORD [YHWH] said, Behold, the people is one, and they have all one language; and this they begin to do: and now nothing will be restrained from them, which they have imagined to do. Go to, let us go down, and there confound their language, that they may not understand one another’s speech.  So the LORD [YHWH] scattered them abroad from thence upon the face of all the earth: and they left off to build the city. Therefore is the name of it called Babel [Confusion]; because the LORD [YHWH] did there confound the language of all the earth: and from thence did the LORD [YHWH] scatter them abroad upon the face of all the earth.”\nThis scattering and confusion was an act of mercy, otherwise the unrestrained wickedness of man would leave no flesh left alive. Man is not ready for the responsibility of such awesome power, so this life is an opportunity to test of our talents to see what we are to inherit in the next, tried in the fire and purified as silver, but we have the potential in us now being made in the image of Elohim, and under the righteous rule of Yeshua we will be given this authority as sons of Elohim to subdue all misguided authorities and powers to bring out their best and share in their glory as one “And when all things shall be subdued unto him, then shall the Son also himself be subject unto him that put all things under him, that God may be all in all” 1 Corinthians 15:28. “Beloved, now are we the sons of God, and it doth not yet appear what we shall be: but we know that, when he shall appear, we shall be like him; for we shall see him as he is” 1 John 3:2.\nThe shroud is a palpable token of this hope, a record of eternal life, being careful not to idolize it. For those with ears to hear:\n1 John 5:4-21  “For whatsoever is born of God overcometh the world: and this is the victory that overcometh the world, even our faith.  Who is he that overcometh the world, but he that believeth that Jesus is the Son of God?  This is he that came by water and blood, even Jesus Christ; not by water only, but by water and blood. And it is the Spirit that beareth witness, because the Spirit is truth.  For there are three that bear record: the Spirit, and the water, and the blood: and these three agree in one. If we receive the witness of men, the witness of God is greater: for this is the witness of God which he hath testified of his Son. He that believeth on the Son of God hath the witness in himself: he that believeth not God hath made him a liar; because he believeth not the record that God gave of his Son. And this is the record, that God hath given to us eternal life, and this life is in his Son. He that hath the Son hath life; and he that hath not the Son of God hath not life. These things have I written unto you that believe on the name of the Son of God; that ye may know that ye have eternal life, and that ye may believe on the name of the Son of God.  And this is the confidence that we have in him, that, if we ask any thing according to his will, he heareth us: And if we know that he hear us, whatsoever we ask, we know that we have the petitions that we desired of him. If any man see his brother sin a sin which is not unto death, he shall ask, and he shall give him life for them that sin not unto death. There is a sin unto death: I do not say that he shall pray for it.  All unrighteousness is sin: and there is a sin not unto death.  We know that whosoever is born of God sinneth not; but he that is begotten of God keepeth himself, and that wicked one toucheth him not.  And we know that we are of God, and the whole world lieth in wickedness.  And we know that the Son of God is come, and hath given us an understanding, that we may know him that is true, and we are in him that is true, even in his Son Jesus Christ. This is the true God, and eternal life. Little children, keep yourselves from idols. Amen.”\n2 Corinthians 3:18 – 4:18 “But we all, with open face beholding as in a glass [mirror, ie mirror image] the glory of the Lord, are changed into the same image from glory to glory, even as by the Spirit of the Lord. Therefore seeing we have this ministry, as we have received mercy, we faint not; But have renounced the hidden things of dishonesty, not walking in craftiness, nor handling the word of God deceitfully; but by manifestation of the truth commending ourselves to every man’s conscience in the sight of God. But if our gospel be hid, it is hid to them that are lost: In whom the god of this world hath blinded the minds of them which believe not, lest the light of the glorious gospel of Christ, who is the image of God, should shine unto them. For we preach not ourselves, but Christ Jesus the Lord; and ourselves your servants for Jesus’ sake. For God, who commanded the light to shine out of darkness, hath shined in our hearts, to give the light of the knowledge of the glory of God in the face of Jesus Christ. But we have this treasure in earthen vessels [Murdoch tr: in an earthen vessel], that the excellency of the power may be of God, and not of us. We are troubled on every side, yet not distressed; we are perplexed, but not in despair; Persecuted, but not forsaken; cast down, but not destroyed; Always bearing about in the body the dying of the Lord Jesus, that the life also of Jesus might be made manifest in our body. For we which live are alway delivered unto death for Jesus’ sake, that the life also of Jesus might be made manifest in our mortal flesh. So then death worketh in us, but life in you. We having the same spirit of faith, according as it is written, I believed, and therefore have I spoken; we also believe, and therefore speak; Knowing that he which raised up the Lord Jesus shall raise up us also by Jesus, and shall present us with you.  For all things are for your sakes, that the abundant grace might through the thanksgiving of many redound to the glory of God.  For which cause we faint not; but though our outward man perish, yet the inward man is renewed day by day. For our light affliction, which is but for a moment, worketh for us a far more exceeding and eternal weight of glory;”\nPaul like John, reminds us not to idolize this token of the miraculous:\n“While we look not at the things which are seen, but at the things which are not seen: for the things which are seen are temporal; but the things which are not seen are eternal.”\n\n","date":"November 8, 2012 at 2:53 pm","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","title":"You shroudies and your fallacious thinking"},{"author":"egm","post":"“we have no solid reason for thinking the image represents reflected light on a man’s body”\nGood point. Now I know it’s greatly frowned upon by some designated pro authentication gatekeeprs here, but dare we suggest that the light represented on the shroud is not reflected off the body because rather it came from the body? Imagine that — the shroud visually documents an exotic phenomenon predictable by both OT and NT texts and heavily hinted at in the very narrative surrounding the burial/resurrection of Christ where the shroud would have been during such an event! Hmm, that’s too obvious, let’s just call it a metaphor and quickly move on from this predetermined dead-end without looking deeper into it first!\nFor those who can suppress the emotional knee-jerk and want to scientifically investigate the possibility — is there some documented phenomenon in nature that could at the very least hint at light emitting from the human form? If so, could it under some unusual circumstance be increased to a high enough degree to be seen by the naked eye or physically alter material like the shroud? Are there any leads in the scientific literature of such a strange phenomenon existing?\nBiophotons – The Light in Our Cells\nFrom: http://transpersonal.de/mbischof/englisch/webbookeng.htm\nWhat are biophotons ?\nBiophotons, or ultraweak photon emissions of biological systems, are weak electromagnetic waves in the optical range of the spectrum – in other words: light. All living cells of plants, animals and human beings emit biophotons which cannot be seen by the naked eye but can be measured by special equipment developed by German researchers.\nThis light emission is an expression of the functional state of the living organism and its measurement therefore can be used to assess this state. Cancer cells and healthy cells of the same type, for instance, can be discriminated by typical differences in biophoton emission. […]\nAccording to the biophoton theory developed on the base of these discoveries the biophoton light is stored in the cells of the organism – more precisely, in the DNA molecules of their nuclei – and a dynamic web of light constantly released and absorbed by the DNA may connect cell organelles, cells, tissues, and organs within the body and serve as the organism’s main communication network and as the principal regulating instance for all life processes. The processes of morphogenesis, growth, differentiation and regeneration are also explained by the structuring and regulating activity of the coherent biophoton field. The holographic biophoton field of the brain and the nervous system, and maybe even that of the whole organism, may also be basis of memory and other phenomena of consciousness, as postulated by neurophysiologist Karl Pribram an others. The consciousness-like coherence properties of the biophoton field are closely related to its base in the properties of the physical vacuum and indicate its possible role as an interface to the non-physical realms of mind, psyche and consciousness.\nThe discovery of biophoton emission also lends scientific support to some unconventional methods of healing based on concepts of homeostasis (self-regulation of the organism), such as various somatic therapies, homeopathy and acupuncture. The “ch’i” energy flowing in our bodies’ energy channels (meridians) which according to Traditional Chinese Medicine regulates our body functions may be related to node lines of the organism’s biophoton field. The “prana” of Indian Yoga physiology may be a similar regulating energy force that has a basis in weak, coherent electromagnetic biofields.\nBackground\nFirst discovered in 1923 by Russian medical scientist Professor Alexander G.Gurvich (who named them “mitogenetic rays”) and in the 1930s widely researched in Europe and the USA, biophotons have been rediscovered and backed since the 1970s by ample experimental and theoretical evidence by European scientists. In 1974 German biophysicist Fritz-Albert Popp has proved their existence, their origin from the DNA and later their coherence (laser-like nature), and has developed biophoton theory to explain their possible biological role and the ways in which they may control biochemical processes, growth, differentiation etc. Popp’s biophoton theory leads to many startling insights into the life processes and may well provide one of the major elements of a future theory of life and holistic medical practice based on such an approach. The importance of the discovery has been confirmed by eminent scientists such as Herbert Froehlich and Nobel laureate Ilya Prigogine. Since 1992, the International Institute of Biophysics, a network of research laboratories in more than 10 countries, based in Germany, is coordinating research in this field which promises rapid development in the next decade. […]\nFull report:\nhttp://transpersonal.de/mbischof/englisch/webbookeng.htm\n***\nMatthew 17:1-2 And after six days Jesus taketh with him Peter, and James, and John his brother, and bringeth them up into a high mountain apart: and he was transfigured before them; and his face did shine as the sun, and his garments became white as the light.\nMark 9:2-3 And after six days Jesus taketh with him Peter, and James, and John, and bringeth them up into a high mountain apart by themselves: and he was transfigured before them; and his garments became glistering, exceeding white, so as no fuller on earth can whiten them.\nLuke 9:29 And as he was praying, the fashion of his countenance was altered, and his raiment [became] white [and] dazzling.\nLuke 24:3-4 And they entered in, and found not the body of the Lord Jesus. And it came to pass, as they were much perplexed thereabout, behold, two men stood by them in shining garments\nMatthew 28:1-4 In the end of the sabbath, as it began to dawn toward the first day of the week, came Mary Magdalene and the other Mary to see the sepulchre. And, behold, there was a great earthquake: for the angel of the Lord descended from heaven, and came and rolled back the stone from the door, and sat upon it. His countenance was like lightning, and his raiment white as snow: And for fear of him the keepers did shake, and became as dead men.\nRevelation 21:23 And the city had no need of the sun, neither of the moon, to shine in it: for the glory of God did lighten it, and the Lamb is the light thereof.\nEphesians 5:14 Wherefore he saith, Awake thou that sleepest, and arise from the dead, and Christ shall give thee light.\nPsalm 17:15 As for me, I will behold thy face in righteousness: I shall be satisfied, when I awake, with thy likeness.\nMalachi 4:2 But unto you that fear my name shall the Sun of righteousness arise with healing in his wings; and ye shall go forth, and grow up as calves of the stall.\nDaniel 10:5-6 Then I lifted up mine eyes, and looked, and behold a certain man clothed in linen, whose loins were girded with fine gold of Uphaz: His body also was like the beryl, and his face as the appearance of lightning, and his eyes as lamps of fire, and his arms and his feet like in colour to polished brass, and the voice of his words like the voice of a multitude\nRevelation 1:14-16 His head and his hairs were white like wool, as white as snow; and his eyes were as a flame of fire; And his feet like unto fine brass, as if they burned in a furnace; and his voice as the sound of many waters. And he had in his right hand seven stars: and out of his mouth went a sharp twoedged sword: and his countenance was as the sun shineth in his strength.\nExodus 34:29-35 And it came to pass, when Moses came down from mount Sinai with the two tables of testimony in Moses’ hand, when he came down from the mount, that Moses wist not that the skin of his face shone while he talked with him. 30 And when Aaron and all the children of Israel saw Moses, behold, the skin of his face shone; and they were afraid to come nigh him. […] And till Moses had done speaking with them, he put a vail on his face. 34 But when Moses went in before the LORD to speak with him, he took the vail off, until he came out. And he came out, and spake unto the children of Israel that which he was commanded. 35 And the children of Israel saw the face of Moses, that the skin of Moses’ face shone: and Moses put the vail upon his face again, until he went in to speak with him.\nNumbers 6:24-27 The LORD bless thee, and keep thee: The LORD make his face shine upon thee, and be gracious unto thee: The LORD lift up his countenance upon thee, and give thee peace. And they shall put my name upon the children of Israel; and I will bless them.\nDaniel 12:2-4 And many of them that sleep in the dust of the earth shall awake, some to everlasting life, and some to shame and everlasting contempt. 3 And they that be wise shall shine as the brightness of the firmament; and they that turn many to righteousness as the stars for ever and ever. 4 But thou, O Daniel, shut up the words, and seal the book, even to the time of the end: many shall run to and fro, and knowledge shall be increased.\netc etc..\n\n","date":"October 18, 2013 at 12:40 pm","url":"https://shroudstory.com/2013/10/18/how-do-we-know-no-directionality-of-light/","cat":"uncategorized","title":"How do we know? No directionality of light."}],"misc":[{"author":"egm","post":"“If anything, being honest and not denying science (e.g. by quoting scripture or an apologetic argument) elevates science.”\nInteresting how simply quoting scripture is now equated with denying science. Sounds very Dawkins-inspired kind of thinking. Shall we just edit out the reality that nearly all the founders of the modern fields of science (later hijacked by the World Socialists/Atheists political front) were inspired by those very scriptures that now ‘believers’ in this woeful age seem to be embarrassed of in a scientific discussion? Scripture is deceptively simple on the surface yet so far over the tiny mind of the typical modern thinker that it takes the brilliant gift of a Newton or Planck to perceive and dedicate themselves to exploiting its other-worldly, timeless, divine treasures over against mass-marketed worldly conventional wisdom that would divorce scripture from science and vice-versa.\n“There are more sure proofs of authenticity in the Bible than in any secular history. *All my discoveries have been made in answer to prayer.* I can take my telescope and look millions of miles into space; but I can go away to my room and in prayer get nearer to God and Heaven than I can when assisted by all the telescopes of Earth!” -Isaac Newton\n\n","date":"June 11, 2013 at 4:50 am","url":"https://shroudstory.com/2013/06/10/pounding-the-square-peg-into-the-round-hole/","cat":"news_&_views","title":"Pounding the square peg into the round hole"}],"researchers":[{"author":"egm","post":"It’s the Berrys of the world that have tarnished the respect the title PhD may have once demanded in my eyes. His habitually biased and obnoxious approach in shroud studies are enough to defrock him of any objective scientific ‘credentials’ he is ever so keen to remind you of at every passing chance; frankly, it’s childish. He appears to be little more than a shill for the typical shallow-minded hypercritics and militant atheists to thoughtlessly lap up and regurgitate on message boards across the web when confronted with the hard facts and serious scientists like Rogers. He seems to generate noise designed to drown out the good information and slow the progression of knowledge. In short, he’s a career troll.\nI for one will ignore this nuisance from now on.\n\n","date":"October 7, 2012 at 4:44 pm","url":"https://shroudstory.com/2012/10/07/shame-on-you-dr-colin-berry-phd-or-ray-rogers-consummate-researcher-excellent-scientist/","cat":"other_blogs","title":"Shame on you, Dr. Colin Berry, PhD or Ray Rogers, Consummate Researcher, Excellent Scientist"},{"author":"egm","post":"Actually this sounds like a valid hypothesis overall, the details might not be there yet but the means and motives definitely are. It’s likely the test was rigged from multiple angles in case any one should fail, from the shady sample selection to the backdoors in the system. The shroud is so important we cannot dismiss the depths enemies of Christ will stoop to discredit him and his witnesses (material witness in this case). Just read the Gospels and Acts to see the conspiracy against Christ, the Apostles, and subsequent disciples down the ages. Do you think it ever ended? Christ is a huge headache for the world powers, religious and political, not least of all Atheist world Socialism.\nDon’t be surprised if enemies of Christ are willing to portray themselves as Shroud supporters complete with Shroud blogs, only to shoot down any real progress in Shroud studies with cheap buzzwords for weak minds like ‘tinfoil hat’ or ‘conspiracy theory’ in order to manage the discussion. These Judas goat actors are to be expected “And no wonder, for even Satan disguises himself as an angel of light. So it is no surprise if his servants, also, disguise themselves as servants of righteousness. Their end will correspond to their deeds.” 2Cor 11.14-5\nWhile I might not agree with everything said I do appreciate the persistence of Stephen Jones — keep at it!\n\n","date":"March 8, 2014 at 3:13 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"},{"author":"egm","post":"Just want to add that the means definitely existed at the time but was it in place? I would think it highly likely to be, but this is important to verify. The motive however has always been there, whether it be a KGB agent or otherwise as pointed out already.\n\n","date":"March 8, 2014 at 3:38 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"},{"author":"egm","post":"Re: #7\nMike, I was under the impression that the results were not produced simultaneously – not an major issue anyway. Really though, it’s a bit naive to think conspiracies are not at work to undermine Christ and his servants when it’s been recorded this way since the beginning of the Gospels not to mention the reason Christ was crucified to begin with. Conspiracies abound in just about every sphere of humanity. Just hang around a criminal courtroom for a some time if you lived a sheltered life. \n“I don’t discount fraud up to the sampling stage,” so you don’t discount the sampling was fraudulent – that’s a start. All it takes is more than one person involved to make it a conspiracy, nothing too outlandish. Careful you don’t slip up and admit conspiracies are possible, what would the good and most noble members of the Order of the Shroud Blog think of you? I’m sure we can find something in the DSM to diagnose you with. That’s ok, I suppose I should take your word at face value about how the lab systems worked back then and how all airtight it was because you worked at all three labs (simultaneously) and they ran the same C14 tests run in pharm labs and it’s absurd to think otherwise, etc etc. That might all be true for all I know, I hope it’s that simple. For the record I don’t know Jull and have never met and got to know the man and can’t vouch for his character, I guess you have and therefore can. \nWhat I do find absurd was the push against a perfectly valid line of inquiry about the security details surrounding perhaps the most important C14 test in history. Why the heck wouldn’t we want to know more about it?? All of a sudden we have you as an expert to pop up and explain it all away with a wave of the hand? The group response against it seemed unnatural and a bit overdone, even.. dare I say it.. suspicious? (Maybe you can insert a tin-foil hat comment here) I felt compelled to add some balance to the discussion, but I never said I believed it happened as described, I only made it clear I believed it could very well have happened, especially in light of the criminal sample process and suspicious date. There should be a full on investigation of the whole situation start to finish with full cooperation from everyone involved. That will never happen of course. The next best thing is what Mr. Jones is doing and what does he get in return? A slap down by people supposedly most interested in learning about it.\nOne small request Mike M, please don’t accuse me of branding someone a satan when I didn’t (Satan is referred to as the Accuser btw). The quote I gave also refers to servants of Satan (Adversary) who pose and act like believers of Christ to undermine their faithfulness. Of course quoting the bible to such won’t make much difference since they’ll just tell you Paul didn’t write 2 Corinthians (a pious fraud perhaps) or Christ may have misspoke here or there, etc etc. Hope that clears things up.\nBtw, I’d just like to point out that those who think the Shroud a fraud are conspiracy theorists. They would typically push the narrative that the cloth image is man-made and peddled by members of the church (hierarchy) to attract a large patronage with hopefully larger pockets, or at least some variation of this plan which would require more than one person involved in the fraud.\n\n","date":"March 10, 2014 at 10:55 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"},{"author":"egm","post":"Re: #9\nMike, I don’t think I was upset, why would you think that? I might have poked fun at the stereotypes projected on those of us who study history and understand conspiracies are a huge part of life where power and wealth reside. Maybe you don’t believe me, that’s ok I’m cool with that. \nI wonder why you twisted my words when you misquoted me “Lived a sheltered life” editing out “in case you..” Typical tactic when you can’t address what was actually said just edit it how you like. As you said, I don’t know you and didn’t assume you were “street wise,” know what I mean? So no ad hominem there I’m afraid.\n““Noble members of the blog”…. again very typical…generalize without countering the actual arguments just bundle everyone else together and brand them.” It’s easier than actually listening to what they are saying.”\nNow you’re accusing me of not listening. No, I didn’t “bundle everyone together” either because not everyone plays the  ‘conspiracy theory’ or ‘tin-hatter’ card to stifle the discussion, just the ones who know who they are. And if I respond to an issue raised here, yes I do my best to read what others before me have said and then respond. The typical response was to hit the ‘conspiracy theory’ button way too fast to what Jones was proposing as if just invoking the words wins the argument. That’s kinda why I started my original post with “actually this sounds like a valid hypothesis..” and laid out my train of thought and tried to address issues with the reception of said proposal (ie, the conspiratorial nature of it, and the poor response it received; this is a pattern I’ve seen for some time btw, and not just on this blog). So why assume I didn’t listen? Do you have any evidence I didn’t or are you making another dig at me because you yourself can’t address the points?\n““find something in DSM to diagnose you with” dude…what are you talking about.”\nThis was a small joke, sorry you missed it. Some background: People will often stereotype those who bring up conspiracies as having mental issues without hearing them out, and the DSM is the bible of Psychiatry used to diagnose mental disorders. Interestingly, one of the signs used to diagnose some form of schizophrenia I believe was if the patient held the belief that the government wiretaps the phones! So there you have it, Edward Snowden is a headcase and should be extraordinary renditioned to the nearest re-education camp for processing immediately! The NSA’s good name has now been cleared! You have to have humor on this board sometimes.\n““Can’t vouch for Jull’s character”….neither can I, but why assume the worst in people. If you don’t know the guy why assume he is part of a conspiracy? Just because you don’t agree with him?”\nNow you’re accusing me of assuming the worst in people and Jull is part of the conspiracy?? Sounds to me like you’re the one assuming the worst in people — me. No, I was being completely neutral about Jull which I think is the smart approach in this delicate subject. If this were a criminal investigation (which it probably should be) and I was a detective, people in his position would definitely be a suspect — I do NOT assume his guilt, nor his innocence. You on the other hand admit you don’t know him but take him at his word anyways. Fine with me, I’m just trying to be a bit more cautious and circumspect in my approach and putting your voice in context when you support him.\n““Have you as an expert”…… I never said I was.”\nGood I wanted to get that out in the clear because some may have been mislead by your, what may have appeared to be, seeming authority on the subject discussed. So, it’s not that I don’t want to believe you when you pipe up to assure everyone that everything ran perfect and no shenanigans were afoot (nevermind that their were shenanigans afoot during the thoughtfully screwed up sample process which should immediately cast the whole dark operation in a suspect light), it’s just that you might not exactly be qualified to say so one way or the other, nor am I, only I don’t assume to do so as you did while attempting to insult and accuse others (me) who think it wise to investigate carefully the security detail surround what I believe to be the most important C14 test in history and get real facts, referring to when you said:  “resorting to conspiracy theories and branding other believers as Satans… Conspiracy theories won’t get us anywhere.”\n“Why are you angry? May be because you have nothing to back up your claims with?”\nNot sure why you have to focus on accusing me of being angry. I admit, I don’t like being BS’d though and give short shrift to those who engage in it — not saying you’re doing that, but constantly accusing people of things they’re not doing really isn’t.. cool dude. It kinda makes you look bad and discredits you. Not sure I’ll respond to you if you keep doing it. Also, exactly what claims am I making without back up?? Please back this accusation up.\n““Quoting the bible to such wont make much difference” …..Neither to you my friend, so I won’t even bother.”\nAnd can you provide some proof for your opinion as I did mine, friend?\nIt’s duly noted how you responded to my request to not accuse me with many more accusations. I’m beginning to think you really like the Accuser title, like a son proudly bearing the family mark of his father perhaps.\n\n","date":"March 11, 2014 at 3:14 am","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"},{"author":"egm","post":"The Peshitta is the Aramaic bible and it includes the OT and NT. It’s popular dogma among Westerners to say it’s based on Greek manuscripts, but the Church of the East has always maintained it comes directly from the apostles in their original language, and they have been rooted in the region where the disciples were first called “Christians” and Thaddeus met King Abgar. I’m not an expert, but there are compelling arguments internal to the texts favoring Aramaic primacy (such as Hebraisms that are lost in translation), at least for the majority of the books (I don’t believe Luke originally wrote the gospel and Acts in Aramaic to Theophilus), nevermind historical. It also beautifully resolves the longstanding problem regarding Yeshua’s genealogy that plagues the Greek Matthew which has led to every kind of tortured logic to explain by apologists (it’s never good to kick off the NT canon with a glaring mistake). Search ‘Response to anti Peshitta Primacy arguments’ for details.\nThe manuscript tradition and integrity of the Peshitta is also superior to the problematic Greek families, something that is widely ignored among Western scholars or dismissed out or hand. Since the days of Jerome, there has been a strong bias to ‘Westernize’ the church in Europe, even to the point of rearranging the order of the NT canon thus obscuring it’s underlying symmetrical design reflecting the 7-branched menorah (see the late Ernest L. Martin’s (who did not argue for Aramaic primacy) ‘Restoring the Original Bible,’ Chapter 1, free to read online http://www.askelm.com/restoring/index.asp). The Church of the East however does not consider 2Peter, 2John, 3John, Jude, and Revelation canonical as they likely were not written when the Aramaic NT was first canonized — evidence of the canonization process is in the NT itself but partially concealed by the Greek translation, go figure), which also destroys the symmetry. A blindness in part on both sides it would seem, but there you have it. Paul Younan’s website Peshitta.org is a wonderful resource with interlinear translations, articles, and forums for more info.\n\n","date":"August 21, 2012 at 10:09 pm","url":"https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/","cat":"books","title":"Another Review of Thomas de Wesselow’s “The Sign”"},{"author":"egm","post":"I have serious reservations about relying on Wikipedia particularly on controversial subjects (I’ll spare you the personal confrontations with some “admins” there)! Like I indicated, there are rampant biases in this area and it’s easy to pick up on them, but if you persevere and do serious studies with an open mind you’ll find they don’t really hold water. You could liken it to how biased the mainstream media and academic “authorities” are on (mis)reporting the facts on the Shroud with appeals to popular ignorance and oceans of disinformation to wade through. This isn’t the place to address all your misgivings, that’s why I gave out Younan’s website for those who want to investigate deeper and find answers to these things.\nMartin left the Church of God several decades before his death as he grew in faith and knowledge. His research stands up on it’s own as it’s documented to the hilt vis-a-vis Western biases reflected in the theology/bible of the West. I don’t agree with Barrie Schwortz’s views regarding Christ, yet I’m able to objectively value in his research on the Shroud of Christ because it stands up on its own.\n\n","date":"August 22, 2012 at 1:07 pm","url":"https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/","cat":"books","title":"Another Review of Thomas de Wesselow’s “The Sign”"}],"resources":[{"author":"egm","post":"\ndaveb of wellington nz :\nThe Greeks picked up the Hebrew habit of gematria (Gk “esopsephia”) during New Testament times (e.g. Rev use of the numer 666 for antichrist).\n\nJust as a side note, the OT adds clarity to the interpretation of the 666 reference in Rev 13 in the book of Ezra. There we see the use of the ‘number of men’ phrase referring to the number of children called by a family name in the census taken of those coming out of Babylon to rebuild Jerusalem: “the *number of the men* of the people of Israel” -Ezra 2.2. The skip some short verses down and we read: “The children of Adonikam, six hundred sixty and six (666)” -Ezra 2.13. Adonikam = “my lord arose,” of the tribe of Dan from my research. \nThe bit about causing all to receive a mark (name) in the forehead or right hand is a pledge of loyalty to a global political super star (antichrist), a sort of spiritual marriage between the beast and whore of Babylon as a name is traditionally taken in marriage by the wife, and in Hebrew understanding name (shem) = essence; shem is the root of neshama (soul), and what it the essence of a man but his soul?: “upon her forehead a name is written, Mystery, Babylon the Great, Mother of Harlots, Abomination of the Earth” vs the marriage of the Lamb to the faithful bride, New Jerusalem, the number of his name, 144,000  “having his Father’s name written in their foreheads” -Rev14.1, cf Eze 9.4. The High Priest, foreshadowing Yeshua as Melchizedek, had the Name fixed on his forehead, Exo 28.36-8. \nJust as the registration/enrollment (not a tax as widely assumed; compare Luke 2.1 with Heb 12.23, same roots in Aramaic and Greek) decreed by Augustus Caesar as Pontifex Maximus would’ve included a pledge of loyalty soon before Christ came the first time around it will be with the second. The Roman elite, like the Jews and Samaritans, were aware of the Babylonian prophecies/Jewish oracles (ie, the head magi Daniel’s, Isaiah’s, even Balaam’s star prophecy, etc) of a world leader — the Seed of the Woman (cf Spica/Zera in Virgo/Bethulah) — who was to come on the scene in their time. The Roman ruling elite however hijacked the prophecies and applied them to Caesar to usher in a Golden Age, novus ordo seclorum if you like (see Virgil’s commissioned work, Eclogues IV, circa 37 BCE). Some of Nero’s astrologers were even convinced he was to rule from Jerusalem. \nBasically the Roman puppet Herod was following a legal precedence causing him to eliminate any competition to the fulfillment of this prophecy outside the line of Caesar which is why the good news from the Magi of the signal of the King’s (Melech’s) star (Zedek=”Righteousness”/Jupiter) was considered bad news: “When Herod the king heard this, he was troubled, and all Jerusalem with him” -Matt 2.3. His second coming will be bad news to the world political power structure again which still seeks to bump him from his rightful place on the throne as king of kings and rob him of his glory — quite literally as in the cause of the shroud image you might say.\nBut anyways.. how ’bout those poker holes!\n\n","date":"June 13, 2013 at 6:02 am","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?"}]}
