{"art":[{"author":"ejdavid","post":"No Edit Button – EDIT\nParagraph 1 line 3 “arcane” not achain.\nParagraph 2 line “three to one” not three two one.\nParagraph 3 line 2 “Further, my mustard-seed level of faith is supported by both the young artist’s depiction, and through its identification by another child as accurate. The depiction is  clearly and closely consistent with the shroud image.”\n\n","date":"September 22, 2013 at 4:10 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"ejdavid","post":"Shroud Of Turin\nA few yeas ago I decided to seriously investigate commentaries on the shroud in order to inform my own conclusions. I am a retired Congressional Investigator [US General Accountability Office] and have decades of sifting through voluminous archain data and this was a typical investigation for me. In this post I will only present my conclusions since a detailed narrative would be too long. However, I was serious enough to purchase AD 30 [Greek Date LIZ] Pontius Pilate Lepton on the international antiquities market to see if the claims of such Leptons on the eyes were creditable to me. They were not. Here are some of my other conclusions.\nFirst, the artifact is almost certainly of the appropriate age and from the appropriate locality Specifically; 1) The C14 data on midieval origin is entirely discredited on its own terms; see French Reweaving. Further, multiple separate evidentiary facts point to an early date. These include at least two surreptitious C-14 dating efforts on residual threads left over from other tests, as well as the near impossibility that a three two one herringbone weave would have been ‘hank bleached’ in the Midieval era. 2) The other tests included tape samples for polen spores that also accumulated thread fibers. The polen spores locate specifically to Jerusalem.\nI do not claim the shroud is that of Jesus. Only that it is consistent with that possiblility.  Further, my mustard seed level of faith is supported by the actual image, which clerly looks like the shroud image. And it was, apparently, identified as the appropriate depiction by a young boy who had a near death experience. I forget the name of the book, but it is where I got the reference to the young female artist.\n\n","date":"September 22, 2013 at 3:55 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
