{"art":[{"author":"ekmcmahon","post":"I agree, the eyes seem to  show love as God loves his creations.","date":"April 14, 2014 at 12:14 am","url":"https://shroudstory.com/2014/04/13/faces-of-jesus-is-a-shroud-of-turin-genre-evolving/","cat":"art","title":"Faces of Jesus: Is a Shroud of Turin Genre Evolving?"},{"author":"ekmcmahon","post":"I know so very little of what happens to a body after it ceases life.  I know that they are buried as were my immediate family members after their death.","date":"August 24, 2013 at 7:38 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem"},{"author":"ekmcmahon","post":"Why in their dreams do artists of Christ on the cross place the nails in the palms of his hands ?","date":"April 18, 2014 at 4:43 am","url":"https://shroudstory.com/2014/04/18/good-friday/","cat":"art","title":"Good Friday"},{"author":"ekmcmahon","post":"We are talking about The All Powerful Almighty God who is in reality invisible.  Does God need DNA to exist ? ?  I would have to say that it is one of the Mysterious facts that we are not capable of understanding the full of. It seems to me that DNA is necessary for the material world.","date":"August 12, 2013 at 2:47 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"author":"ekmcmahon","post":"Nice repeat of data most probably taking the date of the Shroud back to the 1st century.","date":"February 16, 2015 at 7:47 am","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","title":"Lamentation Art"},{"author":"ekmcmahon","post":"For some reason volume was very low.","date":"August 1, 2015 at 3:48 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","title":"Not a Work of Art by Leonardo da Vinci"},{"author":"ekmcmahon","post":"Didn’t I read on one of thee sites something that was worded similar to “I know what we have here is that I don’t know, it is incomprehensible” ??","date":"December 11, 2014 at 4:04 am","url":"https://shroudstory.com/2014/12/11/roger-bassetts-clarifying-art/","cat":"art","title":"Roger Bassett’s Clarifying Art"},{"author":"ekmcmahon","post":"Why ask us, why not ask the artist?? >________________________________ > From: Shroud of Turin Blog  >To: ekmcmahon@att.net  >Sent: Thursday, August 8, 2013 5:11 AM >Subject: [New post] Why don’t I see the swollen nose in any of the art? >   > WordPress.com  >Dan posted: “Stephen Jones has added the next installment 3.4 (part 22) of The Bible and the Shroud with The man on the Shroud was beaten. It is a well organized treatment of how observed facial characteristics, presumably caused by beating, seem to be evident in some”   >","date":"August 8, 2013 at 5:22 pm","url":"https://shroudstory.com/2013/08/08/why-dont-i-see-the-swollen-nose-in-any-of-the-art/","cat":"art","title":"Why don’t I see the swollen nose in any of the art?"}],"blood":[{"author":"ekmcmahon","post":"I believe that Jesus Christ arose from the dead.  The Shroud is a proof of that.","date":"October 30, 2015 at 4:54 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"author":"ekmcmahon","post":"I am in no way a scientist as a matter of fact in reading , or should I say try to read, some of the comments that a lot of the science types have put here to others of the same science trained minds – I am totally off and end up skipping a lot of the comment as it is as reading a foreign language because it is.In my mind, the Jesus body that slid through the Shroud is the same Jesus that died but his body was totally reconfigured, that is one reason he asked or told St, Mary Magdalene not to touch him.  I think it will take a miracle on our human part to fully explain just how every facet of the image was produced.  We will have to know more about what God is composed of. Jesus changed from the Human body/God Soul to the God Physical Body/God Soul.","date":"November 1, 2015 at 6:56 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"author":"ekmcmahon","post":"My 2 cents worth, when Jesus was placed onto the Shroud, after he had been lightly cleaned, the Shroud was lightly over the top of his head and placed onto the front of his body. The shroud was not “wrapped tightly or snuggly around this head.  When you look at  front image of his head, you can see his hair above the forehead for a few inches then the front image stops and the back image starts and all you see his hair and the image of the skull impression through the hair.  it all has to do with how much pressure was exerted while placing the Shroud on his head and the front of his body.  They were very respectful while putting him “in” the Shroud (or puting the Shroud around him).  I hope this made sense,","date":"March 8, 2014 at 4:36 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"author":"ekmcmahon","post":"I don’t recall which article or how many years ago that I had read that the body of our Lord Jesus was lightly cleaned just before his burial.  There was/is still some dirt from his feet on the bottom of the Shroud.  Apparently the body was still oozing some blood a minor amount of bodily fluids water, oils etc.","date":"October 11, 2015 at 4:25 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"author":"ekmcmahon","post":"As I have said before, I am not a scientist.  I know what I see and have read on these Shroud sites.  What I have read is that the DNA from the blood samples removed from the Shroud are all the same. I find it doubtful that a “helpful” Monk several hundreds of \\years ago did some touch up work and just happened to use the same DNA matching blood type. My insides tell me that it is just as Jesus Christ left for us as a reminder of who he is and what he did for us.","date":"January 29, 2015 at 5:45 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"}],"dating":[{"author":"ekmcmahon","post":"I am rather fond of the pollen trail.  There has been found pollen from every geographical location that the Shroud has spent any significant length of time at, including its point of origination.","date":"November 29, 2014 at 9:21 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"author":"ekmcmahon","post":"A good reason for my last comment – http://www.shroud.com/danin2.htm","date":"November 29, 2014 at 9:57 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"author":"ekmcmahon","post":"In “theory” he was supposed to be married to St. Mary of Magdala, Personally, I don’t believe it, why would the Son of God marry.  There is no need to. As for priests marrying, Mother Church is their wife and the people are their children if you need to think in those terms. A priest’s life is to be dedicated to God, not a separate Earth family needing the moral and financial obligations being met.","date":"April 11, 2014 at 2:44 pm","url":"https://shroudstory.com/2014/04/11/funny-that-when-it-comes-to-the-shroud-of-turin-the-carbon-testing-must-be-considered-watertight-scientific-proof/","cat":"carbon_14_dating","title":"Funny that when it comes to the Shroud of Turin the carbon testing must be considered watertight scientific proof."},{"author":"ekmcmahon","post":"Which of the twelve  male Apostles or 7 women Disciples who were alive and walked with Jesus  wrote a fact about Jesus being \\married??  Just because someone 200 or 400 or 800 or 2000 years after the fact said a word about marriage or wife in the same sentence as the name of Jesus, is not factually stating that Jesus was married.","date":"April 11, 2014 at 7:23 pm","url":"https://shroudstory.com/2014/04/11/funny-that-when-it-comes-to-the-shroud-of-turin-the-carbon-testing-must-be-considered-watertight-scientific-proof/","cat":"carbon_14_dating","title":"Funny that when it comes to the Shroud of Turin the carbon testing must be considered watertight scientific proof."},{"author":"ekmcmahon","post":"I am one of those who don’t believe that any type of hacking was necessary as the small part used was from a small part of a stitched on repair job.","date":"July 7, 2015 at 5:15 am","url":"https://shroudstory.com/2015/07/07/the-hacking-of-the-carbon-dating-wikipedia-and-the-media/","cat":"conspiracy_theory","title":"The Hacking of the Carbon Dating, Wikipedia and the Media"},{"author":"ekmcmahon","post":"I totally disagree with the article especially the angle it is pointed to.  All of the research to date has been pointing to one thing and that is that the Shroud is the cloth that our Lord Jesus Christ was ‘wrapped’ in grave in.  The big question that science has, in my opinion, is how did God do it ??  Science wants to learn the in’s and out’s of the procedure so that they can become as gods.  That is even covered in the Scriptures. The research pointed to the middle age repair work and the fact that the Carbon 14 dating was done on a repaired portion of the cloth.  My main concern is the number of people who do not accept the ‘99%’ that proves what the Shroud is but are die-hards in accepting the ‘1%’ of the what the Shroud isn’t.  It seems to me that the Shroud points to the fact that Jesus Christ arose from the dead and that fact is just too hard for people to accept.  There is a date and time for every living human on the Earth to face the facts.","date":"July 23, 2015 at 7:11 pm","url":"https://shroudstory.com/2015/07/23/if-they-had-only-waited-until-2020-or-so/","cat":"carbon_14_dating","title":"If They Had Only Waited Until 2020 Or So"},{"author":"ekmcmahon","post":"I fully agree.","date":"December 1, 2014 at 7:04 am","url":"https://shroudstory.com/2014/12/01/paper-chase-the-origin-of-rogers-raes-and-c14-samples-by-thibault-heimburger/","cat":"paper_chase","title":"Paper Chase:   The origin of Rogers’ Raes and C14 samples by Thibault Heimburger"},{"author":"ekmcmahon","post":"This is my  comment for all of the Shroud’s blogs.  What is it about the fact of the Shroud being the actual burial cloth of Jesus Christ that scares the hot poop out of people???","date":"March 29, 2014 at 3:49 pm","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","title":"Stephen Jones’ Revised Hacking Theory Part I is Available"},{"author":"ekmcmahon","post":"Out of politeness, I won’t YAWN !","date":"July 29, 2015 at 6:55 am","url":"https://shroudstory.com/2015/07/29/the-hacking-of-the-carbon-dating-over-and-over-and-over/","cat":"carbon_14_dating","title":"The Hacking of the Carbon Dating Over and Over and Over"}],"events":[{"author":"ekmcmahon","post":"Windsor is right across the river from Detroit Michigan, there are two ways to get there from Detroit.  The Bridge and the Tunnel.  This means that it is not that hard a drive from Michigan or Ohio or even Indiana.","date":"March 16, 2015 at 3:44 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"author":"ekmcmahon","post":"I don’t know Mark but his joke was a laugher.","date":"September 10, 2015 at 7:39 am","url":"https://shroudstory.com/2015/09/10/marytown-illinois-hosting-shroud-of-turin-exhibit-september-12-20/","cat":"exhibition","title":"Marytown in Illinois Hosting Shroud of Turin Exhibit September 12-20"},{"author":"ekmcmahon","post":"I have not seen the Shroud in person but rely on Shroud Story and other sitea on the internet.","date":"June 26, 2015 at 4:34 am","url":"https://shroudstory.com/2015/06/26/more-than-2-million-people-saw-the-shroud-in-2015/","cat":"uncategorized","title":"More Than 2 Million People Saw the Shroud in 2015"},{"author":"ekmcmahon","post":"How long do we wait for the image on the Shroud to be declared a miracle in Christianity ?","date":"June 4, 2014 at 1:20 am","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins"}],"forgery":[{"author":"ekmcmahon","post":"I am a firm believer.  While I think I understand why they are doing it . I am somewhat shocked and dismayed at all the actions and reasons that some folks are going through trying to denigrate God’s gift to us. It was written in pre-Christian era documents what was going to take place, the Lord knew what was ahead of him in his human body when he was praying in the garden and it came to pass.  The Shroud is as a quick but deep reminder that it did in fact take place.","date":"April 14, 2014 at 3:02 pm","url":"https://shroudstory.com/2014/04/14/if-the-shroud-is-a-forgery-where-are-its-precedents-2/","cat":"news_&_views","title":"If the shroud is a forgery, where are its precedents?"}],"history":[{"author":"ekmcmahon","post":"I have no knowledge of cloth/fabric etc. except that I wear them, cotton tee shirt etc.  (I guess I like the abbrev. etc.)  All in all what grabbed my attention are the wrist wounds and then when I was looking at the eyes in the photos trying to see the coins that folks are talking about and all I could see was the possibility of one of the eyes open so that one pupil was visible  and then something seemed to grab me in the inside of my head and I heard the voice of my Guardian Angel tell me that I was seeing the image of the living Jesus Christ.I had heard my Guardian Angel before in my life, 1st time was When as a kid and drowning in a lake and I knew I was in trouble looking up in the water and seeing the surface above me but not able to do anything to pull myself up there.  He told me to say my prayers because I was going to die.  I was confused as I understood the words, didn’t know where they came from but I knew I was in serious trouble and I knew a couple of prayers but not sure which one to say and he started saying the ‘Lord’s Prayer’ or as some call it the ‘Our Father’ so I continued to say it in my mind then I saw something that looked like pinkish or reddish or ?? colored clouds and had what is now called an NDE. The I remember being told that this is all I will remember and I see what looked like a movie of me being mad at a friend and hitting him, then I saw the field next to our home that was in a different state but we were on vacation in Indiana.  Next thing I know is I’m laying on a beach towel on my stomach, my head on my arm and the towel under my head and on my hand is wet with water and snot (mucus), I was alive.  My older brother had swam out and pulled me out of the lake and did CPR on me .  The next time was when I was nearing my tour in the Marines and I was considering re-enlisting as I had been told a couple of times by Sergeants that I would be promoted to Sergeant when I  shipped over (re-enlisted), my Guardian Angel told me on 2 occasions a few days apart not to re-enlist but I just kind of ignored him.  Then one day when my enlistment was due to end, I was reminded by one of the senior Sergeants that I had better get upstairs to the personnel office and tell them I was ready to re-enlist.  The Sergeant walked away and I started to walk to the door out of the office I was in to go upstairs and in a loud voice inside my head I heard “DO NOT RE-ENLIST” I did not re-enlist, I got the message.  This was in mid February 1964. Does Viet-Nam ring a bell.  I learned to pay attention to that seldom heard voice.","date":"September 21, 2015 at 6:53 am","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","title":"Another Overwhelming Evidence Argument?"},{"author":"ekmcmahon","post":"I can hardly wait, I am hoping that we get a reminder about a week or so before the 1st telecast.","date":"February 5, 2015 at 7:24 am","url":"https://shroudstory.com/2014/04/15/cnns-jesus-code-six-objects-connected-to-the-biblical-jesus/","cat":"history","title":"CNN’s Jesus Code:  Six Objects Connected to the Biblical Jesus"},{"author":"ekmcmahon","post":"I found this interesting, it is rather difficult for me to wrap my head around this.  I’ll have to watch this and read the written version.","date":"July 31, 2015 at 6:33 am","url":"https://shroudstory.com/2015/07/31/is-the-shroud-the-inspiration-for-the-holy-grail-legends/","cat":"history","title":"Is the Shroud the Inspiration for the Holy Grail Legends?"},{"author":"ekmcmahon","post":"https://search.yahoo.com/yhs/search;_ylt=ApQciSwmQTx23j9qNi7KFKh.lVM6?p=Roman+torture+scourging+%3F&fr=ush-mailn_02&hspart=att&hsimp=yhs-att_001&type=yahoo_pc_mail","date":"August 9, 2014 at 2:36 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"author":"ekmcmahon","post":"I have to write of my ignorance here.  I have not heard of this before.  Are we to think of this as being like a tee shirt that Jesus would have worn under his robe during the period of the Passion and  all the related torture he went through until the actual Crucifixion ?  I think I know of the Robe he wore as my older brother (God bless his soul) was in a high school play in a public school back late ’40s or early ’50s titled “The Robe”, I recall it had something to do with Jesus Christ is all I know.","date":"November 2, 2015 at 3:55 am","url":"https://shroudstory.com/2015/11/02/the-confusing-holy-tunic-of-argenteuil/","cat":"history","title":"The Confusing Holy Tunic of Argenteuil"},{"author":"ekmcmahon","post":"Who had a nightmare one night and dreamed this story up ?  Is this in celebration of the Trump guy hosting SNL ?  It makes as much sense.","date":"November 8, 2015 at 3:02 am","url":"https://shroudstory.com/2015/11/08/what-am-i-missing/","cat":"history","title":"What am I missing?"}],"image":[{"author":"ekmcmahon","post":"This is fantastic but it is a lot for folks like me to digest at one sitting.","date":"October 2, 2015 at 5:56 am","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"author":"ekmcmahon","post":"I enjoyed the article, it was the 2 clickables and the Q & A that made the article great. I guess I should say that I greatly enjoyed the article.  I have been a believer in the Shroud as being a Gift from God for quite some while now.","date":"September 26, 2015 at 5:48 am","url":"https://shroudstory.com/2015/09/26/the-vp8-cinderella-question/","cat":"3d","title":"The VP8 Cinderella Question"},{"author":"ekmcmahon","post":"For some reason, my system does not like the clickable article as presented in the beginning of the article.  It tells me to reset some of my settings and retry it. ?? I won’t do that.","date":"September 16, 2015 at 5:06 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","title":"Faint Images:  The Case of the Shroud of Arquata"},{"author":"ekmcmahon","post":"Yes I agree, the image is made at the instant that the supernatural soul of Jesus Christ enters into hi physical body and that is what cause the color image that surrounds the body image of Christ,  He then awakens in his newly empowered physical body and resurrects.","date":"November 22, 2014 at 5:41 am","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","title":"Image of the Resurrection?"},{"author":"ekmcmahon","post":"Why do some folks just have to go out of their way in an attempt to destroy the Christian faith ? As I have said before, I am not a scientist but I do know how to read and think.  I am more than happy accepting the proof that has been published that proves that the Shroud is the burial cloth of Jesus Christ and he resurrected on the 3rd day. Also as I have said before while I was reading one of the articles and was studying and comparing the online photos, I was told by my Guardian Angel that I was looking at images of the risen living Jesus Christ. The image was imprinted by the living Devine Soul as it re-entered and re-constituted the body of Jesus the Christ.","date":"June 1, 2015 at 7:18 am","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?"},{"author":"ekmcmahon","post":"In the main of my mind, lf God is a fake then the Shroud is a fake, I’m not an Atheist.","date":"March 29, 2014 at 2:58 pm","url":"https://shroudstory.com/2014/03/29/so-even-without-knowing-how-the-shroud-was-faked-its-obvious-that-someone-did-fake-it/","cat":"image_theory","title":"So, even without knowing how the shroud was faked, it’s obvious that someone did fake it?"},{"author":"ekmcmahon","post":"A scientist nor artist am I. The image I see here does not does not have anything but same shape and resemblance of what I have seen on the internet of The Shroud.","date":"September 24, 2014 at 9:13 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"}],"misc":[{"author":"ekmcmahon","post":"Amen to that.","date":"November 27, 2014 at 2:40 am","url":"https://shroudstory.com/2014/11/27/a-small-catholic-on-relics/","cat":"news_&_views","title":"A small catholic on relics"},{"author":"ekmcmahon","post":"Out of my love and respect for our Lord, I will say nothing about the fraud the article is about.","date":"July 29, 2015 at 7:42 am","url":"https://shroudstory.com/2015/07/29/and-while-we-are-talking-about-australians/","cat":"tinfoil_hats","title":"And While We Are Talking About Australians"},{"author":"ekmcmahon","post":"I believe that I cannot see God the Father but I believe that he is there, I believe that the Shroud of Turin is the Shroud that Jesus Christ was placed in and was covering his body when his Devine Spirit entered his body for the Resurrection as prophesized,","date":"November 24, 2013 at 4:33 pm","url":"https://shroudstory.com/2013/11/24/common-ground-between-believers-and-atheists/","cat":"uncategorized","title":"Common ground between believers and atheists"},{"author":"ekmcmahon","post":"Amen !","date":"March 4, 2014 at 4:35 pm","url":"https://shroudstory.com/2014/03/04/attacking-someones-character-or-personal-traits/","cat":"uncategorized","title":"Attacking someone’s character or personal traits"},{"author":"ekmcmahon","post":"As I see it, we are not sure what we know about the Shroud.  A list has been made before identifying what can be said of the image except for the – how was it made.  I speak of the so-called ‘scorch’ image.  No one can explain it – yet. Was it made by God as he reentered the ‘physical’ body that he inhabited while on the Earth so that he could resurrect ?","date":"September 25, 2015 at 5:12 am","url":"https://shroudstory.com/2015/09/25/everything-we-know-about-the-shroud/","cat":"reader_inquiry","title":"Everything We Know About the Shroud?"},{"author":"ekmcmahon","post":"Nice concrete evidence for explaining how the movement trail of the Shroud can be verified.","date":"July 23, 2015 at 6:13 am","url":"https://shroudstory.com/2015/07/23/interview-with-paul-maloney/","cat":"science","title":"Interview with Paul Maloney"},{"author":"ekmcmahon","post":"I’m just an old guy who has said before and again now that the Shroud is the burial cloth of the Son of God.","date":"April 9, 2014 at 5:07 am","url":"https://shroudstory.com/2014/04/09/i-too-can-be-a-practitioner-of-peudocience/","cat":"news_&_views","title":"I, too, can be a practitioner of p$eudo$cience"},{"author":"ekmcmahon","post":"Thank You.  The FFT process does clear up the image a bit.","date":"October 11, 2015 at 2:59 am","url":"https://shroudstory.com/2015/10/11/removing-weave-pattern-from-images-of-the-shroud-of-turin/","cat":"other_sites","title":"Removing Weave Pattern from Images of the Shroud of Turin"},{"author":"ekmcmahon","post":"I am one of the Catholics who believes that the Shroud is the burial cloth of Jesus Christ.","date":"March 17, 2014 at 2:05 am","url":"https://shroudstory.com/2014/03/17/the-shroud-of-turin-is-number-11-in-cnns-list-of-top-11-mysteries/","cat":"news_&_views","title":"The Shroud of Turin is Number 11 in CNN’s List of Top 11 Mysteries"},{"author":"ekmcmahon","post":"These are beautiful.  Is it any wonder why that Jesus has said that he “loves the little ones:","date":"March 19, 2014 at 2:42 pm","url":"https://shroudstory.com/2014/03/19/the-pictures-are-great/","cat":"news_&_views","title":"The Pictures are Great"},{"author":"ekmcmahon","post":"Not that you need it I agree 100%.","date":"March 20, 2014 at 2:36 pm","url":"https://shroudstory.com/2014/03/17/the-shroud-of-turin-is-number-11-in-cnns-list-of-top-11-mysteries/","cat":"news_&_views","title":"The Shroud of Turin is Number 11 in CNN’s List of Top 11 Mysteries"},{"author":"ekmcmahon","post":"Thank You and Thank You !","date":"October 12, 2015 at 5:27 am","url":"https://shroudstory.com/2015/10/12/update-to-shroud-com-around-november-1/","cat":"other_sites","title":"Update to shroud.com around November 1"},{"author":"ekmcmahon","post":"The WTC collapse of 9/11 is not a mystery, just ask any Muslim about one of their greatest hits against the so-called Infidels.","date":"March 19, 2014 at 2:35 pm","url":"https://shroudstory.com/2014/03/17/the-shroud-of-turin-is-number-11-in-cnns-list-of-top-11-mysteries/","cat":"news_&_views","title":"The Shroud of Turin is Number 11 in CNN’s List of Top 11 Mysteries"},{"author":"ekmcmahon","post":"In my soul, as we try to delve into the Shroud of Christ and Tilma of Mary at what we call Guadalupe, I see the Holy Spirit talking to us. How are we dealing with our part of his conversation?","date":"December 15, 2013 at 4:15 pm","url":"https://shroudstory.com/2013/12/15/what-if-there-is-a-breeze/","cat":"science_and_religion","title":"What if there is a breeze?"},{"author":"ekmcmahon","post":"Why is it that most of these writers feel that they have to shy away from allowing the image to have been produced by the action of a miracle ?  Is it that if they find a very likely cause of the image by some use of the natural world then it can be said that it was not produced by the action of Christ’s resurrection which would have been a miracle – would it not have been ??","date":"July 9, 2015 at 3:45 am","url":"https://shroudstory.com/2015/07/09/who-proposed-ultraviolet/","cat":"news_&_views","title":"Who Proposed Ultraviolet?"},{"author":"ekmcmahon","post":"The ‘A Profile in Courage’ was re-educational.  Thank You.  We still have a way to go in ‘The Rights’.","date":"September 30, 2015 at 6:24 am","url":"https://shroudstory.com/2015/09/30/i-am-the-onliest-one-who-can-go-and-im-scared/","cat":"people","title":"“I am the ‘onliest’ one who can go, and I’m scared.\""}],"opinion":[{"author":"ekmcmahon","post":"What was the purpose of the  Lirey/Turin body-imprinted envelope then ?","date":"July 13, 2015 at 5:05 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","title":"Beg Your Pardon (Comment Promoted)"},{"author":"ekmcmahon","post":"As a believer I think that the topic of the Shroud is serious as it is the Lords gift to us,  A few parts of the article actually made me chuckle.  In my poor worded opinion, haters of Jesus are a weird group of people, there is a day coming that they will learn their of their error.  As a kid, I had an NDE when I almost drowned and as an adult I have researched them, read many experiences of others. All of us will have that true experience in our time. There are many people who doubt NDEs.  Look up NDE research in any search engine. There are even NDEs reported by people of most of the religions documented.","date":"July 11, 2015 at 6:52 am","url":"https://shroudstory.com/2015/07/11/ignorance-with-wings/","cat":"other_blogs","title":"Ignorance with Wings"},{"author":"ekmcmahon","post":"I really enjoyed the article. I am one who likes to stay a top on some of the news especially local and world.  It still scares me at my age of 73 to see the amount of peoples refusal to learn the truth of the world and daily living.","date":"September 25, 2014 at 6:10 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","title":"Mars, Weeping Mary and the Shroud"},{"author":"ekmcmahon","post":"I have enough of a problem dealing with inches and centimeters then we have to add the cubit to my un-math mind to quickly calculate.","date":"July 16, 2015 at 5:07 am","url":"https://shroudstory.com/2015/07/16/maybe-a-not-so-startling-coincidence-of-something-that-is-approximate-and-presumably-averaged/","cat":"other_blogs","title":"Maybe a Not So Startling Coincidence of Something that is Approximate and Presumably Averaged"},{"author":"ekmcmahon","post":"I have read some of the highlighted article above from the Science Buzz blog.  The contents of the blog are reflective of the non-believers who have make comments in the many Shroud blogs.  It is apparent that there is one in the Universe who will do anything to dissuade people from believing that our Lord Jesus Christ was Resurrected from the dead after being physically murdered by non-believers some 2,000 years ago.  The Shroud is a scientifically provable solid piece of evidence of that Resurrection.  It is a gift from our God to us.  It is not just words written down on a parchment and recopied.  It is a part of the original fact.","date":"February 14, 2015 at 7:08 am","url":"https://shroudstory.com/2015/02/14/on-deaf-ears-here/","cat":"other_blogs","title":"On Deaf Ears Here?"},{"author":"ekmcmahon","post":"Jesus Christ is not just in our Christian hearts, but think about the Muslims who have had dreams about Jesus talking to them and then they convert to Christianity, you know the risk they are taking to do that. How about the folks who have been in a hospital, have died in the bed or wherever, seen the nurses and doctors working on them and then during the NDE went through some type of tunnel? and ended up in Heaven and meet Jesus Christ and then being told they had to go back and finish their life here.  Later explaining to those nurses and doctors what they observed and finding out that they had died and were brought back to life during that period of their ‘trip’.  There are actual documented cases in NDERF files and some are most current.  Look them up on the internet and you can make phone calls to verify the info in the data.","date":"July 24, 2015 at 3:49 am","url":"https://shroudstory.com/2015/07/24/so-long-as-there-are-questions/","cat":"other_blogs","title":"So Long As There Are Questions"},{"author":"ekmcmahon","post":"Gee, almost makes you want to think that the Shroud is the real Shroud of Jesus Christ, huh?","date":"October 29, 2015 at 10:34 pm","url":"https://shroudstory.com/2015/10/29/splish-splash/","cat":"comments_promoted","title":"Splish Splash"}],"pollen":[{"author":"ekmcmahon","post":"The Shroud has been carrying it’s own travel diary for all to read.  It shows from day 1 on forward into time.","date":"November 5, 2015 at 4:52 am","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","title":"Paper Chase:  New Paper on SEM Analysis of Pollen"},{"author":"ekmcmahon","post":"As I have said before, I am not a scientist.  But I think that common sense should tell us that the Shroud would have pollen on it from where ever it had been kept, open up, laid down, folded  up etc. for it’s about 2,000 year history,  Some of it may even have dirty smudges from hands, or what ever it was laid down on and/or stored on or in.  The Shroud is the Lords present to us, we must honor it and take care of it.","date":"November 10, 2015 at 5:16 am","url":"https://shroudstory.com/2015/11/10/the-pollen-scam/","cat":"science","title":"The Pollen Scam?"}],"researchers":[{"author":"ekmcmahon","post":"This should be a very interesting program.","date":"April 2, 2015 at 5:05 am","url":"https://shroudstory.com/2015/04/02/barrie-schwortz-to-appear-on-coast-to-coastradio/","cat":"news_&_views","title":"Barrie Schwortz to Appear on Coast to CoastRadio"},{"author":"ekmcmahon","post":"Don’t get me wrong as I am not insinuating anything here.  It is possible to take a photo of an image or anything, “doctor up” the photo then reproduce the “doctored” photo and say it is an original photo.  I have not seen or observed all of Barrie’s works but I highly doubt that he would resort to flim flaming this.  Especially with him being Jewish and this being a Christian Miracle Relic.","date":"April 4, 2014 at 12:02 am","url":"https://shroudstory.com/2014/04/03/barrie-schwortz-so-why-is-a-good-jewish-boy-like-me-doing-this/","cat":"news_&_views","title":"Barrie Schwortz:  So why is a good Jewish boy like me doing this?"},{"author":"ekmcmahon","post":"I read the article and unless I missed it, I don’t really see much to tie it together with Christ’s Shroud.","date":"September 7, 2013 at 7:02 pm","url":"https://shroudstory.com/2013/09/07/rest-in-peace-dr-frederick-zugibe-1928-2013/","cat":"news_&_views","title":"Rest in Peace  Dr. Frederick Zugibe (1928-2013)"},{"author":"ekmcmahon","post":"I am not a scientist, I only know what happened to me when I looked at the photo as I have said before.  That is a miraculous image of the dead Jesus Christ just as his Divine Spirit was entering his earthly body just before his Resurrection.  The debate about how the image was made on the Shroud may go on forever  if man wants to know Gods Divinity and how it works.","date":"September 8, 2013 at 12:53 am","url":"https://shroudstory.com/2013/09/07/rest-in-peace-dr-frederick-zugibe-1928-2013/","cat":"news_&_views","title":"Rest in Peace  Dr. Frederick Zugibe (1928-2013)"},{"author":"ekmcmahon","post":"Best of my recollection, all of the pictures of paintings of Jesus Christ on the Cross have him with the nails in the palms of the hands,  the Shroud has the blood markers where the wrist would be. In my mind, this takes the human artist out of the picture.","date":"March 24, 2014 at 2:15 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"author":"ekmcmahon","post":"I – almost – find it amusing that a helper of Lucifer would be looking for Holy Objects or anything representative of The Father Almighty to give them help in attaining their ill wanted desires.  It is a true “the devil made me do it”.","date":"September 23, 2015 at 5:05 am","url":"https://shroudstory.com/2015/09/23/russ-breault-at-the-university-of-north-carolina-at-charlotte-next-week/","cat":"presentation","title":"Russ Breault at the University of North Carolina at Charlotte Next Week"},{"author":"ekmcmahon","post":"Thank you for this article.  It is, in my mind, very descriptive of what the image on theshroud is, I probably should not repeat what I had had said in a previous comment but I will in as few words as possible.  Sometime back, I’ll say a couple of years I was reading an article on the 3-D Imaging work that was done and as I was looking at the cleared image – after the explanatory marking were removed from the 3-D image, the picture on my computer screen seemed to deeply focus my attention to the face.  It was as if I was mesmerized.  I heard a voice inside my head that I recognised as my Guardian Angel. I had heard that voice a couple of times earlier in my life,  My first recall was when I was about 9 or 10 years old and was in the process of drowning at a small beach at a lake in Indiana.  I recognised the fact that I was in trouble as I did not know how to swim and I was in deep water (10 or so feet deep) and I could not get to the top of the lake and breath or walk out.  The voice told me “You are going to die, say your prayers”.  I was confounded, because as a young Catholic boy I knew a few prayers but did not know which one to say to myself.  The next thing I know is that I am saying the ‘Our Father’ ( also known as the The Lords Prayer”) to myself. I then recall seeing an image of the field that was nest to our home in Michigan where I used to play.  I was then told by the voice “This is all you will remember”. I then consiously recall laying on my stomach on a beach towel and the towel under my face is wet with water and a large glob of snot or mucus from my nose and my older brother is pushing on my back. (performing CPR).  I was alive.  My brother was 10 years older than me and had swam out and pulled me in. I deduced many years later that the image of the field and the worlds of “That is all You will remember” was an NDE that I was to forget except for a little bit of it.The next memorable event of the voice was when my 4 years of active duty in the USMC was coming to a close and I had been reminded by senior Marines that I should re-enlist and when I did I would be promoted to Sgt. E-5.  I was a Cpl. E-4 at the time.  A few minutes after I was told this and I was by myself in my corner of the office, I heard the voice again and it said”Do not re-enlist”. I just ignored it and went about my business.  A couple of days later the same thing happened, a senior Cgr reminded me of what they had said before.  Again I heard the voice repeat the same words “Do not re-enlist” and again I just went about doing my work.   A couple of days later, the Sgt. came to me again an\\d told me to go and get my re-enlistment paperwork started. and he left me.  I was thinking about and the advantages of being a Sgr but I heard the voice for the 3rd Time and it seemed louder and very firm “DO NOT RE-ENLIST”.  I decided that it meant business and I did not re-enlist.  This happened in Feb. 1964 and I pretty sure that you recall the Vietnam War and the roll that the Marine Corps played it.  I was released from active duty on Feb. 18th 1964 and got married a few months later.Back to the Shroud. and the voice, it said to me words to the effect “This is the picture of the living Jesus Christ”.. So I am sure that the Shroud is the actual Burial Cloth of Jesus Christ.","date":"November 27, 2014 at 4:53 am","url":"https://shroudstory.com/2014/11/26/fr-otterbein-discussing-the-sturp-examination/","cat":"science","title":"Fr. Otterbein Discussing the STURP Examination"}],"resources":[{"author":"ekmcmahon","post":"Yes, do read the clickable above in the above article.  It totally grabbed my soul.","date":"July 17, 2015 at 4:15 am","url":"https://shroudstory.com/2015/07/17/a-reflection-on-the-shroud-and-zechariah/","cat":"article","title":"A Reflection on the Shroud and Zechariah"},{"author":"ekmcmahon","post":"Why are some people so anti-fact.  They draw up a conclusion then regardless of the facts that show the error of that conclusion, they Nay Nay Nay the facts.","date":"July 23, 2015 at 3:02 am","url":"https://shroudstory.com/2015/07/23/because-if-it-looks-unbelievable/","cat":"article","title":"Because If It Looks Unbelievable"},{"author":"ekmcmahon","post":"I love the header of the article “Crocumentaries”, it is so fitting.","date":"March 9, 2015 at 4:25 am","url":"https://shroudstory.com/2015/03/09/crocumentaries/","cat":"article","title":"Crocumentaries"},{"author":"ekmcmahon","post":"I believe that the Divine Almighty Soul of Jesus The Christ survived the Crucifixion but not his human body. On the 3rd day his physical body was transformed as his Almighty Soul re-entered the body.","date":"May 28, 2015 at 5:01 am","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"author":"ekmcmahon","post":"I did a copy for the following:Since death does not follow immediately on crucifixion, survival after a short period of crucifixion is possible, as in the case of those who choose each year as a devotional practice to be non-lethally crucified.There is an ancient record of one person who survived a crucifixion that was intended to be lethal, but that was interrupted. Josephus recounts: “I saw many captives crucified, and remembered three of them as my former acquaintance. I was very sorry at this in my mind, and went with tears in my eyes to Titus, and told him of them; so he immediately commanded them to be taken down, and to have the greatest care taken of them, in order to their recovery; yet two of them died under the physician’s hands, while the third recovered.”[54] Josephus gives no details of the method or duration of the crucifixion of his three friends before their reprieve.These men were not speared in their side yet nor were their legs broken.  Another thought is were the nailed onto their cross or just tied.  Were they beaten as bad as Jesus was as per the Shroud indicates ?","date":"May 29, 2015 at 5:22 am","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"author":"ekmcmahon","post":"Pilate was surprised that Jesus survived being stabbed in the side of his chest by a Roman soldier with his spear ??","date":"June 7, 2015 at 5:10 pm","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"author":"ekmcmahon","post":"It is my belief that the image on the Shroud was “imaged” at the split second that the Devine Soul of Jesus’ Christ  re-entered his body for his Resurrection.","date":"April 5, 2015 at 3:40 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","title":"Easter Ink"},{"author":"ekmcmahon","post":"I should make clear about what image I am speaking about, it is the one that some people say was made by some chemical or ‘scorching ‘ element.","date":"April 5, 2015 at 3:50 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","title":"Easter Ink"},{"author":"ekmcmahon","post":"It would appear that the Shroud has the DNA on it of most every person who has handled it since it’s beginning.  The exact large number of people is of course unknown.","date":"October 31, 2015 at 5:26 am","url":"https://shroudstory.com/2015/10/31/forbes-editors-need-to-polish-up-their-headline-writing/","cat":"article","title":"Forbes Editors Need to Polish Up Their Headline Writing"},{"author":"ekmcmahon","post":"You really had me guessing until I read your last line, that explained it.At 74 years, I understand your cartoon. LOL","date":"September 1, 2015 at 4:45 am","url":"https://shroudstory.com/2015/09/01/hey-guardian-thats-my-job/","cat":"article","title":"Hey, Guardian. That’s My Job"},{"author":"ekmcmahon","post":"A good quick explanation of the what the Shroud of Turin is telling us.","date":"March 9, 2015 at 5:12 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"author":"ekmcmahon","post":"Yes, many people will disagree with my view but I firmly believe that the Shroud of Turin was a gift from the Lord to the people of the world.  He came into the world for the people and he instructed his  apostles to insure that his teachings be given to all of the people so that all be given the word of the Father.","date":"September 28, 2015 at 5:46 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","title":"The Shroud of Canterbury"},{"author":"ekmcmahon","post":"Amen.  I am a believer.","date":"October 31, 2015 at 5:09 am","url":"https://shroudstory.com/2015/10/31/proof-of-the-resurrection/","cat":"books","title":"Proof of the Resurrection?"},{"author":"ekmcmahon","post":"Thank you very much for sharing the Barrie Schwortz You Tube Link with us.","date":"April 6, 2015 at 6:10 am","url":"https://shroudstory.com/2015/04/06/audio-of-barrie-schwortz-on-coast-to-coast/","cat":"radio_and_podcasts","title":"Audio of Barrie Schwortz on Coast to Coast"},{"author":"ekmcmahon","post":"Thank you Mr. Schwortz, I too was disappointed with what I considered to be a poor program.  It seemed that they left out many of the important discoveries.","date":"March 6, 2015 at 3:31 am","url":"https://shroudstory.com/2015/03/06/barrie-schwortz-on-the-cnn-shroud-of-turin-program/","cat":"television","title":"Barrie Schwortz on the CNN Shroud of Turin Program"},{"author":"ekmcmahon","post":"The video is a clack marked “this video is private”  cannot watch video.","date":"February 13, 2014 at 2:24 pm","url":"https://shroudstory.com/2014/02/13/does-it-really-matter-what-journalists-write-about-the-shroud/","cat":"video","title":"Does it really matter what journalists write about the shroud?"},{"author":"ekmcmahon","post":"The short previews seem very promising.","date":"March 6, 2015 at 4:59 am","url":"https://shroudstory.com/2015/03/06/if-cnn-wasnt-enough-get-ready-for-nbc-on-easter-sunday/","cat":"television","title":"If CNN Wasn’t Enough, Get Ready for NBC on Easter Sunday"},{"author":"ekmcmahon","post":"I tried but I guess that I’m impatient and could not handle 3 minutes of this drivel.","date":"October 16, 2013 at 2:25 pm","url":"https://shroudstory.com/2013/10/16/plan-to-be-bored-but-dont-worry-only-the-first-six-minutes-of-this-lecture-is-about-the-shroud/","cat":"video","title":"Plan to be bored: But don’t worry. Only the first six minutes of this lecture are about the Shroud."},{"author":"ekmcmahon","post":"I recorded and watched the program.  I enjoyed it,  though because I have been following the Shroud research close for the last few years I did not see anything new.  I am one of those that is referred to as a believer.  I believe that the Shroud of Turin is the burial cloth of Jesus Christ from which he resurrected through.  Another way of thinking is that one moment, his dead physical human body was laying within the Shroud (laying on the bottom half with the top half placed and wrapped over the body and when his Divine soul re-entered his body, the body dissolved and was reconstituted outside of the wrapping.  His Divine body and soul  were free of the Shroud and was free to move about in the physical world as we know it.  His new God given combined Body and Soul were able to appear and disappear at his will. This was the remainder of his earthly life until his Ascension 40 days later.","date":"June 21, 2015 at 5:35 am","url":"https://shroudstory.com/2015/06/21/promotion-for-the-holy-winding-sheet-exploring-the-shroud-of-turin/","cat":"television","title":"Promotion for The Holy Winding Sheet: Exploring the Shroud of Turin"},{"author":"ekmcmahon","post":"Thank You !","date":"October 18, 2015 at 4:55 am","url":"https://shroudstory.com/2015/10/18/raymond-arroyos-special-report-from-april/","cat":"video","title":"Raymond Arroyo’s Special Report from April"},{"author":"ekmcmahon","post":"Hi, I use AT&T and am in the PST and I cannot see that program listed during any time frame ??","date":"June 19, 2015 at 3:14 am","url":"https://shroudstory.com/2015/06/19/set-your-dvrs/","cat":"television","title":"Set Your DVRs"},{"author":"ekmcmahon","post":"I am looking forward to this program.","date":"December 16, 2013 at 2:51 pm","url":"https://shroudstory.com/2013/12/16/the-mysteries-of-the-holy-sepulcher-documentary/","cat":"video","title":"The Mysteries of the Holy Sepulcher Documentary"}],"sudarium":[{"author":"ekmcmahon","post":"I’m sorry/not sorry but when I was first convinced of the reality of the Shroud I did not see coins covering the eyes.  All I can do now is when I kind of stare at the Shroud of Turin picture , I ask myself “are there coins there ?”, to me it is just not a coins over eyes image. I’m not saying they are not there, I just don’t see them.","date":"February 12, 2015 at 4:26 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"}],"textile":[{"author":"ekmcmahon","post":"There are several articles available, here is but one:https://shroudstory.com/2011/01/23/shroud-of-turin-repairs-and-carbon-dating-more-good-stuff/http://www.cirac.org/shroud/Discussion/MGS-CESS-36-42.htm","date":"October 28, 2015 at 3:08 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"}]}
