{"art":[{"author":"ellen","post":"I just finished reading “Heaven is for Real” which I received as a gift.  My Dad became ill two weeks ago and died last week.  I read parts of the book to him, as well as scripture, too.  It helped me.  When I read Colton’s account of Jesus’ “rainbow horse” I remembered in Revelation that Jesus will ride a white horse.  If you take the colors of the rainbow on a wheel and turn it quickly, it becomes white!  Maybe the white horse which John (author of Revelation and Jesus’ beloved disciple) saw appears in heaven as a rainbow horse! Just a thought.\n\n","date":"May 14, 2011 at 7:51 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}],"misc":[{"author":"ellen","post":"PLEASE. PLEASE. PLEASE. I hope the pope changes his mind and does not visit the shroud given the current scandal. It will only become a media circus and a hurtful distraction.\n\n","date":"April 9, 2010 at 4:09 pm","url":"https://shroudstory.com/2010/04/09/no-joke-an-iphone-shroud-of-turin-application-at-apples-online-store/","cat":"2010","title":"No Joke: An iPhone Shroud of Turin Application at Apple’s Online Store"},{"author":"ellen","post":"PLEASE. PLEASE. PLEASE. I hope the pope changes his mind and does not visit the shroud given the current scandal. It will only become a media circus and a hurtful distraction.\n\n","date":"April 9, 2010 at 3:07 pm","url":"https://shroudstory.com/2010/04/09/the-not-so-rational-rationalists/","cat":"2010","title":"The not so rational rationalists"},{"author":"ellen","post":"I certainly don’t want Pope Benedict visiting the Shroud in Turin. I want my children to believe in the Shroud. I am ashamed of my church right now.\n\n","date":"April 5, 2010 at 10:51 am","url":"https://shroudstory.com/2010/04/03/what-is-bigger-the-shroud-showing-in-turin-or-the-history-channel-in-the-us/","cat":"2010","title":"What is bigger: The Shroud showing in Turin or the History Channel in the US?"}]}
