{"art":[{"id":"comment-3188","author":"emunahomanut","post":"Thank you for your time and interest. The article (originally written for the university of Oxford’s M Phil course in Late Antique and Byzantine Studies) is also available @: http://emunah omanut.blogspot.com/.","date":"2011-05-25","mins":"8:55 am","url":"https://shroudstory.com/2011/05/25/bedazzlements-and-whodunits-posed-to-us-by-the-shroud-of-turin/","cat":"art","title":"Bedazzlements and Whodunits Posed to Us by the Shroud of Turin"}],"researchers":[{"id":"comment-9662","author":"emunahomanut","post":"Cyril Mango, a giant among Byzantine historians and one of University of Oxford’s greatest living assets, has turned down many a doctoral research proposal with a single line of explanation: ‘I am sorry, but there is no evidence for that.’ I have always had mixed feelings about that line, often thinking to myself: ‘If history couldn’t deal with anything that wasn’t, at the present moment, corroborated by hard and bountiful evidence, it would be a pretty bleak affair.’ But when I see what de Wesselow has wasted eight years of his life on, I see that I was wrong. I just feel so sorry that there was no Cyril Mango in his life to remind him what differentiates true historical research from unbridled, unruly, and unscientific speculation. All other points aside (and pretending for a while to accept the possibility that pious Jews went to most horrifying deaths because of an image of a dead man), if Jesus’ body just stayed inside the Shroud, how on earth are we to explain that those bloodstains do not show any smears or crusts breaking? How did the disciples get the body out, or the Shroud off, without smearing a single bloodstain? This book will not attract much interest on the account of its combating fallacious carbon dating. That is nothing but a piece of old news on an experiment that was never anything but a waste of time and money. But it WILL attract interest because it dissuades people from believing in the bodily Resurrection of Our Lord. THAT will sell, because that’s what people seem to want today. And when does this book hit the stores? In Lent. On the Feast of the Annunciation. I will fervently pray that not a single believing soul is taken in by this piece of disorderly speculation. I will pray that guardian angels take a cue from Cyril Mango this Lent, and, advocating scientific argumentation, whisper into the ears of the faithful: ‘There is no evidence for this nonsense.’.","date":"2012-03-26","mins":"2:54 pm","url":"https://shroudstory.com/2012/03/26/get-thee-upset-or-not-thomas-de-wesselows-new-book-on-the-shroud/","cat":"art","title":"Get Thee Upset! Or Not: Thomas de Wesselow’s New Book on the Shroud"}]}
