{"archaeology":[{"author":"eric","post":"I agree. Even if there is an “established” image, regional influence is often seen. Take for  example the Guadalupe and the several depictions that color her skin darker than the stereotypical depictions of Mary.","date":"October 7, 2014 at 5:36 pm","url":"https://shroudstory.com/2014/10/07/an-early-beardless-jesus-with-short-hair/","cat":"archaeology","title":"An Early Beardless Jesus with Short Hair"}],"art":[{"author":"eric","post":"This is actually not new, Parnia had hinted that they had one case where they used external stimuli to gauge if the “experience” took place when the brain was “off” instead of “rebooting” (or going “shutting down”) and determined that it actually happened during the “off” phase. That was back in December:http://m.youtube.com/watch?feature=player_embedded&v=zPCvuva2deUI have a few issues with the AWARE methods… First of all, if there are real OBEs, simply placing something above and out of view does not mean that the patient would see it. Heck, if I suddenly found myself outside of my body, I would place all of my focus on one thing: my lifeless body and the doctors working on it. AFAIK, most of the patients reporting OBEs report seeing themselves. So, if I was handling the study I would certainly focus on placing something near the patient’s body during the cardiac arrest. If doesn’t need to be something instrusive, but the focus should be the patient instead of the ceiling.","date":"October 8, 2014 at 11:47 am","url":"https://shroudstory.com/2014/04/21/heaven-is-for-real-the-akiane-prince-of-peace-the-isa-mosaic-and-the-shroud-of-turin/","cat":"akiane_kramarik","title":"Heaven is for Real, the Akiane Prince of Peace, the ISA Mosaic and the Shroud of Turin"},{"author":"eric","post":"Not only that, but the paper makes it clear that the methodology was flawed. The “shelves” with the objects were not placed in each of the rooms, which means that only 22% of the surviving patients were attended in a room that had one. Only two reported an OBE and neither was attended in one of the rooms with one of these shelves installed. Even if these OBEs were real, there was no way that the patient could report seeing the objects.So, we are basically left with one intriguing case where a 57 y.o. patient reported verifiable events while he was proven unconscious via stimuli and several anecdotal cases. That one case is interesting and promising, but hardly the “boom” that a “proven” OBE could have been and all of it is thanks to flawed design. If they are going to continue (which seems likely, they just go another grant from Templeton) they should shrink the sample size to include only the patients attended in the retrofitted rooms or as I said above, reconsider the placement of the “signs”.","date":"October 8, 2014 at 1:34 pm","url":"https://shroudstory.com/2014/04/21/heaven-is-for-real-the-akiane-prince-of-peace-the-isa-mosaic-and-the-shroud-of-turin/","cat":"akiane_kramarik","title":"Heaven is for Real, the Akiane Prince of Peace, the ISA Mosaic and the Shroud of Turin"},{"author":"eric","post":"The entire lower body does not interfere, I could think of a few methods to place something “unusual” there. The most simplistic would involve a psychedelic-colored sheet which would be placed on the legs of the patient by one of the nurses and quickly removed once a pulse is found.Alternatively, something could be worn by a member of the staff. Would wearing a clown wig while trying to revive someone be considered inappropriate?","date":"October 8, 2014 at 2:56 pm","url":"https://shroudstory.com/2014/04/21/heaven-is-for-real-the-akiane-prince-of-peace-the-isa-mosaic-and-the-shroud-of-turin/","cat":"akiane_kramarik","title":"Heaven is for Real, the Akiane Prince of Peace, the ISA Mosaic and the Shroud of Turin"},{"author":"eric","post":"I have never seen Christ holding an orb in any rendition of him. Interesting… Maybe this isn’t Christ at all. Maybe it is someone Leonardo met that he feels looked like Christ? I am not really sure since I don’t follow his work that closely.– Eric","date":"November 10, 2011 at 3:21 pm","url":"https://shroudstory.com/2011/11/10/quote-for-today-did-leonardo-paint-this/","cat":"art","title":"Quote for Today: Did Leonardo Paint This"}],"dating":[{"author":"eric","post":"Coyne is, at the very least, exploiting your ideas to push his agenda. Misquoted or not, they are the core of this article. Omitting the “ceremonial” aspect is his way of keeping it sensacionalistic and delectable to those that follow his blog. With that said, I am not blaming you for all of Coyne’s ramblings.","date":"December 4, 2014 at 2:32 pm","url":"https://shroudstory.com/2014/12/03/jerry-coyne-pope-francis-endorses-the-fake-shroud-of-turin/","cat":"carbon_14_dating","title":"Jerry Coyne:  Pope Francis endorses the fake Shroud of Turin"},{"author":"eric","post":"The problem with Coyne is that he makes atheism look bad. This is not the first time that he has grasped at straws without really digging into the sudject just for the sake of antagonizing the religious crowds. I for one am surprised that he cites the 2009 copy at all, since we know that one failed to live up to the expectations, it only *looked* the same. Now he sticks to Charles’ hypothesis without even bothering to search for the concerns expressed by his fellow skeptics.Simply put, Coyne is not a scientist. He is only peddling his own beliefs. And the irony is that he is doing exactly the same thing that is ever so often critisized of the shroudies, indulging in fields that are far from his expertise.","date":"December 3, 2014 at 2:05 pm","url":"https://shroudstory.com/2014/12/03/jerry-coyne-pope-francis-endorses-the-fake-shroud-of-turin/","cat":"carbon_14_dating","title":"Jerry Coyne:  Pope Francis endorses the fake Shroud of Turin"},{"author":"eric","post":"* criticized","date":"December 3, 2014 at 2:09 pm","url":"https://shroudstory.com/2014/12/03/jerry-coyne-pope-francis-endorses-the-fake-shroud-of-turin/","cat":"carbon_14_dating","title":"Jerry Coyne:  Pope Francis endorses the fake Shroud of Turin"}],"dna":[{"author":"eric","post":"Are there any links to Orit Shamir’s presentation?I believe that it deserves a separate post, where it can be debated on its own merits.","date":"September 20, 2014 at 2:14 pm","url":"https://shroudstory.com/2014/09/20/paper-chase-uncovering-the-sources-of-dna-on-the-shroud/","cat":"paper_chase","title":"Paper Chase:  Uncovering the Sources of DNA on the Shroud"}],"events":[{"author":"eric","post":"Not really interested in defending Orch-OR… But Tegmark’s approach was mediocre at best. You don’t try to refute a model by creating your own counter model and then dismantling it; which is exactly what he did. Not only that, but his 10-13 calculation was incompatible with the activity that we *do* know exists and which can be measured with an electroencephalogram.While Orch-OR still has a long way to go, the truth is that the two most parroted arguments against it (impossibility of quantum function in warm temperature and decoherence) have been challenged by people independent of Penrose/Hammeroff. The first by the emerging field of quantum biology, which was non-existent ten years ago, and the second by Bandyopadhyay’s team. There are other objections that have been ignored because explaining them is harder that hand waving and saying “the brain is too warm”, but they seem to hold more water than these two.Of course, I can’t blame Tegmark. He did try to make an attempt (nevermind how feeble) to challenge an elite name and in the process carve one for himself. On the other hand, despite all his mingling with Chopra, Hammeroff did propose the fMRI treatment for Alzheimer’s that Queensland just got into the media a couple of years ago. So he may be more that just “eccentric” after all.","date":"March 19, 2015 at 3:31 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"author":"eric","post":"I know that it is not meant to be a concise summary of what will be discussed there, but this abstract seems like a blantant oversimplication of the topic as a whole and is incredibly pretentious in its claims (i.e. “The country is wrong and refuses to accept the evidence!”, “We *know* what it cannot be…”) in a manner that completely minimizes the work of serious scientists that have rebutted these arguments.","date":"October 29, 2014 at 8:16 am","url":"https://shroudstory.com/2014/10/29/marco-bella-shroud-of-turinbetween-history-and-pseudoscience/","cat":"event","title":"Marco Bella: Shroud of Turin–Between History and Pseudoscience"},{"author":"eric","post":"I believe that the omission of anything besides the author’s own POV may very well have been a PR move. By displaying a slant towards the skeptic side, I assume that he expects to attract a heavily skeptic crowd. The title also suggests that this was the original intention. Since it was taken from his blog, I can only assume that this is not the “official” document and he is just rallying his troops. Although, since the seminary is free, I have no idea why he would try to apeal to a certain public.The alternative could be a lack of understanding of the topic. I would not speculate on the validity of Bella’s credentials within his own field. But his disregard for one half of this argument was premature and, in my opinion, may very well reflect that he has not reviewed the papers published by people on both sides… Had he done so, then he should not have brushed aside the issues like that.Regardless of the answer, I still believe that the manner in which it was presented was completely inadequate. Unfortunately, the unwillingness to proceed with new testing -even of the non invasive kind- keeps the C14 tests as the most “up to date” large scale study and somebody that is not informed, could very easily believe that they are unchallenged… And that could be easily exploited, just as seen here.","date":"October 29, 2014 at 3:36 pm","url":"https://shroudstory.com/2014/10/29/marco-bella-shroud-of-turinbetween-history-and-pseudoscience/","cat":"event","title":"Marco Bella: Shroud of Turin–Between History and Pseudoscience"},{"author":"eric","post":"Not quite, since there are claims that there should be a crescendo of C14 dates as you get closer to the core of the image, the best way to properly test the hypothesis is by testing several samples at different areas, including the image itself. Simply testing for past irradiation is half-assed. Since we are already way into speculative territory here, who is to say that the shroud could not have been irradiatiated in a separate event? What if the C14 remains the same in the image as in the other areas tested?I guess that it’s better safe than sorry, but at least I would prefer to have some proof of the concept *before* trying to figure out to even test it.","date":"October 13, 2014 at 6:57 pm","url":"https://shroudstory.com/2014/10/11/chart-of-conference-well-so-far-anyways/","cat":"st_louis_2014","title":"Chart of Conference. Well, So Far, Anyways"},{"author":"eric","post":"The hypothesis is that the irradiation of the shroud is responsible for the C14 date, past papers and the most recent abstract leave that clear. And my point remains that simply establishing that it was irradiated will not prove that the dates will fluctuate wildly as claimed, the only way to prove that conclusively is by actually testing the C14 of different areas.","date":"October 13, 2014 at 7:49 pm","url":"https://shroudstory.com/2014/10/11/chart-of-conference-well-so-far-anyways/","cat":"st_louis_2014","title":"Chart of Conference. Well, So Far, Anyways"},{"author":"eric","post":"There is nothing “wrong” with pursuing this line of investigation. It is the confirmation bias that bugs me. Let’s say that some past irradiation is found… That by itself will *not* prove the supposed effect on the C14 dates. However, due to that confirmation bias the hypothesis will be wrongly promoted as “confirmed” in all of its components, not only the irradiation of the shroud. The media will begin a crapfest of speculation (likely published on Easter, to boost) that all future research will be forced to deal with. Any scientist that is skeptic of the shroud’s authenticity will be regarded as working against the “established wisdom” based on incomplete research. That would remain the status quo until new C14 testing is allowed. No… I’d rather have it the other way around. Since the confirmation of the hypothesis depends entirely on the presence of a wild variation of C14 dates, why not start there? Why not avoid the complementary irradiation investigations (and all of its possible consequences) until we have some basic support for the hypothesis?","date":"October 15, 2014 at 4:35 pm","url":"https://shroudstory.com/2014/10/11/chart-of-conference-well-so-far-anyways/","cat":"st_louis_2014","title":"Chart of Conference. Well, So Far, Anyways"},{"author":"eric","post":"Before even trying to mimic the process, there is a huge obstacle to overcome and that is taking samples from the image area and ‘confirming’ that it dates “into the future”. It is entirely redundant to even try to replicate something like that unless the proof demands it. I would be amazed if the image dates “into the future” in the first place.","date":"October 13, 2014 at 5:34 pm","url":"https://shroudstory.com/2014/10/11/chart-of-conference-well-so-far-anyways/","cat":"st_louis_2014","title":"Chart of Conference. Well, So Far, Anyways"},{"author":"eric","post":"* trying to figure out how to even test it (the hypothesis).","date":"October 13, 2014 at 6:59 pm","url":"https://shroudstory.com/2014/10/11/chart-of-conference-well-so-far-anyways/","cat":"st_louis_2014","title":"Chart of Conference. Well, So Far, Anyways"},{"author":"eric","post":"No offense meant to Bob, but 7710 ±16 A.D. needs one hell of a leap of faith.","date":"October 13, 2014 at 5:53 pm","url":"https://shroudstory.com/2014/10/11/chart-of-conference-well-so-far-anyways/","cat":"st_louis_2014","title":"Chart of Conference. Well, So Far, Anyways"},{"author":"eric","post":"Max, I think that you need to work on your English comprehension. I state numerous times that the flash blindness scenario is speculation, a tought exercise. I do not believe in it, and I most certainly do not want anybody to believe it either, that is not the idea. The point of the exercise was to help illustrate just how far someone could take a single reference, mix it up with supporting sources, create a fringe hypothesis and debate it coherently. The fact that you keep gravitating towards it and trying to put me on the defensive actually proves that you are aware that the only thing supporting the “instant baldness” is your association of an image (the way gardeners looked) with an account that does not go into further detail in order to explain why that happened.The irony of the issue is that you claim that I take the bible “to literally”, yet you have created a medically unsound hypothesis based on an event depicted only by John. You know that gospel has several contrasts with the synoptic gospels; some even suggest that John 21 implies that it was written from a second hand account. So, maybe you are placing all of your eggs in a single basket. I would not let my interpretation of the other -congruent- gospels waver due to it and would most certainly not risk my reputation like you are.BTW, I am not arguing about the way that Temple gardeners dressed… I am arguing that you believe that for someone to mistake somebody else that person must look *exactly* the same way.And finally, I think that if you wanted somebody to take this idea seriously, you should have contacted somebody qualified to provide an expert’s assessment. Your hypothesis fails on medical grounds and hence, it is not a “serious argument”. I know that you know this, but you clearly dislike criticsm of your ideas. Maybe that is why you have so many “unpublished” papers? You don’t like peer reviews? Only you can answer that. The fact of the matter is that your hypothesis is unsustained, pure speculation that directly contradicts medical literature and until you can prove otherwise, I am no longer interested in more mumbo jumbo about a mysterious new form of alopecia.This will be my last post discussing the matter until you can cite me (any!) medical literature supporting your hypothesis. Only then we can get “serious” about this topic.","date":"October 28, 2014 at 12:04 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"author":"eric","post":"* rhetoric","date":"October 25, 2014 at 2:50 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"author":"eric","post":"I’m starting to think that he has been seeing this lately:I fail to see why there would be a sudden onset of alopecia due to the violent death. Telogen effluvium, which is the alopecia mostly related to extreme stress and strain takes time to become apparent and alopecia areata, which may have a link to stress, is limited to patches. Is he implying that there was radiation involved in the Resurrection? Even if we assume that there was, I doubt that Jesus was suffering from radiation poisoning for obvious reasons. Lastly, due to cultural and religious reasons I doubt that he would have shaved.","date":"October 17, 2014 at 4:57 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"author":"eric","post":"I also rule alopecia totalis, which some medical literature classifies as an extreme form of alopecia areata, because I doubt that such an extreme change would not be noted by the witnesses. Besides the fact that it would contradict the depictions cited by Max.","date":"October 17, 2014 at 5:03 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"author":"eric","post":"I know my literature and I know the pathology of these conditions. Thus, I discussed the two plausible (or at least more common) causes of alopecia in a healthy individual that has undergone an extreme amount of stress. Take note that I had already stated that alopecia areata is limited to patches; a very notable variation is alopecia barbae, which would be close to what you describe as a diffuse localized hairloss. But, alas, I have yet to see a case where the entire beard just suddenly falls off and the patches seen in these conditions would not leave someone completely unrecognizable.IMO, postpartum alopecia is a bad analogy for your point. It is usually notable between the 2-4 month mark and thus shares the same problem that I mentioned with “regular” telogen effluvium: It seems “sudden”, but it is actually a process that only becomes notable some time after it’s genesis.Neither of these are apparent within hours, such as would have been the case in the example of Jesus/MM. Most of the those cases are related to severe illnesses that carry other visible symptoms, all of which would have been noted by the disciples. And, of course, there is also radiation poisoning, which would carry a nasty arrangement of symptoms.Also, for the record, I have never attended someone that died a violent death and then came back days later and doubt that any MD has. But can offer an informed opinion.","date":"October 17, 2014 at 6:02 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"author":"eric","post":"And again, I believe that we should rule out alopecia totalis or alopecia universalis due to the fact that the change would be extreme. We are talking about no hair anywhere, no eyelashes or eyebrows… Nothing. Such a change would have been discussed as it would have make Jesus look very sick and vulnerable as opposed to Glorified.","date":"October 17, 2014 at 6:09 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"author":"eric","post":"Max, effluvium brought by trauma is not really different in terms of systematic hair loss to any other. For example,  interruption of the hair cycle following a very serious, life threatening septic shock will not be apparent immediately. It may seem that way to the patient because when the hair starts falling, it comes out in clumps and -naturally- s/he will perceive it as a sudden onset, when it is not. Severe trauma also carries other complications, including endocrine ones, that contribute to hair loss, but alas, in a systemic way.Even in cases where the hair loss is actually immediate, think chemotherapy for example, it takes around a week to start falling out and although quicker than in these other kinds of hair loss, it is still falls out systematically.What I’m trying to say is that unless he was suffering an extreme case of radiation poisoning (I have read of cases where such symptoms were readily visible within hours) or a very serious disease that was already affecting him for some time, it is unlikely that he would have experienced extreme hairloss in a couple of days -especially localized hair loss- and that diffuse hair loss is not enough to make somebody a “complete stranger”.","date":"October 17, 2014 at 7:41 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"author":"eric","post":"“Severe trauma” = cardiac arrest, systemic shock, strokes, etc.","date":"October 17, 2014 at 7:46 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"author":"eric","post":"Hmmm…While I remain unconvinced that the loss would have been that rapid, I guess that there is also a possibility that the tug, pulling and friction of removing the blood from the hair could have resulted in several areas losing some hair… Just not enough to make him unrecognizable. I actually agree with the possibility that he was wearing that piece when meeting MM. Nudity would have been most distracting when trying to convey a message to an already shocked witness.Just like you and everybody else, the only thing that I can do to explain the gospel is to speculate. Let’s try out my creativity then… Depending on the translation, Matthew 28:3 states that either the “appearance” or more specifically the face of an angel was like “lighting”. Daniel 10:6 supports this. All of this suggests that they were extraordinarily luminous, blindingly so. There is not way to misidentify and angel with something earthly, thus why she easily recognized the angel. So then.. Why didn’t she know her own teacher? My guess would be that her eyes were still adjusting to the shade following the encounter with the angel. And when Jesus appeared she was still unable to clearly discern his features, which combined with the clothing, could explain the confusion. After all, the duration of flash blindness has been associated with the intensity of the light source.Other options may be that he was standing in an angle where his face may have been obscured or was maybe wearing something that cloaked his face (if he was found alive, I guess that he may have been considered a fugitive; although I am not personally by this one) or that MM, completely shocked by the absence of a body  dismissed the angel as a grief induced hallucination and tried to rationalize his presence by identifying him as someone that she would expect: a gardener.","date":"October 18, 2014 at 7:27 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"author":"eric","post":"* There is no way to misidentify an angel with something earthly","date":"October 18, 2014 at 7:39 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"author":"eric","post":"On Matthew 28:3, actually (more on that later). And I was quite clear that it was speculation, which I decided to elaborate on your request while we were discussing what I can actually debate, the pathology of trauma related hairloss and the speed of its onset. But since you insist…MPH: “Eric, relying mostly and too much methinks on Daniel’s (Daniel 10:5-6) vivid description of an angel: “I looked up and there before me was A MAN DRESSED IN LINEN (my upper cases), with a belt of fine gold from Uphaz around his waist. His body was like topaz, his face like lightning, his eyes like flaming torches, his arms and legs like the gleam of burnished bronze, and his voice like the sound of a multitude””A: I’m not exactly sure why you are emphasizing the clothing, when the obvious characteristics that would support a luminous being are his description of the face and eyes, which are associated with lightning and fire. Daniel provides a fancy, yet detailed description of an angel, and implies that it was luminous. Matthew 28:3 provides a very similar description of the very being that appeared to the guards and women: “His appearance (face in some translations) was like lightning, and his clothes were white as snow.” Implying that both were allegorizing the “lightning” part is a worst defiance to logic than taking it to literally mean that angels emit an intense luminosity akin to lightning.MPH: “(…) you wrote (re the angels at and in Yeshu’a’s tomb: “They were extraordinarily luminous, blindingly so” and Mary was so much bedazzled she just could not even recognize her own master AND YET mistook him for the gardener implying she could not mistook him for any of Yeshua’s disciples who might have come over as well to the tomb (besides John and Peter). You explanation neither fits logic and John’s gospel narrative.”A: I did not say “bedazzled”, which implies disorientation and impairment of several senses. No, I said that she would have been experiencing “flash blindness” of the kind that people adjusting to a sudden change in lighting experience. The effect can last several days, and no, in most cases it does not mean that the person is entirely blind but rather just visually impaired. Why not mistake him for an apostle? The clothing. I already noted my agreement on this point.MPH: “When Mary Magdalene saw Yeshu’a on that early morning, most likely she was sitting on her knees still weeping at the low cave-tomb opening and looking in. She turned her head as Yeshu’a’s body draped in a sindon was silhouetted against the rising sun between two columns with two more pillars projecting from either side of the monumental/main entrance. She could have mistaken him for a divine messenger too according to ‘your speculation’, which is definitely not the case: she mistook him for a gardener implying ‘the man she saw’ looked an everyday man weaing a red earth stained sindon draped as workwear and his face was hairless (if not to say bald or nearly bald).”A: Again, I agree on the clothing. Not the baldness. My speculation does not say or imply that she would mistake somebody wearing that, with the divine messenger that the women had seen and who is described as wearing clothing that was “white as snow” (Matt. 28:3).MPH: “Besides the word for angels can refer here either to divine messengers or mere human messengers (e.g. Yeshu’a’s secret disciples from Essenean background) or else divine messengers resembling human form.”A: Are you completely ignoring Matthew 28:3? Just like Daniel’s, this angel had an appearance (or face, depending on the translation) “like lightning”. Clearly not adopting an human facade. Furthermore, he made his supernatural nature very obvious when he appeared following a quake, moved the heavy stone by himself and sat on it. No one present would mistake it for a human, ever.MPH: “Indeed if in in Heb. 1:14, we are told angels are not composed of physical matter but are spirit beings created by G-od; the true fact remains angels can resemble human form when G-od permits or wills it (see Gen. 19) and when they appear in a human form in the Bible, they are always a man even if angels are neither male of female and they appear as such NOT TO FRIGHTEN real human beings, which is in drastic contrast with ‘your speculation’. Reminder the angel’s word in the tomb: “Don’t be afraid!”.”A: Max, you are contradicting both the physical description given in Matthew 28:3 and the fact that Matthew 28:4 states that the guards were horribly scared: “The guards were so afraid of him that they shook and became like dead men.” Clearly the reason why he had to say “Do not be afraid” to the women was due to his supernatural appearance and actions, both of which would have been fiercely intimidating.“Thus what do you make of the fact Second Temple period gardeners’ face was hairless? NOTHING!”A: Of course not, you requested me to bring up an alternative answer to the baldness issue and I did.“What do you make of the fact the resurrected/glorified Christ Late Antique and Medieval iconography depicts him with no hair and no moustache at times while depicting him with a beard and moustache before resurrection and glorification ON THE SAME iconographic program (see e.g. the famous Hungarian Pray Ms bifolium)? NOTHING!”A: You of all people should be aware of the identifications with pagan deities and the influence that could have on the way that people that never saw him visualized him. Just take Sol Invictus’ classical appearance, remember the Mausoleum M depiction of Christ as a fusion of himself and the pagan deity, Dies Natalis Solis Invicti and Christmas… And voila, a perfect recipe for people depicting Jesus the as the clean shaven Sol Invictus during those early centuries. The human Jesus would be depicted as your “average” Jewish man, while the Resurrected form would resemble the “divine” look of Sol Invictus. The example of Sol Invictus is the most obvious due to the known interaction between his cult and early Christianity, but the same could be said for Apollo and several of the Hellenistic/Roman deities.“This is not serious refutation.”A: It was meant to be speculation, I went on the tangent on your request. I was perfectly comfortable trying to explain why hair loss would not have been evident in the short time between the Resurrection and MM seeing him.","date":"October 19, 2014 at 8:58 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"author":"eric","post":"If you are referencing Barachiel (which BTW deals with one being in particular, not *all* angels) we must remember that the relevant book is believed to have been written after Christianity was already flourishing, see Evan et al.","date":"October 20, 2014 at 8:18 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"author":"eric","post":"MPH: “Eric ,Then again you explanation does not fit the reported facts (see the Four Gospels) and facts of experience.1/- Had Mary Magdalene really seen an angel in its heavenly form i.e. as described in Daniel’s ‘fancy description’ (Daniel 10:5-6) and not in a human form AND IN THE TOMB:– firstly she would have fallen on her face instantly– secondly she should have not even noticed “the gardener” looming behind her in the rising sun (most likely between two monumental cave-tomb entrance columns) as she was squatting at the low tomb opening looking in and consequently she should not have had to adjust to a sudden change in lighting experience since lighting was both within (an alleged “luminous angel” in the tomb) and without (Mary Magdalene turning her head and facing the rising sun).”A: Yes, but Daniel 10:11 clearly states that to effectively convey a message, these beings are able to command somebody to stand up despite being shaken to the core. Not only that, but simply a glimpse of such an extreme form of light would suffice (Did you know that temporary blindness is seen commonly in those adjacent to actual lightning strikes, even when they never “saw” the actual bolt? Also, abolt only lasts a few milliseconds.) and we know that Daniel was able to see him and did not fall until spoken to. Also, Ezekiel 1:28 states that he was permitted a glimpse of The Lord himself before falling down. In any case, I don’t think that she would have continued to look at it for long, just enough to identify it as an angel (a glimpse of the divine). Lastly, even if the angel was disguised, it is still highly likely that she would have fallen to the floor in reverence as soon as she realized who he was and would have been instructed to stand up, so it would still play out the same way.Um, No. The rising sun hardly illuminates to the extent that the eyes would not need to adjust if suddenly faced with something that irradiated “like lightning”.  Lightning is several times more radiant than the actual sun, and hotter as well. Lightning may cause instantaneous damage to the retina, which is something that the sun will take its sweet time to do. If you were struck by a freak bolt in the middle of the day with the sun shining at its max, you would still experience flash blinding. Finally, I don’t think that the need to explain atmospheric scattering is relevant here, but there is a *reason* why we can enjoy sunrise and sunset.MPH: “2/ Re Matt 28: 1-4 we read: “Now after the Sabbath, toward the dawn of the first day of the week, Mary Magdalene and the other Mary went to see the tomb. 2 And behold, there was a great earthquake, for an angel of the Lord descended from heaven and came and rolled back the stone and sat on it. 3 His appearance was like lightning, and his clothing white as snow. 4 And for fear of him the guards trembled and became like dead men.– firstly you most misleadingly mix up THREE DIFFERENT EPISODES as Matthew (for dramatic emphasis’ sake) mixes two episodes into one namely the resurrection per se that occurred in the middle of the night (AND NOT at dawn!) with an angel descending from heaven (that is from outside the tomb AND NOT from the inside!) and Mary Magdalene coming at the tomb toward dawn first WITH OTHER WOMEN AND THEN with Mary Magdalene’s RETURN to the empty tomb by herself and seeing an angel IN the tomb.”A: First, I did not “mix up” anything, these are different scenes of the same sequence and thus relevant to each other. The difference is only a few hours, Max. Second, there is no reason to assume that this was not the same being, since the women left, it would be most ineffective to return and then come back without delivering his message (and complete his divine mission). Simply remaining in the vicinity was more likely. Third, as explained above, the time of the day would make no difference in regards to flash blindness, as explained in the reply above.MPH: “Besides ‘the Archangel of Lightning’ as Anthropomorphic Personification trope was currently used in popular ancient Jewish culture for literary dramatic emphasis. To mistake literary device for fact is just naive.”A: “Currently” as in “first century current” is completely besides the point, since the description matches that of Daniel ages before. Allegorizing that may be a mistake on your behalf, especially since we are simply told that this was a messenger and is not identified as somebody higher up in hierarchy like say, Michael (who may warrant a “trope”).MPH: “(…) thirdly, shall I endlessly repeat, in the Bible and Rabbinic literature, angels are spiritual beings without bodies of flesh and bones THOUGH they apparently have the ability to appear in human form (Gen. 19:1-22). Reminder: physical Matter is the lowest vibration of spiritual Energy (or Spirit) and spiritual Energy (or Spirit) is the highest vibration of physical Matter”A: Perhaps you could clarify this argument, because I am sure that this was addressed in my last reply. And not only that, I used the term “human facade” well aware that they are not made out of flesh and blood. The fact of the matter is that the only description of the being adjacent to the tomb near the time of the Resurrection is describing a supernatural appearance.MPH: “3/ you wrote: “it is unlikely that he (=Yeshu’a) would have experienced extreme hairloss in a couple of days -especially localized hair loss- and that diffuse hair loss is not enough to make somebody a “complete stranger”.”A: Now this I can debate!MPH: “Question one: when was it last you medically studied or hear of a moustached, bearded and long-haird man returned to life/resurrected after experiencing a very traumatic/violent death to totally rule out the possibility of a case of ‘post-oppressaem-et-ad-vitam-reditum’ quick extreme alopecia (loss of beard and moustache and partial loss of Yeshu’a’s long hair blood encrusted hair)?”A: I already answered that no body has ever attended or studied any case of actual resurrection. However, let’s assume that it was so. Did you know that a good portion of your hair is already ready to fall? This is called the telogen phase and throughout it this hair is essentially just resting there, it could fall out at any moment, yet it generally does when the cycle is either ready to restart and go back to the anagen (growth) phase or when it is interrupted, as you are implying. Well now, when trauma interrupts the cycle and sends most of the hairs into a premature telogen phase, this means that these hairs are left without “replacements” and hair loss becomes apparent. However, the problem with that is -as mentioned above- that regardless of the reason for the interruption of the cycle (and death followed by Resurrection would be just that, a prolonged interruption of all body functions) said hair loss is systematic and will not become apparent until *at least* a few days after. You are suggesting that the sheer trauma would accelerate this to a few hours, but can’t provide any example of this happening either.MPH: “Had you ever gotten long hair and worn a moustache and beard and one day had to have all your hair shaved on the head and all around the mouth in a place with no mirror and all of a sudden, while passing from a place with no mirror to a place with a mirror, been brought face to face with your own new reflection in the mirror, you could have not even recognized yourself at first sight and should have needed a time to adapt and become familiar with your new face image! Even a very good friend from childhood could not have recognized you unless you would have addressed him using his surname. Once I made this very disturbing experiment. I could not even recognize a very good friend of mine from childhood just standing in front me as he had no moustache no beard any longer and wear very short hair, which I was not familiar with!”A: Well, of course. Had he actually *shaved* his face/head clean this could be easily explained. But this was one of the very first things that I addressed. Culturally this was unlikely, to this day the Halakha addresses shaving in a particular manner. Then there is the Nazarite Vow, but also the drinking of wine to consider.MPH: “Most likely, this could explain why Mary Magdalene was unable to recognize her own master as she mistook him for a hairless-faced, sparse-haired and red-earth encrusted bare-footed gardener draped in his red earthstained sindon used as workwear.”A: …MPH: “You also wrote: “You of all people should be aware of the identifications with pagan deities and the influence that could have on the way that people that never saw him visualized him.”In the specific case of the Hungarian Pray Ms bifolium I gave as an example, most likely the illustrator did SEE the crucifixion victim image on the Constantinople Sindon. Still it is reported by eyewitnesses “the ‘not-made-by-hand’ image of Christ and G-od, draped with a white/pure linen cloth he had worn, was sufficiently in lieu of the vision of the Lord coming into the flesh to those who had not corporally seen him”. Too bad you of all people are amazingly unaware of the corroborating 944-1207 CE testimonies and eyewitness descriptions of the TS image.”A: Not at all, I am well aware of the parallels to the shroud in the Codex since it has been discussed here time after time. I never denied that the author saw the shroud, as a matter of fact I assume that he did. What *I did* imply is that the reason why his hair would be depicted differently afterwards is because the author would feel the need to illustrate the divinity of the Resurrection by replacing the bearded, “traditional” Jewish man, depicted in the shroud with something that reflected a known pagan deity as a metaphor of ascension, from man to God. Pagan influence lingered way after the cults disappeared, the author of the codex should have been well aware of these earlier depictions and hence why he choose them to illustrate this metaphor. Regardless, in either case a few things are certain: I- No first century artist is known to have painted an image of Christ after seeing him Resurrected first hand. This entire debate would be settled if such a piece emerged.II- No oral tradition has been recorded directly stating that the change involved Jesus’ hair.III- There is no way that the Codex’s author saw the Resurrected Christ in person and if he actually saw the shroud, then that would actually put more weight on the theory that the variation in the depictions was either metaphorical or represented something that is not to be taken literally.MPH: “Your refutation is still not serious and does not fit with the Gospels, the known (in terms of facts of experience) and the most comprehensive and logical explanation for Mary Magdalene mistaking her own master for the gardener.”A: Has it occurred to you that maybe we just have different interpretations of the gospels? So far I have not found any trouble rebuffing your arguments back, if mine were so flawed it would not have been this easy. And again, your own comprehensive explanation is still speculative, just like mine.","date":"October 20, 2014 at 8:03 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"author":"eric","post":"Employing an established analogy (i.e. “Like lightning”) is not a “mistake”. If I say that something was as “bright as the sun”, it may very well be, but that doesn’t mean that it is actually *the* sun. When someone says that something was “like lightning”, I infer that it was extremely luminous and akin to lightning, enough to cause flash blindness, not that it was literally lightning.But then again, this was merely a tangent and deviation from the original medical argument. If we have reached the point of going around in circles for a week, then maybe it is time to just let it die.","date":"October 25, 2014 at 4:33 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"author":"eric","post":"Well then, let’s go back to the medical matters…Can you cite me some literature backing down your point about notable hair loss that takes place in a couple of hours following severe trauma?If you are not interested in debating that, I am not really interested in continuing to exchange barbs… I have seen the neverending coin debates and will not continue digging up an old thread to continue a circular argument.If you want to go on, back it up.","date":"October 25, 2014 at 4:55 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"author":"eric","post":"I mean, you certainly did your home work. Didn’t you?","date":"October 25, 2014 at 4:58 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"author":"eric","post":"Well, that’s an ambiguous reply. Is that your way of saying that the ‘quick microwave’ alopecia is undocumented? If so, how does it differentiate itself from run of the mill speculation? Besides being “obvious” and “logical” in the opinion of an individual? The scarcity of cases has never been an obstacle to -at the very least- make a footnote in medical literature. There are several diseases that are on record as affecting less than a dozen individuals. So, if someone lost his/hers hair in a few hours following extreme trauma, it is out there. Since the Resurrection basically brought all of the cells to their previous function (this is actually the first time that I have encountered thought of an “imperfect/incomplete” Resurrection), there is no reason to believe that they would behave in odd ways. Except, of course, someone is speculating.The shorud depicts a man with full hair, so if it is real, that is a problem for your theory. You are assuming that it is real, but depending on third party depictions made by individuals that were never in contact with the Resurrected Jesus. Even if it actually happened, we have no idea of proving or disproving it, since nobody made any direct references to his post-Resurrection follicular proficiency, you cling to a single account to create this extraordinary house of cards. Colin would call this non-falsifiable idea something like “pseudo medicine”, so maybe you should consider yourself lucky that I refrain from calling it a fairytale and instead prefer the more subtle “speculation”.The only difference between my “fairy tale” and yours is that I readily admit that it is nothing more that speculation, nothing more than a thought exercise, while you claim that yours is the truth based on something as subjective as it appearing to be “logical”. Don’t you think that Charles considers the same arguments that you deride “logical”? Do you now see why this argument is circular and remains so?","date":"October 25, 2014 at 5:39 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"author":"eric","post":"Max, my point is that I know that you consider this the simpler explanation. If MM mistakes Jesus for a gardener, then he surely looked exactly like one. Why else would she make such a mistake, right? But you should have made contact with an M.D., a good dermatologist would have sufficed, when you first elaborated this hypothesis. By not doing so, you took Occam’s razor, pointed it towards yourself and committed intellectual harakiri. You have been fooling yourself for too long, and I honestly believe that you are too intelligent for that.","date":"October 25, 2014 at 6:31 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"author":"eric","post":"I don’t think that you are even reading my replies. Several of these are already addressed in long and winded comments above and I grow tired of your rethoric. The age of the Third book of Enoch, which is the most prominent work depicting Barachiel, has been heavily debated as Evans notes. Just like everybody here, I am aware of the fact that the face in the shroud is covered in blood, but that is a moot point, I have yet to see anyone losing most of his/her hair due to tug and pulling… And that includes all kinds of blood, you name it and we have it. Don’t you know that in most cases, the only part that is actually cleaned while attending a patient is the wound and its adjacent areas? In some cases, the other blood remains there for several hours until the patient is stabilized and the remaining blood can be washed. The tug and pull can remove *some* hair, yet no extreme form of alopecia occurs, you don’t even need to contact an M.D. to tell you this, an experienced R.N. has plenty of experience dealing with such messes. What I do believe is that you have never worked with a trauma survivor. You concepts on alopecia are simply erroneous. I am starting to think that you are not only unaware of the pathology of post-traumatic alopecia, but common medical practice as well.Nevertheless wasting time debating speculation, either mine or yours is pointless and I admit that it was my fault going on a tangent on your request. When the others say that you never offer any references, they are right. The fact that you insist on discussing your unique interpretation of the gospel proves to me that you know that there is no literature to back up those claims. Your entire argument is built on mud and will continue to sink, until you can prove them wrong by citing something (anything!) legit. Can you do that? Otherwise, just stop trying to push the same arguments over and over, I’m not buying them.","date":"October 25, 2014 at 2:43 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"author":"eric","post":"In how many languages is this presentation being distributed? I may be able to translate some of the written content.","date":"October 22, 2014 at 4:04 am","url":"https://shroudstory.com/2014/10/21/what-next-stadiums/","cat":"presentation","title":"What Next?  Stadiums?"}],"forensic":[{"author":"eric","post":"I agree, a most entertaining read this early in the morning.","date":"October 25, 2014 at 6:35 am","url":"https://shroudstory.com/2014/10/25/a-st-louis-paper-already-online-the-roman-flagrum/","cat":"paper_chase","title":"A St. Louis Paper Already Online:   The Roman Flagrum . . ."}],"history":[{"author":"eric","post":"So, no sysop noticed it? Tough not a policy (which means you don’t get blocked for violating it), COI is frowned upon as described in this guideline: http://en.m.wikipedia.org/wiki/Wikipedia:Conflict_of_interestIt would have been more elegant to simply contact one of the several users following these pages to add the content following an evaluation.","date":"November 21, 2014 at 4:18 am","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","title":"Charles Freeman’s theory now in Wikipedia"}],"image":[{"author":"eric","post":"It is relevant to note that Barrie Schwortz once noted that the reaction itself was only half of the puzzle: “Ray Rogers told me personally that he believed, “Something else was at work with the Maillard reaction,” but he didn’t know what that was and didn’t live long enough to explore it.”Since that comment was posted here (https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/) and Yannick is well aware of that, it may be negligent to only partially portray Rogers’ position on the matter.","date":"September 14, 2014 at 7:46 am","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level"},{"author":"eric","post":"To be fair, I did place you on a category of your own.  As far as the distinction between religious people, paranormal aficionados and skeptics, I was merely following YC’s lead.","date":"November 23, 2014 at 9:29 am","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","title":"Image of the Resurrection?"},{"author":"eric","post":"Are you serious? If I wanted to sell something as real, the first thing that would be mimicked was something that reflected all of the iconography in a very simple manner. And in Christianity, the theme of sacrifice trough death as important as the resurrection itself. There is a reason why the crucifix is the main symbol. An “unexplained” image that correlates with the injuries of the Gospels would have been more valuable than a similar image of Jesus alive… It is the stigmata that serves as “proof” that it is that particular individual and thus, what would have raised the value of the item considerably.You should be able to easily know that, but perhaps your interest in throwing random attacks has clouded your judgement…","date":"November 22, 2014 at 9:00 am","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","title":"Image of the Resurrection?"},{"author":"eric","post":"Heck, even *today* the selling point for the authenticity of the shroud is the fact that what is depicted mirrors the Gospels. A fact that virtually all pro-authenticity papers state.","date":"November 22, 2014 at 9:04 am","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","title":"Image of the Resurrection?"},{"author":"eric","post":"On that same line, the answer to YC’s question can be found in the same iconography. The correlations are so precise that Occam’s razor (I know..) leaves Jesus as the most likely subject.Thus, religious people/supernatural aficionados see it as a sign from God or some sort of physical reminder. And skeptics see that portraying him was the easiest way to flim-flam people in an age where the Church was extremely powerful. That is, unless you take positions like those of Hugh of Charles, who provide their own explanations of why they believe that is the subject.","date":"November 22, 2014 at 9:17 am","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","title":"Image of the Resurrection?"},{"author":"eric","post":"Wouldn’t the relative uniformity of the image represent a challenge to the possibility that the image was created by any sweat by-product?The density of sweat glands is hardly uniform, even if the subject was sweating so profusely that he was literally covered from head to toes in sweat that hypothesis would still face the same issues of the MR and other “natural reaction” theories. You can’t disregard the fact that the back was supposed to be lying directly on a flat surface and the distribution of liquid/gases/et al. would not be uniform.","date":"September 30, 2014 at 7:25 am","url":"https://shroudstory.com/2014/09/29/secret-image-made-with-invisible-ink/","cat":"image_theory","title":"Secret Image Made With Invisible Ink"},{"author":"eric","post":"I should have used “fluids” instead of “liquids”, but you get the idea.","date":"September 30, 2014 at 7:29 am","url":"https://shroudstory.com/2014/09/29/secret-image-made-with-invisible-ink/","cat":"image_theory","title":"Secret Image Made With Invisible Ink"},{"author":"eric","post":"Why would the “degraded collagen” remain only on the -very strategic- locations (and patterns) of the stains? It makes no sense.","date":"September 30, 2014 at 8:33 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"author":"eric","post":"My first query would be concerning the size of the image and how an artist would keep track of the areas that were previously worked while dealing with an acidic liquid that would leave a very faint stain before being heated. The shroud does not appear to have any pre-image outlines. I am assuming that the “heating” would be done at once. Otherwise I would expect to see some sort of systemic transition between “sections”.","date":"October 3, 2014 at 11:40 am","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis"},{"author":"eric","post":"Note that I use the term “stain” loosely, since AA is a bleaching agent.","date":"October 3, 2014 at 12:03 pm","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis"}],"misc":[{"author":"eric","post":"Their response: “Some say John the Baptist; others say Elijah; and still others, Jeremiah or one of the prophets.”Suggests that at least the common folk believed in the possibility of reincarnation to some degree. Elijah was taken and John the Baptist was a case of mistaken identities… But what about Jeremiah? Some sources have him dying at Tahpanhes, others elsewhere, but none have him being taken away by a flaming chariot.","date":"October 6, 2014 at 5:03 pm","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","title":"A Different Perspective on the Shroud"},{"author":"eric","post":"The entire thread that is discussing Charles’ article has turned into a mud slinging competition. I decided to withdraw from it, which is a shame, since there are arguments on both sides that I believe deserve careful analysis. For example, Thibault’s reply is well thought and yet it is barely discernible in that avalanche.","date":"October 24, 2014 at 1:51 am","url":"https://shroudstory.com/2014/10/23/accusations-of-intellectual-dishonesty/","cat":"news_&_views","title":"Accusations of Intellectual Dishonesty"},{"author":"eric","post":"Also, the flaming chariot was a rare occurrence, excluding Enoch and Elijah, any other prophet would be considered “dead” by the layperson.","date":"October 6, 2014 at 5:26 pm","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","title":"A Different Perspective on the Shroud"},{"author":"eric","post":"* well thought out","date":"October 24, 2014 at 2:05 am","url":"https://shroudstory.com/2014/10/23/accusations-of-intellectual-dishonesty/","cat":"news_&_views","title":"Accusations of Intellectual Dishonesty"},{"author":"eric","post":"On the right side, which has most of the upcoming events I see:Turin, LA, M.DF, Rome, São Paulo, Atlanta, Prague, Madrid, Dallas & Lima.","date":"November 20, 2014 at 8:34 am","url":"https://shroudstory.com/2014/11/20/how-many-cities-can-you-identify-on-the-back/","cat":"other_sites","title":"How many cities can you identify on the back?"},{"author":"eric","post":"Spoken like a true follower of Jerry Coyne. And just like Jerry, you fail by generalizing and clumping every shoroudie scientist in the fringe.","date":"October 19, 2014 at 7:51 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"author":"eric","post":"* shroudie","date":"October 19, 2014 at 7:53 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"author":"eric","post":"Oh Al, you commit the same sin that you condemn. You came here parroting the skeptic crowd without cutting the shroudies any slack. I will let the ones posting in here do introductions and list their credentials… But before that happens, know that this is not a cheerleading site. However, I will grant that most of the information and so-called “theories” reported by the media are pretty fantastic and fringe. Also, not every one of those that publicly state their belief have any sort of religious motive. Barrie is probably the best example to prove otherwise and if you actually bother to reach him, just as you used his website, I am sure that he will have an interesting take on what does and does not fall into the fringe in his view.And don’t get me wrong, I have criticized several instances of pseudo-science, if you go back a few weeks back you will find my opinion about the “irradiation” hypothesis and more recently, I was forced into a week-long argument regarding this -very odd- case of a pseudo-medical claim. With that said, claiming that *all* science dealing with the shroud is pseudo-science is ridiculous, we have people here that are actually testing the different ideas that emerge, others examining the properties of the cloth… Not every one of the shroudies is “out there” in the fringe and by minimizing those that are not, you are also mocking the work of the skeptics that post here. Since it is so “obvious”, then they are surely wasting their time, right? And boy, are they mediocre if they can copy something that is so *obviously* a fake! No, it may very well be fake, but it is one interesting and rather complex fake. Trying to understand its properties is not any more pseudo-scientific that studying the subtleties of a lost artist by studying his work.In other words, try to avoid the Coyne mistake of being ever so pretentious and at least try to test the waters first.","date":"October 30, 2014 at 10:10 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"author":"eric","post":"* if they CAN’T copy","date":"October 30, 2014 at 10:12 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"author":"eric","post":"Oh, by the way, I believe that the last time that I saw Piczek mentioned here was in late 2013. At least, most of the shroudies rarely quote her, in the same way that few skeptics still quote McCrone (albeit Charles is trying a comeback).Still, at least her wild claims had the weight of having earned a degree. Which is why it was at least fairly evaluated, before falling into obscurity. Yours (admittedly) was in what, Google searching? If you fail to establish that you even have the educational baggage, then you surely can’t expect to be taken seriously when you come in guns blazing and trying to put labels… Because even those loonies have an expertise that outranks yours.","date":"October 30, 2014 at 10:30 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"author":"eric","post":"There we go. Exactly which branch of I may b so bold to ask?BTW, I was not trying to criticize your belief in the C14 testing, just your  assumptions. Everybody in here has a different opinion, I am mostly interested in the formation processes and the possibility that medical knowledge was more advanced -at least by the 1300s- than we think. If you want to support that, go ahead, but try to ‘shroud’ your bias a little. By avoiding the pretentiousness and accusations in your first post, at least you would avoid being treated like an ordinary troll.","date":"November 1, 2014 at 8:45 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"author":"eric","post":"@HughIn art history AFAIR (don’t ask me how that evolves into “PPs”). Is it really relevant to her extrambotic hypothesis? No. But by at least knowing that she had a degree, people discussed her work. Why? Because she was introduced properly and took the time to make an attempt at a paper that backs up her claims. She did not come out of the blue and posted some bold assertions in a forum. Which was my point. The fact that she was completely out of her element did not prevent her work from being discussed (Charles is way out of his by placing all of his work on top of the “gesso” argument. His conclusion was reached without any scientist’s help, and he is as bold as to claim that this work overcomes real scientists based on logic… Yet it is still being seriously discussed) while other works such as the “lirey toga” fiasco of last week passed pretty much undiscussed. The degree, as unrelated as it is, allows some people to gravitate towards her and support her work… And the other camp to respond. And thus, the discussion follows.Not that I find the logic of your question, since she is not really a key component of any serious debate and I sure wasn’t defending her.PD- Scratch the several months of not being mentioned, as Mike just quoted her paper >.<","date":"November 1, 2014 at 9:23 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"author":"eric","post":"* “Exactly which branch of psychics, if I may be so bold.”","date":"November 1, 2014 at 9:28 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"author":"eric","post":"The congruence reported in the location of calcium deposits found in the sudarium of Oviedo and the shroud seems, to me, more interesting than the neutron madness. Particularly when noting the gap between the reported C14 dates (8th vs. 14th centuries).","date":"December 2, 2014 at 5:43 pm","url":"https://shroudstory.com/2014/12/02/the-neutron-conference/","cat":"news_&_views","title":"The Neutron Conference"}],"opinion":[{"author":"eric","post":"I tried to extract the metadata from the original BBC image and found out that most of the information is missing. This is troublesome, since .jpgs lose information more readily than say, a .raw format, and without some data we can’t really know how many alterations could have taken place.","date":"October 22, 2014 at 6:36 pm","url":"https://shroudstory.com/2014/10/22/high-definition/","cat":"other_blogs","title":"High Definition"}],"researchers":[{"author":"eric","post":"Wouldn’t it interact with it tough? There are a lot of metals and components in blood that I would expect to interact, at least if there is some form of radiation involved.","date":"October 27, 2015 at 11:15 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"author":"eric","post":"Is there a way to replicate a dematerialization process like the one proposed by JJ in a lab? I am not being cynic and would really like to know.","date":"October 27, 2015 at 11:09 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"author":"eric","post":"Seeing my past comment, I believe that it is more accurate to say that biocentrism borrows from string theory instead of saying that it relies on it.","date":"October 11, 2014 at 12:02 pm","url":"https://shroudstory.com/2014/10/11/note-to-russ-breault/","cat":"presentation","title":"Note to Russ Breault"},{"author":"eric","post":"When it comes to speculative quantum models of the consciousness, Orch-OR appears to have the upper hand (with the recent discovery of QV in microtubules) and the core elements of that theory clash directly with biocentrism (not surprising, since Roger Penrose is notoriously against the string theory and biocentrism relies on it). Although, in the end both models end up proposing the same: that consciousness is a fundamental element in this universe.","date":"October 11, 2014 at 9:54 am","url":"https://shroudstory.com/2014/10/11/note-to-russ-breault/","cat":"presentation","title":"Note to Russ Breault"}],"resources":[{"author":"eric","post":"Can we get a thread to discuss the flagellation tangeant that is building parallel to the main discussion?","date":"November 4, 2014 at 1:51 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"author":"eric","post":"I would like to read Charles’ answer to this. Why would an artist spend so much time constructing such a detailed ‘buttocks’ just to (at least partially) cover it with a loincloth? The placing of the hands is deliberately trying to cover the genitalia, thus suggesting nudity.","date":"October 17, 2014 at 5:25 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"author":"eric","post":"I wi take the time to read the original article later. At the time of asking the question I had only read the paragraph quoted due to a parallel conversation with Max in another topic.However, that still leaves the question of “why?” open… If an artist was trying to sell a painted shroud as a legit relic, painting it in line with the established depictions from the beginning would have secured an easier sell or, in the case that it was painted for a Church, would have avoided the possibility of it being rejected. Also, if the shroud was regarded as authentic… Would painting over it not be considered desecration? I believe that your hypothesis depends on the idea that the owner of the shroud at the time of adding the loincloth was aware that it was a painting. Is this right?","date":"October 17, 2014 at 6:27 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"author":"eric","post":"* will","date":"October 17, 2014 at 6:29 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"author":"eric","post":"In case that the last paragraph is a bit ambiguous. My point is that regardless of the power of the ecumenical council (the Council of Trent as mentioned), I am hesitant to believe that anyone would dare to touch the shroud if there was at least a possibility that it is a legit relic. To paint over the original, the owner should have been absolutely certain that it was a forgery… At the same time that it was being displayed publicly. There are deeper implications to this argument.","date":"October 17, 2014 at 6:42 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"author":"eric","post":"Regarding the shoulders, I don’t think that the dislocations, inflammation, etc. that would follow crucifixion are being taken under consideration in the “floor” test. PD- That is just an observation, I’m not trying to take sides.","date":"October 19, 2014 at 2:32 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"author":"eric","post":"I am actually starting to agree. Not because of the lack of a scientific base, but more because of Charles continuous disregard of people that are trying to engage him. The “I am now working with *real* academics” reply is getting old… Fast.","date":"November 9, 2014 at 7:04 pm","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"author":"eric","post":"Not “good”. Max has a gift to annoy other users, especially when he tries to prove that he can outmaneuver somebody in his own field, but he can actually bring some nice arguments when debating something that he actually knows. And for whatever reason, MPH’s stingy remarks and his persistence to keep the arguments going on have produced some pretty good rebuffs, at least during the few years that I have read this blog.","date":"October 27, 2014 at 9:25 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"author":"eric","post":"David cited “15 years of experience in a NGO human rights organization” and having seen victims of flagellation victims as his rationale. I don’t think that “proves” the point, but that’s just me. And my main issue with it is that of all the victims that David may have seen, chances are that none were actually assaulted with something resembling the alleged flagrum of the shroud.Perhaps one of the regulars could replicate one and do some research in fresh pig carcasses? The skin of pigs, while not identical to humans, may be a  decent facsimile.","date":"November 3, 2014 at 9:41 pm","url":"https://shroudstory.com/2014/11/03/the-holkham-bible-recently-much-mentioned/","cat":"books","title":"The Holkham Bible Recently Much Mentioned"},{"author":"eric","post":"* photos of victims","date":"November 3, 2014 at 10:04 pm","url":"https://shroudstory.com/2014/11/03/the-holkham-bible-recently-much-mentioned/","cat":"books","title":"The Holkham Bible Recently Much Mentioned"},{"author":"eric","post":"This is tought provoking. However, the use of wound depictions within the Holkham bible seems selective. While I can see where the flagellation argument could be employed, there is also the fact that the same source has depictions that contradict the shroud. For example, the crucifixion is early depicted with the nails going trough the palm: Obviously, I am not assuming that this would be the same artist, but the wounds in the hand are a key component of the entire depiction of this scene and it seems contradictive that the shroud would depict those in a manner that contradicts the conventional wisdom… Especially if it was going to be used as a prop in an official Church activity. Thus, I ask Charles to provide some contemporary examples where the wounds go trough the wrists for contrast.PD- Then again, an unrelated key question is “does the image exist  under the back stains”?","date":"November 3, 2014 at 5:32 pm","url":"https://shroudstory.com/2014/11/03/the-holkham-bible-recently-much-mentioned/","cat":"books","title":"The Holkham Bible Recently Much Mentioned"},{"author":"eric","post":"* The crucifixion is *clearly* depictedSorry for the typos, but I can barely type in these smartphone keyboards","date":"November 3, 2014 at 5:35 pm","url":"https://shroudstory.com/2014/11/03/the-holkham-bible-recently-much-mentioned/","cat":"books","title":"The Holkham Bible Recently Much Mentioned"},{"author":"eric","post":"Not really my point, I already noted that the artist was most likely not the same (I assume it was not). What was requested are other contemporary depictions where the “hand” wounds go trough the wrist. For something that was going to be used oficially by the Church, it would be really odd to wander away from the conventional wisdom in such a key element of the gospels.","date":"November 4, 2014 at 1:42 pm","url":"https://shroudstory.com/2014/11/03/the-holkham-bible-recently-much-mentioned/","cat":"books","title":"The Holkham Bible Recently Much Mentioned"},{"author":"eric","post":"If that is the case, surely there are other examples. Can you provide them?","date":"November 4, 2014 at 5:53 pm","url":"https://shroudstory.com/2014/11/03/the-holkham-bible-recently-much-mentioned/","cat":"books","title":"The Holkham Bible Recently Much Mentioned"},{"author":"eric","post":"Jacobovici with another dubious “Biblical” find… He sure is becoming a poor man’s Ron Wyatt.","date":"November 12, 2014 at 2:03 pm","url":"https://shroudstory.com/2014/11/12/utter-hogwash/","cat":"books","title":"Utter hogwash"},{"author":"eric","post":"So… The remaining letters are “H”x2. HH = His Holiness… The Pope! Who clearly knew of this code and the true identity of The Holy Grail. It all makes sense now!","date":"October 19, 2014 at 6:00 am","url":"https://shroudstory.com/2014/10/19/new-paper-the-lirey-toga/","cat":"paper_chase","title":"New Paper:  The Lirey Toga"},{"author":"eric","post":"And THAT early in the morning to boost.","date":"October 19, 2014 at 9:11 am","url":"https://shroudstory.com/2014/10/19/new-paper-the-lirey-toga/","cat":"paper_chase","title":"New Paper:  The Lirey Toga"},{"author":"eric","post":"Fair enough.","date":"October 19, 2014 at 5:25 pm","url":"https://shroudstory.com/2014/10/19/new-paper-the-lirey-toga/","cat":"paper_chase","title":"New Paper:  The Lirey Toga"},{"author":"eric","post":"It seems that we can agree after all.","date":"October 20, 2014 at 8:36 pm","url":"https://shroudstory.com/2014/10/19/new-paper-the-lirey-toga/","cat":"paper_chase","title":"New Paper:  The Lirey Toga"}],"sudarium":[{"author":"eric","post":"If a compendium of all technical questions is gathered, then perhaps they could be answered by Dr. Boi, she does appear to be very active in FB after all: https://www.facebook.com/marzia.boi.9","date":"February 15, 2015 at 6:28 pm","url":"https://shroudstory.com/2015/02/15/important-new-pollen-discovery-on-the-sudarium-of-oviedo/","cat":"press_coverage","title":"Important New Pollen Discovery on the Sudarium of Oviedo?"},{"author":"eric","post":"For those interested, this articles goes into the details of the microscope per se: http://www.lasprovincias.es/sociedad/201502/09/ucam-demuestra-sudario-oviedo-20150209200327-rc.html","date":"February 15, 2015 at 6:13 pm","url":"https://shroudstory.com/2015/02/15/important-new-pollen-discovery-on-the-sudarium-of-oviedo/","cat":"press_coverage","title":"Important New Pollen Discovery on the Sudarium of Oviedo?"},{"author":"eric","post":"The main point of the paper is not the ‘ponytail’, but the coincidence between the calcium deposits between both pieces. The sudarium is not a paiting, there is no image of any kind AFIK, which means no gesso. So then, if deposits of the same type are found in exactly the same locations that makes the case interesting. Why? Because the pieces are C14 dated centuries apart.","date":"December 5, 2014 at 2:10 pm","url":"https://shroudstory.com/2014/12/05/paper-chase-new-observations-on-the-sudarium-of-oviedo/","cat":"archaeology","title":"Paper Chase:  New observations on the Sudarium of Oviedo"},{"author":"eric","post":"What makes you think that I’m defending that? You need to give the agenda a breather, David.The correlation between both pieces is not equal to authenticity, but it is interesting.","date":"December 6, 2014 at 5:38 pm","url":"https://shroudstory.com/2014/12/05/paper-chase-new-observations-on-the-sudarium-of-oviedo/","cat":"archaeology","title":"Paper Chase:  New observations on the Sudarium of Oviedo"},{"author":"eric","post":"@ O.K.Can anyone elaborate which “Egyptian mummy” specimen is cited there?","date":"December 6, 2014 at 5:44 pm","url":"https://shroudstory.com/2014/12/05/paper-chase-new-observations-on-the-sudarium-of-oviedo/","cat":"archaeology","title":"Paper Chase:  New observations on the Sudarium of Oviedo"},{"author":"eric","post":"They must be referrencing quercus calliprinos. But…It’s really hard to do an assessment on how reliable a report is when they publish and re-publish a typo. At the very least it shows that no botanist was involved.","date":"February 13, 2015 at 7:21 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"author":"eric","post":"* referencingOh, the irony.","date":"February 13, 2015 at 7:22 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"}]}
