{"blood":[{"id":"comment-25000","author":"escipion","post":"El “deliberate enhancement of a genuine relic” es IMPOSIBLE. Ninguna sangre añadida podría mantener el color ROJO de la sangre tal como se muestra en la Sábana, y ninguna sangre añadida podría adoptar la forma y los bordes tal como aparecen en la Sábana. Las experiencias en el laboratorio no dan esos resultados. En el suplicio de Jesus de Nazaret se dan todas las circunstancias que favorecen la aparición de un DIC, una “consumptive coagulopathy” o “disseminated intravascular coagulopathy”, como son el enorme politraumatismo de partes blandas (los azotes) y los traumas de la propia crucifixión. Esto ya ha sido apuntado por Bergeron en 2011 (aunque no he podido leer su trabajo) y es recogido por Svensson y Heimburger en “Forensic aspects and blood chemistry of the Turin Shroud Man”. En el DIC hay unos enormes trastornos de los fenómenos de coagulación y hemorragia, además de intensa hemolisis (destrucción de glóbulos rojos) con aumento de la bilirrubina indirecta (que podría tener cierta relación con el color rojo). La patogenia de este gravísimo trastorno era desconocida hasta hace pocos años (he visto morir en muy pocas horas muchos pacientes con él), pero afortunadamente hoy día es bien conocido y tratado médicamente. Creo que es un camino en el que se debe profundizar, aunque en sus aspectos macroscópicos (observación directa de los comportamientos de las hemorragias, coagulaciones y lisis con nuevas hemorragias) sea muy poco factible pues el tratamiento se instaura de inmediato ante el primer signo de un CID. Carlos Otal.","date":"2013-02-20","mins":"6:19 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"id":"comment-29305","author":"escipion","post":"En el individuo normal, sano, la hidroxiprolina sólo se encuentra como trazas en el suero sanguíneo, y en poca mayor cantidad en la orina como hidroxiprolina libre y hidroxiprolina conjugada con péptidos. La hidroxiprolina AUMENTA de manera muy considerable en el suero sanguíneo y en la orina en los INTENSOS ESTIRAMIENTOS MUSCULARES MANTENIDOS, lo que es bien conocido por la MEDICINA DEL DEPORTE. Carlos Otal.","date":"2013-04-04","mins":"9:32 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-25759","author":"escipion","post":"El Dr.Lavoie tiene razón. Todas las medidas que se hagan sobre el rostro del Hombre de la Sábana y que pasen por la PUNTA DE LA NARIZ (top of the nose) demuestran que la Sábana estaba PLANA y la proyección es ortogonal, y sin contacto con la Sábana, por ello el Dr.Lavoie habla de Resurección ( las manchas de sangre demuestran el “contacto” cuerpo sábana y la imagen ortogonal demuestra el “no contacto” cuerpo sábana, 2 posiciones distintas en 2 momentos distintos. 1. Medir la distancia entre lo que crea ser el centro de los ojos en el Hombre de la Sábana, aunque tenga algún error no es importante. 2. Traslade con una cuerda esa distancia a su propio rostro, pasará por encima de la RAIZ DE LA NARIZ ( root of the nose), la medida ( aún con error) será bastante congruente con la de su propio rostro. 3. Traslade esa misma medida a su propio rostro poniendo poniendo la cuerda en el medio de la PUNTA DE SU NARIZ ( top of the nose) ¡LA INCONGRUENCIA ES ABSOLUTA! y los extremos de la cuerda sólo alcanzarán las aletas de su nariz (wings of the nose), mientras que el el Hombre de la Sábana (proyección ortogonal) esa distancia alcanzará el inicio de los PÓMULOS. Aunque sea muy elemental 2+2 son 4…… y sigue siendo ciencia. Carlos Otal.","date":"2013-02-26","mins":"4:30 pm","url":"https://shroudstory.com/2013/02/26/that-is-not-what-one-would-expect-to-see-if-the-blood-first-dogma-were-true/","cat":"blood_studies","title":"That is not what one would expect to see if the blood-first dogma were true."}],"misc":[{"id":"comment-27457","author":"escipion","post":"Colinsberry: ¿Por qué se mantiene ROJA la sangre humana procedente de tus sanguijuelas (“Hirudo medicinalis”? Carlos Otal.","date":"2013-03-16","mins":"3:56 pm","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . ."}],"resources":[{"id":"comment-29362","author":"escipion","post":"[Yannick en su “fijacion paranoica” hacia Fanti no advierte que Gian Marco Rinaldi para descalificar el trabajo de Fanti utiliza exactamente la misma ESTRATEGIA que utilizó para descalificar el trabajo de Rogers (“Medievale era il rattoppo?”)…..] Yannick: Lo que es “SI VÁLIDO” para Rogers, ¿es “NO VÁLIDO” para Fanti? Carlos Otal.","date":"2013-04-04","mins":"3:05 pm","url":"https://shroudstory.com/2013/04/04/a-critical-review-of-giulio-fantis-new-book-unreliable-results-because-of-inadequacy-of-methods/","cat":"books","title":"A Critical Review of Giulio Fanti’s New Book:   Unreliable Results Because of Inadequacy of Methods"}]}
