{"art":[{"author":"eugene_ray","post":"St Bernard who’s Abbey was 15 K. From my Degruy ancestors chateau in the Orient Forest (locus of le Ray (Lirey) Shroud of Turin Chapel) was the intelligence behind Chartres and Notre Dame Cathedrals and the most admired man of his time . The Grand Orient Lodge of the Freemasons originated in the neighboring from de Gruy Chateau which is fitting because the Knights Templars originated in this Orient Forest. This neighboring Chateau Vendeuvre sur Barth was owned by the Duke of Luxembourg in exile and general Montmorency (close friend of our ancestor count Michael de Gruy(ere) and his cousin King Francois I) / our DeGruy Chateau Magny Fouchard was very old and because the Count of Gruy(ere)’s mother was a Vergy (shroud owners from de Ray) I believe this explains their presence in the Orient Forest. (Their original Castle / Chateau is in Switzerland at Gruyere’s and they were the first Knights over the walls of Jerusalem in the first crusade explaining their friendship with Othon de La Roche de Ray importer of the Shroud to deRay Castle at Ray sur Saone in Burgundy…Hugh de Payens head of the Knights Templars (Gruy were Templars) lived west of Troyes (Orient Forest) and was also friends of the Count de Gruy(ere) / it is important that general deGaulle retired near Clairvaux Monastery and the de Gruy Chateau as he was very devoted to the Merovingian kings (Dagobert) and considered restoring France to that heritage ( he flew the Templar Flag of Lorraine and a 50 ft high cross of Lorraine was erected near his house after he died / Fulcanelli was the owner of “the Bookshop of the Marvelous ” in Paris where all the Alchemists met plus my DeGruy ancestor who studied medicine in Paris and whose Foucher wife related him to Victor Hugo’s Foucher wife and we know Hugo saved Notre Dame Cathedral from destruction w/ his “Hunchback” books popularity ….\nFor those interested in my family history in the Orient Forest please see my daily Blog… /eugenerayarchitect.blogspot.com….ALSO you can google my past blogs via subject such as EUGENE RAY / SHROUD OF TURIN….EUGENE RAY / FULCANELLI  etc! etc\n\n","date":"July 15, 2015 at 2:51 pm","url":"https://shroudstory.com/2015/07/15/swipe-of-the-day/","cat":"art","title":"Swipe of the Day"}],"history":[{"author":"eugene_ray","post":"Anyone who hasn’t studied the vast Ray sur Soane\nData is wasting their time, please believe me !!!\nGoogle : Eugene Ray / Shroud of Turin\n\n","date":"December 1, 2015 at 6:41 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"author":"eugene_ray","post":"It was de Vergy my Gruyere ancestors who inherited the shroud\nDe Charney , her husband, was a famous French knight but he\nWas only Jeanne de Vergy’s husband / they built le Ray chapel !)\n\n","date":"May 29, 2015 at 8:50 pm","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","title":"Challenging the Othon de la Roche Story"},{"author":"eugene_ray","post":"Yes Plenty…! GOOGLE : EUGENE RAY / le Ray CHAPEL\nGOOGLE  : EUGENE RAY / SHROUD OF TURIN\nOur DeGruy(ere) / Vergy ancestors chateau Magny Fouchard\nWas located near the le Ray Chapel in the Orient Forest where Bernard de Clairvaux designed Knights Templar bylaws\nGOOGLE : EUGENE RAY / ORIENT FOREST\n\n","date":"May 30, 2015 at 2:07 pm","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","title":"Challenging the Othon de la Roche Story"},{"author":"eugene_ray","post":"For Hugh Farey….GOOGLE : EUGENE RAY / ORIENT FOREST. There is much important data easily found in blogs I have written over a ten year period…the Orient Forest has a vital history / it is where the original 9 Knights Templars originated plus St. Bernard de Clairvaux and several powerful Christian Families / my Verloin de Gruy(ere) (Vergy) ancestors chateau at Magny Fouchard…Counts de Gruyere married Vergy (as did last Habsburg H.R.E. Otto) Gruyere Counts to 5 Crusades close to Othon de la Roche de Ray / study my Blogs info it is not accidental that Gen. De Gaulle settled Orient Forest & flew Cross of Lorraine Flag as did Joan de Arc… Merovingian DNA / Priory de Sion play Roles w/ Templars / St Bernard ! Also finally the Savoy Dukes related to the Gruy(ere)-de Vergy-de Ray acquired the Shroud !!!\n\n","date":"June 2, 2015 at 11:01 am","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","title":"Challenging the Othon de la Roche Story"},{"author":"eugene_ray","post":"For Deveb of Wellington    De Vergy were the most powerful family in Burgundy w / many Castles . The Last Count de Gruyere died in a Vergy Castle / de Charney was a famed French Knight but remember de Charney was burnt at the stake near where the Shroud Plaque was found in the Seine River / the largest castle in a Burgundy was the deRay Castle at Ray sur Saone…it is still there  w/ the original wooden casket that held the Shroud ! Read “The Counts of Gruyere” on the internet / King Francois I cousin of the last Gruyere Count was a direct descendent of my de Bresse ancestors who became the Duke de Savoy and became custodians of the Shroud GOOGLE : EUGENE RAY  / DUKE de BRESSE\n\n","date":"June 2, 2015 at 11:21 am","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","title":"Challenging the Othon de la Roche Story"},{"author":"eugene_ray","post":"Tomorrow, June 5th, 2015 I shall publish my blog , eugenerayarchitect.blogspot.com devoted\nTo our French families many links to the Shroud Of Turin and to much else of French history..\nRemember it is the Orient Forest of our de Gruy(ere) ancestors where the Troyes Fraternity of Shroud Devoted families lived where the Knights Templars  / Priory de Sion of St. Bernard originated at Clairvaux Abbey, 15 kilometers from Magny Fouchard Chateau of the Gruy and the same distance from General de Gaulle who flew the Merovingian Flag Of Lorraine Cross and who actually considered returning France to a Merovingian (Charlemagne) Kingdom !!!\n\n","date":"June 4, 2015 at 3:28 pm","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","title":"Challenging the Othon de la Roche Story"},{"author":"eugene_ray","post":"I have published my blog on the history of The Shroud Of Turin in the Orient Forest of France\nAt the le Ray (Lirey) Chapel with the Troyes Fraternity (Templars, Priory de Sion) Bernard de\nClairvaux led families …of which our deGruy(ere) Chateau Magny Fouchard was the ancient\nCenter until it was destroyed in the First World War …study carefully the blog…you cannot be\nSerious researchers if you don’t SEE !  Eugenerayarchitect.blogspot.com… Remember I have researched this for longer then a decade.. The de Ray Castle at Ray sur Saone France\nHas a large Cross on the oldest Tower as a symbol of the importation of the Holy Shroud !\nThe wooden Shroud Casket inside is exactly the correct size of the folded Shroud…All of this is well documented French History and remember I have BEEN THERE about 40 journeys &\nStudied the work of many researchers..PLEASE STUDY MY FACEBOOK PAGE AS WELL !\nEugene Ray Architect ….there is much additional data linked to my career as a professor. &\nArchitect that was inspired by Genetic Memory of this de Gruyere / Bresse French History !\nYou cannot deny the history of the Shroud in the Orient Forest or the ultimate acquisition by\nThe Duke de Bresse de Savoy our direct ancestors (of my de Gruy & de Bresse ancestors)\n\n","date":"June 5, 2015 at 11:02 am","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","title":"Challenging the Othon de la Roche Story"},{"author":"eugene_ray","post":"It is obvious that Farey has a closed mind. I could refute his\nFive points easily but it would do no good / I shall not waste\nAny more time w/ him / I hope others shall look at my blog\nTomorrow that shall have expanded data (also Facebook)\n\n","date":"June 5, 2015 at 2:33 pm","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","title":"Challenging the Othon de la Roche Story"},{"author":"eugene_ray","post":"There is much evidence for the link of. Le Ray castle & Othon de la Roche of Ray Castle w/ the Shroud of Turin….Jeanne de Vergy, our ancestor inherited the Shroud of Turin from Othon de la Roche and married the great French knight de Charney bringing it to the Orient Forest where it was deposited in the le Ray (lirey) chapel they built for this preservation…\nALL DOCUMENTED DATA…. What else doe one need ? google : Eugene Ray shroud of Turin ….or Eugene ray : le Ray castle or Eugene Ray : Le Ray Chapel..\n\n","date":"May 29, 2015 at 5:23 pm","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","title":"Challenging the Othon de la Roche Story"},{"author":"eugene_ray","post":"Very interesting …however one fact is overlooked Jeanne de Vergy , direct descendent of\nOt Othon de la Roche de Ray who imported the Shroud to the de Ray castle, married the\nGreat French knight de Charney and together they built the leRey (le Ray) chapel…I have\nBeen there but the original chapel was wood….the chateau of my de Gruy ancestors now\nDestroyed  was a few miles from the chapel at Magny Fouchard France…they relate to\nThe history of St Bernard whose Abbey , Clairvaux is only 15 kilometers distant…\nPlease google the many blogs I have written about this history…..\nGOOGLE : EUGENE RAY. / SHROUD OF TURIN…..   Thank you …\n\n","date":"May 13, 2015 at 5:39 am","url":"https://shroudstory.com/2015/05/13/checking-in-on-mario-latendresses-sindonology-dot-org/","cat":"history","title":"Checking In on Mario Latendresse’s Sindonology Dot Org"}],"image":[{"author":"eugene_ray","post":"GOOGLE : EUGENE RAY / SHROUD OF TURIN\n\n","date":"June 3, 2015 at 1:14 pm","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?"}],"misc":[{"author":"eugene_ray","post":"Has anyone reviewed or responded to the amazing history of my de Gruy (de Gruyere)\nVergy linked ancestors in the Orient Forest near the le Ray (Lirey) Chapel w/ links to\nThe de Ray Castle  in Ray sur Saone France where the Shroud was imported by the\nVergy Ancestor , Orthon. De la Roche De Ray / google : Eugene Ray / Turin Shroud !\n\n","date":"May 17, 2015 at 5:43 am","url":"https://shroudstory.com/2015/05/17/sergio-mattarella-visit-to-the-shroud-exposition/","cat":"news_&_views","title":"Sergio Mattarella Visit to the Shroud Exposition"},{"author":"eugene_ray","post":"Thanks for your effort / in your retirement look into the ORIENT FOREST HISTORY and I believe you shall find as I did, a Radiant New Research / the Shroud still very important !\n\n","date":"December 15, 2015 at 6:57 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"}],"opinion":[{"author":"eugene_ray","post":"Please google my many blogs on my families associations w/ the Shroud of Turin in this manner…I am directly descended from the Troyes Fraternity Families who had the Shroud thus…..GOOGLE : EUGENE RAY / VERGY ( by marriage to my de Gruy(ere) ancestors\nGOOGLE : EUGENE RAY / SAVOY-BRESSE ( by DNA to my Ray ancestors ) study these\nThe Shroud was moved from the deRay Castle to Le Ray Chapel by Ray descended Vergy\n\n","date":"June 3, 2015 at 1:36 pm","url":"https://shroudstory.com/2015/05/31/screwy-1-crazy-2-ludicrously-odd-or-inappropriate/","cat":"other_blogs","title":"screw·y  1. crazy. 2. ludicrously odd, or inappropriate."}],"researchers":[{"author":"eugene_ray","post":"Dear Barrie,  for what it may be worth, my Verloin de Gruy ancestors are linked to the shroud of Turin importation and location at the Lirey ( LeRay) chapel in the Orient Forest / the Vergy family (w/ Chaney) were given the Shroud by the La Roche de Ray / eventually my de Bresse de Savoy ( de Gruyere link ) acquired the Shroud moving it to Chambery and Turin / I have written much about this on my blog…eugenerayarchitect.blogspot.com.   …Also you can google my blog essays thus : EUGENE RAY / SHROUD OF TURIN or\n                                                EUGENE RAY /  LERAY CHAPEL (Lirey)\n                                                 EUGENE RAY /  RAY CHATEAU\n                                                  EUGENE RAY / VERGY-CHARNEY\nMy de Gruy ancestors chateau in the Orient Forest were related to the Counts de Gruyere & the mother of the last count of Gruyere was a Vergy  ( same as the wife of the last Holy Roman Emperor, Otto Von Habsburg who died at 100 years 2 years ago… The de Gruy  chateau in the Orient Forest (Magny Fouchard) was destroyed in the 1st WW…\nMy email address is…eugeneray1932@gmail.com.  I am happy to answer questions /\nOur DeGruy Chateau was 15 K from St Bernard’s Clairvaux & Pres de Gaulles home\n\n","date":"September 6, 2015 at 9:40 pm","url":"https://shroudstory.com/2015/09/06/barrie-schwortz-to-speak-in-indianapolis-on-september-19/","cat":"presentation","title":"Barrie Schwortz to Speak in Indianapolis on September 19"},{"author":"eugene_ray","post":"I should have mentioned the important point that many don’t realize\nIs that the Orient Forest (Orient meaning Jerusalem) where the de\nGruy(ere) ancestors lived near Troyes was the Origins of  >Knights\n                 ST BERNARD DESIGNED TEMPLAR CODE\nTemplars< our de Gruy(ere) went to five Crusades and were deeply\nCommitted Knights Templars building the only dome sugar mill at\nNew Orleans / the Grand Orient ( first French ) Masonic Lodge was\nOriginated at their neighbors Chateau in the Orient Forest / google :\n                           EUGENE RAY / SAINT BERNARD\n\n","date":"September 7, 2015 at 9:51 am","url":"https://shroudstory.com/2015/09/06/barrie-schwortz-to-speak-in-indianapolis-on-september-19/","cat":"presentation","title":"Barrie Schwortz to Speak in Indianapolis on September 19"},{"author":"eugene_ray","post":"Note it is profound that the original 9 knights Templars came from the Orient Forest  (orient refers to Jerusalem) and that Saint Bernard’s monastery is located close to the de Gruy chateau Magny Fouchard and that Charles de Gaulle settled nearby and that Joan d’Arc crossed the Aube river near the Gruy Chateau…all of the above persona adopted the\nTemplar Cross…The CROSS OF LORRAINE !!! Used also by Otto Von Habsburg and\nI believe links w/ Merovingian Blood  History !\n\n","date":"May 8, 2015 at 3:09 pm","url":"https://shroudstory.com/2015/05/08/a-folding-method-charles-freeman-might-accept/","cat":"news_&_views","title":"A Folding Method Charles Freeman Might Accept"},{"author":"eugene_ray","post":"Please know that in the Ray Castle at Ray sur Saone France is the original wooden box that the Shroud  of Turin was brought from Constantinople in and one can find the size of the\nFolds by the size of the box….Also my Verloin de Gruy Ancestors Chateau Magny Fouchard\nWas located near the le Ray (Lirey) chapel south of Troyes where the Shroud was brought\nAfter our Vergy ancestor married the famed French knight de Charney…it is a fact that our\nDe Gruyere Ancestor,s (count Michael) mother was a Vergy as was the wife of the last\nHoly Roman Emperor , Otto Von Habsburg who died not long ago at age 100 with many\nSecrets of the Priory de Sion…I have written much about this history over the past decade,\nFirst for DeGruy Family history and now for my nightly blog based on my life & work….\nGOOGLE : eugenerayarchitect.blogspot.com.  (For my nightly blog)\nGOOGLE :  EUGENE RAY / SHROUD OF TURIN\nAlso\nGOOGLE :  EUGENE RAY /  KNIGHTS TEMPLARS  (the de Gruy were Templars )\nGOOGLE  :  EUGENE RAY /  RAY CASTLE\nAlso\nGOOGLE. :  EUGENE RAY /  ORIENT FOREST  (site of  DeGruy chateau , le Ray Chapel)\n\n","date":"May 8, 2015 at 2:57 pm","url":"https://shroudstory.com/2015/05/08/a-folding-method-charles-freeman-might-accept/","cat":"news_&_views","title":"A Folding Method Charles Freeman Might Accept"}]}
