{"resources":[{"id":"comment-210895","author":"father_simon","post":"Carlos Evaristo is a Portuguese Canadian historian and author. Carlos and his family were known to Sister Lucia and the sisters in St. Teresa’s Convent in Coimbra. Carlos was the official translator at meeting between Sister Lucia and Bishops and Cardinals from 1992 – 1993. During several of the interviews Sr. Lucia confirmed on video the validity of the Consecration that was made by Pope John Paul II on March 25, 1984. However Father Francisco Pacheco, who witnessed the meeting (1992), publicly disavowed the content of the interview published by Evaristo.[1] Pascheco’s sister a nun named Sister Lourdes Pacheco living in Fatima, Portugal, told Philip James Kronzer on film in the 2005 video documentary “The Fatima Priest or Satan’s Beast?” that her late brother had betrayed the truth and Sister Lucia in exchange for a cash payment from the late Father Nicholas Gruner. Previously Pacheco had given a talk to his blood sister’s religious community at Fatima the day after the meeting with the Fatima Seer and had related her answers to questions posed in almost identical terms as was recorded and publshed by Evaristo. This talk was tape recorded by the sisters who provided a copy of the tape for the Kronzer Documentary exposing the modus operandi of the suspended priest Nicholas Griuner and his fanatical cult. Seer Sister Lucia labelled both Pacheco and Gruner “liars” during an Octiober 11th, 1993 video taped interview broadcast on Portuguese television in March of 1998. She also praised Evaristo for his defence of the truth despite the attacks of Gruner and his cohorts. One of the interviews Evaristo conducted with the Seer was broadcast on Portuguese and Italian television stations for the purpose of public clarification following malicious attacks by Gruner and his Fatima conspiracy theorists. Carlos was the Director of the Castle Program in Ourem,Castle and appears frequently on radio and TV in Portugal and the USA when there are newsworthy programs broadcast on Fatima and Church related issues. Carlos is Curator of St. Stephen’s Church Museum in Santarem, the Shrine where the Most Holy Miracle of the Holy Eucharist occurred in the year 1247 and the Representative of the Vatican Museums Patron’s Office in Poirtugal.[2].","date":"2015-09-21","mins":"6:28 pm","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"}]}
