{"resources":[{"author":"francois_gazay","post":"Louis, I have not changed direction !,… I have only, with Mary Gazay, just translated into French the book of Helmut Felzmann “New Light on Jesus” (in German: “Neues Licht auf Jesus”). The French title of this translated book is “Nouvelle Lumière sur Jésus”.\n\n","date":"April 27, 2014 at 12:38 pm","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","title":"New Book: The Templar Mandylion"},{"author":"francois_gazay","post":"@all: Sorry but I could not discuss earlier your different remarks on the Mandylion stone that I discovered on a crucifix in Brittany. Here are my answers:\n@Mike M: The stone Mandylion of the Breton calvary has really the epsilon blood stain on the forehead as we can see on the Turin Shroud. Yes, it is a  highly suggestive proof that the Mandylion could be the Shroud folded in 8.\n@David Bowman:  Nowadays, the mark epsilon (E) is practically indiscernible on the stone Mandylion. I have underscored it by transfering to a tracing paper. Please see the result on the first image in page 6 of my report: http://www.cirac.org/Mandylion.pdf\n@daveb of wellington: The “3” sign on the forehead is the result of the TS photography. An “epsilon” -and not a “3” sign- is present on the stone Mandylion of the Breton Calvary. Consequently we can assert the sculptor has really seen a Shroud face with this typical sign when he has sculpted this stone Mandylion. He has sculpted this Shroud face in a landscaped frame probably because his model was presented in an unusual « landscaped » portrait surrounded by a thick and solid framework similar to the « Face of Edessa » or Mandylion.\n@Max Patrick Hamon: The Breton calvary in the Red-Cross Field (“Park ar Groaz ru”) is supposed to be of templar origin because first there is a part of a templar building (Chamber of Red Monks) closely near the calvary and secondly because the date of erection found on the calvary pedestal seems to be 1304 as explained on my report. This date was deciphered by photography and mainly by transfer to a tracing paper (copy available on demand). But, as you say, we can also supposed that it is a stone copy of a much older stone template dating back to the Knights !Templar ! In fact we have no formal proof.\n\n","date":"September 18, 2014 at 12:24 pm","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","title":"New Book: The Templar Mandylion"},{"author":"francois_gazay","post":"Please note my name is François Gazay and not your miswriting François Gaszay.\n\n","date":"September 20, 2014 at 8:35 am","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","title":"New Book: The Templar Mandylion"},{"author":"francois_gazay","post":"Have you visited this calvary? Have you tried to decipher this date by transfer to a tracing paper as I did and wrote in my report in 2005?\n\n","date":"September 20, 2014 at 9:23 am","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","title":"New Book: The Templar Mandylion"},{"author":"francois_gazay","post":"As I previously said the date of erection found on the calvary base ‘seems’ to be 1304. I deciphered this date mainly by transfer to a tracing paper (copy available on demand). I don’t understand your surprise concerning the date + sculptor’s initials ‘oXb’. This kind of combined inscriptions is often present on ancient monuments such as old calvaries, graves, etc.\n\n","date":"September 20, 2014 at 9:30 am","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","title":"New Book: The Templar Mandylion"}]}
