{"resources":[{"author":"frau_bo","post":"At first: The term Byssus is also used for normal linen in ancient time. Today the oldest fragment is from the 14th century. Maybe there was one from the 4th century, but the fragment and all scientific notice was destroyd during World War II. At second: It is not possible to identify see-silk without making a physical cross-section. Please consult: http://www.muschelseide.ch/en.html\n\n","date":"July 18, 2015 at 5:28 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","title":"Christian Faith Eroded to the Very Core?"},{"author":"frau_bo","post":"Why…why is here an articel about Badde and the Veil of Manoppello? There were some strange things about the “sientific” examinations. Some fibres were taken from the frame by Sr. Blandina Schlömer. If there was ever an examinination, then they didn´t make it public. Badde gave the information,that these fibers are given to Benedikt XVI as a gift. If you want more information about Byssus, please consult: http://www.muschelseide.ch/en.html .There are also many hints, that this is only a picture. And sorry, but no good artist made it. It´s not an acheiropoietos and the only link to the shroud could be, that the painter tried to construct the face from the shroud…maybe. The hype about the Veil of Manoppello is really dubious.\n\n","date":"July 18, 2015 at 5:19 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","title":"Christian Faith Eroded to the Very Core?"},{"author":"frau_bo","post":"O.K. They had fibres and it was also in discussion to analyse these by an institute in Berlin (Bundesanstalt für Materialforschung). It was 2007, when Blandina Schlömer made a microscopical comparing between her fibers, which she took from the frame on Black Friday 2007. Her comparing material were 1. see-silk from Antiochia (year 2000), 2. see-silk from Taranto (year 1840), 3. see-silk from a mummy (1000 B.C.). And – blessed be the Lord – all four fibres were see-silk! The Problem ist, that a see-silk fragment from 1000 B.C. would be a scientific sensation. In 2010 a German community (Penuel e.V.) asked Badde about a scientific result an got the answer, that it was taken into a ostensorium and given to Benedeikt XVI by Paul Badde (sic!). Great! Since 2006, when the pope visited Manoppello,  there was “no return”. On the example of Manoppelo we can examine, how relic fakes are made today and were made in older times :-).\nMy problem with Manoppello is, that this event make it harder, to realize that there, could be true relics. And the Shroud of Turin is the most fascinating of all.\n\n","date":"July 19, 2015 at 10:22 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","title":"Christian Faith Eroded to the Very Core?"}]}
