{"image":[{"author":"gabriel_from_spain","post":"I would make a distinction between the flowers and the rest of objects and/or written letters. The reason for that is the the flowers were detected and recognized directly on the Shroud by the israeli expert Avinoam Danin when he personally had the opportunity to analize the shroud. During a private conversation with him at a conference I asked him whether the type of flowers he had identified had any special quality like nice smell or any other. He answered that to the best of his knowledge, they didn`t. Someone asked him whether they had any special meaning in the frame of a 1st Century jewish burial ritual. The answer again was the same. However, they seem to be there. The explanation migh be that those flowers could have been at the feet of the cross and perhaps were soaked with blood from the man being crucified. If so, according to the jewish tradition those flowers had to be incorporated into the tomb because the whole body -including the blood in the flowers- should await for the resurrection on the Last Day.\nA different issue is the coins, letters and rest of things that cannot be identified at first sight. Until HAl9000 images are released and analyzed I tend to think that they are artifacts. However, coming to the point of how strong was the importance of Greek culture on 1st Century Jews and their customs (coins on dead eyes, for example) it seems clear that some of Jesus`s disciples were fluent in Greek and some of them like Philip or Andrew bore greek names. Most probably, they were bilingual (aramaic-greek) and Jesus perhaps could also make his way through Greek, if not completely fluent too. SOme experts consider that the dialogue with Pilatos most probably took place in Greek since no translator is mentioned. With this I suggest that finding two coins on a dead body`s eyes would not be surprising since the Greek culture was strongly present everywhere in the 1st Century Israel. However, I agree that the main difficulty for the coins is the process used to “discover” them.  If ever released, HAL9000 images will throw light on this issue.\n\n","date":"October 19, 2011 at 11:57 am","url":"https://shroudstory.com/2011/10/19/comment-promoted-of-coins-and-flowers-and-more-on-the-shroud-of-turin/","cat":"image_theory","title":"Comment Promoted: Of Coins and Flowers and More on the Shroud of Turin"},{"author":"gabriel_from_spain","post":"I basically agree BUT I think that it is necessary to make a distinction between the issue of the flowers and the rest (coins, spounges and son on). The flowers were identified with the naked eye by an expert (Avinoam Danim, if you don’t know his CV or his work, just Google him) when examining directly and personally the Shroud. Coins, spounges and the rest have been identified using very dubtious and non reproducible methods based on images.\n\n","date":"October 21, 2011 at 6:20 pm","url":"https://shroudstory.com/2011/10/21/there-is-an-image-of-a-flying-saucer-on-the-shroud-of-turin/","cat":"news_&_views","title":"There is an Image of a Flying Saucer on the Shroud of Turin"},{"author":"gabriel_from_spain","post":"I have been thinking about the points raised here and still I think that the issue of the flowers is a completely different matter. Though I agree with the main sequence of logically linked events for a quick burial on Friday evening ,AND following the rationale on how everything could happen, I think that :\n1.As I mentioned in a previous post, flowers were incorporated into the tomb because they were soaked with blood from the crucified man. Not for any other reason.\n2. The Shroud was NOT wrapped around the body, which would need more time. A linen sheet was laid on the rock, the body was put over it and the other half of the sheet was put on the body. Very easy. This is compatible with a provisional and quick burial on Friday\n3. The flowers were left around the body and together with, because due to the blood they held, for the Jewish conception they WERE PART of the body. \nRegarding the coins and the rest I agree with the main considerations I have read so far in this blog\nhttp://www.ShroudPlantBook.com.\nhttp://www.shroud.com/danin2.htm\n\nhttp://www.shroudplantbook.com/\nRegards\n\n","date":"October 22, 2011 at 4:29 pm","url":"https://shroudstory.com/2011/10/21/there-is-an-image-of-a-flying-saucer-on-the-shroud-of-turin/","cat":"news_&_views","title":"There is an Image of a Flying Saucer on the Shroud of Turin"}]}
