{"history":[{"author":"gail","post":"I too bought a copy of the book and can’t wait to read it. I agree that the caustic remarks being hurled here are really childish and uncalled for. Most of the negative comments posted here do sound like someone has a vendetta against John Lupia. Anyway I do really look forward to reading this book and might post after I read it. \nGail\n\n","date":"March 12, 2010 at 9:32 pm","url":"https://shroudstory.com/2010/02/02/the-gibson-study-really-says-nothing-about-the-shroud-of-turin/","cat":"history","title":"The Gibson Study Really Says Nothing About the Shroud of Turin"}],"resources":[{"author":"gail","post":"I think you ought to read John N. Lupia, The Ancient Jewish Shroud At Turin (Regina Caeli Press, 2010)\nI ordered this book somewhat reluctantly because all Shroud books make the same redundant claim to new discoveries, the mystery solved, and so on, but this book really delivers what it claims. When you are buying books today you have watch what you spend them on and have no regrets. You will not regret you bought this book. This is a very remarkable and extraordinary book unlike any other book I read on the Shroud of Turin, which typically repeat the same old information in a new way. This book is radically different since it essentially presents new evidence to identify what the Shroud of Turin really is, an ancient Jewish tallit garment. The author is a real scholar who knows his stuff and presents every detail and evidence as you go along.\nThe author begins by narrating his forty-year search to understand the nature of the Shroud archaeologically. He shows his own thinking process about it over the years and how new facts continually changed his view until he arrived at his definitive conclusion. His discovery of the Jewish tallit design called the Shepherd’s coat led him down the trail of clues that it is a modern version, basically a half-length pattern design, of the ancient Jewish tallit that Jesus wore. His explanations and mock-up replica of the Shroud of Turin with their illustrations that demonstrate this are very convincing and strengthen his argument.  He then explains that the side strip is not original to the Shroud but added on during the time of the Apostles. His arguments for this are based on the dislocation of the armholes on the Shroud to the selvage by 2 cm with the new side strip. He also points out the side strip could not have been original because the tallit is a\nseamless garment mentioned by St. John in his Gospel and would have been only a 6 cm strip cut or torn off at burial as customary.\nThe key to his argument is the identification of the sindon with the tallit, first made by John Lighfoot in 1653. This same identification of the sindon with the tallit is made by the Jewish scholar Marcus Jastraw. Since the ancient Jewish tallit form was not known in the 17th century it could not have been a medieval forgery as the C-14 dating test reported in 1988. The fact that the Shroud can be shown to be an ancient Jewish tallit demolishes the 1988 C-14 dating and opens up the question of what went wrong. He suggests that the C-14 dating done in 1988 did not take several important considerations into account that he explains in the book including atmospheric contamination, carbon soot contamination possibly from medieval stitching, and elevated C-14 levels caused by the fire in 1532.  He also thinks that a new C-14 dating test is ill advised because the causes are still present that skewed the 1988 test results.\nThe second chapter delves into a detailed description of the Shroud and continues the question of identification as an ancient Jewish tallit showing that first century Jews were buried in them. He also points out that the tallit began to undergo design changes around A.D. 66 and none of these changes are found on the Shroud suggesting it dates earlier. The photograph of the man wearing the Shroud mock-up replica is very compelling evidence that will convince even the hardcore skeptic.\nThe third chapter deals with ancient garments and shows how the Shroud of Turin, an ancient Jewish tallit, fits into the scheme of ancient textiles garments in antiquity.\nThe fourth chapter deals with sizes of ancient garments and shows the Shroud of Turin is consistent with what we should expect to find.\nThe fifth chapter deals with the tallit and its different functions as a garment, a bedsheet, and burial shroud.\nThe sixth chapter explains how the tallit is torn or cut at burial so that the fringes or tassels in each of its four corners are removed. This was done to the Shroud when strips of cloth were torn off its width at both ends taking these tassels with them, and the long strip replaced by the current side strip. These three strips are identified as the keiriais mentioned in the burial accounts in the Gospels.\nThe seventh chapter deals with the writings of St. John Chrysostom who describes the burial linen of Jesus as torn or cut at burial consistent with the entire identification of the Shroud as Jesus’ personal tallit.\nThe eighth chapter deals with the Greek text of the New Testament showing the choice of words carefully selected by the Evangelists all refer to the same thing, the tallit. The theme in the Gospels is that Jesus was wearing his tallit during the Passion and stripped of his garments at crucifixion. Among these is the garment without seam, Jesus’ personal tallit. This was won at a dice game by Roman soldiers and was purchased from the soldier who won it by Joseph of Arimathea. All the Gospels use Greek precise words that describe the tallit before and after the tassels are removed. Also, the Gospels refer to the linen strips cut or torn off the Shroud to wrap the body as mentioned above, keiriais.\nThe ninth chapter discusses the manufacture of the Shroud fabric as a mixture of cotton and linen and that this type of linen thread was known in antiquity.\nThe tenth chapter discusses how the seamless garment was depicted as Jesus burial garment in Byzantine art and gives further evidence that the early church kept this iconography alive.\nThe conclusion is the summary of salient points and it sums up the case in identification of the Shroud as an ancient Jewish tallit. It is an amazing book that will excite any ready to see that the Shroud of Turin is Jesus’ personal tallit garment that it contains the image of him crucified, a notion that once it sinks in gives you goose-bumps. I highly recommend this book to anyone interested in the Shroud of Turin including skeptics, enthusiasts and the curious. I rate it 5 gold stars.\n\n","date":"March 20, 2010 at 3:30 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"}]}
