{"resources":[{"author":"george_walter_bratcher_iii","post":"Joe Marino:Point #1: They actually have burial cloths from Masada and their hearing bone weave patterns match that of the shroud of Turin, and they date to their first century, so yes, a cloth could have lasted that long.Point #2: You are forgetting the Sudarium of Oviedo which covered the face of Christ and is also from the 1st century and has lasted this long – see also http://youtu.be/XsR1_gXQNYo & http://youtu.be/jJBd_xqMlikPoint #3, 4, & 5:  Sorry Leonardo Da Vinci couldn’t have produced what we cannot do today.  To reproduce the image on the shroud of Turin, we would have to crucify a man, and flog him mercilessly, and then wrap him in a Shourd using 1st century herring bone weave pattern technology on papyrus spun linen to reproduce the burial cloth, and then we would need to have a double sided scanner to scan a body in a weightless environment such as space, say aboard a space shuttle or space station, then after we scanned the body, on earth we would need to send data to a laser printer into which feed the a burial shroud and have the lasers scorch in dot-matrix pattern, the top two micro-fibers, not threads, for there are hundreds of fibers in one thread, but just the top two micro-fibers, so we could have a 2D negative image that shows up as a positive on camera developed film, and then be able to yield gigabytes of information to obtain the images seen on the History Channel of the real face of Jesus.  Sorry, but even Leonardo wasn’t that smart, or we’d be travelling beyond our solar system now instead of just having traveled to the moon.Point #6 – See points 3, 4 & 5, but also see – http://www.greatshroudofturinfaq.com/Crazy/darcis.html:A French bishop, Pierre d’Arcis, was trying to stop and exhibit of the Shroud. He drafted a letter to the pope claiming that an artist had confessed to painting it. Not many people took him seriously then. Not many historians do not take him seriously today. Several documents have been discovered that challenge both his honesty as well as his motives. Pilgrims were the problem. Rather than visiting his cathedral in the city of Troyes, France, they were visiting the small church in Lirey to see the purported burial shroud of Christ. And that is where they were spending their money. Money was needed for ongoing construction on the cathedral. There were shrines for four saints, although, admittedly, no one seemed to know who two of them were. Troyes was famous as the founding city of the by then outlawed Knights Templar. Though Pierre was possibly not the first to challenge the authenticity of the Shroud, he certainly wasn’t the last. The document is still referenced by skeptics even though its contents are suspect; even though it has now been scientifically proved that the Shroud was not painted.Point #7: You haven’t done any research yourself, which is obvious, therefore here are some reference points for research:http://www.youtube.com/user/KringleOfBorg#grid/user/AE6F3BCB32692FA5http://www.shroudofturin4journalists.com/http://www.shrouduniversity.com/Point #8:  The Shroud of Turin was linen spun from papyrus.  Los Alamos labs proved the samples taken for the carbon dating were cotton – which proves the theory of a repair weave.  Also see: http://www.greatshroudofturinfaq.com/History/Greek-Byzantine/Time to pull yourself into the 21st Cenutry Joe.","date":"June 13, 2011 at 12:40 pm","url":"https://shroudstory.com/2011/03/23/a-review-the-fallacy-of-god-a-religious-conspiracy/","cat":"books","title":"A Review: The Fallacy of God: A Religious Conspiracy"}]}
