{"archaeology":[{"author":"george_weis","post":"\n\nWell done Stephen!I thank you for continuing this work.Your collection of knowledge on this subject is wonderful, and I have used it more than one time to talk about Christ. Again, this is not the basis of my own faith, but it is what I like to think of as a nice little evidence trail pointing to the Messiah.Belated Christmas blessings to you and yours,-g-\n\n","date":"December 27, 2009 at 10:24 AM","url":"http://theshroudofturin.blogspot.com/2009/12/burial-shroud-proves-turin-shroud-not.html","title":"\nBurial shroud proves Turin Shroud not from 1st century C.E. Jerusalem?\n"},{"author":"george_weis","post":"\n\nStephen, I have also been able to share this with many Christians... often I receive rather strange looks when I talk about it. It seems as though many Christians today of a variety of camps, think that something so fantastic is very questionable. But from my viewpoint, the same Lord that was raised to life, could certainly allow for such a blessing to be deposited in a physical form. He is just that wonderful to us!Still others do receive it well, and it is so enjoyable to see their eyes light up. This item is good to think on. With all the overwhelming evidence, it only furthers the delight I have in Christ. He is worthy of our praises!Blessings and peace,-g-\n\n","date":"December 28, 2009 at 3:37 AM","url":"http://theshroudofturin.blogspot.com/2009/12/burial-shroud-proves-turin-shroud-not.html","title":"\nBurial shroud proves Turin Shroud not from 1st century C.E. Jerusalem?\n"}],"researchers":[{"author":"george_weis","post":"\n\nStephen,I stop back here from time to time... I have you linked on my own blog. This was such a good collection of articles and thoughts.I love how this one takes a nice swing at the silly claim of the JW claim. One wonders what in the world they are thinking sometimes. Along with the Mormon claim, this is such a house of cards that any study, be it Theological, historical and in this case scientific will blow a mighty wind a knock the house over.Thank you for continuing to update us on what you find about the Shroud. I like you am thoroughly convinced of it's authenticity. What more does a person really want to convince them? My faith doesn't rest on it, but it certainly backs up my faith.Blessings to you in the name of Christ,-g-\n\n","date":"May 11, 2009 at 5:30 AM","url":"http://theshroudofturin.blogspot.com/2009/04/re-shroud-of-turin-evidence-that-jesus.html","title":"\nRe: The Shroud of Turin: Evidence that Jesus was crucified on a cross, not a stake\n"},{"author":"george_weis","post":"\n\nBrother,I had the opportunity to enlighten someone the other day... and some new evidence you have provided on here helped me out quite a bit. funny thing was, this fellow was Catholic and didn't know about the shroud.I think it may have pushed His faith forward.I love this blog, I wish you had the time to crank more out... I love your commentary and reports.Blessings in Christ our risen Lord,-g-\n\n","date":"June 22, 2009 at 9:03 AM","url":"http://theshroudofturin.blogspot.com/2009/04/re-shroud-of-turin-evidence-that-jesus.html","title":"\nRe: The Shroud of Turin: Evidence that Jesus was crucified on a cross, not a stake\n"}]}
