{"art":[{"author":"gerard","post":"Thanks Dan.I have seen that thread. It’s not what I’m hoping to find.I would like to see a crucifixion sculpture of Christ on the cross but modelled on the man in the Shroud.It seems there is no such sculpture anywhere, which surprises me.","date":"September 27, 2013 at 11:36 am","url":"https://shroudstory.com/2013/09/24/what-did-jesus-look-like-2/","cat":"art","title":"What did Jesus look like?"}],"dating":[{"author":"gerard","post":"This “hypothesis” is nonsense. Period.","date":"March 14, 2014 at 7:14 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","title":"The Computer Hacker Hypothesis is Short on Factual Material"},{"author":"gerard","post":"Stephen,I hadn’t been back to this thread so I didn’t see you reply to me. Apologies.I still can’t believe the KGB or anyone would care what the result was. It just wasn’t that important to them. The only thing I take from this is:“Each of which had the same AMS C-14 dating system.”Something I hadn’t realised before.That explains why the got the same results and casts even more doubt on the result.3 labs using material taken from the same place using the same dating system is hardly rigorous.","date":"March 18, 2014 at 9:32 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","title":"The Computer Hacker Hypothesis is Short on Factual Material"},{"author":"gerard","post":"Stephen, in 1988, no one even knew what the internet, or a computer virus, or hacking was.The 3 labs were 1000’s of miles apart, the machines were not “online” in any way so as to be “hacked” locally or any otherwise. I doubt there would have been any interface capable of transfer of the data let alone able to input a “hack”.I’m sure the Labs would have taken great care to protect, test & calibrate their equipment considering the subject of the test & what was at stake.I stick by the nonsense statement above.Apologies if I am being blunt.","date":"March 14, 2014 at 8:56 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","title":"The Computer Hacker Hypothesis is Short on Factual Material"}],"image":[{"author":"gerard","post":"I’ve often wondered about this lack of image.My thoughts are a napkin that is tied under the chin-a chin band- that covered the top of the head.Another possible explaination is perhaps “the other cloth” mentioned in the gospel was placed at the top of the head.This lack of image is an area that has been largely uninvestigated.","date":"January 15, 2014 at 7:26 am","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"author":"gerard","post":"My theory is that the “other cloth” mention in gospel of John was placed at the top of His head thereby blocking any image formation.","date":"February 28, 2014 at 3:55 am","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"author":"gerard","post":"Chris.  They aren’t. I don’t have access to any kind of measure but it’s more than that.Someone’s seeing a water mark & other non image features & making assumtions","date":"February 28, 2014 at 4:51 am","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"author":"gerard","post":"“And for those who would be tempted to think it could be the result of a supernatural scorch that would have come at the time of the Resurrection of Jesus, the simple fact that the blood on the cloth has not been damaged at all by the image formation process is enough to reject that possibility.”Assuming then that the image forming process was destructive?","date":"March 14, 2014 at 8:42 am","url":"https://shroudstory.com/2014/03/14/two-comments-promoted-colin-berry-has-cracked-the-shroud-enigma/","cat":"image_theory","title":"Two Comments Promoted:  Colin Berry Has Cracked the Shroud Enigma?"},{"author":"gerard","post":"Excellent! Now that Colin has solved this can we expect him to move onto something else?Apologies, but I think Colin is about as scientific as Mythbusters.","date":"March 14, 2014 at 8:24 am","url":"https://shroudstory.com/2014/03/14/two-comments-promoted-colin-berry-has-cracked-the-shroud-enigma/","cat":"image_theory","title":"Two Comments Promoted:  Colin Berry Has Cracked the Shroud Enigma?"},{"author":"gerard","post":"When Colin can produce a whole shroud as convincing as the one in Turin I’ll believe his science.","date":"March 14, 2014 at 11:40 am","url":"https://shroudstory.com/2014/03/14/two-comments-promoted-colin-berry-has-cracked-the-shroud-enigma/","cat":"image_theory","title":"Two Comments Promoted:  Colin Berry Has Cracked the Shroud Enigma?"},{"author":"gerard","post":"Because it’s a miracle.How do we know ther’s no image on the sudarium of ovedio?There might be some form of image on it that isn’t readily discernable.Thoughts?","date":"March 21, 2014 at 9:20 am","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","title":"So then, why is there an image?"}],"misc":[{"author":"gerard","post":"Blessings to all this Christmas.Especially our host Dan who never seems to sleep","date":"December 24, 2013 at 10:46 pm","url":"https://shroudstory.com/2013/12/24/merry-christmas/","cat":"news_&_views","title":"Merry Christmas"}],"opinion":[{"author":"gerard","post":"Thankyou for the Insult Kit.It will come in handy.And, while I’m here… Merry Christmas & God bless All!","date":"December 9, 2013 at 2:30 pm","url":"https://shroudstory.com/2013/12/08/hurting-peoples-feelings/","cat":"other_blogs","title":"Hurting People’s Feelings"},{"author":"gerard","post":"Agreed. After watching his video. Absolute nonsense.","date":"December 25, 2012 at 7:44 am","url":"https://shroudstory.com/2012/12/23/this-is-the-sort-of-thing-that-hurts-the-reputation-of-shroud-science/","cat":"other_blogs","title":"This is the sort of thing that hurts the reputation of shroud science"}],"researchers":[{"author":"gerard","post":"I listened to the entire 2hrs and enjoyed it. Barrie covered most of the conceivable arguments and explained his answers well. Succinct and to the point.Certainly worth a listen if you are interested in the shroud but can’t be bothered wading through reams of scientific reports.","date":"January 14, 2013 at 8:39 am","url":"https://shroudstory.com/2013/01/10/barry-schwortz-on-grok-radio/","cat":"news_&_views","title":"Barry Schwortz on Grok Radio"}],"resources":[{"author":"gerard","post":"This may also go someway towards explaining why Jesus did not survive long on the cross. If He was partially paralysised He would not have been able to pull Himself up to breath.Louis, that movie over did it. The scourging scene does not reflect the the injuries visible on the TS. I believe, except for the crown of thorns & spear wound, Jesus got the standard Roman crucifiction, horrible as it was.","date":"May 8, 2014 at 11:24 pm","url":"https://shroudstory.com/2014/05/08/breaking-news-new-injury-details-seen-on-the-shroud-of-turin/","cat":"article","title":"Breaking News:  New Injury Details Seen on the Shroud of Turin"},{"author":"gerard","post":"First of all greetings everyone and a very merry and traditional Christmas to all.I have been a Shroudie since I was 10 yrs old. I have read or watched just about all the many papers, books and film on the subject. Yannick, to me your argument is“(The image is) OBVIOUSLTY THAT OF JESUS DEAD AFTER HIS PASSION. Where do you see signs of life (glorious or not) there???”Why could not the moment of resurrection record the state of the corpse? Perhaps at the moment of dematerialisation? The image on the cloth shows a dead body.The image exists because of the resurrection event. Science has proven the first but so far has not disproven the second.Is it wrong to believe this?","date":"December 24, 2012 at 3:46 pm","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"author":"gerard","post":"Yannick, nobody knows what a resurection event looks like. Any natural process known might leave an imprint from a body but what about the hair? A natural process also eminating from the hair? What about the time needed for a natural process? If a natural process left an imprint, how could it be a photographic negative in 3D?Is there any other known example? No.By a process of elimination we get to the only other explaination. A miracle.","date":"December 26, 2012 at 11:16 am","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"author":"gerard","post":"The Jospice mattress image was created while the poor man was still alive was it not?Over an extended period as he was left in the same position.I think most agree that the man of the Shroud is deceased?","date":"December 28, 2012 at 12:06 pm","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"author":"gerard","post":"Max, no one told me.I’m just re-acquainting myself with the Jospice mattress. Described by the priest as a surface phenomena just like the Shroud. Les’ position was changed at 5.25am and he died at 5.55am. His body was washed and removed by 11.00am.Btw I got Ian Wilson’s 2010 The Shroud for Christmas but haven’t got through it yet. Presume there is mention of it as the was in The Blood and…Actually, don’t tell me. I want enjoy a good read. LolAnd, just on a general point. I know the subject of the Shroud can be very emotive. Please don’t misconstrue anything I might write. I find I’m not as good as some people in getting my point across via a keyboard. I tend not to be as good at it as say arguing my position in person and so tend to go directly for the salient point and not beat around the bush as mostly I deplore typing because I’m so bad at it. In the time it’s taken me to type this I could’ve written a book with a dictaphone. Kindest always, to everyone.","date":"December 28, 2012 at 7:46 pm","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"author":"gerard","post":"Can you link to your article for me please Louis?","date":"December 28, 2012 at 8:46 pm","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"}],"sudarium":[{"author":"gerard","post":"Well, I hate to pour cold water on this, and, don’t get me wrong, I do believe the Shroud of Turin is the burial cloth of Jesus, and, I would like to believe that the Sudarium of Ovedio is the face cloth, but, I’ve read most of Mark Guscin’s papers & watched this video and I don’t think there is an arguement here that will convince any sceptics.He makes his presentation and puts out a statement like it shows x and y but doesn’t provide any compelling data to back up his hypothesis.I want facts or details that I can shred with Occams Razor and then use to beat sceptics about the head with. I don’t think it’s here. No one else has reviewed his findings or done a seperate study on the stains that I’m aware of. Please do correct me if I’m wrong, but spooky music and half hearted searches don’t do it for me.","date":"April 24, 2013 at 1:04 pm","url":"https://shroudstory.com/2013/04/23/new-video-on-the-sudarium-of-oveido/","cat":"news_&_views","title":"New Video on the Sudarium of Oveido"},{"author":"gerard","post":"And, A little point to clarify after I read back my post.I don’t wish to imply that Mark is in any way a crackpot. I just wish he presented a stronger arguement.If this is the head cloth then they each corroborate each other and are thus almost irrefutable.","date":"April 24, 2013 at 1:11 pm","url":"https://shroudstory.com/2013/04/23/new-video-on-the-sudarium-of-oveido/","cat":"news_&_views","title":"New Video on the Sudarium of Oveido"}]}
