{"art":[{"author":"gian_marco_rinaldi","post":"In an article I published some years ago, I gave this example of Campin and two more examples of transparent veil.\nFlemish School, 15th Cent., Bourg-en-Bresse (look below the hands to see how much it is transparent):\n\nMichael Wolgemut, 15th Cent., Lorenzkirche Nürnberg\n\nwhich is a detail from this painting\n\nWe can only conclude that among countless artists who painted a not transparent Veronica veil, there were just a few who painted a trasparent veil, among them the author of the Manoppello veil.\nA question for O.K.: How do you know that the Rome Veronica was transparent? Nobody knows what it looked like. The painters who painted a Veronica (at least those who painted before ca. 1600), as far as we know, had never seen the (supposed) original that was in Rome. They painted out of their fantasy and according to their own style. The one painter who might have had a chance to see the original was Ugo da Carpi who in 1525 painted this Veronica just for the altar (in old St. Peter) where the Veronica itself was kept.\nhttp://veronicaroute.com/1525/04/29/1525-ca/\nBut there is no proof that Ugo had really seen the original. Possibly he copied the face from a mandylion-like portrait that also was in Rome. At any rate his Veronica is not transparent.\nUgo was copying from a contemporary drawing by Parmigianino which is shown at the end of the same webpage. He reproduces the drawing faithfully but changes the face of Christ, and rightly so, whether he had seen the original or not, because the style of Parmigianino was not compatible with a Veronica that should have been in Rome since several centuries and therefore had an earlier style. Neither the Manoppello painting is compatible.\n\n","date":"December 17, 2013 at 2:15 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica."},{"author":"gian_marco_rinaldi","post":"O.K., you can find English translations on the web, for example here (search for the word Luther):\nhttp://www.mutualart.com/OpenArticle/A-Point–Ceaselessly-Pushed-Back—The-O/36D330CF8CEF6AB6\nor in the book “Life of Luther” by Sears, p. 144, available on Google Books.\nThe word “Klaretlin” is practically unheard of in German, apart from that sentence by Luther. In very few examples I have found, German authors who refer to that passage, may intend it as a piece of cloth without specifying that it should be transparent.\nAdd to it that Luther was writing in 1545 and had been in Rome many years before in 1510. He was not so much interested in giving a precise description as to discredit the cult of the Veronica. As far as I know, in the course of centuries there have been no statements by first-hand witnesses who testify a transparent veil and the words of Luther, whatever they mean, taken alone have little weight.\nIf you like transparent Veronicas, you find several examples in this page from a rich website:\nhttp://veronicaroute.com/tag/velo-trasparente/\nI do not worry about the words of Pfeiffer or Badde or Gaeta. They believe that the Manoppello veil was produced by a miracle 2000 years ago in a sepulchre in Jerusalem. May I think that the portrait is not beautiful enough for being a miracle?\n\n","date":"December 18, 2013 at 8:23 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica."},{"author":"gian_marco_rinaldi","post":"Imagine a man with a brush who put a stain “circa” where painters of his day put it. He would be amused in learning of your discussions.\n\n","date":"February 25, 2015 at 1:07 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","title":"Maybe the Nails Didn’t Go Through the Wrists"},{"author":"gian_marco_rinaldi","post":"One cannot but agree with Hugh Farey. If his examples are not enough, here are some more.\n\nhttp://www.getty.edu/art/gettyguide/artObjectDetails?artobj=3409&handle=li","date":"June 14, 2014 at 2:29 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"author":"gian_marco_rinaldi","post":"Heimburger: “Therefore, the lower rectangle can not be a representation of a sarcophagus.” If so, where is the sarcophagus? This it the scene of the women at the sepulchre. All similar scenes, besides the women and the angel, show the sarcophacus with its lid variously displaced if not absent (the tomb may have a different form in the Byzantine area or in various periods, but a tomb there must be),\n\n","date":"March 8, 2015 at 3:52 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"gian_marco_rinaldi","post":"Here is the source for Luther: “Wider das Papsttum zu Rom vom Teufel gestiftet” (1545). The sentence is:\n“… gleich wie sie mit der Veroniken auch thun, geben für, es sei unsers Herrn Angesicht in ein Schweistüchlin gedruckt, Und ist nichts, denn ein schwarz bretlin viereckt, da henget ein klaretlin für, darüber ein anders klaretlin, welches sie auffzihen, wenn sie die Veronica weisen, Da kan der arm Hans von Jene nicht mehr sehen, denn ein klaretlin für eim schwarzen bretlin, Das heisst denn die Veronica geweiset und gesehen, und hie ist grosse andacht, und viel Ablas bey solchen ungeschwungenen Lügen.”\nO.K. may indicate the words where Luther speaks of a transparent veil. I cannot find them. At any rate, Luther’s passage cannot be ranked as a first-hand testimony.\n\n","date":"December 17, 2013 at 10:32 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica."}],"coins":[{"author":"gian_marco_rinaldi","post":"You in America discuss whether the lituus is vertical or horizontal. Here in Italy, some sindonologists have seen the lituus as bent to the left, others as bent to the right. I don’t see any lituus at all!\nI have published an article about the coins on the eyes, but it is in Italian. It is here, in case somebody tries to avail of Google Translate:\nhttp://www.cicap.org/new/articolo.php?id=273767\n(Clic on the figures to enlarge.)\n\n","date":"October 27, 2011 at 3:02 pm","url":"https://shroudstory.com/2011/10/27/an-excellent-analysis-of-the-coins-on-the-eyes-issue/","cat":"news_&_views","title":"An Excellent Analysis of the Coins-on-the-Eyes Issue"}],"dating":[{"author":"gian_marco_rinaldi","post":"“I suspect it is Louis’ cloak”. Yes,according to the Nature 1989 report, 2575 = sample 1 (Turin), 2574 = sample 2 (Nubia), 2576 = sample 3 (Thebes), 2589 = sample 4 (Provence). The last one is missing from the photos. All four samples are in the data file.\n\n","date":"June 8, 2014 at 3:32 am","url":"https://shroudstory.com/2014/06/07/1988-pictures-and-details-from-oxford/","cat":"carbon_14_dating","title":"1988 Pictures and Details from Oxford"},{"author":"gian_marco_rinaldi","post":"One cannot compare the dating of the Shroud with the dating of a 30,000 years old wood remain.\n\n","date":"October 4, 2014 at 5:36 am","url":"https://shroudstory.com/2014/10/04/an-abstract-for-today/","cat":"carbon_14_dating","title":"An Abstract for Today"},{"author":"gian_marco_rinaldi","post":"From the data file, one can see that the total weight of the three subsamples for the Shroud is 46.8 mg, that is slightly less than the original weight of the sample. (The slight loss is probably due to the pretreatment with petroleum ether.) Therefore all the available textile was used for the dating procedure and no reserve was left.\n\n","date":"June 8, 2014 at 4:28 am","url":"https://shroudstory.com/2014/06/07/1988-pictures-and-details-from-oxford/","cat":"carbon_14_dating","title":"1988 Pictures and Details from Oxford"},{"author":"gian_marco_rinaldi","post":"Hugh: “it is clear that it is the right foot whose imprint is on the shroud”. Of course.\n\n","date":"October 20, 2013 at 8:09 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"author":"gian_marco_rinaldi","post":"Consider that the 30,000 years old wood has been left with about 2 percent of modern standard. The Shroud has over 90 percent modern standard. The less the amount of C14 left, the more difficult is measuring it exactly. Moreover the same amount of possible inquinating atoms shifts the 2 percent ratio much more than the 90 percent ratio.\n\n","date":"October 4, 2014 at 8:34 am","url":"https://shroudstory.com/2014/10/04/an-abstract-for-today/","cat":"carbon_14_dating","title":"An Abstract for Today"},{"author":"gian_marco_rinaldi","post":"O.K., a sindonologist should be able to identify right and left on the Shroud. If I look at the Shroud in vertical position with the frontal image standing head-up, what I see on the right is the right sides of the body, and this holds for both the frontal and the dorsal images. If I want to see the dorsal image head-up, I have to rotate by 180 degrees and after that what I see on the right is the left sides of the body. This is easy to understand if you imagine a body involved in a cloth. If you are not convinced, take a doll, smear it with red ink on its right parts and black ink on the left parts, involve it in a cloth and look at the result.\n\n","date":"October 21, 2013 at 7:13 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"author":"gian_marco_rinaldi","post":"It should be mentioned that Jackson provided Ramsey with his linen samples contaminated with the supposed carbon monoxide and the results of measurement were absolutely null. See from Ramsey note of March 2008:\nhttp://c14.arch.ox.ac.uk/embed.php?File=shroud.html\n“So far the linen samples have been subjected to normal conditions (but with very high concentrations of carbon monoxide). These initial tests show no significant reaction – even though the sensitivity of the measurements is sufficient to detect contamination that would offset the age by less than a single year. This is to be expected and essentially confirms why this sort of contamination has not been considered a serious issue before.”\nSubsequently there has been no news that Jackson succeeded in enriching samples with C14 according to his theory.\nI add that there is no rationale for supposing that the carbon atoms in the Chambéry chapel during the fire were enriched in the 14 isotope. Indeed, if the smoke came from rather old wood, the carbon atoms might have had slightly less isotope 14 with respect to the contemporaneous atmosphere.\nAs to the amount of the supposed contamination, for shifting the age from 30 AD to 1300 AD, in round numbers 500 atoms of 1532 carbon have to be added to every 100 original atoms.\n\n","date":"October 4, 2013 at 10:19 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"author":"gian_marco_rinaldi","post":"“pigments were superficial and faded away with simulation of aging.” But note that Garlaschelli has washed his cloth.\n\n","date":"April 21, 2015 at 6:56 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"author":"gian_marco_rinaldi","post":"The article from the Tanlet is still available here:\nhttp://archive.thetablet.co.uk/article/8th-may-2010/14/shrouded-in-mystery\nDavid Sox wrote: “… there was a secret test at a laboratory in Italy.” I am not completely sure, but as far as I can remember, in 1988 there were no AMS laboratories in Italy\n\n","date":"April 20, 2015 at 12:07 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"author":"gian_marco_rinaldi","post":"Riggi brought the textile fragments to San Antonio, Texas, where they were lost in a dating attempt by Garza-Valdes.\n\n","date":"January 26, 2014 at 7:16 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"gian_marco_rinaldi","post":"Thibault, I do not know about any accurate comparison for the presence of cotton fibers in the Raes corner versus the cloth in general. We have to speak of cotton fibers which are internal to the threads and interwoven with the linen fibers. An external, superficial presence of cotton may have any origin (and not only the gloves of STURP). As it happens, for the Raes/C14 corner some segments of thread were available and on occasion have been unraveled and examined fiber by fiber under the microscope. I do not remember that a similar examination has been done on segments of thread from other areas of the cloth. Thank you if you can provide references. One has also to consider that the amount of cotton incorporated in a thread during spinning might vary irregularly from thread to thread. Perhaps one thread was spun in a room where also cotton was spun or was anyhow present, while another thread was spun in a room where cotton was absent. Even for spinning within the same room, according to circumstances, two threads (or two segments of the same thread) might contain different amounts of cotton. Therefore it is not sufficient to compare one or a few spots. It is necessary to statistically compare a sufficiently high number of spots. The examination of each segment of thread should be done thoroughly and accurately, possibly in a “blind” condition.\n\n","date":"June 28, 2013 at 7:34 am","url":"https://shroudstory.com/2013/06/25/cotton/","cat":"carbon_14_dating","title":"Cotton"},{"author":"gian_marco_rinaldi","post":"Freeman speaks of “the growing of cotton” in the Po Valley. One might understand that the plant of cotton was cultivated there. Cotton was not grown in Northern Italy (at most in Sicily and of course in Spain). In Northern Italy cotton was spun and woven but the raw fibers came by ship from the ports of Eastern Mediterranean.\n\n","date":"June 28, 2013 at 6:58 am","url":"https://shroudstory.com/2013/06/25/cotton/","cat":"carbon_14_dating","title":"Cotton"},{"author":"gian_marco_rinaldi","post":"Cotton was used in Europe in 14th century and even earlier. The ships of Venice, then of Genoa, went to the Eastern Mediterranean and came back full of raw cotton that was spinned in Europe. There was also a type of textile, “fustian” that was made of mixed threads of linen and cotton. It is quite possible that a linen thread was spinned in a room where also cotton was present and some cotton fibers were interwoven with linen in the thread.\nAs to the “ancient” cotton, up to Columbus all the cotton used in the Old World was of the same type (or of two similar species). Only after Columbus the American varieties of cotton, that can be distinguished under the microscope, were introduced in the rest of the world.\n\n","date":"June 26, 2013 at 6:23 pm","url":"https://shroudstory.com/2013/06/25/cotton/","cat":"carbon_14_dating","title":"Cotton"},{"author":"gian_marco_rinaldi","post":"Klotz: “… the Savoy Princess who became Queen Margaret of Portugal”. Can you provide more details? I only find a Margaret of Savoy, Vicereine of Portugal (1589-1655):\nhttps://en.wikipedia.org/wiki/Margaret_of_Savoy,_Vicereine_of_Portugal\nAnd where is this copy of the Shroud?\n\n","date":"December 10, 2015 at 12:44 pm","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"author":"gian_marco_rinaldi","post":"The calendar (calibrated) ages are within the interval also for Oxford: see the graphic of Fig. 2 in the Nature report.\nIt is to be expected that the single results of repeated measurements are scattered over an interval. For the Shroud the single results span an interval of 204 years BP. For the three control samples they span 207, 299 and 223 years BP.\nI have published a very detailed analysis of the statistics of the Nature report. Sorry it is in Italian. The PDF file (44 pages) is linked here:\nhttp://sindone.weebly.com/statistica-nature.html\n\n","date":"October 23, 2013 at 9:53 am","url":"https://shroudstory.com/2013/10/23/jones-none-of-the-three-laboratories-dated-its-sample-to-between-1260-and-1390/","cat":"carbon_14_dating","title":"Jones:  “none of the three laboratories dated its sample to between 1260 and 1390”"},{"author":"gian_marco_rinaldi","post":"It seems that the discussions in this blog about the amount of contaminant do not take account of the epoch of the contamination. For example, in order to shift the date from 30 AD to 1300, for every 100 original carbon atoms of 30 AD there should be 500 new carbon atoms of 1532, or 175 of 1950, or about 20 for the years around 1965. Thus the differences are strong. In all cases, these numbers hold if one supposes that there is no amount of older contaminant. If there were substantial contaminant from the centuries before 1300, the numbers should be still much larger. My calculations do not take account of the calibration correction, but calibration is of little effect for the last 2000 years.\n\n","date":"March 25, 2015 at 3:26 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"author":"gian_marco_rinaldi","post":"Hugh: I have looked at the other thread and see that indeed you find that the amount of contaminant depends on the epoch of the contamination, and this is just what I intended to point out. As to the low value for the 1960s, in those years the concentration of C14 in the atmosphere reached a maximum after the experiments with nuclear weapons.\n\n","date":"March 25, 2015 at 11:04 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"author":"gian_marco_rinaldi","post":"(As quoted by Klotz.) “The cotton is a fine, dark yellow strand, possibly of Egyptian origin and quite old.” What are the criteria for establishing that a cotton fiber is Egyptian? Is it possible to distinguish a fiber of Egyptian origin from a fiber originating elsewhere in the Old World? “And quite old”. How much old? Ancient Egypt was the land of flax, not of cotton. It is not even sure that cotton was known in Egypt at the time of Christ. Possibly cotton was introduced to low Egypt only centuries later.\n“Gilbert Raes … deduced that this was a strong indication of Middle Eastern manufacture.” Raes did not state exactly this, and if he did he would have been wrong. Cotton was surely used in Europe in the 14th century. Was it used in the Palestine of 1st century? Orit Shamir, in a 2015 paper from the Bari conference, has given a tabulation of the type of fiber for 1635 textile specimens of the Roman period from 23 sites in Israel:\nhttp://www.shs-conferences.org/articles/shsconf/pdf/2015/02/shsconf_atsi2014_00010.pdf\nThere is a lot of wool and linen, some goat hair and just three camel hair, but there is not one example of cotton.\nIt may also be useful to quote the final conclusion of Shamir:\n “The Turin Shroud was probably not manufactured in the Land of Israel neither in the Roman nor in the Medevial period. It may not have been imported in none of these periods because not one textile with the above weaving technique was found in the Land of Israel.”\n\n","date":"March 5, 2015 at 10:22 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"author":"gian_marco_rinaldi","post":"This is a “Veronica”, not a copy of the Turin Shroud. Compare with this photo of another Calvary in Brittany. It is the magnificent Calvary of Notre-Dame de Tronoën:\n\n(The photos in this website can be enlarged up to high resolution.) At the basis of the left pillar there is a Saint Veronica with her veil. Here is a detail of the Veronica:\n\nThis Calvary is dated at 1456-1460. At this date, the representations of the Veronica had already long been frequent and widespread in Europe.\n\n","date":"February 20, 2013 at 6:10 pm","url":"https://shroudstory.com/2013/02/20/paper-chase-and-historical-c14-challenge-relations-of-a-breton-calvary-with-the-shroud-and-the-templar-knights/","cat":"carbon_14_dating","title":"Paper Chase and Historical C14 Challenge: Relations of a Breton Calvary with the Shroud and the Templar Knights"},{"author":"gian_marco_rinaldi","post":"In the Valencia paper (p. 13) Emanuela Marinelli refers to a rumor according to which the representatives of the laboratories had a secret meeting in Switzerland in the summer of 1988 (this is repeated in the slideshow at slide 55). As a source she quotes (in footnote 123) an article by Umberto Folena in the Italian daily Avvenire of 14 October 1988. Indeed in the article Folena writes that “it seems” that a secret meeting was held in Switzerland that summer without mentioning any source for this news. In November, 2012 I wrote to Folena asking what had been his source. He answered that he did not remember and did not even remember having written that sentence. In 1988 Folena was a young reporter and had been sent to Turin for the press conference of 13 October where Bishop Ballestrero announced the results of radiocarbon dating. His article is just a report about that press conference. Of course that day many journalists were present in Turin and subsequently published their reports, but it does not seem that any of them, apart from Folena, mentioned the secret meeting. Needless to say, if the directors of the laboratory wanted to exchange information, they could do so by telephone or email without having to travel to Switzerland. One may add that on 20-25 June 1988 several of the representatives of the laboratories met in Dubrovnik for one of the regular radiocarbon conferences, but this was not secret and not in Switzerland.\n\n","date":"August 4, 2014 at 3:22 pm","url":"https://shroudstory.com/2014/08/04/photo-rich-wonderful-presentation-by-emanuela-marinelli/","cat":"carbon_14_dating","title":"Photo Rich, Wonderful Presentation by Emanuela Marinelli"},{"author":"gian_marco_rinaldi","post":"I wonder what are the other nine lines of evidence. The historical record agrees with the C14 result. There is no evidence pointing to the first century, unless you want to consider the Tiberius coins.\n\n","date":"October 23, 2013 at 9:57 am","url":"https://shroudstory.com/2013/10/23/quote-for-today-on-carbon-dating/","cat":"carbon_14_dating","title":"Quote for Today on Carbon Dating"},{"author":"gian_marco_rinaldi","post":"“Seven samples containing a total of 50 milligrams of carbon will be taken from the Shroud.” It should be specified that two of the labs used another method, not AMS, and requested a larger quantity. I copy a whole passage from Gove’s book (p. 155) describing what happened at the same 1986 Turin workshop:\n“I said that a year before Rochester had dated something like 15 micrograms of carbon but the accuracy was poor – that is an example of the sample size going down. For a standard dating like the shroud, 5-10 milligrams of carbon would be needed.\n“The other [four] AMS lab representatives gave estimates ranging from 1 to 5 mg finally settling on the latter. The [two] small-counter labs at Brookhaven and Harwell requested 10 and 15 mg respectively.”\nSubsequently in London, as a final request, the three chosen labs indicated at least 40 mg of textile each. This was more than strictly necessary but probably the labs wanted to have spare material in order to repeat a measurement if something went wrong.\n\n","date":"May 2, 2013 at 11:46 pm","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","title":"Special Request from Hugh Farey"},{"author":"gian_marco_rinaldi","post":"A paper by Walsh at the 1999 Richmond conference can be retrieved through archive.org, for example here:\nhttp://web.archive.org/web/20040428023751/http://members.aol.com/turin99/radiocarbon-b.htm\nThe 1988 Shroud of Turin Radiocarbon Tests Reconsidered\nPart II\nPress here to return to Part I of this paper.\nBryan J. Walsh\nShroud of Turin Center\nRichmond, Virginia USA\nCopyright 1999\nAll Rights Reserved\nThis is the second part with the diagram. There is a link to the first part.\n\n","date":"May 1, 2013 at 11:03 am","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","title":"Special Request from Hugh Farey"},{"author":"gian_marco_rinaldi","post":"From Jull’s letter, it is interesting that they dated each graphite pellet twice. I previously thought that they had obtained two pellets from each subsample. If the pellets were only four, and not eight, then the weight is compatible with about 1 mg for pellet and it is quite possible that they dated only two quarters of the total sample.\nThe results for each of the eight measurements are known (they were published by Remi Van Haelst).\nAs to Zurich, it was Bonnet-Eymard, I think, who said that they also had kept a spare fragment, but without a proof as far as I remember.\nIn the website of ETH Zurich (the Institute were the dating had been done) there are the photos of some of the subsamples, but not all. I have tried to reconstruct the jigsaw puzzle of the three fragments that are shown for the first half of the sample but have not succeeded. Any body will try?\nhttp://archiv.ethlife.ethz.ch/e/articles/sciencelife/turin.html\nBut for Zurich there is another problem. Two unpublished sheets of data, presumably a first version of the radiocarbon results, have appeared in an Italian documentary (La Notte della Sindone, The Night of the Shroud). Some of the results for Zurich are different from those that were published in Nature. I have published an article about these data in January 2013, but it is in Italian. I have already done an English transltion and it will soon be published on the internet.\n\n","date":"May 5, 2013 at 12:21 pm","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","title":"Special Request from Hugh Farey"},{"author":"gian_marco_rinaldi","post":"In my previous message I said: “But for Zurich there is another problem…” An English translation of my article is now online with the title: “Two sheets of data of unknown origin with presumed results of the 1988 radiocarbon dating of the Shroud of Turin”\nhttp://sindone.weebly.com/uploads/1/2/2/0/1220953/c14_unpublished_data.pdf\n\n","date":"May 8, 2013 at 1:28 pm","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","title":"Special Request from Hugh Farey"},{"author":"gian_marco_rinaldi","post":"Hugh, here are some data about the weight of the samples that was needed for radiocarbon dating in 1988, The 1989 Nature paper refers to a 1987 paper by Slota et al (Radiocarbon 29, 303-306) for the preparation of the graphite targets at Arizona. The paper is available here:\nhttps://journals.uair.arizona.edu/index.php/radiocarbon/article/view/1051/1056\nThey say: “The graphite powder is collected, weighed, and ca 1 mg (if available) is pressed into a standard target holder for accelerator 14C analysis. […] Samples as small as 0.3 mg have been successfully analyzed.”\nThe amount of carbon (graphite) in a textile sample should be about 25%. We do not know the amount of textile weight that was lost during pretreatment. It depends on the conditions of the textile and the cleaning method. Let us suppose that (at least) 5 mg of textile are needed for a graphite pellet of 1 mg. The Arizona lab used 8 pellets (four pairs). This would amount to 40 mg of textile. If they used only two subsamples (14.72 mg and 11.83 mg) the total amount was 26.55 mg. Therefore each graphite pellet was well below 1 mg.\nAt the 1986 Turin workshop (according to Gove in his book) the representatives of the laboratories were asked how much (pure) carbon they needed. The AMS labs answered with a figure between 1 and 5 mg.\nOn the other hand, still to-day the laboratories request a rather large amount of textile for the samples they receive. For example one laboratory indicates 20-50 mg. Another laboratory indicates 15 mg. Probably the labs prefer to work with abundant material, especially because archaeological samples may often be in bad conditions and suffer a rather large loss during pretreatment. Moreover very small samples may give less precise results.\n\n","date":"May 2, 2013 at 8:16 pm","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","title":"Special Request from Hugh Farey"},{"author":"gian_marco_rinaldi","post":"Hugh, both diagrams of Riggi are wrong. It is incredible how many mistakes Riggi could make, beginning with his wrong statements in 1988 and 1989. The order of the samples has been reconstructed from the photos. Usually the order (from the left, i.e. from the border of the cloth) is given as: Reserve, Arizona-small, Oxford, Zurich, Arizona-large. There are no doubts about the last three. I am note sure about the first two because it is possible that Arizona-small was cut from the left end of Reserve. It is not possible to decide because there are no clear photos of Arizona-small available.\nThe situation for the Arizona subsamples is not clear. Jull and Freer Waters have published the photo a piece that was not used for dating and is still kept in Tucson. This piece is not the small piece that had originally been delivered as a separate piece. It comes from the large piece (the upper part of it). It seems that also the small piece is still kept in Tucson but there is no clear proof. It is surprising thet Arizona did the dating with only two quarters of the available textile. Recently Barrie Schwortz went to Tucson and took photographs but he was told that there was another piece that was kept at the home of Donahue (who was absent at the time). It is to be hoped that Jull or somebody in Tucson will soon publish a clear photo (front and back) of the Donahue subsample. If they do not give a proof that the small piece is still extant, one might suspect that they dated it but had hidden away the result if it was an outlier.\n\n","date":"May 2, 2013 at 6:18 am","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","title":"Special Request from Hugh Farey"},{"author":"gian_marco_rinaldi","post":"From my reading of the interview, it does not seem to me that Ballestrero said to have been manipulated. Of course he said that there had been pressures (among others from sindonological circles) aiming at performing the radiocarbon dating (as is well known), but this does not imply that he had been manipulated. At any rate, here is the text of the interview (in Italian) if you can manage to understand it with the help of an automatic translation.\nhttp://www.mondosindone.com/Site/documenti/DSS001_10%20-%20intervista%20Ballestrero.pdf\nI have the issue of the magazine and the above text online seems to be adherent to the original. There may be some slight error in the transcription, for example “con più con intendimenti devozionali” (p. 21) has to be corrected to “non più con …” (no longer with). At the end of the previous page the sentence “Penso sia indiscutibile” has the “indiscutibile” in bold type, not so in the original. This sentence was in answer to a question about any intervention of freemasonry, but I have little doubt that there must have been a misunderstanding with the interviewer. In his answer Ballestrero does not mention freemasonry.\n\n","date":"January 11, 2014 at 4:45 pm","url":"https://shroudstory.com/2014/01/10/surely-youre-joking-mr-jones/","cat":"carbon_14_dating","title":"Surely You’re Joking, Mr. Jones"},{"author":"gian_marco_rinaldi","post":"I don’t know. But I would think that Ballestrero had never explicitly endorsed a fake Shroud. In 1988 he had to announce the results of the laboratories, what else could he do?\n\n","date":"January 11, 2014 at 8:13 pm","url":"https://shroudstory.com/2014/01/10/surely-youre-joking-mr-jones/","cat":"carbon_14_dating","title":"Surely You’re Joking, Mr. Jones"},{"author":"gian_marco_rinaldi","post":"As to Domenico’s points.\n1) This is the weft face (the weft threads are prominent) and it may be called the reverse because in the Shroud textile the warp face is more “beautiful” and regular. The image of the body is on the warp face.\n2) As to Zurich, it would be interesting to know something more. Can you provide any sources?\n3) In the Radiocarbon paper, Freer is the first author, while Hedlund is only mentioned thus: “[she] was also consulted on the weave structure of the fragment.” In the Acknowledgements her name is mentioned “for helpful discussions”.\nConcerning the wrong data in the paper, I have published a note here, but it is in Italian:\nhttp://sindone.weebly.com/autogoltucson.html\n\n","date":"January 7, 2011 at 9:01 pm","url":"https://shroudstory.com/2011/01/05/was-the-sample-used-in-the-jull-paper-not-from-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Was the sample used in the Jull paper NOT from the Shroud of Turin?"},{"author":"gian_marco_rinaldi","post":"The textile examined by Freer and Jull is a 3/1 twill, as can be seen from photographs in this video of the Arizona State Museum:\nhttp://www.statemuseum.arizona.edu/podcasts/ep033_beyond_naked_eye.shtml\nSee at minute 02.31 (warp side) and 01.23 (weft side). Other images are from minute 11.30. In all these photos, the warp threads run horizontally, as can be deduced from the inclination of the diagonals of the herringbone twill. From these photos it is easy to count the warp and weft threads. From the bar equivalent to 1 mm as shown with the first two photos, we may estimate that the dimensions of the rectangle are about 6 by 8/9 mm. Then it is easy to verify that the numbers of warp and weft threads per centimeter are just those to be expected from the known measurements by Vercelli and others. The values as given by Freer and Jull are completely wrong. Probably they have mistaken the warp for the weft. This is a serious mistake because it is well known that in the Shroud (and also, as a rule, in most ancient textiles) the warp threads are more dense than the weft threads. This is also immediately evident if only one looks at the inclination of the herringbone diagonals, which form an angle of less than 45 degrees with the warp direction.\nMiss Freer (or Mrs Freer-Waters after her recent marriage) did this work in 2008 while she was at the Museum with a one year fellowship. She was very young (you may see her photo in the same video at minute 00.24) and had just earned a MS in 2007 from the University of Rhode Island. For her current activity, you may see her website:\nhttp://www.textileanalysisandconservation.com/\n\n","date":"January 6, 2011 at 10:17 pm","url":"https://shroudstory.com/2011/01/06/what-is-going-on-at-the-ams-laboratory-at-the-university-of-arizona/","cat":"carbon_14_dating","title":"What is going on at the AMS Laboratory at the University of Arizona?"}],"dna":[{"author":"gian_marco_rinaldi","post":"In the old list of Max Frei there are only two genuses (not species) which are present in the list of Barcaccia et al.: Carpinus and Prunus. Neither is typical of Middle East.\n\n","date":"October 6, 2015 at 11:27 am","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"author":"gian_marco_rinaldi","post":"The far-back origin in America or the Far East can be disregarded if the plant grows or is cultivated to-day in Italy.\n\n","date":"September 20, 2014 at 12:24 pm","url":"https://shroudstory.com/2014/09/20/paper-chase-uncovering-the-sources-of-dna-on-the-shroud/","cat":"paper_chase","title":"Paper Chase:  Uncovering the Sources of DNA on the Shroud"},{"author":"gian_marco_rinaldi","post":"The text of Shamir’s paper is not yet available online. For what it can help, a webpage has a great many photos from Bari and among them about 30 photos of slides from Shamir’s presentation as they were shown on the screen.\nhttp://www.monitorenapoletano.it/sito/the-vaticanist/236-settembre-2014/3012-photogallery-advanced-turin-shroud-investigation-bari-4-5-settembre-2014.html\nShamir’s photos start at n. 7257.\n\n","date":"September 21, 2014 at 6:20 am","url":"https://shroudstory.com/2014/09/20/paper-chase-uncovering-the-sources-of-dna-on-the-shroud/","cat":"paper_chase","title":"Paper Chase:  Uncovering the Sources of DNA on the Shroud"},{"author":"gian_marco_rinaldi","post":"What is more probable: 1) the dust and debris found on the cloth is of very recent origin; 2) it is centuries and millennia old. Dust comes and goes every day.\n\n","date":"September 20, 2014 at 3:54 am","url":"https://shroudstory.com/2014/09/20/paper-chase-uncovering-the-sources-of-dna-on-the-shroud/","cat":"paper_chase","title":"Paper Chase:  Uncovering the Sources of DNA on the Shroud"}],"events":[{"author":"gian_marco_rinaldi","post":"Hugh, you may try with this address of Onysko, hoping that it is still operative:\ndlonysko@integrityonline13.com\nIndeed it would be interesting to have a number of such photos published or somehow available. Those who might provide them are Alan Whanger and Paul Maloney, as far as I can tell.\n\n","date":"January 11, 2014 at 6:44 pm","url":"https://shroudstory.com/2014/01/11/if-you-will-be-in-the-cleveland-area-on-january-25th/","cat":"event","title":"If you will be in the Cleveland area on January 25th"},{"author":"gian_marco_rinaldi","post":"An entirely new website of the Turin Center is under construction. Check here:\nhttp://www.sindone.it/Index.htm?LL=it\n\n","date":"March 19, 2013 at 12:10 pm","url":"https://shroudstory.com/2013/03/19/junk-alert-more-on-the-official-website/","cat":"event","title":"Junk Alert:  More on the Official Website"},{"author":"gian_marco_rinaldi","post":"The English text of the announcement in the official website:\nhttp://www.sindone.org/the_holy_shroud__english_/news_and_info/00045909_Message_from_the_Custodian_of_the_Shroud.html\n\n","date":"December 4, 2013 at 8:15 am","url":"https://shroudstory.com/2013/12/04/official-an-extraordinary-exposition-of-the-holy-shroud-in-2015/","cat":"event","title":"Official:   An Extraordinary Exposition of the Holy Shroud in 2015"},{"author":"gian_marco_rinaldi","post":"Mike M.: “you haven’t given the reason why Centini was unreliable”. Massimo Centini was born in 1955 and has a long career as an author of books. From the catalogue of an online bookshop, considering only the last few years, one finds that he has published 9 books in 2009, 13 in 2010, 9 in 2011, 5 in 2012, 9 in 2013, already 7 in 2014. I translate some titles:\nWitches in Piedmont: pages of history and mystery. The afterlife: the places of the soul. Plague in Turin: the city during the infection. Witchcraft in Insubria: popular tradition, the Inquisition and pagan rites between Lombardy and Piedmont. Unusual guide to the mysteries, secrets, legends and curiosities of Piedmont. Sacred medicine: travel among the magic-medical practices of Italian folklore. Killing for Satan: devil and crime in Piedmont. The Big Book of the mysteries of Piedmont, resolved and unresolved. The places of the Apocalypse: a journey in the footsteps of the “end of the world”. Fantastic creatures: fairies, goblins, monsters and devils: travel in popular mythology in Piedmont, Liguria and Aosta Valley. Brothels in Turin: when the brothels were open. The great Italian crimes, solved or unsolved. Sea monsters: mysterious creatures between myth, history and science. The symbolic language of esotericism. Wicked Italians: the most shocking facts and personages of our history. The last mystery: the Shroud and the Knights Templar: when history and myth merge. The strangler of women: the dramatic story of Vincenzo Verzeni “sexual sadist, vampire and devourer of human flesh”.\nI do not say that Centini is unreliable as an author, but he can hardly be ranked as a specialist in ancient Byzantine history.\n\n","date":"June 4, 2014 at 12:02 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"author":"gian_marco_rinaldi","post":"Dan, the three messages you have translated with Bing are available in English on the official website sindone.org. Start from here:\nhttp://www.sindone.org/the_holy_shroud__english_/00024122_The_Holy_Shroud.html\n\n","date":"December 7, 2013 at 6:10 am","url":"https://shroudstory.com/2013/12/07/the-shroud-of-turins-chamber-of-commerce/","cat":"event","title":"The Shroud of Turin’s Chamber of Commerce"},{"author":"gian_marco_rinaldi","post":"Piero, for those of us who have not been trained in ancient alchemic wisdom, would you explain the difference between monoatomic gold, biatomic gold, triatomic gold etc.?\n\n","date":"September 5, 2014 at 1:45 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"}],"history":[{"author":"gian_marco_rinaldi","post":"It is true that the image of the St Peter Veronica now, and since some time, has almost completely disappeared. But this favours the hypothesis that the veil is still the same that was in Rome in medieval time. If the present veil was a new copy made at the beginning of 17th century, the image should now be still clearly visible. Indeed looking at the copy now in Vienna (ca. 1617) one may think that already then the original was degraded.\nhttp://veronicaroute.com/1617/04/29/1617/\nPossibly the painter of the Vienna copy did not see the eyes in the original, that had faded away, and painted a face with seemingly closed eyes. Other copies followed with closed eyes.\nThere is no proof that the old frame, still extant in Vatican, had two glasses (or panes of rock crystal). Presently it has one (broken) glass and there is no indication that it had ever had two.\nLastly, needless to say, the Manoppello veil is evidently an earthly painting, not a divine miracle.\n\n","date":"December 18, 2013 at 10:37 pm","url":"https://shroudstory.com/2013/12/18/paper-chase-john-iannones-the-veil-of-veronica-fact-or-fiction/","cat":"history","title":"Paper Chase:  John Iannone’s The Veil of Veronica: Fact or Fiction?"},{"author":"gian_marco_rinaldi","post":"From O.K.: “Look at this picture of 1350 frame, taken from Falcinelli’s paper. What’s there in the topmost corner?” I cannot see anything of interest. I have written to Roberto Falcinelli himself and he has kindly sent me another photo with a detail of that corner of the frame. There is only a small splintering in the glass pane. So what?\nI add that in the same Frascati 2010 paper by Falcinelli, just above its Fig. 15 that you have reproduced in your link, he quotes a sentence by Giacomo Grimaldi, early 17th century, where one, and only one glass is mentioned. Perhaps there had formerly been two glasses, but where have you found the information?\n\n","date":"December 20, 2013 at 1:37 pm","url":"https://shroudstory.com/2013/12/18/paper-chase-john-iannones-the-veil-of-veronica-fact-or-fiction/","cat":"history","title":"Paper Chase:  John Iannone’s The Veil of Veronica: Fact or Fiction?"},{"author":"gian_marco_rinaldi","post":"O.K., if you contact Roberto Falcinelli, he is ready to share the details of his examination of the frame and his photographic documentation. You find his email address for example in his Frascati 2010 paper that you know (and is available on the internet).\nAs to the label of the frame in the Museum, Falcinelli tells me that it has been recently changed. Now it reads simply: “Antica cornice [ancient frame] della Veronica, già Volto Santo”\n\n","date":"December 21, 2013 at 11:49 am","url":"https://shroudstory.com/2013/12/18/paper-chase-john-iannones-the-veil-of-veronica-fact-or-fiction/","cat":"history","title":"Paper Chase:  John Iannone’s The Veil of Veronica: Fact or Fiction?"},{"author":"gian_marco_rinaldi","post":"The Templecombe panel was radiocarbon dated between 1280 and 1440 (not 1340).\n\n","date":"April 26, 2013 at 6:05 pm","url":"https://shroudstory.com/2011/01/18/templecombe-and-the-shroud-of-turin-continued/","cat":"history","title":"Templecombe and the Shroud of Turin (Continued)"},{"author":"gian_marco_rinaldi","post":"Radiocarbon results are given as 95% confidence intervals. You have to quote the whole interval, not just its early years. This result was published by the Oxford AMS laboratory in their paper:\nArchaeometry, volume 29, issue 2, August 1987, pp. 289–306\nRadiocarbon dates from the Oxford AMS System: Archaeometry Datelist 6\nR.E.M. Hedges, R.A. Housley, I.A. Law, C. Perry and J.A.J. Gowlett\nI quote from p. 303:\n<<Templecombe. Two samples taken from the edges of two planks of a door with a Shroud-like image of Christ. The door was found on the site of a former Templar preceptory at Templecombe in Somerset (Wilson 1986). The dating was requested by C. Watson of TV South-West.\n<<OxA-1042 Wood from plank I: 580 ± 60.\n<<OxA-1043 Wood from plank 2: 580 ± 60.\n<>\nBut it is not important to discuss about the dating of the panel. The important point is that there is absolutely no evidence that the Templars owned or had ever seen the Shroud (much the less that the Shroud had ever been in England) and there is not any resemblance between the Templecombe portrait and the Shroud, apart from the fact that both have beard and long hair (beard and long hair were a common feature of men of those times).\nAs to the thesis of Barbara Frale, she has been severely criticized by historians in Italy. Suffice it to say that she read a passage in a manuscript as “signum fustanium” while the words were clearly written as “signum fusteum” (“fusteum” = made of wood).\nPS: “Accelerator”, not Excelerator.\n\n","date":"April 27, 2013 at 8:20 am","url":"https://shroudstory.com/2011/01/18/templecombe-and-the-shroud-of-turin-continued/","cat":"history","title":"Templecombe and the Shroud of Turin (Continued)"},{"author":"gian_marco_rinaldi","post":"For some unknown reason, in my previous message a whole paragraph was deleted. The text of the Oxford paper, after “…580 ± 60”, continued:\n<>\n\n","date":"April 27, 2013 at 8:34 am","url":"https://shroudstory.com/2011/01/18/templecombe-and-the-shroud-of-turin-continued/","cat":"history","title":"Templecombe and the Shroud of Turin (Continued)"},{"author":"gian_marco_rinaldi","post":"I wonder why this website insists in deleting a whole passage from my posting and substituting it with . I try once again. The deleted passage from the Oxford paper is:\nUsing the calibration curve of Stuiver and Pearson (1986) the two identical dates give three possible means, namely AD 1328, 1333 and 1395. The one sigma (68% confidence) age range is AD 1290-1420, whilst the two sigma (95% confidence) range is AD 1280-1440. The dates are entirely compatible with the wood being cut in the period AD 1280-1310, and thus the painting might be associated with the Knights Templar, perhaps commissioned prior to their suppression in 1307 by King Philip the Fair of France. On the other hand, a later date for the wood of up to around 1440 cannot be ruled out, whilst the painting could of course have been executed much later than the timber on which it appears.\n\n","date":"April 27, 2013 at 8:50 am","url":"https://shroudstory.com/2011/01/18/templecombe-and-the-shroud-of-turin-continued/","cat":"history","title":"Templecombe and the Shroud of Turin (Continued)"},{"author":"gian_marco_rinaldi","post":"After Max Patrick’s mention of the “Bocca della Verità”, I expect that some sindonologists will state that the Turin Shroud was already famous in first century Rome!\n\n","date":"April 27, 2013 at 11:51 am","url":"https://shroudstory.com/2011/01/18/templecombe-and-the-shroud-of-turin-continued/","cat":"history","title":"Templecombe and the Shroud of Turin (Continued)"},{"author":"gian_marco_rinaldi","post":"The panel of Templecombe was dated not to 1280 but to an interval between 1280 and 1440. I have written an article here, but it is in Italian\nhttp://sindone.weebly.com/templecombe.html\n\n","date":"January 17, 2011 at 6:44 pm","url":"https://shroudstory.com/2011/01/14/templecombe-and-the-shroud-of-turin/","cat":"history","title":"Templecombe and the Shroud of Turin"},{"author":"gian_marco_rinaldi","post":"For essential information about sea-silk, you may see the website by Felicitas Maeder (Basel, Switzerland):\nhttp://www.muschelseide.ch/en/projekt.html\n\n","date":"August 5, 2015 at 6:58 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"}],"image":[{"author":"gian_marco_rinaldi","post":"Hugh: yes, there is confusion among the several works attributed to a Della Rovere and representing the Shroud. I had given the link to a page by Leonardo Caviglioli devoted to the most famous Giovan Battista della Rovere, “il Fiamminghino” (=Flemish). You quote from another page of the same 1989 edition of the Treccani dictionary, by Giovanni Romano, devoted to the Turinese Della Rovere family of painters. Your page, not mine, seems to be the right one for our quest. As specified at the beginning of the page, there is no relation between the Turinese family and the “Fiamminghino”.from Milan. Therefore the Giovanni Battista from Turin, mentioned in your quote, has nothing to do with the most famous Giovan Battista. At any rate, neither of them has relation with the family of the Pope.\nAs mentioned in your quote, a certain document has been erroneously attributed to the Fiamminghino. Perhaps a similar error has been perpetuated and still now the paintings of the Shroud are sometimes attributed to the wrong Della Rovere. If so, you have happily solved the doubt. But the problem is not so simple because as you quote, the three portraits of the Shroud are attributed to Pietro Francesco, another member of the Turin family. (The word “nre” in the original is clearly a mistake for “tre” = three.)\nA couple of paragrahs above your quote (beginning with “Già il 1° giugno 1606 il duca Carlo Emanuele I di Savoia”) it is stated that in 1606 the Duke had given to Gerolamo, the eldest Della Rovere, and to his family the privilege of painting the Shroud. During the following years, until the death of Gerolamo in 1638, any number of paintings of the Shroud may have been produced by Gerolamo or his sons. I cannot go further than this. Really an art historian is wanted.\nLastly, the word “ruere”, not used to-day in Italian, can well stand for “rovere” in the language, or some dialect of the time.\n\n","date":"December 14, 2014 at 11:02 am","url":"https://shroudstory.com/2014/12/13/is-there-an-art-historian-in-the-house/","cat":"3d","title":"Is there an art historian in the house?"},{"author":"gian_marco_rinaldi","post":"Yannick, I do believe you when you say that you did not know the names of the referees. Speaking in general, I have often found that scientific journals publish sindonology papers that (in my opinion of course) are invalid or even complete nonsense. I wonder why sindonology papers happen to be reviewed by referees who are so Shroud-friendly. One possibility is that the authors themselves have suggested the names of the referees (this is not your own case). There are journals which accept suggestions from the authors as to the names of the referees. Apart from this, when an editor receives a paper on the Shroud (a subject about which he knows nothing) it is natural for him to submit the paper to referees who are themselves sindonologists. At any rate, if I read a paper for which I have myself a negative opinion, I do not change my opinion because the paper has passed the peer review or because the authors have academic credentials.\nIncidentally, you probably know that Giulio Fanti has published a note criticizing another 2014 paper by Fazio et al:\nhttp://www.tandfonline.com/doi/full/10.1080/00405000.2014.961265#.VDglerccTIV\n\n","date":"October 10, 2014 at 3:36 pm","url":"https://shroudstory.com/2014/10/07/to-revisit-a-stochastic-process/","cat":"image_theory","title":"To Revisit a Stochastic Process"},{"author":"gian_marco_rinaldi","post":"Hugh, Della Rovere is just a surname, nothing to do with the noble family. The painter was of Flemish descent. See here:\nhttp://www.treccani.it/enciclopedia/della-rovere-giovan-battista-detto-il-fiamminghino_(Dizionario-Biografico)/\n\n","date":"December 14, 2014 at 6:13 am","url":"https://shroudstory.com/2014/12/13/is-there-an-art-historian-in-the-house/","cat":"3d","title":"Is there an art historian in the house?"},{"author":"gian_marco_rinaldi","post":"Allan Mills has been Honorary Chairman of the BSTS. Searching for Mills in the index of the Newsletter in the BSTS page at shroud.com, one finds a 2002 paper on the formation of the image, a 2009 shorter article, the 1996 account of a lecture on the singlet oxygen theory.\n\n","date":"October 8, 2014 at 12:28 pm","url":"https://shroudstory.com/2014/10/07/to-revisit-a-stochastic-process/","cat":"image_theory","title":"To Revisit a Stochastic Process"},{"author":"gian_marco_rinaldi","post":"Clément: “I’ve learn through Mr. Fazio that one of the referee was Alan Mills,”\nAllan Mills can scarcely be considered to be an independent judge. He is a sindonologist and is quoted three times in the paper by Fazio et al. Now I understand what is the meaning of “peer review”: a paper written by a sindonologist must be reviewed by his “peers”, that is other sindonologists!\n\n","date":"October 8, 2014 at 7:19 am","url":"https://shroudstory.com/2014/10/07/to-revisit-a-stochastic-process/","cat":"image_theory","title":"To Revisit a Stochastic Process"},{"author":"gian_marco_rinaldi","post":"Louis: “Dolimetic Limestone”. Probably you mean “dolomitic”, but dolomite (calcium nagnesium carbonate) is differente from both calcite and aragonite.\n\n","date":"December 13, 2015 at 11:28 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","title":"Watertight Evidence"},{"author":"gian_marco_rinaldi","post":"From the books by Sox and Gove, respectively, one learns what follows. Gove and his secretary Ms Brignall were in London from 15 to 19 June 1988 and met Sox. Immediately after they left, on 20 June, Sox went from London to Turin for informing Rinaldi about the result of the radiocarbon test. It is tempting to suppose that Sox was informed by Gove or Brignall or both. I would suspect of Brignall. Indeed Gove, without Brignall, had been in London on 12 May, and the following days, and had met Sox, but that time Sox did not travel to Turin. Therefore Gove, when alone, had not informed Sox. Of course all of this is only hypothetical but it seems to be an interesting clue.\n\n","date":"December 13, 2015 at 7:15 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","title":"Watertight Evidence"},{"author":"gian_marco_rinaldi","post":"I think that Saracino’s is one of the worst documentaries ever produced. I have written a criticism here:\nhttp://sindone.weebly.com/uploads/1/2/2/0/1220953/notte_complottopart_1.pdf\nIt is a 67 pages pdf and I have considered only one aspect, the conspiracy theories. Sorry it is in Italian.\nMs Saracino, with whom I have been in contact by mail, has not attempted any reply.\n\n","date":"December 13, 2015 at 7:36 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","title":"Watertight Evidence"}],"misc":[{"author":"gian_marco_rinaldi","post":"Hugh, the mechanical tests have been done with fibers under tension. The parameters were: breaking load, an elastic modulus (two methods), a loss factor (two methods). The five results are not given in the book as numerical figures but are only represented in a graphic diagram. Approximately, from the diagram one can guess that the five intervals are: 190AD-810AD, 340BC-360AD, 90BC-990AD, 760BC-300BC, 220AD-940AD. Supposedly the intervals are at the 95% confidence level but this is not explicitly stated. The respective means would be: 500AD, 10AD, 450AD, 530BC, 580AD. Thus the means are widely scattered. Averaging these results, Fanti finds a final result at 400AD +/-400. He does not describe his method for calculating the average.\nThe spectroscopic tests measure chemical (or chemico-physical) alterations in the structure of the fiber but for full details we have to await the publication of a technical report.\nPS: Hugh, thank you for the translation!\n\n","date":"April 5, 2013 at 11:20 pm","url":"https://shroudstory.com/2013/04/05/a-committee-far-removed-from-padua/","cat":"news_&_views","title":"A Committee Far Removed from Padua"},{"author":"gian_marco_rinaldi","post":"Louis, what is your source for stating that Cooray will present a paper at Bari?\n\n","date":"August 28, 2014 at 4:18 pm","url":"https://shroudstory.com/2014/08/28/breaking-news-on-the-bari-conference/","cat":"news_&_views","title":"Breaking News on the Bari Conference"},{"author":"gian_marco_rinaldi","post":"The page for the reservations is now working:\nhttp://www.sindone.org/pls/diocesitorino/V3_S2EW_CONSULTAZIONE.mostra_pagina?id_pagina=24632&rifi=guest&rifp=guest\n\n","date":"November 6, 2014 at 4:19 am","url":"https://shroudstory.com/2014/11/05/breaking-news-make-reservations-to-see-the-shroud-starting-tomorrow/","cat":"uncategorized","title":"Breaking News:   Make Reservations to See the Shroud Starting Tomorrow"},{"author":"gian_marco_rinaldi","post":"In the 1990 book, Sindone o no, this is fig. 34 with no acknowledgements and with the following caption: “Fibrille di filo di lino prelevato in corrispondenza della pianta del piede destro con granuli di materiale pigmentato che le indagini di immunofluorescenza hanno dimostrato essere sangue umano.” Translation: “fibrils from a linen thread taken from the sole of the right foot  with granules of pigmented material that immunofluorescence investigations have shown to be human blood.”\nThe same photo is in the 2010 and 2015 books by Baima Bollone with similar caption (lacking the last words). In all cases the photo is rotated with respect to the one shown above. I have not found the photo in books of 1998, 2000 and 2006.\n\n","date":"November 27, 2015 at 9:08 am","url":"https://shroudstory.com/2015/11/27/i-hope-this-helps/","cat":"reader_inquiry","title":"I Hope This Helps"},{"author":"gian_marco_rinaldi","post":"I do not see the pins in the books by Baima Bollone, but, apart that the printed photos are small, the frames are a little reduced as compared with the copies on the internet, that is they are cut on the borders and do not extend to include those corners.\n\n","date":"November 27, 2015 at 12:47 pm","url":"https://shroudstory.com/2015/11/27/i-hope-this-helps/","cat":"reader_inquiry","title":"I Hope This Helps"},{"author":"gian_marco_rinaldi","post":"Hugh, the image side is indicated by Schwortz in the captions as “Side 1” (Top in Fig. 1, Bottom in Fig. 2). The warp threads are in evidence on Side 1 and they run vertically in Fig. 1, horizontally in Fig. 2. As far as I can tell by comparing with a photo of the whole piece of cloth that was removed, this subsample comes from the top part of the (larger fragment of the) original sample. I mean “top” with reference to the standard manner of showing the Shroud, with the C14 corner on top left. The subsample is the same that had already been photographed and published by Jull (and Rachel Freer-Waters) in 2010. It is a pity that Schwortz could not take a photo of the other subsample that should be still extant in Tucson. Such a photo might confirm that the other subsample is the smaller of the two fragments of the original sample. Hopefully, a photo of the other subsample will be soon made available. If Schwortz cannot travel to Tucson again, the photo can be taken by Jull himself or by the staff in Tucson.\n\n","date":"November 22, 2012 at 9:08 am","url":"https://shroudstory.com/2012/11/21/last-update-this-year-to-shroud-com/","cat":"news_&_views","title":"Last update this year to shroud.com"},{"author":"gian_marco_rinaldi","post":"Stephen Jones himself, in a 200 post on his website:\nhttp://theshroudofturin.blogspot.com/2008/11/did-max-frei-misidentify-carduus.html\nwrote that the identification of Gundelia was in doubt. I quote from his text:\n“I have been advised in a private email, which I am not at liberty to quote, that what the late Max Frei identified as Gundelia tournefortii pollen on the Shroud of Turin, had in 2001 been re-identified by a leading palynologist, Bonn University Prof. Thomas Litt, as within the different genus Carduus.”\nJones also refers to a 2008 book in Italian by Avinoam Danin, “L’Uomo della Sindone”, where Danin quotes a sentence from a letter by Litt to CSST (the Whangers). Litt wrote:\n“The images of light microscopy (interference contrast) and by confocal laser-scanning microscopy show clearly that waxes are preserved and cover the structure and sculpture of the pollen grains. This is the reason why I cannot make a precise identification of the pollen at the genus level, even less at the species level. However, with a high level of probablility, I can exclude that the pollen I have seen from the sticky tapes belong to Gundelia.”\nThe report by Litt has not been published, except for the short excerpt above as disclosed by Danin, and it would seem that it is kept secret at CSST since 2001. It is to be hoped that it will be divulged soon.\nGian Marco Rinaldi\n\n","date":"January 24, 2010 at 4:03 pm","url":"https://shroudstory.com/2010/01/22/more-death-certificate-on-the-shroud-of-turin/","cat":"news_&_views","title":"More: Death Certificate on the Shroud of Turin?"},{"author":"gian_marco_rinaldi","post":"Dmitry Anatolievich\n\n","date":"September 30, 2013 at 10:21 am","url":"https://shroudstory.com/2013/09/30/on-dmitry-a-kuznetsov/","cat":"news_&_views","title":"On Dmitry A. Kuznetsov"},{"author":"gian_marco_rinaldi","post":"Dan, thank you for giving notice to my previous comment. I add that in July the American\nmagazine “The Scientist” has published two articles by Kerry Grens about Kuznetsov. In\nthe first article Grens explains that Kuznetsov has been accused of scientific fraud:\nhttp://www.the-scientist.com/?articles.view/articleNo/36299/title/Accused–Fraudster–\nHeads-Two-Journals/\nAs an immediate consequence, Kuznetsov was expelled from his position as chief editor of\ntwo scientific journals, as told by Grens in her second article:\nhttp://www.the-scientist.com/?articles.view/articleNo/36441/title/Editor-Quits-After-\nFraud-Allegations/\nThen Kuznetsov has sent three long letters to Grens that are published as comments under\nthe latter article. I am preparing a counter-reply I will add to my page that you have already\nlinked. I will also add a post-2002 biography of Kuznetsov where his amazing career is\ndescribed.\n\n","date":"September 30, 2013 at 10:25 am","url":"https://shroudstory.com/2013/09/30/on-dmitry-a-kuznetsov/","cat":"news_&_views","title":"On Dmitry A. Kuznetsov"},{"author":"gian_marco_rinaldi","post":"Louis: “Why waste time with him?”. So as to remind sindonologists how easily they can be fooled.\n\n","date":"September 30, 2013 at 2:15 pm","url":"https://shroudstory.com/2013/09/30/on-dmitry-a-kuznetsov/","cat":"news_&_views","title":"On Dmitry A. Kuznetsov"},{"author":"gian_marco_rinaldi","post":"Louis: “Kouznetsov was an exception, and belongs to the past”. It would seem that in Italy he belongs to the present. From the website of Centro Internazionale di Sindonologia, Turin:\nhttp://www.sindone.org/the_holy_shroud__english_/science/00025127_Cloth_dating.html\n“Recent experimental studies (by Leoncio A. Garza-Valdes in San Antonio (Texas) and by Dmitrij A. Kouznetsov and Andrej Ivanov in Moscow) have furthermore opened the sientific debate about the tissue dating once again, with results seeming to prove a possible and considerable chemical and biological contamination of the tissue…”\nIn her website, Emanuela Marinelli has deleted the name of Kuznetsov but continues to quote his results as valid:\nhttp://www.shroud.it/STUDIES.HTM\n7.3 – The fire and the biological patina\nThe high temperature reached during the fire in Chambéry (the case with the Shroud burned during the fire on December 4, 1532) could have caused exchanges of isotopes increasing the radiocarbon, so that the material results in proportion “younger”.\nhttp://www.shroud.it/EVENTS.HTM\n1988:\n… In fact, the 1532 fire could have modified the quantity of radiocarbon in the Shroud, altering its dating.\nBruno Barberis still refers to Kuznetsov in two 2010 books.\n\n","date":"September 30, 2013 at 11:05 pm","url":"https://shroudstory.com/2013/09/30/on-dmitry-a-kuznetsov/","cat":"news_&_views","title":"On Dmitry A. Kuznetsov"},{"author":"gian_marco_rinaldi","post":"Not Avellino. This was the arrival at the “Porta Nuova” station in Turin, 31 October 1946.\n\n","date":"January 20, 2015 at 6:45 am","url":"https://shroudstory.com/2015/01/20/picture-tweet-of-the-day/","cat":"news_&_views","title":"Picture Tweet of the Day"},{"author":"gian_marco_rinaldi","post":"Louis: “Shortly before his death he [Ballestrero] gave an interview saying that he had been “manipulated”.” I would not think that Ballestrero said that he had been manipulated. At any rate, his interview is reproduced here (in Italian):\nhttp://www.mondosindone.com/Site/documenti/DSS001_10%20-%20intervista%20Ballestrero.pdf\n\n","date":"October 18, 2014 at 10:34 am","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"author":"gian_marco_rinaldi","post":"In the text of the Ballestrero interview I linked above, there are just a few spelling mistakes. In particular, the year of the death of Ballestrero is given as 1989 instead of 1998. The interview was published in 1997.\n\n","date":"October 18, 2014 at 10:47 am","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"author":"gian_marco_rinaldi","post":"The interview was first published in “Messaggero di Gesù Bambino di Praga”, the monthly of the sanctuary of Arenzano (near Genova) of the “Padri Carmelitani Scalzi”. I have that issue here at home, even if not at hand at the moment. The text was subsequently reproduced in various places and sometimes with some slight changes. From what I can recall, the text in the above link should probably be true to the original, but I have not checked now.\nIf you can read Italian, there is a 2010 interview with Father Giuseppe Caviglia and he speaks just of the Shroud:\nhttp://www.arenzanotracieloemare.it/IMMAGINI/2010_03_SINDONE/ArenzanoSindone.PDF\nCaviglia, former secretary of cardinal Ballestrero, was the author of the 1997 interview.\n\n","date":"October 18, 2014 at 2:11 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"author":"gian_marco_rinaldi","post":"Some people, prone to conspiracy hypotheses, have made much of this reference to freemasonry, I think that there has been a misunderstanding. I consider this issue in section 16 (“Il cardinale Ballestrero e la Massoneria”) of this critical article about the conspiracy thesis in an Italian documentary, “La notte della Sindone” by Francesca Saracino:\nhttp://sindone.weebly.com/uploads/1/2/2/0/1220953/notte_complottopart_1.pdf\nAs it seems that you both, Louis and Hugh, can read Italian, possibly you might find something interesting, if not just in this article, in some of the many other articles in the website sindone.weebly.com.\n\n","date":"October 18, 2014 at 2:50 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"author":"gian_marco_rinaldi","post":"For “La Notte della Sindone” I have the DVD that was sold until recently, but now I see that amazon.it says that at present it is not available. Possibly it may be found on the second-hand market. The documentary was aired, not long ago, by a national television in Italy (Rete 4). The DVD has some supplementary material besides the television documentary. I have once found the entire documentary online in a Russian site but it was spoken in Russian.\n\n","date":"October 18, 2014 at 6:05 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"author":"gian_marco_rinaldi","post":"Ntesdorf; If you mean the seam, that type of stitch has always been used in the middle ages and down the centuries until now. If you mean the selvedge, it is not true that a similar type has been found in Masada. Would you please name that “seamstress-historian”?\n\n","date":"December 20, 2015 at 10:24 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"author":"gian_marco_rinaldi","post":"Here is the program of Habermas’ tour in Sweden (easily translated with Google):\nhttp://www.credoakademin.nu/images/events/habermas-turne.pdf\nThere are about twenty lectures in various places but the Parliament is not even mentioned.\n\n","date":"October 17, 2013 at 8:19 pm","url":"https://shroudstory.com/2013/10/17/swedish-parliament-to-hear-about-the-shroud-of-turin/","cat":"news_&_views","title":"Swedish Parliament to Hear About the Shroud of Turin"},{"author":"gian_marco_rinaldi","post":"Charles, Flury-Lemberg gives just one example, as far as I know, of a 3/1 twill in wool:\nDominique Cardon, Les damassés de laine de Krokodilo (100-120 apr. J.-C) in: “Bulletin du CIETA”, no. 76, Lyon, pp. 7-21.\n\n","date":"December 20, 2015 at 3:31 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"author":"gian_marco_rinaldi","post":"I have not that article available but some information is here:\nhttp://www.igl.ku.dk/~bulow/Krok97.html\nI quote a passage:\n“Un type de production, représenté par une dizaine d’exemples parmi les textiles étudiés, mais non encore attesté parmi les textiles des autres sites, contemporains ou plus tardifs, du désert Oriental égyptien, s’avère particulièrement intéressant à cet égard: ce sont des sergés bayadères 3 lie 1 / 1 lie 3, dessinant des chevrons sens trame en reliefÝ: or l’exécution de ce type de tissu implique très clairement l’emploi d’un métier à tisser à chaîne horizontale équipé d’un corps de remisse de 6 lisses, donc une machine déjà perfectionnée et dont l’origine et l’introduction progressive dans le monde méditerranéen et en Europe est un problème historique d’importance majeure.”\n\n","date":"December 20, 2015 at 8:56 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"author":"gian_marco_rinaldi","post":"Here is an example of a fragment in 4/1 from Israel, but it is of the Byzantine period (after the 4th century). It is in cotton and Z-spun. Probably it was imported from abroad.\nhttp://www.academia.edu/2276718/Cooke_W.D._and_Shamir_O._2000._A_Textile_from_Deir_Abu_Mghar._In_U._Dahari._Monastic_Settlements_in_South_Sinai_in_the_Byzantine_Period._The_Archaeological_Remains._IAA_Reports_No._9._Jerusalem._Pp._247-248\nThe fragment is very small and the original dimensions are not known. Dimensions are important because for a textile so large as the Shroud a type of loom was necessary that permitted a rather quick execution.\nThe same fragment is also considered in another paper where, among other things, O. Shamir gives information about the chronology of the introduction of cotton in Israel.\nhttp://www.academia.edu/2276733/Shamir_O._2001._Byzantine_and_Early_Islamic_Textiles_Excavated_in_Israel._Textile_History_32_93-105\n\n","date":"December 21, 2015 at 5:27 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"author":"gian_marco_rinaldi","post":"The radiocarbon dating was conducted in Rome, Italy, not in Arizona.\n\n","date":"September 20, 2013 at 4:09 am","url":"https://shroudstory.com/2013/09/19/the-divine-jest-the-shroud-of-turin/","cat":"news_&_views","title":"The Divine Jest: The Shroud of Turin (Amended)"},{"author":"gian_marco_rinaldi","post":"Daveb, the only connection with Arizona is that the paper by Bella and Azzi was published by Radiocarbon (44, 2002, 685-689), a journal from that University. The paper is freely available on the internet. I quote: “Dating was performed in a new radiocarbon (14C) laboratory (“E. Amaldi” Physics Department of “Roma Tre” University) using 2 highly sensitive liquid scintillation spectrometers. Control measurements were performed on samples of known historical dates.”\n\n","date":"September 20, 2013 at 6:50 am","url":"https://shroudstory.com/2013/09/19/the-divine-jest-the-shroud-of-turin/","cat":"news_&_views","title":"The Divine Jest: The Shroud of Turin (Amended)"},{"author":"gian_marco_rinaldi","post":"From this article in the Filipino media, it would seem that the Veil itself will travel there. Far from it. Not the Veil but father Carmine Cucinelli, prior of the Manoppello sanctuary, is going to Manila and other places in the Philippines. In the meantime he is visiting the States (Seattle, San Francisco, Las Vegas).\n\n","date":"September 7, 2014 at 6:17 am","url":"https://shroudstory.com/2014/09/07/the-veil-of-manoppello-to-visit-the-philippines-this-month/","cat":"news_&_views","title":"The Veil of Manoppello to Visit the Philippines This Month"},{"author":"gian_marco_rinaldi","post":"Here were the dates of fr. Cucinelli visit to the USA, from 2 to 7 September:\nhttp://holyfaceofmanoppello.blogspot.it/2014/08/west-coast-of-usa-and-also.html\n\n","date":"September 7, 2014 at 6:25 am","url":"https://shroudstory.com/2014/09/07/the-veil-of-manoppello-to-visit-the-philippines-this-month/","cat":"news_&_views","title":"The Veil of Manoppello to Visit the Philippines This Month"},{"author":"gian_marco_rinaldi","post":"In the paper by Carpinteri et al there is confusion between Nisaea (Isthmus of Corinth, Greece) and Nicaea (Bosphorus, Turkey). They write: “The ‘‘Old Jerusalem’’ earthquake is classified as an average devastating seismic event, that it has also destroyed the City of Nisaea, the port of Megara, located at west of the Isthmus of Corinth.” There is no ancient source for an earthquake in Nisaea. For the source for an earthquake in Nicaea, see:\nhttp://www.textexcavation.com/phlegontestimonium.html\nThe source for Nicaea does not speak of Jesus. Both Nicaea and Nisaea are over 1000 km far from Jerusalem.\n\n","date":"February 17, 2014 at 8:25 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?"}],"opinion":[{"author":"gian_marco_rinaldi","post":"There is no need to consult an expert of ancient Jewish custom for realizing that there are no such images on the cloth. Simply look at the photos (even the same photos where Whanger, Danin or Baima Bollone see all those things). Do you see flowers or coins? No, simply because the images are not there, quite independently from Jewish funerary rituals.\n\n","date":"September 29, 2014 at 8:14 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"author":"gian_marco_rinaldi","post":"As to Baima Bollone, for the “simpulum” coin he has used the 1931 photo that all of us know. The two-dimensional “eidomatic” elaboration of Balossino is here at Fig. 14:\nhttp://www.cicap.org/new/articolo.php?id=273767\nIt is identical to the Enrie photo, only with a stronger contrast and a worse definition. There is also a three-dimensional elaboration that you can see here at the bottom of p. 36:\nhttp://www.cmc.milano.it/Archivio/2010/Approfondimenti/100301Sindone.pdf\nBaima Bollone can read six letters of the coin insciption: the first three (TIB) and the last three (LIS, where I have written S for the Greek “stigma”). Surely you can see them yourselve.\nA couple of years ago I assisted to a lecture of Baima Bollone in Lucca, Italy. One of his slides was the latter photo. At the end of the lecture I went near the screen and asked Baima Bollone to show the photo again. I asked him to point to the letters on the screen. He promptly with his finger pointed at three spots in succession and said: lambda, iota, stigma!\nI have a question for you, Oskar. Baima Bollone saw the three letters LIS on the low-right corner of the photo and in clockwise order. Do you think that the letters (if they existed) should be in that position or elsewhere? And are they in clockwise or counter-clockwise order? Are they specular or not (I mean those letters that are not themselves symmetric)? These questions are relevant because Baima Bollone has sometimes published such photos in different configurations, for example with right/left or top/bottom inversions (I leave it to you to ascertain the configuration of this particular photo). One should consider that Baima Bollone asserts that the coins were put in straight-up position with a vertical axis and that the images on the cloth are imprints, that is they should be specular.\nAs to the flowers of Whanger and Danin, they have published their photos several times. If you think that they have seen the flowers in other photos, not those they have published, you have to ask them, not me, to unveil them.\n\n","date":"September 29, 2014 at 1:01 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"author":"gian_marco_rinaldi","post":"Oskar, can YOU see the flowers and coins, whether in scientific quality or bad-quality photos? And please note that the proponents themselves use bad-quality photos. I have indicated the very same photos that were used by Bauma Bollone. He sees the letters of the inscriptions on them. If you see them you can answer my question in my previous comment. If you don’t see them, you cannot say that it is only I who do not see.\n\n","date":"September 29, 2014 at 2:18 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"author":"gian_marco_rinaldi","post":"From the website (in four languages) of Felicitas Maeder, a Swiss specialist about sea byssus:\nhttp://www.muschelseide.ch/en/biologie/byssus/faseranalyse.html\n“Sea-silk fibres have a smooth surface, are not very regular (compared fibre to fibre) and don’t have any structure.\nThe fibre cross-section is elliptical.\nThe fibre diameter is between 10 and 50 µm.\nUsing infrared spectroscopy, the fibre cannot be distinguished from silk or other animal fibres, because they have a similar chemical structure.\nThe nitrogen content is much lower than in other animal fibres.\nSea-silk is extremely flexible, especially when wet.\nThe resistance is low compared with other fibres, even weaker than wool.\nIn wet state the resistance decreases by about 50%.\nSea-silk fibres are flammable.\n“…………. The cross-section of the byssus fibre is – in contrast to all other natural fibres – significantly elliptical or almond-shaped. It shows no structure.\nThe fibre diameter varies within a single fibre. With 10-50 microns it is comparable with other natural fibres, such as mulberry silk or Egyptian linen 11-15 micron, Merino wool 18-25 micron, cotton 12-35 micron, mohair/alpaca 20-40 microns. From ancient times we know linens of a yarn diameter of 50 microns and a diameter of each fibre of 11 microns (Cook & El-Gamal 1990). So the statement of Zanetti (1964), that sea-silk is much finer than the finest silk – «molto più fine delle sete più fini» – can be refuted.”\n\n","date":"September 3, 2014 at 3:26 pm","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K."},{"author":"gian_marco_rinaldi","post":"Piero: “it is not possible to paint on fabric made of marine byssus”. How do you know that the veil is made of sea byssus?\n\n","date":"September 3, 2014 at 12:02 pm","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K."},{"author":"gian_marco_rinaldi","post":"Oskar, Chiara Vigo was taken to Manoppello by Paul Badde, watched the veil from outside the frame and without a microscope or a magnifying glass and immediately stated that it was sea byssus. And you think that this is a proof? Among other things, sea byssus has a somewhat golden colour. Badde had subsequently to postulate that a miracle had discoloured the threads in the areas where the veil is white. Several students have examined the veil during past years but nobody could demonstrate that it is made of sea byssus.\n\n","date":"September 3, 2014 at 3:02 pm","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K."},{"author":"gian_marco_rinaldi","post":"Moreover it is possible that in the course of time strips of cloth had been cut out at the extremities (under the feet) and originally the Shroud was longer.\n\n","date":"September 9, 2014 at 3:34 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"author":"gian_marco_rinaldi","post":"Hugh: “all the edges of the Shroud are turned over and hemmed”. The most recent and possibly most accurate measurements were done soon after the 2002 restoration. The results are shown on p. 121 in the book (in Italian, English and German) by M. Flury-Lemberg, Sindone 2000, L’intervento conservativo, Editrice ODPF, 2003. It is not there specified that at the time of the measurements the edges were turned over and I presume they were not. (Before the restoration, the short edges were turned over, while the long edges had a selvedge.) In 2002 Barberis and Zaccone took several measurements at various places. For the lenght the values are 4425, 4404, 4399, 4395, 4415 mm. For the width 1137, 1123, 1110, 1111, 1112, 1130 mm.\n\n","date":"September 9, 2014 at 4:35 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"author":"gian_marco_rinaldi","post":"Wilson’s diagram on p. 74 is the very same as given by Flury-Lemberg who has copied it from the volume Masada IV where it is given among several examples from the Masada finds. I cannot tell if this is the seam of the Shroud, but surely is a common type of stitching and by no means exclusive of Masada.\n\n","date":"September 11, 2014 at 4:27 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"author":"gian_marco_rinaldi","post":"The Wilson/Masada diagram has four layers. The reason for the two folds is because each of the borders of the two pieces of cloth is closed and hidden within a fold so as it does not fray out.\n\n","date":"September 12, 2014 at 7:39 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"author":"gian_marco_rinaldi","post":"Farey: “but the weight (“about 2.45 kg) is much more speculative.” The weight was estimated by Piero Vercelli (Turin symposium 2000) as 1140 gr.\n\n","date":"September 8, 2014 at 4:27 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"author":"gian_marco_rinaldi","post":"For the previous values of over 2 kg, possibly somebody added the weight of the Holland cloth and of the borders. For the Holland cloth, Vercelli presumes 910 gr. (Pietro Vercelli: The cloth of the Holy Shroud: A technical product analysis of the cloth and its reproduction with similar characteristics. Pp. 169-175 in Sindon, n. 13, June 2000. Also printed as a volume: The Turin Shroud: past, present and future. International Scientific Symposium. Torino, 2-5 March 2000. S. Scannerini and P. Savarino, eds. Effatà Editrice. The values for the weights are on p. 174.)\n\n","date":"September 8, 2014 at 6:50 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"}],"pollen":[{"author":"gian_marco_rinaldi","post":"Baruch used the microscope that was available at Whanger’s home and had been personally bought by Whanger. Litt had at his disposal the most advanced professional instruments.\n\n","date":"September 15, 2015 at 10:54 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","title":"Doubting the Pollen Evidence"},{"author":"gian_marco_rinaldi","post":"Louis, it is well known that Baruch worked in the private home of the Whangers, while Litt worked in Bonn where he was a university professor and had a specialized laboratory. Baruch used an Olympus AX-70 microscope. Litt (according to Danin) availed of interference contrast microscopy and confocal laser-scanning microscopy, that is the best one could wish for this type of research. If he needed a more ordinary instrument, no doubt he could obtain one. See for example:\nhttps://www.shroud.com/pdfs/daninx.pdf\nhttp://greatshroudofturinfaq.com/Science/Pollen/Gundelia-tournefortii-questioned.html\n\n","date":"September 15, 2015 at 2:29 pm","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","title":"Doubting the Pollen Evidence"}],"researchers":[{"author":"gian_marco_rinaldi","post":"Fanti has compared, on one side, Shroud fibres from the debris collected by aspiration by Riggi in 1978, and, on the other side, control fibres freshly extracted from integer threads. I stressed this point in my critical note that Dan posted here on 4 April in the English translation provided by Hugh:\nhttps://shroudstory.com/2013/04/04/a-critical-review-of-giulio-fantis-new-book-unreliable-results-because-of-inadequacy-of-methods/\nI quote from that translation:\n“We can assume that any fibers of the Shroud collected from the vacuum extractor had deteriorated more than the fibers still enclosed in the threads. Fibers have, in the course of time, detached from the back of the Shroud and become trapped inside the cavity between the cloths, but those that have would be either weaker or more damaged than those which remained in the threads. For example they could be fibers that originally came from areas of stitching or burning or soaking in water or any other places that had suffered damage for some reason.\n“In addition to the fibers that had already become detached in the past, Riggi’s vacuum cleaner could have detached others while it was working, and those fibres, too, would be weaker or more damaged than those which remained. Fanti’s material is thus shown to be unrepresentative in being particularly deteriorated, so it is no wonder that the age he calculated is more apparent than real.”\nFanti did not address this point in his reply to me.\nThe situation is not better if one reads the recent article by Fanti and Malfi:\nhttp://www.aimetatorino2013.it/cdrom/cdrom_pdf_fullpaper/001200008502.pdf\nIn section 4.2 they write:\n“Eight different TS fibers have been recognized as such by the first author among others using a petrographic microscope and a particular technique based on cross-polarization. TS fibers in fact present a greater number of transversal defects (kink bands) than other more recent flax fibers and it is therefore relatively easy to detect them.”\nThese “kink bands”, if I understand well, are twists or bends that denote a weak or deteriorated fibre. One is led to suppose that Fanti for his test has selected the most deteriorated fibres from the Riggi debris!\n\n","date":"December 8, 2013 at 12:57 pm","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"author":"gian_marco_rinaldi","post":"For O.K. Fibers that have detached are more weak, on the average, than fibers that have not detached.\nAnd please do not worry about my “desire” as long as I do not worry about yours…\n\n","date":"December 8, 2013 at 1:29 pm","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"author":"gian_marco_rinaldi","post":"Hugh, it seems that Fanti did not find a relevant effect of heating on Raman analysis. Also in the paper in English he (and co-authors) published in April, one reads:\nhttp://www.sciencedirect.com/science/article/pii/S0924203113000490\n“…. experiments now under analysis on flax textiles exposed to heat sources seem to show the presence of systematic aging effects of some centuries in the FT-IR spectra, effects that are not so evident in the Raman spectra.”\n\n","date":"December 8, 2013 at 6:46 pm","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"author":"gian_marco_rinaldi","post":"The SEM photos that Frei holds in his hands are from the article “Aspetti ultrastrutturali al microscopio elettronico a scansione di fibre della Sindone di Torino” by Ettore Morano, in the Proceedings of the 1978 Turin conference (La Sindone e la Scienza, p. 201). Some photos are printed in the tables on pp. 379-384. In the previous pages 370-378 there are many SEM photos of pollen grains as illustrations of the article by Frei on p. 191. Also these photos were taken by Morano in a hospital of Vercelli. While the photos with the article of Morano are (supposedly) really from Shroud material, it would seem that the photos of pollen grains with the article of Frei are of fresh grains from herbariums or directly from flowers.\n\n","date":"December 24, 2013 at 1:32 pm","url":"https://shroudstory.com/2013/10/02/a-sturp-sequel/","cat":"news_&_views","title":"A STURP Sequel?"}],"resources":[{"author":"gian_marco_rinaldi","post":"David: “Perhaps Garlaschelli may explain us how he got this effect.” As I said, Garlaschelli did retouch. From his report in JIST (July-August 2010):\n“The image obtained can then be completed freehand and improved in a few spots by adding some more pigment, after removing the cloth from the volunteer’s body. This procedure also allows one to rub the pigment more evenly and more easily than when the cloth is resting over a 3D human body. In particular, the “covered,” partially visible hand is a difficult feature to reproduce by rubbing, possibly because the stiff fabric cannot adequately conform to the sharp relief of this spot. Therefore, we completed the prints of the fingers by painting them subsequently with ochre and a small brush. If the mediaeval artist, too, had this problem and solved it in our same way, this would finally explain why the fingers look so puzzlingly unnatural and anatomically unconvincing.”\n\n","date":"November 6, 2014 at 5:15 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"author":"gian_marco_rinaldi","post":"David: “but some deformations imply an ulterior retouch”. This is just what Garlaschelli has done. He has used a real body for the general proportions and has completed the details with retouching by free hand. However some alteration in the proportions may be due to the draping of the cloth and to any slight shifts of the cloth while working. Once I tried (or let somebody try) the execution of the hands by rubbing over the real hands (of a subject with long fingers) and the result was ratehr good even without retouching.\n“… the legs are extended but this is incompatible with the mark of the sole”. Put a man prone (lying face-down) on a bed with the feet extended and one over the other. The cloth can follow any curves of the legs so that it might produce a contact, if any, everywhere along them. The cloth envelops the exposed sole, which is face-up, and the resulting imprint is similar to the Shroud’s. I once tried also with the real feet.\n\n","date":"November 5, 2014 at 7:52 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"author":"gian_marco_rinaldi","post":"David: “The Shroud is not a “medieval artwork” in the usual sense of a portrait or a pictorial scene.” I agree. Indeed I have little doubt that the figure was produced, for the face, with a rubbing method on a basrelief as first proposed time ago by Joe Nickell. For the body, at least partially a similar method was used but with the aid of a real human body, not a basrelief, as recently performed by Luigi Garlaschelli. Therefore it is not even necessary to think that a painter or an artist had a role in the work (a basrelif of a face could easily be found already completed). The “blood” could have been added by anybody, even lacking an artist hand. Any stylistical considerations can only be applied to the sculpture of the face that was used for the rubbing, as far as we can now imagine its appearance. For the rest of the body, apart from the face, there is no artistic style. For example, an artist should have put the long hair also on the dorsal image, where we see only what may well be the imprint of a real human head. Also the feet have no correspondence with any representation ever made by an artist, but can be obtained from the feet of a real body.\n\n","date":"November 5, 2014 at 4:36 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"author":"gian_marco_rinaldi","post":"The Cope of Saint Louis d’Anjou is not herringbone and not three in one in its texture. The diagonal appearances are an added decoration.\n\n","date":"October 28, 2014 at 12:39 pm","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"author":"gian_marco_rinaldi","post":"Hamon, go for example to this page:\nhttp://www.mariemadeleine.fr/index.php/chape.html#livre\nClick and enlarge the photos of details of the cope. Some of the photos are enough close-up to clearly see the texture. In some photos the cloth is only partially covered with the embroidery. Look for example at these:\nWhere is the 3:1 herringbone? And do you think that one needs a medieval textile expert for recognizing the 3:1 herringbone?\nIt is common knowledge among sindonologists that Tite and others tried to find a 3:1 medieval textile for the C14 dating but did not succeed. Now you presume that Tite’s emissaries, Vial and Evin, had a 3:1 herringbone in their hands and did not realize it: big news!\nEvidently you know nothing about the cope of St Louis and I have to suppose that if you challenge me, it is because you hope that I too know nothing. No, Hamon, as a rule people assert something if they know that it is true. And before asking me to give a proof of my assertion, you should better be sure of yours.\n\n","date":"October 28, 2014 at 9:17 pm","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"author":"gian_marco_rinaldi","post":"Hamon, I am happy to leave the last word to you! It is fatiguing to discuss with you and I am too old for bearing the fatigue.\n\n","date":"October 29, 2014 at 10:23 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"author":"gian_marco_rinaldi","post":"Farey: “William Meacham, without giving sources, says: “The thread was hand-spun and hand-loomed; after ca. 1200, most European thread was spun on the wheel.”” During the period ca. 1200-1500 two spinning methods coexisted in Europe: the ancient method with the spindle and the new method with a primitive type of wheel. Some people think that the thread spun with the spindle was worse (less strong, less regular, coarser). The contrary is true. The wheel spinning was worse and was used only because it was quicker and saved time and money. Indeed in many places rules were emanated that prescribed that the warp threads, which had to be stronger, had to be spun with the spindle. Only the weft threads might be spun with the wheel. It so happens that in the Shroud (according to Flury-Lemberg) the weft threads are coarser and less regular than the warp threads. This by itself does not imply that in the Shroud the warp threads were spun with the spindle and the weft threads were spun with the wheel because at any rate it was usual to use better threads for the warp threads. But surely the fact that the threads of the Shroud were “hand-spun” does not indicate that they were produced before 1200.\n\n","date":"October 27, 2014 at 9:47 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"author":"gian_marco_rinaldi","post":"It is official. The announcement of the archbishop is here on the website of the diocese:\nhttp://www.sindone.org/santa_sindone/news_e_info/00045893_Ostensione_2015__annuncio_del_Custode_Mons._Nosiglia.html\n\n","date":"December 4, 2013 at 7:37 am","url":"https://shroudstory.com/2013/12/04/not-yet-an-announcement-but-its-front-page/","cat":"press_coverage","title":"Not Yet An Announcement But It’s Front Page"},{"author":"gian_marco_rinaldi","post":"About Masada. It is true (or so it seems) that the seam of the Shroud is similar to one of the examples of seams from Masata, but it is a common type of seam, not exclusive to Masada, that can also be found, for example, in medieval (and present-day) Europe.\nIt is not true that the selvedge of the Shroud is similar to examples of Masada. The selvedge of the Shroud is peculiar because the weft thread turns around the last and the last-but-one warp thread, alternatively. No similar examples are reported from Masada.\nIt is not true that Flury-Lemberg refers to inexistent texts.\n\n","date":"February 15, 2015 at 6:14 am","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"author":"gian_marco_rinaldi","post":"David, what I wanted to point out is that all the texts that are quoted in Flury-Lemberg’s bibliography do exist. As to their interpretation, it may happen that there is disagreement, of course.\n\n","date":"February 15, 2015 at 2:58 pm","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"author":"gian_marco_rinaldi","post":"1978 or 1988? Gonella and Riggi kept and distributed some material from 1988, and perhaps Fanti himself owns part of it. But as concerns this particular research of Fanti about the dating, it was done with the fibers in the dust collected by Riggi in 1978. This is what I understand from reading the book.\n\n","date":"April 4, 2013 at 4:41 pm","url":"https://shroudstory.com/2013/04/04/a-critical-review-of-giulio-fantis-new-book-unreliable-results-because-of-inadequacy-of-methods/","cat":"books","title":"A Critical Review of Giulio Fanti’s New Book:   Unreliable Results Because of Inadequacy of Methods"},{"author":"gian_marco_rinaldi","post":"Daveb, the facts were widely known at the time in the media in German language. Something can still be retrieved from the internet. I have now done a quick search and have spotted the following. (Note that when Google searching websites in German, you have to insert Max Frei-Sulzer, not simply Max Frei.)\nFrom Wikipedia:\nhttp://de.wikipedia.org/wiki/Fall_Gross\nFrom Der Spiegel 1971:\nhttp://www.spiegel.de/spiegel/print/d-43144609.html\nIn the next page,see second section: “Aus der Tätigkeit des Wissenschaftlichen Dienstes der Stadtpolizei Zürich”:\nhttp://www.nadir.org/nadir/archiv/Repression/bad_kleinen/28objektivitaet.html\nThe next page has a resume of three cases of wrong expertises, and the Shroud is one of them: Falsche Gutachten Die Hitler-Tagebücher, das Turiner Grabtuch, der Gross-Prozess im Aargau – und immer hatte der gleiche Kriminologe die Hand im Spiel\nhttp://www.webcitation.org/6GCbUodC9\nThe texts are in German but can be easily automatically translated.\n\n","date":"August 24, 2014 at 5:16 am","url":"https://shroudstory.com/2014/08/22/coming-out-of-the-closet-on-pollen-and-plant-images/","cat":"books","title":"Coming Out of the Closet on Pollen and Plant Images"},{"author":"gian_marco_rinaldi","post":"Oskar, I have simply given some information that many sindonologists ignored. And I have signed it with my name.\n\n","date":"August 26, 2014 at 5:21 am","url":"https://shroudstory.com/2014/08/22/coming-out-of-the-closet-on-pollen-and-plant-images/","cat":"books","title":"Coming Out of the Closet on Pollen and Plant Images"},{"author":"gian_marco_rinaldi","post":"By 1973 Frei had been completely discredited in his profession. He was the protagonist of a judiciary scandal and a man in Switzerland had been kept 12 years in jail, with a life sentence, as a consequence of wrong proofs given by Frei. Then the Zurich police instituded a commission ot three esperts for judging Frei’s activity in general. The response was negative and Frei hurriedly retired from service. This was in 1972. A year later he came to Turin and began his adventure with the Shroud. It is telling that this circumstance is never mentioned by sindonologists. Apart from this, Frei published photos of reference pollens as if they were pollens from the Shroud and said to have used the SEM, in particular for the 1978 tapes, but this was not true. This is sufficient for doubting of Frei’s reliability.\nBy no means Frei was a pollen specialist. His degree was in Natural Sciences with a thesis on the flora of Sicily, at a time when palynology had scarcely been born. His professional career was as a generic criminalist. As far as I know, he never published a scientific paper about pollens in the specialized literature. His work on the Shroud is sufficient to discredit him as a palynologist: if he pretended to have identified 58 out of 59 pollens at the species level, he was not familiar with the problems of pollen research.\n\n","date":"August 24, 2014 at 2:34 am","url":"https://shroudstory.com/2014/08/22/coming-out-of-the-closet-on-pollen-and-plant-images/","cat":"books","title":"Coming Out of the Closet on Pollen and Plant Images"},{"author":"gian_marco_rinaldi","post":"As to the twist of the threads, a similar statement to Fanti’s can be found in a 2010 book by Roberto Giacobbo (Italian TV journalist): “Templari, dov’è il tesoro?”, p. 119. I translate:\n“The particular twist of the linen thread [of the Shroud], which is that described in the Bible (Exodus, 28, 6-8) for making the sacred dress of the high priest of Israel.”\nI copy this passage from Exodus in a standard translation. There is no mention of Z or S twist.\n“6 Make the ephod of gold, and of blue, purple and scarlet yarn, and of finely twisted linen—the work of skilled hands. 7 It is to have two shoulder pieces attached to two of its corners, so it can be fastened. 8 Its skillfully woven waistband is to be like it—of one piece with the ephod and made with gold, and with blue, purple and scarlet yarn, and with finely twisted linen.”\n\n","date":"April 17, 2013 at 6:27 pm","url":"https://shroudstory.com/2013/04/16/giulio-fanti-responds-to-gian-marco-rinaldis-book-review/","cat":"books","title":"Giulio Fanti Responds to Gian Marco Rinaldi’s Book Review"},{"author":"gian_marco_rinaldi","post":"Fanti has a new chapter about Byzantine coins, 70 pages (pp. 131-200) with many photos of coins. He does a quantitative statistical analysis of the details and concludes that there is an almost absolute certainty that the coins had been copied from the Shroud, with odds of 1 against something of the order of 10^-15. Needless to say, I am not convinced…\n\n","date":"February 26, 2014 at 10:43 pm","url":"https://shroudstory.com/2014/02/26/giulio-fantis-book-launched/","cat":"books","title":"Giulio Fanti’s Book Launched"},{"author":"gian_marco_rinaldi","post":"Daveb: “All other evidence suggests it is 1st c.” I know of only one piece of evidence, the Pilatus coins. Try looking at a good photo of the Shroud: can you see the coins and the letters of the inscriptions? As to the “pioneer experiments” of Fanti, he has compared the minute fragments of fibres collected among the debris and dust of Riggi’s aspirator with fibres freshly extracted from whole threads. No wonder if the Shroud fibres (if really they are from the Shroud) are weaker and more deterorated.\n\n","date":"January 28, 2014 at 4:13 pm","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"author":"gian_marco_rinaldi","post":"The name is Mark Andersen, not Anderson.\n\n","date":"December 11, 2011 at 3:49 pm","url":"https://shroudstory.com/2011/12/11/mark-anderson-disputed-walter-mccrone-substantiated/","cat":"books","title":"Mark Andersen Disputed Walter McCrone. Substantiated?"},{"author":"gian_marco_rinaldi","post":"@ Louis. I think it is probable that Fanti really took the debris from Riggi’s filters and that Riggi aspirated from under the cloth of the Shroud, but in so aspirating he could collect also fibres from the Holland cloth, from the many patches and from any other inquinating source.\n\n","date":"January 28, 2014 at 4:41 pm","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"author":"gian_marco_rinaldi","post":"I have just published a critical review here:\nhttp://www.queryonline.it/2013/04/04/sindone-le-datazioni-alternative-di-giulio-fanti/\nIt concerns only the third chapter of Fanti’s book about the new dating methods. Sorry it is in Italian.\n\n","date":"April 4, 2013 at 8:13 am","url":"https://shroudstory.com/2013/04/04/sales-and-amazon-reviews-of-fantis-new-book/","cat":"books","title":"Sales and Amazon Reviews of Fanti’s New Book"},{"author":"gian_marco_rinaldi","post":"I have translated into English my 2002 inquest on Kuznetsov, originally in Italian (a biography of Kuznetsov up to 2001 and an analysis of his papers from 1989 to 2000). Moreover I have published an account of my recent inquest on papers he published after 2002 (the latter do not concern the Shroud). Here is the link:\nhttp://sindone.weebly.com/kuznetsov-special.html\n\n","date":"September 30, 2013 at 4:01 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"gian_marco_rinaldi","post":"Daveb, this sewing, or some variants of it, is quite simple and it is the obvious means of joining two pieces of cloth so as to render the seaming less visible on the front side. All women who have some practice of stitching know it. There is no reason to think that it was not known in medieval times. Indeed there are examples from medieval times which are analogous but more elaborate.\n\n","date":"November 28, 2013 at 10:46 pm","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","title":"Unraveling Unusual Stitches in the Turin Shroud"},{"author":"gian_marco_rinaldi","post":"For the variety of medieval seams, see for example:\nhttp://heatherrosejones.com/archaeologicalsewing/index.html\nLook also at the wool samples which are more numerous.\nOther examples are here:\nhttp://nvg.org.au/documents/other/stitches.pdf\nThere are examples that are similar but more complex than the sketch in Masada IV, but if medieval people were able to do a complex seam they were also able to do a simple one. I would add that the seam on the Shroud might itself be of a complex variety because the underside edges appear to be somewhat rolled and not flat as they should be in the basic “flat felled” type.\n\n","date":"November 29, 2013 at 8:08 am","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","title":"Unraveling Unusual Stitches in the Turin Shroud"},{"author":"gian_marco_rinaldi","post":"Here is a reference for Mechthild Flury-Lemberg: “The linen cloth of the Turin Shroud: Some observations on its technical aspects”, “Sindon”, n. 16, December 2001, pp. 55-76. I copy from p. 59-60:\n“The seam that connects the 8 cm wide strip to the larger segment is not a simple one. The type of seam construction chosen clearly displays the intention to make the seam disappear on the face of the cloth as mucu as possible. This is another reason to believe that the Shroud was planned and produced by professionals. The sewing has been done from the reverse of the fabric and the stitches have been executed with great care and are barely noticeable on the face of the Shroud (fig. 3a). The seam appears flat on the face (fig. 3b) and raised like a roll on the reverse of the fabric (fig. 3c). Examples of this same kind of seam are again to be found among the textile fragments of Massada [5] (fig. 3a), already mentioned above. To conclude this chapter it can be said that the linen cloth of the Shroud of Turin does not display any weaving or sewing techniques which speak aginst its origin as a high quality product of the textile workers of the first century A.D.”\nSo far Flury-Lemberg. Her figures 3abc are photos of details of the Shroud. Her second mention of fig. 3a is to be intended as another figure on the same page with the scheme or drawing of the stitch from the Masada IV volume, fig. 23 p. 171.\nThis article is the translation of the original German text of Flury-Lemberg that had appeared in a previous volume of the same journal: Sindon n. 13, June 2000. That volume contains the proceedings of the March 2000 Turin Symposium. I can also provide the German text but it seems that this English translation is correct.\n\n","date":"November 28, 2013 at 9:22 pm","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","title":"Unraveling Unusual Stitches in the Turin Shroud"},{"author":"gian_marco_rinaldi","post":"You should read chapter five of this book (chapter two in the Italian edition), in particular the third and last section. If the contents has not been changed in the English edition, then you discover that Fanti has accurately selected the most damaged fibres for the experiment. Indeed he wanted to distinguish between the fibres of the Shroud and the fibres of the Holland cloth, He thought that the Shroud fibres are much older and used the microscope for individuating the most “old” fibres. No wonder that he ended up with really “old” fibres! This was a second selection of the worst fibres. There had been a first selection because the fibres in the dust collected by Riggi cannot be compared with the fibres freshly taken from whole threads for the control samples.\n\n","date":"June 28, 2015 at 11:19 am","url":"https://shroudstory.com/2015/06/28/update-on-new-book-by-giulio-fanti-and-pierandrea-malfi/","cat":"books","title":"Update on New Book by Giulio Fanti and Pierandrea Malfi"},{"author":"gian_marco_rinaldi","post":"Searching Google for “Materials Evaluation Subject Index. 1942 to 2013” one finds a PDF where the name Andersen does not appear, nor any papers in volume 40 beginning on p. 630. It seems that this quote is only given by the Wikipedia page for the Shroud.\nThe matter was considered by Porter in this blog in 2011:\nhttps://shroudstory.com/2011/12/11/mark-anderson-disputed-walter-mccrone-substantiated/\nAlso by Porter in his “An open letter to journalists” that can be retrieved with archive.org as captured in 2008. It would seem that the Andersen story is a hearsay with only Ray Rogers as a source. If really there is a printed source authored by Andersen himself, it is strange that sindonologists have not yet been able to obtain it.\n\n","date":"August 22, 2014 at 12:48 pm","url":"https://shroudstory.com/2014/08/22/looking-for-a-paper-by-mark-andersen/","cat":"paper_chase","title":"Looking for a paper by Mark Andersen"},{"author":"gian_marco_rinaldi","post":"Daveb: “in the seismic zone of Piedmont”. De Liso lives west of Turin, bordering on France. It is not a seismic zone as you may check on a seismic map:\nhttp://zonesismiche.mi.ingv.it/mappa_ps_apr04/italia.html\n\n","date":"March 4, 2015 at 3:19 am","url":"https://shroudstory.com/2015/03/03/nine-selected-and-revised-papers-from-the-bari-conference/","cat":"paper_chase","title":"Nine Selected and Revised Papers from the Bari Conference"},{"author":"gian_marco_rinaldi","post":"Here in Italy we have long been acquainted with De Liso’s claims. I fear that even sindonologists (not to speak of the skeptics like me) have not given much attention to them.\n\n","date":"March 4, 2015 at 7:55 am","url":"https://shroudstory.com/2015/03/03/nine-selected-and-revised-papers-from-the-bari-conference/","cat":"paper_chase","title":"Nine Selected and Revised Papers from the Bari Conference"},{"author":"gian_marco_rinaldi","post":"M.P. Hamon was at the Frascati (Italy) conference in May 2010. An extended abstract of his presentation (in English) may be seen here:\nhttp://www.acheiropoietos.info/abstracts/poster.html\nHere too, the subject is about the coins over the eyes.\nI copy the unusual credentials of Hamon:\n“Former professor at the University of Riyadh (Kingdom of Saudi Arabia)\nFounder and director of LE CERCle (Office for Studies and Research in Cryptology), Reze (France)\nIndependent researcher in Late Antique and Medieval archaeoperceptive cryptology”\nHis address was in France.\n\n","date":"October 23, 2011 at 1:50 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue"},{"author":"gian_marco_rinaldi","post":"Farey: “I had no idea Fanti’s book had been published elsewhere.” The 2014 book by Fanti (with P. Malfi) is not another edition of the 2013 book. It is a different book: “Sindone: primo secolo dopo Cristo!”. Here one discovers that the situation is still worse. Among the many fibres of Riggi’s debris, Fanti, after observing them with a petrographic microscope, has selected only a few fbres for the experiments and has selected the most damaged ones. In this way he thought to distinguish the fibres from the Sfroud from fibres from the Holland cloth.\n\n","date":"January 11, 2015 at 10:22 am","url":"https://shroudstory.com/2015/01/08/an-early-morning-google-find/","cat":"video","title":"An Early Morning Google Find"},{"author":"gian_marco_rinaldi","post":"The video is now online:\n\n“Giulio Fanti and the Turin Shroud!\n\n","date":"January 8, 2015 at 6:31 am","url":"https://shroudstory.com/2015/01/03/television-an-italian-professor-believes-he-has-the-answer/","cat":"video","title":"Television:  An Italian Professor believes he has the answer."}],"sudarium":[{"author":"gian_marco_rinaldi","post":"Marzia Boi has never had a pollen specimen from the Shroud at her disposal. She has only seen a bad-quality photo of a grain that had been published by Baruch and says that it is a grain of Helicrysum. Baruch said it was Gundelia. Litt observed similar grains on the tapes with good microscopes and said that it was not possibe to determine the genus. Nobody, apart from Boi, has ever seen Helicrysum on the Shroud.\nThe genus Helicrysum contains about 600 species that grow in various geographical areas, not just in Israel. Here where I live, at the seaside of Tuscany, we have plenty of Helicrysum.\n\n","date":"February 15, 2015 at 7:10 am","url":"https://shroudstory.com/2015/02/15/important-new-pollen-discovery-on-the-sudarium-of-oviedo/","cat":"press_coverage","title":"Important New Pollen Discovery on the Sudarium of Oviedo?"},{"author":"gian_marco_rinaldi","post":"El Gayo, if Boi had ever had a specimen from the Shroud at her disposal, she should have clearly stated it.\n\n","date":"March 3, 2015 at 12:03 am","url":"https://shroudstory.com/2015/02/15/important-new-pollen-discovery-on-the-sudarium-of-oviedo/","cat":"press_coverage","title":"Important New Pollen Discovery on the Sudarium of Oviedo?"}]}
