{"hsg":[{"id":"comment-143390","author":"gio/hsg","post":"My kids always say I need new materials because my jokes are always horrible. I guess that goes for my novella joke as well. David, as far as “writings” Raes in particular, try contacting Remi Van Haelst, he may have had direct correspondence with Raes. My collection mostly consist of HSG correspondences. However, many of the researchers and various groups felt obligated to CC most correspondences to Farther Otterbein, who was the President of HSG. Father Kim was one such person. Keep in mind, it was important to keep the Guild informed in all studies and formal conversation because The Guild had the best connections with the Turin’s Shroud authority to establish future testings and fundings. Eventually, when I am done with studies, I will be revamping the HSG site next year to include many of these correspondences. Some are marked strictly confidential which I must respect however, I maybe able to redact some of these “writings” and upload them to a site that will be password protected..","date":"2014-08-11","mins":"8:31 am","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries"}],"researchers":[{"author":"gio","post":"It's odd. From the little I've read of him, Mr. (Dr.?) Freeman always rubbed off as a relatively honest historian, at least for somebody who writes on the topics he does with the views he does.But this piece seems largely polemical, especially when he starts with as blatant a falsehood as that interest in the Shroud has been confined to the last 50 years!.","date":"2012-07-06","mins":"3:33 AM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n"},{"author":"gio","post":"Hi Mr. Jones,I found this blog post in a Google Search and am glad to have read it. I wanted to bring to your attention an article a skeptic pointed me to on the Shroud online. It's here:http://www.sillybeliefs.com/shroud.html#heading 1rc I wasn't totally convinced by it but couldn't answer all its points. You seem to be very knowledgeable on the topic so I figured you might be interested..","date":"2011-02-18","mins":"3:09 AM","url":"http://theshroudofturin.blogspot.com/2009/12/shroud-of-turin-is-burial-sheet-of.html","title":"\nThe Shroud of Turin is the Burial Sheet of Jesus!\n"}]}
