{"art":[{"author":"giorgio_hsg","post":"Examining the original Enrie’s fiber base prints in my possession that Father Filas used, the lepton coin markings are nothing more than the actual thread’s weave. That’s it.  (I’m discussing only the markings pointed out by Filas). I’m sorry if I sound like Dr. McCrone and relying on my heuristic inference in film, but after 42 years in the industry and still counting, I’m confident in my statement.\n\n","date":"June 20, 2015 at 9:25 am","url":"https://shroudstory.com/2015/06/20/the-eyes-have-it/","cat":"pareidolia","title":"The Eyes Have It?"},{"author":"giorgio_hsg","post":"Research showed that Fr. Filas read a report from Jumper, Stevenson, and Jackson titled, “Image of coins on a burial cloth?”  Using the VP-8 image analyzer the report states, “revealed objects resting on the eyes, objects which resembled small disks or buttons”. They further investigated the customary of jewish burial customs and were told that it was customary to place objects over the eyes of the dead.\nThe report also stated, “With the photographic work, we hope to obtain very fine quality pictures which, among other things, can be used to take much of the noise out of the image, noise present, for example, from the weave pattern of the cloth”. \nBased on this report, Father Filas used it as a resource and conducted his own experiment after he believed that he too saw an object from an Enrie copy given to him by the Holy Shroud Guild.\nAndy I recommend you start with Haralick’s “Analysis of digital images of the Shroud of Turin”.\n The Spatial Data Analysis Laboratory was given an 8×10 copy negative produced at Gamma labs. and 5×7 prints from a 20×24 print that was manufactured from the 8×10 copy negative.\nFigure 8, from “Analysis of digital images of the Shroud of Turin”, shows a severally reduced gamut from the original fiber base print. At this point there is no longer a relation from the original photograph to this copy. Any further investigation now needs to evaluate the differentials of the characteristics of the original image to the copies; which would include, film curve characteristics, processing characteristics, lens and film dynamic range, optical resolution, film fog from bellows extension, reciprocity and so on. All of these effects were overlooked which, makes the Haralicks report, virtually useless. As we say in the industry, GIGO\n\n","date":"June 20, 2015 at 4:36 pm","url":"https://shroudstory.com/2015/06/20/the-eyes-have-it/","cat":"pareidolia","title":"The Eyes Have It?"},{"author":"giorgio_hsg","post":"I am providing a link of 4 images inside one document of the section of the eye where the lepton coin is present. The top row marked 1 & 2 are scanned from the gamma prints at 800 dpi. Image 1 contains the overlay for reference and image 2 does not.\nImage 3 and 4 are overlaid with the original scans from the Enrie photo at 800 dpi. Image 3 the image opacity was set at 50% and image 4 is set at 100%. ","date":"June 20, 2015 at 9:50 pm","url":"https://shroudstory.com/2015/06/20/the-eyes-have-it/","cat":"pareidolia","title":"The Eyes Have It?"},{"author":"giorgio_hsg","post":"If I have volunteers in this group, I will be happy to provide my high resolution scans of the area of the coin from the positive and negative fiber base prints of Enrie that Father Filas used.  I would than conduct a survey tallying either nay or yea with two open ended questions. I would like to have at least 30 participants. Let me know if anyone is interested.\n\n","date":"June 20, 2015 at 9:44 am","url":"https://shroudstory.com/2015/06/20/the-eyes-have-it/","cat":"pareidolia","title":"The Eyes Have It?"},{"author":"giorgio_hsg","post":"I did come across Lynn’s paper I’ll keep you posted.\n\n","date":"June 20, 2015 at 11:47 am","url":"https://shroudstory.com/2015/06/20/the-eyes-have-it/","cat":"pareidolia","title":"The Eyes Have It?"}],"dating":[{"author":"giorgio_hsg","post":"About the Quad Mosaic photo. Was there a reference exposure guide (AIM POINT) for the densimetric readings for the three filters exposing the black and white films? Does anyone see  gray balance in the quad mosaic image in any area of the exposure? \nCan someone please explain to me how this image can be used for chemical analysis in a serious discussion if exposure alone can cause color cross-overs as seen in the quad mosaic image.\n\n","date":"March 8, 2015 at 4:35 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"author":"giorgio_hsg","post":"http://motion.kodak.com/motion/uploadedFiles/H-1-2238t.pdf\nThe aims of  measurements are:\nRed: 1.10\nGreen: 1.40\nBlue: 1.50\nThese figures are used to achieve gray balance.\nThis concept is used today for G7 and Fogra printing standards.\nThe three point wedge scale was also used to determine if the internegative emulsion had inherent cross overs that would make it impossible to balance transparencies for C printing. My responsibility was to inform Kodak and report the batch number to stop production of the film.\nIf we were to follow the logic of the Blue Quad Mosaic process any subject I photograph (Tri Exposure) will basically reflect, transmit and absorb light based on the chemical elements pertaining to the subject resulting to an imperfect color corrected image using the above aims. So without any calibration standards, I concur OK, it adds little to our knowledge.\n\n","date":"March 8, 2015 at 8:06 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"author":"giorgio_hsg","post":"Can it be fair to say that these images have more to do with differential analysis vs. chemical analysis. And if so, any conclusion derived from this analysis, is speculative. However,in fairness, it may have merit with further studies.\n\n","date":"March 23, 2015 at 8:19 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"author":"giorgio_hsg","post":"Louis, I think we had this discussion once before. But let me begin with this analogy, to the Italians it’s a Gioconda and to the rest of us, it’s the Mona Lisa. To put it more bluntly, The Shroud of Turin is very Italian and very Catholic. Any other perspective requires a high social intelligence that intrinsically we haven’t yet achieved as a species. The sociology to any group has its own structure. Regardless if we’re discussing street gangs, cosa nostra, academia, or any other group, you play by their rules. You respect their protocol. The first two groups you would because it’s a matter of life and death. Academia, and others who are deemed to possess a higher social order, still have a threshold and metaphorically speaking if you pass it, your dead with them too. As well intended STRUP was, some members did cross that threshold. Their intensions were noble, but they lost sight of the cultural difference especially when dealing with ordained priests who had ownership of the Shroud.\nMy advise, When in Rome do like the Romans………………We may disagree with the C14 protocol, however, preservation was the Church main priority, not authenticity. \nAllow me to go a step further.\nLet’s suppose the  the Shroud is proven to be an man-made artifact manufactured  for veneration ( a passage was found on the Shroud and it clearly states, “dry clean only”).\nA wonderful scientific achievement of its time that was superbly crafted and used to evoke spiritual inspiration. To Italians and Catholics it will still be revered as a great achievement and embraced as one of theirs.  And what of the other faiths, and other nationalities?  How will they accept the Shroud? would it be considered Idolatry? Personally to me, its authenticity is irrelevant, its existence itself, is the miracle.\n\n","date":"September 7, 2015 at 9:57 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"author":"giorgio_hsg","post":"Dear Joe, allow me to clarifying ownership: it is meant in the business sense you own the task. “The objective”. That is what I meant by ownership. In reality, the Italian state owned the Shroud up until 1983. Here lies another example by playing by the rules.\nCompare the Italian’s 1973 studies to STURPS. The sensationalism that occurred after the STURPS studies were not warmly received by Turin nor the Vatican. Legally, The Shroud was owned by the State. The Turin authority feared that McCrone, Father Filas, and all the other sensational press releases could have started a confrontation between Italian State and the Church for ownership of the Shroud.  \nI agree with Louis assertion that there won’t be another examination in our life time. What’s the gain for the Vatican.\n\n","date":"September 7, 2015 at 10:47 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"author":"giorgio_hsg","post":"“Nevertheless Umberto II as head of Savoy but in self-imposed exile, clearly continued to assert his claim of ownership of the Shroud until his death in 1983, when his will bequeathed it to the Pope and his successors. As far as is known, the Italian government as such has never asserted any claim of ownership, nor did the Italian government ever challenge the terms of the will making this bequest”.\nThe Italian Government never made claim but they could have at any time. My hats off to the government appreciating the importance this relic means to many throughout the world. As for Umberto’s self imposed exile? I believe you mean his fathers. The Italian constitution  forbade male descendants of the House of Savoy from entering Italy. This provision was removed in 2002 after 55 years upon numerous years of  pleading by Vittorio Emanuele, Son of Umberto. Umberto himself, was not even granted access to return to Italy for burial.  As for Vittorio, in order to achieve a return to his homeland, Vittorio had to renounce any claim to the throne and to Italy’s crown jewels. He publicly assured the Italian government that the nation and the crown properties, confiscated by the State in 1946, “are no longer ours”, referring to the House of Savoy. “For that matter we have no claim on the Crown jewels”, he said. “We have nothing in Italy and we are not asking for anything. And it was for this reason, why the Turin authority was concerned about the McCrone and other issues being printed in the press.\nAs far as ownership, as I explained to Joe, the meaning is a jargon we use for leadership in business. The “Turinese guardians” had ownership meaning to meet their objective and not be influence by external forces. I did not mean to suggest that they own the Shroud.\n\n","date":"September 7, 2015 at 9:47 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"author":"giorgio_hsg","post":"Were there other fibers found in 1EB and 6BF in Roger’s examination?\n\n","date":"September 5, 2015 at 11:52 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"author":"giorgio_hsg","post":"Of course the answer was yes. \nExcerpts From Dr. Nitowsk’s Criteria for Authentication:\nA Procedure for the Verication·of Shroud Samples\n” In September of 1982, Rogers gave Joseph Kohlbeck the Mylar tapes\nwhich he had gotten back from McCrone, minus the 22 which Adler has.\nKohlbeck began photographing them, and lifted several samples from\nthe tapes for experimentation with Rogers’ permission. His tests\nincluded the remounting of red particles, which turned black in oil,\nand the identication of calcium from the “bloody foot” area as\naragonite” .\nObservations by Dr. Kohlbeck and Dr. Nitowski\n1EB\nSlide 37: Flax and other fibers\nSlide 38-39: Particle (blood?)\nSlide 41: Flax fibers: 1 half image and half non-image, burned; contaminating fibers.\nslide 45: Flax and contaminating fibers.\nSlide 47: Flax fibers and red silk.\nSlide 48: Flax fibers and chunk of aloes.\nSlide 49: Particle (blood?) encrusted fiber and calcium.\nSlide 53: Flax- and contaminating fiber.\n6BF\nSlides 417-419: #417 after 3 months of being remounted in Cargille\ntype A immersion oil 1.515. The red particles have\nturned to black and exuded a yellow substance.\nSlide 431: Particle encrusted fiber.\nSlide 434: Variegated red contaminating fiber.\n\n","date":"September 5, 2015 at 1:50 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"author":"giorgio_hsg","post":"Hugh, I’ll be happy to answer your questions but will need some time to respond. What I do know, I’ll answer.\nBut believe me when I tell you, I’m as confused as you.\nIn the mean time, take a look at this page (slides two and four)…..http://www.holyshroudguild.org/dr-nitowski-images.html \nThese are images I scanned form the Nitowski slide library. (I do have the full collection of Dr. Nitowski and Kohlbeck’s slides). You can see in slide two how Dr. McCrone adhered the sticky tape to the slide with cover. Slide four I believe shows the remounting by Dr. Kohlbeck. \n(two sets were made)\nAccording to Dr. McCrone, Page 78, “Judgement day…….”\nMcCrone split them into two; “One for Ray and one for me”.  On page 124 McCrone discusses the return of his tapes. “Among other things, remarks were made inferring that I had kept the best of the two sets”. McCrone further continues how he gave Rogers back his set of slides with the assurance he would be able to pick up the other set already in Rogers possession when he returns to Los Alamos in two weeks. McCrone was never able to retrieve them. \n(Why no mention of the other two)\nIf you search the SSG archives for Rogers statement about Dr. Nitowski, your answer will be found. As far as Dr. Kohlbeck, he was only to perform top quality photomicrographs; Nothing more.\nBut it was Kohlbeck’s research that gave light to the invisible weave threat simply by using caragille oil. \nI remember the days I too used it for drum scanning.\n\n","date":"September 5, 2015 at 4:59 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"author":"giorgio_hsg","post":"theory  not threat\n\n","date":"September 5, 2015 at 5:00 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"author":"giorgio_hsg","post":"Hugh writes “Furthermore, the three slides sent to Rogers were, according to Nitowski, 3BF, 3EF, and 6AF. Is that three original tape samples (six slides) or three of the half samples prepared by McCrone”?\nPaul Maloney from ASSIST asked if he could look at some of the sample sticky tape Nitowski and Kohlbeck received from Rogers. Dr. Kohlbeck sent 3BF, 3EF, and 6AF to Paul. However, when Ray was notified by the transfer he demanded them back from Paul. \nHugh writes “And how did Kohlbeck remove his samples for remounting”? \nI don’t know the answer. All I can state is what sticky tape Kohlbeck personally photographed by Nitowski’s slide catalog from which I couldn’t tell you which slides were in fact remounted.\nHugh writes “Even more extraordinary is Dr Nitowski, writing years before Rogers claimed to have carried out his observations on his Raes sample, finding, with Dr Kohlbeck, lots of starch and a heavy coating which came away from the fibres beneath. These findings are exactly what Rogers found eight years later, and were communicated to him, but he makes no mention of that at all in his Thermochimica Acta paper, nor of the fact that this thread had been soundly denounced as a fake”.\nI couldn’t agree with you more  about why these observations by Nitowski and Kohlbeck wasn’t mentioned. The absent of mentioning there findings was always problematic for me.\n\n","date":"September 5, 2015 at 7:46 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"author":"giorgio_hsg","post":"No mention that there was two sets of slides in any of Nitowski’s note. My best educated guess, one set of slides were given and it was from the original set McCrone possessed.\n\n","date":"September 5, 2015 at 11:49 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"author":"giorgio_hsg","post":"notes\n\n","date":"September 5, 2015 at 11:50 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"author":"giorgio_hsg","post":"Hugh if you can make sense of all this, you’ll be chief of Scotland Yard. Thibault and I shared many notes together and we both came up with different conclusions about the validity of Thermochimica Acta.  Personally, I concluded that cognitive bias is why Thibault and I walked away with different conclusions. As I stated before, there was never due diligence in securing chain of custody or procedural documentation done to the sticky tape once  released to other researchers.\n\n","date":"September 6, 2015 at 10:08 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"author":"giorgio_hsg","post":"Hugh, I believe most of Rogers belongings are with Barrie, but please allow him to confirm that.\nAbout the Aragonite I think it’s good science however I don’t believe Levi-Setti voiced his opinion on the matter (See below abstract and conclusion).  My understanding is he provided the finger-prints of the positive and negative Secondary Ion Mass Spectra (SIMS) of the fibers of the Shroud and the limestone of tombs near the Damascus Gate in Jerusalem to Kohlbeck. It was Kohlbeck (Nitowski) who determined that there was a correlation between the tomb and the trace of aragonite found on the linen not Setti.  Based on Setti’s conclusion from his paper, it seems he would have been more cautious without further studies. Does anyone have any evidence to show that Setti was behind Kohlbeck’s conclusion? I have not found any in the Guild’s archives.\nPROGRESS IN HIGH RESOLUTION SCANNING ION MlCROSCOPY\nAND SECONDARY ION MASS SPECTROMETRY IMAGING MICROANALYSIS\nR. Levi-Setti.* G. Crow and Y.L. Wang\nAbstract\nThe performance of a new high resolution scanning ion microprobe\n(SIM) is elucidated with regard to imaging capabilities\nusing the ion-induced secondary electron (ISE) or secondarv\nion (ISi) signals, and the mass-resolved signal from a seco;dary\nion mass spectrometry (SIMS) system. The new instrument\nfocuses a beam extracted from a liquid metal ion source (LMIS)\nto a range of spot sizes reaching the 20 nm level. The probe\ncurrent (1.6 pA) available at this level of lateral resolution. which\napproaches the theoretical resolution limits of the SIMS method,\nis still adequate to obtain detailed isotopic maps for surfaces\nrich in the elements of low ionization potential (positive ISI),\nor high electron affinity (negative ISi) . In addition to examples\nof high resolution ISE and ISi images of objects displaying sufficiently\nsmall topographic detail, mass spectra and isotopic maps\nare shown, testing both the lateral and depth resolution attained.\nThe latter results belong with a program of interdisciplinary research\napplications of the new microprobe, which include studies\nof e.g., the monolayer lateral distribution of intercalant in SbCI5\nintercalated graphite and of silicate minerals and iron distribution\nin sections of Chondrules and their rims (components of\nchondrites. a class of stoney meteorites). In the biomedical field.\nthe new microprobe finds application in e.g., the srudy of human\nrenal calculi and bone. Most promising is the use of stable isotope\ntracers (e.g. , C:.44 ) to unravel the dynamics of bone\nmineralization, as thus far shown with the in-vitro culture of\nthe skull bone of neonatal mice\nConclusions\nWithin the limiiations of our initial exploration of high spatial\nresolution SIMS imaging microanalysis. several novel structural\nfeatures in a variety of materials have been brought to light which\nhad escaped detection by other microanalytical methods. A combination\nof factors. including high spatial resolution and low\nprobe intensity have contributed at times unexpectedly. One\ncannot refrain from the overwhelming desire to observe many\nmore old objects with new eyes.\nAt the same time it is felt that such observations need be accompanied\nby a new generation of systematic SIMS studies. in\nwhich the peculiarities of the interaction and implant of metal\nions used as probes may be understood and quantified.\n\n","date":"September 6, 2015 at 12:38 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"author":"giorgio_hsg","post":"Charles to your point about Gove, In 1978 the cardinal directed\nMons. Caramello to give Gonella several threads from the two\nsamples available since the exposition in 1973. However, much resistance from Baima and others to cooperate with STURP makes it feasible what threads were given to Father Rinaldi who transferred one thread to Jackson to be given to Rogers might have been in fact samples from the Princess Clotilda’s collection that Baima had in his possession. \nIt was a very contemptuous relation between the two parties anything is possible.  \nHSG archive\nDecember 6, 1979\nDear Father Rinaldi:\nI hereby certify that today I have\nreceived from you (l fragment of a thread\nfrom the Holy Shroud of Turin.\nIt is my understanding that said\nfragment is to be entrusted to Ray Rogers~\nof losa Alamos, N.M., as per request of\nProf. Luigi Gonella, of Turin, Italy.\nJohn  P. Jackson\n\n","date":"September 6, 2015 at 1:41 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"author":"giorgio_hsg","post":"Dan these questions and the content of the reading has yet to be approved by my mentor. I’ll will let everyone know when the survey is ready. Until then, please if you can remove this post until further notice hopefully in two weeks.\nThank you\nGiorgio\n\n","date":"November 30, 2014 at 10:56 am","url":"https://shroudstory.com/2014/11/30/the-raes-samples-that-rogers-used-had-been-switched/","cat":"carbon_14_dating","title":"The Raes samples that Rogers used had been switched?"},{"author":"giorgio_hsg","post":"It’s best that we leave it as it is. I’ll just place a password on the survey so no one can gain access until it’s ready.\nThanks\nGio\n\n","date":"November 30, 2014 at 12:10 pm","url":"https://shroudstory.com/2014/11/30/the-raes-samples-that-rogers-used-had-been-switched/","cat":"carbon_14_dating","title":"The Raes samples that Rogers used had been switched?"},{"author":"giorgio_hsg","post":"A statistician, and business professor. I’m submitting the survey to two cluster groups, One group such as the Shroudies, the second who are knowledgeable with GMO’s.\nThis assignment is in preparation for my master degree in business. Nothing more should be read into this. This assignment will require individuals to  answer according to the readings. (yet to be approved by my two mentors) I picked these two subjects because I had already done research on them and it saved me five weeks of journal entry and I have only 15 weeks to compile my data and write the research paper. I would really appreciate that anyone interested in taking the survey wait until it is ready and answer according to the readings.\n\n","date":"November 30, 2014 at 11:27 am","url":"https://shroudstory.com/2014/11/30/the-raes-samples-that-rogers-used-had-been-switched/","cat":"carbon_14_dating","title":"The Raes samples that Rogers used had been switched?"},{"author":"giorgio_hsg","post":"That would be an excellent idea; however, in all honesty, the final data analysis  will be a result of confidence sampling just targeted to two groups.\n\n","date":"November 30, 2014 at 11:47 am","url":"https://shroudstory.com/2014/11/30/the-raes-samples-that-rogers-used-had-been-switched/","cat":"carbon_14_dating","title":"The Raes samples that Rogers used had been switched?"},{"author":"giorgio_hsg","post":"connivence not confidence, sorry\n\n","date":"November 30, 2014 at 11:47 am","url":"https://shroudstory.com/2014/11/30/the-raes-samples-that-rogers-used-had-been-switched/","cat":"carbon_14_dating","title":"The Raes samples that Rogers used had been switched?"}],"events":[{"author":"giorgio_hsg","post":"Charles you may want to come in contact with a few of my Eastman Kodak peers who will contest that all films comes with anomalies. And in fact, color films has more. Especially if you think your E-4 film processing technician gave two hoots about the chemistry plot indicating leuco cyan.\n\n","date":"September 27, 2015 at 4:07 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","title":"Facebook:  Barrie Schwortz on Indianapolis"},{"author":"giorgio_hsg","post":"I agree with Hugh’s assertion. I like to add that photography is a great tool for documentation of supporting evidence. As for the Ernie’s image,  I think it’s exceptional.  His understanding of lighting and the film’s characteristics is evident in his images. He was able to  compensate for the film’s inherent blue green sensitivity by increasing his exposure and by formulating his own developer.  His first generation prints can clearly distinguish between the blood and the charred scars left from the fire. With the original plate still in existence, pan masking techniques can be employed that can further increase the films gamut.  But the fact remains, it’s still silver haloid.\n\n","date":"September 28, 2015 at 5:50 am","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","title":"Facebook:  Barrie Schwortz on Indianapolis"},{"author":"giorgio_hsg","post":"Hello Louis, I agree with Barrie’s assessment completely. Cyan dyes are the most unstable and will be the first to fade. \nLight source itself are also problematic. Every light source is not equally balanced in Kelvin temperature. If I am not mistaking, Barrie had only three light sources to work with. 2 were 500 watts and 1 was 1000 watts. He positioned them at 45 degree angle or so with the set of 500’s at one end of the Shroud and the 1000 watt source at the other. The poor guy had to work with time constraints and the material he had on hand. It’s a miracle he was  able to capture technically sound images with the tools he had. Also keep in mind, shooting with tungsten film that diverges or converges certain light waves to achieve white light balance becomes problematic in fine research because it’s either discards  or absorbs certain  light waves.\n As for your second question, I do have a copies of the Durante’s image but not of Hal. As far as Enrie’s images, it’s unfortunate that the Guild didn’t have anyone that understood film. and as a result, the Guild passed along many poor Enrie duplicate copies that I wish they didn’t. In one such example, Dr. Jackson announced in the 1977 Shroud Conference hosted by the Guild,  that the 1973 color photos obtained by Battista and Cordiglia were far superior than the Enrie’s images. Of course that was not the case, however Dr. Jackson was never privy to the original 16×20 glass plates and would have know idea of the resolution and the actual contrast of the film. As a result, the Enrie image was condemned from that moment  by many Sindonologist from this side of the Atlantic.\n\n","date":"September 28, 2015 at 10:14 am","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","title":"Facebook:  Barrie Schwortz on Indianapolis"}],"history":[{"author":"giorgio_hsg","post":"Thank you Joe, Yes I found his newspaper clipping that he passed away in 1998. His work is so extensive and one day I’ll archive them for the web site.\nThanks Joe.\n\n","date":"September 21, 2015 at 9:11 pm","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","title":"Another Overwhelming Evidence Argument?"},{"author":"giorgio_hsg","post":"When time permits I’ll publish Donnelly’s work on the HSG site. No doubt, he has done a great deal of research and has sited well over 100 books to formulate his hypothesis.\n\n","date":"September 22, 2015 at 6:34 am","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","title":"Another Overwhelming Evidence Argument?"},{"author":"giorgio_hsg","post":"Thank you Joe, I think I’ll start archiving his work for later publications\n\n","date":"September 22, 2015 at 6:43 am","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","title":"Another Overwhelming Evidence Argument?"},{"author":"giorgio_hsg","post":"Hello Joe Marino, I have a question for you that does pertain to this subject. The Guild has a massive historical archives from a gentleman named Donnelly who has sited an enormous amount of books that I have yet tally, and he is convinced that the weave is of the 13th century based on his research.  I have noticed you have been a recipient of some of his letters. Can you tell us briefly his hypothesis in this matter?  I hate to read thousands of pages pf his archives that contains no pictures–\nespecially the back inside cover spread that folds in thirds. You remember, Mad Magazine! LOL\n\n","date":"September 21, 2015 at 6:05 pm","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","title":"Another Overwhelming Evidence Argument?"}],"image":[{"author":"giorgio_hsg","post":"Hello Thibault. I think it is very important to discuss halftone when using Ernie’s positive image.  The reversal film clearly  distinguishes the Shroud’s image by  dot amplitude modulation rather than screen builds. Ernie’s original negative which yields a positive print one can distinguish the screen values that are not present in the positive negative image that OK is using. \nIf you observe Durante’s image, the photo’s resolving power alone is not detailed enough to present  amplitude modulation but instead it resembles stochastic screening with trapping (overlays of color) to create the photo image. This is why it’s difficult to produce a 3D effect with ImageJ.\n“how can we scientifically define a 2D image having intrinsic 3D properties (“encoded” 3D data)?  \nI can only answer your question as an  enduser. By converting correlating screen values (distant to cloth as an example) to dots amplitude modulation and with displacement mapping you will achieve 3D rendering. Simple techniques can be see on youtube using “After Effects” and other rendering programs. \nThe question I have is how the amplitude modulation dots are abundantly centered on the linen without falloff giving the illusion of lensing which is why we have dots in the first place.\n\n","date":"October 3, 2015 at 4:42 pm","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"author":"giorgio_hsg","post":"Hello Hugh, \nHere is my observation,\nThe original negatives were made from glass plates 40×50 cm; roughly, 15.75 x 19.7 inches. The plates were a very fine grain orthochromatic film designed for copywork due to it’s exceptional resolving power, high contrast, linear characteristics, visual development inspection and good dynamic range. The second generation negative  was made from duplicating the glass plate. I do not know what type of film was used but visually the film was  probably the same orthochromatic type used for his original photograph. Using the same type of film to create the negative image to produce a positive print greatly reduced the dynamic range giving the second generation print a “litho look”.   \n“This image (UPLOADED) was created from the Enrie’s full size enlargement made from the duplicate negative from the original glass plate. I applied noise filter only on the extreme shadows which ranged from 90% to 100% K reading”. \nAs you can see the image does resemble AM modulation varying in frequency sizes. If you zoom in and out you can see how the different frequency size effects the image. Again, this uploaded image is not from a offset publication scanned, but from the actual Enrie collection of BXW fiber base prints. \nIMHO, The problem I see with OK’s work is he demonstrating  his 3D hypothesis from a representation captured on silver and not from the actual Shroud. \n(SEE IMAGE)\nhttp://www.holyshroudguild.org/ok.html\n\n","date":"October 4, 2015 at 7:12 pm","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"author":"giorgio_hsg","post":"Hugh, I’m not sure who started the half tone theory. I know it has been around for many years dating back to 1979 when Fr. Filas used the half tone idea as an artifact (noise) that has to be removed in order to see the Lepton coin. \nWhat I found interesting in both first generation prints (Pos & Neg) from the Enrie’s collection is how the “image” falls off in density abruptly following the uniformity of the herringbone weave.  Without the herringbone weave as a substrate, the image would not appear like it is lensing (Based on the photos), which is why the dot patterns appear.  This tells me that 3 to 1 herringbone bone weave is very important for the image formation and if any other substrate (smoother in texture) was used, a more continuos tone would have appeared, diminishing the details we see on the Shroud.\nI do have in my possession some 35 mm slides of Mark’s close ups that were released to the Guild. Observing them, some densities follow the regression pattern (abrupt fall off in density based on the herringbone weave) seen on the Enrie’s image and some do not. But the problem I have is I don’t have an idea what the markings are. If they are the water stains, I would not expect them to have the same regression as the image formation. And if this is the case, it is possible a substrate (receptor) was added over the shroud to  help in the formation. The substrate concentrated on the highest ridges of the weave producing the lensing effect during the image formation.\nTo answer Charle’s question, Orthochromatic is not relevant to produce the 3d.  According to  a few color experts I associate with at work, they all agree that the 3d effect has to do with the lensing like appearance of Enrie’s prints.\n\n","date":"October 5, 2015 at 5:45 am","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"author":"giorgio_hsg","post":"I forgot to add that I might have came up with different observation if I only use Mark Evans images and never saw the Enrie’s. And this is why in IMHO, relying just on photographs become problematic.\n\n","date":"October 5, 2015 at 7:02 am","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"author":"giorgio_hsg","post":"R2SB, I do have a list from Aldo Guerreschi as well as the Enrie’s book that does contain important info. I’ll be happy to get you the information.\nGive me a few days.\n\n","date":"October 7, 2015 at 7:22 am","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"author":"giorgio_hsg","post":"Sorry Louis,\nI don’t have any knowledge about the microphotographs. Maybe, David Rolfe or Emmanuel can help you get some prudent information about the process.\n\n","date":"October 4, 2015 at 8:01 pm","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"author":"giorgio_hsg","post":"So let me get this straight, your saying your scan from a litho which is screened has a better resolution than a JEG file because of comparison? And what is the target of the histogram of the Shroud? A regenerated image representation or the Shroud itself? We have no standards. No standards you can’t measure actual. If you do it’s your own interpretation.\n\n","date":"October 6, 2015 at 7:24 pm","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"author":"giorgio_hsg","post":"Here’s why it is a fallacy to assume what appears to be soft has less resolution.\nPhotographic unsharp masking \n“Simplified principle of unsharp masking\nThe technique was first used in Germany during the 1930s as a way of increasing the acutance, or apparent resolution, of photographic images.[citation needed]\nFor the photographic process, a large-format glass plate negative is contact-copied onto a low contrast film or plate to create a positive image. However, the positive copy is made with the copy material in contact with the back of the original, rather than emulsion-to-emulsion, so it is blurred. After processing this blurred positive is replaced in contact with the back of the original negative. When light is passed through both negative and in-register positive (in an enlarger for example), the positive partially cancels some of the information in the negative.\nBecause the positive has been blurred intentionally, only the low frequency (blurred) information is cancelled. In addition, the mask effectively reduces the dynamic range of the original negative. Thus, if the resulting enlarged image is recorded on contrasty photographic paper, the partial cancellation emphasizes the high spatial frequency (fine detail) information in the original, without loss of highlight or shadow detail. The resulting print appears more acute than one made without the unsharp mask: its acutance is increased”. \nI define this definition above,  “apparent sharpness”.\nOffset prints have a high degree of  acutance. I’m assuming the cover that OK used was printed at either 133 dpi or 175.  That means there are either 175 or 133 halftone dots in a line per inch. By definition, an offset print at 133 or 175 dpi is far from high resolution. \nBut in his defense, I believe  OK is correct to state that the Shroud acts as a half tone. The results of the half tones do increase the image formation contrast and acutance. If the image mechanism produced a continuous tone, most of the body’s details would be lost.\n\n","date":"October 6, 2015 at 10:04 pm","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"author":"giorgio_hsg","post":"Hello Hugh, I think I am getting what your saying about the image bearing fiber.  \nYou state ” Finally, regardless of any of the photos or reproduction styles used, the half-tone hypothesis says that no image-bearing fibre on the Shroud image is lighter or darker than any other image-bearing fibre. This is demonstrably untrue, just by looking at them in Mark Evans’ micrographs”. \nI think I understand what you mean. However, I am considering the absent of image fiber in conjunction with the image fiber as the total summation that makes up the image that gives the appearance of halftones (AM).  By the time you scan an image or reproduce an image it will be impossible to maintain the purity of the original dynamic range that will result too a gain in contrast and a loss in the tonal range. This is why the AM (halftone) appearance occurs.\n\n","date":"October 7, 2015 at 12:07 pm","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"author":"giorgio_hsg","post":"Hello OK\nMy response\n“Offset prints have a high degree of acutance. I’m assuming the cover that OK used was printed at either 133 dpi or 175. That means there are either 175 or 133 halftone dots in a line per inch. By definition, an offset print at 133 or 175 dpi is far from high resolution”\nYour response,\n“I think it is a little bit higher. But this is largely irrelevant. As the average Shroud thread diameter is about 0.3 mm or 0.01 inch, the max practical resolution of the Shroud image is about 100 dpi. And if photographs can reach further, this doesn’t matter actually”.\nIt does matter. Lets use your histogram as an example. I would expect a major difference in dynamic ranges when one compares offset reproduction vs continuos tone images.  As you recall, fingerprinting has to be done since my image came from a second generation negative scanned from a fiber base print. The second generation negative has lost it’s dynamic range compared to the original negative which I do have also a 1gig scan of. Your image came from a half tone printed book that inherently has much less resolution and dynamic range to any normal photographic process including the second generation print I used.   Any comparisons between the two files can’t be done without a standard. Wouldn’t you agree the target has to be the Actual Shroud and if so any  reproduction  becomes only a representation that simulates correlations but  in reality have no relations whats so ever with each other? So at the end of the day, we’re comparing reproductions that have no real relation with the Shroud.\nYou may be saying that, and the problem is our heuristics in our interpretation is what’s causing  the confusion.\nAs for your halftone hypothesis, I never doubted that. The halftones (AM) from the reproduction is what gives the unique lack of dynamic range causing a lensing effect. I do see lensing effects on many areas of Mark Evans images but the wider dynamic range from his photos  makes it harder to distinguish and the water stains will undoubtedly not have any correlation with the actual image making it harder to evaluate. \nIMHO, if the imaged substrate was not on the herringbone linen, Dan and I may not be hosting websites about the Shroud.\n\n","date":"October 7, 2015 at 7:54 am","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"author":"giorgio_hsg","post":"Colin, your delivery maybe in question; however, what you are saying has truth.  Since we’re plotting from an actual not the target that’s dependent on resolving power, dynamic range and displacement mapping, you have a point.  What I gathered back in 2012 wasn’t the importance of the 3D encoding rather the importance of the herringbone weave. Without it, we have no detailed image.\n\n","date":"October 8, 2015 at 5:16 am","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"author":"giorgio_hsg","post":"\n\n","date":"October 8, 2015 at 6:59 pm","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"author":"giorgio_hsg","post":"Horizontal Banding, Why?","date":"October 8, 2015 at 7:01 pm","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"author":"giorgio_hsg","post":"\nReflecting on what Diddly Squat stated,  at the end of the day, he’s correct.   \nI would like the viewer first read this quick explanation how we perceive images compared to still images. \nhttp://www.cambridgeincolour.com/tutorials/cameras-vs-human-eye.htm\nNow allow me to explain  visually by this uploaded file,  why I conclude that there is AM modulation on the image formation.  I come to this conclusion based on heuristic experience of over 40 years in film and digital industry and still at it. One might think that can be an advantage but in fact that may be my downfall.  I am entering this discussion with a preconceived notion why AM modulation exist based on years of experience with film and scan characteristics. However, I can be totally off base because there may be no relationship comparing my work and studies with this hypothesis. \nIf you observe my reconstruction simulation .png file which is not at all scientific, only being used to visually explain the hypothesis of AM modulation in the image.\nImportant to note, I used filters and curves to achieve the results of the background images of Dr. McCrone so I can simulate dynamic range and resolving power.\nThe image is divided in three panels. The first shows a Dr. McCrone macro photograph of the Shroud. The image shows blood on the left side and image formation on the right side. The background simulates the same image photographed (stepped and repeated)  at a further distance that would result in a major reduction in resolving power and dynamic range (that is why in my IMHO, any observation must include these factors). The background image is converted to black and white to achieve the lose of dynamic range more easily.  The center panel is the same as the left panel only inverted. The Right panel illustrates the mask in halftone, and a scanned positive fiber base print of the Enrie glass plate negative of the nose bridge. If you notice, the Enrie’s image seems softer than the mask image, but I can assure you, the Enrie’s resolution is far greater than the mask. Also very important to note is that the most predominate feature in the AM modulation is not the image but the shadow of the over lapping 3 to 1 threads that combines with the image if the characteristics are correct. So I conclude, based on my own preconceived notion,  that the  dot by dot body to cloth correlation is flawed, since the cloth is convex and concave.\n\n","date":"October 9, 2015 at 8:45 am","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"author":"giorgio_hsg","post":"Fair enough. We both agree there is no target. So my questions are, is your look up table depended on the degree of blur the operator applies? Wouldn’t you expect different calibrations from a photograph shot on a 40×60 cm film at 8.17 meter from the target than a 35 mm macro film at a few inches from the target? Did you apply a formula for this calculation in your look up table? \nAnother confusing element is your certainty that it is bleaching that has caused the banding. How do you explain that the banding appears when the stitches alternate.  Are you saying that every time the threads alternate in different directions  the threads are from a different lots, or they have been naturally bleached many years later because of the diverging symmetrical angles? \nI believe there is so much more to this than we’re anticipating. I certainly don’t want to come across as a nay-sayer.  In fact all great discoveries are normally achieved with resistance and skeptics, and I encourage you to continue; with all sincerity.  And if we ever get a chance to meet and talk  with the comfort of beer, possibly 2 ,3 ……, I’m sure we have more in common about this discussion that is being revealed within these posts.\nGiorgio\n\n","date":"October 9, 2015 at 5:32 pm","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"author":"giorgio_hsg","post":"As long as there is experimental data with chemistry in the study of thermoanalytical usage, the paper is entitled to be published in Thermochimica Acta. I would conclude however, other publications may not find it suitable.\n\n","date":"May 24, 2015 at 7:22 am","url":"https://shroudstory.com/2015/05/24/colin-berry-on-rogers-and-arnoldi-paper/","cat":"image_theory","title":"Colin Berry On Rogers and Arnoldi Paper"},{"author":"giorgio_hsg","post":"Totally forgot. Let me look for the paper. I’ll keep you posted.\n\n","date":"May 24, 2015 at 10:00 am","url":"https://shroudstory.com/2015/05/24/colin-berry-on-rogers-and-arnoldi-paper/","cat":"image_theory","title":"Colin Berry On Rogers and Arnoldi Paper"},{"author":"giorgio_hsg","post":"What I did find is the 1977 Workshop Proceedings of the United States Conference of Research on the Shroud of Turin (March, 1977). Is this what you’re looking for?\n\n","date":"May 24, 2015 at 12:33 pm","url":"https://shroudstory.com/2015/05/24/colin-berry-on-rogers-and-arnoldi-paper/","cat":"image_theory","title":"Colin Berry On Rogers and Arnoldi Paper"},{"author":"giorgio_hsg","post":"When I get a chance I will scan the pages and let you know when it’s uploaded.\n\n","date":"May 24, 2015 at 5:19 pm","url":"https://shroudstory.com/2015/05/24/colin-berry-on-rogers-and-arnoldi-paper/","cat":"image_theory","title":"Colin Berry On Rogers and Arnoldi Paper"}],"misc":[{"author":"giorgio_hsg","post":"Hello Louis. It’s at this point I too am lost. I think the major problem is the nomenclature used to explain blood,myrrh,iron oxide, blood and etc.\nHeres an excerpt from the HSG archive page.\nIn Dr. Nitowski’s “Conservation report” she writes, “If two different fibers are woven together\ninto a material, linen and cotton as in the Shroud, one may actually contribute to the destruction of the other – the cotton contains starch (as observed by Kohlbeck) that could interact with the dye of a cloth like red silk covering the Shroud during storage”.\nIn another report, Dr. Kohlbeck asked Ray Rogers permission  to remount the sticky tape slides in cargille oil. The oil is used for  better resolution to increases the resolving power of the objective when photographing  the sample slides. Dr. Kohlbeck set aside these slides for over three months and re-examine them. To his astonishment he noticed that the once red particles have now turned black and exude a yellow color. “This certainly could not be iron oxide”, he tells Harold Nelson in a letter. He continues and writes, “Dr. Heller is no doubt right,”?  ” I’m no blood expert but I know the particles are not iron oxide”. \nDr. McCrone writes in “Judgement Day for the Turin Shroud” page 82 on Dec 26 1978, starting with 3-CB a heavy image area, blood from the lance wound using low magnification (10% +10% oli) I could see a heavy crustacean (of blood?) – too red”!  Page 84 on Feb 2 1979 he writes, “I have spent a lot of time looking at the tapes especially the red particles. There are a lot of them and they are definitely inorganic. hundreds of fiber are well-coated with these deep red particles. They are the same particles Pellicori and Evans show in their low power photomicrographs they say this is blood- I say it is an inorganic compound.  In our archives I have more notes written by Dr. McCrone which was not published. ” Dr. McCrone writes  on June 13th 1979, “Sample 3AF (finger image) shows the largest percentage of colored fibre examined it closely the fibers are un-uniform colored over lengths exceeding weave units hence the color is not a surface effect-possible mechanism includes heat or liquid treatment. There are in this sample and others a number of yellow amorphous tubular flaked like a material resin. ( I thought in the part they could be aloes or etc).”\nThe yellow amorphous tubular flaked like material resin was possibly also the same thing Dr. Nitowski saw and was convinced it was Myrrh and aloes just as Dr. McCrone first thought. Steven Schafersman is also correct when he states the madder root was first announced by Dr. McCrone.  This is also confirmed by Paul Maloney, President of ASSIST at a Talk given at the “The Shroud of Turin: Perspectives on a Multi-Faceted Enigma” conference in Columbus, Ohio on August 14-17th 2008, when he states, “Walter McCrone had sent him in 1981 several Kodak transparencies of photos he took of Shroud linen fibers. “On those slides, (Guild also has them) McCrone had written the following note: madder rose, linen fiber, medium (blue) sample 3 CB” 4 and sample 3-AB. McCrone was referring to photomicrographs made on STURP sticky tape samples 3-CB and 3-AB which came from the blood flow across the back nearest the side-strip side of the Shroud and directly adjacent to that flow on linen, itself. It was on that side where someone would have been working their repairs if the re-weave theory is held to be correct. McCrone, of course, due to his belief that the Shroud was painted by an artist, was trying to prove that the Shroud had been in an artist’s studio.” Source: Maloney, Paul C. “What Went Wrong With the Shroud’s Radiocarbon Date? Setting itall in Context.” Talk given at the “Shroud of Turin: Perspectives on a Multi-Faceted Enigma”conference in Columbus, Ohio on August 14-17th 2008.\nComments: Regarding the presence of madder rose on the cloth, Maloney says, “There is now a\nnew way of looking at the presence of that madder rose. Although this is some distance from the\n“Raes Corner” such trace amounts can now be conjectured to explain the dye that was used,\nalong with the aluminum mordant and the gum Arabic as a binder to create the wash to finish the\nre-weave. Thus, it may now be seen not as a contaminant from an artist’s studio, but rather a\ncontaminant from the weaver’s workshop.”\n\n","date":"February 28, 2015 at 10:31 pm","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"author":"giorgio_hsg","post":"Piero, I would like to inform you, yes I passed and received my degree. Thank you for asking. \nBy the way the paper clearly states, and I quote,\n“The research observed two distinct populations. Both groups were asked to read two abridged versions of two manuscripts, and answer five questions on each of the subjects. The readings are factual, but not impartial. They were designed to lead  participants to a controlled response. If the readers deviate from the expected controlled answers, an analysis would be performed to evaluate if confirmation bias was the cause”. \nThe Serelini’s manuscript clearly showed that something triggered the participants to respond against the readings. Could the trigger be Monsanto?\n\n","date":"February 28, 2015 at 12:43 pm","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"author":"giorgio_hsg","post":"Louis that’s the underlying message pertaining to my paper. Life’s inference, culture, religion, shapes your believes and you will only extract from life lessons what supports your existing believes. For me it’s a “DIS” not to return the threads back upon Giovanni Saldarini request.  and besides, any testing of these threads would be disowned and not recognized by the authority\nPersonally,  regardless of scientific demands, If the Turin authority decided to use three labs instead of seven, it’s their choose. To Italians, the Shroud belongs to them as well as Catholics and preservation was their top priority. \nMany well intended scientists wrote  to  Cardinal Ballestrero, advising him against the change of the protocol. This too was considered a “DIS” amongst the the Turin authority and to the Guild who was the instrument to access to these studies. To put it bluntly, they felt, it was none of their business once the final decision was made.\nRegardless of the “new world enmeshment process”, I’m not so sure it’s intrinsic to man’s ability.\n\n","date":"February 28, 2015 at 1:22 pm","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"author":"giorgio_hsg","post":"Maybe the first sentence will be helpful for you. But again, this is my opinion formed by the much correspondence material I have in my possession from the Guild; resulting to confirmation bias. (LOL) \n(from the HSG archives) It was during the Albuquerque meeting in 1989, Alan Adler received the cuttings from Prof.Gonella. Based on Thiebault’s evidence,  I believe his presentation accurately demonstrates where the threads were extracted. Adler, observed that not only part of this area was from the re-weaving but the samples also contained “starch”  that the three labs failed to notice. However, Adler failed to produce a desire C14 result in an unauthorized testing (verbally communicated).\n(from the HSG archives) According to documents from the Guild, the McCrone’s Germany C14 testing was from the Oviedo cloth. However, it was eventually agreed upon that in fact it was from the Raes sampling.  \n(from the HSG archives)\nAccording to one individual, he insisted that only half of Raes samples were returned to the Centro.\n(from the HSG archives) A previous post I uploaded on this thread shows a letter from Prof Raes to Fr. Kim. Prof. Raes’ goal was to  correct any misinterpretation of his 1974 report.\nI believe he did publish an article in the Spectrum in 1991 to do just that.\n\n","date":"February 28, 2015 at 12:14 pm","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"author":"giorgio_hsg","post":"Joe, I’m impressed. Did you use an OCR software? LOL\nThank you for taking the time to simplify the read.\n\n","date":"February 28, 2015 at 12:10 pm","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"author":"giorgio_hsg","post":"“On the other hand, I had only a very small part of the strip added to the main body and I could only make a few microscopical preparations of the fibres of the strip. We must therefore be very careful with our conclusions”.\nMy interpretation to this statement is he’s being cautious about the summation of his sample size.\n\n","date":"March 1, 2015 at 8:46 am","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"author":"giorgio_hsg","post":"Yes I’m the old man who’s back to school to see if my pick up lines still work. Sad to say, I need new material with these young ladies.  Plus it’s much harder to work the field when you wear a wedding ring.  Lol. Thibault I’m glad you enjoyed it, hopefully when I’m finished with this assignment I can say the same thing.    I’ll let you know the results by the end of February. It will be uploaded.\n\n","date":"December 20, 2014 at 2:53 pm","url":"https://shroudstory.com/2014/12/20/giorgio-bracaglia-over-at-the-holy-shroud-guild-wants-your-help/","cat":"other_sites","title":"Giorgio Bracaglia over at the Holy Shroud Guild wants your help"},{"author":"giorgio_hsg","post":"Charles, look at the assignment as nothing more than a prosecutor’s brief and answer according the readings as instructed. As far as cognitive research, there are so many empirical data already, my findings are so irrelevant to any conclusion. However, what is relevant for this course is to prepare me for using the right statical analysis and approach in my business research paper.\n\n","date":"December 21, 2014 at 11:14 am","url":"https://shroudstory.com/2014/12/20/giorgio-bracaglia-over-at-the-holy-shroud-guild-wants-your-help/","cat":"other_sites","title":"Giorgio Bracaglia over at the Holy Shroud Guild wants your help"},{"author":"giorgio_hsg","post":"Thank you Charles.\n\n","date":"December 22, 2014 at 9:00 am","url":"https://shroudstory.com/2014/12/20/giorgio-bracaglia-over-at-the-holy-shroud-guild-wants-your-help/","cat":"other_sites","title":"Giorgio Bracaglia over at the Holy Shroud Guild wants your help"},{"author":"giorgio_hsg","post":"Merry Christmas Thibault.\n\n","date":"December 20, 2014 at 4:07 pm","url":"https://shroudstory.com/2014/12/20/giorgio-bracaglia-over-at-the-holy-shroud-guild-wants-your-help/","cat":"other_sites","title":"Giorgio Bracaglia over at the Holy Shroud Guild wants your help"},{"author":"giorgio_hsg","post":"Hello O.K.  I guess the best answer I can give you comes from this sentence from the readings, “In 2000, Rogers received reports from a long time Sindonologist researchers, Joe Marino and Sue Bedford. They hypothesized that the radiocarbon dating were not from threads excised from the main body of the Shroud, but rather from a location contaminated with dye cotton used in the restoration of the Shroud”.\nI also have to point out there will be limitations to the data collected based on language barriers, and load questions that the controlled group who approved the wording may have overlooked.\nYou are correct about double entries however, when I tally the responses I am able to sort duplicate IP address and eliminate any duplication. Of course that has to be mentioned in the limitation section of the research since the duplicate responses may have come from 2 members or more from the same household, or the second response had different answers to the questions. \nAs far ar the 1977, Albuquerque procedures I know I do have that in archives. If I have already scanned them I can certainly upload them on the HSG site where you can retrieve it. However, if it is not scanned, you’ll have to give me time (March) before I will have time. I’ll let you know some time next week of the status.\n\n","date":"December 21, 2014 at 8:39 am","url":"https://shroudstory.com/2014/12/20/giorgio-bracaglia-over-at-the-holy-shroud-guild-wants-your-help/","cat":"other_sites","title":"Giorgio Bracaglia over at the Holy Shroud Guild wants your help"},{"author":"giorgio_hsg","post":"Thank you Louis,  Merry Christmas to you too.\n\n","date":"December 21, 2014 at 9:34 am","url":"https://shroudstory.com/2014/12/20/giorgio-bracaglia-over-at-the-holy-shroud-guild-wants-your-help/","cat":"other_sites","title":"Giorgio Bracaglia over at the Holy Shroud Guild wants your help"},{"author":"giorgio_hsg","post":"“ Hope I’ll finally publish a research paper I wrote in 2011 CE demonstrating beyond the shadow of a rational doubt the very partial Pilate coin obverse impressions are really there).\nReminder one for Dan: one American professional numismatist and two scholar numismatists and Jewish ancient coin experts did identify the partial imprint of a Pilate coin (dilepton lituus type) on the TS man’s right eye”. \nHello Max, is your draft available on line and who and what sources were used by the numismatics to make that claim.\nThanks Max\n\n","date":"June 16, 2015 at 2:23 pm","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","title":"Of People Who Drink Medicinal Wine from a Teaspoon"},{"author":"giorgio_hsg","post":"Not for nutten I didn’t sign a model release for your use. LOL\nAs far as the context, It’s covers Gilles-Eric Séralini’s 2012 peer reviewed manuscript, “Long term toxicity of a Roundup herbicide and a Roundup-tolerant genetically modified maize”. and Rogers’ manuscript “Thermochimica Acta”.\nA simple read with five or six questions on each topic.\n\n","date":"November 19, 2014 at 10:48 pm","url":"https://shroudstory.com/2014/11/18/posting-on-the-holy-shroud-guild-facebook-page/?","cat":"uncategorized","title":"Posting on the Holy Shroud Guild Facebook Page"},{"author":"giorgio_hsg","post":"Great job Dan, and good luck in the future. \nRuss do I hear that you’ll be picking up Dans blog?\n\n","date":"December 15, 2015 at 3:44 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"author":"giorgio_hsg","post":"Happy Birthday David\n\n","date":"December 17, 2015 at 8:10 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"}],"opinion":[{"author":"giorgio_hsg","post":"“Of course, Walter McCrone never “performed radiocarbon tests on the shroud.” Nor did Rogers date the shroud to the 1st century. So it turns out, neither are art experts always write while righting blogs posts about writing wrongs”.\nGuilds archive strongly differs from that conclusion. At first, what was believed C14 tested was the The Sudarium of Oviedo in Mons. Ricci’s possession during the infamous journey with McCrone to Dr. Raes. However, Further archives concluded that in fact in all probability, McCrone was successful obtaining The Shrouds threads and tested it in Germany. \nEither case, it’s hear say.  But on the other hand,  no one here can definitely claim that McCrone didn’t conduct a C14 test.\n\n","date":"October 23, 2015 at 8:54 am","url":"https://shroudstory.com/2015/10/23/proof-that-art-experts-are-not-always-right/","cat":"other_blogs","title":"Proof that art experts are not always right"}],"researchers":[{"author":"giorgio_hsg","post":"“the Christians from various denominations, whether Catholic, Anglican, Protestant, Orthodox, even non-Christians who believe in Jesus, also have the right to feel they “own” the relic … because it is believed it once wrapped the body of Jesus” \nLouis, I am in total agreement with your statement as long as it is the true burial cloth of Jesus,  however, to many of the  Italians who are primarily Catholics, the Sindone is their artifact. Even the wonderful Father Rinaldi showed his national pride in some of his correspondence between the Turin authority speaking out against American scientists who he felt stepped out of line by challenging the Holy Sea’s decision on the C14 protocol. What would you expect a loyal priest to do? His first obligation is his dominated faith.  As you stated in this link, the problem is human nature.\nAs far as King Umberto donating the relic to the Holy Sea, It was a respectful gesture allowed by the Italian government since all of the Savoie’s belongings were confiscated making them property of the Italian State including the Shroud of Turin. You can find a brief explanation in Relic, Icon or Hoax?: Carbon Dating the Turin Shroud\n By Harry E Gove.\n\n","date":"May 31, 2015 at 7:07 pm","url":"https://shroudstory.com/2015/05/30/colin-berry-on-sturp/","cat":"other_blogs","title":"Colin Berry on STURP"},{"author":"giorgio_hsg","post":"Louis I still have to stand by my statement.  After 1946, all of the Savoys possession  were confiscated and he was exiled.\nIt’s hard to claim ownership when you have no possession of an article in question.\n\n","date":"May 31, 2015 at 8:40 pm","url":"https://shroudstory.com/2015/05/30/colin-berry-on-sturp/","cat":"other_blogs","title":"Colin Berry on STURP"},{"author":"giorgio_hsg","post":"Louis I can tell you this much, I wouldn’t have wanted to be a member of the Episcopal faith the day when Cardinal Anastasio Ballestero received a letter from an ASSIST member pleading with him to return to the original C-41 protocol.\n\n","date":"May 31, 2015 at 5:18 pm","url":"https://shroudstory.com/2015/05/30/colin-berry-on-sturp/","cat":"other_blogs","title":"Colin Berry on STURP"},{"author":"giorgio_hsg","post":"Yes, The Turin authority was not pleased with “outsiders” criticizing the Holy Sea’s decision pertaining to the C-14 protocol. Truth be told, the Sindone is an Italian and Catholic artifact. \nEmphasis on Holy Sea.\n\n","date":"May 31, 2015 at 5:49 pm","url":"https://shroudstory.com/2015/05/30/colin-berry-on-sturp/","cat":"other_blogs","title":"Colin Berry on STURP"},{"author":"giorgio_hsg","post":"https://video-iad3-1.xx.fbcdn.net/hvideo-xtf1/v/t42.1790-2/1302577_10201833918752323_39539_n.mp4?efg=eyJybHIiOjMwMCwicmxhIjo1MTIsInZlbmNvZGVfdGFnIjoibGVnYWN5X3NkIn0%3D&rl=300&vabr=80&oh=64f9f214545f1b5582e675f0cdb0dace&oe=562D7F87\nFrank Zappa’s?\n\n","date":"October 25, 2015 at 5:11 pm","url":"https://shroudstory.com/2015/10/25/a-critical-summary-3-0-discussion-one-very-smart-bartender/","cat":"critical_summary","title":"A Critical Summary 3.0 Discussion:  One Very Smart Bartender"},{"author":"giorgio_hsg","post":"He’s alive! Interesting rebuttal to Eric Jumper\nhttps://www.dropbox.com/sh/6n94cjnvp18hawh/AAB1k3XJy8XmtRMLTT8Q0vWpa?dl=0\n\n","date":"February 16, 2015 at 9:44 pm","url":"https://shroudstory.com/2015/02/16/walter-mccrone-art-experts-should-not-weigh-in/","cat":"uncategorized","title":"Walter McCrone:  Art Experts Should Not Weigh In"},{"author":"giorgio_hsg","post":"Joe that was a pun. Of course he’s past away. However, the letter brings him back to life.  I too was at Dallas in 2005 selling his book, Judgment Days”  for the Holy Shroud Guild to finance the event. The death threats I received at the event was the reason why Mike Minors had hired two state troopers to protect me.  LOL another pun!\n\n","date":"February 17, 2015 at 6:09 am","url":"https://shroudstory.com/2015/02/16/walter-mccrone-art-experts-should-not-weigh-in/","cat":"uncategorized","title":"Walter McCrone:  Art Experts Should Not Weigh In"},{"author":"giorgio_hsg","post":"Yes I did, all but one book I brought to the event. I had a wonderful conversation with a military chap in the wheel chair (his name escapes me) about McCrone. Also Fr. Kim had me rolling on the floor with his antics about McCrone.\n\n","date":"February 17, 2015 at 9:12 am","url":"https://shroudstory.com/2015/02/16/walter-mccrone-art-experts-should-not-weigh-in/","cat":"uncategorized","title":"Walter McCrone:  Art Experts Should Not Weigh In"}],"resources":[{"author":"giorgio_hsg","post":"Chuck,  that was an excellent observation. Now how the heck is enmeshment process towards globalization ever going to work!\n\n","date":"October 17, 2015 at 8:02 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"}]}
