{"_hsg":[{"author":"giorgio_/_hsg","post":"MORE ABOUT COTTON\nHere is a quote of Prof Raes written in 13/11/89\n“It is true that in my report of 1973 I mentioned that I found traces of cotton fibers only in the main body of the Shroud. I must however add that even for the main body I did not find traces of cotton in all microscopical preparations. On the other hand I had only a very small part of the strip added to the main body and I could only make a few microscopical preparations of the fibers on the strip”.  \nThis was in response to Prof. Vial suggesting at the Paris synopsis  that the cotton fiber mentioned in Raes’ report could be superficial fibers presented on the surface of the shroud and not part of the original Shourd’s yarn.  Raes insist that the cotton is not superficial and traces of the cotton was confirmed by the Oxford finding (C-14). Raes also cites that Prof Hall and I quote”found some foreign fibers in his sample identified by a laboratory was not able to identify the variety of the cotton fibers by testing the number of (reversals?) as I did in my research of 1973″. \nNot sure if this helps in your discussion, but I figured to share it anyway.\nGio\n\n","date":"August 9, 2014 at 1:30 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries"},{"author":"giorgio_/_hsg","post":"daveb, Here are some PDF files that maybe of interest to you and to others.\nhttp://public.justcloud.com/dtfmh54x8p.61146615    \nhttp://public.justcloud.com/dtfmkj3tap.61146615\nhttp://public.justcloud.com/dtfmjgij52.61146615\nhttp://public.justcloud.com/dtfmk5a6g6.61146615\n\n","date":"June 20, 2014 at 10:10 pm","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","title":"Maybe a New Image Hypothesis?"},{"author":"giorgio_/_hsg","post":"I guess it depends on one’s perspective.   To me it’s all convoluted and I don’t know where to begin.\n\n","date":"August 9, 2014 at 3:55 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries"},{"author":"giorgio_/_hsg","post":"He was responding to Father Kim. Raes uses the term “In his contribution of Paris”\nRaes also states in his letter to Fr. Kim That “I could not agree with him and that in my opinion the cotton fibers were not superficial fibers”. \nThere are hundreds of letters that are marked confidential that talks about the transfer of threads in Albuquerque (possibly the infamous) and threads from  the cope of St. Louis of Anjou.\nI’m thinking of translating all of these letters in spanish and talking to Telemondo to create a Novella. LOL\n\n","date":"August 9, 2014 at 3:48 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries"}]}
