{"dating":[{"id":"comment-131","author":"giulio_fanti","post":"Has perhaps Brad Gore, one of the authors of Nature paper on C 14 (made in 1988 on the Turin shroud) some answers to the following questions? Many thanks in advance. 1) In the Nature report it is stated that “The results … yield a calibrated calendar age range with at least 95% confidence for the linen of the Shroud of Turin of AD 1260 – 1390….” How do you reach a 95% confidence level if the corresponding Chi square value (reported in Table 2) is 6.4? 2) R. Van Haelst and others corrected the errors written in the Nature report and obtained the following conclusion. The results of radiocarbon measurements of Arizona, Oxford and Zurigo labs yield a calibrated date of 1280 1300 BC with only a significance level of 1.2%. These results therefore furnish the conclusive evidence that the sample used by labs are NOT homogeneous in C 14 content. Which are your comments to this statement? 3) The strip cut from the Shroud in 1988 was similar to a rectangle of ~21 mm x 81 mm, but only a part of it of ~17 mm x 41 mm was used for dating; why, from Nature report it results: “a strip (~10 mm x 70 mm) was cut”? Was perhaps dated a different sample by the labs or was it only a mistake? 4) One of the fundamental hypotheses of the 14 C method is: no contamination exists in the sample so all the 14 C measured derives from the vegetable under consideration. The body image formation process is still not explained in the Turin Shroud image. How can you be sure that this fundamental hypothesis is verified in the present case and how can you demonstrate that there was no any change in the chemical structure of the linen fibers, also in terms of C 14, due to the image formation? (A. Adler, R. Rogers and others demonstrated that there was a chemical change in the image fibers). 5) From Table 2 of Nature report, it results, for Sample #1, a mean radiocarbon date from Arizona lab of 646 ± 31 years instead of 646 ± 17 years. Why it was never corrected this mistake? 6) The mistake in question (5) derives from a previous formula in which the right 17 value was used instead of the wrong 31. In addition, using 31 instead of 17 in the mean date from Arizona lab of 646 ± 31 years, resulted a significance level of 4.17% that was rounded to 5% to accomplish the predefined limit that allowed a combination of results. These data lead to think to a possible manipulation. What is your comment? 7) Using the corrected value of 17, a significance level of 1.2% results, very lower than the limit of 5%. Why the data were combined? Why the measurement were not repeated as it should have been done? 8) In Nature report, just before the Conclusions it is written: “The results, together with the statistical assessment of the data prepared in the British Museum, were forwarded to Professor Bray of the Istituto di Metrologia ‘G. Colonetti’, Turin, for his comments. He confirmed that the results of the three laboratories were mutually compatible, and that, on the evidence submitted, none of the mean results was questionable.” Do you still agree with this statement? 9) Someone has observed that even if there is some mistake in the Nature report, all the results confirm a medieval age of the Turin Shroud. Do you agree with this observation? If so, how do you explain that the results are not a clear clue of contamination in the sample? 10) Don’t you think that a sign of contamination (of about 200 years) in very few square centimeters of fabric can lead to a contamination of the order of thousands years in some square meters in the same fabric? 11) Why the initial proposed procedure, that foresaw the sampling in various locations of the Turin Shroud was not followed during the 1988 sampling? What was the information that allowed the scientist to surely suppose that the Shroud has a uniform content of C 14 in all its area? 12) According to B. Walsh and others, instead of a uniform model, at least a linear model, for the content of C 14 in the Turin Shroud area, should be assumed. Are they wrong?.","date":"2008-09-28","mins":"6:39 pm","url":"https://shroudstory.com/2008/09/28/brad-h-gore-says/","cat":"carbon_14_dating","title":"Brad H. Gore Says"}]}
