{"art":[{"id":"comment-30835","author":"greg","post":"Kayceen, I’ve heard this verse preached many times. But they stop there! Read the next verse! But He has revealed them to us by His spirit… God is using many who are sharing what they have seen and heard in the spirit to provoke faith in Jesus..","date":"2013-04-14","mins":"11:47 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}],"history":[{"id":"comment-1285","author":"greg","post":"I have been a believer of The Shroud for a long time. I liked how the History Channel touched on upon the fact that the carbon14 dating could be wrong (and I truly believe this), because in the 1200’s they had rewoven cloth onto that corner. Also the fact that The Shroud had been handled since the 1400’s by people touching it on that corner from where they took the samples could have contaminated it. That is my belief that The Shroud was either contaminated from people touching it on the corner where they took the carbon14 samples, or new fabric had been rewoven on that corner where they took the samples. Either way, there is pretty compelling evidence that the samples that they did the testing on in 1978 were either contaminated or rewoven fabric. But you don’t hear too much about that. I saw a whole show on the Science Channel how they had rewoven new fabric into The Shroud in certain places in the 1200’s because the weave was different. These scientists need to wake up and take a good hard look at that..","date":"2010-05-10","mins":"12:09 pm","url":"https://shroudstory.com/2010/03/30/abc-good-morning-america-on-tonights-history-channel-shroud-of-turin-special-2/","cat":"history","title":"First Reaction: History Channel’s Shroud of Turin: The Real Face of Jesus"}],"dating":[{"id":"comment-1063","author":"greg","post":"Hi there Just want to thank you for the hat tip, but need to point out that the quote I used was pulled from the Wikipedia article on the Shroud, so can’t really take credit for it. My article is still worth a read though :) Greetings from sunny South Africa!.","date":"2010-02-26","mins":"2:12 am","url":"https://shroudstory.com/2010/02/24/good-shroud-of-turin-quote/","cat":"carbon_14_dating","title":"Good Shroud of Turin Quote"}]}
