{"art":[{"id":"comment-11771","author":"gwynneth_smith","post":"When I was around 7 years old, we lived in a farm house in Illinois. We were surrounded by corn fields and the only neighbors we could hear were the Ligers and Tigons that a man bred a few miles down the road. They would roar and we could hear them faintly. One night my parents let me stay up late to play ,Mario on nintendo, because my brother had the game all day and I didn’t get a turn. It must have been a weekend because there was no school the next day. Well I was on the couch in the living room, to my right was the front door and beside it a window, behind me was a large window and to my left a bed sheet my mom had hung to keep the cool air in one room.The house was drafty and there was a big archway in between our living and dining area. As I was playing this fear came over me as I saw something out of the corner of my eye to my right. I slowly turned my head to see what was there and in the window was a face. I cannot describe it because just as I saw it it moved. I froze and thought about screaming out for my mom or dad but I was locked in such fear. I was sure that whoever was outside must be behind me now looking at me through the window. I pretended to keep playing thinking that if whoever was out there didn’t think I’d seen them they’d go away. I thought that if I made any movement they would come bursting in after me. I began to cry I was so petrified. Suddenly, I saw a bright light to my left. It got brighter and filled the room. I looked over to my left and on the other side of the sheet that hung in the archway, was what appeared to be a man. He was dressed in a long robe that came to the floor, I could only see his feet when he stepped forward. His feet were, at the time I could only describe as “very tan”. His hair was shoulder length and bright blond and seemingly glowing. As he stepped forward his arms stretched out to either side and the robe went front his wrists to the ground and I thought to myself “This must be an angel and I bet when others see him they think that his robe is wings, because the way they flowed and draped it resembled wings. There was a golden sash that formed a v on his chest and the whiteness of the robe was unlike any white I’d ever seen. Any other white, be it snow or any other is dull in comparison. Not only did this bright light fill the room, this absolute joy radiated around and I was so happy. I stood and once the man hit the sheet he faded out of my sight. I could still feel the joy and there was still brightness about the room. I said “Where are you, I want to see you again.” and I heard in an almost audible voice, “Go to bed.” I turned off the tv and game, went straight up stairs and to my room and got into bed without turning on any lights, without running (as I usually did, to my older sister’s room). I told my parents the very next morning when I came down stairs. I said “Guess what I saw last night!? I saw an angel!” They smiled, gave eachother a smirk and told me I was ‘probably just tired’. Well years and years later, as I was in my apartment as my husband was at work, I remember an old youth pastor said, “Do not read Revelation alone, because it may scare you.” I was recently thinking back to that night in the old farm house. I always questioned weather or not I really did see this “angel” or was I just dreaming or did I make it up and just start believing it on down the line. I couldn’t, however, get past that I didn’t just see this, I felt it. That joy was undeniable! I went from being scared to tears, to calmly and joyfully going up to bed. Well I decided to crack open the Bible and something told me to go to Revelation. I went to the beginning and started to read. Then I got to this part… “And I turned to see the voice that was speaking with me. And having turned, I saw seven golden lampstands; and in the middle of the lampstands one like the Son of Man, clothed in a robe reaching to the feet, and girded across His breast with a golden girdle. And His head and His hair were white like wool, like snow; and His eyes were like a flame of fire; and His feet were like burnished bronze, when it had been caused to glow in a furnace, and His voice was like the sound of many waters. And in His right hand He held seven stars, and out of His mouth came a sharp two edged sword; and His face was like the sun shining in its strength. And when I saw Him, I fell at His feet as a dead man. And He laid His right hand upon me, saying, ‘Do not be afraid; I am the first and the last, and the living One; and I was dead, and behold, I am alive forevermore, and I have the keys of death and of Hades.” (Revelation 1:12 18). ‘clothed in a robe reaching to the feet and girded across His breast with a golden girdle. And His head and His hair were white like wool, like snow; and His feet were like burnished bronze’ Very tan those feet! As I read this, what I saw that night all came flooding back to memory in detail! I had no doubt that I did see this! Only now, I don’t think it was an angel. I didn’t see his face though, I saw everything from the other side of a bed sheet that hung between me and Him. While the light penetrated and enveloped the rooms I could not make out His facial features..","date":"2012-06-01","mins":"10:30 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
