{"blood":[{"id":"comment-208855","author":"helmut_felzmann","post":"Hi anonymous reader! You play the role of a partypooper – don’t expect applaus. Dan Porter has already given you my website address (www.shroud.info). You are perfectly right in your opinion that Jesus might have survived the crucifixion. But I am not sure whether pre and postmortem blood can really be destinquished on a chemical basis. Especially in Russia corpse blood was used for blood transfusion. Therefore there can not be much difference. But I think there are many other signs for life on the cloth. Most of the “shroud researches” are (strong) christian believers and therefore per definition biased in this point. Of course STURP examined the Shroud under the assumption of a corpse under the shroud. But I would not allege that results in favour of a living person have bin suppressed – they were just not looked for and therefore not seen: projection makes perception..","date":"2015-08-24","mins":"7:07 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"}],"history":[{"id":"comment-53198","author":"helmut_felzmann","post":"Hi Charles, it is very interesting for me that your wife is working at the Victoria and Albert Museum, because: “A strange fact is reported by J.M. Mc Donell in Shroud News No. 84, 1994, page 9). I quote: “Meanwhile Dr. Tite acquired from the Victoria and Albert Museum a strip of cloth of 10 x 70 mm from a 14th century cloth, which he had cut in three equal pieces…” Such a sample is not noted in Nature” Source: http://www.shroud.com/pdfs/vanhels6.pdf So perhaps your wife could look around in the museum whether there is such a cloth from the 14th century with heribone weave in the museum, and if in the end such a stripe is missing interesting questions could be asked to Prof. Tite….","date":"2013-11-28","mins":"11:07 am","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"}],"image":[{"id":"comment-16495","author":"helmut_felzmann","post":"To anoxie: the area below is indeed very dark and different than the rest of the body image. This can be due to breathing. Scourge marks: I believe that most is part of the image only a part is blood. This is the image formation theory has also to explain this. If the image substance allocation has followed the temperature allocation this can be explained: wounds have a higher temperature than the surrounding skin..","date":"2012-09-19","mins":"3:31 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","title":"Latest on David Rolfe’s Site on Maillard Reaction"},{"id":"comment-16496","author":"helmut_felzmann","post":"To anoxie: the area below the nose is indeed very dark and different than the rest of the body image. This can be due to breathing. Scourge marks: I believe that most is part of the image only a part is blood. This is the image formation theory has also to explain this. If the image substance allocation has followed the temperature allocation this can be explained: wounds have a higher temperature than the surrounding skin..","date":"2012-09-19","mins":"3:35 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","title":"Latest on David Rolfe’s Site on Maillard Reaction"},{"id":"comment-16474","author":"helmut_felzmann","post":"In 2004 I had a long email discussion with Ray Rogers a long time ago. He agreed that diffusion processes and gas concentration differences alone could not effect the resolution of the image that we see. Something else had to be involved. We agreed that indeed we see an allocation of an image substance (“double bound saccharides”) and that as an approximation it can be said that the closer the cloth was located to the body at one spot the more image substance had been formed. The final allocation of the image substance gives the impression of an image. He had the opinion that the image formation process was a chemical process that took place at room temperature and took a while and that primarily gas concentation differences (amines) were responsible for this allocation. But he agreed that concentration differences could not effect the resolution and also not explain the image on the back side, where there was hardly any space between body and cloth and therefore no big possibility for gas concentration differences. There is also a problem to explain the dark area below the nose and the scourge marks. He agreed that temperature differences may have played a role, as temperature has an effect on the process speed of the chemical process. But then I had the impression that he was not willing to continue the discussion. If a natural process is supposed, temperature differences on the cloth can only come from a warm body: the closer the cloth was to a warm body, the higher was the temperature at that spot, the faster was the process speed and the more image substance has been formed – which is in agreement with what we see. The allocation of the image substance would then not be due to gas concentration differences but to temperature differences on the surface of the shroud. If a cooling down corpse is supposed there would be indeed such an effect. BUT: in the trunk of a corpse there is much more energy bound than in the extremities. Therefore the extremities would cool down fast and hardly any image should be visible there. But this is NOT what we see. The image is rather similar along the whole body, which speaks for a rather equal body temperature throughout the body during the whole duration of the process (about 36 hours). But this can only be possible if blood circulation and a beating heart was still there. Therefore I think that if somebody considers a chemical process (like the Maillard reaction as proposed by Rogers) he might finally come up with the hypothesis of a living body. This may also explain the uniqueness of the image. As far as I know there is only one similar (not equal!) image known, the so called “Liverpool image”, found on the mattress of a just died person in a hospice, which was formed by a warm (living) body. Corpses can not produce such an image, therefore the image on the shroud is unique, pointing to a unique event (my opinion)..","date":"2012-09-18","mins":"3:25 pm","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","title":"Latest on David Rolfe’s Site on Maillard Reaction"}],"resources":[{"id":"comment-200734","author":"helmut_felzmann","post":"Thank you Dan, for your invitation – I am the guy, who came to the conclusion that the man under the shroud must have still been alive. This is my website: http://www.shroud.info I have written and researched for the book more than 10 years. With this link you can download the chapter relevant here for free: https://dl.dropboxusercontent.com/u/16452134/A%20 Living%20 Man%20among%20the%20 Dead.pdf Here is a paper of the forensic scientist Lorente: https://dl.dropboxusercontent.com/u/16452134/Miguel Lorente english.pdf I will keep both links active for about 4 weeks. I am tired of ideological disputes. I know that it is written that Jesus died on the cross. But here we are examining a historical object. I am looking for discussions only on the basis of facts and observations. After I have been almost kicked out of the shroud science group as some members see the supporting of this hypothesis as an insult to them and their faith, I have just received today the following mail, I was very pleased with: ————————————————————————————————————— Dear Dr Felzmann I have read extracts of your book and your medical analysis and presentation of facts regarding the Shroud of Turin, and the image heralding from a living person, a view that I hold very strongly too. Your medical explanation is so powerful and is what I was seeking for a book I am about to embark on writing. I had the privilege of seeing the Shroud for myself on 10th May 2015, it is a topic I have researched for many years. I am writing to seek your permission to use extracts from the above book and others you have written on the subject, using your ‘living body’ not a corpse, evidence in the main. I would be grateful if you could kindly advise me at your earliest convenience if this will be possible. Your research is truly compelling and a must for truth seekers all over the world. Thank you for your time. Kind regards, ———————————————————————————————————— Best regards Helmut.","date":"2015-06-01","mins":"2:51 am","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"id":"comment-6909","author":"helmut_felzmann","post":"Hi Chris, Ascension, lie …? Hmm – If you want to remain in the religion stories of your childhood you should not be engaged too much with the shroud. Or you follow the stories of the religious shroudies (image formation caused by a supernatural burst of energy during the resurrection). You are the maker of your reality. You find everything out there, just look around and take what you like. You need not to question anything in your religion, if you do not want. But do not come too close to the Turin Shroud then!.","date":"2012-01-13","mins":"6:55 am","url":"https://shroudstory.com/2012/01/09/new-kindles-from-helmut-felzmann/","cat":"books","title":"New Kindles from Helmut Felzmann"},{"id":"comment-7006","author":"helmut_felzmann","post":"Ron, perhaps you want to read the paper of Dr. Lorente, spanish forensic expert, entiteld: “Forensic Analysis of the Image and Bloodstains on the Shroud of Turin: Contributions to the Evaluation of the Circumstances Surrounding the Burial of Jesus of Nazareth” http://www.shroud.info/Lorente.pdf It is easy to proclaim that onself is in the possession of truth and that the other is misleading himself, but it is better to get acquainted with the arguments. Helmut..","date":"2012-01-15","mins":"2:56 pm","url":"https://shroudstory.com/2012/01/09/new-kindles-from-helmut-felzmann/","cat":"books","title":"New Kindles from Helmut Felzmann"},{"id":"comment-6760","author":"helmut_felzmann","post":"Hi Dan, thank you that you have posted my information. I highly appreciate your attitude towards a discussion without taboos and without censorship. I can understand the comments very well. I just remember the moment when I first was confronted with this idea that Jesus has survived his crucifixion. I looked around in the theologian corner of a large bookstore in Dusseldorf and saw on a special table Kersten’s&Gruber’s book titled (translated) “Jesus did not die on the cross – the message of the Turin Shroud”. Instantly I became angry and decided not to deal with such nonsense heresy. But as I was in the middle of the process of writing a book about my spiritual experiences (also with Jesus because I was still a traditional Christian believer at that time) in which also the Shroud should play a role as a kind of proof for a supernatural resurrection I decide later nevertheless to buy the book, because I thought that I have to get to know all opinions and their argumentations concerning the shroud – even the funny ones – if I want to write a book that deals also with the Shroud. After reading I had a sleepless night because instantly the evidence for this hypothesis was clear to me. Yes I had to rethink a lot concerning my world view but today I feel much better than at the old Christian times – and my questions are answered. Today I am not alone with my view, there are forensic experts in Spain, Great Britain and Germany, who came to the same conclusion. That Jesus should have survived the crucifixion is a merely unbelievable idea but normal scientifically discussed in Europe. Europe is here different than the US. I have put some further information at http://www.shroud.info By the way, I think there are also many points we agree, like: The Turin shroud is the genuine shroud of Jesus We both are “fans” of the man of the Shroud (Yeshua / Jesus) The shroud mirrors a merely unbelievable event The shroud is a highly disputed object, mirroring the religious beliefs and world views of the people, which deal with the shroud. Our discussions concerning the Shroud are historically import because the shroud is significant. This is quite a lot in shroud research, isn’t it? Helmut.","date":"2012-01-10","mins":"6:18 am","url":"https://shroudstory.com/2012/01/09/new-kindles-from-helmut-felzmann/","cat":"books","title":"New Kindles from Helmut Felzmann"},{"id":"comment-7005","author":"helmut_felzmann","post":"Ron, your posting makes it difficult for me not to become personal, like you. But I try to stick to the matter: I once have been a strong christian believer, like you I assume, and it was hard for me, to realize that many (historical) things are not so, as they are teached at bible school or during religious lessons or sermons. I recommend you to read the wikipedia article about the ebionites, who are derived from the historical (original) desciples of Jesus: http://en.wikipedia.org/wiki/Ebionites. No this is not the absolute truth, but this is just to give you a little hint, that historical thruths about early christianity may not have been as you think or as it is taught in religious lessons. Yes there are (religious) forensic experts who proclaim that the TS man was dead. The argumentations are like yours: the injuries are too fatal, nobody can survive this. But there are forensic experts from spain, GB and Germany, who are absolutely sure that the TS man must have been alive. Are you willing to look at the evidence? Helmut.","date":"2012-01-15","mins":"2:40 pm","url":"https://shroudstory.com/2012/01/09/new-kindles-from-helmut-felzmann/","cat":"books","title":"New Kindles from Helmut Felzmann"},{"id":"comment-6862","author":"helmut_felzmann","post":"Hi Chris, I consider your questions very justified and clear and not offensive at all. +++ If Jesus survived the crucifixion wouldn’t the shroud be literally soaked with blood (especially in the back image area) as opposed to just stained with blood +++ This is one main question: do the bloodstains sustain live or death? I answer with quotes from my book (Risen or Rivived?): Of course, corpses can also “bleed” out of large wounds on the lower part of the body due to gravity. Also during transport of a corpse, the emission of blood is possible if pressure occurs in areas containing blood. Looking very carefully at the individual bloodstains on the Shroud, one must differentiate the possible from the impossible. The late Prof. Wolfgang Bonte, former head of the Forensic Medicine Institute at the University of Dusseldorf and president of the International Organization of Forensic Scientists (IAFS) attempted to answer this question in the 1990s. First consider the bleeding from the wound on the side (the lance thrust wound). The lower back must have lain in a puddle of blood because bloodstains spread right and left six to eight inches beyond the area covered by the image of the body. Karl Herbst, a retired Catholic priest, wrote Professor Bonte with this information without revealing to him that the Turin Shroud was involved, in order that Bonte’s judgment would not be prejudiced. Bonte wrote back to Herbst that, according to this description, the opening of the wound on the right front chest wall was placed rather precisely on the highest point on the body, and he, Bonte, considered a spontaneous post mortem blood flow unthinkable because the blood level in the wound would have to have been lower than the opening of the wound. In such a case, no blood can flow out of a corpse. On the contrary, a blood flow in the proportions described by you, including the direction of the flow, would agree with the idea that the individual involved was still alive at this time. . . This applies especially then, when larger arterial vessels are opened and when the blood pressure produces the necessary pressure against gravity for the blood to leave the body. Herbst then revealed to Bonte that the matter involved was the Shroud of Turin and provided photographs and specialist literature for him in which the blood flows on the Shroud had been described in connection with a corpse. Above all, Herbst made Bonte aware of the argumentation of the Italian medical examiner Prof. Ballone, who had declared that “the cause [of the exit of blood on the shroud] is to be sought in the manipulation of the corpse during the burial procedures.” Professor Bonte, however, maintained his opinion and wrote back to Herbst: I will not repeat my earlier arguments. In my opinion, everything speaks to the fact that the blood circulation activity had not yet ended. Obviously I agree with Prof. Ballone that in the course of the transport of a corpse blood can flow almost passively out of such a stab wound to the chest. Yet one has to pose the question of whether the burial shroud was wrapped around the corpse already at the beginning of the transport. I believe that in this case no so called statically stain pattern would have been formed, which without exception permitted a direct, topographical assignment to a lying body. I would then far more have expected numerous traces of smears, whose locations would have been strewn more coincidental and irregularly. The pattern that is in fact recognizable indicates, in my opinion, that the person involved was only wrapped in the shroud during the placement in his grave, and indeed very probably in the form that at first the body was bedded on the shroud and the shroud’s other half was then drawn over the body. I cannot imagine that during this placement a considerable quantity of blood could have flowed out passively. +++If a living body made the image where’s the example of a remake? +++ There this “liverpool image”, and image of the hand and the buttocks of a man, found on the matrass after he had died. Different chemistry yes, but a clear image, made by a living, warm body. +++Why are all these other folks who are trying to show how the shroud was faked not even seeming to explore the option to create a fake with a living body? +++ There are few attempts, but I think this scenario is too unbelievable and also a taboo for Christian believers. I have made experiments with a temperature sensitive camera. Kersten one with aloe and mhyrr. +++I’m guessing you’re not going to get too many volunteers therefore it’s not really all that testable +++ Yes this is one of the problems. I think the chemistry is very important (the sweat of a cruelly treated person has a certain chemistry. We also to not know, which ointments etc. Have been used, chemistry on the linnen threads etc. The “living body image formation hypothesis” is partly based on the work of Rogers: chemicals from the body sweat and other substances react with e.g. Starch on the linin fibers. But Rogers can not explain the high resolution of the image. Here energy coming out of the body is necessary. Body heat is the only natural energy coming out of the body necessary. Body heat (infra red) projects a thermal image onto the shroud (the lower the distance between body and cloth the higher the temperature and the chemical process follows the temperature (the higher the temperature the faster the process) and thus materializes the temperature image: the lower the distance between body and cloth the more image substance has formed and the darker is the image. That’s what we perceive on the shroud. +++ Where does one get the (implied) notion that the Vatican has kept a conspiracy alive for 2000 years? +++ no conspiracy, an error! The desciples surely believed in something supernatural: they saw Jesus hanging liveless on the cross, his burial, what else should the believe than that he must have been death, no reason to question this. It is the same with us, when we look at the shroud: a horrible injured body, a grave cloth, why question that the person was dead. Only a few people knew, and they kept their secret because they were in life danger. The Romans surely would crucify all helpers of a confounded crucifixion. +++Do you think that the Vatican didn’t have a conspiracy and only came to realize in the 20th century that the man on the shroud was supposedly alive?+++ The idea that the shroud covered a living person came up the first time in the 1950 in postware Germany by a man called Naber. In 1969 the Turinese Cardinal Pellegrino convened a commission of experts, unnoticed by the public, to test Naber’s hypothesis with the Shroud at hand. The result was as expected: “The Man under the Shroud had really been dead, and Naber is wrong with his claim.” But the idea had been launched into the modern world, and later authors came to the same conclusion. Turin knew. I think it is not so important what the clerics beliefed themselfs about this idea, the point is that conservative clerics perceive the shroud as dangerous as it could mislead (in their eys) people to believe something, which can only be horrible to them. But the main point is: what is the evidence for a fraudulent exchange of the samples. Is it sufficient the assume fraud? I think so. +++Wouldn’t the church be taking an awfully big risk, once deciding to carbon date the shroud +++ I think it is not approbriate to speak from “the church”. I think that there have been few men in the church, who had thought that it is their duty to do something to rescue the faith. I believe that they have been convinced that after the proclaiming of the medivial results the “story of the turin shroud” will be over and that it will disappear in some archive and nobody will ask and research anything about the shroud anymore. But as so often after a crime, some time the truth comes out, the truth is something very powerful … +++was it only important that a non first century date be returned? What do you think they might have said if a 17th or 18th century date was returned?+++ No the date is very important, because it is shortly before the first exposition of the shroud in Lirey, therefore they could say: look, the shroud was produces (falsified) shortly before it appeared the first time in history. That is what the skeptics still say today. This is the reason that Tite (Tite & co where the guys, who later received the donation of one millions pound for the “Middle ages result” for a university chair for Tite. Tite today is Professor emeritus. This is no conspiracy theory, you can read the story e.g. At http://en.wikipedia.org/wiki/Radiocarbon 14 dating of the Shroud of Turin or Ian Willson’s book, he is really a well respected person. A group of French Catholic traditionalists, who call themselves “Catholic Counter Reformation of the 20th Century“ were the first who investigated the circumstances and published their findings in 1991. They found out that Tite had sent a letter dated from 12 02 1988 to the Director of the Radiocarbon Laboratory at the University of Lyon, Jacques Evin, in which he asked for help in obtaining a suitable piece of fabric. Tite initially denied that he had written it, but when the letter was finally published, he had to admit his authorship: Dear Dr. Evin, …I would certainly very much welcome any assistance that you can give in obtaining a mediaeval control sample, which is as similar as possible in terms of weave and colour as the Shroud, since at present, I am not certain whether the British Museum will be able to provide such a sample… 1: The total sample would need to be 6 sq. Cms, (i.e. About 120 mg) 2: The material of the sample should be linen. I enclose a photocopy of some photographs which give some indication of the weave of the Shroud. 3: We are looking for a sample which dates from the 13th or the 14th century A.D., preferably the latter. 4: The historical precision should obviously be as good as possible, but one would certainly consider samples with an age range of fifty to a hundred years. 5: There is no need for the sample to come from a well known piece of textile. … Yours Sincerely, Signed: M. S. Tite. Ask yourself, why should be such an exact date be necessary for a blank test? This would indeed complicate the search unnecessarily. If you follow the paper in Nature , none of the blank samples had the herringbone pattern of the shroud. Why go to so much trouble in obtaining this piece? So Chris, a lot of text, much copied from my book, but you have asked many questions and the case is very complicated. Perhaps you like to read my ebook and read about the other information? This would save me a lot of time for your new questions, which might come. But just ask. Helmut.","date":"2012-01-12","mins":"4:02 pm","url":"https://shroudstory.com/2012/01/09/new-kindles-from-helmut-felzmann/","cat":"books","title":"New Kindles from Helmut Felzmann"},{"id":"comment-6922","author":"helmut_felzmann","post":"Tersio, if you offer miracles as explanation, the possibilities are only limited by your phantasy.","date":"2012-01-13","mins":"9:21 am","url":"https://shroudstory.com/2012/01/09/new-kindles-from-helmut-felzmann/","cat":"books","title":"New Kindles from Helmut Felzmann"},{"id":"comment-53194","author":"helmut_felzmann","post":"Dear Charles, it is very interesting for me that your wife is working at the Victoria and Albert Museum, because: “A strange fact is reported by J.M. Mc Donell in Shroud News (No. 84, 1994, page 9). I quote: “Meanwhile Dr. Tite acquired from the Victoria and Albert Museum a strip of cloth of 10 x 70 mm from a 14th century cloth, which he had cut in three equal pieces…” Such a sample is not noted in Nature” Source: http://www.shroud.com/pdfs/vanhels6.pdf So perhaps your wife could look around in the museum whether there is such a cloth from the 14th century with heribone weave in the museum, and if in the end such a strip is missing interesting questions could be asked to Prof. Tite….","date":"2013-11-28","mins":"10:59 am","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","title":"Unraveling Unusual Stitches in the Turin Shroud"},{"id":"comment-53810","author":"helmut_felzmann","post":"Charles, that’s a pity. Well – exchange of the samples: there is much more evidence for it than you might think. But this would be to much for discussing it in this thread. If there is a real interest for this subject, a new thread could be opened..","date":"2013-11-29","mins":"5:53 am","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","title":"Unraveling Unusual Stitches in the Turin Shroud"}]}
