{"coins":[{"author":"hsgppf","post":"Hello Max.\nThe reason we only allow access to our archives on our site is because we need to keep track who’s accessing them.  If we allow people to have the digital files from our archives  we would not be able to keep track who’s accessing these files since people can easily transmit these files via e-mail. Plus the images that are used in the P-paper document are HSG ppf© and can be easily extracted in photoshop. \nThe best we can offer with any of our archives are hard copies.\nGiorgio\n\n","date":"October 31, 2011 at 11:46 am","url":"https://shroudstory.com/2011/10/26/father-filas-discover-pilates-lepton-coin-paper-available/","cat":"news_&_views","title":"Father Filas’ “Discover Pilate’s Lepton Coin” Paper Available"}],"history":[{"author":"hsgppf","post":"New evidence may explain image on Shroud of Turin” by Kohlbeck and Nitowski. Biblical Archeological Review (BAR), vol 12 n. 4, 1986, pp.23-24)\nBy César Barta \n http://holyshroudguild.org/ceacutesar-barta.html\nhttp://holyshroudguild.org/cesar2.html\nhttp://holyshroudguild.org/cesar3.html\n\n","date":"March 26, 2012 at 2:25 pm","url":"https://shroudstory.com/2012/03/25/comment-promoted-travertine-aragonite-limestone/","cat":"history","title":"Comment Promoted: Travertine Aragonite Limestone"},{"author":"hsgppf","post":"http://www.youtube.com/user/Holyshroudguild?feature=mhee\n\n","date":"August 22, 2011 at 9:34 am","url":"https://shroudstory.com/2011/08/21/paper-chase-new-from-the-holy-shroud-guild-site/","cat":"history","title":"Paper Chase: New From the Holy Shroud Guild Site"}],"misc":[{"author":"hsgppf","post":"Hello Gabriel\nAny time your around my neck of the woods I’ll be happy to show you the actual 1931 original prints Father Filas used for his study. In the mean time you can access the HSG’s paper titled Discover Pilate’s Lepton Coin which explains Fr. Filas procedure.\nA password is required, which you can request at http://holyshroudguild.org/hsg-archives.html.\n\n","date":"October 26, 2011 at 5:10 pm","url":"https://shroudstory.com/2011/10/26/likely-error-in-hamons-frascati-acheiropoietos-workshop-poster/","cat":"news_&_views","title":"Likely Error in Hamon’s Frascati Acheiropoietos Workshop Poster"}],"researchers":[{"author":"hsgppf","post":"“you say tomato, I say tomahto”.\nThis is what happens when work is not fully cited…………………………\nEXCERPTS FROM http://holyshroudguild.org/drraes-problematic-threads.html\npassword protected\nDr. McCrone writes in “Judgement Day for the Turin Shroud” page 82 on Dec 26 1978, starting with 3-CB a heavy image area, blood from the lance wound using low magnification (10% +10% oli) I could see a heavy crustacean (of blood?) – too red”!  Page 84 on Feb 2 1979 he writes, “I have spent a lot of time looking at the tapes especially the red particles. There are a lot of them and they are definitely inorganic. hundreds of fiber are well-coated with these deep red particles. They are the same particles Pellicori and Evans show in their low power photomicrographs they say this is blood- I say it is an inorganic compound.  In our archives I have more notes written by Dr. McCrone which was not published. ” Dr. McCrone writes  on June 13th 1979, “Sample 3AF (finger image) shows the largest percentage of colored fibre examined it closely the fibers are un-uniform colored over lengths exceeding weave units hence the color is not a surface effect-possible mechanism includes heat or liquid treatment. There are in this sample and others a number of yellow amorphous tubular flaked like a material resin. ( I thought in the part they could be aloes or etc).”\nThe yellow amorphous tubular flaked like material resin was possibly also the same thing Dr. Nitowski saw and was convinced it was Myrrh and aloes just as Dr. McCrone first thought. Steven Schafersman is also correct when he states the madder root was first announced by Dr. McCrone.  This is also confirmed by Paul Maloney, President of ASSIST at a Talk given at the “The Shroud of Turin: Perspectives on a Multi-Faceted Enigma” conference in Columbus, Ohio on August 14-17th 2008, when he states, “Walter McCrone had sent him in 1981 several Kodak transparencies of photos he took of Shroud linen fibers. “On those slides, (Guild also has them) McCrone had written the following note: madder rose, linen fiber, medium (blue) sample 3 CB” 4 and sample 3-AB. McCrone was referring to photomicrographs made on STURP sticky tape samples 3-CB and 3-AB which came from the blood flow across the back nearest the side-strip side of the Shroud and directly adjacent to that flow on linen, itself. It was on that side where someone would have been working their repairs if the re-weave theory is held to be correct. McCrone, of course, due to his belief that the Shroud was painted by an artist, was trying to prove that the Shroud had been in an artist’s studio.” Source: Maloney, Paul C. “What Went Wrong With the Shroud’s Radiocarbon Date? Setting itall in Context.” Talk given at the “Shroud of Turin: Perspectives on a Multi-Faceted Enigma”conference in Columbus, Ohio on August 14-17th 2008.\nComments: Regarding the presence of madder rose on the cloth, Maloney says, “There is now a\nnew way of looking at the presence of that madder rose. Although this is some distance from the\n“Raes Corner” such trace amounts can now be conjectured to explain the dye that was used,\nalong with the aluminum mordant and the gum Arabic as a binder to create the wash to finish the\nre-weave. Thus, it may now be seen not as a contaminant from an artist’s studio, but rather a\ncontaminant from the weaver’s workshop.”\n\n","date":"May 21, 2012 at 11:06 am","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","title":"The Valencia Dawkins Challenge:  No Consensus on Consensus"}]}
