{"forensic":[{"author":"impman","post":"This blog is doing a fantastic job of discussion. I wish more of the SSG folks would enter discussions here.","date":"July 29, 2011 at 4:33 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","title":"More on Flagrum Proportions and Measurements and Now the Side Strip"},{"author":"impman","post":"What the! Paolo you wrote, “I am confident you will forgive me if I give more relevance to the opinion of a worldwide recognized expert of forensic medicine that gave a close look to the Shroud rather than to your opinion, based only on indirect information and probably without a specific professional skill in medicine. Professor Baima Bollone is a physician specialized in forensic medicine and in his career he analyzed more than one thousand corpses, and I am sure he can recognize if a stain is from blood or not.”I embarrassed that those words were written by a fellow member of the Shroud of Turin Science Group (SSG). I was even more embarrassed when you wrote, “Again, I repeat we are in the realm of hypotheses, and among them “the best ones” are usually those formulated by skilled experts, scientists, historians and medicians (as far as I know not by bloggers, sorry).”Here is an opinion formulated by a world renowned expert.  “Everything I have read or heard from Ian Wilson, Max Frei, John Jackson, William Meacham, Alan Adler, Baima Bollone, Alan Whanger, Leoncio Garza-Valdez, et al., is contradicted by my findings. How can I explain how only I could be right and dozens of other “scientists” be wrong? Very simply, none of them are chemical microscopists, small particle microanalysts, nor have they studied the Shroud tapes against a background of familiarity with pigments, media and artist’s paintings. If I am right, then all of their ideas are wrong and I am right.”The expert was microscopist Walter McCrone. Should we agree with him because he is a world renowned expert?Appeal to authority (Baima Bollone in this case) does not make for good science or good argument. Not in the blog and not in the all too secretive SSG chat rooms. Praise the bloggers, they know better. Praise the bloggers for are discussing the shroud in public where it should be discussed. It is bloggers and other non-experts that are challenging the experts and raising legitimate questions. And Yannick is told by you that the good answers come from “skilled experts” and “not bloggers.” What crap! Danin is an expert. He is highly respected, and deserves to be. I think he is wrong about plant images. Many bloggers think so too.   Jackson is an expert. Perhaps no one has contributed more to shroud science. I think he is great and quite right on many things. I think he is wrong on some things. Many bloggers think so too.   Rogers was an expert chemist. The world of shroud science owes so much to him. He was right on many things. I think he was wrong on some things. Many bloggers think so too.   Flury-Lemberg is a textile expert. I can’t tell you how much I admire her work on the shroud. She is right on many things. I think she is wrong on some things, particularly the reweaving. Many bloggers think so too.Over at SSG, it has been particularly nasty lately. One member was driven off by the kind of crap we just saw here in the blog. In every case it has to do with arguments about unsubstantiated claims by single experts. Maybe that is what happened here. SSG nastiness spilled over. In fact I think that is what is wrong with shroud science today. Too many experts with their own opinions and not enough science and discussion.  SSG members need to stop talking among themselves and come out and blog without being “bitchy.” Maybe WE should stop being so secretive and make out deliberations public like bloggers do. BTW, IMHO, I think Yannick is right. But then, I’m not an expert.","date":"July 24, 2011 at 3:26 pm","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical"}],"dating":[{"author":"impman","post":"I understand that there are some questions floating around in the inner sanctums of the Shroud Science Group about the existence of travertine aragonite in Jerusalem’s limestone outcroppings. I am particularly concerned by a quote from Mark Antonacci’s book, “Resurrection of the Shroud: New Scientific, Medical, and Archeological Evidence,”  that reads:Limestone samples taken from other tombs located at nine different test sites in Israel were also analyzed by Dr. Levi-Setti – but only the sample taken from the Jerusalem tomb matched the limestone on the Shroud.One might easily wonder why. Here is some more material I extracted from the book. It is mostly material from Kohlbeck, J. & Nitowski, E., “New Evidence May Explain Image on Shroud of Turin;” Biblical Archaeology Review, Vol. 12, No. 4, July/August 1986: An important indication that the events depicted on the Shroud of Turin occurred not just in Palestine, but specifically in Jerusalem, is supported by an examination of the limestone in the Ecole Biblique tomb in Jerusalem. The Ecole Biblique provided researchers with access to the same rock shelf as the Holy Sepulcher and the Garden Tomb, both of which are considered the most probable choices for the actual tomb of Christ. Tombs in the Palestine/Transjordan area were carved out of limestone, which remains wet and pliable and which rubs off easily with the slightest contact. [Nitowski, E.L., “The Field and Laboratory Report of the Environmental Study of the Shroud in Jerusalem,” Carmelite Monastery: Salt Lake City UT, 1986] Calcium carbonate is the major component of limestone. The limestone in the Jerusalem tomb was determined to be in the form of travertine aragonite, rather than the more common travertine calcite. [Kohlbeck, J. & Nitowski, E., “New Evidence May Explain Image on Shroud of Turin;” Biblical Archaeology Review, Vol. 12, No. 4, July/August 1986] Aragonite is less common than calcite and is formed under a much narrower range of conditions. The Jerusalem sample also contained small amounts of strontium and iron. [Nitowski; Kohlbeck & Nitowski] A calcium sample taken from a Shroud fiber on the foot has been compared to the calcium sample from the Jerusalem tomb. The Shroud sample was found to be in the form of aragonite, not the more common calcite, and also exhibited small amounts of strontium and iron. [Kohlbeck & Nitowski]This match was confirmed by Dr. Ricardo Levi-Setti [Levi-Setti, R.G., et al., “Progress in High Resolution Scanning Ion Microscopy and Secondary Ion Mass Spectrometry Imaging Microanalysis;” Scanning Electron Microscopy, Vol. 2, 1985, pp.535-552] of the Enrico Fermi Institute at the University of Chicago. Dr. Levi-Setti analyzed the calcium from both the Shroud fiber and the Jerusalem tomb with a high-resolution scanning ion microprobe. The resulting graphs show that these samples are an unusually close match, except for minute pieces of flax that could not be separated from the calcium sample taken from the Shroud fiber and that caused a slight organic variation. [Kohlbeck & Nitowski] Limestone samples taken from other tombs located at nine different test sites in Israel were also analyzed by Dr. Levi-Setti – but only the sample taken from the Jerusalem tomb matched the limestone on the Shroud.” This matter can only be resolved by an independent verification of travertine aragonite in Jerusalem outcroppings. Perhaps the too close of a match.","date":"September 15, 2011 at 4:48 pm","url":"https://shroudstory.com/2010/08/10/reverend-know-it-all-do-you-really-think-jesus-rose-from-the-dead/","cat":"carbon_14_dating","title":"Reverend Know-it-all: Do you really think Jesus rose from the dead?"}],"researchers":[{"author":"impman","post":"This is part of what seems to be driving Dr. Fanti. He is actually citing this junk on SSG. “From my reading of many books on the Year 2012, I see that this scenario  is very similar to that described in these books, the common theme being that there will be no electrical power to heat and light our homes, and the only protection will come from prayers, especially to the Mother of God, and by lighting a blessed candle.  It is very likely that far-infrared light emanating from blessed candles may also offer additional protection, as demonstrated by an American physicist, Prof. Phillip Callahan of the University of Florida. It may sound presumptuous, but I believe that electromagnetic energy generated during prayers in Medjugorje, where  The Mother of God is appearing daily, may form a kind of  a protective umbrella against deadly radiation coming with the solar wind.  …  Due to closing of the recent precession cycle in 2012, the Earth axis will assume a perpendicular position to the Galactic eclipse and thus geographic areas between Poles and the Equator will have a constant, Spring-like  weather. – A thousand years of Peace ?  …  In conclusion, despite terrifying predictions associated with the year 2012, we will survive if we follow the instructions given to us by God.  It is possible that many people will perish, but we cannot consider it to  be God’s wrath, but a kind of a self-punishment resulting from our lack of faith particularly in a protective love of Our Lady of  Fatima and Medjugorje that is the belief and trust in God and His Providence.Dont believe me then check out http://www.medjugorjeusa.org/boguslawstudy07.htm and ask Dr. Fanti why. It is all electrical corona discharge stuff that is doing images and changing carbon dating.","date":"November 5, 2011 at 10:48 am","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","title":"A Guest Posting by Giulio Fanti"}]}
