{"pollen":[{"id":"comment-211962","author":"j_wayne_phillips_md","post":"Wouldn’t it be impossible to now obtain new samples of pollen from the shroud since its “restoration” of 2002? Supposedly the vacuumed areas were preserved in small vials? Is that true? SSG member.","date":"2015-10-07","mins":"7:37 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","title":"Doubting the Pollen Evidence"}],"resources":[{"id":"comment-98774","author":"j_wayne_phillips_md","post":"Dan, Sorry my mistake. Your name for the college is what the Jesuit introduction included. I hadn’t heard what they actually said.They did not have it exactly right. I do feel it was close enough for most folks to look up and recognize that the college contains some of the best world experts on the shroud. I have no problem with the misquote. J. Wayne Phillips. MD.","date":"2014-04-12","mins":"3:55 pm","url":"https://shroudstory.com/2014/04/10/new-dvd-of-the-women-of-grace-programs-on-the-shroud-plus-some/","cat":"lectures","title":"New DVD of the Women of Grace Programs on the Shroud Plus Some"},{"id":"comment-98936","author":"j_wayne_phillips_md","post":"Hugh, Thank you for your response. Here is my simple take away after digesting all the previous sources I quoted. The “radiation theory” makes sense to me because I accept a 2 position cloth transfer theory. I presented the “hovering” 2 position theory. Dr Jackson’s “fall through theory” through a mechanically transparent body also requires some tautness in the cloth for a high resolution photograph affect therefore 2 positions. You have not mentioned the 2 position theory so you must not accept it. It is necessary for both theories of radiation image formation fall through or hovering. This is all conjecture but working backward from the facts of the image in all its totality of characteristics, it is my opinion that the hovering is the most plausible of all theories and the “fall through” second. I am sure Dr Jackson would disagree with me. Obviously this has to be a supernatural controlled event as explained. 2 positions theory: 1) the cloth is wrapped tightly in the tomb and blood stains transfer to the cloth. 2) at the moment of the resurrection the cloth unfolds and becomes incompletely taught. At that time a radiation of some type emits from the body in 360 degree fashion as the body dematerializes. Since the cloth is semi taught, it has no sides–only top, bottom and head. The image transfers in columnar/perpendicular fashion only to the top, bottom, and head areas. The radiation provides a photograph like image in those 3 areas only. Any radiation emanating perpendicularly from the sides of the body goes off into the tomb walls or some where? Since the reach of the image transfer mechanism is believed to span only a distance of 4 6 inches this adds to the weakness or lack of image production from the sides of body. Where is the contradiction now? Your prior explanation is faulty and your data is incorrect possibly because you did not know the details of my subjective/objective mix belief. With the details above, your opinion would be appreciated even if it is still negative. I hope these details helps our discussion. It is what I call the “best guess” theory. If you have a better explanation for image formation or want to discuss any thing above, I am willing to engage. Doc.","date":"2014-04-13","mins":"8:31 am","url":"https://shroudstory.com/2014/04/10/new-dvd-of-the-women-of-grace-programs-on-the-shroud-plus-some/","cat":"lectures","title":"New DVD of the Women of Grace Programs on the Shroud Plus Some"},{"id":"comment-98857","author":"j_wayne_phillips_md","post":"Dan , 1) It will take time but I will get you the exact quotes of who said what if you would like. The perpendicular radiation theory certainly comes from John Jackson and Gulio Fanti just form memory. The dominate talk and publications do favor the perpendicular radiation. It is the most repeated and make the most sense. At this point I do not think the totality of the shroud can have a “natural “explanation. I also think the SSG does about a good a job as possible with the ego’s flying around as they do.The data is on the shroud. If you work backwards from the given characteristics of the image, the shroud in 2 positions with perpendicular radiation is presently the best explanation. I can’t argue much since I personally have no evidence. As an allergist I do know pollen well and I am convinced by the shroud pollen as to its partial accuracy certainly to the point it could not be faked. I read data and make my own conclusions just as you do. 2) Kelly Kearse has provided a possible blob of wax picture. I will have to check her sources and my sources. 3) Joe Marino is one of the organizers also of the St Louis conference. Doc.","date":"2014-04-13","mins":"12:09 am","url":"https://shroudstory.com/2014/04/10/new-dvd-of-the-women-of-grace-programs-on-the-shroud-plus-some/","cat":"lectures","title":"New DVD of the Women of Grace Programs on the Shroud Plus Some"},{"id":"comment-98769","author":"j_wayne_phillips_md","post":"Sorry Hugh, I still beg to continue a gentleman’s disagreement with you and find everything I said as presented on the “theories” of image formation proposed by the 3 authors to be correctly presented. Of course you can pick apart details because no theory yet fits the 100’s of characteristic proven to be part of the image and there are “holes”. These theories are considered to be the best attempts so far at explaining the image. These researchers are members of the Shroud Science Group of which I am a member and represent the leading researchers in the world on the science of the shroud. I am not a researcher only a communicator. The membership consist of many the original STURP team of 1978 and whose peer revieved publications have in my belief debunked the C14 dating of 1988. All this information I quote is available on the web site “shroud.com”. As a member of SSG I have had access to their emails daily for almost 3 years. I,like you, have been a student of the shroud for 35 years.Please check into their work. It is amazing. Let’s stop arguing please. Everything I said is published, many in peer reviewed scientific journals, and sounds plausible to me. Please read the work of Dr.Jackson (fall through hypothesis + perpendicular radiation), Fanti (corona radiation hypothesis) and Paczek (weightless perpendicular radiation hypothesis). All 3 (the actually the majority of SSG members) agree the shroud had to some how achieve somewhat of a stiff plane like unwrapping to give such a perfect photographic image. The SSG will be hosting a conference in St Louis October 9 12. Maybe we could continue this dialogue in person? Thanks for listening, Doc.","date":"2014-04-12","mins":"3:45 pm","url":"https://shroudstory.com/2014/04/10/new-dvd-of-the-women-of-grace-programs-on-the-shroud-plus-some/","cat":"lectures","title":"New DVD of the Women of Grace Programs on the Shroud Plus Some"}]}
