{"history":[{"author":"jack_markwardt","post":"In 1999, I first presented my Antioch hypothesis at an international Shroud conference held in Richmond. My paper suggested an alternative to Ian Wilson’s then twenty year old Edessa hypothesis. No one was more receptive to my presentation and encouraging of my research than Ian who was also a presenter at that symposium.  While maintaning his own views, Ian graciously published my paper in the British Society for the Turin Shroud newsletter which he was then editing. Those who truly care about the Shroud owe an unrepayable debt to Ian Wilson for having pioneered the historical research which made it possible for others like me to supplement and build upon his work. Thirty-four years of endlessly-new information requires revisions to almost any hypothesis, notwithstanding its original brilliance, and I am quite certain that Ian will accept, respect, and appreciate any comment upon, or critique of, his own views and opinions so long as they are proffered in a reasoned and respectful manner.\n\n","date":"April 30, 2012 at 1:30 am","url":"https://shroudstory.com/2012/04/29/history-done-right/","cat":"history","title":"History Done Right."},{"author":"jack_markwardt","post":"I was simply expressing the concept that an advocate of the theory that the Turin Shroud was the Image of Edessa/Mandylion would seek to interpret this passage in a manner which supported that position, while a skeptic of that theory would do the opposite. A person having no pre-conceived notions would merely note that the anonymous seventh-century author of the Acts of Thaddeus revised the Abgar legend by (1) defining the Abgar portrait as appearing upon a linen wash cloth—a novel change to the Doctrine of Addai’s “painting” version; (2) describing the image as the face of Jesus—no change from the DA version; (3) attributing the image formation to the process of Jesus washing and drying his face—another novel change to the DA version; and (4) calling the washcloth both a tetradiplon and sindon—another novel change to the DA. So what does this passage tell an open-minded person? The simplest explanation would seem to be that this writer knew of the existence of a linen cloth which bore the image of Christ’s face which bore no signs of Christ’s passion or death, and that it had been folded four times. The passage does not state or imply that the cloth was a burial shroud, or that it was so large that it had to be folded for proper handling or storage, or that within its folds lay a full-body image of Jesus. I would expect an advocate of the theory that the Turin Shroud was the seventh–century Image of Edessa to argue that this unknown writer was aware of an extant four-folded linen cloth bearing an image of Jesus’ face which was then being maintained in Edessa, but that he did not know that a full-body image lay hidden within its folds (pressing the sindon reference too hard would tend to prove the author’s knowledge of an entire body image). Conversely, I would expect a skeptic of that theory to argue that this writer was aware of an extant four-folded linen cloth bearing the image of Jesus’ face—period. He did not know that this cloth was then being maintained in Edessa, or that the folded cloth was quite large when opened, that it had been used as a shroud, or that it had a full-body image hidden within its folds. In my opinion, this passage is perfectly reflective of the author’s knowledge of a face-image icon, perhaps but not necessarily the Image of Edessa/Mandylion, which had been folded in four for convenient storage. Therefore, as historical evidence of the theory that the Turin Shroud was the Image of Edessa/Mandylion, I believe it to be relevant but not particularly persuasive.\n\n","date":"April 30, 2012 at 12:07 am","url":"https://shroudstory.com/2012/04/26/hymn-of-the-pearl-description-of-the-shroud-of-turin/","cat":"history","title":"Hymn of the Pearl: Description of the Shroud of Turin?"},{"author":"jack_markwardt","post":"Yannick: This will be my final message, as I am not a blogger, and lack the time to discuss this subject to the extent which it truly merits. I have tried to make it clear that I am no longer persuaded that the Image of Edessa/Mandylion was the Turin Shroud, as information published only in the past three years has raised significant questions regarding that identification. It has always been puzzling as to why Procopius made no mention of an Edessan siege icon when, a half century later, Evagrius did so. Scholars dispute whether Evagrius actually reported this event or whether the passage is an eighth-century iconophile interpolation. Chosroes is known to have been determined to prove that Edessa was not impregnable due to its reputed special protection by the Christian god, and the Byzantine war with Persia was apparently still underway when Procopius wrote his siege account. Thus, Procopius may have omitted reference to the icon in an attempt to protect the city, and the icon itself, from the further attacks of Chosroes; however, the Persian threat had substantially subsided some forty years later when Evagrius wrote his Church history. The reasons why a bloodied Jewish burial cloth presenting a naked image of a man claimed by Christians to be divine would not be specifically referenced as such over the centuries vary with the times, situations, and places in which that cloth would have been found. An imaged burial cloth would surely have been treated quite differently from other Passion relics that were not potentially violative of ritual laws, iconoclastic policies, modesty concepts, and the like. Thus, unless and until someone discovers a literary, archaeological, or artistic reference to an imaged shroud of Jesus, prior to that of Clari, literary allusions to an “eikon”, or image, of Christ would appear to be evidential of its existence, as that term does not necessarily connote the now all too familiar painted or carved Byzantine icon. I extend my very best wishes to you and look forward to reading the historical hypothesis which you will surely develop to account for the still-missing history of the Turin Shroud.\n\n","date":"April 30, 2012 at 6:02 pm","url":"https://shroudstory.com/2012/04/26/hymn-of-the-pearl-description-of-the-shroud-of-turin/","cat":"history","title":"Hymn of the Pearl: Description of the Shroud of Turin?"},{"author":"jack_markwardt","post":"It is axiomatic that a whole is only as strong as the sum of its parts and scholars have the responsibility to assess a hypothesis by examining each of its constituent components. A theory which is founded upon weak evidence or which proceeds along lines of faulty reasoning will not be convincing. Theorists employ evidence drawn from sources of varying kinds, and the relative value of such proof is entirely dependent upon the nature of the theory advanced. Thus, if the hypothesis concerned the religious views of Constantine VII, the Narratio would undoubtedly provide strong evidence on this topic; however, if it related to the putative history of the Turin Shroud during the first five Christian centuries, the Narratio would be deemed a very weak source by the discriminating scholar. Similarly, if the hypothesis concerned the development of Christian legends, the Doctrine of Addai would certainly provide critical proof on the subject; however, if, again, it related to the putative history of the Turin Shroud, a discriminating scholar would reject its literal application, while seeking, within the legend, a substratum of relevant facts. The tetradiplon reference which appears in the seventh-century Acts of Thaddeus does not provide any evidence that the tenth-century Mandylion was a folded cloth. It does, however, provide evidence which supports an identification of the Turin Shroud with the Mandylion, but only if the following series of additional postulations is entirely accepted as established fact: (1) when this passage was authored, a Christ-image linen was being maintained in Edessa (notably, there is no other historical proof of a seventh-century linen Edessan icon, as Evagrius does not relate that the 544 siege icon was made of cloth); (2) this passage was intended to reference that same linen Edessan icon (notably, the text refers only to an imaged facecloth presented to King Abgar in the first century); (3) that same linen icon remained in Edessa until 944 when it was transferred to Constantinople (notably, there were at least three distinct Christ-icons of unknown nature maintained in Edessa at that time, although it seems clear that a linen icon was brought to the capital); (4) that same linen icon later became known as the Mandylion (this appears to be a reasonable conclusion); and (5) the Turin Shroud may be folded four times (tetradiplon) and in a particular manner to produce a facial Christ-icon with certain characteristics that are similar to artistic portrayals of the Mandylion icon (notably, none of these portrayals depict Jesus as dead, beaten, or bloodied, but, at this point, art and its history is implicated). In my humble opinion, it cannot be accurately asserted either that this unique literary allusion to a tetradiplon is entirely irrelevant to the proposed identification of the Turin Shroud with the Mandylion or that it provides definitive proof of such identification. The probative value of this text has long been, and it will remain, a matter of personal opinion based largely upon the extent to which the validity of each of the above-enumerated factual postulations is accepted.\n\n","date":"April 28, 2012 at 10:43 pm","url":"https://shroudstory.com/2012/04/26/hymn-of-the-pearl-description-of-the-shroud-of-turin/","cat":"history","title":"Hymn of the Pearl: Description of the Shroud of Turin?"},{"author":"jack_markwardt","post":"I originated and presented this hypothesis to an international conference convened at Ohio State University in 2008 for the simple reason that the early history of the Turin Shroud cannot be credibly linked to the ancient city of Edessa through a literal application of the Abgar legend. The preeminent historian of Edessa, J.B. Segal, after years of arduous study and investigation, concluded that the Abgar legend constitutes “one of the most successful pious frauds of antiquity”. It should not be surprising, therefore, that a number of highly-respected modern historians have summarily rejected this pious fraud as evidential of the Turin Shroud’s whereabouts during the first Christian millennium, particularly because real historical evidence provides not the slightest indication that pagan Edessa was even partially converted to Christianity prior to the late second-century reign of King Abgar the Great. The preeminent historian of Antioch, Glanville Downey, ascribed that development to a two-phase evangelization mission, one which initially resulted in the baptism of Abgar the Great and ultimately concluded with the consecration of Edessa’s first bishop, Palut, in 200 CE, by Serapion, the bishop of Antioch. Relatively recent attribution of an image of Christ to the city of Edessa during the first half-millennium of Christianity arises exclusively from a substantial permutation of the Abgar legend authored, in ca. 945, by a Byzantine Emperor who desired to bestow an apostolic provenance upon the Christ-icon which had recently been transferred to his capital from Edessa. In order to explain away, in one bold imperial stroke, the complete historical anonymity of this icon during the first five Christian centuries, Constantine VII Porphyrogenitus sponsored the publication and circulation of a tale which featured not only the cloth’s first-century concealment within a niche located above an Edessa city gate, but also its miraculous rediscovery there by a fictional Edessan bishop, Eulalius, during the Persian siege of 544 CE. It has been suggested, in lieu of this incredible miracle-discovery tale, that the icon was actually found in the wake of the great flood of 525 CE which damaged Edessa’s city walls; however, it is rather significant that such a truly notable event merited no mention whatsoever in the Edessan Chronicle, a Syriac work composed in ca. 540-544 CE, which not only described the great flood but also detailed the most commonplace of Edessan ecclesiastical matters. In my opinion, modern scholarship will continue to reject the identification of the acheiropoietos image of Christ which was brought from Edessa to Constantinople in 944 CE with the Turin Shroud unless and until the provenance of that icon, and the circumstances surrounding its arrival in Edessa, can be reasonably established on the basis of non-legendary evidence.\n\n","date":"April 27, 2012 at 4:33 pm","url":"https://shroudstory.com/2012/04/26/hymn-of-the-pearl-description-of-the-shroud-of-turin/","cat":"history","title":"Hymn of the Pearl: Description of the Shroud of Turin?"}]}
