{"misc":[{"author":"james_redford","post":"Hi, Yannick Clément. XX males are actual physically-real people.\nRuss Breault, there’s nothing speculative about these DNA results on the Shroud of Turin and the Sudarium of Oviedo, as these results are from physical testing, not a priori theorizing. The team of Italian researchers who conducted these tests on both the Turin Shroud and Oviedo Cloth in January 1995 were lead by Prof. Marcello Canale of the Institute of Legal Medicine in Genoa, Italy. This team included several researchers who had invented the standard DNA test for gender.\nThe Shroud of Turin and the Sudarium of Oviedo are both known to have quite divergent histories and different purported carbon-14 datings, and yet they both display the same XX male blood samples, results for which the world-renowned DNA scientists who collected and studied the samples on both artifacts had no explanation for (see Lucia Casarino, et al., “Ricerca dei polimorfismi del DNA sulla Sindone e sul Sudario di Oviedo”, Sindon Nuova Serie, Quaderno n. 8, dicembre 1995, pp. 36-47). Such was this research group’s confusion that they simply published the raw data without any attempt to provide analysis in an obscure Italian journal (which is quite remarkable, since Shroud of Turin and Sudarium of Oviedo research typically gets published in leading journals such as Nature and Science). Yet this is precisely the result to be expected from a virgin birth.\nThe extreme rarity of a human parthenogenic birth would be one of the confirmations that a miracle had occurred if Jesus was a virgin birth. Prof. Tipler proposes that at the very least the Y gene that encodes for maleness (the SRY gene) was inserted into one of Mary’s X chromosomes (if not all the Y genes, of which there are 28), but only became active in Jesus. DNA tests on the Turin Shroud and the Oviedo Cloth have both confirmed the DNA of an XX male, i.e., the blood is that of XX chromosomes but with Y genes present, which is strong evidence that the blood is that of an XX male. For more on this, see Ch. 7: “The Virgin Birth of Jesus”, pp. 154-193 of Frank J. Tipler, The Physics of Christianity (New York: Doubleday, 2007).\nFor those who would like to learn more about physicist and mathematician Prof. Frank J. Tipler’s Omega Point cosmology, which is a proof of God’s existence according to the known laws of physics (i.e., the Second Law of Thermodynamics, General Relativity, and Quantum Mechanics), and the Feynman-DeWitt-Weinberg quantum gravity/Standard Model Theory of Everything (TOE), see my following article:\nJames Redford, “The Physics of God and the Quantum Gravity Theory of Everything”, Social Science Research Network (SSRN), Aug. 6, 2012 (orig. pub. Dec. 19, 2011), doi:10.2139/ssrn.1974708, http://archive.org/details/ThePhysicsOfGodAndTheQuantumGravityTheoryOfEverything .\nFor a great deal of interesting information on the Shroud of Turin, see the below video:\nmhfm1 (Most Holy Family Monastery), “Proof that the Shroud of Turin is the Burial Cloth of Jesus Christ!”, YouTube, Apr. 1, 2011, http://www.youtube.com/watch?v=WRB16BARvz0 .\n\n","date":"August 17, 2012 at 1:16 pm","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","title":"A Winning Shroud of Turin Expository Speech"},{"author":"james_redford","post":"Not in the Shroud of Turin and the Sudarium of Oviedo. I was (somewhat) raised as a Protestant (I say “somewhat”, because really I was raised by a rather free-thinking mother who believed in Jesus, but she never pushed any belief-system upon me other than reading Bible stories to me from a set of children’s books of Bible stories and occasionally going to a Lutheran church until I was around age five, when we stopped going, and she was nominally Lutheran; and after that I don’t recall her ever talking to me about religion until after my own conversion to Christ), and so I have tended to regard interest in these artifacts as being a part of the Catholic obsession and worship of relics. My conclusion as to Jesus’s divinity isn’t influenced in the least as to the status of these relics.\nSo it doesn’t affect me if they are fakes, but obviously they are very important if they are real.\nThe only reason I became interested in them is due to the writings of Prof. Frank J. Tipler. When I first encountered his original article on these relics I thought he had somewhat gone off the deep end (as I had previously accepted his argument as to the logical necessity of the Omega Point cosmology based upon the known laws of physics). But as I thought more about his arguments as to how via the Principle of Least Action it is possible for such miracles to occur, it made his interest in these relics less strange to me, as I could see how it was actually physically possible per the known laws of physics, as strange as it might seem. (And that is another detail about science: about how contrary to commonsense it is. For example, General Relativity and Quantum Mechanics are so strange and contrary to commonsense that no one even thought to rebuke them before they were developed, precisely because they are so contrary to commonsense that no one even contemplated their possibility before they were actually formulated. That is: reality isn’t merely strange; rather, it is so utterly strange that humans can’t even imagine it without first deriving it via empirical science.)\nHence, I don’t really spend much time in researching or contemplating these artifacts, since their status doesn’t affect my conclusion as to Jesus’s divinity. (Although, as I said, if they are real then obviously they are very important. But their importance in that regard would principally be in relation to non-believers in Jesus’s divinity.) My conclusion regarding Jesus’s divinity is instead based upon other matters, of which I detail in my below article:\nJames Redford, “The Physics of God and the Quantum Gravity Theory of Everything”, Social Science Research Network (SSRN), Aug. 6, 2012 (orig. pub. Dec. 19, 2011), doi:10.2139/ssrn.1974708, http://archive.org/details/ThePhysicsOfGodAndTheQuantumGravityTheoryOfEverything .\n\n","date":"August 20, 2012 at 11:47 am","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","title":"A Winning Shroud of Turin Expository Speech"}]}
