{"art":[{"id":"comment-3345","author":"jane","post":"I have to say I am so terrified of death it isn’t funny and am terrified of God. I am Cahtolic an my life hasn’t been so great and pray it changes but I had to read this book. I was so interested in NDE’s just to see what people saw. Alot of my prayers arn’t answered but that book aslo gave me the chills and I’m not so afraid. First of all, if that is what Jesus looks like then he is one gorgeous looking man and I woudn’t be afraid. I would aslo love to see the Virgin Mary. The only thing is how do people move around. Do they have just part of a body and no legs? I think Colton said they floated which is kind of different. Theres so many questions and I really hope that is where my animals are. They are my babies. I would love to have Jesus come to me and see his face in a dream. Knowing how terrified of death I am I would think he would just to put my mind to rest. I always pray for what I am meant to do and what my purpose is but no answers. I really do love this book though and I have some questions to but like someone said thet are probably overwhelmed with all of this. But get this book everyone! It gave me goose pimples and I plan on reading it again. I hope everyone has their prayers answered. It not such a terrible world right now and God bless Colton!.","date":"2011-07-15","mins":"3:55 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}],"opinion":[{"id":"comment-42498","author":"jane","post":"I am A neg, my husband is B pos. Our child is AB neg. This is because my blood type is either AO neg/neg or AA neg/neg. His blood type could be BB pos/neg or BO pos/neg. That’s how you get a child with AB neg blood. You get one factor from EACH parent. AB is NOT passed down from one parent. If you believe in such things, the only time AB was passed from mother to child was when Jesus was born, since we’re assuming God the Father neglected to contribute a blood type. Any totally human child of Jesus or Mary (with Joseph) would have either A or B passed down from Jesus or Mary and A, B or O contributed from the other parent. Blood type would not confirm a genetic link to Jesus or Mary. You would need mitochondrial DNA for that..","date":"2013-08-31","mins":"11:19 am","url":"https://shroudstory.com/2011/07/25/tales-of-blood-type-ab-negative/","cat":"other_blogs","title":"Tales of Blood Type AB Negative"}]}
