{"art":[{"author":"jeffrey_liss","post":"OK, but you can’t tell me the Manoppello cloth ‘matches’ the Shroud image or was miraculously created.  For starters, God is a better artist than that.","date":"December 17, 2013 at 9:16 am","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica."},{"author":"jeffrey_liss","post":"Going theological for a moment…could we really expect the Resurrected Christ to look the same as the MoS?  Similar, sure, but wouldn’t there be significant differences?  Setting aside the when and how of image formation, the image is clearly that of a corpse.  Post-Resurrection, we have the experience of Mary Magdalene (John 20:1-16) — who didn’t recognize Jesus standing right in front of her, so different (transfigured?) was his appearance from what it had been.Frankly, this questions strikes me as an angels-on-the-head-of-a-pin kind of argument.  There are just so many variables we can’t even begin to fathom, never mind account for.  Personally, I look at these images and say “Close enough.”  Or, so sound a bit more pedantic (as we must when debating the obvious), the Akiane Jesus is “not inconsistent” with the Shroud.","date":"April 28, 2014 at 10:18 am","url":"https://shroudstory.com/2014/04/21/heaven-is-for-real-the-akiane-prince-of-peace-the-isa-mosaic-and-the-shroud-of-turin/","cat":"akiane_kramarik","title":"Heaven is for Real, the Akiane Prince of Peace, the ISA Mosaic and the Shroud of Turin"}],"dating":[{"author":"jeffrey_liss","post":"Having spent the last 20 years designing and building the systems that support scientists in their work, I have some particular suggestions for any future investigations into the Shroud.  They can be generalized as a plea: Pay as much attention to the technology and information model used to identify, preserve, and share scientific data as you do on the methods of collection and analysis.The goal here is to structure information such that it can readily be understood and reused by others.  Much of the web today consists of ‘mashups’ made possible through open APIs.  This enables others to combine and recombine content from multiple sources to deliver new information, adapt existing information to a new purpose, or discover relationships between previously disparate sources.  In other words, it powers everything from serendipitous discovery to cutting edge computer-aided research, but it can only exist when openness and sharing are prioritized rather than grudgingly conceded.  Any future investigative project should carefully consider and implement the following:1. Transparency.  We live in an age of digital rights management, copyright wars, and efforts to control what can exist and persist on the Internet.  Any future investigation should commit to the release of all images, video, data, analysis, etc. gathered.  In fact, there is no technological impediment to streaming all collection activities to a global audience in real time.  After the fact, data should be similarly public from a single Internet repository.  While I have great respect for scientists, the work they do, and the publishing process, the Shroud belongs to the world.  So should the data.  Wherever possible, authors should request that their published materials be publically available, rather than secreted behind paywalls.  For some publishers, this will be a deviation from preference or procedure; again, the Shroud is different.2. Data structure: Wherever possible, identify and structure information according to accepted international standards — not just in terms of file formats, but semantics as well.  For example, the Open Provenance Model (http://openprovenance.org/) provides a framework for explicitly identifying and tracing the nature and sources of scientific data.  BioPortal (http://bioportal.bioontology.org/) is a searchable repository of ontologies for the life sciences.  Semantically-structured data is vital for fruitful communication and collaboration, especially between different communities of interest or scientific specializations.  3. Public involvement: While the very thought will rankle some, there needs to be a way for non-professionals to be involved in the preparation, planning, execution, and analysis.  The fact is that important contributions have been made by non-professionals or by scientists working in “home laboratories.”  It is far better to encourage — but also formalize — those contributions than to summarily exclude them.  An example implementation might work something like Reddit.  Allow members of the public to comment or make suggestions, and use a system of weighted comment promotion as a traceable, rigorous way to move information collectively identified as valuable from a comment all the way to the attention of the scientific team.Other priorities need to be stressed, but with these three implemented (as well as the existing methods of getting people’s attention such as SHOUTING and comboxes) others will advocate for them more effectively than I.","date":"November 14, 2013 at 1:23 pm","url":"https://shroudstory.com/2013/11/14/colin-berry-is-writing-to-the-vatican/","cat":"carbon_14_dating","title":"Colin Berry is Writing to the Vatican"},{"author":"jeffrey_liss","post":"Equally incisive is Erwin Schrodinger: “It seems plain and self- evident, yet it needs to be said: the isolated knowledge obtained by a group of specialists in a narrow field has in itself no value whatsoever, but only in its synthesis with all the rest of knowledge and only inasmuch as it really contributes in this synthesis toward answering the demand, “Who are we?”In other words: Nothing means anything except in the context of everything.  You gotta love it when physicists get philosophical.","date":"November 14, 2013 at 4:41 pm","url":"https://shroudstory.com/2013/11/14/colin-berry-is-writing-to-the-vatican/","cat":"carbon_14_dating","title":"Colin Berry is Writing to the Vatican"}],"forensic":[{"author":"jeffrey_liss","post":"Isn’t the golden mean (phi) an intrinsic metric for bone length in the hands?  If so, isn’t the real question not the length of each finger, but the ratio of the bone lengths?","date":"November 8, 2013 at 3:06 pm","url":"https://shroudstory.com/2013/11/07/a-guest-posting-by-o-k-on-the-allegedly-too-long-fingers/","cat":"guest_posting","title":"A Guest Posting by O.K. on the Allegedly Too-Long Fingers"}],"history":[{"author":"jeffrey_liss","post":"History is replete with examples of events, people, artifacts, documents, etc. which, over time, have been misrepresented for reasons that have nothing to do with fraud or any other form of deception.  I’ll offer up a (completely off-topic) example.Americans with an interest in naval history may recall some of the controversy in the 1990s surrounding the identity of the U.S.S. Constellation, one of the few surviving warships from the age of sail.  It is currently moored at the Inner Harbor in Baltimore, Maryland.  While everyone agreed the ship existed and that it was old, the question was how old, and which ship was it?Was it the U.S.S. Constellation constructed in 1797 — one of the six original frigates of the U.S. Navy and a sister ship of the U.S.S. Constitution, the oldest comissioned warship still afloat?[1]  Was it a separate ship, a sloop-of-war constructed in 1854?[2]  Was it an extensive refit or partial reconstruction, with pieces of the original frigate used to construct the hull of a new vessel?  The U.S. Navy was adamant: there was only one ship named Constellation in the Navy List, and it was never stricken.  Therefore, the ship at Baltimore had to be the original.  Historians were less certain.Long story short: an extensive, multi-disciplinary investigation was conducted (sound familiar?), and the team was able to determine the truth: they were two separate ships.[3]  There was never an attempt to deceive, just some sloppy record keeping by the Navy — which also very much wanted to believe it still had not one but *two* of its original 6 frigates.I think anyone reading this blog recognizes many of the scenarios or possibilities the team investigated.  They are the same that come up when debating the Shroud or any relic.  The only difference, of course, is that the Constellation finally yielded a clear answer to its true identity — something the Shroud stubbornly refuses to do.History often works in the exact opposite way from science.  STURP investigated and concluded it could not say what the Shroud image was, only what it was not.  The Shroud’s Edessan sojourn is one of several possibilities, none of which can positively be disproved.  So, I’m going to agree with John Klotz: all this is extremely interesting, but it needs to be approached as backstory.  History, art, even Scripture — none of them can positively rule out authenticity.  The Shroud itself, and therefore the science, is the most compelling evidence.  [1] http://en.wikipedia.org/wiki/USS_Constellation_(1797)[2] http://en.wikipedia.org/wiki/USS_Constellation_(1854)[3] http://www.dt.navy.mil/cnsm/docs/fouled_anchors.pdf","date":"January 6, 2014 at 12:27 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"}],"image":[{"author":"jeffrey_liss","post":"A useful approach to this question might be to ask not where the nail is but how it got there.  Yes, of course, a Roman soldier hammered it into place, but how does one go about doing that?  More importantly, how does one do it efficiently and repeatedly on one of those days where the glory of Rome demands crucifying hundreds or even thousands of its enemies?  Like anyone with experience in law enforcement or the martial arts, I’ve learned, practiced, and employed my share of wrist locks.  It’s worth keeping in mind that the victim’s hand was probably not in the neutral, relaxed position we see in x-rays or diagrams.  Even if this is the Shroud of Christ and he willingly stretched out his hands to receive the nails, most victims of crucifixion would not go so willingly.  So, the Romans would have had techniques for immobilizing the wrist and positioning the hand in the ‘ideal’ posture for their purposes.  The effects of these would be to seriously distort the bones of the hand.  The spaces between bones would have expanded in some areas and lessened in others.  I think this merits further study, if only because we know so little about how crucifixions were actually carried out.  Granted, that’s an area of ‘lost knowledge’ that humanity is probably better off without, but it might help to clear up this issue. Now if I can just find someone willing to take x-rays while I apply various wrist locks to a volunteer…","date":"December 10, 2013 at 10:45 am","url":"https://shroudstory.com/2013/12/10/barbets-vs-zugibes-exit-points/","cat":"image_theory","title":"Barbet’s  vs   Zugibe’s Exit Points"},{"author":"jeffrey_liss","post":"I admire the persistence and ingenuity that went into this experiment, which is very convincing of…something.  Surely a medieval forger, had he existed, would have used a similar approach to develop his technique.  I can hear his patron (Geoffrey de Charney?) now: “You need HOW much more linen?  What happened to the six bolts I paid for last month? Do you know how much this stuff COSTS?” Except, you know…in French.","date":"November 15, 2013 at 2:37 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"author":"jeffrey_liss","post":"Here you go: http://i00.i.aliimg.com/wsphoto/v2/663163602_1/Pinart-3D-font-b-Pin-b-font-Sculpture-Frame-Artist-Fun-Toy-Home-font-b-Office.jpg","date":"November 29, 2013 at 11:04 am","url":"https://shroudstory.com/2013/11/29/this-may-be-the-biggest-mystery-of-all/","cat":"image_theory","title":"This may be the biggest mystery of all?"}],"misc":[{"author":"jeffrey_liss","post":"There are few things I’ll cop to being ‘passionate’ about, but this is one.  Any future investigation with direct access to the Shroud should commit in advance to releasing all its data — including high-resolution photos — under a Creative Commons or similar license.  I can understand the need to protect the image against inappropriate commercial use.  That can be accomplished through CC.  Everyone else — students, researchers, skeptics, the faithful alike — should have the broadest possible access.  Culturally, technologically, politically, it’s better to share willingly than try to restrict access.  Control is an expensive, losing battle anyway, so why not be free and open?","date":"January 3, 2014 at 11:03 am","url":"https://shroudstory.com/2014/01/03/brilliant-the-pause-button-with-the-rosary-hanging-from-it/","cat":"shroud_marketplace","title":"Brilliant:  The Pause Button with the Rosary Hanging From It"},{"author":"jeffrey_liss","post":"His name is Ian Lawton. See here: http://www.soulseeds.com/grapevine/","date":"January 7, 2014 at 4:38 pm","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","title":"Keep it Simple: Can Anyone Help?"},{"author":"jeffrey_liss","post":"All of which is as it should be (and ever has been).  Am I the only one who wishes the true meaning of ‘charity’ could be reclaimed?  The (C|c)hurch is meant to be a community, not a kingdom in its own right.  I think we’re all better served by a Church that is *not* self-sustaining, but relies on Catholics and others to dig deep and/or roll up their sleeves and do some good.","date":"January 3, 2014 at 11:07 am","url":"https://shroudstory.com/2014/01/03/brilliant-the-pause-button-with-the-rosary-hanging-from-it/","cat":"shroud_marketplace","title":"Brilliant:  The Pause Button with the Rosary Hanging From It"},{"author":"jeffrey_liss","post":"BTW, I also found a site that attributes the quote originally to Thomas Cathcart, [ http://www.goodreads.com/quotes/tag/sherlock ] author of “Plato and a Platypus Walk into a Bar: Understanding Philosophy Through Jokes.”  If the joke is printed in the book, it will probably make for a better reference.","date":"January 7, 2014 at 4:46 pm","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","title":"Keep it Simple: Can Anyone Help?"},{"author":"jeffrey_liss","post":"Where would he get the vast quantity of linen needed to support development of this technique by trial and error?  If that’s the claim, we’re not talking about just one linen shroud. Colin knew what he was trying to achieve and had some ideas about what wouldn’t work from the work of others.  Our conjectural forger would presumably be making this up as he went.  Hard to believe he nailed it on the first try, and experimentation with other materials surely would not yield the same results.  So who footed the bill?","date":"November 18, 2013 at 4:52 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"author":"jeffrey_liss","post":"David Goulet :I suppose a welathy benefactor would have been involved.Yes, once supposition is unleashed, pretty much anything is possible I suppose.","date":"November 19, 2013 at 10:15 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"author":"jeffrey_liss","post":"I have been editing Wikipedia articles since 2003, and I can tell you this: you will have a fight on your hands.  There are some very good articles on religious topics — because they are largely left alone by the so-called ‘skeptics.’  But the Shroud matters — for all the obvious reasons.  Don’t get me wrong — I think this is a fight worth having, and there’s no more public venue for it than Wikipedia.  Just be prepared to match them, either with vigilance bordering on obsessive-compulsive disorder or with numbers and discipline; you’ll need a group of people dedicated to watching and influencing the article.Initially, they will respond within Wikipedia — by using the system to their advantage.  If you persist, they’ll use social media channels like Twitter and Reddit to rally atheists to the fight.  So, the key is to out-think and above all out-reference them.  I would suggest focused, defensible edits.  Discredit the work of McCrone and Nickell, for example.  Wherever possible, reference only peer-reviewed studies in major journals (the atheist gospels).  Don’t, for example, cite the Górny and Rosikoń book (nothing against it; my pre-ordered copy is on my desk as I type this); instead, cite the actual studies or research on which they relied.Step one is to prepare by learning how Wikipedia works.  YouTube is a good source for this.  For example, here’s a two-part video on how to add citations in Wikipedia articles: http://www.youtube.com/watch?v=m2HFdEtYDyc and http://www.youtube.com/watch?v=W_a9fBc13b4Ultimately, this is winnable because the weight of research, facts, etc. are on the side of (at the very least) the Shroud being completely unique and utterly inexplicable.  Just understand what you’d be getting yourselves into.  I think it’s important, though, precisely because Wikipedia represents the zeitgeist of the Internet (sort of a meta-zeitgeist, I guess).  A truly balanced, NPOV article here will make a lot of people think about the Shroud, the evidence, and what it all means.  But then, in the interests of full disclosure: I pick fights with atheists on Twitter for fun. So, my objectivity is clearly suspect when the subject is ‘pointless arguments on the Internet.’","date":"December 2, 2013 at 11:58 am","url":"https://shroudstory.com/2013/12/02/the-anti-shroudrelicscatholicchristian-propaganda-on-wikipediaguest-posting-by-o-k/","cat":"news_&_views","title":"The anti-Shroud/Relics/Catholic/Christian propaganda on Wikipedia–Guest Posting by O. K."},{"author":"jeffrey_liss","post":"As a follow up to my comment, I have been testing the waters on the Wikipedia page by trying to correct a single word in the introduction.  After being reverted a few times, I added the following to the Talk page:The final sentence of the introduction identifies the TS as ‘one of the most studied and controversial artifacts in human history.’ My attempt to correct this sentence has been repeatedly reverted. There are two reasons the correction is needed. First, use of the term ‘artifact’ is not NPOV, as the article goes on to state the image — the thing that makes it controversial — was formed by unknown means and is the subject of debate.The Oxford English Dictionary defines ‘artifact’ as: An object made or modified by human workmanship, as opposed to one formed by natural processes.Merriam-Webster is even more definitive:1.a : something created by humans usually for a practical purpose; especially : an object remaining from a particular period1.b : something characteristic of or resulting from a particular human institution, period, trend, or individual2 : a product of artificial character (as in a scientific test) due usually to extraneous (as human) agencyThis exludes a) natural processes and b) acheiropoieta. Thus, the use of ‘artifact’ represents editorial opinion. This would seem to be confirmed by the revision comment: artifact is correct (this shroud was made by someone), don’t change words in quotations.The words are not part of a quotation; if they are, they are quoted inaccurately. The reference included for this sentence states: According to LLoyd A. Currie, it is “widely accepted” that “the Shroud of Turin is the single, most studied object in human history” in Lloyd A. Currie, “The Remarkable Metrological History of Radiocarbon Dating Journal of the National Institute of Standards and Technology 109, 2004, p. 200.Currie says ‘object,’ not ‘artifact.’","date":"December 3, 2013 at 4:24 pm","url":"https://shroudstory.com/2013/12/02/the-anti-shroudrelicscatholicchristian-propaganda-on-wikipediaguest-posting-by-o-k/","cat":"news_&_views","title":"The anti-Shroud/Relics/Catholic/Christian propaganda on Wikipedia–Guest Posting by O. K."},{"author":"jeffrey_liss","post":"Actually, this is something any of us can help with.  If you download an application like HTTrack, it’s easy to create your own, local mirror or backup of any website.  I have no idea how big the site is in bytes — after 18 years, probably very big — but assuming a decent broadband connection, you could have your own backup of the site within a few hours..  Thus, if the site were to go down or be compromised, you’d be able to help get it back up pronto.  You could even set up a recurring, incremental backup that periodically scans the site for updates and downloads just those.On a related note, don’t discount the value of cloud storage — not as a replacement for physical media but a supplement.  Dropbox, box.com, SkyDrive, Google Docs, etc. all allow you to store huge amounts of data for free.  Even the paid accounts which offer storage into the terrabytes are fairly reasonable.  They’re also excellent for files you want to share with others or make publicly available.Finally, once a ‘canonical’ backup of the site exists, it would probably be good to set it up for distribution as a torrent, as is explained here: http://www.sidewalkcrusaders.com/bthowto/btstart.htmlNow I’m really getting carried away, so I’ll stop there.  I’ve got to run to an IT meeting anyway (I know, big surprise.)","date":"January 9, 2014 at 11:38 am","url":"https://shroudstory.com/2014/01/09/they-dont-do-it-just-for-the-credit-card-numbers/","cat":"uncategorized","title":"They don’t do it just for the credit card numbers"},{"author":"jeffrey_liss","post":"Well I’m convinced I just watched something.","date":"November 15, 2013 at 7:41 pm","url":"https://shroudstory.com/2013/11/15/vinny-the-mystery-of-the-shroud-of-turin-has-been-solved/","cat":"tinfoil_hats","title":"Vinny: The mystery of the Shroud of Turin has been solved"},{"author":"jeffrey_liss","post":"Charles Freeman :O/K/ In that case perhaps we ought to reintroduce it with its priority being monitoring blogs about the Shroud- do you think it should still keep burning as a last option for those who remain sceptics?Tell you what: let’s make a rule. No one shall ever be subjected to any punishment than that endured by the man on the Shroud.Yeah. Perspective.","date":"December 5, 2013 at 2:41 pm","url":"https://shroudstory.com/2013/12/05/you-need-to-read-both-lines-of-the-headline/","cat":"humor","title":"You need to read both lines of the headline"}],"opinion":[{"author":"jeffrey_liss","post":"Short version: I don’t agree with Stephen Jones; ‘icon’ here is an intentionally ambiguous term.Parsing statements that emanate from the Vatican is an art form in itself.  I certainly don’t have the insight or experience to interpret papal statements generally, but I think what we have here is an example of Francis employing a generalized term to avoid making a pronouncement on authenticity.  A philosophical definition of ‘icon’ would seem to support this, at least according to the OED: https://dl.dropboxusercontent.com/u/78391/icon_OED.png I suspect Francis is using the word ‘icon’ because it encompasses both artifacts and acheiropoieta.  Again, I suggest consulting someone with more experience at this; Fr. John Zuhlsdorf comes immediately to mind: http://wdtprs.com/blog/ .  I can say, though, that popes often employ this type of semantic legerdemain as a foil against their every utterance being immediately taken as interpretations of Catholic dogma.","date":"November 29, 2013 at 10:32 am","url":"https://shroudstory.com/2013/11/29/a-point-of-view/","cat":"other_blogs","title":"A Point of View"},{"author":"jeffrey_liss","post":"How much humility was there in the way the radiocarbon results were announced in 1989?","date":"December 23, 2013 at 5:48 pm","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"author":"jeffrey_liss","post":"Yes, relic vs. artifact is a distinction that matters.  Ultimately, though, that comes down to belief.  The ‘most studied’ part is true in the sense that it has been examined, pondered, sought after, etc. for (the evidence suggests) nearly two thousand years.  In another sense, though, it’s not even close to the top of the things-examined-by-science pile (let’s assume for the moment that such a thing exists) simply because of a lack of access.  All of which makes sense given its fragility and the stakes involved but would still exclude it from the upper echelons of examined…thingies.  Until, perhaps, reliable and accepted non-destructive methods are available.","date":"June 29, 2015 at 8:59 am","url":"https://shroudstory.com/2015/06/29/is-the-shroud-really-the-most-studied-whatever-in-history/","cat":"comments_promoted","title":"Is the Shroud Really the Most Studied Whatever in History?"},{"author":"jeffrey_liss","post":"Curious you left out my parenthetical.  It crossed political, cultural, religious and language barriers.  Do you really expect it would be called the same thing — or even understood the same way — that entire time. Simply because there isn’t a formal chain of custody isn’t an excuse to ignore the evidence, which is compelling and abundant.","date":"June 29, 2015 at 10:26 am","url":"https://shroudstory.com/2015/06/29/is-the-shroud-really-the-most-studied-whatever-in-history/","cat":"comments_promoted","title":"Is the Shroud Really the Most Studied Whatever in History?"}],"resources":[{"author":"jeffrey_liss","post":"I refer to translation in the literal sense.  The man thinks in Spanish and, to some extent Italian.  The statements he makes — the ones most misunderstood — are usually expressed in Italian (a second language), then translated, often inexpertly by those lacking necessary context, into English.  In this form, they propagate within a global press that, while not *entirely* hostile, tends to exhibit a uniform incompetence when reporting on the Catholic Church.In short, one should be exceedingly skeptical of statements attributed to Pope Francis in the popular media.  There have now been multiple cases were what was reported was, in fact, the exact opposite of what the pope actually said.  Find a competent source and trust *only* translations provided by that source.  I recommend Fr. John Zhulsdorf.  When I want to know what the pope *really* said, I read his blog.","date":"December 18, 2013 at 12:38 pm","url":"https://shroudstory.com/2013/12/18/a-new-image/","cat":"press_coverage","title":"A New Image"},{"author":"jeffrey_liss","post":"They finally found a pope they like. That’s great. Now if they would just listen to what he says…instead of what they *think* he says…","date":"December 18, 2013 at 10:53 am","url":"https://shroudstory.com/2013/12/18/a-new-image/","cat":"press_coverage","title":"A New Image"},{"author":"jeffrey_liss","post":"$15.00 for a book by an author I’ve never heard of making some pretty outlandish claims?  I think not.","date":"December 13, 2013 at 3:20 pm","url":"https://shroudstory.com/2013/12/13/please-only-discuss-michael-judes-book-and-claims-here/","cat":"books","title":"Please Only Discuss Michael Jude’s Book and Claims Here"},{"author":"jeffrey_liss","post":"So, bottom line, the video’s description of the condemned tied together is speculation.  OK, but where did the ‘reconstruction’ originate?  There has to be some source for this; did the guy in the video come up with it himself?","date":"January 3, 2014 at 11:52 am","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","title":"New Video: Discovering Jesus in His Holy Shroud"}]}
