{"art":[{"author":"jeff","post":"If it’s projected light, then it’s white; that’s why a prism separates white light into it’s base colors. With reflected light, black means the object is absorbing all light, so it reflects nothing.\n\n","date":"January 14, 2012 at 2:21 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"jeff","post":"Thank you for sharing; I too had a near-death experience too long ago to be influenced by the media – 53 years ago. I was 2 1/2, and while most people may feel this is far too young to be really “aware” of anything, that’s not how it is when you’re experiencing it. I had the “tunnel” experience, and didn’t see Jesus, but could hear the whispers of many many people who had gone before me, though I couldn’t understand them; somehow I understood this. As I was about to go through I was told that I was free to do so, but if I did I could not come back. I responded, “I’m only 2 1/2, and have a lot of life to live.” Instantly I found myself suffocating; I had become tangled in the blankets at the foot of my bed, and I kicked and tore at them and finally freed myself. \nJust then my mother came into the room, but she didn’t understand what had happened. I finally told her about ten years ago, and she was shocked. I remember it as if it happened yesterday. \nIf anyone doubts the validity of these experiences, no matter how grand they may seem, don’t underestimate them. There is life after this one, and the Lord’s Book will guide you there.\n\n","date":"August 23, 2011 at 9:08 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}],"history":[{"author":"jeff","post":"[T]he idea of it being authentic is “just too powerful.”\nActually, there’s an awful lot of truth in that statement.  It’s why opponents (I think the term fits) of the Shroud and other relics are so willfully determined to ignore any evidence favoring authenticity.  They’re stuck in a cognitive loop: The Shroud _isn’t_ real because it _can’t_ be real, because if it is…well…it just _ISN’T_ real.\n\n","date":"January 21, 2014 at 12:53 pm","url":"https://shroudstory.com/2014/01/20/the-idea-of-something-being-authentic-is-just-too-powerful/","cat":"history","title":"The idea of something being authentic is \"just too powerful\""}],"image":[{"author":"jeff","post":"No, his doubt in such a situation is based on the known facts — patterns, if you will — of human behavior.  Plausibility is a comparative concept and is dependent on knowledge.  Whether we realize it consciously or not, human beings have a vast data warehouse against which we compare our every observation.  So, saying “I doubt your account” is really saying “Your explanation does not comport with the facts as I understand them” or perhaps “Your account is inconsistent with my previous observations of human behavior.”\n\n","date":"December 12, 2013 at 10:56 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"}],"misc":[{"author":"jeff","post":"While I don’t believe photographing an optical effect on a monitor can achieve anywhere near the detail, precision, or repeatability of modern image processing software, I can agree the Vatican cloth should be photographed with modern imaging equipment.  There’s really no reason not do take some pictures.\nOne of the most valuable thing researchers can do right now is probably the development of detailed protocols for future study — not just of the Shroud, but any other cloth, any other relic as well.  It would be beneficial, for example, to have a specified set of imaging techniques and use the same exact (if given the opportunity) on the Shroud, the Sudarium, and the Vatican veil.  Likewise, protocols for chemical analysis, DNA testing, etc. should be developed and published in advance even of the request to study any of these relics. At the very least, it would define the sense of the research community of what should be done, by whom, under what conditions, etc.\nThis is probably redundant.  I’m new to this subject, so work along these lines may have already been done.  If so, please point me to it.  I know there’s a document detailing plans for a “STURP-II,” but I can only imagine many of the methods proposed are dated.  I guess what I’m proposing is a publicly available, possibly-crowd-sourced, “Torino Protocol” that is kept constantly up-to-date and ready to go should the pope ever give the “papal nod” authorizing new tests.\n\n","date":"December 16, 2013 at 11:19 am","url":"https://shroudstory.com/2013/12/16/a-thread-dedicated-to-vincenzo-giovanni-ruellos-proposal/","cat":"news_&_views","title":"A Thread Dedicated to Vincenzo Giovanni Ruello’s Proposal"},{"author":"jeff","post":"This kind of thing is the reason that bottles of peppermint schnapps need to be kept *far away* from the thesaurus at this time of year.\nMerry Christmas, you sedevacantist loons.  Jesus is the reason for the season — and for the Church as well.\n\n","date":"December 20, 2013 at 12:36 pm","url":"https://shroudstory.com/2013/12/20/fan-mail/","cat":"news_&_views","title":"Fan Mail"},{"author":"jeff","post":"This is an interesting (lyrical?) twist on the misapprehension of Occam’s Razor common among atheists and some skeptics, who seem to believe that the most simplistic explanation which fits within their personal knowledge and experience is the same as the ‘simplest explanation that fits the facts.’  Yes, the imagination is capable of conjuring all kinds of scenarios.  If it weren’t for those darned facts.\n\n","date":"November 26, 2013 at 10:02 pm","url":"https://shroudstory.com/2013/11/26/imagine/","cat":"uncategorized","title":"Imagine"},{"author":"jeff","post":"I realize many of these points are probably addressed in other comments, but I’m doing this stream-of-consciousness, so please bear with me. \nI agree with you completely on rigor mortis; skeptics have yet to produce any response on this issue as credible and authoritative as Zugibe.  Yet they will blithely assert that the body would have been limp at image formation and proceed to erroneously interpret the anatomy as if the body were lying perfectly supine on a flat surface.  They resolutely guard and nurture this misbelief because so many of their criticisms of the Shroud are dependent upon it.  \nIn addition to the evident rigor, the absence of distortions consistent with gravity and contact with a planar surface need to be considered.  The hair, back and buttocks do not appear as they should.  I think Gilbert Lavoie’s study and photographs are especially helpful here.  Ideally, they should be reproduced using cadavers exhibiting various degrees of rigor; such observations, though, would be difficult to arrange without the professional access of an authority like Zugibe.  \nGiven the dearth of expected distortion, skeptics are effectively limited to arguing for one of the various flavors of ‘heated statue’ or bas relief theories.  The body must have been a hard, even solid, material.  Of course, these are easily confounded by blood, serum, and other obvuously biological evidence, which forces the argument back to consideration of a corpse.  And round and round we go.\nThe image is, and yet it cannot be.\nWhile I agree with the Augustine forumlation on miracles, I nevertheless think that the Creator’s understanding of nature’s physical laws permits manipulation on a level we cannot hope to understand any time soon.  For this reason, I think it’s fair to say that the image is essentially “impossible.”  It cannot be reconciled with what we understand of physics.\n\n","date":"November 28, 2013 at 11:50 am","url":"https://shroudstory.com/2013/11/26/imagine/","cat":"uncategorized","title":"Imagine"}],"opinion":[{"author":"jeff","post":"I suspect the root of all this is the lamentable imprecision in modern English usage.  Personally, I blame that rat b****rd Roget.  When the artless, clay-brained knaves* who call themselves journalists these days encounter domains of knowledge where linguistic precision is prized, necessary, and cultivated, the results are…well, you’ve provided a good sampling.  I will note, though, that theology and science seem equally affected.  Coverage of science stories in the popular media is just as bad.  \nAnd they say faith and reason have nothing in common.\n* Description of journalists courtesy of the Shakespearean Insult Kit: http://www.pangloss.com/seidel/shake_rule.html\n\n","date":"December 9, 2013 at 10:45 am","url":"https://shroudstory.com/2013/12/08/hurting-peoples-feelings/","cat":"other_blogs","title":"Hurting People’s Feelings"}]}
