{"dating":[{"id":"comment-89741","author":"jenx","post":"I see. It would be great if our number of supporters could help them realize that importance too, but then again… with the heightened attention, how could you miss a following like this? In the Benford paper, based on weave pattern changes in the sample, the estimated ratio reflected approx 60% 16th century threads and 40% 1st century in origin. IF this remnant is donated in the future, could enough fibers be separated for advanced dating in this particular piece?.","date":"2014-03-16","mins":"8:03 pm","url":"https://shroudstory.com/2014/03/16/so-was-the-small-arizona-piece-in-doug-donahues-custody-ever-made-available-to-barrie-schwortz/","cat":"carbon_14_dating","title":"So, was the small Arizona piece in Doug Donahue’s custody ever made available to Barrie Schwortz?"},{"id":"comment-89636","author":"jenx","post":"Amazing. Kudos to Dan, I adore this site. Everyday I learn something I never knew. I’m embarrassed to say this post made me very tense. I can’t imagine what could possibly motivate anyone to withhold something that I believe doesn’t belong to an individual, but to the world. I’m not sure how this happened, but it certainly should have went back to the Vatican. If I took a personal item in for testing, I wouldn’t expect a professional to keep a portion of it for himself. Maybe it was previously arranged and have came to the wrong conclusions, I hope..","date":"2014-03-16","mins":"12:36 pm","url":"https://shroudstory.com/2014/03/16/so-was-the-small-arizona-piece-in-doug-donahues-custody-ever-made-available-to-barrie-schwortz/","cat":"carbon_14_dating","title":"So, was the small Arizona piece in Doug Donahue’s custody ever made available to Barrie Schwortz?"},{"id":"comment-90102","author":"jenx","post":"Didn’t Flurry Lemberg, a textile historian, observe the variation in 02 during the restoration?.","date":"2014-03-17","mins":"1:43 pm","url":"https://shroudstory.com/2014/03/16/so-was-the-small-arizona-piece-in-doug-donahues-custody-ever-made-available-to-barrie-schwortz/","cat":"carbon_14_dating","title":"So, was the small Arizona piece in Doug Donahue’s custody ever made available to Barrie Schwortz?"},{"id":"comment-90105","author":"jenx","post":"Http://www.ohioshroudconference.com/papers/p09.pdf.","date":"2014-03-17","mins":"1:49 pm","url":"https://shroudstory.com/2014/03/16/so-was-the-small-arizona-piece-in-doug-donahues-custody-ever-made-available-to-barrie-schwortz/","cat":"carbon_14_dating","title":"So, was the small Arizona piece in Doug Donahue’s custody ever made available to Barrie Schwortz?"},{"id":"comment-89646","author":"jenx","post":"Unbelievable..","date":"2014-03-16","mins":"1:12 pm","url":"https://shroudstory.com/2014/03/16/so-was-the-small-arizona-piece-in-doug-donahues-custody-ever-made-available-to-barrie-schwortz/","cat":"carbon_14_dating","title":"So, was the small Arizona piece in Doug Donahue’s custody ever made available to Barrie Schwortz?"},{"id":"comment-89775","author":"jenx","post":"Would be great to know. If it did, it would also include threads from the main body since the 2 fibers were interwoven..","date":"2014-03-16","mins":"9:24 pm","url":"https://shroudstory.com/2014/03/16/so-was-the-small-arizona-piece-in-doug-donahues-custody-ever-made-available-to-barrie-schwortz/","cat":"carbon_14_dating","title":"So, was the small Arizona piece in Doug Donahue’s custody ever made available to Barrie Schwortz?"},{"id":"comment-89696","author":"jenx","post":"If anyone deserves to have it in their possession, I wholeheartedly believe it should be with you, Barrie. Your professionalism, non biased approach, integrity you present with the media and tenacious work makes every shroud enthusiast proud! I loved the shroud since I was in my early teens and my mother took me to a conference. After the carbon dating, I sadly accepted the numbers for over a decade until I began watching and listening to you. That old spark of excitement and joy has been with me since, I thank you for that! Would a petition on change.org be a possibility to get this to Barrie? Or any type of action? It’s so disheartening to imagine one day this sacred piece of Christian history could end up on ebay to the highest bidder..","date":"2014-03-16","mins":"5:24 pm","url":"https://shroudstory.com/2014/03/16/so-was-the-small-arizona-piece-in-doug-donahues-custody-ever-made-available-to-barrie-schwortz/","cat":"carbon_14_dating","title":"So, was the small Arizona piece in Doug Donahue’s custody ever made available to Barrie Schwortz?"},{"id":"comment-89753","author":"jenx","post":"Ebay = 21st century lot casting..","date":"2014-03-16","mins":"8:29 pm","url":"https://shroudstory.com/2014/03/16/so-was-the-small-arizona-piece-in-doug-donahues-custody-ever-made-available-to-barrie-schwortz/","cat":"carbon_14_dating","title":"So, was the small Arizona piece in Doug Donahue’s custody ever made available to Barrie Schwortz?"},{"id":"comment-88757","author":"jenx","post":"If you don’t mind me saying so For many shroud researchers who believe it’s authentic, it’s been a long process of gaining respect from the scientific community just based on the sample area and it’s fiber consistency. Adding theories of KGB agents mass hacking computers adds to the eye rolling and appears we are desperately grabbing at straws. I think we need to stick to the credible findings already on the table in order to gain further testing or the doors could be slammed shut..","date":"2014-03-14","mins":"11:59 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","title":"The Computer Hacker Hypothesis is Short on Factual Material"}],"events":[{"id":"comment-194688","author":"jenx","post":"Thank you for posting this!.","date":"2015-03-28","mins":"7:07 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"}],"image":[{"id":"comment-128409","author":"jenx","post":"Rolls eyes.","date":"2014-06-11","mins":"3:23 am","url":"https://shroudstory.com/2014/06/07/colin-berry-is-up-with-an-interesting-posting-about-3d-enhancement/","cat":"3d","title":"Colin Berry is up with an interesting posting about 3D enhancement"},{"id":"comment-206607","author":"jenx","post":"I’m enamored with Ms Piczek’s work, returning to her analysis suggesting the image was ejected onto the shroud as a quantum hologram during the time of explosion of the event horizons, pointing out the lack of entropy, gravity and negative image. Thanks for posting this video Dan, I haven’t seen it..","date":"2015-07-26","mins":"1:04 pm","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","title":"1999 Interview with Isabel Piczek"},{"id":"comment-90124","author":"jenx","post":"Ehboy. I know one fact, I need to invest in coffee and doughnut shop! Ha! I see the evidence yes. But with all due respect, I’m just an intelligent lay person finding it very difficult to program, reprogram, program…. Based on so much information, inconsistencies and variables from one source to the next. It seems to me many push opinions as facts based on spiritual beliefs or lack thereof. I do appreciate your work. I think I need to absorb this..","date":"2014-03-17","mins":"2:59 pm","url":"https://shroudstory.com/2014/03/15/of-pixels-spectrum-and-density/","cat":"image_theory","title":"Of Pixels, Spectrum and Density"},{"id":"comment-118524","author":"jenx","post":"Meticulously written paper. Nice work addressing all angles of paint and (could be applied for) scorch theories..","date":"2014-05-13","mins":"8:08 am","url":"https://shroudstory.com/2014/05/13/schwortz-it-is-worth-reviewing-david-fords-noteworthy-blood-or-paint-paper/","cat":"image_theory","title":"Schwortz: It is Worth Reviewing David Ford’s Noteworthy Blood or Paint Paper"},{"id":"comment-86576","author":"jenx","post":"Mike, I have a theory, where and how could it be discussed? Or how could I open a new thread?.","date":"2014-03-09","mins":"11:27 am","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","title":"Scorching Onion Skins"},{"id":"comment-86580","author":"jenx","post":"Thanks! I will do that! Now don’t tear me up too bad guys. Ha!.","date":"2014-03-09","mins":"11:38 am","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","title":"Scorching Onion Skins"}],"misc":[{"id":"comment-138914","author":"jenx","post":"I’ve studied preservation and cleaning methods of textiles for a personal collection of mine. Antique or ancient linen, being a plant fiber, can withstand water. However, when water is applied to a targeted area, the fibers swell and “pushes” collected particles to the perimeter of the water mark which darken over time. I’m not a rocket scientist fellas, but as I’ve studied the shroud I’ve gathered the image itself fades over time, while knowing edges of water stains darken. For the Templars, they would’ve seen a darker image + lighter stain, right?.","date":"2014-07-17","mins":"9:58 am","url":"https://shroudstory.com/2014/07/17/the-man-of-the-shroud-has-horns/","cat":"tinfoil_hats","title":"The Man of the Shroud has Horns?"}],"opinion":[{"id":"comment-209215","author":"jenx","post":"It’s clear to me The Vatican is using the word “icon” to be politically correct, given the fact science hasn’t publicly cleared the carbon dating findings. To claim it a relic would be too controversial. HOWEVER… with the church going to great lengths to preserve and protect the TS with security, controlled casing, etc speaks volumes regarding their opinion. As for the pope, his statements and prayers at the TS and regarding the TS demonstrates his individual opinion in its authenticity..","date":"2015-08-28","mins":"10:03 am","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"id":"comment-140793","author":"jenx","post":"After reading the blog page, I can relate to writer. Through my experience at University, Christianity itself has become a dummy stamp by many professors and grad students… and the TS eye rolling, Big Foot ish. These opinions influences young adults. It’s “hip” and “progressive” to be an atheist today. Penn and Teller are grabbing at a hot ticket since they’ve passed their peak. A popular marketing strategy in Hollywood. But, regardless of opinion, the TS deserves equal research..","date":"2014-07-27","mins":"10:49 pm","url":"https://shroudstory.com/2014/07/27/penn-tellers-hateful-bullshit/","cat":"other_blogs","title":"Penn & Teller’s Hateful Bullshit"}],"researchers":[{"id":"comment-104298","author":"jenx","post":"Amen.","date":"2014-04-27","mins":"1:08 am","url":"https://shroudstory.com/2014/04/26/report-on-barrie-schwortz-in-hamilton-ontario/","cat":"presentation","title":"Report on Barrie Schwortz in Hamilton, Ontario"},{"id":"comment-104595","author":"jenx","post":"I always hoped Barrie would write a book on the highlights of his site along with his experience. I really enjoy his presentations and respect his work..","date":"2014-04-27","mins":"10:59 pm","url":"https://shroudstory.com/2014/04/26/report-on-barrie-schwortz-in-hamilton-ontario/","cat":"presentation","title":"Report on Barrie Schwortz in Hamilton, Ontario"},{"id":"comment-85210","author":"jenx","post":"Fantastic points and comments. With religion being weaved into society and the artifact, it would be nearly impossible not to have subconscious biased theories even if they were suppressed. I’ve been thoroughly impressed with Barry Schwortz and his media presentations, even more so with this consideration..","date":"2014-03-05","mins":"2:27 pm","url":"https://shroudstory.com/2014/03/02/jones-the-turin-shroud-is-authentic-get-over-it/","cat":"other_blogs","title":"Jones:  The Turin Shroud is authentic. Get over it!"},{"id":"comment-97406","author":"jenx","post":"True Christians and false Christians are separated through love, tolerance and reaction to adversity. How do you act when you don’t get your way or when someone doesn’t agree with your beliefs? Newsflash Bigotry is NOT a Christian trait, in fact it’s an oxymoron. Remember folks, when you come online, the world is watching. It’s great to voice our individualism and thoughts, but IF you are a Christian it is your obligation to do so in a Christ like manner, regardless how right you THINK you are, or agitated you become. Why would anyone want to convert to a group of angry hypocrites spewing out condescending remarks faster than a new PEZ dispenser? It only encourages atheism..","date":"2014-04-07","mins":"12:04 pm","url":"https://shroudstory.com/2014/04/06/stephen-jones-is-even-questioning-my-beliefs-about-the-resurrection/","cat":"other_blogs","title":"Stephen Jones is even questioning my beliefs about the Resurrection"},{"id":"comment-86406","author":"jenx","post":"Or…. There would be a lot of scandals at the daycares. Ha!.","date":"2014-03-08","mins":"11:33 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"},{"id":"comment-86374","author":"jenx","post":"With all respect, I believe in this particular passage, Christ was praising God for the mysteries which had been revealed to the disciples (who were childlike) and not so for the Scribes and Pharisees (who rejected Christ’s teachings and the significance of His deeds). With a cross reference in Lk 8:10 and further in Mt 11:25 27. I can relate to this passage too. During my university years I began to think too deeply for scientific answers which made me question my original faith. Only when I submitted to my childlike state could I find the answers. Which in itself is another mystery! They’re everywhere! Lol. But too, this is just what “I” see in the scripture. I believe the Bible is a personal gift to each of us as individuals with different passions (and translations) to help us through our time on earth. And as followers in Christ we respect that individualism and unite through our actions and love..","date":"2014-03-08","mins":"9:44 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"},{"id":"comment-86331","author":"jenx","post":"Hello. I’m new to the site and enjoy your posts and debates! I heard a few years back where Schwortz commented about a financial benefit for the University if the Carbon 14 results were within the Window however, it wasn’t expanded due to the political repercussions. I think personally the sample was unintentionally tainted from prior restorations… and maybe it was meant to be, just like finding the missing factor in life, Christ’s existence, the Bibles authenticity, animals that defy physics and so forth. It’s amazing all of these unrelated mysteries coincide, pointing directly to the creator, but yet also leaves a gap to be filled with faith, by choice. Jen X, Ohio.","date":"2014-03-08","mins":"6:43 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"}],"resources":[{"id":"comment-192139","author":"jenx","post":"Terribly inadequate!.","date":"2015-03-01","mins":"10:45 pm","url":"https://shroudstory.com/2015/03/01/open-discussion-about-episode-one-examining-the-shroud-of-turin/","cat":"television","title":"Open Discussion About Finding Jesus, Episode One: Examining the Shroud of Turin"},{"id":"comment-192138","author":"jenx","post":"I was very disappointed with the time waisted on debunked theories such as the camera obscura. What’s the point? The general public has the right to accurate current findings..","date":"2015-03-01","mins":"10:43 pm","url":"https://shroudstory.com/2015/03/01/open-discussion-about-episode-one-examining-the-shroud-of-turin/","cat":"television","title":"Open Discussion About Finding Jesus, Episode One: Examining the Shroud of Turin"}]}
