{"events":[{"id":"comment-28907","author":"jesse","post":"It’s available here.. God Bless. Http://www.rai.tv/dl/replaytv/replaytv.html#ch=1&day=2013 03 30&v=196967&vd=2013 03 30&vc=1.","date":"2013-03-30","mins":"10:29 pm","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","title":"Awaiting Live Stream from RAI Uno"},{"id":"comment-17178","author":"jesse","post":"I think we all owe Dave Rolfe a big thank you for resurrecting BSTS. I am a bit confused, however. BSTS seems to have two home pages, one at Dave’s blog and another one at shroud.com. If I visit the BSTS home page at http://shroud.com/bstsmain.htm I see that the President and Patron is the Baroness Ryder of Warsaw and the Chairman is Rodney Hoare, Isn’t that a bit out of date?.","date":"2012-10-03","mins":"12:11 am","url":"https://shroudstory.com/2012/10/01/davor-aslanovski-to-attend-b-s-t-s-british-society-for-the-turin-shroud-meeting/","cat":"event","title":"Davor Aslanovski to attend B.S.T.S. (British Society for the Turin Shroud) Meeting"}],"history":[{"id":"comment-17936","author":"jesse","post":"According to an email I received from a friend, a gentleman named Francis De Stefano recently spoke to John Walsh and learned that Walsh “now considers the Shroud of Turin to be a medieval forgery”. Does anyone know if this is true?.","date":"2012-10-20","mins":"12:07 pm","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","title":"The Central Dilemma of the Shroud?"}],"image":[{"id":"comment-16442","author":"jesse","post":"Colin Berry said >>> I see there’s a proposal to put Rogers’ diffusion/Maillard hypothesis to a long overdue feasibility test. But the protocol is rigged, given that it intends to use glucose impregnated cloth. Yes, the Maillard reaction needs a source of reducing sugar. Not even Rogers had the brass neck to suggest glucose, the closest substitute being “starch fractions”. Reminder: starch itself is a polysaccharide, not a sugar, and only becomes reducing if extensively degraded chemically or enzymatically to small fragments with aldehyde functions. It was always hard to conceive of naturally degraded starch ever becoming a realistic source of reducing sugar. To substitute glucose is at best a cop out, or at worst a reprehensible sleight of hand unworthy of anyone who wishes to be taken seriously as a professional chemist..","date":"2012-09-18","mins":"5:27 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","title":"Latest on David Rolfe’s Site on Maillard Reaction"},{"id":"comment-16452","author":"jesse","post":"Time to go back to the drawing board..","date":"2012-09-18","mins":"7:19 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","title":"Latest on David Rolfe’s Site on Maillard Reaction"}],"misc":[{"id":"comment-18757","author":"jesse","post":"That elephant does not look like the man of the shroud. Just kidding. This is just plain nutty stuff. As I see it Michelangelo secretly included the images from those British crop circles. If Leonardo could use a time machine to photograph himself onto the shroud why not Michelangelo?.","date":"2012-11-03","mins":"7:19 am","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?"}]}
