{"art":[{"id":"comment-10041","author":"jlindsey","post":"I never post on these sites but feel that I should this time. I read heaven is for real in the spring of 2011. I must confess, although I am a Christian, I typically choose not to read these type of books, but felt drawn this this one. I honestly believe that Jesus drew me to this book to prepare for what was about to come. Not long after reading, my oldest started complaining of headaches and vomiting. We spent the summer going to numerous doctors who diagnosed him with sinus problems, server allergies, etc. Still his symptoms continued. Long story short, he was found to have a brain tumor and had surgery to remove it. The entire experience was and continues to be very traumatic. We were so blessed that the tumor was benign. One night while he was in the intensive care unit I was sitting at his bedside and physically felt Jesus presence with his hands on my shoulders and whispering to me that he loved me and to trust him. He is still teaching me to trust Him on a daily basis. My son has always been very reserved and a child of few words, but he had such a reassurance before his surgery that everything would be okay. About two months ago we decided to talk about this experience as a family because we realized that we had really not even begun to process. My younger son began to cry stating how scared he was. My husband asked our oldest son how he knew that everything was going to be okay. He replied that a week before his surgery, he had a “vision” and that the vision told him that he was going to have surgery, but he was going to live and that he would be better than before. Again, he is a child of few words and would not say much more. I plan on asking him more, but don’t want to push him or put ideas in his head. I am going to wait for the right opportunity..","date":"2012-04-07","mins":"12:40 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
