{"art":[{"author":"joe","post":"Jane,I had a near death experience on 7/24/2009, I broke me neck in a swimming accident and was in a comma for 6 days. When I awoke with my wife next to me I asked who the bearded man was, he told me he saved my life, she said their is no one here that has a beard. Two years went by and I read Heaven is for Real when I came accross Akiane’s portrait of Jesus I fell to my knees and began to cry. If I can only give you a fraction of the courage I have for dying it would change your life. In a weird way I’m looking forward to it…and I have a beautiful wife three children and just about everything I always dreamed of….For some reason God gave me this gift…be not afraid","date":"December 9, 2011 at 8:26 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"joe","post":"The revelation of all revelations : God love us so much (i.e. the whole world and not just the Christians) that he came to us in humility in a real human body just like the one we got!  UNBELIEVABLE!  In fact, the human God was so « ordinary » that most people never recognized him, even when he was in front of them!  To me, that’s the kind of God who deserve to be followed (not served as a servant, but followed) and, truly, here, we’re very far from the great circus displayed by the great religions of the world and especially the Catholic Church, with all its « royal » ceremonies (we will got a lot of this in Rome in the upcoming months with the ceremonies for the year of Mercy) and all that…  This kind of show is signed « human », not God.","date":"December 4, 2015 at 10:17 am","url":"https://shroudstory.com/2015/12/04/where-to-get-shroud-based-art-for-christmas/","cat":"art","title":"Where to Get Shroud-Based Art for Christmas"}],"dna":[{"author":"joe","post":"Short personal reflection: If Jesus would have been born from a virgin through a direct divine intervention, nobody in his own family (starting with his mother) would have been surprised to see him start to preach and performed miracles and all that…  However, that’s exactly the opposite that we see in the Gospels.  To me, this is very telling!","date":"December 8, 2015 at 3:30 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"author":"joe","post":"I dont understand the quesiton in the context of what I said in my short reflection.","date":"December 8, 2015 at 4:25 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"author":"joe","post":"That’s probably why she was so suprised that he was teaching the Jewish teachers in the Jerusalem Temple at 12 years old and that’s probably why Jesus’ whole family thought he had lost his head at one point!Note that in the part you refers, Mary never ask Jesus to perform a miracle.  She simply told him that they were out of wine…  A lot of interpretations are possible.  On the other hand, there are many quotes from different Gospels that show quite clearly that his own family was very surprised by what he was saying and doing, which do not fit with a virginal birth coming from a direct intervention of God…","date":"December 8, 2015 at 4:43 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"author":"joe","post":"If the new Christian communities would have really knew she was a virgin when she conceived Jesus, it’s evident that his own family would have know this also and it’s evident that Mary, Joseph and their other childs would never have been surprised to see him preach or perform miracle.  The fact that his own family didn’t understood his actions and speaches is very telling about this whole issue. The virginal birth is most probably an addition of Matthew and Luke to strengthen the faith of their new Christian communities.  There are a lot of things like that that were probably added because of the difficulty to believe in a Jewish Messiah that has been crucified (which is not at all what the Old Testament was thinking about the Messiah).  Most modern biblical scholars agree with me about that.  Again, that doesn’t mean Jesus was not the real Messiah.  That simply indicates that the new Christian communities of the First Century wanted desperately to back-up their claim about Jesus…  It’s pure human nature.Concerning the miracle of Cana, many scholars even think that the whole story is not historical at all and it is much more a made-up story to teach the community to always have faith and confidence in Christ.Personaly, I have no problem believing that the heart of this story is historic, but the details concerning the faith and confidence of Mary versus Jesus that we found in the story can well be an addition to help a teaching about faith and confidence in Christ.","date":"December 9, 2015 at 9:36 am","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"author":"joe","post":"I think the question I asked before will also fits nicely here:Would it be the end of the world for you and your faith if Jesus would have been conceived like anybody else (i.e. through a normal sexual encounter between his mother and his father)?For me, not at all…  This question of the virgin conception of Jesus has nothing to do with the heart of my faith.","date":"December 9, 2015 at 11:39 am","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"author":"joe","post":"Jesus can well have been both human and divine while having been conceived like you and me. This was only a problem for many men of Antiquity who thought the whole nature of a person was coming from the sperm of the father… I’m pretty sure that was one of the primary reason this whole virgin birth story was invented, along with a desire to strengthen the faith in Jesus as the real Messiah.","date":"December 9, 2015 at 9:40 am","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"author":"joe","post":"AMEN!  I would underline the word “ALL”.  That really means ALL.  Because God is love and nothing else, no one is excluded.  To me, that’s the profound meaning of Jesus’ Passion, death and resurrection. This is really what deserve to be call “a good news”!","date":"December 9, 2015 at 1:03 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"author":"joe","post":"And what if she was, IN REALITY, referring to her spiritual virginity, which is the one we will ALL got when we’ll enter in Heaven?  If we want to get closer to the truth, I think we must always try to see things beyond the very closed spectrum of our material space-time universe…","date":"December 9, 2015 at 11:35 am","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"author":"joe","post":"There are a lot of miraculous birth stories in antiquity, but there is only one story of a crucified Jewish Messiah coming back to life.  That’s one good reason to put more faith in the resurrection account versus the virginal birth account.  And the heart of Christian faith is not the virginal birth but the resurrection of Christ.  That’s what really matters.  I don’t need Mary to be saved. I need the mercy of God.","date":"December 9, 2015 at 4:40 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"author":"joe","post":"Quote: “To an Atheist, what Luke (and indeed Matthew) wrote about the virgin birth is part of the fabric of what must be a much bigger fictional account.”And to a lot of modern and very serious biblical scholars, these accounts are probably not historical and come from a desire to back-up the claim of Jesus being the real Messiah with some Messianic prophecies of the Ancient Testament…  Knowing full well that the New Testament books are not what we can consider modern historical biographies (their main goal was much more to strengthen the faith of the new and fragile Christian communities and maybe to get others to embrace Christian faith), I tend to agree with this vision.For many scholars, the only sure thing we can say about Jesus origin and “hidden” years is that he probably lives a normal Jewish life in Nazareth in Galilea and that’s all.  Many of them even think that this is the place where he was born…All this doesn’t mean Jesus was not the Messiah and this surely not mean that everything we found in the New Testament is totally fictional, but I think it’s a very dangerous thing to take everything there as 100% historical…","date":"December 8, 2015 at 10:46 am","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"author":"joe","post":"I will do a little Jesus of myself by answering with another question! :-)Would it be the end of the world for you and your faith if Jesus would have been conceived like anybody else (i.e. through a normal sexual encounter between his mother and his father)?For me, not at all…","date":"December 8, 2015 at 3:40 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"author":"joe","post":"Sorry to hear this…  What is the heart of our Christian faith?  That God is love and that there’s a spiritual life for everyone after death.  Whether Mary was virgin or not when she conceived Jesus shouldn’t affect this great truth!","date":"December 9, 2015 at 11:38 am","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"author":"joe","post":"In order to help your faith, here’s an advice for you :  Simply look at Paul’s faith!  Like me, the question of the virginal birth of Jesus had nothing to do with the heart of his faith, as he never talks about that in his letters!  The heart of his faith was centered on the greatness of the free love of God for us and his infinite mercy. As Einstein would say : for Paul, the rest were unimportant details!","date":"December 9, 2015 at 11:47 am","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"}],"history":[{"author":"joe","post":"The Mandylion never was considered as a relic of the passion…  The Mandylion and the Shroud were 2 separate objects.  But here, people want to see both cloths as the same objects, nevermind the tons of evidence against such a wrong hypothesis.","date":"December 3, 2015 at 1:03 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"author":"joe","post":"Personaly, I don’t think the Shroud ever got to Paris, because if it would have reached the capital in the hands of one of the king of France during the 13th or 14th Century, we would have clear textual mentions of the arrival of such a great relic in Paris, just like we got clear textual mentions of the arrival of the crown of thorns in Paris in the hands of Saint Louis in August, 1239…","date":"December 2, 2015 at 10:52 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"author":"joe","post":"For me (and most historians), yes.  But this was a different relic than the Shroud.  It wasn’t a relic of the passion and that’s probably why the crown of thorns was considered by Saint Louis as having much more value.","date":"December 3, 2015 at 10:36 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"author":"joe","post":"When I wrote “never was considered a relic of the passion”, I talked about the time the Mandylion was kept in Constantinople.If you base your judgment about this issue on one single text, while discarding all the other evidences against the idea that the Mandylion was a burial cloth, that’s no good.  Also, the fact that the person who wrote the description you mention never talked specifically about bloodstains being present on the face open the door to a lot of interpretations…","date":"December 3, 2015 at 1:07 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"author":"joe","post":"Another important factor to consider concerning Mr. Latendresse claim, is this : If Geoffroy de Charny would have got the Shroud from the king of France, we would certainly have a lot of textual mentions of such a royal transfer, which is simply not the case!  If the relic would have come from the king himself, Geoffroy would certainly have use this fact to legitimate the exhibitions of the Shroud he did in his new chapel… Most historians agree about the fact that, on the contrary, Geoffroy (or his relatives) did not wanted to let anyone know where and when he got this relic.","date":"December 2, 2015 at 11:08 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"author":"joe","post":"At the time the Crusaders were surrounding the city, I think it’s fair to say that the Shroud of Christ was the most precious relic.  At that point in time, it was probably bigger in importance versus the Mandylion.  And if that Shroud would have been transferred by Saint Louis to Paris with the Crown of Thorns, it would have made at the very least the same big noise, which is not the case…  People can ask: Then why the Mandylion did not also make a big noise at that time? The most probable answer is it is because this relic was not a relic of the Passion (which is easy to conclude when you look at the most ancient depictions of the Mandylion), on the contrary to the Crown of Thorns, which indicates the superiority of relics associated directly to the Passion of Christ for that place (Europe) and that time (beginning of the 13th Century) versus all the other relics, including the Mandylion.","date":"December 2, 2015 at 1:23 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"author":"joe","post":"Most historians who studied this issue agree that a Mandylion was part of the Golden Bull of Baudouin II, which described all the relics he sold to Saint Louis. Of course, the description is not 100% clear about that, but most historians (I’m not talking about Shroud researchers like you, Wilson or others) reached that conclusion.","date":"December 3, 2015 at 3:35 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"author":"joe","post":"Considering the historical context, I firmly believe that Geoffroy de Charny got the Shroud in secret, very quietly, which can indicates that he got it without the king of France or any other important people from the French court being involved.","date":"December 2, 2015 at 1:27 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"author":"joe","post":"People should note that, from the moment Geoffroy got the Shroud, its authenticity was always questioned, which is enough to understand that the king of France had nothing to do with the arrival of the Shroud in Lirey…","date":"December 2, 2015 at 1:31 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"author":"joe","post":"Also, people should understand that it’s not what happened for relics like the Crown of Thorns, for the good reason it has been transferred to Paris directly by the king of France himself… So, if Geoffroy would have got the Shroud from the king, its authenticity would not have been questioned in the manner it has been.","date":"December 2, 2015 at 1:34 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"author":"joe","post":"Quote: “The statement about Philippe VI giving the Shroud to Geoffroy de Charny is from a manuscript written by a cleric of the collegiate of Lirey around 1525.”This is 200 years after the events!  Even if the authenticity of the manuscript in which we can find such a claim is valid, no way you can claim that this is absolute truth! The simple FACT that the authenticity of Shroud displayed by Geoffroy was questioned from the beginning and always was afterward is enough to understand that he did not got it from the king of France.  Or else, that question of authenticity would never have been raised, especially by some French bishop…","date":"December 3, 2015 at 9:32 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"author":"joe","post":"If the Shroud would have been transferred from Constantinople to Paris with all the other relics Saint Louis got from Baudouin II, then, in all logic, this would have been this relic that would have been presented by the king as the most precious of all instead of the crown of thorns.  The fact that, historically, it was the crown of thorns indicates that there was most probably no burial cloth with a body imprint of Jesus in that batch of relics…  Here, we must remember that, based on the account of Robert de Clari, the most precious relic in Constantinople at the time of the 4th crusade was, without a doubt, this burial cloth of Jesus and not the crown of thorns.  Effectively, Robert de Clari was clear about the fact that this was THE relic that was exposed each week in Constantinople and not any other relics related with Jesus…If the Shroud was really in the hands of Philippe VI at one point (this is far from being proven), it is more likely that such a precious relic would have reached Paris at another time and through a different path.","date":"December 2, 2015 at 10:43 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"author":"joe","post":"The simple fact that the authenticity of Geoffroy’s Shroud was questioned from the start is enough to understand that, most probably, he did not got it through an official way…  And the fact that no one seemed to have a clue about it’s previous journey before its arrival in Lirey is another good clue that back-up my conclusion.  The silence of Geoffroy and his family about that is also another good clue.  Note that no one in his family ever mention a clear history of this Shroud before it felt in Geoffroy’s hands…","date":"December 3, 2015 at 9:38 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"author":"joe","post":"We don’t have the same ideas on the subject matter.  Who cares?  You’re not an historian and I prefer by far to base my opinion on the pros who studied that subject.No big deal.  I don’t think we need to keep on this useless debate.God bless you!","date":"December 4, 2015 at 1:06 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"author":"joe","post":"One last comment:  When it comes to the “Mandylion was the Shroud” hypothesis (far from being a proven theory btw), people have to make a lot of wild assumptions, which is (every serious historian will tell you this) not the proper way to build historical scenarios…","date":"December 6, 2015 at 7:08 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"author":"joe","post":"Quote: “Saint-Quentin (around 1245) describes it as “a board that touched the face of the Lord, when he was laid down from the cross”.”Do you know that, in Constantinople and in some ancient version of the Abgar legend, there were 2 relics related to the Mandylion, i.e. the Mandylion itself and a tile that was showing the same image of the face of the living Christ, which is maybe what Saint-Quentin was talking about…A lot of different interpretations are possible regarding the few references given by Mr. Latendresse and we should remain very prudent before coming to a conclusion that we can consider as “solid”.One thing’s for sure, if the Mandylion really got to Paris and would have been in fact the Shroud of Turin folded in 8, we would have some testimonies that would talks about this relic as being a real burial shroud, which we don’t have.  Here, we must remember that it is a fact that, before he bought the batch of relics from Baudouin II (who was a relative), Saint Louis sent some people in Constantinople to watch closely these relics in order to make sure they were all “genuine”.  You can be sure that if the Mandylion would have been the Shroud folded in 8, these people would have note it and the bull of Baudouin II would have talked about a shroud of Christ, which is not the case.  It’s also obvious that this particular relic would have been presented by Saint Louis to the crowd as the main relic of the batch (maybe along the crown of thorns), which is not what happened.  It’s also obvious that if Geoffroy de Charny would have got the Shroud from king Philippe VI as an official gift for his precious service, we would have clear and official texts referring to this, which is not the case, and the authenticity of Geoffroy’s shroud would never have been questioned the way it has been since the day he placed it on public display (and especially not questioned by the French clergy the way it has been). Finally, if that would have been the way Geoffroy would have got the Shroud, he and his family would have been proud to claim it high and loud to everyone, because this kind of royal gift would have legitimate his relic and the public exhibitions he did with it and it would also have add some prestige to it, which, once again, is not at all what happened historically.For all these reasons (and many more), most historians do not believe the Shroud ever got to Paris in the hands of Saint Louis (whether this would have been under the name “Mandylion” or not) and they do not believe Geoffroy de Charny got it as a royal gift from a king of France, whether it would be Philippe VI or someone else.I think the testimony of Robert de Clari is very important here.  If people don’t rely on special assumption (like Latendresse did), de Clari’s testimony show two important facts in that puzzling mystery:  1- the Shroud was a different relic than the Mandylion (and also the tile, which he described along with the Mandylion) and 2 – on the contrary to the Mandylion and the tile, the Shroud disappeared during the sack of Constantinople in April 1204.Now, how this “stolen” shroud got in the hands of Geoffroy de Charni? This question remain to be solve, but the fact that the authenticity of his Shroud was highly questioned from the start and the fact that nor Geoffroy nor his family dared to clearly mention when and how he got it clearly indicates that this was a family secret, which can lead us to believe that he got it through a very questionable path (which is very different than Latendresse’s hypothesis).","date":"December 6, 2015 at 6:55 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"author":"joe","post":"This is a proven fact Dave that can help us see more clearly:  Between the 10th and the beginning of the 13th Century, many lists of relics were made in Constantinople and NONE of these lists (including the testimony of Robert de Clari) considered the Mandylion as being a relic of the passion of Christ, while many of these lists (including the testimony of Robert de Clari) talks about a shroud of Christ as being a separate relic. Again, if we don’t rely on special assumptions, we’re lead to, at the very least, conclude that, at the same time and in the same place, there were 2 very different relics, i.e. a shroud of Christ associated to the Passion and a Mandylion that was not associated to the Passion.","date":"December 6, 2015 at 7:49 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"author":"joe","post":"And if the Shroud would have been among the batch of relics Saint Louis got from Baudouin II, we would have clear textual mentions of such a transfer, just like we got clear textual mentions of the transfer of the crown of thorns.  Because there’s no such thing, we must conclude that, most probably, the Shroud Robert de Clari saw in Constantinople was not among the relics of Saint Louis…","date":"December 2, 2015 at 11:35 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"author":"joe","post":"Quote: “It was the public processional display of a relic that marked its importance…”EXACTLY!  Taking this as a fact, then we MUST conclude that, during the time of the 4th Crusade, the Shroud of Christ was truly among the most precious relics of the city, because it was put on public display EACH FRIDAY!  As I know, this is a unique case for a relic of Christ during that time of turmoil in Constantinople and that, alone, is enough to prove the great importance it got in the eyes of the Emperor…","date":"December 2, 2015 at 11:33 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"author":"joe","post":"Charles wrote: “Just because de Clari saw what appears to have been a single, not a double, image does not make it important.”What makes it important is the FACT that, during the time the crusaders were surrounding the city, this was this particular relic (and not something else) that was displayed each friday…  This is the reason why this relic, at that particular point in time, had reached a very particular and, no doubt, a very important status for the city and the imperial court.  Note that Robert de Clari talked also about the Mandylion, which was kept elsewhere in the city and which was, at that time, not placed in public display, on the contrary to the Shroud…Last thing: A shroud of Christ is often mention in lists of relics from Constantinople.  The fact that none of these lists mentioned an image on it doesn’t prove that this was a different shoud than the one Robert de Clari saw in public display.  We can think that, if none of these lists talked about an image, it can well be due to the simple fact that the pilgrims only saw the reliquary and not the actual cloth.  And since we must wait for the testimony of de Clari to see the mention of an image, we can think that, prior to the 4th Crusade, the body image on that Shroud never was placed in public display.  Also, based on the testimony of de Clari alone, I don’t think we can reach a solid conclusion on whether there was a single or a double body image on this particular cloth.","date":"December 3, 2015 at 10:44 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"}],"misc":[{"author":"joe","post":"Simply because it’s impossible to place a nearly 6 foot tall man inside a 14 feet long shroud in a small place like a niche carved into a wall inside an ancient Jewish rock tomb.  That doesn’t make sense at all.  The body must have been « prepared » elsewhere before being placed in his final resting place.  This manual transfer must have caused some minor changes in the intial Shroud configuration.  Note 1: when I say « prepared », that doesn’t mean the body was oint with burial spices or things like that.  I think the only « preparation » that we know for sure is that it was placed inside the cloth with great care (because there is no smudges of blood on the cloth). Note 2: My conclusion that there was probably a small change in the initial configuration of the cloth is very different than Jackson’s assumption.","date":"November 17, 2015 at 2:18 pm","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"author":"joe","post":"If we conclude the Shroud is a genuine burial cloth of a real Jew, then we must assume that the Shroud man wasn’t placed inside the Shroud in his final resting place, which was most likely a stone bench carved inside one of the tomb walls.  His body must have been placed and covered by the Shroud in some other place (a place with much more space to do this job).  Such a place could well have been the central room of the tomb or, this is possible, in the open air outside the tomb.If this probable scenario is truly correct (taking into account the normal configuration of Jewish tombs, it is the most logical), then we must conclude that the enveloped body of the Shroud man must have been transferred from this initial place where he was placed inside the Shroud to his final resting place inside the tomb (most likely on a small stone bench carved in a wall).In that case, it’s logical to assume that many bloodstains were already formed before the enveloped body was placed in his final resting place.  It is also logical to assume that, because of this body transfer (manual transfer) from one place to another, some changes (minor or major, it’s difficult to conclude) in the Shroud configuration must have occurred before the start of the image formation, which can easily and logically explain some discrepancies between the body image and some bloodstains (like, for example, the presence of some scourge marks behind the knees in the dorsal image, in a place where there’s absolutely no body image or the presence of a bloodstain outside the frontal body image, in the area of the right elbow).In that context, Latendresse assumption that there have been absolutely no change in the Shroud configuration is most likely false (especially when you keep in mind that the body was most probably placed inside the Shroud in a different place than his final resting place inside the tomb).  I must also add that this conclusion of mine doesn’t go against his other assumption (which I believe is right) that there have been no important flattening of the Shroud before the start of the image formation.  On that subject, I think Jackson’s assumption is false.","date":"November 17, 2015 at 1:17 pm","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"author":"joe","post":"Here’s a typical rock bench carved in one of the walls of an ancient Jewish rock tomb : http://www.hadashot-esi.org.il/Images//5485-7.jpgIt’s not serious to believe the Shroud man could have been enveloped inside the Shroud in such a small niche.  In all logic, his body must have been placed inside the cloth elsewhere (most probably near the niche or near the tomb) and then manually transferred to its final resting place, which was most probably that kind of small niche inside a wall.In all logic, such a manual transfer (even if it was probably short) must have created some changes (probably small) in the initial configuration of the cloth, which can explain the few discrepancies that exist between the body image and the bloodstains.","date":"November 17, 2015 at 2:50 pm","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"author":"joe","post":"Following my last comment, I would use the words of the late Ray Rogers: No need for a miracle here!","date":"November 17, 2015 at 3:01 pm","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"author":"joe","post":"One small addition :  Because there are not a lot of discrepancies between the body image and the bloodstains, this lead me to believe that the change in the Shroud configuration that most probably occured during the transfer of the enveloped body must have been quite minor in general.  The only question I left open is if there were some small parts of the cloth’s configuration that changed more drastically between the time the Shroud man’s body was initially placed in the cloth and the start of the image formation…  Hard to say for sure.","date":"November 17, 2015 at 1:24 pm","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"author":"joe","post":"It’s probably to early to talk about that, but I will anyway.  Simply, I would like to help people push their reflection a bit further…Even if it’s natural and very okay to pray for the victims, is there one single Christian who will remember those words of Christ and put them in practice?: “But I tell you, love your enemies and pray for those who persecute you, that you may be children of your Father in heaven. He causes his sun to rise on the evil and the good, and sends rain on the righteous and the unrighteous.” (Matthew 5:44-45)And what if it would not be by praying for these sick people (so that they could see the light and get out of their darkness) that something could finally change in this sick world?These words of Christ tell us who God really is and, obviously, he’s very different than us, because he loves and saves everyone of his children, even those who seems, for us, to be definately lost.When you read “scandalous” words like the ones I gave you, it’s not surprising that Jesus got killed by his Jewish brothers…  God is very different than us.  God is love and we all are sinners…","date":"November 16, 2015 at 1:34 pm","url":"https://shroudstory.com/2015/11/14/paris/","cat":"news_&_views","title":"Paris"},{"author":"joe","post":"Ask any serious historian that has no book about the Shroud to sell what he thinks of Wilson…  Most of them do not accept at all his point of view about the Shroud…  They know that most of his hypotheses are mainly based on assumptions and speculations, which is not a way to do history that is accepted by them.","date":"December 7, 2015 at 2:09 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"author":"joe","post":"I think that it is stated in the “Narratio de Imagine Edessena” that this relic was displayed once a year for a certain feast (I don’t remember the name of the feast)…  It’s evident that if this is an historical fact and that this relic was in fact the Shroud, people in Constantinople would have easily noticed the bloodstains in the face area of the cloth and would have understand that this was a relic of the passion!  People of this time and place were not dumb!  In that context, since every lists of relics made in Constantinople never placed the Mandylion under the tag “relic of the passion” (on the contrary to many other relics, including a shroud of Christ), we’re lead to conclude that this relic was exactly what it was reported to be, i.e. a small towel showing only the face of the living Christ, which would have been miraculously imprinted there after Jesus would have washed his face with water.","date":"December 9, 2015 at 10:36 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"author":"joe","post":"Any public display of a holy relic is showing just that: a holy relic!  Not just the reliquary…","date":"December 10, 2015 at 1:02 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"author":"joe","post":"It’s not because people were not allowed to check the relic with a microscope that they wouldn’t have been able to note the bloodstains if the Mandylion would have been the Shroud. We must remember that these particular stains are the things that are the most easy to see on the Shroud and even at a pretty good distance.","date":"December 10, 2015 at 10:14 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"author":"joe","post":"Thinking that during a public display of an holy relic, the Church was only showing the reliquary and not the relic is completely ludicrous and show quite clearly the important bias of Mr. Latendresse about this whole issue.Fortunately, that’s not at all how real serious historian are working!","date":"December 10, 2015 at 9:46 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"}],"sudarium":[{"author":"joe","post":"I think that, for both the Shroud and the Sudarium, the only way we could scientifically get to the conclusion that there’s a solid probability for authenticity or for fake is not through historical researches (even if such researches are important), but through a new series of C14 dating done more properly this time (and maybe supported by another dating technique that would be recognized by most of the scientific community as accurate, if such a technique exists).Until that time, speculations and ad nauseam debates between pros and cons will continue without any real tangible results…","date":"November 30, 2015 at 10:49 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"author":"joe","post":"That’s a very good point raised by David Mo.  I have a tendency to think the same and that explain why I’m much more skeptical about the probability of the Sudarium to be genuine.  People should remember that, on the contrary to the Shroud radiocarbon dating and Raymond Rogers’ Thermochemica Acta’s paper, we don’t have any solid facts or data published in the scientific literature that can seriously explain why the 2 radiocarbon dating of the Sudarium should be considered inaccurate…  And we must remember that the 2 radiocarbon dating of the Sudarium are close to match the first known appearance of the relic in Spain.","date":"December 4, 2015 at 1:56 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"author":"joe","post":"I would rather say “Contamination CAN BE a big problem…”  In the case of the Sudarium, there’s nothing in the scientific literature that can back-up the idea that some contamination could have changed the dating results, which are still quite far from the 1st Century A.D.","date":"December 4, 2015 at 2:18 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"author":"joe","post":"Quote: “That is because they have learnt about developments in science, which seem to clash with what the Bible tells us.”I think these Christians should start to reconsider the whole idea (which is wrong in my mind) of the Bible being the “word of God”… In fact, I believe it is much more the “word of some men from Antiquity about God”, which explain the discrepancies between some claims, data and events found in that book and the discoveries of science. Jesus didn’t wrote one word of the Bible.  No more for his Father…  I don’t say that some of the things we find in the Bible are not inspired by the Holy Spirit, but there’s a big gap between a word inspired by God (which can be “translated” more or less accurately) and the exact word of God…","date":"December 4, 2015 at 2:07 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"}]}
