{"events":[{"id":"comment-6650","author":"joe_bonnette","post":"I would like to contact Tom D’Muhala and ask a question about some shroud photos which Vernon Miller made. Please contact me by calling or texting on 612 224 4696 or injehovahsimage@yahoo.com — Joe Bonnette.","date":"2012-01-07","mins":"4:06 pm","url":"https://shroudstory.com/2011/09/22/tom-dmuhala-to-talk-on-the-shroud-of-turin-in-cary-north-carolina/","cat":"event","title":"Tom D’Muhala to Talk on the Shroud of Turin in Cary North Carolina"}],"dating":[{"id":"comment-10336","author":"joe_bonnette","post":"The shroud images were made by God literally “painting them on” like an artist painting a picture. This happened in a moment SHORTER THAN WE CAN MEASURE, and it has such images on the shroud as Michael the angel on the neck, the glorified Jesus on the chest, God’s image over the crown of thorns, satan’s face on the end of the pig tail shaped hair cut, and his face again in the lake of fire but all melted and deformed and smoking and flaming in the intense heat, located on the lower back. There is also 2 drum stick match stick or timpani beater like objects over the heart of Jesus, shaped in a pattern between a “V” and “X.” So if you can give me something for telling you, or at least buy the photos mentioned below, and we can arrange a secure method to make sure we do not get “ripped off.” I am completely trustworthy but that may not make you convinced just because I “say so.” My website is usaprayermission.com and I comment more about this on there too. — The shroud was more than likely in my opinion as record claims, boiled in oil and burned and washed and steamed throughout the centuries without so much as a slight fading or removal of the image. I totally believe God has and will eternally protect and preserve this image… (Edited to remove commercial message. ).","date":"2012-04-13","mins":"9:33 am","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins"}],"art":[{"id":"comment-7779","author":"joe_bonnette","post":"I have actual clear images made by Vernon Miller for sale. If you are interested, email injehovahsimage@yahoo.com I need a reply right away. This is now 1/31/12, so please email me if you want to buy them. They are unpublished originals. Thanks,.","date":"2012-01-31","mins":"2:57 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
