{"blood":[{"author":"john_k_m","post":"I haven’t been following the shroud posts recently but I see that Colin Berry still has an axe to grind concerning the authenticity of the shroud.And I see also that he’s been shot down…again.\n\n","date":"July 19, 2012 at 8:27 am","url":"https://shroudstory.com/2012/07/19/yes-blood-on-the-shroud-really-could-be-really-old/","cat":"blood_studies","title":"Yes, Blood on the Shroud Really Could Be Really Old"}],"opinion":[{"author":"john_k_m","post":"I agree with Daveb’s assessment…the father of lies is a “master” of his craft… the art of deception.\nI had first become aware of the shroud about 40 years ago when I read about a doctor who had done partcular experiments and tests,and explained the nail hole markings on the wrist and the absense of the thumb marks.So much more information is available now which would have been impossible to gather back then.\nBut I must admit that I was not seeking to strengthen or confirm my faith or convictions because they were already pretty deep at the time.It has been sorely tested since,but like a spike,the harder it was hit,the deeper it went.\nThe shroud of Turin,I am totally convinced,is real.It has survived all of these years by the will and providence of God for future generations…it is the next best thing for those who would not be present when he said”Blessed are those who have not seen…yet still believe”.\nI wrote several months ago on this site explaining how I came to believe so strongly in Christ.I was on what I considered at the time my deathbed…I literally thought I ws going to die and was so sapped of strength that it should not have been surprising if I did.But instead,as I lay there crying out for a second chance or go at it (life)my heart first instantly vibrated and I was immediately drawn into a half sitting up position as a light not unlike that of St. Paul’s experience radiated and blasted upon me.It lasted for the time it took me to say “My God it’s true…your really there…you really care…it’s really true”It went out and I fell back onto my bed and pillow as the door opened.\nTherefore I have absolutely no difficulty visualizing what happened in the tomb 3 days after his death…what I experienced was a spark…but for the image of Christ to have been left on both sides of the shroud as it had been,I can see a light brighter than the sun and whiter than lightening bursting and radiating from within His body and outwards.Unlike Paul on his way to Damascus or myself on my deathbed…when the light flahed upon and around us.(I had not known of St. Paul or his experience prior to my own)\nTo date I feel I have not done enough to “witness” to my faith over the years…I’ve lived it yes,and suffered to keep it in tact yes,but I’ve never been in a position where I could actually share on a regular basis that awesome miracle ,on that awesome day.I do believe though,that up to this time I have been made even more ready to do so.Therefore I would ask my brothers and sisters in the Christ to keep me in their prayers,so that His purpose be more fully realized in my life …before that great day of accountability when He will ask me “Where are the others” ? GOD BLESS.\n\n","date":"July 29, 2012 at 12:14 pm","url":"https://shroudstory.com/2012/07/29/why-you-should-not-trust-what-you-read-in-blogs/","cat":"other_blogs","title":"Why you should not trust what you read in blogs"}],"researchers":[{"author":"john_k_m","post":"Oh wow!!! Eureka!!! How deep!!! I mean how deep your head must be in the sand…that carbon testing has long ago been debunked.Why do people keep referring to the 1988 carbon testing results when even those (scientist and experts) who initially believed the results were accurate as well have done a complete 360 on it.\nI can only surmise that there are perhaps those who may be “afraid” that it is the actual burial cloth of Christ.So the bigger question might be.”Why” are people afraid of the Shroud of Turin ?\n\n","date":"July 2, 2012 at 9:38 am","url":"https://shroudstory.com/2012/07/02/this-is-really-just-a-lead-in-to-quoting-the-daily-mail-on-lombatti/","cat":"news_&_views","title":"This is really just a lead in to quoting the Daily Mail on Lombatti"}]}
