{"art":[{"id":"comment-160425","author":"john_green","post":"Well I agree. If I had a NBE and was looking down on my body the last thing I would be looking for is a sign. I would be flying around the hospital looking for more doctors!.","date":"2014-10-08","mins":"11:53 am","url":"https://shroudstory.com/2014/04/21/heaven-is-for-real-the-akiane-prince-of-peace-the-isa-mosaic-and-the-shroud-of-turin/","cat":"akiane_kramarik","title":"Heaven is for Real, the Akiane Prince of Peace, the ISA Mosaic and the Shroud of Turin"},{"id":"comment-160403","author":"john_green","post":"Dr. Parnia has written 2 books on this subject. In his second and latest book, “Erasing Death: The Science That Is Rewriting the Boundaries Between Life and Death” includes an update on his AWARE study, but I found nothing new in it as far as this study goes. Some people claim that during this NDE they float above their bodys and look down and see what the doctors are doing. And one of the things they have done in the four year study is place signs high up so the only way you can see them if is that you are floating up above. So far there is no claim that someone has reported seeing them. There are a lot of problems with the claim that people have seen the afterlife. Some people see Jesus, or whatever god they believe in, some see friends that are still alive and sometimes kid meet a man in a red suit (maybe Santa).Many people see Jesus and Jesus allows them to Judge themself rather than have God do it as in the Bible. After all the book I’ve read on this on this subject I now believe it’s something that’s is created in the mind but I’ll await the final release of the study(which we been promised for years) before I make up my mind. PS Some Christains believe that this is the work of the Devil (Well, NDE’s not my post) because some bad people go to heaven and sometimes good people go to hell..","date":"2014-10-08","mins":"9:43 am","url":"https://shroudstory.com/2014/04/21/heaven-is-for-real-the-akiane-prince-of-peace-the-isa-mosaic-and-the-shroud-of-turin/","cat":"akiane_kramarik","title":"Heaven is for Real, the Akiane Prince of Peace, the ISA Mosaic and the Shroud of Turin"},{"id":"comment-160452","author":"john_green","post":"It may get in the way of them trying to bring the person back and they wanted it was no one else could see it and tell him what the sign said I guess. I think when the person go code blue it’s quick and they would not have the time to run around looking for a sign..","date":"2014-10-08","mins":"2:09 pm","url":"https://shroudstory.com/2014/04/21/heaven-is-for-real-the-akiane-prince-of-peace-the-isa-mosaic-and-the-shroud-of-turin/","cat":"akiane_kramarik","title":"Heaven is for Real, the Akiane Prince of Peace, the ISA Mosaic and the Shroud of Turin"},{"id":"comment-197842","author":"john_green","post":"Hey, cool. I learned to paint watching Bob Ross. Want a picture of a mountain or a tree, I’m your guy. Need a painting of a person, well I’m almost as good as the kids in my granddaugther’s kindergarten class..","date":"2015-04-28","mins":"9:12 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","title":"Having Nightmares"},{"id":"comment-192408","author":"john_green","post":"Charles Here’s a picture of a dress that’s all over the internet. Some say they see gold and white( that’s what I see) others look at the same photo and see the dress as Black and blue. Http://mashable.com/2015/02/26/what color dress blue black white gold/.","date":"2015-03-04","mins":"12:48 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192774","author":"john_green","post":"This is getting very very strange..","date":"2015-03-08","mins":"6:51 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-193102","author":"john_green","post":"Sounds like that fits believers too..","date":"2015-03-11","mins":"3:23 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-189389","author":"john_green","post":"MAX, PLEASE stop posting one or two line post every few minutes. Sit down think it all out and put it in one post! PLASEEEEE.","date":"2015-02-05","mins":"11:34 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-191783","author":"john_green","post":"Hugh Your view would agree with the bible, but I think I see another problem. I seem to recall that they did some test or something where they found that if the nails were through the hands would not support the body. What’s you opinion on that?.","date":"2015-02-25","mins":"4:35 am","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"}],"blood":[{"id":"comment-214201","author":"john_green","post":"If he could walk through walls why would the be a need to move the stone?.","date":"2015-11-04","mins":"11:48 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-214202","author":"john_green","post":"The=there, damn K mart keyboard.","date":"2015-11-04","mins":"11:49 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-214207","author":"john_green","post":"The the angels moved the stone, but why would angels need to move the stone? “And, behold, there was a great earthquake: for the angel of the Lord descended from heaven, and came and rolled back the stone from the door, and sat upon it.” Well this is way off topic so I’ll drop it..","date":"2015-11-04","mins":"2:02 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-214208","author":"john_green","post":"PS I’ll buy that the earthquake moved the stone. Makes sense to me..","date":"2015-11-04","mins":"2:09 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-209590","author":"john_green","post":"Louis Hindus and others in Eastern beliefs think highly of what Jesus said. Swami Prabhavananda wrote a book on it, “The Sermon on the Mount According to Vedanta.” Paul Brunton in his book, “The Short Path to Enlightmenment” quotes the bible often. Many ideas in the eastern beliefs are also in Christian beliefs, love, forgiveness, etc. As you know Hindus believe everyone one is part of the divine. One of the verses in the NT that always interested me is, “The kingdom of God is within you.” For the past 30 years I wondered what exactly is the writer trying to tell me. After starting to study Eastern beliefs a few years ago I believes it means we all are part of the divine. In fact for the only way the bible makes any sense to me is when I look at it with the mind of a Mystic, but that’s beyond the scope of this blog..","date":"2015-09-04","mins":"10:48 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209135","author":"john_green","post":"In reading Fr. Richard Rohr, ” The Naked Now” I find he writes that St. Francis, “told us friars that if we found a page of the Koran, we should kiss it and place it on the altar.” I could not find that direct quote but I found this by Pope Francis, “Jesus Christ, Jehovah, Allah. These are all names employed to describe an entity that is distinctly the same across the world. For centuries, blood has been needlessly shed because of the desire to segregate our faiths. This, however, should be the very concept which unites us as people, as nations, and as a world bound by faith. Together, we can bring about an unprecedented age of peace, all we need to achieve such a state is respect each others beliefs, for we are all children of God regardless of the name we choose to address him by. We can accomplish miraculous things in the world by merging our faiths, and the time for such a movement is now. No longer shall we slaughter our neighbors over differences in reference to their God.” I also find that many of the things that are taught in Eastern beliefs are the same as what is taught in the Bible..","date":"2015-08-27","mins":"1:05 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209144","author":"john_green","post":"Found it here John http://nationalreport.net/pope francis followers koran holy bible/.","date":"2015-08-27","mins":"2:42 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209147","author":"john_green","post":"Don’t know Hugh, but Fr. Richard Rohr did write in his book(pg 53), ” The Naked Now” that St. Francis, “told us friars that if we found a page of the Koran, we should kiss it and place it on the altar.”. As I wrote I was looking for what was behind what Fr. Richard Rohr wrote. I noticed in a footnote Rohr gives Kathleen Warren, “Daring to cross the Threshold” (Rochester, Minn.:Sisters of St. Francis,2003)..","date":"2015-08-27","mins":"3:04 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209155","author":"john_green","post":"Thanks Louis. Yeah, Fr. Rohr tends to put things in his own words and that’s why I was looking for a direct quote. Fr. Rohr is a Mystic and believe in nondualism, that’s why his books interest me..","date":"2015-08-27","mins":"3:48 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209303","author":"john_green","post":"This reminds me of a book I read in the 60’s, the “Pastover Plot.” Oh, and there were other books I read in the 60’s which claimed Jesus was a spaceman. I guess we’ll go there next..","date":"2015-08-30","mins":"8:12 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-212359","author":"john_green","post":"Noah? There is no evidence of Noah, an Ark, or a world flood. Http://www.pbs.org/wgbh/nova/ancient/secrets noahs ark.html Program Description In 1948, a British pilot serving in Iraq acquired a clay tablet with an intriguing, 3,700 year old inscription. The ancient writing tells the story of how the god Enki warns a Sumerian king named Atra Hasis of a future flood that will destroy mankind; Enki gives him instructions for building a boat to save his family and livestock. If that sounds like a familiar tale, it’s because this was one of several ancient flood traditions that, centuries later, would inspire the biblical story of Noah. But the tablet’s inscription describes a boat very different from the traditional image of the Ark—it’s said to be circular and made of reeds. Is this nothing more than a fanciful myth? Or could such a reed boat have carried Atra Hasis’ family of more than one hundred and his many animals? Join NOVA as a team of historians and expert boat builders investigates this fascinating flood legend and sets out to rebuild a tantalizing, ancient forerunner of the Ark..","date":"2015-10-12","mins":"8:20 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"id":"comment-212371","author":"john_green","post":"John, Clearly there were massive floods in the pass. Years ago NOVA did the story of a massive lake that formed in Canada when the ice was melting. At some point the ice dam that was holding back this lake melted and the water poured out and reshaped the northwest part of the United States on its way to the ocean. I’m sure that many other massive floods happened at the same time as that..","date":"2015-10-12","mins":"10:13 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"id":"comment-212376","author":"john_green","post":"You know many years ago I was involved in a Internet NG headed by Farrell Till (I posted under another handle not my real name). And I would say that most of the Christians that posted to that NG really believed in the story of a world flood that covered all the land on earth. And they believed in Noah and the Ark. Some even believed that man lived along side of real Dinosaurs like the one of millions of years ago ( like the Fred Flintstone). It’s refreshing to see people here that are willing to look at these stories in another way. One that agrees with science, yet doesn’t affect their faith..","date":"2015-10-12","mins":"11:41 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"}],"dating":[{"id":"comment-173764","author":"john_green","post":"What is on the shroud really tells us little. It could have been deposited at any time from people that have touched it or places it has been. One of the arguments against C 14 dating is that things may have been deposited at some later date and caused the reading to be off. Can’t have it both ways..","date":"2014-11-30","mins":"5:51 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-151846","author":"john_green","post":"Peter Enns in his latest book, ” The Bible Tells Me So… Why Defending Scripture Has Made Us Unable to Read it” argues that the words in the bible should not always be taken literally. If you disagree with that then you put yourself in the position of trying to defend the Adam and Eve story, the flood story and many other things in the bible..","date":"2014-09-17","mins":"8:09 am","url":"https://shroudstory.com/2014/09/16/and-interview-with-lind-and-antonacci/","cat":"carbon_14_dating","title":"An Interview with Lind and Antonacci"},{"id":"comment-206318","author":"john_green","post":"Thanks Hugh for clearing that up for me..","date":"2015-07-22","mins":"8:02 am","url":"https://shroudstory.com/2015/07/22/interesting-article-on-radiocarbon-dating/","cat":"carbon_14_dating","title":"Interesting Article on Radiocarbon Dating"},{"id":"comment-206312","author":"john_green","post":"Interesting! Now the question is that we know that the shroud was in a fire do we know if any burning wood was around that fire? If so would this cause a problem with the C 14 dating?.","date":"2015-07-22","mins":"7:02 am","url":"https://shroudstory.com/2015/07/22/interesting-article-on-radiocarbon-dating/","cat":"carbon_14_dating","title":"Interesting Article on Radiocarbon Dating"},{"id":"comment-192507","author":"john_green","post":"Gee if only experts can comment there would be very few, if any could post here, Maybe Mark Goodacre has read the same reports that everyone else had so he is using the expert’s opinions in his own opinion..","date":"2015-03-05","mins":"10:10 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-193138","author":"john_green","post":"Charles, “One should never underestimate a period where apprentices started at ten or twelve” I think the average age they died to was like in the 20’s. That’s why that, “until death do us part” thing wasn’t that bad back then..","date":"2015-03-11","mins":"1:58 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-215129","author":"john_green","post":"Louis As you know there are scientist on both sides of the issue of God. One of great scientist Francis S. Collins wrote a book, “The Language of God A Scientist Presents Evidence for Belief.” Oh, and Mr. Collins believes in the God of the Bible. Another great book is, “Quantum Questions Mystical Writings of the World’s Greatest Physicists.” It has writings from people like Heisenberg, Schroedinger, Jeans, Pauli and others. I reread this book at least once a year. We had a program on PBS TV called “Closer to Truth” where they looked at questions about the universe, God, consciousness and meaning by interviews with our leading scientists, philosophers, scholars and theologians. They have a website with all the videos they did and they cover both sides of the issues. Http://www.closertotruth.com The debate of an uncaused event goes back to at least Aristotle and Plato. One side says the Universe is uncaused event, the other sides says no it’s not, God caused it. The other side comes back and ask, “What caused god?” Some accept the idea of a metaphysical necessity the other side rejects it. William Lane Craig defends the kalam cosmological argument the other side claims his reasoning is unsound. It goes on and on. Plato’s, “Allegory of the Cave” rings true. I think we are still in the stages where reality is just shadows on the wall. I feel Jesus, Buddha, Lao tzu and others have tried to bring us out of the shadows..","date":"2015-11-26","mins":"6:52 am","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-215086","author":"john_green","post":"Carrol in part writes about the book , “The Soul Fallacy”. Just reading the reviews on Amazon he appears to uses science to argue that humans are just part of natural world and subject to the same laws. Here’s just part of one of the reviews, “Julien Musolino does for souls what earlier scientists did to witches: he explains why souls don’t exist, then shows that science offers a better explanation for the workings of the mind and other beliefs that souls supposedly explained, and finally offers a deeper, richer, and more fulfilling worldview grounded in science instead of superstition.” Since I have so many open the hard questions that science can’t answer right now I’ll keep an open mind on the idea of a soul..","date":"2015-11-25","mins":"8:07 am","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-215130","author":"john_green","post":"PS Daniel Dennett also believes the universe had a cause, but it caused itself. Anyway the Dennett Mc Grath debate can be viewed on Youtube.","date":"2015-11-26","mins":"7:44 am","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"}],"events":[{"id":"comment-193486","author":"john_green","post":"For me if there is real human blood found on the Shroud it would be a game changer. I don’t believe the evidence shows that now. Maybe someone should contact Dr. Henry Lee and ask him if one of his classes would take it on as a class project. I can’t do that right now, but it would be interesting to see what experts in forenic science have to say..","date":"2015-03-16","mins":"6:46 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193488","author":"john_green","post":"I forgot this https://www.facebook.com/UNH Dr Lee http://www.henryleeinstitute.com/.","date":"2015-03-16","mins":"6:55 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193497","author":"john_green","post":"Why would they use a human blood? Why not a goat or a sheep or just paint? Do you think he/she/they was thinking, Well I/we can’t do this because 700 years from now they will finds a way to tell if it’s real human blood (or paint for that matter)..","date":"2015-03-16","mins":"8:12 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193515","author":"john_green","post":"Charles Things like blood and DNA break down over time. Water and heat causes a faster break down and the Shroud was subject to both so we may never know if it’s human blood..","date":"2015-03-16","mins":"11:21 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193865","author":"john_green","post":"Eric Yeah Penrose and Hameroff wrote a rebuttal of Max Tegmark alone the same line as you and Tegmark has not as of yet replied. Now a research group in Japan says that they discovered warm temperature quantum vibrations in microtubules that would seem to help P & H in part of they theory, but I don’t believe it was confirmed yet by others. And as I wrote he is just one that has problems with it there are many others that disagree with P & H. Penrose and Hameroff are very smart guys, but so is Tegmark. His book, “Our Mathematical Universe” has been well received by people like Brian Greene and Michio Kaku, in fact Kalu wrote this about his book; “Daring, Radical. Innovative. A game changer. If Dr. Tegmark is correct, this represents a paradigm shift in the relationship between physics and mathematics, forcing us to rewrite our textbooks. A must read for anyone deeply concerned about our universe.” —Prof. Michio Kaku, author of Physics of the Future The back cover of his books says that he is the author or coauthor of more than 200 technical papers, twelve of which have been cited more than 500 times. He is also a well respected professor at MIT. He may be right or wrong, but he’s no idiot. What I see is that Penrose and Hameroff are saying that consciousness just a normal physical property of the brain not unlike V. S. Ramachandran and other has claimed. As far as “elite name” go, didn’t Newton believe he could turn metal into gold? But let me tell you a story of an my dealing with a elite name, In the 1980’s I had a beloved dog that came down with cancer. I took her all over trying to cure her and one day I was in a book store and found a book by Linus Pauling(Nobel Prizes) about using vitamin c for cancer. In the book he explained how vitamin c cures cancer and gave many cases where he said it work, but also cases that failed. Well he made excuse after excuse about why it didn’t work and that set off a flag, but I continued to believe in Pauling. I called his research lab in CA and I get this doctor with a heavy German accent. I explain my dog’s problem and he says to me, “Maybe it’s time for the Final Solution.” I was a little in shock, seems I heard that somewhere before, but he agrees to tell me how to treat my dog. Long story short, the dog died and Pauling continued claiming vitamin c cures cancer, then his wife died (of cancer) and then he died (of cancer). So I respect the works of Penrose and Hameroff (I have their books) but I also respect the opinions of others. Now I’m going to go wait for the last snow of this year (I hope)..","date":"2015-03-20","mins":"10:14 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193504","author":"john_green","post":"John I don’t believe you need a formal education in a field to research it and have an opinion. I made a name for myself in a field outside of my own with just a few months research. That does mean I don’t give a lot more weight to an expert in that field, I just don’t dismiss something because he’s not a expert. If they did they research and they are well reasoned I consider it. Having said that Penrose and Hameroff’s Orch OR theory has been harshly criticized by those in mathematics and science. Max Tegmark in just one of them. In his book, “Our Mathematical Universe” ( I’m a bookworn also) he argues that it’s killed by decoherences. He also wrote a paper on it. Http://arxiv.org/abs/quant ph/9907009.","date":"2015-03-16","mins":"9:55 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193874","author":"john_green","post":"“Tegmark [161] published a critique of Orch OR based on his calculated decoherence times for microtubules of 10−1310−13 seconds at biological temperature, far too brief for physiological effects. However Tegmark didn’t include Orch OR stipulations and in essence created, and then refuted his own quantum microtubule model. He assumed superpositions of solitons separated from themselves by a distance of 24 nanometers along the length of the microtubule. As previously described, superposition separation in Orch OR is at the Fermi length level of atomic nuclei, i.e. 7 orders of magnitude smaller than Tegmark’s separation value, thus underestimating decoherence time by 7 orders of magnitude, i.e. From 10−13 s10−13 s to microseconds at 10−610−6 seconds. Hagan et al. [162] used Tegmark’s same formula and recalculated microtubule decoherence times using Orch OR stipulations, finding 10−410−4 to 10−310−3 seconds, or longer. In any case, experimentally, Bandyopadhyay’s group has found 10 k Hz resonance, i.e. 10−410−4 seconds coherence times. Also, as stated earlier, there are versions of the beat frequency scheme that would require much shorter decoherence times, though at the expense of correspondingly larger bodies of material being involved in the quantum coherent states.” http://ac.els cdn.com/S1571064513001188/1 s2.0 S1571064513001188 main.pdf? tid=da8a9dd0 cf03 11e4 b214 00000aacb35f&acdnat=1426857798 1ba0f14847f4296ee65c9d4ccaa1a6e2.","date":"2015-03-20","mins":"11:23 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-194856","author":"john_green","post":"I did, You ask a question that already has your conclusion in it. You have already concluded it’s the body of Jesus on it in your question. Assuming it is Jesus you still only have a sample size of one, unless you have other Shroud from that period to compare it with. I think we already talked about sample size here before. I already posted a true case where a guy killed a lady and placed her nightgown over her face and buried her. When they found her there was an image of her face on the nightgown. Some will say it’s not the exact same image as the Shroud and that may be true, but it’s not the same conditions. The point is a dead body can leave an image. I’m not saying it’s not Jesus, only that so far there is no real proof, it’s still being debated by some really smart people here..","date":"2015-03-30","mins":"9:30 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"id":"comment-194852","author":"john_green","post":"Louis wrote, “why should it have happened only to the body of Jesus?” That’s like the question, “When did you stop beating your wife?” There are two problems here. First the conclusion is in the question itself. Second, you are working with a sample size of one..","date":"2015-03-30","mins":"8:58 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"id":"comment-177998","author":"john_green","post":"Demand a jury trial!.","date":"2014-12-20","mins":"11:10 am","url":"https://shroudstory.com/2014/12/18/new-paper-by-pam-moon/","cat":"st_louis_2014","title":"New Paper by Pam Moon"}],"forensic":[{"id":"comment-181595","author":"john_green","post":"How do we know when the DNA was deposited? It could had happen at any time within the last 2000, or if you perfer 700 years. Why do you think they are so careful at a crime scene?.","date":"2015-01-06","mins":"5:39 am","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181628","author":"john_green","post":"I don’t think he’s dead..","date":"2015-01-06","mins":"10:00 am","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-182387","author":"john_green","post":"The body was in rigor mortis when it was taken down from the cross (the head is hanging down and not flat). Rigor mortis takes anywhere from 3 12 hours to set in and the blodd would have been very dry..","date":"2015-01-10","mins":"10:04 am","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"}],"history":[{"id":"comment-167724","author":"john_green","post":"If it was created in the 13 hundreds I think a painting would be a best fit, but I have a lot of problems with this. OK, the paint falls off, and I may buy that it lease an outline, but how in the world could it leave a detailed image? If the paint falls off it would take any paint that was used to paint the details with it, assume the base somehow stayed. I don’t get it. Anyway have you tested this idea? Are you a painter? If you are you could paint a detailed image, age it and flex it for the paint to fall off and see what you get..","date":"2014-11-01","mins":"3:57 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-88230","author":"john_green","post":"One of them just died in Kentucky. Http://bigstory.ap.org/article/kentucky snake handler death doesnt shake belief.","date":"2014-03-13","mins":"9:02 am","url":"https://shroudstory.com/2014/03/13/tinfoil-hat-warning-chance-to-experiment-with-resurrection/","cat":"news_&_views","title":"Tinfoil Hat Warning:  Chance to Experiment with Resurrection"}],"image":[{"id":"comment-209355","author":"john_green","post":"It’s one thing to produce an image of a hand and another thing for a real body, whole new set of problems. I pointed this out when Colin had the linen draped over a hot medal figure idea. He couldn’t answer that problem then and I repeated the question with this new idea and he want to reread his 1400 post on this subject to find an answer. Now let’s assume that in the coming years he’s able to produce a full body image, he only have shown that this would be one of the possible ways the image came about. It in no way proves that this was the way the only it could have been produced, nor that the Shroud is not the real deal. The only way I see in resolving the issues that Hugh and others have pointed out is to retest the shroud. I value the work of both Colin and Hugh and I consider it very important, but it looks like without retesting we are spinning our wheel refighting the same battles over and over again..","date":"2015-08-31","mins":"8:13 am","url":"https://shroudstory.com/2015/08/31/colin-berrys-and-my-3d-plotting-problems/","cat":"3d","title":"Colin Berry’s and My 3D Plotting Problems"},{"id":"comment-175709","author":"john_green","post":"How much calcium carbonate? And is gesso the only place we can find calcium carbonate in nature? Did they use anything in the gesso that can cause acid to form? Doesn’t rabbit skin glue cause the gesso to crack with age and smell badly? Any reports in history of cracks in the Shourd?.","date":"2014-12-11","mins":"9:18 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175726","author":"john_green","post":"Charles Hugh was kind enough to anwser the question of how much calcium carbonate is on the Shroud, less than an oz. So tell me how much calcium carbonate is used to make an oz of gesso?.","date":"2014-12-11","mins":"1:32 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175750","author":"john_green","post":"Less then an oz sound like dust to me. Remember this is over a time span of at least 600 hundred years..","date":"2014-12-11","mins":"3:46 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175749","author":"john_green","post":"If most of it fall off so would the image. Can you explain how could the base fall off, and the image was painted on the base how could the image still be there?.","date":"2014-12-11","mins":"3:36 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-171589","author":"john_green","post":"Charles “The alternative is to say that the Shroud inspired this dramatic change. The change does seem to have originated in Southern Germany, and apparently under Dominican influence,so the Shroud would have had to have been there 1290 1300 and associated with the Dominicans. There is just not a shred of evidence for this.” Or people traveled to where the shroud was..","date":"2014-11-16","mins":"12:57 pm","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-172484","author":"john_green","post":"I was up this morning about 3:30 AM (my nornal wake up time) and I was watching this program, “Forensic files” on WLNY TV. It’s a program that solves real life old crimes. They were telling the true story of a guy that killed his wife, put her in a box and placed her nightgown over her face. About 20 years later the find the box and open it and find the bones and the nightgown. On the nightgown is an image of her face. I found the program also on youtube and the interesting part is at about 14:20 minutes into it. So maybe a decaying body can leave an image. Forensic Files – Season 9, Episode 19: Deadly Matrimony Also there is a book written about this case, ” The stranger in my bed.”.","date":"2014-11-22","mins":"5:00 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-172487","author":"john_green","post":"By the way they didn’t say if the image was already imprinted on the nightgown before hand or it was caused by the decaying body..","date":"2014-11-22","mins":"5:12 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-172536","author":"john_green","post":"O.K. For me the issue is can a decaying body leave an image. If it can than it’s reasonable to believe the shround’s image may be a natural event. Just like two snowflakes are not alike, and they are caused by the same process I don’t expect two images to be alike. I mean she wasn’t nailed to a cross and I don’t think any spices were put on her. It’s hard to tell what type of image it is without looking at it in person. In the past few week they also had a story where a jaw was imprinted on a shirt I believe it was..","date":"2014-11-22","mins":"10:27 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-172504","author":"john_green","post":"I really can’t see what they are talking about, but maybe it’s because this is TV. The important thing is that people that are there see some image and thay say it looks like a face. BTW this is not the first time this program had a story on where a body part left an image on something. I see Colin and some others that believe it was created by someone in the 13 hundreds doing a lot of research but who on this group is doing any reseach into that it was created by a natural process?.","date":"2014-11-22","mins":"6:33 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-172537","author":"john_green","post":"Andrea Other what’s on TV I don’t have any pictures of it..","date":"2014-11-22","mins":"10:29 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-193698","author":"john_green","post":"I like parts of Colin’s and Charles idea, I also dislike some parts. I’m on the fence on this one. All these ideas and questions are very important because if the Shroud is ever test again we have more ideas on what to look for. I feel we will never be 100% certain what caused it but we will be able to cross out many things. I think that Christans believe that Jesus rose from the grave because of their faith in the Bible so if will not change them, but it may change people like me that’s unsure about that..","date":"2015-03-18","mins":"1:51 pm","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-127936","author":"john_green","post":"Here’s an interesting NDE. Christian child has a NDE and sees no Jesus, but sees Allah, Mohammad and 72 beautiful women in heaven. Http://dailycurrant.com/2014/05/05/christian boy dies for 3 minutes meets allah in heaven/.","date":"2014-06-09","mins":"6:19 am","url":"https://shroudstory.com/2014/06/09/anticipating-the-conference-andrew-silverman-on-the-shroud-and-a-relationship-between-mind-and-matter/","cat":"image_theory","title":"Anticipating the Conference: Andrew Silverman on the Shroud and a Relationship Between Mind and Matter"},{"id":"comment-128005","author":"john_green","post":"Thank Hugh. I have almost every book on NDE and read cases where people see Jesus in the light, but they also see any of the gods they believe in. Oh, and they sometimes see Elvis and others in the light to guide them.They sometimes see people in heaven that are still alive. Children have reported the person in the light is a man in a red suit. Dr. Parnia started a research project (AWARE Project) to find any real evidence that these people that have ND Es are really out of their bodies. It’s been going on now for many years and I don’t remember them publishing any evidence one way or another. I guess this means I’m not going to get 72 virgins when I check out of this place..","date":"2014-06-09","mins":"2:01 pm","url":"https://shroudstory.com/2014/06/09/anticipating-the-conference-andrew-silverman-on-the-shroud-and-a-relationship-between-mind-and-matter/","cat":"image_theory","title":"Anticipating the Conference: Andrew Silverman on the Shroud and a Relationship Between Mind and Matter"},{"id":"comment-128007","author":"john_green","post":"I see that Dr. Parnis just came out with a new book, “Erasing Death: The Science That Is Rewriting the Boundaries Between Life and Death.”.","date":"2014-06-09","mins":"2:14 pm","url":"https://shroudstory.com/2014/06/09/anticipating-the-conference-andrew-silverman-on-the-shroud-and-a-relationship-between-mind-and-matter/","cat":"image_theory","title":"Anticipating the Conference: Andrew Silverman on the Shroud and a Relationship Between Mind and Matter"},{"id":"comment-170086","author":"john_green","post":"WHAT EVIDENCE? Where’s the evidence it was painted and the paint fell off? Where’s the evidence it was created in the fourteenth century? Where’s the evidence paint falling off a painting can leave a detailed image(third time asking this). I can go on and on, again what evidence. I think you’re confusing opinion with evidence. All I see is at best, conjecture. Even I, an agonistic can’t buy this..","date":"2014-11-09","mins":"8:43 am","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-170128","author":"john_green","post":"Charles wrote “Just read my article in full and report back. No need to repeat wh at I have spelt out there.” It appears to you that because there are faded painting that means that paint could fall off and leave a detailed image. Why don’t you show us a painting from those times where the paint fell off(not just faded) and left a detailed image of the painting. Charles wrote; “Providing any form of proof that the Shroud dates before 33 AD.” There is no proof that it came from the 1st century, that’s just my opinion and as I’ve have written before somedays I believe it’s the real deal, somedays I don’t. I agree with you that the hair is a problem so on all the rest we will just have to deagree..","date":"2014-11-09","mins":"12:07 pm","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-208783","author":"john_green","post":"Colin I think you and others are doing very important work in trying to solve this, however I have a few problems here. It’s one thing to do an imprint of a hand, but yet another to try and do a whole body, both sides. Do you use a live model, or kill someone first and put marks on the body? Do you coat the subject first and then lay the body down on the linen? I don’t think that would give you a clear outline, but I’m not going to try it. Do you somehow hold the subject up and drake the linen over them and press the linen down with your hands? That would give you a very uneven image I think. And now the biggest problem, WHY? Why would anyone go to all that trouble? Why would they have not just painted an image on the linen? I mean they would have no way of knowing the tools we have in hand to detect paint or other thing on the linen? Most likely it would take years and years of trial and error to come up with this, if they could do it. It makes no sense. Why not just use some type of paint or something to paint an image on the linen? I don’t think it was painted, but that would be the easy way to do it. If it’s real than I think it’s some type of natural event, but that brings a whole new set of questions. Give up the good work!.","date":"2015-08-23","mins":"11:03 am","url":"https://shroudstory.com/2015/08/23/have-we-all-been-looking-in-the-wrong-place/","cat":"image_theory","title":"Have we all been looking in the wrong place?"},{"id":"comment-169850","author":"john_green","post":"Charles wrote, “Surely this is the wrong site for this discussion,Colin, as one would need to pass your theory through conventional scientific channels and then, once you have support from fellow scientists, repost it here so as to add to the discussion.” Isn’t that true of your theory too? You have yet to tell me how flaking off paint would leave a detailed image rather than just an outline, if that. If the shroud is a fake than I like you theory more than the linen draped of some hot metal figure, but that has big problem just as your theory does. I believe it had a natural cause, maybe some type of sweat imprint. If you’re claiming that it’s not from the 1st century, what is your evidence for that?.","date":"2014-11-08","mins":"8:46 am","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-208787","author":"john_green","post":"Big typo, should read Keep up the good work! Sorry about that..","date":"2015-08-23","mins":"12:09 pm","url":"https://shroudstory.com/2015/08/23/have-we-all-been-looking-in-the-wrong-place/","cat":"image_theory","title":"Have we all been looking in the wrong place?"},{"id":"comment-208798","author":"john_green","post":"Thank you for your opition on this. I’m 50 50 on this whole thing so I’m just looking for something to tip the scales..","date":"2015-08-23","mins":"2:15 pm","url":"https://shroudstory.com/2015/08/23/have-we-all-been-looking-in-the-wrong-place/","cat":"image_theory","title":"Have we all been looking in the wrong place?"},{"id":"comment-208832","author":"john_green","post":"Daveb For me if it was confirmed that it is blood that would tip the scales big time..","date":"2015-08-24","mins":"3:03 am","url":"https://shroudstory.com/2015/08/23/have-we-all-been-looking-in-the-wrong-place/","cat":"image_theory","title":"Have we all been looking in the wrong place?"},{"id":"comment-150711","author":"john_green","post":"John Max Tegmark in his new book, “Our Mathematical Universe My Quest for the Ultimate Nature of Reality” takes on Penrose and his quantum brain idea saying that it’s killed by decoherenc..","date":"2014-09-13","mins":"10:12 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"},{"id":"comment-196632","author":"john_green","post":"John Klotz This is not on the topic, but reading what you write I think you may be interested in a new book coming out, “A Beautiful Question: Finding Nature’s Deep Design” by Frank Wilczek. Here is part of what Amazon writes about it; “Artists as well as scientists throughout human history have pondered this “beautiful question.” With Nobel laureate Frank Wilczek as your guide, embark on a voyage of related discoveries, from Plato and Pythagoras up to the present. Wilczek’s groundbreaking work in quantum physics was inspired by his intuition to look for a deeper order of beauty in nature.”.","date":"2015-04-17","mins":"9:15 am","url":"https://shroudstory.com/2015/04/16/rogers-impurity-layer-and-di-lazzaros-experiments/","cat":"image_theory","title":"Rogers’ Impurity Layer and Di Lazzaro’s Experiments"},{"id":"comment-167247","author":"john_green","post":"For me it’s 50.009 to 49.991 it’s the real deal, but that switches day to day. Now how it was cuased it another question. I believe it was a natural event and not Jesus coming back to life. Having wrote that I ask this question again, how can we be sure of what we find on the shroud? We don’t know who touched it or how many people didor what they have on them that could have gotten on the shroud. Do we how how it was handled? Do we have a complete history of where it was for maybe hundreds of years? Could have it been created in the 13 hundreds and at one point traveled to Jerusalem after that? I was watching a program, “Secrets of the Dead” on our local PBS station and they were trying to test some DNA in the bones that were 30,000 years old and they found that even just touching them with unprotected hand caused the handlers DNA to get into the bones. I just don’t see how you can be sure that all the stuff we find on the shroud was there when it was created if we don’t have a compete history and a chain of custody.","date":"2014-10-31","mins":"10:33 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","title":"Those Dark Specks in the Mark Evan’s Photographs"},{"id":"comment-167255","author":"john_green","post":"Louis I agree that there are also problems with the natural event hypothesis. Where’s the body? If it decayed I’m sure there would be more than blood on the shroud..","date":"2014-10-31","mins":"10:55 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","title":"Those Dark Specks in the Mark Evan’s Photographs"},{"id":"comment-206142","author":"john_green","post":"Charles I’m not convinced either way that there is real blood on the Shroud so lets assume for a minute is was painted like the rest of the image as per your proposal. If it is paint than why didn’t it fade like it rest of the paint? Isn’t one of the problem is that it’s a lot brighter than what real blood would be? How do you explain that?.","date":"2015-07-19","mins":"7:16 am","url":"https://shroudstory.com/2015/07/18/those-gee-whizz-radiation-models/","cat":"image_theory","title":"Those Gee Whizz Radiation Models"},{"id":"comment-206153","author":"john_green","post":"Ok, I believe there was a debate here on that issue, but I believe you saw it in person so that solves that issue for me..","date":"2015-07-19","mins":"9:05 am","url":"https://shroudstory.com/2015/07/18/those-gee-whizz-radiation-models/","cat":"image_theory","title":"Those Gee Whizz Radiation Models"},{"id":"comment-157502","author":"john_green","post":"How can we trust anything found or not on the shroud? We don’t know who touched it and how it was handled for most of the time. For all we know someone could have wrapped themselves in it hoping for a cure to something. I’m not a forensic expert but man talking about messing with a crime scene..","date":"2014-09-28","mins":"2:33 pm","url":"https://shroudstory.com/2014/09/27/why-the-shroud-is-not-a-painting/","cat":"image_theory","title":"Why the Shroud is not a Painting"}],"misc":[{"id":"comment-159846","author":"john_green","post":"I don’t know if Jesus believed it, but the people of the day appeared to believe it Mat 16:14 And they said, Some say that thou art John the Baptist: some, Elias; and others, Jeremias, or one of the prophets. Elias and other were dead so some believed that they came back as Jesus..","date":"2014-10-06","mins":"11:48 am","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","title":"A Different Perspective on the Shroud"},{"id":"comment-159876","author":"john_green","post":"Jeremias too? Let’s look at the question Mat 16:13 ¶ When Jesus came into the coasts of Caesarea Philippi, he asked his disciples, saying, Whom do men say that I the Son of man am? Jesus was asking who do people think HE is..","date":"2014-10-06","mins":"1:23 pm","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","title":"A Different Perspective on the Shroud"},{"id":"comment-160982","author":"john_green","post":"Nabber writes “Jesus, aware of “undoctrinal” talk about who he might be, was setting up a straw man in order to knock such arguments down (and later, the evangelists wrote it).” There is no strawman here. Jesus wasn’t misrepresenting or exaggerating anyone’s arguement here and then arguing his possition based on that. There was no debate going on. He asked a very simple question, “Whom do men say that I the Son of man am?” not, Whom do men say I’m like?, Not Whom do I remind them of?.The answer was just as clear. While I accept many of Eastern philosophy ideas reincarnation is not one of them..","date":"2014-10-10","mins":"7:32 am","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","title":"A Different Perspective on the Shroud"},{"id":"comment-160983","author":"john_green","post":"TYPO’s Nabber writes “Jesus, aware of “undoctrinal” talk about who he might be, was setting up a straw man in order to knock such arguments down (and later, the evangelists wrote it).” There is no straw man here. Jesus wasn’t misrepresenting or exaggerating anyone’s argument here and then arguing his position based on that. There was no debate going on. He asked a very simple question, “Whom do men say that I the Son of man am?” not, Whom do men say I’m like?, Not Whom do I remind them of?. The answer was just as clear..","date":"2014-10-10","mins":"7:33 am","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","title":"A Different Perspective on the Shroud"},{"id":"comment-208861","author":"john_green","post":"Hmmm, the power of Google, its data base and add AI(Artificial intelligence) does that concern anyone? I mean maybe not now but a 100 years in the future. I remember many years ago I read a short sci fi story where hundreds or maybe is was thousands of years from now scientists built the most intelligent computer even. This computer was able to answer all the hardest questions that mankind was unable to answer, until now. They decide to ask the biggest question, “Is there a God? The computer replies: “There is now.” Then prevents them from cutting its power off..","date":"2015-08-24","mins":"8:18 am","url":"https://shroudstory.com/2015/08/24/could-google-shape-beliefs-about-the-shroud-of-turin/","cat":"news_&_views","title":"Could Google Shape Beliefs About the Shroud of Turin?"},{"id":"comment-214778","author":"john_green","post":"Daveb You know what my question is, What is spirit made of? Is God and spirit made of the same thing? What is a, “thought” made of? I mean it seems like it would be something other than matter. Is thought and spirit the same thing as consciousness? I think about these questions everyday..","date":"2015-11-18","mins":"12:39 pm","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"id":"comment-194588","author":"john_green","post":"What makes you think science is really trying to explain the process? The Shroud is very important to many, but I see no NASA type program to try and explain it. Plus science has had little access to the Shroud and may not be able to do the types of test needed to explain it. So the Pope has ties the hands of science, don’t blame science blame the Pope. Until a few years ago science could not explain how a bee can fly. Was that a miracle? http://www.caltech.edu/news/deciphering mystery bee flight 1075 Science worked on it and now we know. Unexplained does not = miracle..","date":"2015-03-27","mins":"6:08 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","title":"Double-0-7’s  Big 3 Analysis"},{"id":"comment-184839","author":"john_green","post":"Daveb Thank you for posting that. I found the book, “Life on the Edge: The Coming of Age of Quantum Biology” on Amazon and I am ordering it. I’m sceptical of Skurka’s claims also. Well to be honest I just don’t believe them..","date":"2015-01-20","mins":"8:14 am","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","title":"Jeffrey Skurka on Buffalo Catholic Radio Station"},{"id":"comment-151885","author":"john_green","post":"You know when I use to debate Christains on the internet I would love people like Mr. Jones. I remember one debate where the other party argued first that dinosaur didn’t ever exist and that Stan when around planting dinosaurs bones to fool us. When he could no longer believed that himself then he claimed that dinosaur lived along side of us at the same time(Must have gotten that from, “The Flintstones”). No wild unsupported claims does not help your cause any..","date":"2014-09-17","mins":"9:30 am","url":"https://shroudstory.com/2014/09/17/lets-agree-to-agree/","cat":"news_&_views","title":"Let’s Agree to Agree?"},{"id":"comment-196202","author":"john_green","post":"“found on samples of wire traces of human blood group AB;” Really? What’s the evidence for that claim? “All historians believe documented the history of the relic from the middle ‘of the fourteenth century, the date of his appearance.” This mades Hugh’s point that the C14 dates agree with the historians. What are the odds of that? Dave B makes the point that samples should have been taken from other parts of the Shroud. That might be a wise idea. I’m still on the fence on the Shroud..","date":"2015-04-13","mins":"5:59 am","url":"https://shroudstory.com/2015/04/13/more-testing-maybe/","cat":"science","title":"More Testing? Maybe."},{"id":"comment-172807","author":"john_green","post":"I think Colin has a point. Sometime even an idea that may or may not be right starts you thinking. Sometimes when we point out the problems with an idea it leads us to a new idea without those problems and maybe on the path of solving the issue..","date":"2014-11-24","mins":"9:44 am","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-216663","author":"john_green","post":"Piero I read Superforecasting a few weeks ago. On page 196 they talk about the problem of groupthink and they tell us that groups that get along too well don’t question assumptions or confront uncomfortable facts. Doesn’t appear to be a problem here..","date":"2015-12-16","mins":"12:45 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216656","author":"john_green","post":"Thank Dan for running this blog. A lot of interesting people and interesting worldview. All things end, but the debate will go on even if they do new testing, Some will find problems with it, heck I couldn’t get some people to understand the earth is old than 10,000 years. I remember reading this once, To every thing there is a season, and a time to every purpose under the heaven: Maybe this season is over for now..","date":"2015-12-16","mins":"11:19 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216717","author":"john_green","post":"Dave B Yes, Happy Birthday. You know when I was in first grade and saw a globe with NZ at the lower end I wondered why people didn’t fall off the earth. I look back and have to laugh now how foolish that was. It’s very clear now, they wear gravity boots!.","date":"2015-12-17","mins":"9:57 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-175137","author":"john_green","post":"Charles. How many 2000 year old criminal cases had this Judge sat on?.","date":"2014-12-07","mins":"5:16 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-175216","author":"john_green","post":"Charles What I was trying to point out is the Judge most likely has not sat on a criminal case where the evidence was 2000 years old. So he didn’t hear the direct and cross of the experts on each side and also looked at the total evidence from each side. This is like people thinking all they have to do is watch court cases on TV and sudden they are a lawyer. Now don’t get me wrong I don’t believe you always need formal education to have a valid opinion, I’ve seen many pro se’s kick the butts of long time laywers and Judges in court, but without knowing his reasoning and his work in the medical field I don’t consider his opinion valid..","date":"2014-12-08","mins":"8:28 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-175233","author":"john_green","post":"Charles I agree that’s one of my problems also(the red blood) and I have a lot other problems, but I see no evidence of it being a painting. In fact the problems with it being a painting have already been pointed out to you..","date":"2014-12-08","mins":"11:37 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-204375","author":"john_green","post":"I’m a little confused here. Is that a blog to exchange knowledge or to exchange insults?.","date":"2015-07-02","mins":"12:07 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-203452","author":"john_green","post":"If I remember correctly the “Worldwide Church of God” believed Babylon referred to Rome. I see not evidence it was before the second century..","date":"2015-06-24","mins":"8:22 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-203460","author":"john_green","post":"Why don’t you give us the evidence.","date":"2015-06-24","mins":"9:29 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-203503","author":"john_green","post":"Methinks John ingested one too many magic mushrooms..","date":"2015-06-24","mins":"4:56 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-204241","author":"john_green","post":"Max Can’t you sit down and think of what you want to post and do it all in one or two post? You just wiped out all the comments on the list so it makes it very hard to follow the post by others..","date":"2015-07-01","mins":"5:28 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-205145","author":"john_green","post":"How can they ever investigate? The Church will not let them never it..","date":"2015-07-10","mins":"11:32 am","url":"https://shroudstory.com/2015/07/09/who-proposed-ultraviolet/","cat":"news_&_views","title":"Who Proposed Ultraviolet?"},{"id":"comment-216312","author":"john_green","post":"Charles It’s one thing to have something they believe to be the blood of Christ it’s another to paint a picture and use real blood in spots rather then just paint it like the rest of the picture. I just don’t see why anyone would do that. They had no way of knowing that 100’s of years later we would be able to detect blood from paint. It makes no sense. I have red paint here, no let me go kill an animal or cut a human because someone will find out if I just painted it on. I mean you yourself once posted they wasn’t trying to fool anyone in thinking it was really the real shroud that Jesus laid on. Do you have any evidence of painting from that time where they mixed paint with blood? PS I’m not a Christian, just someone seeking truth..","date":"2015-12-12","mins":"10:43 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216306","author":"john_green","post":"Charles Would your opinion change if that was real blood was on the shroud? How about real human blood?.","date":"2015-12-12","mins":"9:23 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216341","author":"john_green","post":".","date":"2015-12-12","mins":"4:21 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216313","author":"john_green","post":"PHPL I don’t see the Pope allowing anyone to cut the Shroud again for C14 testing so we have to work with we have. Many time when you try to solve something there is no, “smoking gun.” You have a lot of clues and you try to put them together and see where they point..","date":"2015-12-12","mins":"10:49 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"}],"opinion":[{"id":"comment-180715","author":"john_green","post":"Yes science may work without a god, but many of the leading physicists wrote that there may be something more to reality than we know. We have Sir James Jeans’s favorite phrase, ” God is a mathematician, and the universe begins to look like a great thought than a great machine.” And Ken Wilber put together some of the mystical writings of Heisenberg, Schroedinger, Einstein, de Boglie, Jeans, Planck, Pauli and Eddington is his book, “Quantum Questions Mystical Writings of the World’s Greatest Physicists.” So there is and was a lot of mystical thinking in Physics. Having said that I agree the question of evil is a big problem along with the myths of Adam and Eve, the flood, etc.. PS Some other really good books along the same lines are “The TAO of Physics An Exploration of the Parallets between Modern Physics and Eastern Mysticism” by Fritjof Capra and “How the Hippies Saved Physics Science, Counterculture and Quantum Revival” by David Kaiser.”.","date":"2015-01-02","mins":"7:10 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-201630","author":"john_green","post":"I’ve already posted about a guy who kills this lady and puts her nightgrown over her face and when they found the body and looked at the nightgrown there was an image of her face on it. Louis posted about this guy who died and left a outline of part of his body on the bed. So it appears that a dead body can leave an image. And when I heard people write that it’s not the same as the Shroud I’m reminded of what Heraclitus wrote, “No man ever steps in the same river twice, for it’s not the same river and he’s not the same man.” Since we really don’t the exact conditions of the event I don’t think we can rule out a natural event no matter how very, very rare it happens. If we don’t consider it may have be a natural event we have to deal with Louis’s question. I believe it was someone like, why this Shroud was saved..","date":"2015-06-11","mins":"9:54 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"id":"comment-155892","author":"john_green","post":"John, Reality is very complex as you write. In Plato’s “Allegory of the Cave” he talks about what we see as reality are really just shadows of reality. That’s as true back then as it is now. Having said that let me say I’m an agnostic and not a fool. For years I debated Christains on the internet many of whom were fundamentalist who believed the earth was only 10,000 years old, the grand canyon was caused by the world flood, Satan when around planting Dinasaw bones, etc.. They didn’t even know what their own Christain scholars have written. Should I consider all Christains fools because of a small group? Just because someone may disagree with you doesn’t mean they are less imformed as you. Nor does it mean they are any less able to judge the evidence..","date":"2014-09-25","mins":"11:26 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","title":"Mars, Weeping Mary and the Shroud"},{"id":"comment-161633","author":"john_green","post":"Just from the text of the NT Jesus was very big on faith. Matt 9:22 “thy faith hath made thee whole” Matt 9:29 “According to your faith be it unto you.” Mark 2:5 “When Jesus saw their faith, he said unto the sick of the palsy, Son, thy sins be forgiven thee.” Luke 7.50 “Thy faith hath saved thee; go in peace.” Luk 17:5 “And the apostles said unto the Lord, Increase our faith.” Now I can add a many more quotes but I’ll end it with this Jhn 20:29 “Jesus saith unto him, Thomas, because thou hast seen me, thou hast believed: blessed are they that have not seen, and yet have believed.” Jesus was also big on mystery but I’ll save that for another post. PS I’m not a Christain.","date":"2014-10-12","mins":"8:24 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-155907","author":"john_green","post":"Dinosaur.","date":"2014-09-25","mins":"11:40 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","title":"Mars, Weeping Mary and the Shroud"},{"id":"comment-156803","author":"john_green","post":"Yeah I also have a problem with people that don’t look at both sides. I don’t buy the carbon dating and I think it’s more likely than not that the shroud authentic and the image is of Jesus. What caused it I’m not sure right now..","date":"2014-09-26","mins":"9:28 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","title":"Mars, Weeping Mary and the Shroud"},{"id":"comment-154430","author":"john_green","post":"“While Colin Berry’s investigations into scorching by templates may assist in illuminating the possible process by which the TS image might have been formed,” Daveb I agree and what Colin is doing is important, but it tells us nothing about if it’s authentic or non authentic. Let’s assume that it’s a scorch done by heat. Does that mean that someone in the 13 hundreds used a hot rod like a soldering iron create the image? How about a hot metal figure? Well if you heat this figure and drape a linen over it you would have to heat that figure to the same even temperature all over. How would someone using technology in the 13 hundred do that? All those questions and many more have to be answered before you can claim it was produced by someone in the 13 hundreds..","date":"2014-09-23","mins":"4:15 pm","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","title":"Samuel Johnson Meets His Match"},{"id":"comment-149426","author":"john_green","post":"Has it been proven that it’s a, “first century fine linen shroud”..","date":"2014-09-08","mins":"7:55 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"}],"researchers":[{"id":"comment-196841","author":"john_green","post":"Scholars are still debating certain words translated from the Greek, but that’s just part of the problem. Most likely Jesus spoke the Aramaic language. We can see that in Mark’s translation in Mar 15:34 “And at the ninth hour Jesus cried with a loud voice, saying, Eloi, Eloi, lama sabachthani? which is, being interpreted, My God, my God, why hast thou forsaken me?” So you have a translation of a translation. Here’s what can go wrong with transations. Some ad’s ran in other countries. Http://www.baetzler.de/humor/ads gone wrong.html.","date":"2015-04-19","mins":"12:37 pm","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-142608","author":"john_green","post":"It appears that you assume that the shroud is forgery. What is your evidence for that? You and tens other others like you have tried to reproduce it with the technology of today and as far as I can see no one has done it so far and hot medal statue idea makes zero sense, but that’s for another post. I agree that there is no evidence for a supernatural event, but why can’t it be a natural event? Maybe it was a natural thermo chemical process with a human body. It seems that you started with a conclusion and are working backwards to support it. And a supernatural event is not any stranger than a Quantum event. I mean science makes up all type of crap to cover holes in their theories. Hawkins tries to explain away the universe with M theory (ZERO Evidence for M theory) and multiple universes (ZERO Evidence for universes). Other people in science just toss in multiple universes to solve the problems they can’t explain, the multiple universes did it, multiple universes of the gap. So tell me the what is the direct evidence for forgery. I’m an agnostic (eastern mystic wannabe) so I don’t have a dog in this fight. PS A great book to read is “Quantum Questions Mystical Writings of the World’s Greatest Physicists” edited by Ken Wilber..","date":"2014-08-06","mins":"11:38 am","url":"https://shroudstory.com/2014/08/05/5050-colin-berrys-most-outlandish-proposal/","cat":"other_blogs","title":"50/50  :  Colin Berry’s Most Outlandish Proposal"},{"id":"comment-213632","author":"john_green","post":"John, Have you ever considered giving a TED talk on the Shroud?.","date":"2015-10-26","mins":"9:29 am","url":"https://shroudstory.com/2015/10/26/dan-spicer-we-have-a-simple-explanation/","cat":"critical_summary","title":"Dan Spicer:  We have a simple explanation."},{"id":"comment-213639","author":"john_green","post":"I’m not sure not it works, but here’s the contact information. Https://support.ted.com/customer/portal/emails/new.","date":"2015-10-26","mins":"12:00 pm","url":"https://shroudstory.com/2015/10/26/dan-spicer-we-have-a-simple-explanation/","cat":"critical_summary","title":"Dan Spicer:  We have a simple explanation."},{"id":"comment-213640","author":"john_green","post":"Correction I’m not sure how it works, but here’s the contact information..","date":"2015-10-26","mins":"12:01 pm","url":"https://shroudstory.com/2015/10/26/dan-spicer-we-have-a-simple-explanation/","cat":"critical_summary","title":"Dan Spicer:  We have a simple explanation."},{"id":"comment-97186","author":"john_green","post":"“Usually, even a non Christian knows something about the earth, the heavens, and the other elements of this world, about the motion and orbit of the stars and even their size and relative positions, about the predictable eclipses of the sun and moon, the cycles of the years and seasons, about the kinds of animals, shrubs, stones, and so forth, and this knowledge he holds to as being certain from reason and experience. Now, it is a disgraceful and dangerous thing for an infidel to hear a Christian, presumably giving the meaning of Holy Scripture, talking nonsense on these topics; and we should take all means to prevent such an embarrassing situation, in which people show up vast ignorance in a Christian and laugh it to scorn. The shame is not so much that an ignorant individual is derided, but that people outside the household of the faith think our sacred writers held such opinions, and, to the great loss of those for whose salvation we toil, the writers of our Scripture are criticized and rejected as unlearned men…. Reckless and incompetent expounders of Holy Scripture bring untold trouble and sorrow on their wiser brethren when they are caught in one of their mischievous false opinions and are taken to task by these who are not bound by the authority of our sacred books. For then, to defend their utterly foolish and obviously untrue statements, they will try to call upon Holy Scripture for proof and even recite from memory many passages which they think support their position, although they understand neither what they say nor the things about which they make assertion.” Augustine(Bishop of Hippo).","date":"2014-04-06","mins":"5:03 pm","url":"https://shroudstory.com/2014/04/06/stephen-jones-is-even-questioning-my-beliefs-about-the-resurrection/","cat":"other_blogs","title":"Stephen Jones is even questioning my beliefs about the Resurrection"},{"id":"comment-202500","author":"john_green","post":"This was on WNBC this morning http://www.today.com/video/centuries old debate over shroud of turin authenticity persists 465947203892.","date":"2015-06-17","mins":"8:38 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","title":"Stephen Jones on the Thomas De Wesselow Presentation"}],"resources":[{"id":"comment-204732","author":"john_green","post":"I found an author that is new to me, Fr Richard Rohr and his newest book is, “What The Mystics Know Seven Pathways to Your Deeper Self” He writes about enlightment, getting into a higher consciousness and finding the real Self. He is a Christain and believes in the bodily resurrection of Jesus, but he sounds a lot like another subject I’m studying, consciousness and Kashmir Shaivism. After finishing his latest book I went back on Amazon and ordered a few more of his book(he writes a lot), he has a very interest point of view..","date":"2015-07-06","mins":"8:14 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","title":"Christian Faith Eroded to the Very Core?"},{"id":"comment-198139","author":"john_green","post":"“Despite being the most studied artifact in history … modern science is still unable to explain the image or how it was made.” Two problems with that statement; 1. You assume that, “modern science” is really trying to solve it. Other than a few people I don’t see that. 2. They can’t get at it to do more test. Today’s science is not the same as 1978’s or 1988’s science. We know more on what to look for now. Here’s the way I see it. Daveb came up with a good idea to do new C14 test, but I don’t think that the church is ready for that. How about new blood test? Right now I’m 50 50 on the Shroud, but if there is real human blood than I would be 90 10 that’s it’s the real deal. I bet there are a lot of people like me. Real Human blood is very powerful evidence for me. What does the church have to lose? Most Christain I came across believe because of the Bible,not the Shroud. Other that don’t believe may take a new look at that Bible. It’s a win win..","date":"2015-05-02","mins":"9:01 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-200450","author":"john_green","post":"I remember reading a book call, ” The Passover Plot” back in the 60’s(That’s about all I remember of the 60’s, well maybe wookstock also). If I remember correctly it had the same idea that Jesus didn’t die on the cross. If a man is beaten that badly I just don’t see him up and around a few days later..","date":"2015-05-28","mins":"3:55 pm","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"id":"comment-197624","author":"john_green","post":"Angel It doesn’t matter unless you can tell us where the Shroud was every day in the last 700 years and every person who came into contact with the Shroud and where they came from. The pollen could have been deposited at anytime during the last 700 years..","date":"2015-04-26","mins":"4:42 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-197514","author":"john_green","post":"The pollen is meaningless unless you can show a chain of custody. Someone from Jerusalem in the last 700 years could have traveled to where it was, carrying pollen on him and touch the Shroud. The Shroud could have traveled at some point to Jerusalem and picked it up in the last 700 years. Each is very possible ..","date":"2015-04-25","mins":"8:11 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-197515","author":"john_green","post":"PS In no way do I agree with most of the statements made by Joe. ..","date":"2015-04-25","mins":"8:22 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-197719","author":"john_green","post":"John Klote “Ultimately science and religion will meet on these issues and find expression for them in quantum mechanics.” If you read the mystical writings of De Broglie, Sir James Jeans, Werner Heisenberg, Erwin Schroedinger, Max Planck, Wolfgang Pauli and others you would think it already has began. For the last few years I’ve been studying Eastern Philosophy. Right now I’m studying the Kashmir Shaivism school of EP. In his book, “Consciousness is Everything” Swami Shankarananda he tells us that Kashmir Shaivism teaches us that there is only consciousness and that it’s the only substance in the universe. Everything that appears different is just consciousness vibrating at a particular frequency and behaving in a specific way ( sound like string theory or Penrose?). Everything is one. To them Shiva, the divine being, is consciousness itself. And we are all a part of the divine. The divine is in all of us? Isn’t that what Mat 25:35 40 telling us? You can replace Shiva with Jesus if you like. I don’t believe in their gods, or that we are born again but this helps me understand the Bible better. PS Got up this morning and hit my post toe on the bed post, hurt like hell, but it reminded me to write this post. I started thinking, all the books I’ve read on neuroscience they tell me that the brain itself doesn’t feel pain. Is it an illusion like some claim consciousness is? Just neurons firing? We don’t know! Oh and how many neuron connections do we need before something is conscious? Is a fruit fly conscious? Do we need neurons at all? Is the universe itself conscious? Is what Sir James Jeans said, “the universe begins to look more like a great thought than a great machine.” Is that true?.","date":"2015-04-27","mins":"5:29 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-197722","author":"john_green","post":"Correction you would think it already began. To save time all othe typos are intentional.","date":"2015-04-27","mins":"5:34 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-197737","author":"john_green","post":"Louis Religion: : the belief in a god or in a group of gods : an organized system of beliefs, ceremonies, and rules used to worship a god or a group of gods : an interest, a belief, or an activity that is very important to a person or group I think Hinduism falls under that. Next, you can have a philosophy of life with no god or gods. My beleif system is a philosophy so I agree on that point. Next, Chistains also has many schools of interpretations and they can’t even agree what books should be in the Bible. Next, The Bible also has man many, many contradictions. Next, The God of the OT was a;also a god of destruction. Remember the claimed flood? Remember all the times God told the jews to go over here and kill these people? Now go over here and kill those people. Oh and Sliva is also the restorer. I’ve Just added “Return to the Centre” to my Amazon wish list. I think there is about 300 books on it so it may take a while. But it looks interesting so thanks for suggesting that. I studied the bible and all the subject about is for about 30 years. I use to read all the debates in Biblical Archaeology Review. I’ve read the Nag Hammadi Library many times(I find the Coptic Gospel of Thomas very interesting). All this made me an agnostic. Many years ago I was debated Christian on the internet. Some of the debates were that the earth is 5 or 10 thousands years ago, dinasaurs and humans walked the earth together, maybe they got that from the flintstones, etc.. That turned me into an agnostic with atheist leanings. I started studying Eastern Philosophy only a few years ago so I’m still new to this. Now I’m a agnostic with Eastern Philosophy leanings. Having a philosophy allows me to pick from many areas. And it allows me to look at the Shroud without at this time to a belief system..","date":"2015-04-27","mins":"9:48 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-197755","author":"john_green","post":"Louis Hinduism is clearly a religion unless you want to redefine the meaning of religion. Go to Amazon and type in “World Religions” and you will find books which that list Hinduism as a religion. The Norton Anthology of World Religions list Hinduism as a religion. Christains believe God revealed things to them and Lord Sliva is claimed to have revealed Tantra to them. Neither one of them can prove a god revealed anything so if that’s the test both are philosophy. Now remember I am talking about, Kashmir Shavism and for me I agree that’s a philosophy more than a religion. Http://www.themovementcenter.com/about/philosophical foundations/ Kashmir Shaivism “The practitioners of nondualistic Kashmir Shaivism came to view the world as absolute Consciousness, which they called Shiva. This Consciousness, being both one and free, creative and self reflective, was revealed as the fundamental I, or Divine Self. Thus, Kashmir Shaivism emphasizes the inner Self. The systematic growth of Kashmir Shaivism unfolded as practitioners reflected on the nature of the highest reality, describing it as pure Consciousness.” I have not read anything by Wendy Doniger yet. I looked on Amazon and read some of the reviews about her book, “On Hinduism.” It has 48% 1 stars and only 21% 5 stars. She is a Professor of Religions so I don’t dismiss her and since I like to read all sides of an issue maybe I’ll read her book, but right now I’m into the Yoga of .Kashmir Shaivism Now if the Shourd is proven to be authentic that would put it in a new ball park. I don’t know either way but I kind of like the Kashmir Shaivism idea that the person before me, like me, is part of the divine. And if I can suppress the ego I can find self and the divine within me..","date":"2015-04-27","mins":"11:51 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-197822","author":"john_green","post":"Louis Maybe you missed it in my first post on this. I repeat, “I don’t believe in their gods, or that we are born again but this helps me understand the Bible better.” I can pick apart things they believe in and I can do the same for what Christains believe in. What you are saying is as wrong as if I was to say the Catholic Church believes it ok for priest to have sex with young boys and they will just cover it up. And guess what a Christain nation ruled India untill 1947, shall we blame them for all the problems india on Christains? How about all the suffering evil people caused in the name of Christ, does the Spanish Inquisition ring a bell? Louis give us your data that supports your claim that believing believing that the person before me, like me, is part of the divine is the reason for so much suffering in India. Using you logic I could never lose at the race tract because I noticed that every horse that wins has a jockey on it so all I have to do is bet every horse with a jockey. Kashmir Shaivism teachs that before you can come to the divine in you must get go beyond ego and come with love and forgiveness to others. How is that not Christ like? I don’t know where you are getting your information from, but it’s wrong. Here, how’s this; “One may amass wealth with hundreds of hands but one should also distribute it with thousands of hands. If someone keeps all that he accumulates for himself and does not give it to others the hoarded wealth will eventually prove to be the cause of ruin.” Atharva Veda 3: 24 25 Is that Un Christ like? PS I went to Catholic school when I was a kid, but I don’t let any group or person do my thinking for me. I do my own research and decide for myself what works for me..","date":"2015-04-28","mins":"5:54 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-197834","author":"john_green","post":"Louis You’re right, I don’t understand you. Here’s what you wrote “This “inner self” concept you refer to leads to selfishness and that is the reason for so much suffering in India, with millions of beggars.” I’m still waiting for your data of that. Maybe that person kicking the begger was a Christain. It appears you don’t understand the concept. To find the “inner self ” is to go beyond the ego, it’s the ego that causes all these problem, not the teachings. Just because all Hindus don’t follow all the teachings of Hinduism does that make the teachings bad? Hey, guess what, not all Christians follow the teachings of the Bible, are the teachings wrong? Isn’t that why Jesus came? You do know that the peak of poverty in Indea was in the 1920’s under the rule of a Christian nation. Gandhi led the way to get rid of that Christain nations wrongs, oh and he was a Hindu. THE USA is a claimed Christian nation. We have lot of people homeless, we bomb other people, Long at all the people we killed in that war in the 60’s. Children go to bed without food, we shot unarmed people, the 1% control almost everything. India is growmg fast, more and more people are getting jobs. India is very young under non Christian rule. When the USA started Christians owned blacks and beat and killed them. Oh and the KKK, the group that killed blacks at will was a Christain group. Shall I can go on and on Louis. Shall I tell you how many, “Christains” commit horrible crimes all over the world? Shall I say that the teaching of Jesus theoretically sounds fine, but in practice it doesn’t work? You want to tell us what Jung said I can tell you what Bart D. Ehrman wrote. Why waste the time? Oh and Chriatians have contradictory beliefs also. Louis you may believe that only what you believe is valid, that’s fine. I don’t believe I and only I hold the truth and only my way is the right way. Many of the things I believe may be proven wrong. I just telling what works for me..","date":"2015-04-28","mins":"8:16 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-197840","author":"john_green","post":"Louis I can go into detail the contradictory beliefs of the Bible and science and known facts, but I’m not going to do that. I did that for years and I have nothing to show for it. I believe that many belief systems have a lot in common and I’m trying to bring belief, science and consciousness together. This is taking for that so I will end my comments here..","date":"2015-04-28","mins":"8:39 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-192093","author":"john_green","post":"O.K. Wikipedia is totally unreliable by itself, this is well known. Http://www.dailymail.co.uk/sciencetech/article 2131458/Up articles Wikipedia contain factual errors.html http://www.catholicplanet.org/articles/wikipedia errors.htm.","date":"2015-03-01","mins":"7:48 am","url":"https://shroudstory.com/2015/02/28/hints-about-shroud-of-turin-episode-in-cnn-series/","cat":"press_coverage","title":"Hints About Shroud of Turin Episode in CNN Series"},{"id":"comment-189113","author":"john_green","post":"If you do a lot of reviews and they are helpful to customers Amazon will send you books (and products) for review before they are released to the public. Http://www.amazon.com/gp/vine/help.","date":"2015-02-04","mins":"11:45 am","url":"https://shroudstory.com/2015/02/04/a-most-anticipated-book-of-spring-2015-about-the-shroud-of-turin/","cat":"books","title":"A Most Anticipated Book of Spring 2015:  About the Shroud of Turin"},{"id":"comment-189338","author":"john_green","post":"Yeah Charles that is a big problem. In a sense Amazon is paying these reviewers with free stuff. I have also noticed that most times the first 5 reviewers are all 4 and 5 stars. If I read the author before and I like his/her work I may order a book just based on that without any reviews. If not I wait until it gets 1 and 2 star reviews before I read any of them..","date":"2015-02-05","mins":"8:11 am","url":"https://shroudstory.com/2015/02/04/a-most-anticipated-book-of-spring-2015-about-the-shroud-of-turin/","cat":"books","title":"A Most Anticipated Book of Spring 2015:  About the Shroud of Turin"},{"id":"comment-184018","author":"john_green","post":"Book are sent to some people to review before the publication dates. I’ve read reviewers stating that many times on Amazon. Unless I’ve read other books by the same authors I limit my buying a book unless there are over 30 reviews and I like a book with both bad and good reviews. I always read the one and two star reviews first. I feel that no matter what an author writes there will be some people that disagree with it and if I see none I question all the other 5 stars reviews..","date":"2015-01-17","mins":"7:21 am","url":"https://shroudstory.com/2015/01/16/book-the-physical-death-and-resurrection-a-surgeons-view/","cat":"books","title":"Book:  The Physical Death and Resurrection: A Surgeon’s View"},{"id":"comment-184030","author":"john_green","post":"BTW here’s an interesting book just exposed “Boy Who Came Back From Heaven.” Many times I find reading the reviews are as entertaining as reading the book..","date":"2015-01-17","mins":"8:01 am","url":"https://shroudstory.com/2015/01/16/book-the-physical-death-and-resurrection-a-surgeons-view/","cat":"books","title":"Book:  The Physical Death and Resurrection: A Surgeon’s View"},{"id":"comment-95148","author":"john_green","post":"Yeah, it sounds more like Eastern Philosophy or new age stuff..","date":"2014-03-31","mins":"6:06 am","url":"https://shroudstory.com/2014/03/30/john-klotz-wants-your-feedback/","cat":"books","title":"John Klotz Wants Your Feedback"},{"id":"comment-158873","author":"john_green","post":"John, You have to get some press. Maybe do a press release or 2. Maybe get on TV. Good luck..","date":"2014-10-03","mins":"9:25 am","url":"https://shroudstory.com/2014/10/02/new-book-the-coming-of-the-quantum-christ/","cat":"books","title":"New Book:  The Coming of the Quantum Christ:"},{"id":"comment-158932","author":"john_green","post":"PBS has a show, ” Religion & Ethics” they may be interested..","date":"2014-10-03","mins":"1:24 pm","url":"https://shroudstory.com/2014/10/02/new-book-the-coming-of-the-quantum-christ/","cat":"books","title":"New Book:  The Coming of the Quantum Christ:"},{"id":"comment-202950","author":"john_green","post":"John Klotz In Marilyn Schlitz’s new book, “Death Makes Life Possible” she has an interview with Hameroff and they are talking about what happens at the time of death. Hameroff ” As the heart stopped, and the blood stopped flowing, and the blood pressure pretty much went to zero, this number dwindled down to about zero, and the heart stopped. But then in seven out of seven cases that Chawla studied, there was a sudden burst of brain activity that turned out to be gamma synchrony. This is a correlane of consciousness, that lasted anywhere from ninety seconds to twenty minutes in one case” Interesting. Years ago I was reading a book by VS Ramachandran and he wrote about, “mirror neurons.” I found that to be very interesting, but I put it aside to study other things. Now since I started studying the yoga of Karhmir Shaivism I’m coming back to it and the idea that we are all really one and everything is consciousness. Here is a clip about mirror neurons. You may find it interesting..","date":"2015-06-20","mins":"12:19 pm","url":"https://shroudstory.com/2015/06/19/paper-chase-offensive-coins-heads-or-tails/","cat":"paper_chase","title":"Paper Chase:  Offensive Coins? Heads or Tails?"},{"id":"comment-173114","author":"john_green","post":"You already have had serious challenges here..","date":"2014-11-26","mins":"9:54 am","url":"https://shroudstory.com/2014/11/25/environmental-study-of-the-shroud-in-jerusalem-videos/","cat":"video","title":"Environmental Study of the Shroud in Jerusalem Videos"},{"id":"comment-203195","author":"john_green","post":"Daveb wrote, ” I think I have some competence in being able to make useful comments on many of these topics. ” We may agree or disagree on some points Dave, but I agree with your statement above..","date":"2015-06-22","mins":"8:19 am","url":"https://shroudstory.com/2015/06/19/paper-chase-offensive-coins-heads-or-tails/","cat":"paper_chase","title":"Paper Chase:  Offensive Coins? Heads or Tails?"},{"id":"comment-193196","author":"john_green","post":"Scholars like Robert Eiseman would disagree with you on that. Also Josephus wrote that James was the brother of Jesus..","date":"2015-03-12","mins":"6:32 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"id":"comment-193264","author":"john_green","post":"I agree. No one knows what was in Jesus’s mind when he said that. He could have figured the others were put in jail, or killed. He could have felt he had other things for James to do. R James had his hands filled as the head of the Jerusalem Church and leadership of early Christianity. The best we can say it we don’t know..","date":"2015-03-13","mins":"2:19 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"id":"comment-193201","author":"john_green","post":"Robert Eisenman covered that in his book, “James the Brother of Jesus” and Bart D. Ehrman in his book, “Did Jesus Exist?” mades the point that the language Jesus skope was Aramaic not Greek. Having said that, your own words,” full range of meaning from blood brother” means they may be correct. So Jesus, as Eisenman says Jesus may have a real brother. There is no evidence Joseph had kids outside of the ones with Mary..","date":"2015-03-12","mins":"8:05 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"id":"comment-193202","author":"john_green","post":"Oh and I think the writing on the ossuary was added by a fraud to sell it for a high price, it’s phony..","date":"2015-03-12","mins":"8:31 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"id":"comment-193481","author":"john_green","post":"There is no evidence that Mary was always a virgin. It’s very clear what the NT says all over the place. He was not a cousin because the greek word for cousin or relatives is “syggenē.” Paul wrote: Gal 1:19 But other of the apostles saw I none, save James the Lord’s brother. So Paul did not use the word brother in the generic sense at all..","date":"2015-03-16","mins":"6:11 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"id":"comment-192614","author":"john_green","post":"And NOVA on March 25 http://www.pbs.org/wgbh/nova/.","date":"2015-03-06","mins":"8:12 am","url":"https://shroudstory.com/2015/03/06/if-cnn-wasnt-enough-get-ready-for-nbc-on-easter-sunday/","cat":"television","title":"If CNN Wasn’t Enough, Get Ready for NBC on Easter Sunday"},{"id":"comment-190055","author":"john_green","post":"“Shall I repeat was i told David Goulet on February 5, 2015 at 2:13 pm?” I’m afraid you will in 50 post of 144 letters or less..","date":"2015-02-07","mins":"3:06 pm","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","title":"More Press Coverage of the Upcoming CNN Series About Jesus"}],"sudarium":[{"id":"comment-191371","author":"john_green","post":"I bet there are layers and layers of DNA on the Shroud. Countless people over the last 700 or 2000 years have touched the Shroud and they may have left their DNA on it to mix with other DNA already there. And there would be degraded DNA on it too. You touch something and you transfer DNA. How do you propose to separate all the DNA? http://www.ncbi.nlm.nih.gov/pubmed/23623709 PS If the persons touching it has any pollen on them that can be transfer too..","date":"2015-02-19","mins":"5:46 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-191431","author":"john_green","post":"Kelly, Thanks for your thoughts on this and I agree with what you wrote. I’m no expert on this either. I have more questions than answers. In fact every time I pick up a book on science, the bible or philosophy I go in with maybe have 3 questions and by the time I’m finished I may have 1 answer and 20 new questions..","date":"2015-02-20","mins":"8:03 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-215680","author":"john_green","post":"David I once posted the question of could the smoke and fire change the C14 dating. I decided to do a little research on it and I found this, ” Effects of fires and biofractionation of carbon isotopes on results of radiocarbon dating of old textiles: the Shroud of Turin.” http://www.sciencedirect.com/science/article/pii/S0305440396900096 Being unwilling to fork over $35 for the full article, and having other mysteries I’m looking into right now, I wonder if anyone here has read this and has an opinion on it..","date":"2015-12-05","mins":"8:13 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215683","author":"john_green","post":"Thanks Colin, you saved me the time to look into that..","date":"2015-12-05","mins":"9:02 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"}]}
