{"dating":[{"id":"comment-9496","author":"john","post":"Irregardless of the scientific findings or facts concerning the shroud…for some it will always remain simply “unbelievable”.They are like those who “still” do not believe that the world is round…despite all of the evidence contrary to..","date":"2012-03-21","mins":"5:33 pm","url":"https://shroudstory.com/2012/03/21/sharon-hill-should-check-out-her-facts/","cat":"carbon_14_dating","title":"Sharon Hill should check out her facts"},{"id":"comment-9791","author":"john","post":"It’s nearly time someone got the ball rolling…and it sounds at the least,like a good place to start..","date":"2012-03-30","mins":"10:22 am","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins"}],"events":[{"id":"comment-9823","author":"john","post":"I agree with Susanna…we should pray for the fool (and that is what he is according to scripture…the fool has said in his heart …etc.)whatever form our prayers should take. Conversions,however great or small,are happening around the globe by the minute.And apart from the classic conversion of St.Paul,we all know of various conversions in recent times as well.Malcolm Mugridge and his encounter with Mother Theresa immediiately comes to my mind and his subsequent book,”Something Beautiful for God”. In any case I will never underestimate the importance and power of prayer…and to take it a little further,I’d like to add something Catherine de Hueck Dorothy had said.She was a baroness of Russia and social activist who worked with the poor in Harlem N.Y.,as well as an author of many spiritual books and founder of the Madonna House, a lay apostolate in northern Ontairio,Canada(and which is now in several other countries) Anyhow,shortly after I had the good fortune of meeting and chatting with Catherine on a few occassions while she was living,I saw her being interviewed on a regular national T.V. Program in my country Canada called “Man Alive.She was asked by Roy Bonistiel,who hosted the program,the question,”How important is prayer in your life”? To this she smiled and answered quite calmly and emphatically,while looking him straight in the eye,she said,I AM a prayer”. She went on to explain in greater detail,but the gest of what she wanted to convey,was how everything we do,whether it’s housework,garden work,what have you,,,also becomes a prayer when done in the right spirit and offered to God.Yes,Susanna,I agree,that we should pray for Richard Dawkins whatever form our prayers should take..","date":"2012-03-31","mins":"11:06 am","url":"https://shroudstory.com/2012/03/31/speaking-of-issuing-challenges-to-dawkins/","cat":"event","title":"Speaking of issuing challenges to Dawkins"},{"id":"comment-11393","author":"john","post":"Undoubtedly a mysterious object indeed…and what else could it be if it had actually wrapped around the creator of the cosmos and author of life.Anything less mysterious then it already is would be unfitting..","date":"2012-05-16","mins":"4:09 pm","url":"https://shroudstory.com/2012/05/16/traveling-shroud-of-turin-exhibit-in-the-midwest/","cat":"event","title":"Traveling Shroud of Turin Exhibit in the Midwest"}],"history":[{"id":"comment-9625","author":"john","post":"I didn’t know anything about a 2002 restoration…and the use of a vacum cleaner doesn’t register in my mind.I hope there was sufficient data saved beforehand.I’m sure there is a logical explanation for this…the type of vacuming process perhaps could be one…but I am simply in disbelief and shock that such a thing could or would be allowed to happen..","date":"2012-03-25","mins":"10:46 am","url":"https://shroudstory.com/2012/03/25/comment-promoted-travertine-aragonite-limestone/","cat":"history","title":"Comment Promoted: Travertine Aragonite Limestone"},{"id":"comment-10151","author":"john","post":"Beautifuly put…and since you’ve mentioned it…I now recall from many years ago (30 or more) that another meaning from the Greek translation of Jesus’s last words,” IT IS FINISHED”, also translates to mean,”PAID IN FULL”. I’ve been sharing the news of the shroud with most anyone who will listen…and most are interested to know more.From now on I will be using that beautiful analogy of the RECIEPT and how our RANSOM has been PAID IN FULL. Happy Easter !.","date":"2012-04-08","mins":"9:53 am","url":"https://shroudstory.com/2012/04/08/the-lord-is-risen-he-is-risen-indeed/","cat":"history","title":"The Lord Is Risen! He is Risen Indeed!"}],"image":[{"id":"comment-9630","author":"john","post":"This truly does boggle the mind…and if one were to ask “What do you think would be the most devatating thing (apart from complete destruction) that could happen during the study and investigation of the shroud. ?Then I would have to answer …exactly what they already did and in the manner which they did it and was clearly pointed out in the article described by Ray Rogers. I never dreamed this could happen…and if so,only under pain of death…so to speak.I would be very interested to know more about this event and the circumstances that allowed it to happen..","date":"2012-03-25","mins":"3:23 pm","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","title":"Two thousand years of chemical history was destroyed"}],"misc":[{"id":"comment-11413","author":"john","post":"What Christians have gotten all wrong is just how decieved are some members of the faith.To no really good end do they persevere and pursue notions that are way out in left feid.Overscupulously examining articles of faith that they have no business meddling with…all to satisfy an insatiable ego in the belief that they got it right where all others have failed..","date":"2012-05-18","mins":"4:55 am","url":"https://shroudstory.com/2012/05/18/do-christians-misunderstand-heaven/","cat":"news_&_views","title":"Do Christians Misunderstand Heaven?"},{"id":"comment-5514","author":"john","post":"Too often, mankind thinks far too much of him or herself, believing that “science” is the way to all knowledge. How foolish are we, for some considered to be “so knowledgeable”, yet fail to recognize the existence of the true “Author of creation, our universe, very existence, and salvation”? Kudos to you Dr. Porter, for coming to realize and publicly admit, that you don’t know what you don’t know and can’t explain using science. In doing so, you are opening yourself up to Faith and the explanation, for things that cannot be explained, by mere mankind. God is surely stirring in heart heart, as well as your mind, and soul. Here’s to hoping that others eyes are opened to the TRUTH, even if they don’t yet see it with their very eyes, or feel with their spirit, to the core of their very beings. God Bless..","date":"2011-12-14","mins":"3:02 pm","url":"https://shroudstory.com/2010/12/14/replica-of-our-lady-of-guadalupe-enthroned-in-turin/","cat":"news_&_views","title":"Replica of Our Lady of Guadalupe Enthroned in Turin"},{"id":"comment-5515","author":"john","post":"Too often, mankind thinks far too much of him or herself, believing that “science” is the way to all knowledge. How foolish are we, for some considered to be “so knowledgeable”, yet fail to recognize the existence of the true “Author of creation, our universe, very existence, and salvation”? Kudos to you Dr. Porter, for coming to realize and publicly admit, that you don’t know what you don’t know and can’t explain using science. In doing so, you are opening yourself up to Faith and the explanation, for things that cannot be explained, by mere mankind. God is surely stirring in your heart, as well as your mind, and soul. Here’s to hoping that others eyes are opened to the TRUTH, even if they don’t yet see it with their very eyes, or feel with their spirit, to the core of their very beings. Even the hardest of hearts can soften and be changed, if they only open themselves up to the possibilities that they for too long have been denying. Often giving in to what really is, often fills the void that we often times struggle with, no matter how “advanced” our scientific methods or manners/devices of inquiry may be. God Bless..","date":"2011-12-14","mins":"3:07 pm","url":"https://shroudstory.com/2010/12/14/replica-of-our-lady-of-guadalupe-enthroned-in-turin/","cat":"news_&_views","title":"Replica of Our Lady of Guadalupe Enthroned in Turin"},{"id":"comment-9468","author":"john","post":"I have to say,you certainly can’t accuse this web site of being bias…even the most ridiculous can be heard..","date":"2012-03-20","mins":"9:26 am","url":"https://shroudstory.com/2012/03/20/the-resurrect-christ-foundation-and-the-shroud-of-turin/","cat":"news_&_views","title":"The Resurrect Christ Foundation and the Shroud of Turin"}],"opinion":[{"id":"comment-3147","author":"john","post":"Your attempt at ridiculing both parties here has failed. Epicly. Use a comb with finer teeth next time..","date":"2011-05-16","mins":"3:42 pm","url":"https://shroudstory.com/2011/05/12/richard-dawkins-and-the-end-of-the-world-may-21/","cat":"news_&_views","title":"Richard Dawkins and the End of the World May 21"},{"id":"comment-9747","author":"john","post":"Seems “cranky Catholic” forgot to add arrogant to his bio.I am also a Catholic and know of other Catholics with that same type of arrogance…they seem to feel they have a monopoly on God and think humility is for the weak.Yep,I bet he’s a real joy to work with..","date":"2012-03-29","mins":"9:37 am","url":"https://shroudstory.com/2012/03/29/the-cranky-catholic-this-shrouded-season/","cat":"other_blogs","title":"The Cranky Catholic: This shrouded season"},{"id":"comment-12979","author":"john","post":"“Children” of God….","date":"2012-06-23","mins":"6:36 pm","url":"https://shroudstory.com/2012/06/22/shroud-congresses-places-where-fantasies-are-peddled/","cat":"other_blogs","title":"Shroud Congresses – Places where fantasies are peddled?"},{"id":"comment-9510","author":"john","post":"There are still those who believe that the earth is flat…I think of them everytime Colin Berry has a comment.And irregardless of what the experts in their own fields have factually concluded or regardless of any new revelations or discoveries,as far as he is concerned…the world is FLAT…metaphorically speaking.To continue reading his comments any further,to me,would be an exercise in futility..","date":"2012-03-22","mins":"9:12 am","url":"https://shroudstory.com/2012/03/22/the-secrets-of-mfol-revealed/","cat":"other_blogs","title":"The secrets of MFOL revealed"}],"researchers":[{"id":"comment-13350","author":"john","post":"Ron and Dave…I couldn’t have said it better.Apart from the Shroud of Turin and it’s remarkable preservation and survival…what a precious and priceless treasure it is to have “the gift of faith”..","date":"2012-07-02","mins":"11:37 pm","url":"https://shroudstory.com/2012/07/02/this-is-really-just-a-lead-in-to-quoting-the-daily-mail-on-lombatti/","cat":"news_&_views","title":"This is really just a lead in to quoting the Daily Mail on Lombatti"},{"id":"comment-9473","author":"john","post":"I read just the article and found it extremely interesting..","date":"2012-03-20","mins":"10:48 am","url":"https://shroudstory.com/2012/03/20/interview-with-barrie-schwortz-in-intrepid/","cat":"news_&_views","title":"Interview with Barrie Schwortz in Intrepid"},{"id":"comment-11373","author":"john","post":"His comfort zone is of course with those who have little or no knowledge of the shroud or scriptures.And he of course cannot debate the findings of the scientist and researchers because he conveniently believes in them.They (being scientist) cannot take the luxury of claiming the burial cloth is authenticly that of Christ…whether they personally believe it is or not…because they are still intrigued and bound in trying to explain how this image came to be. This art historian is a typical opportunist and is clearly exploiting these findings to serve his own best interest….money. So they (the disciples) went into the tomb and discovered the barely noticible and faint image of Christ on the cloth.They were then so intrigued by it that they went against Jewish burial customs and law to disrespectfully kick or put the body of Christ to one side and use the shroud to found one of the greatest religions in the world.And all based solely on the “idea” of a “spiritual” resurection and not a “physical” one. This guy missed his calling…he should have been a lawyer..","date":"2012-05-15","mins":"2:47 pm","url":"https://shroudstory.com/2012/05/15/interview-with-thomas-de-wesselow/","cat":"history","title":"Interview with Thomas de Wesselow"},{"id":"comment-9580","author":"john","post":"“So take that Christians” !!! Take what ??? The fact that you’ve got an axe to grind with Christianity…or the fact that you’ve got to be the most ill informed or ignorant person to date making comments concerning the shroud.Before accusing others of being asleep perhaps you better talk to the man in the mirror first…and tell HIM to… WAKE UP !!!.","date":"2012-03-24","mins":"11:04 am","url":"https://shroudstory.com/2012/03/24/someone-who-is-not-a-fan-of-russ-breault-and-the-shroud-of-turin/","cat":"news_&_views","title":"Someone who is not a fan of Russ Breault and the Shroud of Turin"},{"id":"comment-9752","author":"john","post":"Facts… mixed with rubbish and a vivid imagination..","date":"2012-03-29","mins":"12:28 pm","url":"https://shroudstory.com/2012/03/29/press-center-for-the-sign-by-thomas-de-wesselow/","cat":"books","title":"Press Center for The Sign by Thomas de Wesselow"}],"resources":[{"id":"comment-9624","author":"john","post":"The ultimate CSI…leaving no rock unturned…one is humbled..","date":"2012-03-25","mins":"10:09 am","url":"https://shroudstory.com/2011/09/16/more-on-the-dirt-of-the-shroud-of-turin/","cat":"books","title":"More on the Dirt of the Shroud of Turin"},{"id":"comment-11543","author":"john","post":"Except that the creator in this sense should start with a capital “C”…as in Creator.Some skeptics are hard wired into not believing “anything” associated with faith or the supernatural…and their imagination is free to run wild..","date":"2012-05-22","mins":"12:10 pm","url":"https://shroudstory.com/2012/05/22/jon-jeffersons-op-ed-at-fox-news/","cat":"books","title":"Jon Jefferson’s Op Ed at Fox News"},{"id":"comment-1172","author":"john","post":"STEPHEN: John >The theory presented by Dr. Mechthild Flury Lemberg is her theory, not a fact. It is a fact, revealed first by x rays, and available for you and anyone else to see for themselves, that “every thread in the weave of the Shroud is continuous through the seam and matches its corresponding side strip thread in position, thickness, and intensity” (Adler, A.D., 1997, “Concerning the Side Strip on the Shroud of Turin“). LUPIA: You are mixed up about this report Stephen since the late Dr. Adler was attempting to prove that there is not cut and sewn seam but one continuous cloth with a tuck. STEPHEN: And it is a fact that Flury Lemberg personally examined the Shroud during its 2002 restoration and found that the Shroud’s main body and sidestrip are two separate pieces of linen joined by a seam. It is Flury Lemberg’s theory that the main body of the Shroud and its sidestrip were cut and then rejoined at the same time from a larger piece of cloth. And it seems to be the only reasonable explanation of those facts, which as far as I am aware all leading sindonologists (including Wilson and Whanger who originally proposed a completely separately woven sidestrip theory) now accept. If your theory depends on the sidestrip being a completely separately woven piece of linen added to the Shroud at a later time, then you would have to explain how two separately woven pieces of linen match so perfectly across “every thread … in position, thickness, and intensity.” LUPIA : Agreed. And the proof of this is in the book explained by (1) the asymmetry the added on side strip creates with the original Tallit arm slits. These are visible and measurable and the left side is 2cm farther from the selvage than the right side. This is a verifiable fact. Details of this are explained in my book which you will be able to grasp once you read it. (2) the threads are different in Yarns in Tex measurements. The side strip cloth is denser and heavier than the main cloth, so they actually do not match in the same thickness, and intensity (3) and the main cloth has cotton fibers inside the threads whereas the side strip does not. Please see below for a fuller explanation. STEPHEN: >The Greek lexicons you have do not put sindon = tallit for some reason. Thanks for conceding it. The “reason” is that sindon means “linen” not “tallit”! >All you have done is shown that certain Greek lexicons do not have it, which is no proof at all. They are among the leading NT Greek lexicons, including BAGD which you personally recommended to me. That you have not yet cited a NT Greek lexicon which defines sindon as “tallit” (even as a secondary meaning) indicates, given your claim of extensive research over many years into the meaning of these words, that there is no NT Greek lexicon that defines sindon as “tallit.” LUPIA: That is incorrect. I have now pointed to the sources that do show this to be the correct meaning of sindon after the reviewer cited them in her review; Lightfoot and Jastraw and you still have not yet checked those sources but continue to deny the truth and insist it is wrong. Why? Please do yourself a favor and check out Lightfoot and Jastraw. This is now the third time. First when you read the review and failed to check and now twice I am asking you to do the same. STEPHEN : >… you refer NOW to the dimensions of the Shroud from the Restoration in 2002 something you NEVER knew until I pointed it out to you. The same is true about the theory proposed by Dr. Flury Lemberg, which you NEVER knew until I pointed it out to you. And I thanked you at the time for your correcting me on these points. But it is not true that I “NEVER” knew them. As I stated later in a previous comment: But Googling on “Turn [sic] Shroud: Past, Present and Future” and “seam” I found a report (which I already had on my computer but had forgotten) on this in the BSTS Newsletter of June 2000 … That is, I actually had previously read that dimensions and side strip information in the BSTS Newsletter, No. 51, June 2000 and had saved it to my computer but had temporarily forgotten it. Anyway, this is another of your ad hominem fallacies of irrelevance. Although I had read this information previously and saved it to my computer, but had temporarily forgotten it, it is irrelevant to the truth of this matter, whether I personally did or did not know about it before you pointed out to me. LUPIA: Not really. Anyone claiming to be a Shroud expert would not have made that mistake regardless. Do not take it personally. It is not an ad hominem, just an observation. STEPHEN: >Raes … is the expert who did find cotton inside the threads at the time of spinning NOT weaving. Agreed. But it was only minute traces of cotton that he assumed was due to the Shroud being woven on the same loom (quotes can be supplied), not to the Shroud being intended to be a mixture of linen and cotton. And further research has suggested that the cotton in Raes’ sample, which was from the same contaminated corner of the Shroud as the radiocarbon dating sample was taken, was part of a rewoven patch, and there is no cotton in the Shroud itself. LUPIA: Stephen you have it all wrong about the two published reports by Raes. This error is widely published in Shroud literature as cotton got on the threads from the loom. This is completely false. That was never published by Raes but it did manage to widely circulate in Shroud literature as misinformation. According to Raes two reports which I have read he definitely says the cotton got into the linen yarn as the thread was spun. The cotton is inside the threads of the main cloth of the Shroud but not in the side strip. Anything else you have read is misinformation. Also, independent researchers have also confirmed that the Raes samples of the main cloth do contain cotton fibers inside the threads. Please read the two reports published by Gilbert Raes. Additionally, some of the independent researchers who found the cotton no longer hold the invisible weave theory as a strong argument but see that it is contradicted by other scientific evidence. I thought the patch theory was viable at one time but after lengthy discussions with Dr. Flury Lemberg I abandoned the patch theory completely. STEPHEN: >All biblical evidence supports my thesis since my thesis is based primarily on the biblical evidence. But you would need to read my book to find that out. Gail has read your book and I was responding to her review. If she got it wrong, then take it up with her. LUPIA I do not follow what you are saying. I did not find the review claiming I did not base the thesis of my forensic study on biblical evidence. True, it is not solely based on biblical evidence since science that supports the identification is not biblical. STEPHEN: >It is rather curious that a so called proponent of authentication of the Shroud of Turin is so driven to disprove a viable thesis that proves the Shroud is authentic. I am “driven” to follow the truth wherever it leads. It is of the utmost importance that proponents of the Shroud’s authenticity, test all theories about the Shroud, whether from anti or pro authenticity theorists. The Shroud pro authenticity cause would not be helped but harmed by uncritical acceptance of a false theory about the Shroud, on the basis of that if it were true, the Shroud would have to be authentic. Apart from the ethical problem of knowingly holding a false theory because it is most convenient or effective, anti authenticity critics would eventually discover the falsehood and the Shroud itself would be discredited, especially if it were discovered that Shroud pro authenticity theorists knew about the false theory but kept quiet about it. LUPIA: I do not follow your conspiracy theory. It is an outrageous allegation that Shroud researchers would push a false theory in the news to win favorable publicity that the Shroud is authentic. This sounds more like the skeptics point of view. I know of no Shroud researcher in any country that would do as you suggested. That you think they would tells me and readers here much. STEPHEN >One is wondering whose side you are really on. You have no need to wonder. I am on the side of Him who said, “I AM the Truth” (Jn 14:6). And one of my guiding Bible texts is, “Test everything. Hold on to the good.” (1 Th 5:21). You are evidently confusing your theory with the truth, such that anyone who disagrees with your theory is not on the side of the truth. LUPIA: I wrote on March 4th “Everyone is free, then, to contradict me. I would only ask my readers for that initial goodwill without which there can be no understanding.” — Benedict XVI, Jesus of Nazareth, xxiv.","date":"2010-03-21","mins":"10:48 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"}]}
