{"art":[{"id":"comment-6312","author":"jos_verhulst","post":"According to this link http://www.tradizione.oodegr.com/tradizione index/vitesanti/marcellinopietro.htm the figure of Christ is part of a fresco with the saints Marcellinus and Peter also shown. These martyrs are said to have died in the year 302 According to this link http://archeoblog.net/2008/apertura straordinaria catacombe ss marcellino e pietro a giugno 2008/ one can get a guided tour in this catacomb. It is a wonderful painting. Remarkably, it is not depicted in “Le icone di Cristo e la Sindone” (by Coppini & Cavazzuti; 2000) that I have read just a few days ago..","date":"2011-12-30","mins":"4:25 pm","url":"https://shroudstory.com/2011/12/29/even-more-on-waldemar-januszczak-doesnt-think-the-shroud-of-turin-is-real/","cat":"art","title":"Even more on Waldemar Januszczak doesn’t think the Shroud of Turin is real"},{"id":"comment-8001","author":"jos_verhulst","post":"Here as on a number of other coins, we see these strange swellings below the beard, that correspond to the ‘object under the beard’ commented on by Petrus Soons, among others. Http://shroud3d.com/findings/solid oval object under the beard.","date":"2012-02-06","mins":"4:46 pm","url":"https://shroudstory.com/2012/02/06/another-justinian-this-one-circa-652/","cat":"art","title":"Another Justinian, this one circa 652"},{"id":"comment-18263","author":"jos_verhulst","post":"The image on the coin is also suggestive of a swollen or more prominent right cheek (at the left side on the picture)..","date":"2012-10-25","mins":"3:39 am","url":"https://shroudstory.com/2012/10/24/max-patrick-hamon-on-the-skewed-nose/","cat":"art","title":"Max Patrick Hamon on the Skewed Nose"},{"id":"comment-6282","author":"jos_verhulst","post":"Is it possible to specify the catacomb where and when exactly this painting has been found? The picture seems to show some Vignon characteristics, such as the square/triangle complex on the forehead, but the low resolution does not permit accurate observation. Quite remarkable also, the hand with the thumb not shown, and with very long index..","date":"2011-12-30","mins":"3:22 am","url":"https://shroudstory.com/2011/12/29/even-more-on-waldemar-januszczak-doesnt-think-the-shroud-of-turin-is-real/","cat":"art","title":"Even more on Waldemar Januszczak doesn’t think the Shroud of Turin is real"},{"id":"comment-174299","author":"jos_verhulst","post":"The terminology is somewhat confusing. Here is a Rubens’ ‘deposition’: http://en.wikipedia.org/wiki/The Deposition (Rubens) In Dutch: ‘Kruisafneming’ vs. ‘Graflegging’; in German: ‘Kreuzabnahme’ vs. ‘Grablegung’. In English, the distinction is perhaps somewhat less clear, I don’t know. And of course, there are also paintings representing intermediate scenes, such as the transport from the Cross towards the tomb. The Antwerp painting is most often referred to (in English’) as ‘The Descent from the Cross’. The main point is, that the ‘descent from the cross’ is not described in the gospels. A fortiori, no ‘linen’ of ‘shroud’ is mentioned in connection with the descent from the cross. Rubens recycled iconographic elements that were in common use, including some kind of shroud or linen being depicted in connection with the ‘descent from the Cross’. However, this shroud or linen is unusually prominent on the Antwerp painting. Compare for instance with this painting (da Volterra) that had directly inspired Rubens:.","date":"2014-12-02","mins":"8:38 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross"},{"id":"comment-40968","author":"jos_verhulst","post":"See “Some remarks on the relationship between the Shroud of Turin and Michelangelo’s Last Judgement (Sistine Chapel)” on http://www.rubensdepot.webs.com/ especially fig.4 6.","date":"2013-08-11","mins":"10:39 am","url":"https://shroudstory.com/2013/08/08/why-dont-i-see-the-swollen-nose-in-any-of-the-art/","cat":"art","title":"Why don’t I see the swollen nose in any of the art?"}],"blood":[{"id":"comment-62391","author":"jos_verhulst","post":"Hugh Farey : The blood seems to have been chiefly identified because of the survival of erythrocytes – which are sadly lacking on the Shroud. However, Gérard Lucotte (‘Vérités sur le Saint Siaire. Etudes scientifiques récentes sur le linceul de Turin’ 2010, p.147 ff) did observe erythrocytes, and he also publishes (p.273 274) some photographs. Of course, it could be argued that one should reject these observations. But at least his report should be mentioned..","date":"2013-12-19","mins":"11:13 am","url":"https://shroudstory.com/2013/12/17/a-special-guest-posting-by-kelly-kearse-and-thibault-heimburger/","cat":"blood_studies","title":"A Special Guest Posting by Kelly Kearse and Thibault Heimburger"},{"id":"comment-11032","author":"jos_verhulst","post":"Reminds me of a curious detail that I recently noted in Giulio Fanti’s “La Sindone. Una sfida alla scienza moderna” (2009, p.175): “Recentemente, l’autore è stato informato che una crosticina di sangue, prelevata dalle polveri aspirate da G.Riggi di Numana, risulta mescolata al sudore, in quanto è ricca di cloruro di sodio” (‘recently, the author has been informed that a blood crust, found in the powder collected through aspiration by G.Riggi di Numana, turned out to be apparently mixed up with sweat, that contains very much Na Cl’). So, apparently salt has been recorded, but there was too much salt for the sample being pure blood, with the most natural explanation being that the blood was mixed up with sweat. Of course, this observation illustrates an important point: Na Cl is a very common mineral, that can result from many sources. Besides, it is also very soluble..","date":"2012-05-01","mins":"8:13 am","url":"https://shroudstory.com/2012/05/01/blood-question-wheres-the-salt/","cat":"blood_studies","title":"Blood Question: Where’s the Salt?"},{"id":"comment-14328","author":"jos_verhulst","post":"There is no ‘Lire copy’, only a ‘Lier copy’. Http://en.wikipedia.org/wiki/Lier, Belgium.","date":"2012-07-30","mins":"11:05 am","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But."},{"id":"comment-23062","author":"jos_verhulst","post":"Gérard Lucotte claims to have observed, in the micro debris aspired from the Shroud, 9 smaller erythrocytes that could be of primate/human origin (“Il s’agit sûrement d’hématies humaines” – p.150), and 55 larger ones that are not of primate origin (“elles proviennent probablement d’un grand mammifère domestique” p.179). His book also has some pictures of these red blood cells (p.273 276). Possibly this work is flawed but these claims should be addressed..","date":"2013-01-30","mins":"3:12 pm","url":"https://shroudstory.com/2013/01/30/guest-posting-by-kelly-kearse-distinguishing-human-blood-from-that-of-other-species/","cat":"blood_studies","title":"Guest Posting by Kelly Kearse:  Distinguishing human blood from that of other species"},{"id":"comment-11050","author":"jos_verhulst","post":"If I remember well (I did not look it up), in Adler’s “Orphaned Manuscript” there is a reference to Mc Crone, who found both Na and Cl, among many other elements. In any case, this salt thing is a non issue, ordinary salt being such a common substance. Nobody would accept the presence of Na Cl as a valid indication for the stains being real blood – and rightly so. One could say almost as well that the researchers had to look for the presence of water in the stains, because blood contains a lot of water..","date":"2012-05-02","mins":"1:12 am","url":"https://shroudstory.com/2012/05/01/blood-question-wheres-the-salt/","cat":"blood_studies","title":"Blood Question: Where’s the Salt?"},{"id":"comment-56291","author":"jos_verhulst","post":"I always found Mat.12:40 so remarkably precise, because of the very specific conjunction between the two specifications ‘three days and three nights’ & ‘at the heart of the earth’. Indeed, with a time span of one and a half days at some point on the surface of the earth, will correspond a total of ‘three days and three nights’, as seen from the ‘heart’ of the earth. As seen from the center of the earth, day and night always occur together, in a completely equivalent way. From that very special vantage point, a time span of 12 hours corresponds to ‘one day and one night’. In 24 hours, you wil have a day followed by a night at one side of the earth, together with a night followed by day at the opposite side; so 24 hours 2 days + 2 nights. And so on..","date":"2013-12-04","mins":"6:43 am","url":"https://shroudstory.com/2013/12/04/the-big-3-issue-or-jesus-simply-misspoke/","cat":"blood_studies","title":"The Big 3 Issue or  “Jesus simply misspoke”"},{"id":"comment-23030","author":"jos_verhulst","post":"What are we to think about the observation reported by Lucotte (“Vérités sur le Saint Suaire”, p.147 ff) on erythrocytes found on the Shroud (microscopic material collected by Giovanni Riggi di Numana) with diameters of 12.5 13 micrometer – much too large a value for human blood, according to this author..","date":"2013-01-30","mins":"6:33 am","url":"https://shroudstory.com/2013/01/30/guest-posting-by-kelly-kearse-distinguishing-human-blood-from-that-of-other-species/","cat":"blood_studies","title":"Guest Posting by Kelly Kearse:  Distinguishing human blood from that of other species"}],"dating":[{"id":"comment-51290","author":"jos_verhulst","post":"Perhaps he could also write to prof.Timothy Jull, and perhaps to others who have Shroud material that was handed to them for carbon dating..","date":"2013-11-14","mins":"11:55 am","url":"https://shroudstory.com/2013/11/14/colin-berry-is-writing-to-the-vatican/","cat":"carbon_14_dating","title":"Colin Berry is Writing to the Vatican"},{"id":"comment-196895","author":"jos_verhulst","post":"Whatever sample material that is still in the drawers at Tucson, Zurich and/or Oxford, should be used for C14 testing, in order to check whether the apparent non homogeneity of the 1988 results is a fluke or not..","date":"2015-04-20","mins":"4:49 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-10942","author":"jos_verhulst","post":"I cannot agree with the statement, that the existence of a smooth spatial trend in the data does not invalidate the conclusion. The simple fact is that such a trend, whether smooth or chaotic, should not exist. It was also not observed in the control samples. The presence of the trend proves that the experimentators were not measuring age, but something else, most probably age combined with some unknown factor x. As long as this unknown thing that was measured is not identified, no conclusion can be drawn. Stating that the age determination remains valid, implies that you already know something about the nature of the factor x that causes the trend. But the nature of that factor is completely unknown; there are only wild & uneducated guesses, and it is impossible to rationally predict the impact of factor x on an hypothetical measurement done on some other part of the Shroud. The only rational conclusion is, that a new 14 C experiment should be done, with a different protocol, involving sample taking at different parts of the Shroud, and documenting the geometry of the subsamples. Too bad that the laboratories did not document this geometry, thereby involuntary destroying evidence that they had in their hands..","date":"2012-04-29","mins":"2:18 am","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin."},{"id":"comment-10945","author":"jos_verhulst","post":"@Gabriel “I would like to stress the idea that another implication of the presence of a trend obtained from a combination of results independently obtained at different laboratories is that these labs did a good job”. There are two possible interpretations. On the one hand, there is the ‘conspiracy interpretation’, based on the fact that factor x correlates not only with a spatial gradient, but also with a temporal gradient: the measurements that were made later, also produced an older age for the Shroud. If factor x has spatial and not temporal/sequential significance, which seems by far the more probable interpretation, your conclusion is certainly valid. However, the labs did a good job only with respect to the measurements proper. They did an extremely lousy job as far as the documenting of the spatial distribution of the samples & subsamples is concerned. The statistical processing of the results was also terrible..","date":"2012-04-29","mins":"7:26 am","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin."},{"id":"comment-11493","author":"jos_verhulst","post":"Why are the feet of Christ always cut off in these reproductions of the Pray Manuscript? It would certainly be of interest to see how the feet are drawn..","date":"2012-05-21","mins":"10:42 am","url":"https://shroudstory.com/2012/05/21/or-the-artist-of-the-fake-knew-of-the-pray-manuscript-and-incorporated-these-signs-into-his-forgery/","cat":"carbon_14_dating","title":"Or the artist of the fake knew of the Pray Manuscript and incorporated these signs into his forgery"},{"id":"comment-33611","author":"jos_verhulst","post":"The samples that are still in possession of Tucson should be used. Prof. Jull should disclose how the two original samples received by the lab were cut up, and what was the position of the samples still in his possession with respect to the other samples. Those who think that the results published in 1989 show non uniformity should be permitted to make predictions concerning the outcome of the new measurements, and then these measurements should be done. The crucial point is that prof. Jull should make known how the pieces that his lab received were subdivided; he should make known the geometry of the partition of these samples. The prediction will be that the Tucson subsamples that were closer to the Oxford/Zurich samples will tend to show older ages..","date":"2013-05-13","mins":"5:01 pm","url":"https://shroudstory.com/2013/05/13/paper-chase-shroud-material-lost/","cat":"carbon_14_dating","title":"Paper Chase:  Shroud Material Lost"},{"id":"comment-28887","author":"jos_verhulst","post":"On page 208 of the book by Fanti & Gaeta there is a table mentioning the Shroud samples that are in circulation, as known by the authors. For each sample, there are five entries: (1) date, (2) material, (3) first owner, (4) second owner, (5) third owner (ie: data/materiale/1° possessore/2° possessore/ 3° possessore). Here are the ten last entries of this table: (1) 1988/pezzo di tessuto denominato ‘riserva’/custodia pontifica/ – / – (2) 1988/pezzo di tessuto/ A.J.T.Jull/Museo statale dell’Arizona/ (note:the piece mentioned above is also illustrated in the book, fig.9; it is discussed in the 2010 Radiocarbon paper by Jull & Freer Waters) (3) 2002/parte del materiale del 1978 88 (proveniente dall’aspiratore)/Fondazione 3 M. G.Riggi di Numana/ M.Alonso/G.Fanti (4) 2002/parte del materiale del 1978 88/Fondazione 3 M. G.Riggi di Numana/M.Alonso/G.Lucotte (note:Lucotte has written a book on his observations: http://www.amazon.fr/Vérités Saint Suaire Gérard Lucotte/dp/2357910178) (5) 2002/Parte del materiale del 1978 88 (proveniente dai filtri)/Fondazione 3 M/G.Fanti/M.Alonso (6) 2002/Parte del materiale del 1978 88/Fondazione 3 M G.Riggi di Numana/G.Fanti/G.Lucotte (7) 2002/Parte del materiale del 1978 88/Fondazione 3 M G.Riggi di Numana/G.Fanti/M.Antonacci A.Lind (8) 2002/Piccola parte del materiale del 1978 88/Fondazione 3 M. G.Riggi di Numana/G.Lucotte/ (9) 2002/Prelievi vari (toppe, fili, polveri, residui vari)/Custodia pontifica/ / (I suppose that this is the material discussed in the 2002 book by Mzchthild Flury Lemberg) (10) 2009/Materiale della Fondazione 3 M del 1978 88/Fondazione 3 M/Politecnico di Milano/ The authors believe that the list is probably incomplete (‘Data la difficoltà di reperire informazioni, la lista risulta probabilmente incompleta’ p.207).","date":"2013-03-30","mins":"5:21 pm","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","title":"Res ipsa loquitur:  The facts speak for themselves."},{"id":"comment-105600","author":"jos_verhulst","post":"The sample taking was done at a very specific point of time. The preparations for the sample taking started very early in the morning hours, and there has to be some explanation for this way of operating. It looks almost as if a ritual of some kind was performed, that had to be kept in accordance with the stars. Just compare the constellation of Friday 3 april 33 with the constellation at the moment of the sample taking. Of course, the null hypothesis remains, that this is just coincidence. But when further strangeness is observed, the curiousness of the timing itself should be looked at..","date":"2014-04-29","mins":"5:37 am","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","title":"Sabotage?"},{"id":"comment-50613","author":"jos_verhulst","post":"I will keep repeating that this piece has been handed to the Arizona lab for dating, and not for shelfing in some mysterious drawer. It has been stated that there is a problem with the shroud sample used for the dating of the Shroud, because the results of measurements done at the three labs suggest linear variation of the age measured as a function of the place where the measurement is done. The Arizona piece offers a possibility to check this statement. Supposing that the variation of the measured age with spatial distance is real, a prediction could be made concerning the C14 age of this piece, because its spatial position on the Shroud is known. Measurement could then validate or invalidate that prediction. Of course, it should first be checked whether the ‘mysterious Arizona piece’ really is what it is claimed to be..","date":"2013-11-10","mins":"5:58 am","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","title":"The Mysterious Arizona Piece"},{"id":"comment-24800","author":"jos_verhulst","post":"The basic problem with this paper can be illustrated starting from the sentence preceeding the conclusion: “If contamination caused a discrepancy of 15,000 years in the dating of fossil bones, the contamination identified by this paper could have caused a discrepancy of 1300 years in the Shroud of Turin”. This comparison between a shift from 35,000 years to 50,000 years on the one hand, and a shift from 700 years to 2000 years on the other hand, is simply inadequate. In a sample of age 700, about 88% of the 14 C atoms still survive; in a sample of age 2,000, about 70% of the original 14 C atoms did not decay. Ir order to push up the percentage from 70% to 88%, and using a recent biocarbon source with 100% of the 14 C still present, about 60% of the original carbon in the sample has to be replaced by contamination mechanisms of all sorts. Of course, this replacement percentage of 60% becomes larger still when the contamination is produced by older carbon, dating from the 16th century, for example. But in a sample of age 50,000 y, only 0,00155% of the 14 C atoms survive (taking the half life = 5,700 y). In a sample of 35,000 y, 0,215% of the 14 C survives. Suppose that we use contamination material of age 5,700 y (36% of the 14 C still present). Then we need to replace only 0,55% of the carbon in the sample to produce a ‘rejuvenation’ from 50,000y=>35,000y. Of course, these are only some back of the envelope calculations but they illustrate the main problem: in very old samples, contamination can easily have a huge impact on the age measurement, because there is only very few 14 C left. But in ‘young’ samples (‘young’ a compared to the half life of 14 C) it is much more difficult to significantly alter the measured age by contamination..","date":"2013-02-19","mins":"5:52 am","url":"https://shroudstory.com/2013/02/13/special-paper-chase-new-possibilities-why-the-c14-dating-of-the-shroud-may-be-wrong/","cat":"carbon_14_dating","title":"SPECIAL PAPER CHASE: New Possibilities Why the C14 Dating of the Shroud May Be Wrong"},{"id":"comment-50632","author":"jos_verhulst","post":"First of all the piece discussed in Freer Waters & Jull, Radiocarbon 52, p.1521 1527. However, the strange characterization of that piece as given by the authors should be checked & cleared up. If more pieces turn up that could be associated with a precise location on the Shroud, and that are in the possession of Donahue or perhaps other people (who knows?), then that material should also be used. But firstly, these additional piece(s) should return to the lab and their history & provenience should be fully documented. Then a research plan can be established..","date":"2013-11-10","mins":"10:29 am","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","title":"The Mysterious Arizona Piece"}],"events":[{"id":"comment-34412","author":"jos_verhulst","post":"This ‘witness principle’ is very important indeed. Look it up in John: two witnesses are required (Joh.8:16 18). In Joh.19:38 42 there are two men that put Jesus in the grave. In John 20:1 11, there are again two men verifying that the grave was empty. Thereafter, in John 20:11 20, things take a more spiritual turn. There are now two angels in the grave. These angels are a spiritual reflection, of the double image on the Shroud. Have a look at the text. These angels were white, as the Shroud was. They were where the body of Christ was, each at one end of that place. And what they speak out is the logical conclusion, that must have been formed ,bit by bit and very gradually, in the head of Maria M., when she saw the image on the Shroud. These two angels are at the same time a representation of the Shroud, and those who speak out what the Shroud means as a witness. Tom Tracy is right. Note that this ‘two witnesses’ principle continues, in a very surprising way, in John 20:19 29, where Thomas the Twin speaks out..","date":"2013-05-23","mins":"5:07 am","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","title":"A kind of witness?"}],"history":[{"id":"comment-55680","author":"jos_verhulst","post":"The 3 shaped bloodmark on the forehead is interpreted as a literal reference to the number three (9:40). However, Hindu numerals did not yet exist at the first century..","date":"2013-12-03","mins":"10:22 am","url":"https://shroudstory.com/2013/12/03/translation-when-you-come-bring-the-shroud-of-turin/","cat":"history","title":"Translation: When you come, bring the Shroud of Turin"}],"image":[{"id":"comment-16939","author":"jos_verhulst","post":"I just finished the new book by Thomas Nagel “Mind & Cosmos. Why the materialist neo Darwinian conception of nature is almost certainly false” Oxford UP. Nagel has three good chapters on consciousness, cognition, and value, respectively. For the happy few who are able to read Dutch, there is also this one: http://rothbard.be/bestanden/boeken/HVV web.pdf.","date":"2012-09-26","mins":"8:03 am","url":"https://shroudstory.com/2012/09/26/how-can-physics-and-chemistry-account-for-consciousness/","cat":"other_blogs","title":"How can physics and chemistry account for consciousness?"},{"id":"comment-16","author":"jos_verhulst","post":"The pyrolysis front would be formed by a great number of paths spreading out away from the contact region. Each of these paths will come to a halt abruptly and randomly. The overall result will be a halo of kinds, a set of longer and shorter scorching paths spreading out from the contact region, with the global outlook being something like a fractal halo thinning out with distance. Crucially, it should be explained how such a mechanism could reproduce a scorching signal that weakens with increasing shroud metal (or shroud body) distance. The distance between a non contact point and the contact area is not proportional to the distance between that same point and the metal (or the body). Anyway, I think that your theory can be tested in a very simple way. According to your model, ‘islands of oxidation’ (that is, small islands of scorched fiber surrounded by intact fibers) in image areas without direct contact between shroud and body, cannot possibly occur. This is a claim that could be falisfied by showing a counter example..","date":"2012-02-18","mins":"6:12 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/18/the-shroud-of-turin-lets-focus-on-that-hemicellulose-coating-on-the-linen-fibres-it-could-explain-a-great-deal/","cat":"cellulose","title":"The Shroud of Turin – let’s focus on that hemicellulose coating on the linen fibres … It could explain a great deal"},{"id":"comment-14","author":"jos_verhulst","post":"“The scorching will initially be confined to those parts of the fabric that are in IMMEDIATE contact with the hot metal…”. This seems to imply that the image would consist of a set of contact points or contact areas (where maximal oxidation occurs) that is surrounded by a halo fading out as a function of the distance to the contact area. There would be no relationship connecting, at a given point of that halo, the intensity of the image to the distance separating shroud and hot metal surface..","date":"2012-02-18","mins":"3:38 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/18/the-shroud-of-turin-lets-focus-on-that-hemicellulose-coating-on-the-linen-fibres-it-could-explain-a-great-deal/","cat":"cellulose","title":"The Shroud of Turin – let’s focus on that hemicellulose coating on the linen fibres … It could explain a great deal"},{"id":"comment-14798","author":"jos_verhulst","post":"I do not believe in Rogers’ Maillard hypothesis, because of the unicity of the image on the Shroud of Turin. Rogers’ theory implies that, in the case of the Shroud, there was a very unusual set of physico chemical conditions occurring together by mere chance and allowing the development of this very special image. However, it is extremely improbabe that (a) the only known case of such an extraordinary image is also an unbelievably complete (frontal & dorsal!) one (for every single complete image, we should expect the occurrence of a plethora of partial images – for instance, from a single hand or leg), and (b) it is improbable to the extreme that the only image thus produced also pops up in connection with the very special man who also happens to have the largest impact ever on human history (one expects that this single image, if produced by mere chance, should be connected with some random burial, and not with Golgotha). This being said, I think that Colin Berry should develop his argument starting from a more complete global representation of the Maillard reaction. For instance, during the different steps gaseous products (water and carbon dioxide) are produced and these should be taken into account. Already during the first condensation step, water is split off, thereby increasing the entropy of the reaction products & pulling the reaction towards the right..","date":"2012-08-11","mins":"4:57 pm","url":"https://shroudstory.com/2012/08/11/colin-berry-so-how-could-ray-rogers-have-got-it-so-wrong/","cat":"image_theory","title":"Colin Berry: So how could Ray Rogers have got it so wrong?"},{"id":"comment-17238","author":"jos_verhulst","post":"For those who need it: http://www.pdfunlock.com/.","date":"2012-10-05","mins":"7:06 am","url":"https://shroudstory.com/2012/10/05/paper-chase-lavoies-paper-from-frascati/","cat":"image_theory","title":"Paper Chase: Lavoie’s Paper from Frascati"},{"id":"comment-16494","author":"jos_verhulst","post":"I fear that doing such an experiment will be a waste of time & money, given that the hypothesis is extremely unlikely a priori, for simple logical reasons. Every hypothesis on the production of the Shroud image should take into account the uniqueness of the image on the Shroud. The Maillard hypothesis proposes a cause for the image that could operate as well on other shrouds; there is no reason why this unique image should happen to be the image of Christ, no less. Neither does this hypothesis, or other hypotheses of the same grain, explain why the image is so surprisingly complete. A viable hypothesis has to take into account, in one way or another, the fact that the image on the Shroud is not the image of some random person, but a complete image of Christ (or at least of somebody sharing a plethora of characteristics with Christ). It is because the image refers to Christ that it can be interpreted as a *sign*, namely as a sign of the ressurection, and a viable theory on the image should explain this particular aspect of the image. Consider also the following. The fact that the image is unique implies that the windows for the physico chemical conditions needed for its production are very narrow; otherwise more such images should be known. But the conditions (ventilation, gravity, pressure of the body on the Shroud…) were certainly different at the upper side resp. The lower side of the body. Nevertheless, the quality of the image is about equal for both sides of the body. The explanation of the image should account for the fact that (a) this is the image of Christ (or a lookalike) and (b) the image is complete and its quality is about equal for both sides of the body. The Maillard theory fails on all these points..","date":"2012-09-19","mins":"2:12 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","title":"Latest on David Rolfe’s Site on Maillard Reaction"},{"id":"comment-11257","author":"jos_verhulst","post":"But there nothing wrong, absolutely nothing wrong, with this lacking of a ‘consensus’. If people want to debate the shroud, they should do so as rational individuals, with each individual thinker pondering the evidence and developing careful reasoning. That’s all that there is to a scientific discussion. Thinking that the position of a protagonist moves somehow closer to the truth, or becomes more trustworthy or reliable, when it is backed by a ‘consensus’, is completely absurd. ‘Consensus’ is for those who believe, not in the power of truth and reason, but in the power of number and amount. This whole consensus thing should be dropped..","date":"2012-05-10","mins":"6:50 am","url":"https://shroudstory.com/2012/05/10/richard-dawkins-challenge-no-consensus-on-the-image-substrate/","cat":"image_theory","title":"Richard Dawkins Challenge:  No Consensus on the Image Substrate"},{"id":"comment-11094","author":"jos_verhulst","post":"It is a bad idea to refer to a ‘consensus’ when making a scientific point. One should not try to add weight to a statement by referring to an underlying ‘consensus’. Truth has nothing to do with ‘consensus’ and the expression ‘scientific consensus’ is, at the bottom, simply a contradictio in terminis. ‘Group think’ cannot be; thinking & judging is, by its very nature, an individual activity..","date":"2012-05-03","mins":"12:00 pm","url":"https://shroudstory.com/2012/05/03/so-is-ray-rogers-hypothesis-out-the-window-by-consensus/","cat":"image_theory","title":"So is Ray Rogers’ Hypothesis Out the Window by Consensus?"},{"id":"comment-14867","author":"jos_verhulst","post":"Again, it should be noted that the gist of the argument offered by Colin Berry is this one: “However, one can always fall back on first principles, and write the Rogers reaction as follows: Putrefaction amines (gases) + reducing sugars from starch etc (solid) — > Maillard reaction products (solid) Straightaway one sees that the entropy change is in principle unfavourable, since it involves a disordered gas reacting to form a more ordered solid.” This seems to be wrong, as far as I can see, because there will be small gaseous products that should appear on the right side of this reaction scheme..","date":"2012-08-13","mins":"2:50 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature."},{"id":"comment-14921","author":"jos_verhulst","post":"As I already noted elsewhere, the Maillard hypothesis implies that the image came into existence accidently. It could have been produced as well in some other grave, if only the required physical and chemical conditions by chance were present. There is no special reason why an image thus produced should have formed on the very shroud that envelopped the body of Christ. Neither is there any special reason why the image should be so complete, front & back, although the physico chemical conditions would have been somewhat different at both sides of the body. There is no second example of such an image; not even an image of one single hand or finger is known. Nevertheless, we are supposed to accept that the only one image that came into existence in this natural and accidental way happens to be both a *complete* body image that concerns, moreover, not some random person, but Christ himself. All this is extremely unlikely. A rational explanation should also explain why this unique image is connected with Christ, and why this image is so ‘well done’ (ie why it is so complete)..","date":"2012-08-14","mins":"5:16 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature."}],"misc":[{"id":"comment-195420","author":"jos_verhulst","post":"I am very pleased to find here this wonderful work that is one of Rubens’ main paintings in Our Lady’s Cathedral, Antwerp (my hometown). Together with the two side panels, it encodes for Sunday, April 5, 33 AD, as the date of the Resurrection..","date":"2015-04-05","mins":"8:11 am","url":"https://shroudstory.com/2015/04/05/easter-2015/","cat":"2015","title":"Easter 2015"},{"id":"comment-18975","author":"jos_verhulst","post":"Some remarks here: https://docs.google.com/open?id=0 Bzmu3 L630 O0f Tmd VU0c4 O Uh5 Uk0.","date":"2012-11-11","mins":"5:28 pm","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?"},{"id":"comment-19196","author":"jos_verhulst","post":"Still more comments here: https://docs.google.com/open?id=0 Bzmu3 L630 O0f UUM2 Qz Vr VD Zadj Q.","date":"2012-11-19","mins":"8:12 am","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?"},{"id":"comment-19136","author":"jos_verhulst","post":"Some more remarks here: https://docs.google.com/open?id=0 Bzmu3 L630 O0f Wll OVF Rwem N Fd W8.","date":"2012-11-16","mins":"5:26 pm","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?"},{"id":"comment-19197","author":"jos_verhulst","post":"New link: https://docs.google.com/open?id=0 Bzmu3 L630 O0f Rn Rl M Tla T Fh6 Mkk.","date":"2012-11-19","mins":"9:13 am","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?"},{"id":"comment-18782","author":"jos_verhulst","post":"In order to check this surprising hypothesis, it is inadequate just to state ‘I don’t see any shroud face in this painting, therefore this seems to be just another cloudy elephant ‘. Of course you don’t see that face at a glance. If the hypothesis is true, the image is encoded. It’s secret, meaning that it will be difficult to see it. In order to check the hypothesis, a good start would be to measure the proportions of the supposed eyes, nose, and mouth, and compare the results to the same measurements made on the shroud image. A second check could be to control for pecularities on the shroud image: are these reflected in this painting? For instance: the nose of the shroud image is concave towards the left. Is this concavity also suggested by the position of Christ, who is supposed to be on the dorsum of the nose of the hypothetical ‘Sixtine face’? And so on..","date":"2012-11-03","mins":"6:50 pm","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?"},{"id":"comment-214602","author":"jos_verhulst","post":"The attacks of (9+2)/(11+2)/2001+(2×7) started at 0:00 sidereal time;Mars upon nodal axis; Paris upon Boswash axis..","date":"2015-11-14","mins":"8:06 am","url":"https://shroudstory.com/2015/11/14/paris/","cat":"news_&_views","title":"Paris"},{"id":"comment-177348","author":"jos_verhulst","post":"The core problem with the C14 test is the apparent non uniformity of the results: Oxford old, Tucson young, Zürich in between. The age seems to be a function of where along the sample strip the measurement was done. Is this anomaly for real or is it a statistical fluke? The remaining parts of the sample should be used in order to answer this crucial question. After all, these samples were given to the laboratories for C14 testing. This material was not cut from the Shroud to be filed away at the back of some drawer..","date":"2014-12-17","mins":"5:12 pm","url":"https://shroudstory.com/2014/12/16/future-testing-of-the-shroud/","cat":"science","title":"Future Testing of the Shroud"},{"id":"comment-11620","author":"jos_verhulst","post":"The problem of the apparent contradiction between the synoptic gospels and John has been resolved by Colin Humphreys in his recent book “The mystery of the last supper” (Cambridge UP 2011). Basically, Christ and his followers (and also groups such as the Samaritans and some Essenes) used the original Mosaic pre exile Jewish calendar and held their passover meal according to that calendar. At the temple, the modified post exile and ‘official’ calendar was used. The synoptic gospels refer to the non offical calendar, as is stated implicitely in Marc 14:12 (see Humphreys p.152 ff). The fact that John refers (11:55), not simply to ‘the Passover’, but to the ‘Jewish Passover’, indicates, according to Humphreys (p.162 ff), that he refers to the ‘official’ calendar. The ‘last supper’ was on Wednesday April 1st, 33, that was Passover day according to the pre exile calendar. I highly recommend the book by Humphreys; the whole argument is impossible to summarize here. As to the birthday of Jezus, it should be noted that the gospels seem to relate two different births. For instance, the genealogies in Matt.1 and Luke 3 are different, and the stories in both these gospels have but very few common elements. The possibility should be considered, that there where indeed two births. According to the esoteric christian tradition represented f.i. By the flemish painter P.P.Rubens, there are even three time points that should be taken into account: Tuesday 15 september 7 BC, 18:10; Friday 14 january 1 AD, 21u05; and Sunday 25 december 1 AD, especially 23u50 (local time, Jerusalem & surroundings, julian calendar)..","date":"2012-05-26","mins":"10:39 am","url":"https://shroudstory.com/2012/05/26/quake-reveals-day-of-jesus-crucifixion-or-something-like-that/","cat":"news_&_views","title":"Quake Reveals Day of Jesus’ Crucifixion (or something like that)"},{"id":"comment-29757","author":"jos_verhulst","post":"For a good illustration of the problems, have a look at this: The problem is not so much with the ‘review’ part, but mainly with the ‘peer’ part. Being reviewed by ‘peers’ means being subjected to censorship by those dominating the field. ‘Peer pressure’ or ‘peer control’ is to be avoided. New types of review should be introduced. For instance, a book such as the recent one by Fanti & Gaeta could go with the online publication of all the materials, methods, codes and data, and a subsequent open (but moderated) online review process..","date":"2013-04-07","mins":"11:48 am","url":"https://shroudstory.com/2013/04/07/when-it-comes-to-the-shroud-of-turin-has-peer-review-lost-its-luster/","cat":"news_&_views","title":"When it Comes to the Shroud of Turin, Has Peer Review Lost its Luster?"},{"id":"comment-52243","author":"jos_verhulst","post":"Margherita Guarducci was a genius. In my view, her main achievement remains the recovery of the exact date of St Peter’s death (13 October, 64)..","date":"2013-11-21","mins":"5:08 am","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","title":"Where to begin?  First pour two cups of coffee or a full pint or . . ."}],"opinion":[{"id":"comment-214348","author":"jos_verhulst","post":"The often parroted claim “extraordinary claims require extraordinary evidence” makes no sense. Every claim on truth, whether trivial or ‘extraordinary’, should be backed by sufficient evidence..","date":"2015-11-07","mins":"7:28 am","url":"https://shroudstory.com/2015/11/07/a-guest-posting-by-o-k/","cat":"guest_posting","title":"A Guest Posting by O.K."},{"id":"comment-201333","author":"jos_verhulst","post":"The fact that we don’t have a lot of burial cloth from antiquity seems immaterial. There is no reason to restrict observations to antiquity. Every single day, there are tons of new cases of death human bodies having been in contact with textiles of all possible kinds, under widely different conditions of humidity, temperature, ventilation, duration etc. No image forming ever seems to occur. IF (note the conditional) the shroud image is genuine and IF it has been produced when the linen was in contact with the dead body, then it would be an extremely exceptional object indeed. And it would be extremely unlikely that this unique & supposedly fortuituous image formation would have occurred in connection, not with some random person, but with Christ himself. There is still a second exceptional aspect: the image of the body, both front side and backside, is *complete*. A natural and accidental process is expected to produce many partial and incomplete images for every single complete image. That the only image known is at the same time also a complete image is exceptional as such..","date":"2015-06-08","mins":"10:22 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"id":"comment-208608","author":"jos_verhulst","post":"Here are UAH satellite temperatures: http://nsstc.uah.edu/climate/2015/june2015/june2015 GTR.pdf Global climate trend since 1978 (=start of satellite measurements): .11°C/decade. Seems the end of the nonsense is not near at all..","date":"2015-08-20","mins":"7:41 am","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","title":"The End if Near"}],"researchers":[{"id":"comment-191568","author":"jos_verhulst","post":"‘Destructive tests’, including C14 tests, can be done without any additional destruction of the Shroud, because there are still a number of unused samples out there. Especially the smaller piece that has been given to the Tucson lab: this sample should be used to test whether the age gradient observed in the 1988 measurements (Oxford old, Zürich in between, Tucson young) is real or not. This gradient is an objective, unusual and very disturbing aspect of the 1988 C14 dating, and the publication in Nature looks as if the phenomenon has been swept under the rug by the authors on purpose (I say: ‘looks as if’; this is not an accusation). In order to set the record straight, the authors should use the samples that they still possess to clear out this point. They should present a research plan, including a description of the samples that still exist, and a scheme of the statistical tests to be performed for checking the existence vs. Non existence of the gradient. Why is this not done? Where are these residual samples right now? Why the silence?.","date":"2015-02-22","mins":"11:52 am","url":"https://shroudstory.com/2015/02/22/bruno-barberis-interview-the-only-serious-and-honest-behavior/","cat":"news_&_views","title":"Bruno Barberis Interview: ‘The only serious and honest behavior’"},{"id":"comment-28702","author":"jos_verhulst","post":"@ Hugh Farey “The Vatican Insider article says categorically that the samples were from 1988, while Fanti’s own 4 point defence refers to 1978.” According to the very last page of the appendix (written by Marco Conca) the samples were collected both in 1978 and 1988: “In sintesi, i campioni pervenuti a Fanti provengono da cinque filtri, depositati da Giovanni Riggi di Numana presso la Fondazione 3 M, che contengono polveri aspirate dall’ intercapedine fra Sindone e ‘tela d’ Olanda’ nel 1978 (‘filtri e f g h) e net 1988 (‘filtro i’)”. This appendix documents the source and history of the samples, and it does so in an entirely satisfying way. The comments by the ‘Centro internazionale di Sindonologia di Torino’ are unreasonable. There can be little doubt that they did not even read the juridical documentation presented by Marco Conca in the ‘appendice’ (p.207 221). I am still working my way through this book, but my first impression is that it is excellent, and bursting with new ideas..","date":"2013-03-29","mins":"7:58 am","url":"https://shroudstory.com/2013/03/29/barrie-schwortz-biggest-issue-so-far-seems-to-be-the-validity-of-fantis-samples/","cat":"news_&_views","title":"Barrie Schwortz:  Biggest issue so far seems to be the validity of Fanti’s samples"},{"id":"comment-57229","author":"jos_verhulst","post":"Zugabe being wrong does not prove Barbet being right. The observation by Bevilacqua ea (‘Do we really need new medical information about the Turin Shroud?’ Injury 2013; p.2) should also be taken into account. According to the test performed by these authors, ‘…the nails pierced the space between the radial, scaphoid and lunate bones…’.","date":"2013-12-08","mins":"6:40 am","url":"https://shroudstory.com/2013/12/08/barbet-vs-zugibe/","cat":"other_blogs","title":"Barbet vs Zugibe"},{"id":"comment-29003","author":"jos_verhulst","post":"As a matter of fact, Fanti & Gaeta point the way for checking the validity of the C14 test. The problem with the 1988 test is that the results are not homogeneous, and that this lack of homogeneity has been hidden from view by the authors of the 1989 paper. However, Fanti (p.76 77 in the book) points out again the well known fact that the second, smaller part of the sample given to the Tucson lab has never been used for C14 dating. Importantly, according to the authors,the fact that it was this smaller part that was left untouched, was first concluded from their statistical analysis of the 1988 observations; this conclusion was then confirmed by prof. Timothy Jull from the Tucson lab (the key sentence is on p.76 of the book:”Dopo questi risultati il professore Timothy Jull, direttore del laboratorio di Tucson, in una comunicazione personale al professor Fanti ha ammesso che la parte di telo T2 non fu mai datata dal laboratorio dell’univeristà dell’Arizona, confermando così indirettamente l’elevato grado di attendibilità dei resultati ottenuti tramite la statistica robusta”). If indeed the results are not homogenous, but are showing a linear trend, then a clear prediction can be made concerning this sample that is still in Arizona. If the linear trend is real, then this sample should produce an age that exceeds the previous Arizona measurements in a significant way. This untested sample can be predicted to show an age superior to the values previously measured in Oxford, Zurich and, above all, in Tucson. So instead of arguing and speculating, why not just proceed to a further measurement? After all, the sample is there, and it has been given to the Tucson lab in order to date the Shroud..","date":"2013-04-01","mins":"9:39 am","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","title":"Alan Boyles Cosmic Log on Fanti’s New Book"},{"id":"comment-57221","author":"jos_verhulst","post":"Anomymous : What I was talking about was dating Fanti’s sample with C14, not Julls’ samples. Fanti’s samples seem to be far too small for C14 dating..","date":"2013-12-08","mins":"5:05 am","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-57220","author":"jos_verhulst","post":"John Klotz : Dating Jull’s samples at Arizona won’t solve anything because the issue is the anomalous nature of the samples which skewed the results. Obviously Jull’s samples would have the same discredited characteristics. Any new testing would have to be of representative material and probably from more than one site. On the contrary, dating the Arizona sample(s) could resolve the question, whether there exists a spatial gradient in the apparent age (as measured by the C14 method) of the Shroud textile. The existence of such a gradient is suggested by the 1988 results..","date":"2013-12-08","mins":"5:03 am","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-9778","author":"jos_verhulst","post":"In the ‘key points and evidence’ section it is claimed that the observation “the Pray Codex miniatures prove the cloth was in existence prior to 1192, long before the date indicated by the carbon dating” is among the “…own findings” made by Thomas de Wesselow. Isn’t this somewhat absurd? There are a great many books where the same claim has already been made..","date":"2012-03-30","mins":"2:31 am","url":"https://shroudstory.com/2012/03/29/press-center-for-the-sign-by-thomas-de-wesselow/","cat":"books","title":"Press Center for The Sign by Thomas de Wesselow"},{"id":"comment-18302","author":"jos_verhulst","post":"He also says, and rightly so, that the ‘volto santo’ of Manoppello IS a painting..","date":"2012-10-25","mins":"5:32 pm","url":"https://shroudstory.com/2012/10/25/must-listen-thomas-de-wesselows-talk-at-shroud-enigma/","cat":"art","title":"MUST LISTEN: Thomas De Wesselow’s talk at Shroud Enigma"},{"id":"comment-9617","author":"jos_verhulst","post":"Apparently, there was also an interview in the flemish newspaper ‘De Standaard’ http://www.standaard.be/artikel/detail.aspx?artikelid=MM3 NSNTH The Dutch translation comes out together with the English version..","date":"2012-03-25","mins":"6:54 am","url":"https://shroudstory.com/2012/03/25/telegraph-article-on-cambridge-shroudie-thomas-de-wesselow/","cat":"books","title":"Telegraph article on Cambridge Shroudie Thomas de Wesselow"},{"id":"comment-14753","author":"jos_verhulst","post":"“…his entire human reality (body, spirit and soul)”?!? This seems a very strange statement coming from a catholic, because the Catholic Church seems to reject trichotomy (=> the human being encompasses a body – soma , a soul psychè , and a spirit – pneuma; (1 Tes.5:23). ), with reference to the Council of Constantinople (869) See: http://www.vatican.va/archive/ccc css/archive/catechism/p1s2c1p6.htm (article 367, and note 237) Of course, there are also dissident catholics, such as Michel Fromaget, who defend the trichotomic view. Http://www.amazon.fr/drachme perdue Lanthropologie Esprit%2522 expliquée/dp/2914338279/ref=sr 1 1?ie=UTF8&qid=1344678100&sr=8 1.","date":"2012-08-11","mins":"5:42 am","url":"https://shroudstory.com/2012/08/11/yannick-clments-summa-theologica/","cat":"news_&_views","title":"Yannick Clément’s Summa Theologica"}],"resources":[{"id":"comment-12853","author":"jos_verhulst","post":"It very easy to print these papers using the following link: http://www.pdfunlock.com/.","date":"2012-06-21","mins":"5:47 am","url":"https://shroudstory.com/2012/06/21/paper-chase-the-many-papers-from-from-the-workshop-on-the-scientific-approach-to-the-acheiropoietos-images/","cat":"news_&_views","title":"Paper Chase: The Many Papers from from the Workshop on the Scientific Approach to the Acheiropoietos Images"},{"id":"comment-163804","author":"jos_verhulst","post":"At the conference in Würzburg, there was a very interesting presentation by Carolina Lutzka (‘die byzantinischen Hymnen auf das Mandylion’), on the Byzantine hymnes on the ‘mandylion’. In these hymnes, the image is characterized as having been imprinted (on a piece of textile) ‘without colour’ (achromastikon tuposas seautov) or with ‘strange colours’ (‘ksenois chromasin’). Arguably, the unknown authors of these hymnes tried to describe the unusual chromatic properties of the image on the mandylion. This suggests that the image was not perceived as being ‘painted’; paintwork implies the presence of ‘colour’ in the usual sense of that word. Incidentally, there are also numerous passages indicating that the image on the mandylion was not a face only, but a complete ‘gestalt’ (‘morphei’). That such was the case, was (on other grounds) also argued by prof.Karlheinz Dietz (‘Das Abgardbild als Ganzkörperbild’).","date":"2014-10-19","mins":"1:46 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"}],"textile":[{"id":"comment-39615","author":"jos_verhulst","post":"Piero Vercelli “La Sindone nella struttura tessile” Effata’ Editrice 2010 p.17 21 “Relazione tecnica sui rilevamenti effetuati sul campione di tessuto della S.Sindone di Torino il giorno 8 ottobre 1997” “…Ordito: viene calcolata una media di 36 fili al centimetro su tutta l’altezza del campione;” (p.18) Trama: n.25 fili al centimetro nella parte basse e n. 23 fili al centimetro nella parte alta. Viene calcolata una media di 24 trame al centimetro”(p.19) The counting was done by Piero Savarino, Pietro Vercelli and Giuseppe Vercelli (p.21). So the means given here are 36 and 24 threads/cm This corresponds rather well with the 38/26 as given by Hamon..","date":"2013-07-23","mins":"5:56 pm","url":"https://shroudstory.com/2013/07/23/max-anyone-thread-count-for-the-shroud-of-turin/","cat":"science","title":"Max? Anyone? Thread count for the Shroud of Turin"}]}
