{"art":[{"author":"josie_l_tyner","post":"dave, do you think Heaven is going to look like where you live, in New Zealand? Because if it does, I will not even be disappointed.  If the Lord wants to, he can totally forget my mansion and give me a shack in NZ. Our country is one of great beauty, but yours takes my breath away.Adolphe William Bouguereau was one of the most famous artists of the 19th century in France. His Madonnas were calculated to appeal to the sensibilities of the bourgeois French who had grown up with the tales of the “phenomena” in Lourdes and La Salette and a few other places, including Paris with St. Marie Labouret., another wax-covered cadaver.  Needless to say, “La belle vierge Marie” didn’t look anything like Maryam Bint Joachim, daughter of the house of David.  She was in all likelihood very much like the Bedouin girls living there now; diminutive, malnourished, probably toothless and possibly bow-legged because of a lack of dietary protein. Not anyone in Daumiers’s “Fourth Class Carriage” would have sat next to her, mores the pity.One of Bougereau’s finest works graces our humble San Antonio Museum of Art; “Admiration.” I got close enough to take a really good look.  This artist was so amazing he painted the veins under the clear and perfect skin with anatomical accuracy. He was voted President for Life of the Academy of Fine Arts, and rightly so. Because of his conventionality and convictions, he was nearly forgotten after Modernism, Cubism, Fauvism and all the other twentieth century “isms.”  I’m a big fan, he was awesome.","date":"October 29, 2013 at 11:29 pm","url":"https://shroudstory.com/2013/10/29/bouguereaus-mary/","cat":"art","title":"Bouguereau’s Mary"}],"blood":[{"author":"josie_l_tyner","post":"How disappointing. Whether or not contributors to this blog agree, or don’t,  most posters here are civil.  I am guilty of some pretty risqué tongue-in-cheek, but to insult Dan-no way, man. No way.  This is not the place for sectarian insults, or anti-religious diatribe, or hostility masquerading as scientific detachment.  Dan, I can’t ask you to censor anyone, but this Colin drags everyone here down to a level incompatible with intelligent debate. No one here should be calling names or attacking anyone personally, its just not the place, simple as that.","date":"October 8, 2013 at 10:48 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","title":"You guys are brutal"}],"dating":[{"author":"josie_l_tyner","post":"Just two questions for the simple, please, who have as much to gain, or loose, as anyone, in the argument for authenticity. Perhaps more. 1) Does the ‘invisible weaving, or any mending done by house of Savoy or others, have anything to do with establishing or debunking the age or authenticity of the SOT?  2) Does the argument over C14 dating take into consideration the bioplastic coating of the Shroud discovered by Garza Valdez, which would naturally skew the results?  In fact, isn’t that why the tensile strength experiments at the U. of Turin were conducted in the first place? I am a painter, and have done quite a few works on linen canvas, you CAN”T put any kind of “dye” or “paint” onto linen without first applying ‘gesso,’or the paint would simply be a smear or be a blob, and NO painting displays the three dimensional attributes discovered by a NASA photographer during the STURP investigation in the 70s. Thanks in advance for your help.","date":"October 8, 2013 at 11:42 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"author":"josie_l_tyner","post":"correction. I know one can dye linen.  I rather meant in the sense of forming an image with a pigment. Sorry.","date":"October 8, 2013 at 11:45 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"author":"josie_l_tyner","post":"Thank you for your kind reply, and I appreciate the depth of scholarship involved in the answer.  I have to admit that the information that I have about the three-dimensional properties of the shroud taken by the NASA jet propulsion laboratory scientist from the STRP team does not agree with your conclusions, and his conclusions assert that the Shroud must have been draped over a three dimensional image to have these properties. That said, there may be information out there of which I am not aware.  I would be interested in your point of view on the visual information available on the SOT that reflects facts only recently verified by modern archeology; i.e. the dumbbell shaped marks from the flagellum, the Eastern “crown” of thorns covering the entire head instead of the typical circlet, the nailing thru the wrists instead of the hands,  the fact that no contemporary (middle age or Renaissance, supposedly) cultural or plastic archetypes demonstrated by the Shroud are reflected by “relics” that pilgrims could recognize. In other words, how could an artist (considered only a craftsman in the Middle Ages) come by information only the recent science of archeology has now made known? One thing no one seems to ever mention is the fact that the figure of the Man of the Shroud is significantly longer in back than in front, I can’t think that that would go unnoticed by more than a few pilgrims. I am not being cynical at all by pointing out that relics were a big source of income for local churches and monasteries, so why show tithing pilgrims something they did not come to see? Finally, please forgive me if I have not understood this: is it your contention that the SOT initially looked like the well-known Secondo Pia negative, and that it has faded with time, leaving only the faint figure we see today?  Again, I thank you for your scholarly and informative answer, and appreciate immensely your time and consideration.","date":"October 8, 2013 at 6:14 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"author":"josie_l_tyner","post":"According to the information I have, the scientist who discovered this was  one of the team  responsible for analyzing the comparative depths of the areas where astronaut Neil Armstrong and company landed the vehicle on the moon.  His calculations were of life-and-depth critical importance to the moon landing.  His work is extremely credible in my eyes. However, to be fair to Mr. Farey, I am going to consult a family member who uses “IMAGE” software in his work and would like to tell you of what I saw (I have only basic computer knowledge). BTW, your work is fascinating and exciting. I would be very honored if you read my answer to Mr. Farey and weigh in on my questions concerning available cultural archetypes in the Middle Ages.  I do not understand how a mere craftsman, as any artist would be at the time,  would have access to information made only available in the twentieth century.  Thank you, continued success to you.","date":"October 8, 2013 at 6:30 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"author":"josie_l_tyner","post":"Terrific video.  Surprise!  Dan is in it!  Enjoyable and informative.","date":"October 10, 2013 at 6:58 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"author":"josie_l_tyner","post":"So let me get this straight: Bla bla, woof woof, “we’re not sure how old it is.” Got it. Thought everybody did, actually.","date":"October 28, 2013 at 12:47 am","url":"https://shroudstory.com/2013/10/23/jones-none-of-the-three-laboratories-dated-its-sample-to-between-1260-and-1390/","cat":"carbon_14_dating","title":"Jones:  “none of the three laboratories dated its sample to between 1260 and 1390”"},{"author":"josie_l_tyner","post":"Superparamagnatism? I guess it makes sense.  And at this point, since it seeks to expiate the traditional view of the NT writers, wait a minute-so Mr. Skurka’s hypothesis can said to back Docetism?  So it’s Superparamagnetistic-expiate a la Docious?  You know, the sound of it is something quite atrocious.  But if we say it loud enough….I’m sorry. I couldn’t help myself.","date":"September 24, 2014 at 8:47 am","url":"https://shroudstory.com/2014/09/24/superparamagnetism/","cat":"carbon_14_dating","title":"Superparamagnetism"}],"events":[{"author":"josie_l_tyner","post":"My fellow Texans sometimes take their security concerns with a verve sometimes unequalled anywhere in the nation. That said, in the last few years, people have been killed for admitting to the ‘crime’ of Christianity.  Think its a joke? Ask any Coptic Christian in Egypt how funny they think it is.  Being ‘insulted’ for being a Christian is going to happen. But leaving yourself wide-open for paint spraying, screaming, belligerent ( and often dangerous) people is inexcusable. So we don’t do it, y’all.There are many (not in Texas, thank God) who think they would be doing the world a great favor by getting rid of a few of us pesky Christians. If a Texas Ranger is a deterrent to these maniacs than I thank God for them.  Maybe the organizers would be happier to plan their next seminar at Brown University. Students refused to allow the police chief of NYC to speak, by screaming, throwing garbage and scrawling obscenities, and calling it a ‘victory for free speech everywhere.’  Maybe Dan would feel more comfortable in an environment where anyone could just bust down the door and spray the congregated intelligentsia with gasoline, or a Molotov cocktail?  By the sound of it, there were some definite organizational SNAFUs that turned out to be embarrassing, but providing adequate security was not one of them. We are not scared of firearms in Texas. We believe they should be in the right hands, to protect the innocent from those who would deprive them of their rights to speak and be heard. Seems like the organizers of the event had the issues, not the Texas Rangers. Someone who will not hear an opposing argument is clearly the one to fear, not the man with the Silver Star. I wonder how ‘corny’ Dan would feel if he had to jump behind a Texas lawman with some Christian hating nut coming at him with a knife. We know something in Texas: how many rights to you really have? As many as you can really defend, to the death if necessary.  So next time, if y’all are uncomfortable in Big T, go have your conference at Brown.  Good luck with that one, y’all.","date":"November 13, 2013 at 3:02 pm","url":"https://shroudstory.com/2013/11/12/of-enchiladas-listerine-and-dont-mess-with-texas/","cat":"event","title":"Of Enchiladas, Listerine and Don’t Mess with Texas"}],"history":[{"author":"josie_l_tyner","post":"Dave, you know of at least one Roman writer( he of course wrote in Greek) with “an intimate knowledge of the Hebrew scriptures,” that would be Paul.  While not culturally a Roman, he was a Roman citizen.  Ptolomy (Philadelphius, I think, not sure) had the Hebrew scriptures translated into the Septuagint. I am not saying it was on their ‘best sellers of all time’ list but was certainly available to the Roman reader if desired.  Flavius Josephus, another Jew, wrote for the Roman audience in his “Antiquities.” Tacitus mentions Jesus, and Suetonius in his “Lives of the Caesars” tells of “Chrestus” and his followers.  It was believed that “Chrestus” was a god of the slaves, Chrestus being a popular name for a male slave, meaning pleasant, or cheerful. Julius Africanus quotes Thallus and others who indeed confirm that on the afternoon of the crucifixion, an earthquake and darkness (possibly an eclipse) followed the crucifixion.   Pliny the younger also mentions Christians.  I am not sure if you are including early Christianity in the context of Hebrew thought.  It is possible to include Christianity as an extension of Judaism at it’s inception, certainly this was bone of contention between Peter and Paul.  You no doubt know all this stuff, just adding this for reference.","date":"October 15, 2013 at 10:50 am","url":"https://shroudstory.com/2013/10/15/jesus-fiction-created-by-roman-aristocrats/","cat":"history","title":"Jesus:  Fiction Created by Roman Aristocrats?"},{"author":"josie_l_tyner","post":"It was a Roman, I believe, who said “There is no concept so outrageous, or any theory so mad, that some philosopher shall not someday say it. ” “Pacify the poor?”  Just exactly how were the poor of Judea to be pacified by a Messiah whom most believed to be a re-run of King David, one who would liberate by the sword? If the Gospel is any witness, most of His followers believed this: that He would liberate His people from Roman oppression, not establish a new covenantal relationship between God and Israel.  Mass crucifixions and brutal taxation kept the people “pacified” enough for Roman purposes.What I would like this author to do is come up with some proof.  Failing that, please establish a parallel or historical precedent where Pax Romana drew upon local “superstition”( I use this word purely in the context of Roman rule) to engage in conspiratorial control of anything. The coming Messiah was an obscure, and uniquely Jewish, concept. In fact, the beleaguered procurator Pilate had no wish to crucify Jesus at all.  I cannot understand why an event where local religious zealotry backed Rome into a corner would benefit either the Roman aristocracy or the military establishment.  In fact, it made Rome look really bad; the big, bad, Roman establishment being cowed into crucifying an innocent man by a bunch of  ill-tempered old farts comprising a local religious body called the Sanhedrin? Yeah, that makes Rome look swell.You can hardly establish control over a population by attempting to manipulate a powerless minority.  Not even by the A. D. 400’s was Christianity the majority religion of the Roman Empire.  This author must have read Kurt Vonnegut’s “Cat’s Cradle” and assigned the character of Bokkonon to Jesus. It is the miserable failure of this and many, many other modern thinkers (term used very generously) to ascribe to the ancients concepts not found in Western thought until the Enlightenment. If you have a contingent of trained, merciless butchers, why the hell would you need a popular religion? If the Romans wanted to control their empire using religion, there were cults and devotions much more likely to appeal, less restrictive, less burdened with concepts like “sin” and “redemption.” Why not find some all-embracing, all accepting, anything-goes-as-long-as-you-pray-and-pay mother goddess from the Eastern provinces? Actually, any serious Christian of any denomination can tell you why. The Happy Goddess Mommy wouldn’t have lasted any more than “Good Vibes Jesus” or “Buddy Christ ” or “Anything Goes Forget that Whole Sin Thing Jesus” is going to last now. Only His love has that kind of power.","date":"October 15, 2013 at 10:10 am","url":"https://shroudstory.com/2013/10/15/jesus-fiction-created-by-roman-aristocrats/","cat":"history","title":"Jesus:  Fiction Created by Roman Aristocrats?"},{"author":"josie_l_tyner","post":"Truly. Thank you for the clarification on the Septuagint.  Have read Ehrman and like his wor. .Among other works worthy of perusal is  the U.S bestseller “The Case for Jesus” by Lee Strobel. It falls under the genre of popular literature, but is amazingly and exhaustively well researched.  There are few serious  scholars who doubt the historical Jesus.  At the end of the day, I don’t think Mr. Atwill impressed either of us. Cheers.","date":"October 15, 2013 at 7:11 pm","url":"https://shroudstory.com/2013/10/15/jesus-fiction-created-by-roman-aristocrats/","cat":"history","title":"Jesus:  Fiction Created by Roman Aristocrats?"},{"author":"josie_l_tyner","post":"For the record, Julius Africanus does not agree with Thallus, although he records what he wrote.  This Thallus could have been one of two people: a respected historian who wrote a history of the fall of Troy, and lived between 50 and 100 BCE.  His name has been linked with one Castor of Rhodes, whose work was important in setting the standard for future historical writings. There was another Thallus to whom Flavius Josephus referred; he wrote a few minor works but was more famous for loaning about a million drachmas to Herod Agrippa.I have a library that includes the Anti Nicene Fathers, so I can vouch for the reliability of the Ethereal Library, a website where you can freely access almost every Christian work ever written.   It is in Chapter XVIII : “From the Circumstances Connected with Our Savior’s Passion and His Life-Giving Resurrection” (ANFO6: Fathers of the 3rd Century; Gregory Thaumaturges, Dionysius the Great, Julius Africanus.)  The work of JA exists only as preserved by Eusebius and a Byzantine Scholar who wrote mostly in Aramaic, one Georgius Syncellus.   However, as I understand it, a fragment of an earlier copy of the Chronography was discovered in one of the Oxyrhinncus Papyri.      Best, JT.","date":"October 16, 2013 at 12:43 am","url":"https://shroudstory.com/2013/10/15/jesus-fiction-created-by-roman-aristocrats/","cat":"history","title":"Jesus:  Fiction Created by Roman Aristocrats?"},{"author":"josie_l_tyner","post":"There is a pretty cool movie about Hypatia on Netflix (streaming available) called “Agora.”  Worth a look. Make popcorn, invite friends.","date":"October 26, 2013 at 12:28 pm","url":"https://shroudstory.com/2013/10/25/the-image-of-camuliana/","cat":"history","title":"The Image of Camuliana"}],"image":[{"author":"josie_l_tyner","post":"Oh Lord, does someone really have to say it again?  Anytime a painting, picture, or such image is made, the painting appliance or instrument used to apply pigment ALWAYS leaves telltale stroke-marks indicating the way the pigments or pigment was applied. This is called directionality. No directionality on the Shroud, not a painting. Yes,  vermillion was found but in medieval times paintings of the SOT were placed against the Shroud itself, “sanctifying” the copy. This was done to many relics because some people just could not make the long pilgrimages required to fulfill a vow.  Mercuric Sulfide (vermillion) is bright red; if the Image of the Man is made of vermillion why isn’t it red?  And why does 90% of the information on the SOT only appear as a photographic negative?  And if it IS a photographic negative, on cloth, why can’t modern science replicate it ??  If it is a painting, why didn’t state of the art equipment used by NASA find this out in the 1970’s STRP team investigation?  Not exactly primitive equipment even by today’s lofty standards.  It is NOT a painting. We consider other theories because the painting theory is humbug, not possible,  unless someone found a way to paint microscopic fibers, sometimes every other one, with a teeny tiny itty bitty little paintbrush. Replicate that, and the painting theory is back on the table. Until then, the mystery endures, and probably always will.","date":"October 24, 2013 at 10:38 pm","url":"https://shroudstory.com/2013/10/23/is-the-shroud-of-turin-a-medieval-photograph/","cat":"image_theory","title":"Is the Shroud of Turin a Medieval Photograph?"},{"author":"josie_l_tyner","post":"Mr. Farey, I have done tomb-stone rubbings in Virginia and West Virginia.  “Rubbing” and”dabbing” techniques have as much directionality as a paint brush, believe it. You have to apply dry pigment in a series of strokes, and even if you used your bare hand, the application process still would indicate the direction of the strokes.  Not to the naked eye, perhaps.  A visual inspection of the SOT show some information, yest but  the negative of the photograph taken by Secondo Pia,  exposed the incredibly detailed information available in the SOT,  You CANNOT see, on a cursory and unaided examination, the abundance of amazing information available on the negative. Yes, of course you can see some of it. But a visual comparison of the two images is astounding, is it not?  Why has no one ever seriously TRIED to reproduce the effects on the Shroud? Calotyping is a primitive process using paper, LINEN paper. The Camara Obscura was known to artists and scientists of the Renaissance-why no attempts? Sir, there are people in this world who would give ten years of their lives to prove the SOT a fabulous fraud.  We can put men on the moon and vehicles on Mars, why can we not ape the (putatively) “fraudulent” product of relic monger? One with no modern laboratory, chemicals, or even the anatomical or archeological knowledge to perpetrate a convincing fraud..we have no answers. What fun? Much more than a matter of “fun” to some of us, sir. No laughing matter to the billions of us who call Him King and Savior. If some unknown medieval forger has mocked our faith by counterfeiting the burial cloth of the Son of God, I would like to know how it was done. And if not, the possibilities for those of use who desire life everlasting, the reunion with our loved and lost, and the drying of every tear, are wonderful indeed.","date":"October 25, 2013 at 10:50 am","url":"https://shroudstory.com/2013/10/23/is-the-shroud-of-turin-a-medieval-photograph/","cat":"image_theory","title":"Is the Shroud of Turin a Medieval Photograph?"},{"author":"josie_l_tyner","post":"I tried Colin’s theory with an experiment with some barbecued chicken and some ecru (no dye used) needlepoint linen.  I used varying degrees of “done-ness.”   No scorch marks were in evidence. No matter how little or how long I cooked the bird, no “Image of the Yard Bird” imprinted itself on the linen.  It occurs to me that from an experimental point of view, if the body was hot enough to  scorch linen it was also hot enough to 1) blister and disfigure the skin 2) melt the sub-cutaneous fat which would (and did) run out and soak into the linen.  Actually, human bodies have a LOT of s.c. fat; in some cases corpses have been found covered in solid fat (called grave wax, or, scientifically, adipocere.)  Also DIFFERENT PARTS OF THE CHICKEN BURN DIFFERENTLY at the same heat.  Most importantly I found that the blood oozing from the chicken turned a different color after being exposed to heat. I realize of course that live human and Puritan’s Pride pullet are different, but there you have it, in the spirit of scientific enquiry. The image of the Man is not blistered, presents no oily marks from running fat. No seasonings or barbeque sauce was used. I considered rubbing the chicken with camphor (to simulate myrhh but I don’t know if they are chemically similar, they sort of smell alike.  Introduction of too many variables.","date":"October 28, 2013 at 4:49 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"author":"josie_l_tyner","post":"I am repeating the experiment with a plaster souvenir.  I did learn quite a bit though.  Called three funeral homes, two hung up on me. Finally El Angel funeral home of San Antonio, TX.  answered my question. Different parts of the human body do burn differently at the same temperatures. That is why the temperature of crematoria are gradually increased.  But here is something to ponder:  why would anyone use a coal to make the holes, when wooden fires were used to burn people?  I am going to try the experiment with and without camphor.  I am also going to use ALOES.  I always wondered why Joseph of Arimathea brought so much darned Aloe ( aloe sativa grows in the Holy Land and Egypt, aloe Vera here in the U.S. of A.  But I think they are basically the same).  Do you reckon it might have been used as a fumigant? Stories about mummification (It was still going on in Egypt because in the San Antonio Museum of Art there are mummies dating to the first and second century AD) no doubt were known.  I’m not saying J. of A. was trying to mummify Jesus! No WAY! But, I mean, who was thinking straight that day?!  Anyway, aloe is very gummy, very gooey.  Should have results by the end of the wk.  Yeah, I guess its a little crazy but lets face it; whoever did this, if indeed it was the product of human hands, had equipment much less sophisticated than mine. Wish me luck.","date":"October 28, 2013 at 11:09 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"author":"josie_l_tyner","post":"And I thought roasting the chicken with the linen cloth on top was daring of me.  You are a brave, brave man in the cause of Science.  We will be waiting for the results.","date":"September 26, 2014 at 7:40 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"author":"josie_l_tyner","post":"But D. isn’t the image on the shroud a negative? The Man of the Shroud has amazing anatomical detail when seen as a “positive,” so much more than pressing someone’s face against a cloth could achieve (had an art class as a child where we did a similar thing with tempera paint; it’s fairly gross and the end result was that each person’s face was fairly indistinguishable from his neighbor’s )   And any linen or such pressed over  a person’s face would give the Mask of Agamemnon effect (super big cheeks) that the man of the Shroud does not have.","date":"September 26, 2014 at 9:24 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"author":"josie_l_tyner","post":"Mr. Freeman many of us here are artists, and we have used both acrylic gesso and the gesso proper for oil paints.  The fact is, gesso makes the entire linen very stiff and the constant folding and unfolding would crack the dried gesso, if would flake off in little bits and eventually be gone entirely.  The whole point of gesso is that the pigment adheres to it, not to the linen.  Many of the ancient guilds of Florence and Sienna and other places had very closely guarded secrets that involved dying, tinting, etc, secrets that may be lost to us today. Even so, one would think that this knowledge would be retrievable by the best scientific equipment the world has to offer?  If the craftsmen and burgers of nearly a thousand years ago can baffle doctors of organic chemistry, scientists who have more letters after their name than Carter’s has little liver pills, than I doubt a simple explanation like ‘gesso’ would go unnoticed.  An unidentified genius who created a Medieval masterpiece is often called the “Master of the Annunciation (or the deposition, or the Assumption, or whatever he painted).  The Master of the Shroud of Turin, whoever he was, apparently turned down every other commission he was offered to create a similar masterpiece, or he died, or he quit painting (or dying or tinting or whatever) . Weird, right? Not coming to any conclusions here, but weird.  IF-and I say IF-the Shroud of Turin is not actually the Shroud of the Man here depicted, then my hypothesis is that it is the world’s first photograph, because it is a NEGATIVE.  Alchemy was a secret science guarded more closely than any guild secrets, because it was very suspect and allied to the practice of magic.  I don’t know how a photographic reagent could have been applied to the cloth without destroying it.  And I don’t know how such a thing could have been discovered and then forgotten.  I suspect we will do no more than wonder about the SOT, for a long time to come, and perhaps forever.  But one this is certain, ANYONE who claims to know exactly what the SOT must be taken with more than a grain of salt.","date":"September 26, 2014 at 9:52 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"author":"josie_l_tyner","post":"If it were possible to mimic the Shroud of Turin, it would already have been done.  It is a thorn in the side to every atheist alive, because they cannot disprove it.  The more it has been studied, the more it points to its Divine origin.  He knew that the time would come when Christians would be hated, spat upon, and His name would be spoken without reverence and in great blasphemy. He left us, the Catholic and the Protestant.the Orthodox and the Coptic, those who must pray in silence out of fear, a postcard.  This postcard could only be read when the camera was invented, and only now, can the Postmark be confirmed thru diligent study.  He is telling us He is coming for his children soon, and very soon.  And the more it is maligned, mocked,  and ignored by the godless, the higher and brighter it will shine.  Even so, come Lord Jesus.","date":"August 28, 2013 at 6:49 pm","url":"https://shroudstory.com/2013/08/27/when-is-a-scorch-not-a-scorch/","cat":"image_theory","title":"When is a Scorch NOT a Scorch?"}],"misc":[{"author":"josie_l_tyner","post":"Giles de Ray was a madman.  He may have been a nominal Christian, in fact, he was one of Joan of Arc’s most important commanders.  I read his confessions, you can find them online. He did not kill children because he was a Christian. He killed children because, according to his own words, was deeply involved in the occult. In fact, during one occult ceremony when the blood of children was being offered as a sacrifice, he “wished to see the Devil” but in fact chickened out.  Crazy people will do what crazy people do: beat their children to death, starve them, kill their enemies or those who disagree with them, and whether they say “God made me do it” or the “Devil made me do it” or “People from outer space controlling  my brain with Z rays made me do it” they are still crazy. People have done horrible things in the name of God. But they did these things with ulterior motives, cloaking their evil designs behind holy trappings and the fears and gullibility of the ignorant. To impute this evil to Christianity itself is beneath contempt. No institution has been free of those who would abuse it for their own gain. The next time someone wants to point and say “SEE? He is a Christian and look what he did!” you might want to also say “he did not do this in the name of Christianity.  He did it because he was a bad man, no matter what he called himself.”  I would be ashamed of that kind of intellectual dishonesty sir.   Straw men burn easily.","date":"October 10, 2013 at 7:31 pm","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"author":"josie_l_tyner","post":"I am a firm believer in modern psychiatry.  I was, when I could work, an in-home care giver for many mental patients, not only those suffering from forms of dementia associated with brain deterioration but also Alzheimer’s disease and those experiencing psychosis related to frontal lobe deterioration.  That said, Gilles de Raes was one of Joan of Arc’s best commanders, a man fully in charge of his faculties and not-Inconsiderable intelligence and battle field strategy, when he chose to be.  There is Evil, sir, I do believe it, Evil with a big “E.”  Monsieur de Raes wanted Power, with a big P. How better to take a short-cut to Power than thru the Prince of the Powers of the Air, to whom it is given?  If Evil can be dissipated by few hours on a couch with a nice old fellow who says, in a German accent,” Tell me about your Muzzer..” or with a pill, I’m all for it.  But that is evil with a little “e,” and even the most horrifying human “monsters,” the Jeff Dahmers, the Ted Bundies, are, at their core, pathetic victims of ill treatment or, as you say, mental defectives.  No amount of pills or therapy(or lack thereof)  can account for the killing fields of Pol Pot, or Auschwitz.  THAT kind of evil nailed the Man to the Cross, and even he was not the Christ, THAT is still true.  Mankind is imbued with a sickness, the destructive, seductive desire for power that “seemeth right” but can only bring misery, just like the ring in the famous trilogy by Tolkein, that cannot be wielded for good, no matter how pure or high-minded one’s intentions.  Some of us still call it ‘sin,’ and the denial and suppression of it’s existence is Evil’s greatest triumph.   Yes, there is mental illness, and there is particularly embarrassing contingent of self -styled ‘exorcists’ a la Benny Hinn who take shameful advantage of these unfortunates. But look rather in the seats of world power and the private expensive-cigar-and-bourbon back rooms. You will find Evil there, or rather, I hope you never do.  Continued success to you sir and my respect always. , your acknowledgement of my poor contribution is an honor for me and a credit to your generosity of spirit.","date":"October 11, 2013 at 11:41 am","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"author":"josie_l_tyner","post":"When was Christianity a “numbers game?”  From the earliest days of faith, Lot beseeched the Father to spare a hateful, wicked place for the love of ’10 righteous men.’ No soap, no 10 good guys.  How many people were at the foot of that Cross? Two.  How many people hung around on Sunday to try and give the Body of their Master a little dignity in death, as He had given them love in life?As Christians, the Lord gave us the Great Commission ” Go ye unto all peoples, unto all lands..” and so we do.  He didn’t tell us to count them.  In fact, the Christ TOLD us that two-thirds of ALL the seeds planted would not sprout. Some will fall on rocks, some on soil too hard to bear fruit.  How many Christians are there?  The day will come, I believe in my lifetime and I am no Spring chicken, that the ‘people in the know’ will avow that faith is dead. Let them.  So what? What to those of us who truly, completely, believe in Him? Caiaphas, Nero, Domitian, Robespierre, Marx, Lenin, Hitler, Stalin, Hitchens… where are they?  And Christ still lives and reigns. He told us, “Lo, I will be with until the end of the world.”Even so, come Lord Jesus.","date":"May 16, 2015 at 7:38 am","url":"https://shroudstory.com/2015/05/16/christianity-in-sharp-decline-in-the-u-s/","cat":"news_&_views","title":"Christianity in Sharp Decline in the U.S."},{"author":"josie_l_tyner","post":"David, I read Paulette’s comment and the way it is written, I think she meant for a joke.  Honestly, I could be wrong but she looks like she is needling him for taking the article’s language a little too seriously.  People are people and people are biased for or against a cause, human nature is what it is. Obviously Hugh didn’t take it that seriously, by his answer! I have seen him go off on people and believe me, if he thought he were being attacked he would flip on the high-beams in a hot minute.  I completely and whole-heartedly agree with you, we can be sincere people without forcing our beliefs on anyone.  Those who do are, in their heart of hearts, not convinced that what they believe is true, and they won’t be, until EVERYONE believes the way they do, or at least until everyone is too intimated to argue with them.","date":"May 16, 2015 at 12:57 pm","url":"https://shroudstory.com/2015/05/16/christianity-in-sharp-decline-in-the-u-s/","cat":"news_&_views","title":"Christianity in Sharp Decline in the U.S."},{"author":"josie_l_tyner","post":"Correction: Abraham, not Lot, pleaded for Sodom. My bad, it’s early in the morning and I just started back to get my BSRN at 57.  Those of you out there who pray, pray for me.  I hope, in my otherwise worthless old age, to do something besides soak up oxygen.  Old people are perhaps the most underused resource world-wide, mostly because people tell us we are moldy old sweat-socks and need to get out of the way.  Well, I don’t plan to any time soon. So somebody pray that Josie has strength, determination and more Ginko Biloba because 5 years ago I wouldn’t have made a mistake like that! Ugh, the shame, sorry father Abraham…","date":"May 16, 2015 at 7:45 am","url":"https://shroudstory.com/2015/05/16/christianity-in-sharp-decline-in-the-u-s/","cat":"news_&_views","title":"Christianity in Sharp Decline in the U.S."},{"author":"josie_l_tyner","post":"Hmm. Sorry you are not up to the challenge. I am breaking out a dictionary, some of my father’s old books on clinical chemistry, and am now in contact with University of the Incarnate Word of San Antonio to try to unravel what is sure to be an interesting study. When I understand it, perhaps I will disagree with it.. What I think is more likely is that I will come to a place, or places, where I believe he has interpreted data perhaps too subjectively.  Either way, before discarding it entirely, I should like to look into it with a scientific point of view, and without prejudice.","date":"October 13, 2013 at 6:31 pm","url":"https://shroudstory.com/2013/10/12/in-a-peer-reviewed-scientific-journal/","cat":"news_&_views","title":"In a peer-reviewed scientific journal"},{"author":"josie_l_tyner","post":"It took me awhile to understand what Dr. Diaz was trying to say.  Had to pull out a medical encyclopedia, and it was still confusing because I could not understand his ideas about finding residual EMR on a cloth, purported to be, even by skeptics, more than 500 years old.  I understand Dr. Diaz did not have direct access to the Shroud, so how could he examine it for residual EMR? The so-called ‘spectral emission line’, presumably, is the result of electromagnetic activity surrounding the Shroud-but under what conditions? and when? And what equipment was used to analyze this? As I understand it, the SOT is now kept in an airtight case filled with Argon and some other gasses, would this affect Dr. Diaz results? I got as much info as I could at the local library and the internet about images being produced in cancerous tissue, came up with nothing.  And I came up with less than nothing about cytokines and signaling proteins creating embryo-like pictures on anything.  I would like Dan to invite Dr. Diaz to further explain his findings on this blog.  As it is, with no disrespect to dr. Diaz, I can’t understand why a doctor,  a pathologist, with a string of letters a mile long behind his name, would imperil his academic credibility by signing his name to this paper. It seems like really bad science, and even worse theology.  I do indeed believe in Jesus, but it would seem to me very irresponsible to pass this along, unless someone can explain why finding so-called “embryo pictures,” and they don’t look embryonic to me-is proof of anything.  I know people here who have found mold patches that look like Elvis on their refrigerator, and Mary on a tortilla, and aside from the scientific language, this looks like the same thing.  Any chance there is no “Dr. Diaz,” and someone is, as my English e-pals say it-“having us on?” Sounds like it to me.","date":"October 12, 2013 at 1:14 pm","url":"https://shroudstory.com/2013/10/12/in-a-peer-reviewed-scientific-journal/","cat":"news_&_views","title":"In a peer-reviewed scientific journal"},{"author":"josie_l_tyner","post":"Dr. Diaz will you be submitting any papers to the IEEE-ATSI conference of the Instituto Di Sindologia scheduled at Bari, Italy in 2014?","date":"October 14, 2013 at 12:18 am","url":"https://shroudstory.com/2013/10/12/in-a-peer-reviewed-scientific-journal/","cat":"news_&_views","title":"In a peer-reviewed scientific journal"},{"author":"josie_l_tyner","post":"Dr. Diaz, thank you for your participation.  I for one realize that your theories and research, while controversial, deserve at least the effort to understand what they are.  There have been many controversial theories for the formation of images on the SOT.  Yours is hardly the wildest I have ever heard, believe me.  I do not share the impressive academic credentials of many of the contributors to this blog.  My father was a BSMT (bachelor of Science in medical technology, Geneva College, New Brighton PA class of 1962), and his concentration was in clinical chemistry.  I still have his books and will use them to attempt to interpret some of your research.  I will do my best to understand what I can, and continue to research what I don’t.  I  no longer doubt your absolute sincerity, and do apologize for my joke about the tortilla. You can imagine blogs like this get their share of pranksters. Some of the responses to your obviously sincere posting are in very bad taste, and unworthy of those who have stooped to this level. I think perhaps your theories are so controversial that many have been taken by surprise.  I hope you will continue to contribute to this blog.  I, for one, look forward to the contributions that make this blog as interesting as it is. Gracias mil.","date":"October 13, 2013 at 5:12 pm","url":"https://shroudstory.com/2013/10/12/in-a-peer-reviewed-scientific-journal/","cat":"news_&_views","title":"In a peer-reviewed scientific journal"},{"author":"josie_l_tyner","post":"Mr. Berry, I am wearing a nice, even, coating of egg on my face, because I truly believed Dr. Diaz’s paper was a prank.  In fact, being a native Spanish speaker, the pronouncement of his name sounds like “Herodias,” I was pretty sure I was right until today. Since the redoubtable Dr. Diaz has taken the time to offer an exposition of his theories, might you not refute him, scientifically, point by point? It seems rather easy to say “mumbo jumbo,” perhaps if you can explain at what points you disagree with him-specifically-we may all be able to benefit from your experience and acumen.  It may take me a little time to digest, but I am certain it will result in a very interesting posting for one and all.","date":"October 13, 2013 at 5:46 pm","url":"https://shroudstory.com/2013/10/12/in-a-peer-reviewed-scientific-journal/","cat":"news_&_views","title":"In a peer-reviewed scientific journal"},{"author":"josie_l_tyner","post":"Isn’t it strange that this is the ONLY example in the entirety of human history where this has happened?  The search for naturalistic answers is a waste of time, since mathematical probability discounts the chances into the untold billions.  How much radon gas, exactly, would you need to create an image thru limestone rock, 5 or more feet thick?  In a damp tomb? Onto a cloth? Without a light source? The academic community has no shame in advancing the most outlandish, never-happened-in-known-history,  can’t-verify-it kind of armchair theorizing because the implications of the Man  are too terrifying for them to contemplate.  If the learned doctors, or whatever they are, really believe  that ‘concurrent variations in the geo/magnetic gobbledy-gook’ could account for the image of the Man, then reproduce it in a laboratory. Then we will see how ‘certainly credible’ they are.  THEN let them explain how this happened w/o the benefit of hundreds of thousands of dollars worth of equipment in the 1st century.   Frightened children climb under the blankets and repeat ‘the boogyman’ doesn’t exist, daddy says so.’ But they still shake and pee their nightshirts in fear, when they feel the hand on their shoulder..and its only Father trying to comfort them with His presence. How sad.","date":"September 16, 2013 at 5:35 pm","url":"https://shroudstory.com/2013/09/15/more-scientific-research-on-the-shroud-of-turin-why/","cat":"uncategorized","title":"More scientific research on the Shroud of Turin? Why?"},{"author":"josie_l_tyner","post":"I must admit you lost me.  “It is not necessary to believe the image was caused by naturalistic means, or miraculous means.”  Are there any other possibilities? If there are, could you suggest some? I mean, maybe I don’t quite “get it” but if it did not happen by forces in nature, or out of nature, then what are we left with? I think the TS has been approached by the most sophisticated scientific equipment and the soundest methods available to modern man, for upwards of forty years now.  I have been following events concerning the TS since the STRP team in the 1970’s.  “We don’t know if any other burial cloths contain images,” archeological evidence has never produced any, has it? “We need to remember that the image is not of a glorious resurrected Christ, but of a very dead corpse. That would seem to rule out etc.”  I am sincerely looking forward to your sharing your unique insights on the mechanism of the Resurrection.  I had always believed that, barring the information given in the Gospels, this constituted a mystery known only to the Almighty. Christ’s physical body did, indeed, die.  Without his complete, utter, physical demise, the whole idea of the Resurrection kind of collapses. Experiments attempting to re-create artificially an event that you freely admit occurred providentially  would only seem to preclude an accidental occurrence. In fact, you don’t have to look that far.  Any photograph produces a negative, doesn’t it? But who knew how to “treat’ a linen cloth in the first century? Has anyone found any chemicals on the TS that would produce such an effect?  By me, go ahead, study TS all you want. But all you need to know is right before your eyes. I mean, it would have been truly great to get an image of the Lord smiling, waving “toodle loo” or giving the “thumbs up” sign. But that would preclude the need for any faith at all.","date":"September 17, 2013 at 3:25 pm","url":"https://shroudstory.com/2013/09/15/more-scientific-research-on-the-shroud-of-turin-why/","cat":"uncategorized","title":"More scientific research on the Shroud of Turin? Why?"},{"author":"josie_l_tyner","post":"Sir, if I, or any other Christian, needed an artifact, however hallowed,  to bolster my “fairy faith,” I assure you my certitude would be small indeed.  In the Gospel, Jesus Himself derided and mourned over the generation that expected “signs and wonders” to prove His sovereignty over the natural and spiritual world.  Perhaps you should read my posting with a little more critique and a little less prejudice.  I have no problem with scientists of any discipline investigating the TS. What could it hurt?  But perhaps you could explain how Mr. Daveb of Wellington NZ can ascribe the production of the TS to neither the natural, or the supernatural.  My clear, and I believe, very fair question was, to what other agency could one ascribe the production of the TS, or indeed the production of any object? Does it not have to be one or the other? Not knowing which is one thing, and I assume that could be the object of scientific inquiry. But it came from one or the other, and a course of investigation must start somewhere. The scientific method demands the formation of an hypothesis. “Neither” does not cut the mustard.  My second concern is how does one spend decades creating the exacting conditions needed to produce an artifact so unique as to merit world-wide scientific attention, and then ascribe its creation to accident and happenstance?  My third, and I believe most overriding concern, is the how Mr. Daveb can assert with any expertise whatsoever that we can “rule out the formation of the image to the Resurrection.” If Mr. Daveb has some knowledge as to the exact, or even approximate, circumstances surrounding the events of Easter Sunday 33 C.E. I would hope he would share them on this blog.  My point is, how can he even begin to theorize about what evidence constitutes, or does not constitute, evidence of the Resurrection or the effects of the same on the ST?And my favorite quote so far?”It might not be as rare as we imagine.” If in the history of scientific inquiry or archeological discovery the like has been found, I don’t know of it. I would call it rare, sir.  Finally, thank you for your heartfelt concern for my frustration levels. Not that you sounded condescending or anything. The simple, the lumpen, and the hoi polloi have as much interest in the progress of Syndonology as those in the exalted and rarified realms of academia. Perhaps more so, because He is our Love Eternal. In the more direct words of St. Severinus the Truculant: “Thou are not the boss of me.”","date":"September 17, 2013 at 6:02 pm","url":"https://shroudstory.com/2013/09/15/more-scientific-research-on-the-shroud-of-turin-why/","cat":"uncategorized","title":"More scientific research on the Shroud of Turin? Why?"},{"author":"josie_l_tyner","post":"Never say anything online that you would not say to a person’s face.  Never say anything online you would not say in front of your mother.  Nothing is hidden from God, and if you don’t believe that, then believe this: every word typed into cyberspace is there forever, no retraction can recall them, anymore than you can unring a bell. .  I think this blog is one of the most marvelous tools in the world to learn about the science and discipline of Syndonology,  But sadly it is also a place, as of late, where basic civility and respect seem to be lacking. We all know the study of the Shroud has always attracted its share of conspiracy theorists and ranters, and we all need a good laugh now and then.  But haughty, elitest, academic sneering, personal attacks, obscenities…not attractive, folks.  I, for one, think if would be a good idea for anyone defending a particular theory, to cite their references so the rest of us can have access to them. Many posters here already do  Who knows, you might develop a following. But an undignified and hate-spewing presentation does nothing but build barriers to communication. My neighbor LaKeisha puts it this way: “God don’t like ugly.” I think she may be right.","date":"October 9, 2013 at 11:55 am","url":"https://shroudstory.com/2013/10/09/on-holy-trollers/","cat":"news_&_views","title":"On Holy Trollers"},{"author":"josie_l_tyner","post":"Can anyone tell me how this artifact was dated, and what evidence exists that it is indeed ‘not made by human hands?’  I see some very, very real reasons to refute this claim1) I see no similarity whatsoever between the features of the Man of the Shroud and this image.  None.  The eyes of the artifact under discussion are very much in harmony with the Siennese school of painting, the hooded, almond shaped eyes in vogue in religious paintings in the 1200s.  The nose is poorly done, and is in fact out of the alignment with the mouth.  This image’s face reflects no injuries nor bloodstains associated with the Crucifixion and in fact does NOT represent a Semitic man!   Any claims made to be ‘not made of human hands’ the Shroud of Turin has supported with scientific evidence, the most modern equipment being unable to refute this just and supported claim.  What does science say of this artifact, and who says it?","date":"September 7, 2014 at 11:29 am","url":"https://shroudstory.com/2014/09/07/the-veil-of-manoppello-to-visit-the-philippines-this-month/","cat":"news_&_views","title":"The Veil of Manoppello to Visit the Philippines This Month"},{"author":"josie_l_tyner","post":"Thank you, and I did check out your most scholarly work.And I know what I write will probably not make sense, but I have to say that when confronted by both images, there is just not the same feeling. The quiet holiness of the Man of the Shroud fills one with peace, in spite of the obvious violence inflicted upon the body. The face of Manopello seem to me to be disquieting, emotionless, well-done to the point of absolute virtuosity, and very inhuman.I can, and have, looked at the face on the SOT, for hours, and feel the closeness of God, and there is something in the Manopello face that makes my skin crawl.  Those hooded, emotionless eyes, a face supposedly battered beyond recognition, is somehow there in perfect composure, hardly a hair out of place, no beard pulled out as the Scriptures say, no blow on the face from “Prophecy! Who struck thee!” nothing evidenced on the SOT, where every single blow and bloodstain finds perfect Scriptural confirmation.  The Man of the Shroud is a bloody, battered mess, what one would expect a victim of Crucifixion to look like.  And where, exactly, does a poor Hebrew woman get byssus? Not impossible, but I never got the impression the better classes of Judea attended the crucifixion processions of criminals.There are miracles and miracles.  An opinion based on an emotion is not going to sway anyone either way, but for me, personally, my gut is telling me this is not a picture I want in my home.  No reflection on your masterful work of course, I speak of a very subjective feeling of something being ‘not right’ on a level I cannot understand.  But for now, I am listening to my gut.","date":"September 9, 2014 at 1:14 am","url":"https://shroudstory.com/2014/09/07/the-veil-of-manoppello-to-visit-the-philippines-this-month/","cat":"news_&_views","title":"The Veil of Manoppello to Visit the Philippines This Month"},{"author":"josie_l_tyner","post":"I think this man is just ‘having us on,’ as the Aussies say.  No one who is a Christian will believe this rubbish, Christians of any denomination will back up what the Bible says; “no one, only the Father in Heaven, knows the day nor the hour when the Son of Man will return.” and “He will come as a thief in the night,” not as Lady Gaga on tour.  My daughter calls me Frau Farbissener (affectionately) because I am a dead ringer for Mindy Silverman of the “Austin Powers” series, but can I act? Nope. Unless Mr. Marshall starts healing the sick, raising the dead, vanquishing all evil on the Earth, I just can’t give the coveted “Josie Lu’s Stamp of Approval.”   Better we should laugh this one off, have a few yuk yuks at the rather handsome Mr. Marshall’s expense and move on.","date":"September 9, 2014 at 9:36 am","url":"https://shroudstory.com/2014/09/09/tinfoil-hat-version-of-face-matching/","cat":"tinfoil_hats","title":"Tinfoil Hat Version of Face Matching"}],"opinion":[{"author":"josie_l_tyner","post":"I really love this blog.  Unless we know HOW the image was formed, the rest is a whole lot of who-shot-John.  I mean, intellectual, highly educated who-shot-John, but that is it.  Conjecture. Was blood added or not, etc. The plain facts are, and to this day, NO ONE KNOWS.  In the words of B.Shwartz, “We can tell you what it is not.” UNTILL we know what the image is, (I am convinced we never will, but to keep looking is only right and human) you cannot add or take away from its total construction. What I mean is, it was either a contrived artifact, or it is not. I don’t think somebody found the SOT and added any adornments or additional visual info.  When (and if) we figure out how the image was made, the question of the bloodstains will pretty much answer itself, won’t it? The question of where the blood came from, at least as I see it, is inextricable from the question of how the S. was formed, simple as that.","date":"October 26, 2013 at 1:24 pm","url":"https://shroudstory.com/2013/10/06/one-persons-take-away-from-a-shroud-lecture/","cat":"other_blogs","title":"One Person’s Take Away from a Shroud Lecture"}],"researchers":[{"author":"josie_l_tyner","post":"All things of this Earth serve God and His purpose.  What if all Lombartti said is true?  How does that affect the STURP findings?  Is this man serious?  I am sorry, but if the criteria for accepting scientifically proven facts is that the researches be free of sin, how crazy is that!  I mean, suppose the accused man is guilty. This matters how? I suppose I can’t say “Leonardo was a great Renaissance painter because he was a homosexual.” Or, “Tycho Brahe’s astronomical observations are incorrect because he had siphyllis”.  ?That isn’t even Christian doctrine, Protestant or Catholic!  I have no idea who this Lombartti, person is, but ‘so what’s your point’ is what I say..it makes no sense at all.","date":"June 15, 2013 at 1:40 pm","url":"https://shroudstory.com/2013/06/15/an-antonio-lombatti-poop-dump/","cat":"news_&_views","title":"An Antonio Lombatti Poop Dump"},{"author":"josie_l_tyner","post":"This was obviously place before the Giulio Fanti vibrational spectroscopy tests. The writer would have us believe that the ST is no better than the plethora of medieval relics that flourished when the relic trade was both fashionable and lucrative. However, and rather disturbingly for him, the Shroud is unique in every sense an artifact can be . Crucifixion was a common brutality in Roman rule. So where are the other shrouds? Rather like the evolutionist, when asked for his intermediary forms, for the bones of the little birdy the reptile gave birth to one day by mistake, this worthy writer will no doubt say, “we’ll find them someday.” Perhaps. It cannot be linked with any person, but if it had been found in Los Angeles yesterday morning only a hermit living in a cave on Mars could not tell you who it was. Who, indeed.","date":"June 11, 2013 at 7:51 pm","url":"https://shroudstory.com/2009/01/30/barrie-schwartz-on-the-shroud-of-turin/","cat":"news_&_views","title":"Barrie Schwartz on the Shroud of Turin"},{"author":"josie_l_tyner","post":"* sorry, partially blind. refers to comment by by l. singer sorry mr. hart.","date":"June 11, 2013 at 7:54 pm","url":"https://shroudstory.com/2009/01/30/barrie-schwartz-on-the-shroud-of-turin/","cat":"news_&_views","title":"Barrie Schwartz on the Shroud of Turin"},{"author":"josie_l_tyner","post":"OK, I am familiar with your postings, and read them carefully.  I am inclined to believe that the Shroud is authentic.  However, I do not expect my opinion to be universally held, in spite of evidence I believe to be very supportive of this case.  And I agree with you to an extent; many people who post here will never, EVER be convinced, not even if the Man of the Shroud starts to sit up and sing ABBA’s “Dancing Queen” in the middle of the Turin Cathedral, at 400 decibels and shatters the windows. Because if they did, their entire world view would have to change.  They would have to say “God is real, so I owe Him something and must obey Him.” The atheist is not afraid that there is a God, he is afraid that he is no longer his own god.  So don’t expect to convince anyone that the Shroud once wrapped the Son of God. Never will happen, not on this blog. EVER.I am more inclined to believe that, given sufficient evidence, and with continued study, that it can be proved that the SOT once wrapped the historical Jesus of Nazareth.  The only problem is how, by what means, did this unique artifact come into existence? If the SOT did NOT wrap a cadaver, than what?  NOT plaster hot enough to scorch a linen cloth, and not a dead body hot enough to scorch linen-THAT much I am certain of. There are NO such artifacts in existence today, certainly not of the (even disputed) age of the Shroud.  Very few are they who possess the scientific acumen to argue the molecular properties of chemical components found on the Shroud, or the have technical savvy to argue how the 3D properties differ in each equipment used for this study of Sindonology.  But those simple ones, like myself, who follow this blog and read as much as they can on the subject, have more to lose or gain than any academic. We have staked our lives, and anything past our lives, on the deeply held conviction and belief that Jesus is not only real, but that He lives and reigns and will come to bring us unto Himself.Having said that, no artifact can provide proof of the Divine. In the Scriptures, Jesus Himself has but faint praise for those whose tottering faith depends on ‘signs and wonders.’  These things are for spiritual babies and toddlers.   No mature Christian, of any denomination, stakes their faith on an artifact.  If it was somehow made by human hands, this I would truly like to know. But conversely, if this Shroud is a sort of postcard to an age where committed faith is rare, then He willed this for reason, and this I would also like to know.An English poet named Lear wrote a poem called “The Blind Men and the Elephant,” we are all blind men and the Elephant, the Shroud, we many never be able to perceive save through our own pre-conceptions and prejudiced beliefs. But I, for one, will continue to try.","date":"November 4, 2013 at 10:42 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"author":"josie_l_tyner","post":"Andrea, I agree with you about RCC priests being among the most tenacious arguers against the examination of the Shroud. But the reasoning behind it is not what you think.  Take a look at what the Catholic Church has claimed, in the past to be true:  That wine and bread become flesh and blood ( Cannibalism is a horrible concept.) An old English ballad of the Presbyterians tells the story of a Catholic husband whose wife became a Protestant. He invited a priest to celebrate mass in their home, and bade his dissenting wife bake a loaf of fine bread for the occasion.  Upon completion of this sacrament,  the wife tells the priest “I have put a pound of arsenic in the batter, but since you’ve changed it’s nature, well, that really cannot matter.”  She of course did no such thing, but as the screaming priest ran off to get an emetic, she pointed out to her husband that not even HE believed it.  The concept of Purgatory is built on the flimsiest of suppositions in the book of Maccabees, praying for the dead may be done without assuming the existence of a place never mentioned by Jesus.  Or Moses. Or anyone else.  The worst of these inexcusable superstitions, in my opinion, is the exhibition of the so-called “incorruptible” saints. I accompanied a former employer to Lourdes many years ago.  She was heart broken, and later fired me, for making the resident priest admit that the beautiful Bernadette Soubirous  had actually turned black years ago, and what they were looking at was a wax covering.  Saint Teresa of Avila, one of  three female saints the RCC named Doctors of the Church, was hacked to pieces so parts of her body could be distributed as relics. In the light of the claims and teaching supported by the RCC in the past, are you surprised they are reluctant to make any pronouncements about the Shroud of Turin?","date":"November 4, 2013 at 7:40 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"author":"josie_l_tyner","post":"Dave, you bring up a point in your excellent (and hilarious!!) refutation.  I have read the work of Max Frei and Alan Whanger. Ok, whatever the critics say.  But what of the excellent work of Israel’s leading botanist, Avinoam Danin, and his work? He found, among other pollens, figoneum molis, an herb used unto this day by the Bedouin people for healing superficial wounds. But he also found, around the head, a huge preponderance of the pollen of Gundifolia Dumosim, an extremely nasty spined plant that only blooms in, and around, Jerusalem. Could it have been transplanted? What are the odds? Have you heard of his work? What do you think of it?  I stand my ground on the skeptics, nothing you point out, individually or together, however Damascus Linens, Inc. makes them look, will matter. But you put it with..how is it? Dry British humor, even if you are in NZ.  Kudos.","date":"November 4, 2013 at 7:22 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"author":"josie_l_tyner","post":"I have seen pictures of the so-called “incorrupts.” And what the RCC accepts as incorrupt are, mostly, in a fairly good state of preservation but hardly un-accounted for by natural means. Natural mummification is not that unusual. Look up the corpse of St. Rita, from the 1200s. Dessicated for sure, a natural mummy.  I have seen the corpse of St. Bernadette. As a caregiver, I travelled with my partially paralyzed employer to Lourdes.( caregivers get awesome rates, sometimes half price.)  I told her what she was seeing was a wax mask, and made the custodial priest admit exactly that.  They are not allowed to lie to pilgrims anymore. Bernadette’s corpse, initially, had a very lifelike appearance.  But after awhile her face turned black as coal.  My boss did not appreciate my truth-telling, and I was dismissed shortly after returning to the States for “breaking a dear lady’s heart.” But if you want to live in a lie, it better be a better one than that.  Same thing for the corpse of Saint Catherine Laboure, St. Vincent de Paul, all covered in wax. The head of Saint Catherine of Sienna is in an awful state, still on exhibition for some reason.  THAT is why the RCC takes no position on the SOT.  Embarrassing positions they have taken in the past, bowing and scraping and trading in pieces of so much jerked and dried meat in fancy glass coffins. As M Luther once joked, “19 of the original 12 apostles are buried in Spain.” Some of that pre Vatican 2 stuff is pretty much swept under the rug, and they have no plans to trot it out any time soon.","date":"October 11, 2013 at 10:18 am","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","title":"What did Stephen Jones just say?"},{"author":"josie_l_tyner","post":"What if there were an “official position” on the Shroud? What would it matter? Christ Himself said “Ye have seen and believed. Blessed are those who have not seen, yet believe!”  He also decried a generation as “faithless” who needed “signs and wonders” to believe. Why should the RCC take a position Jesus Himself would scarcely endorse as a desirable alternative to the trust in Himself He so wants us to have? There is much credible evidence that Shroud of Turin is authentic, and much learned academic study that can hardly be ignored that points to the contrary. I remember when the C14 test was the “last word, oh yeah, it’s a fake, everybody go home.” Well, it seems it was not the last word, after all. The RCC is VERY wise to admit, that, while a relic ‘worthy of veneration,’ so is every plaster statue of every saint and every mummified ‘incorruptible,’ jerked and de-hydrated in gilt glass coffins under layers of painted wax to hide their blackened, sunken faces. Given these ‘venerable’ examples, it is probably for the best the RCC make no extravagant claims to authenticity.  If I am wrong then perhaps a pilgrimage to the Holy Toe of Saint Dionysius the Areopagite might cure my gout, after all. Please take no offense to my humor, none is intended.  But I think my point is well taken.","date":"October 8, 2013 at 9:29 pm","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","title":"What did Stephen Jones just say?"}],"resources":[{"author":"josie_l_tyner","post":"Ummmm….Edmund Burke, a famous English jurist, said something I must write in paraphrase because I do not remember exactly his great saying. “There is nothing so inimical to the truth as the refusal to examine evidence.”  So I will download Mdme. de Sainte Simons’  book on Kindle, if such is available. It’s a cinch it’s not at the local library. The library system in North America is undergoing a “sanitizing” that includes the removal of great Christian works. Oh, you can find anything you want on Islam or Hinduism or Wicca, just don’t ask for a copy of Foxes Booke of Martyrs. EVER.Having said that, you are going to have a hard time selling the idea that Jesus appeared to anyone after His Ascension to a Protestant. Paul heard a voice and was struck blind, and that was it. St. John the Divine saw a vision, but whether he saw in the flesh or otherwise he wisely writes, he was in the Spirit on Lord’s Day, meaning, perhaps, he saw a vision.The RCC has claimed a lot of things, actually.  Without going from Wycliffe to Luther and beyond on what I don’t believe in, let me be a little more circumscribed: 1) How could Jesus pose for a picture 300 years after he died? 2) By the Vero-Icon, I assume she means the Veil of Veronica. Where is this veil, and is science allowed to examine it with the same rigorous attention given to the SOT? I do not mean the Cloth of Oviedo. There is some evidence it was found with the SOT. 3) You know what? An alien appeared to me and directed me to make a painting of him in his space ship. Not really, but you see my point.  4) Man, I would LOVE to see this photo of Jesus. Really. I mean, if there is a photo, maybe He will let us take another one, right?! Paul Vignon explained how the images of Christ tend to look like one another, and there is tangible, REAL evidence going back to the sixth century, a Byzantine coin reading “Iesu Christus Rex Reginarium ,” exhibiting almost every characteristic found on the Man’s face. There are many others. Tangible evidence, from history and archeology.  Well researched in the context of world history, examined by historians and scientists who have achieved pre-eminence in their fields of study. Stories about flaming hearts and Jeez -a-razzi,? Isn’t this why people think we should be wearing tinfoil hats?  This is in league with those sad, awful, blackened people-jerky covered in pretty wax and paint and displayed in Lourdes and other places.  ” A true, historical evidence??” History is not what someone claims to have happened, independently of any corroboration!!  Or doesn’t Her Ladyship get that? Let me tell you how I think he looked. In the Gospel, Judas identified Jesus with a kiss on the cheek. Why? Because He looked like everybody else. Not taller, not more handsome, he was so non-descript in His earthly walk, somebody needed to point Him out.“A true historical evidence?” Meh.  We’ll see.","date":"October 29, 2013 at 8:00 pm","url":"https://shroudstory.com/2013/10/28/new-book-by-dame-de-saint-simone/","cat":"books","title":"New Book by Dame De Saint-Simone"},{"author":"josie_l_tyner","post":"We are not going to have unbiased coverage from the media when it comes to the SOT or anything else regarding religion.  Catholics, Protestants, Orthodox, etc. have all been branded idiots by the media, regardless of our level of education or success.  And maybe that has more positive ramifications for the believer than we think. We will never, ever be friends of the world, we are hated of the world and will always be, we have had the highest assurance possible of this fact.  I was raised in an atheistic household, and had to do my research and reflection, although God leads us to Him by His own means and ways.  The author, typically, has failed to mention that NO medieval portrait of Christ, and no Renaissance portrait either, depicts Christ naked.  The medical accuracy of the Shroud had never been duplicated by a work of art, NO artist has ever gone that far in terms of morbidity or gruesomeness, not even  Matthias Gruenewald.  That the blood on the SOT is genuine is no longer in doubt, that the patterns of blood correspond with the stains of the Cloth of Oviedo has been established by forensic science.  That pollen corresponding to plants that bloom ONLY in Palestine in the Spring are on the SOT has been established by outstanding biologists in Jerusalem and Europe have been established as fact is not in doubt.  We might go on and on, and Carbon 14 tests done on the leg of a mammoth establish that it is 1000 years older than the head of the same frozen animal, but what of it? No evidence presented will be sufficient to move those who have established, a priori, that there are no miracles. All we can really do is wonder what motivates a journalist to write an article with no research behind it, and what motivates the journal to pay someone who writes this kind of poorly researched stuff.","date":"June 24, 2015 at 7:58 am","url":"https://shroudstory.com/2015/06/24/in-the-eyes-of-the-befuddled/","cat":"press_coverage","title":"In the Eyes of the Befuddled"},{"author":"josie_l_tyner","post":"* Got a look at Wikipedia at all three together. I’ll go with the Vera-Icon looks a lot like the SOT. * so can scientists examine it, or what?) But I want to get a look at the stills from the silent movie, “King of Kings: (1923?) because that face looks awfully familiar…","date":"October 29, 2013 at 9:19 pm","url":"https://shroudstory.com/2013/10/28/new-book-by-dame-de-saint-simone/","cat":"books","title":"New Book by Dame De Saint-Simone"},{"author":"josie_l_tyner","post":"Hugh, repeated the experiment with a plaster statue.  Baked at 500 F. Got a good deal of smoke and scorching of the linen cloth, but no imprint.  If Colin’s theory is anywhere near viable then it would HAVE to be, in my opinion, with a metallic statute made red hot.  I used two statues, a souvenir statue of a Mexican guy in a sombrero, and a plaster statue of Venus I found in a thrift (second hand) store. I also bought a statue of Mary but could not get the paint off.  For experiment #1 I cooked the Mexican guy with the cloth. Set off every smoke alarm in my house. For #2 I heated the Venus only, then wrapped the cloth around it.  In BOTH cases, the plaster CRACKED under intense heat so it would not be plaster, in the case of CB’s theory is right.  I have to go out into the country-side  next month to bust up a small goat shed. My son is coming with me and is going to help me get a major bonfire going. We are going to heat up an elaborately engraved iron trivet (don’t worry we never did like it much) and attempt to scorch more undyed linen.  I don’t think CB is right, but until all possibilities of this theory are experimented, I cannot rationally discard it.  I know it will scorch, but will it retain the amazing details in the photo negative? A number of films will also be taken. THIS ONE I will post the pictures. The others showed nothing one would not expect; just some non-descript blurs and smoky marks, on the linen used with the the statues, neither of which produced evidence even remotely validating CB’s theory of the heated statues.  Again, if CB is right, then the SOT characteristics should be inherent in the appearance of the positive and negative views of the pictures taken. I will keep the blog posted. best, JT","date":"November 2, 2013 at 10:09 am","url":"https://shroudstory.com/2013/10/28/new-book-by-dame-de-saint-simone/","cat":"books","title":"New Book by Dame De Saint-Simone"}],"textile":[{"author":"josie_l_tyner","post":"How is it that this is the ONLY such cloth ever found??  Tens of thousands of people crucified, buried, but this is the only surviving cloth?  How is “Yussuf Shmoe” has the exact same documented, down to the letter identical wounds and torture marks as Jesus, or was crowning with thorns a daily occurrence, maybe some sort of Hebrew custom we know nothing about?!  BTW, How is it Y.S. is about a foot longer in the back than he is in the front, is that a common occurrence as well? The more “scientific” explanations people try to come up with, the more ridiculous they sound.  If this is a natural phenomena, then reproduce it.  Should be easy, right? Then do it. Or shut up, and get down on your knees with the rest of us.","date":"August 17, 2013 at 6:30 pm","url":"https://shroudstory.com/2013/08/14/or-it-is-the-first-century-burial-cloth-of-yussuf-schmoe/","cat":"other_blogs","title":"Or it is the first century burial cloth of Yussuf Schmoe?"}]}
