{"art":[{"id":"comment-5668","author":"joy","post":"Ronnie, God has not stopped believing in you! =) He is passionate in his thoughts of hope, love and a great future – on purpose, just for you. If you have a bible, take a look at Jeremiah 29:11. And… I promise (more importantly God promises) that there is HOPE for your future. Lots and lots and lots and lots and lots of and lots of hope for YOUR future. I think that depression and low spirit comes from pushed down anger. Anger can stem from fear, guilt or feelings of lack of self worth or not realizing how you are truly valuable and valued by God. Fear, anger, guilt and condemnation (self contempt??) may come from lying thoughts about how God sees you and thus how you respond to Him. God is not angry or disappointed. He is pleased with you and would like you to talk to Him – no matter what condition you are in. Ronnie, He wants a one on one relationship with you. He wants to hang with you, to kick it with You. The bible says he can’t stop thinking about YOU. Regarding the painting: I can see that the expression in the eyes could come across intimidating. Perhaps it is to show you that the root of the depression is from false fear: that is: insecurity (not feeling safe) and inferiority (not feeling valued or valuable). The only “right” fear is that of respect for God and proper respect for ourselves and rightful authority. Any other kind of fear is to keep us from trusting God’s amazing grace, love and mercy. The Bible says perfect love drives out fear and that he who fears is not made perfect in love. It says fear has torment. I think this is related to the fear of punishment. Punishment is related to guilt for wrong doing – but when we place our trust in the fact that Jesus took the punishment for our wrong doing — we have peace with God. Jesus took all of the punishment for us – so that God could lavish upon us ALL of is love. This is love, not that we love God, but that he loved us and gave Jesus (his son) to be the atoning sacrifice for all our wrong doing. For God so loved the world that he gave his only begotten Son, that whosever believes on Him should not perish, but have eternal life. John 3:16 God did not send his Son into the world to condemn the world, but that the world through Him might be saved. John 3:17 Please ask Him to help you trust Him – and he will. Kindest regards..","date":"2011-12-18","mins":"4:43 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
