{"history":[{"author":"juliet_faith","post":"Well done Pam…this is brilliant and informative work!\n\n","date":"June 5, 2013 at 2:40 pm","url":"https://shroudstory.com/2013/06/05/paper-chase-two-new-history-papers-by-pam-moon/","cat":"history","title":"Paper Chase:  Two New History Papers by Pam Moon"},{"author":"juliet_faith","post":"To Max Patrick Hamon…very interesting comments…have you ever seen a picture of the Cameley Head? (the other head that I refer to in my first reply).\n Google it and take a look…I would be interested to know what you (and Mr Rinaldi ) think\n!\n\n","date":"April 27, 2013 at 1:53 pm","url":"https://shroudstory.com/2011/01/18/templecombe-and-the-shroud-of-turin-continued/","cat":"history","title":"Templecombe and the Shroud of Turin (Continued)"},{"author":"juliet_faith","post":"Thank-you for the article. I am a Historian and Author, who has studied and written about the Templecombe panel. I have also had two recent visits by Rex Morgan, who has assisted me with all his research papers, including lab results of particulate samples taken from between the grooves of the Templecombe panel by his collegue Dr E. Nitowski, which provided some very interesting results. \nThe Carbon 14 dating for this artifact is between 1280 and 1340. It now hangs in a special exhibition room at the Bishops Palace, Wells, Somerset.\nAre you also aware that another ‘head’ exists? It is from Temple Cloud Somerset. This head is wooden, and carved in relief. It has recently been Carbon 14 dated, and is of almost identical date to the Templecombe panel. The chuch where it was found was in the possesion of the Knights Templar.\nI would argue that there is a strong possibility that this is another example of a Templar ‘Idol’, or as Dr Frale would say ‘Simulacra’. \nAll this, including Dr Nitowski’s findings, and Rex Morgan’s research are included in my latest book ‘Glastonbury, the Templars and the Sovran Cloth’ published by the History Press 2012.\n   Juliet Faith\n\n","date":"April 26, 2013 at 3:18 am","url":"https://shroudstory.com/2011/01/18/templecombe-and-the-shroud-of-turin-continued/","cat":"history","title":"Templecombe and the Shroud of Turin (Continued)"},{"author":"juliet_faith","post":"If an image of the Cameley head is overlaid on the Templecombe panel painting it matches almost exactly. It is a life sized head which would origially have been painted, with wide open eyes an open mouth, long hair and a forked beard, it also has a trellis frame or border often seen in examples of the Manylion.\n The C.14 dating of this head, which was recently undertaken by the Oxford lab dates it between C.1280 – 1341, it is made of oak.\nIt was found in a Templar church, and local tradition says it is Templar.\nIf another identification can be made I am prepared to be pursuaded! \nFor now though it seems to fit the picture of  the Templar idol. I refer again Dr Frales comments on the ‘cult of the Simulacra’  a cult which was introduced to Britain by the Templars and emerged in Britain ‘in the late 1200’s.\n\n","date":"April 28, 2013 at 3:22 am","url":"https://shroudstory.com/2011/01/18/templecombe-and-the-shroud-of-turin-continued/","cat":"history","title":"Templecombe and the Shroud of Turin (Continued)"},{"author":"juliet_faith","post":"Dr Gowlett of the Oxford Radiocarbon Excelerator Unit (ORAU) examined the samples, and his conclusion was that the wood was cut between 1280 and 1310 plus or minus 60 years. He added that the wood was cut in the early Mediaeval period.\nObviously there is no way at present to prove when the image was painted, he observed that it could be as late as 1440, however during the Mediaeval period wood was usually used ‘in the green’.\nI agree that the head could be Hospitaller, but in view of the accusations of heresy levelled at the Templars for ‘worshipping’ a disembodied bearded head, one may consider it a little foolhardy of the Hospitallers to paint an image that could invite accusations of the very same?\n\n","date":"April 27, 2013 at 3:11 am","url":"https://shroudstory.com/2011/01/18/templecombe-and-the-shroud-of-turin-continued/","cat":"history","title":"Templecombe and the Shroud of Turin (Continued)"}],"image":[{"author":"juliet_faith","post":"I have to say, I thought it was a rather strange experiment for Barrie to be involved with…..\n\n","date":"June 3, 2013 at 3:09 pm","url":"https://shroudstory.com/2013/06/03/a-completely-inappropriate-experiment-nice-white-lab-coats-anyway/","cat":"image_theory","title":"A completely inappropriate experiment. Nice white lab coats, anyway"}]}
