{"history":[{"author":"julian","post":"From the article: Several findings indicated that the Shroud’s images were from Israel and apparently in the spring of AD 30 due to the identification of 28 species, 20 of which grow specifically in Jerusalem and the other 8 within a 12 mile radius of Jerusalem, and with a common blooming time of March and April which would have been around the Passover, the time that Jesus was crucified.\nHow much of this has been verified?\n\n","date":"August 17, 2014 at 11:35 pm","url":"https://shroudstory.com/2014/08/17/evidence-of-the-resurrection/","cat":"history","title":"Evidence of the Resurrection?"}],"image":[{"author":"julian","post":"If the image on the Shroud was indeed formed because of some miraculous event, then the closest we can come to reproducing the image (short of another miracle) will only be analogical in form, and therefore resemble Cargo Cult Science.\n\n","date":"April 2, 2015 at 4:05 am","url":"https://shroudstory.com/2015/04/01/cargo-cult-image-formation-science/","cat":"science","title":"Cargo Cult Image Formation Science"}],"events":[{"author":"julian","post":"Authenticity is not a focus of debate and action?\n\n","date":"May 3, 2015 at 4:39 am","url":"https://shroudstory.com/2015/05/03/the-experts-of-the-shroud-in-conference/","cat":"2015","title":"The Experts of the Shroud in Conference"}],"misc":[{"author":"julian","post":"Piatt: I wonder if Jesus had any idea what a great setup for nut jobs he was leaving behind when he said he’d come back some day.\nMatthew 24:   23 Then if anyone says to you, ‘Behold, here is the [l]Christ,’ or ‘[m]There He is,’ do not believe him. 24 For false Christs and false prophets will arise and will [n]show great [o]signs and wonders, so as to mislead, if possible, even the [p]elect. 25 Behold, I have told you in advance. 26 So if they say to you, ‘Behold, He is in the wilderness,’ do not go out, or, ‘Behold, He is in the inner rooms,’ do not believe them. 27 For just as the lightning comes from the east and flashes even to the west, so will the coming of the Son of Man be. \n\n","date":"August 8, 2014 at 11:00 am","url":"https://shroudstory.com/2014/08/07/christian-piatt-jesus-told-me-that-the-shroud-of-turin-was-his-photograph/","cat":"news_&_views","title":"Christian Piatt: Jesus told me that the Shroud of Turin was his photograph."},{"author":"julian","post":"Hi Mike,\nYes, this is the Shroud Story Blog, which is a blog that is willing to question what is perceived by the majority of people to be the correct view of what the Shroud was.  I, too, question the majority view on the Shroud, and have learned much by visiting this blog.  But I’m willing to question the majority view on other matters, especially when a large group of experts also question the majority view.  I’m willing to let the matter rest there, though I’m curious:  what is your criteria for when to question the majority view and when not to question it?\n\n","date":"March 20, 2014 at 10:30 pm","url":"https://shroudstory.com/2014/03/17/the-shroud-of-turin-is-number-11-in-cnns-list-of-top-11-mysteries/","cat":"news_&_views","title":"The Shroud of Turin is Number 11 in CNN’s List of Top 11 Mysteries"},{"author":"julian","post":"Hi Mike, \nSo the official explanation of who assassinated JFK is Lee Harvey Oswald; RFK’s is Sirhan Sirhan; the Shroud of Turin is a 14th century forgery; and WTC7 is anything but a controlled demolition.  On this last one over 2,100 architects and engineers and I will agree to disagree with you and NIST:\nhttp://www.ae911truth.org\n\n","date":"March 20, 2014 at 9:32 pm","url":"https://shroudstory.com/2014/03/17/the-shroud-of-turin-is-number-11-in-cnns-list-of-top-11-mysteries/","cat":"news_&_views","title":"The Shroud of Turin is Number 11 in CNN’s List of Top 11 Mysteries"},{"author":"julian","post":"Hi Mike, \nFirst, like you I am a Christian, but not because of the Shroud, nor do I believe the Shroud is authentic because I am a Christian.  I probably haven’t studied it as much as you, but when the radiocarbon date came out to be the 14th century, I was puzzled, since we still had the mystery of how the image was formed.  But I accepted that it was a forgery, since the hard scientific evidence seemed to prove that it was.  It was only when I discovered this website (a year ago?) that I found out that there is strong reason to contest the radiocarbon dates.  Now I only wish new tests would be conducted to lay to rest any doubts about the date.  If it turns out to be authentic, then I suspect God preserved the Shroud for significant reasons, such as a testament to the existence of Jesus at a time when Mythicists are enjoying so much renewed popularity.  \nAs to 9/11, once I found out that there is a significant number of building experts who reject the official explanation for the collapses of all three WTC buildings, that was enough for me to question the official account.  Until there is a new, independent investigation, I won’t be satisfied. \nIt is irrelevant whether the terrorists flew planes into the WTC1 and 2.  The question remains, what brought them and WTC7 down ?  AE911truth maintains that it was controlled demolitions, and there is at least some physical data that seems to support their contention.  If they are correct, then we can ask other questions, such as who, how, and why?  Given the tremendous increases in defense and security spending that has been justified by 9/11, along with the tremendous increases in power for the intelligence community, I think it’s rather easy to find motives for 9/11, besides just terrorism. \nLike the Shroud, I suspect that God made sure WTC7 happened in plain sight (there is some evidence that it was originally intended to bring it down while the dust clouds from WTC1 or 2 would have made viewing WTC7’s collapse impossible) for those willing to follow the truth wherever it might lead:","date":"March 22, 2014 at 11:00 am","url":"https://shroudstory.com/2014/03/17/the-shroud-of-turin-is-number-11-in-cnns-list-of-top-11-mysteries/","cat":"news_&_views","title":"The Shroud of Turin is Number 11 in CNN’s List of Top 11 Mysteries"},{"author":"julian","post":"I think President Eisenhower would have warned you to keep your eyes on all your enemies, including the military/industrial complex:  ","date":"March 23, 2014 at 2:27 pm","url":"https://shroudstory.com/2014/03/17/the-shroud-of-turin-is-number-11-in-cnns-list-of-top-11-mysteries/","cat":"news_&_views","title":"The Shroud of Turin is Number 11 in CNN’s List of Top 11 Mysteries"},{"author":"julian","post":"I thought I posted a link to a youtube video of President Eisenhower’s warning about the military/industrial complex, yesterday.  I don’t see it today, which I think means that Dan deleted it.  But just in case he didn’t delete it, and I just goofed somehow, I’ll try one more time.  If it isn’t there tomorrow, I’ll take the hint. ","date":"March 24, 2014 at 9:55 am","url":"https://shroudstory.com/2014/03/17/the-shroud-of-turin-is-number-11-in-cnns-list-of-top-11-mysteries/","cat":"news_&_views","title":"The Shroud of Turin is Number 11 in CNN’s List of Top 11 Mysteries"},{"author":"julian","post":"I wonder where they would rate the collapse of WTC7 on 9/11.\n\n","date":"March 18, 2014 at 9:04 pm","url":"https://shroudstory.com/2014/03/17/the-shroud-of-turin-is-number-11-in-cnns-list-of-top-11-mysteries/","cat":"news_&_views","title":"The Shroud of Turin is Number 11 in CNN’s List of Top 11 Mysteries"},{"author":"julian","post":"You’ve got me curious, ek.  What exactly does every Muslim think they hit WTC7 with?\n\n","date":"March 19, 2014 at 6:24 pm","url":"https://shroudstory.com/2014/03/17/the-shroud-of-turin-is-number-11-in-cnns-list-of-top-11-mysteries/","cat":"news_&_views","title":"The Shroud of Turin is Number 11 in CNN’s List of Top 11 Mysteries"},{"author":"julian","post":"Oh, it just occurred to me, ek, that maybe you haven’t seen footage of the collapse of WTC7, the third skyscraper that collapsed on 9/11.  This is a good compilation of different views of it: \nhttp://m.youtube.com/watch?v=bWorDrTC0Qg\n\n","date":"March 19, 2014 at 6:29 pm","url":"https://shroudstory.com/2014/03/17/the-shroud-of-turin-is-number-11-in-cnns-list-of-top-11-mysteries/","cat":"news_&_views","title":"The Shroud of Turin is Number 11 in CNN’s List of Top 11 Mysteries"},{"author":"julian","post":"Hi M, \nYes, but exactly how did Osama bring down WTC7?\n\n","date":"March 19, 2014 at 10:35 pm","url":"https://shroudstory.com/2014/03/17/the-shroud-of-turin-is-number-11-in-cnns-list-of-top-11-mysteries/","cat":"news_&_views","title":"The Shroud of Turin is Number 11 in CNN’s List of Top 11 Mysteries"}],"resources":[{"author":"julian","post":"If I understand the main objection to the work of Lazarro et al, it is that positing that the image on the Shroud was caused by some sort of ultraviolet laser radiation would be the same as suggesting that something miraculous had taken place.  Is that correct?\n\n","date":"April 14, 2015 at 6:06 am","url":"https://shroudstory.com/2015/04/14/interview-with-paolo-di-lazzaro/","cat":"article","title":"Interview with Paolo Di Lazzaro"},{"author":"julian","post":"If I understand Di Lazarro’s comment, he is saying: (1)  His experiments came close to producing the same kind of marking, but still measurably different in some way; and (2) yet he can predict what would produce the exact same kind of marking.\n\n","date":"August 11, 2015 at 8:06 am","url":"https://shroudstory.com/2015/08/11/tantalizingly-close-enough/","cat":"article","title":"Tantalizingly Close Enough?"},{"author":"julian","post":"Then it seems to me that Di Lazzaro may have made a scientifically significant prediction.\n\n","date":"August 11, 2015 at 9:22 pm","url":"https://shroudstory.com/2015/08/11/tantalizingly-close-enough/","cat":"article","title":"Tantalizingly Close Enough?"},{"author":"julian","post":"I’m curious what is meant by “Alien Saviors” in the last chapter.\n\n","date":"September 2, 2015 at 5:19 am","url":"https://shroudstory.com/2015/09/02/non-fiction-the-vatican-prophecies-available-september-15/","cat":"books","title":"Non-Fiction: The Vatican Prophecies Available September 15"}],"sudarium":[{"author":"julian","post":"Has the Sudarium been radiocarbon dated?\n\n","date":"April 6, 2015 at 1:07 pm","url":"https://shroudstory.com/2015/04/06/new-paper-on-the-sudarium-of-oviedo/","cat":"sudarium","title":"New Paper on the Sudarium of Oviedo"}]}
