{"image":[{"author":"k_hef","post":"Incidentally,People who were deemed worthy of being crucified were usually left on the cross to be eaten by birds. They were not given a proper burial, which is why Jesus did not recieve one. Not even the families of the deceased could take their dead. They were left out to rot. So it WAS something special when Joseph of Arimathea went to Pilate and asked for the body of Jesus, took Him and wrapped Him in a clean linen cloth, and placed him in the tomb. (Matthew 27:59-60)If this does not convince you, I hope you would take notice to the fact that the new investigation done on the Shroud has concluded that the image is not of dirt or sweat. They have no idea what it is, and it is proven that the blood IS human blood. Also, even IF the body was cleansed, Jesus suffered so greatly that his wounds were extremely deep. Even after a traditional cleansing, the stains would still have been left. He most likely had little or no skin left on his back after the stripes he recieved. In the Old Testament, the sacrificial lamb’s back was skinned to insure it was as pure inside as it was out. As most of us understand and know to be true, Jesus is the eternal sacrificial lamb. To have no skin on your back and then be wrapped in a cloth would produce enormous blood stains.My faith is not based on the Shroud of Turin. I think it is a haunting example of what Jesus suffered through. I also think it is interesting that it has stumped scientists. Even they have come to the conclusion that, if put in front of a jury, the Shroud of Turin would be voted authentic according to the information they have.God has a sense of humor, and I believe in my heart that the Shroud is authentic. I believe that even if its not, God keeps it here as a reminder to us that we should be eternally greatful to Him.","date":"April 19, 2010 at 12:00 am","url":"https://shroudstory.com/2008/09/30/inexplicable-3d-optical-illusion-phenomenon/","cat":"image_theory","title":"Inexplicable 3D Optical Illusion Phenomenon"}]}
