{"art":[{"id":"comment-3588","author":"kac","post":"I read this book and cried over one main thing….you see, I’ve been a believer for a long, long time. Am 41 years old, but started to really get what God was about when I switched churches and started going to a bible church in 1999. I don’t doubt that God exists, I don’t doubt that Jesus walked this earth…but sometimes life is so very hard. I have been married for 3 years…and about 1 1/2 years ago, my wife and I had a miscarriage. This was very painful for my wife and myself. We have been struggling to conceive and sometimes I begin to wonder “will I ever become a father”. After reading this book, and Colton’s account of meeting his unborn sister, I now know that I am a father and I will be able to meet my child someday in heaven. This is very comforting to me…even though I’m in tears while writing this response. I am really looking forward to going to heaven to him/her..","date":"2011-08-12","mins":"9:57 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3600","author":"kac","post":"Rosanne…thank you for your encouraging words. I really appreciate your prayers. Ezekiel, thank you as well for your words of warning which are very biblical. I think that we all do need to be very careful and to recognize his voice. I do think, though, that this book had very interesting points. While at church a few years ago, I had heard a sermon where the preacher brought up an interesting survey of emergency room doctors, where there had been many life after death experiences. It was interesting to hear how many patients would talk about heaven/hell. Colton did bring up some things in discussions that I believe were biblically related and matched in with the word very well. What we all need to watch for, though, are times where people seem to be talking about the word of God, but when you do biblical reading yourself and look into what they say, it doesn’t line up with the Bible. Example, Jehovah’s Witnesses. Upon looking at the bible, it looks like what they believe lines up with the bible…but when you study the bible, then you realize that it really doesn’t line up. Looking and studying, I think, are 2 completely different things. If you search for God and really delve into His word…then you will find the truth in God and in God alone. Peace be with you all, may God bless you richly, may grace that only comes from Him be with you and may all that read these words know that Jesus is the Only Way!.","date":"2011-08-13","mins":"5:13 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
