{"art":[{"author":"kandy_j","post":"WOW, so much fear, I had no idea but I feel compelled to give you reassurance as i did with Jane.  Please accept my copy and paste of my response to Jane as it applies to you as well dear Senior!\nI felt your fear and I had to respond. Please believe me when I tell you, dying, for your consciousness which is in your SOUL is nothing but a breath… I can’t speak to what physical condition you may be in at the hour of your passing, but as for your “heart”, your “mind”, your soul, it is SO easy! You will surely laugh to yourself and say, “Are you kidding me? This is what dying is?” Seriously, it is easier than opening your eyes or taking a breath! DO NOT fear your physical death because LIFE is all about your spirit! That lovely vessel your soul resides in is just a body of flesh and is nothing more than a glove or sock you’ve worn all your physical life, that’s all. TRUST me, I have left my body and come back. It is NOTHING, and so easy, it’s the coming back into your body (if that is the plan) that is slightly uncomfortable. \nGod loves you dear one, trust in God, PRAY PRAY PRAY, you will have a whole crowd of loved ones waiting at your passing just to welcome you HOME and into the arms of Jesus. Heaven will no doubt be all we have been told and thousands and ten thousands fold more<3 I will see you there one day too! Look for me and tell me how right I was and then we will both laugh together! God Bless and have no fear dear friend in Christ.  \nI also had feared death, but not for the pain or scariness of it, because I had already left my body before, but I had been worried I may not have enough time on earth because I too LOVE this BEAUTIFUL and amazing creation of Earth that our heavenly Father has given us, and I also LOVE my family and friends with a passion that could only come from God Himself.  I often have to ask God to not take offense at my requests to live a long (100+yr) life just so I can see it all and love as many people as I can.  BUT death, where is thy sting?  There isn't any, as long as you are right with God that is.  I would never lie to anyone about this, passing on to the next dimension is a wonderful amazing experience and no wonder those who have did NOT wish to come back, even when they had a good life or loved ones still here, it's THAT good!  NO FEARS, only LOVE.\nGod Bless you my friend in Christ <3<3<3\nI\n\n","date":"October 19, 2012 at 4:31 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"kandy_j","post":"Jane, I felt your fear and I had to respond.  Please believe me when I tell you, dying, for your consciousness which is in your SOUL is nothing but a breath… I can’t speak to what physical condition you may be in at the hour of your passing, but as for your “heart”, your “mind”, your  soul, it is SO easy!  You will surely laugh to yourself and say, “Are you kidding me?  This is what dying is?”  Seriously, it is easier than opening your eyes or taking a breath!  DO NOT fear your physical death because LIFE is all about your spirit!  That lovely vessel your soul resides in is just a body of flesh and is nothing more than a glove or sock you’ve worn all your physical life, that’s all.  TRUST me, I have left my body and come back.  It is NOTHING, and so easy, it’s the coming back into your body (if that is the plan) that is slightly uncomfortable.  God loves you dear one, trust in God, PRAY PRAY PRAY, you  will have a whole crowd of loved ones waiting at your passing just to welcome you HOME and into the arms of Jesus.  Heaven will no doubt be all we have been told and thousands and ten thousands fold more<3  I will see you there one day too!  Look for me and tell me how right I was and then we will both laugh together!  God Bless and have no fear dear Jane<3\n\n","date":"October 19, 2012 at 4:14 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"kandy_j","post":"To Lynne, beautiful points you made for Jane!  I look back over my life and I can see where I have had the most fear and depressions and they were ALWAYS when I was NOT praying as much as I should.  YES we are to PRAY PRAY PRAY, it is said the Virgin Mary when she appears to anyone she often reminds us to do so.  How’s THAT coming from a non Catholic?  Oh yes, Lutherans LOVE the Virgin Mary TOO despite what some folks may say :P seriously, the mother of Jesus?  I just hope she loves ME!  Haha, I joke, but we are all so serious here (and rightfully so) but God gave me the giggles too, so out of pure happiness I kid around.  But ya, good points about how Jane loves her animals… I too pray our pets have souls (they certainly possess energy)  and that God fancies them enough to give them life after death.  But I don’t know for sure and so I only hope.\nGod Bless all you dear ones<3<3<3\n\n","date":"October 19, 2012 at 4:50 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"kandy_j","post":"I am so sorry for your painful experience, I had a similar one and I believe you dear one.  Thank God Jesus came to you.  I believe someone pulled me up, (my spirit) out and away during my attack but I could not see anyone with me but felt safe, quiet and peaceful until my spirit had to return to my body.  But for that (relatively) short period of time, I was spared the trauma of feeling the attack that was happening to my body down below (my spirit was held up near the ceiling of the room) and I chose not to watch what was happening to me.  I thought my perpetrator was killing me, had no idea what sex was whatsoever, so I basically I believed I was “scared to death” and my spirit fled.  I wish I could have known for sure if I did that myself or if an angel or Jesus or a past relative did that for me, because I just don’t know or can’t remember :(  BUT I got from that what I NEED, that there really IS a life after death, we have a soul and death (simply our body’s ceasing to live and the release of our soul from it) is nothing more than a breath you take, has given me a certainty no one could ever shake.  I KNOW.  WE KNOW Rosalie<3\n\n","date":"October 19, 2012 at 5:44 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"kandy_j","post":"Annie Cee, AMEN!  I LOVE your insight.  That’s why I consider the Bible the LIVING WORD of GOD, not just some book thrown together by men.  Face it, If YOU were God and you only had one book on Earth that was to provide all the knowledge mankind would ever need in order to live a good life and to learn who you, their God was and what your will fro them was,then wouldn’t you, an all powerful and all knowing God be capable of making sure it is created perfectly and remained intact and accurate for all time?  I never hold or regard any Bible as if it is just a wonderful Historic record or book, I hold it with the regard that I am in the presence of God Himself, I am holding his loving heart and perfect mind.  His living and breathing map to all that He is and all that ever was or will be.  That is also why reading aloud the words therein is a spiritual matter.  It is wise to pray before you even open it, IMO.\nThanks for being a blessing here<3\n\n","date":"October 19, 2012 at 6:20 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"kandy_j","post":"HA!  There ya GO Teriann!  Someone thinking outside the box good job!  \nI have no trouble believing in Christ, God the Father, Son & Holy Spirit (the Trinity) Heaven, Hell & “you know who”, the Bible being the perfect complete Living Word of God, any of it, & I owe that FIRST to God’s Grace, & also to the fact God placed me into a Christian family where I was Baptized & raised as a Missouri Synod Lutheran (not to brag but just to be factual here) & that one day when I was 8 & while under extreme distress, had an out of body experience which I didn’t fully understand until I grew up.  I had not told anyone about it because of the continued stress I had lived with for years, but God set me free from all that as an adult & then I was able to speak of it… I never forgot about it, I just didn’t talk to anyone about it.  Back then there wasn’t any talk about that sort of thing, certainly not in MY home & not on any TV shows at that time.  What I experienced had no references I could even relate it to, nothing until I became an adult & could find the words to fully explain it.  NOW when I hear about people’s out of body experiences I feel SOOOO fantastic & happy & it makes me cry, so many emotions because finally what I went through has a name & a reasoning to it.. MAN you have no idea how GOOD it feels to know it wasn’t some crazy imagined moment even though all your life you can recount it like it was yesterday & KNOW in your flesh and your heart that, without any doubt, it was REAL.\nWhen your soul leaves your body YOU KNOW IT & it’s the return to your body that REALLY makes it clear you’ve left in the first place… so when someone speaks about the afterlife, or an out of body experience I KNOW what they are talking about and am so happy to know they have been given a rare and gracious gift!  I’ve been on the other side (of my body only) before & I thank God for that.  In trying to understand why God let my soul leave my body, I thought, maybe, although God knew I would be raised in a Christian home with a Christian education, maybe something would have threatened my belief down the road & so God gave me that experience to reassure me during the bad times, or maybe He was just allowing me that experience to protect me from the extreme pain of the attack I was going through, I don’t know right now, but one day I will have complete understanding & if that’s after I die, fine.  I don’t NEED to know the reasons why. I feel God’s LOVE every time I think of it and I know He took good care of me during the most traumatic time in my young life.  I can hardly wait to run up to Him in Heaven, fall at His feet & praise Him eternally for His Gracious LOVE & mercy!  NEVER DOUBT that God is Real and He LOVES us and cares about YOU.  NEVER never doubt it.  If you don’t know God just ask Him to open your heart, tell him you’re sorry for your sins, He will forgive anything a sincere and contrite heart confesses!  He KNOWS your heart and every fear and burden you suffer with.  God will bless you.  God loves you, Jesus loves you and I do too.  And you know what else?  You have thousands of souls just out of your human vision who love you too and only want you to receive all the heavenly gifts of the faithful and blessed who have already crossed over.  You are never alone.  And yes, that’s a good thing<3<3<3\nAnd that is why I am so glad to have an artist's rendering from someone who probably has SEEN Jesus \"face to face\".  It is truly beautiful and gives me so much comfort to see it.  I use to feel so bummed over God not speaking from the burning bush like back in the day, but now, we here in these times have other opportunities to \"see the face of God\", just don't write them off as fantasy or some malfunction of the human brain during some physical/medical event.  God is right behind you dear and IS invested in all the petty and little things in your life, so don't tell yourself otherwise… why would you want to? \nSorry I took up so much space, I felt overwhelmed.. never posted anything about this issue before (afraid to) and I'm getting too old to die without sharing the truth with others… maybe I'm suppose to?  God Bless you dear brothers and sisters<3<3<3\n\n","date":"October 19, 2012 at 12:59 am","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud"}]}
