{"art":[{"author":"karen","post":"I read Heaven is for Real last week and was compelled to follow it with Akiane’s two books after googling her painting of Jesus and there is no doubt in my mind that God has given this girl a gift.  I have not stopped thinking about Jesus since I read her book and Colton’s story, so my googling led me to this page.  I read over 150 comments here and I”m so moved by them all.  It is so nice to know that there are others in this world who feel the same, since for me it’s been so long I’ve felt that anyone in my life is connected with God.  It seems to me that my faith was so strong when I was a child, so much so that after my mother stopped taking me to church, I continued to do so on my own and even attended a religious camp as a pioneer girl.  I’m 40 now and although I never doubted my faith in God or Jesus, I stopped thinking about Him, even hardly prayed out of guilt for becoming a sinner.  A few days after reading Heaven is for Real, I watched my 2 1/2 year old son skip through a swarm of flying bugs, waving his arms up and down while laughing.  It amazed me how this was so new to him and I realized how innocent he was at that moment when I thought to myself, wow, I was about to yell to him to stop because I didn’t want him to get bit or to swallow one.  He was having so much fun, nothing mattered to him.  He did not get bit and if he swallowed one, he never complained, so I just sat and watched him play through the bugs recalling a time in my life where I used to let ants crawl over me, catch lady bugs, chase butterflys, jump in rain puddles, roll down hills and these memories made me smile.  In response to Ariel’s comment #39 where she said, “I belive God has put these children on Earth to remind us to have faith as a little child, as Jesus said, ‘Let the little children come to Me, and do not forbid them; for of such is the kingdom of God. Assuredly, I say to you, whoever does not receive the kingdom of God as a little child will by no means enter it.’ Mark 10:13-16,” ….this is what I think he also may have had in mind.  For us to be at peace with others, but especially ourselves, like our children.  I, at the age of 40 with some painful parts of my past, have become, I guess you could say a little “worn and worried,” where my 2 year old has the world ahead of him and is full of happiness and eager to learn and explore.  It’s no wonder why Jesus LOVES all children, because they are pure and honest and happy. I must admit that after reading about Colton and Akiane’s experiences, my eyes have been re-opened and I’m feeling more peaceful and reconnected with God. I BELIEVE!!!\n\n","date":"March 27, 2012 at 2:30 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
