{"art":[{"id":"comment-18484","author":"karen_reid","post":"I can’t believe that person after person misses this. I saw Colton on numerous talk shows, and he repeatedly points proudly to where the “markers” were on Jesus’ palms and feet. He points to the centers of his palms and feet. Sorry to expose Colton’s lack of truthfulness, but Jesus was crucified in the WRISTS and HEELS of his feet to keep the body on the cross. Also, Moses and Elijah appeared to Jesus in the presence of the disciples John, James and Peter, and I’m quite sure they would’ve thought they were angels if they’d had wings. Jesus is now in His glorified state and looks nothing like He did on earth. Isaiah 53: 2 says “He had no beauty or majesty to attract us to him” in his prophecy of the coming Messiah. Has anyone ever read John’s description of Jesus in the Book of Revelation? He was so glorious that John fell at His feet “as though dead.” Please read the Book of Revelation. And Colton’s great grandfather had to ASK if he were Todd’s son–yet his unborn sister somehow KNEW she was his sister (?). There are so many discrepancies in this book alone much less discrepancies from the Word. And Colton’s pastor father says he’s convinced that God had to turn His face away from Jesus on the cross because he wouldn’t have been able to go through with it if He continued looking. How could a PASTOR be so blind? God turned His face away from Jesus on the cross because He had laid our sins on Jesus and poured out His wrath on Jesus. Jesus took our punishment for us, and that included God turning His face away from Jesus in our place. Also, Akiane admits she based that picture of Jesus on a carpenter who came to her house one day–she used a human model, but there’s Colton saying “Dad, that’s it.” And regarding Jesus supposedly refusing to give Colton a sword in heaven because it would be too dangerous; there IS no danger in heaven. The Burpos would do well to read what happened to Ananias and Sapphira in the Book of Acts when they lied to God. Don’t these people have any fear of God? And all of us, myself included need to read more of the Bible; why is everyone so excited about what this child says and not what Jesus Himself said in the Gospels and people with firsthand knowledge like the disciples?.","date":"2012-10-29","mins":"12:15 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
