{"art":[{"author":"katina","post":"I have been following the continually keeping up with the research on the Blessed Shroud – the living manifestation and reflection of our Christ.  The latest book, of 2012, have even some staunch skeptics leaning to its authenticity.  This has been of core interest to me, since my grandmother’s repeated daily narrative of what happened to her in 1938, in a NDE, while delivering a baby at an advanced age.  She grew up in the depression, and never had modern day public book considerations.  Back then, the scope to which you could communicate your accounts were more limited.  However, simply to reveal the awestaking truth, she spoke of how she encountered an angel like figure on a hill that allowed her to look backwards to her earthly station or forward, and elect a choice.  The experience was as real as the reality of every day conditions. She recanted this experience almost daily for over 40 years, so we know that its impression was that of real occurence.  Also, I would recommend the book of Sr. Faustina’s life.  She, being one the most recent saints of our century (during WWI in Poland), accounts her encounter with Jesus, and thereby put forth the Divine Chaplet of Mercyto be prayed on the Feast of Mercy, the 1st Sunday after Easter, and for the sick and dying.  Reading this saint’s lifestory and detailed diary will sow the initial seeds of profound interest on this topic.","date":"January 3, 2013 at 2:56 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"katina","post":"Diane, and everyone.  Thank you for sharing your accounts.  They really came to on a day that they spoke right to my circumstances.  – as well as the circumstances of things in general, and the trouble in making sense of things with respect to the problem of pain.Please always feel free to make contact if you ever need to.  You’re truly a blessing and awitness.","date":"January 3, 2013 at 3:42 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"katina","post":"I have long followed the subject the most recent findings on the Blessed Shroud.  It has been of core interest to me.  And, the my recently written book, of 2012, has some previously staunch academic skeptics, altering previous positions.  My grandmother from Poland, who had a NDE, while giving child birth, had no abilities for widescope communication at that time, due to limitations in such areas during that era.  She grew up during the depression, and was of sound mind and strong work ethic. She said that she guided up a hill, and led by an angelic type figure who allowed her to look back to her station in life, or forward.  The experience was as real as her every day living experience.  She recanted this experience for 40 years, in such a real way and repetitious way.Every time we saw her she brought it up, solely for the purpose of sharing this awestaking truth.  For anyone, interested in the account ofone of the most recently living saints,I recommend reading the Diaries of Sr. Faustina, a Polish saint who encountered Jesus in 1931.  It is profoundly moving as a witness narrative, of the impetus for the Divine Chaplet of Mercy, which is to be said  on the Feast of Mercy, the first Sunday after Easter, and for the sick and dying.  It will sow growing seeds of interest and truth, which speak to this very topic.","date":"January 3, 2013 at 3:22 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
