{"resources":[{"author":"kris_herbert","post":"I’ll bet bearded guy told skinny guy what to say ensuring that neither one knows what they are talking about. It is obvious that they have been fooled by reading and believing Nickell. I don’t know about silent guy. Watch him. He seems embarrassed by his buddies.\n\n","date":"July 27, 2011 at 4:29 am","url":"https://shroudstory.com/2011/07/26/%e2%80%aaan-invitation-to-discuss-the-shroud-of-turin-youve-got-to-be-kidding/","cat":"video","title":"‪An invitation to discuss the Shroud of Turin. You’ve got to be kidding."},{"author":"kris_herbert","post":"I’ll give you another example. These wannabe skeptics wanted to complain about the Real Face of Jesus. But lacking any substantive arguments all they could do was ridicule the History channel for making so many ridiculous show. That is true. The History channel can be insane at times. But it also produces some great award winning series like the Universe,  America the Story of Us  and How the Earth Was Made. Are these to be ridiculed simply because the are from the History channel? Do you think they are aware that the Real Face of Jesus was nominated for two prestigious awards, the Banff World Media Festival Non-Fiction Rockies in Science and Technology and the Factual Entertainment Awards?  These guys are way out of their league when it comes to the Shroud. Why did they go on for an hour. Because it bugs them that there is no real argument against it. And they know it.\n\n","date":"July 26, 2011 at 4:31 pm","url":"https://shroudstory.com/2011/07/26/%e2%80%aaan-invitation-to-discuss-the-shroud-of-turin-youve-got-to-be-kidding/","cat":"video","title":"‪An invitation to discuss the Shroud of Turin. You’ve got to be kidding."},{"author":"kris_herbert","post":"I agree with Ron. Seventy pitiful hits. Some of those are click ins from YouTube’s automatically generated suggestions. Some are probabably links from this blog. I would be surprised if anyone watched the show from beginning to end. It is really awful. It is so obvious that they have not done any real research. Unable to really criticize the shroud, they spend their time ridiculing others.\n\n","date":"July 27, 2011 at 2:53 am","url":"https://shroudstory.com/2011/07/26/%e2%80%aaan-invitation-to-discuss-the-shroud-of-turin-youve-got-to-be-kidding/","cat":"video","title":"‪An invitation to discuss the Shroud of Turin. You’ve got to be kidding."},{"author":"kris_herbert","post":"I wonder how many hits Dan gets.\n\n","date":"July 27, 2011 at 2:54 am","url":"https://shroudstory.com/2011/07/26/%e2%80%aaan-invitation-to-discuss-the-shroud-of-turin-youve-got-to-be-kidding/","cat":"video","title":"‪An invitation to discuss the Shroud of Turin. You’ve got to be kidding."}],"researchers":[{"author":"kris_herbert","post":"I was beginning to hope that the world was forgetting McCrone. My hat off to you for giving us such a prompt report. Thank you.\n\n","date":"July 28, 2011 at 4:40 pm","url":"https://shroudstory.com/2011/07/28/stephen-e-jones-report-on-the-lecture-by-joel-bernstein/","cat":"news_&_views","title":"Stephen E. Jones’ Report on the Lecture by Joel Bernstein"}]}
