{"history":[{"id":"comment-143448","author":"kvernor","post":"In my research I have read about two types of flagrums. One, as most likely was used on the shroud, had lead balls attached to the ends. There were other “attachments” used called scorpions. This was what was depicted in Mel Gibsons “The Passion”. They aren’t as heavy but are intended to hook into the skin and then rip and tear when the executor pulls the flagrum back. This is what would leave the back in shreds. While the scorpions would leave more graphic damage, the other is very damaging too. Zugibe did a great job detailing what the weighted balls would do to man. It is possible that the balls could cause even more damage. Also, I checked all the references used to cite scourging was always a prelude to crucifixion (Livy, Josephus, Quintus Curtius) and I read each. I would conclude from these sources that scourging sometimes was administered before crucifixion. These sources do not force the conclusion that is was always done. Jesus was scourged by Pilate to gain sympathy from the mob. It did not work..","date":"2014-08-11","mins":"8:03 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143146","author":"kvernor","post":"If it is a low post method, how do you sync that with Paul’s “stretching”? If He is tied to a column or post how can the scourge leave marks in the middle of the chest where marks are on the shroud?.","date":"2014-08-09","mins":"5:35 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143242","author":"kvernor","post":"Mike, Paul’s stretching out came about 20 tears after the scourging of Christ. It was also in Jerusalem. I would think there are similarities. But information is so scant about scourging methods in the Bible. The event Josephus refers to happened in 71 AD and they crucified hundreds of Jews. But I do agree there are little rules when it came to what the Roman did. Except cause as much pain as possible..","date":"2014-08-10","mins":"9:43 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143445","author":"kvernor","post":"Hugh, tell me more about your source on the Game of kings please,.","date":"2014-08-11","mins":"7:46 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143703","author":"kvernor","post":"Here is one source: Gabbatha (aramiac) the name of the place called in GK lithostotos) the scene of the judgment of Jesus by Pilate (Jn 19:13). This event took place in the Praetorium. (Mt 27:27 Mk 15:16). There are two generally accepted sites which can be identified with the palace which Pilate occupied while he was in Jerusalem; one is the site of the modern citadel near the Jaffa gate, the other is the site of fortress of Antonia adjacent to the NW corner of the temple area. The meaning of the Aramiac gabbta is uncertain, but it appears to mean “height,” perhaps something like an Eng “knob.” The GK lithostrotos means a flagstone pavement. Under the convent of Notre Dame de Sion in Jerusalem there has been discovered an extensive flagstone pavement. The stones are of limestone, about 3 ft square. The remains indicate the existence of a flagstone court about 165 ft on its NS side and about 150 ft on its EW side. These flagstones have been worn smooth by traffic and they are striated for the movement of horses. These are traces of the W entrance to the court, which was a double arched gate; it is altogether probable that a matching double arched gate lay on the E side of the court. Near the W entrance there are races of a chamber which is identified as the guardroom. At the NW corner of the court there was a stairway which lead to a terrace. There were also stairways on the E side of the court and in the SE corner. The remains at the NW corner suggest the foundations of a tower. Under the court is a vast double vaulted cistern, 170 ft long by 46 ft wide. On the flagstone pavement near the guardroom was a peculiar complex of markings which can be identified as the board of a game something like parches, in which the players advanced from one position to the next, probably by the throw of the dice. One line terminated in a crown and another in what appears to be a saber. The GK letter Beta, which appears a few times in the diagram, suggests that this was the board of the game called basilikos (royal), in which the winning course in the symbol of death. The game is thought to reflect the practice of the substitute king which goes back to ancient Mesopotamia. For the week of festival of the New Year in Mesopotamia and of the Sacaea in Persia and the Saturnalia of Rome a slave or a condemned criminal was allowed to live as a king; at the end of the festival he was executed. No archaeologist questions that the pavement represents the site of the fortress of Antonia built by Herod at the NW corner of the temple area on the site of an earlier Hasmonean fortress. The fortress stood upon the eminence of Bezetha, which can now scarcely be distinguished. The stairs the E an SE give direct acces to the temple court, permitting the Roman cohort to move immediately to the court if action was necessary. Some archaeologists, however, have questioned whether the pavement belongs to the period before the destruction of Jerusalem in AD 70 or to Aelia Capitolina, the city built by Hadrian after the suppression of the rebellion of AD 132 135. The evidence supports the opinion of most archaeologists that the pavement is the actual pavement of the court of the fortress of Antonia. It is another question whether Pilate resided at this fortress or at the palace at the site of modern Citadel. Strict archaeological demonstration is impossible, and the literary sources do not decide the question. The game board offers an explanation of the crowning with thorns; if the soldiers were playing the game during the hearings of Jesus, the game might have suggested their rude sport. In fact, they may have made Jesus Himself the pawn of the game. The fortress of Antonia was destroyed in the fall of Jerusalem in AD 70. In the excavation of the area there was found a rounded stone weighing 770 lbs which was a ballistic missile of the Roman artillery. The Dictionary of the Bible John L. Mc Kenzie pages 290 291.","date":"2014-08-13","mins":"10:48 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143267","author":"kvernor","post":"Hugh, about the only description I came across is here: https://archive.org/stream/B20442336#page/36/mode/2up It was referenced by several sources Here is one example: http://books.google.com/books?id=3 YRAAAAYAAJ&pg=PA498&lpg=PA498&dq=plautus+scourge+slave&source=bl&ots=n9 Cldi1 E Er&sig=s Pz6kvu Va D6ae YQ Nqk Kv Kp Aamio&hl=en&sa=X&ei=Wtvn U7bq J6rl8 A Gw0 Y Gg DQ&ved=0 CDAQ6 A Ew BQ#v=onepage&q=plautus%20scourge%20slave&f=false It is from a play by Plautus and states that the victim would be suspended from his hands with 100 lbs of weight tied to his feet. All the other references are not original sources. They are encylopedias and such. Josephus and Horace both describe the consequences of scourging but not the methods. There are at least four low posts that some claim are the scourging post of Jesus. Search scourging pillar if you want to explore them. Another interesting twist is the Game of Kings. I found a couple of sources for it. Here is one: http://thinkhebrew.wordpress.com/2009/06/18/the game of the king/ There is a tile stone in Fortress Antonia (Where traditionally it is thought Christ was scourged) that is engraved with this game. It is like our “Truth or Dare” game. It began by the soldiers abusing rookie soldiers. After some soldiers died as a result of this game, the game was outlawed. The soldiers then played it on prisoners. When you were the “King” you wore a robe and decided what meanness you could perform on your target. Then it was done. I can see them playing this game with Christ and even using their robe and staff to mock Him. I emailed Dan searching for sources that would describe the Roman scourging. Right now if one considers the only original description of scourging (above), along with Acts 22:25, and the scourge marks on the shroud, I would say the evidence points to Christ being suspended..","date":"2014-08-10","mins":"5:08 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"}]}
