{"dating":[{"author":"larry_schauf","post":"Ray Rogers (Senior STURP Chemist) was ADAMENT that the Shroud could never be cleaned sufficiently of the Thymol (natural carbon) it was stored in to accurately carbon date it accurately.  Therefore, ONLY if all scientists agree and prove that it’s clean of the thymol should it ever be carbon dated again.  Obviously a second erroneous and early dating would destroy the Shroud’s credibility forever notwithstanding 24 peer-reviewed scientific articles supporting authenticity.  Make no mistake about it, there are forces that would like nothing better than to destroy the Shroud’s credibility!\n\n","date":"April 30, 2012 at 1:19 pm","url":"https://shroudstory.com/2012/04/29/carbon-dating-the-shroud-of-turin-again/","cat":"carbon_14_dating","title":"Carbon Dating the Shroud of Turin Again?"},{"author":"larry_schauf","post":"THE “UNFATHOMABLE” RAY ROGERS IS GENERALLY CONSIDERED THE BEST CREDENTIALED CHEMIST TO EVER ADDRESS THE SUBJECT OF THYMOL CONTAMINATION.  HE WAS CONVINCED THAT IT WOULD LIKELY BE IMPOSSIBLE TO  SUFFICIENTLY CLEAN THAT MODERN CARBON FROM THE SHROUD AND THEREFORE THE SECOND CARBON DATING WOULD ALSO BE WRONG AND EVEN MORE MISLEADING.  IF THAT HAPPENS, THE SHROUD’S CREDIBILITY WILL BE FOREVER DESTROYED REGARDLESS OF WHATEVER OTHER “TECHIE DETAILS” THERE ARE.  THUS, THE BURDEN OF PROOF, BEFORE A SECOND CARBON DATING, IS CLEARY ON WHOEVER PROPOSES THAT THE SHROUD IS FREE OF MODERN CARBON CONTAMINATION.\n\n","date":"November 14, 2013 at 5:20 pm","url":"https://shroudstory.com/2013/11/14/colin-berry-is-writing-to-the-vatican/","cat":"carbon_14_dating","title":"Colin Berry is Writing to the Vatican"},{"author":"larry_schauf","post":"WHOEVER WANTS TO DO ANOTHER CARBON DATING BEARS THE BURDEN OF PROVING BEYOND A REASONABLE DOUBT THAT IT CAN BE AND HAS BEEN COMPLETELY CLEANSED OF THE NATURAL CARBON, I.E. THYMOL, IT WAS CONTAMINATED WITH IN 1988.\n\n","date":"November 14, 2013 at 10:25 am","url":"https://shroudstory.com/2013/11/14/colin-berry-is-writing-to-the-vatican/","cat":"carbon_14_dating","title":"Colin Berry is Writing to the Vatican"},{"author":"larry_schauf","post":"While I’d like to finally see the first carbon dating that actually followed the original papal-approved protocol, we have to remember that in 1988 the Shroud was stored in Thymol, i.e. natural CARBON.  Ray Rogers said that the linen of The Shroud would soak up that carbon and that he seriously doubted it could ever be sufficiently cleaned of that carbon to permit an accurate carbon dating.  Consequently, a carbon dating shouldn’t be attempted until several labs independently certify that it is free of that added carbon.  The future of the Shroud depends on it!\n\n","date":"January 27, 2014 at 2:10 pm","url":"https://shroudstory.com/2014/01/27/shroud-pope-francis-call-for-new-test/","cat":"carbon_14_dating","title":"Should Pope Francis Call for New Test?"}],"researchers":[{"author":"larry_schauf","post":"Excellent response Barrie!   Just sorry you had to waste your valuable time because of some irresponsible blogger.\n\n","date":"July 24, 2012 at 2:01 pm","url":"https://shroudstory.com/2012/07/24/barrie-schwortz-responds-to-colin-berrys-rude-criticisms/","cat":"news_&_views","title":"Barrie Schwortz responds to Colin Berry’s Rude Criticisms"}],"resources":[{"author":"larry_schauf","post":"Brad & Barrie, \nThis online article about my article came as a surprise to me. \nWho is charging for the download of the article??! \nLarry,\n\n","date":"April 8, 2014 at 1:02 pm","url":"https://shroudstory.com/2014/04/08/lawrence-e-schauf-for-the-prosecution-the-trial-of-the-shroud/","cat":"article","title":"Lawrence E. Schauf for the Prosecution: The Trial of the Shroud"}]}
