{"art":[{"author":"leina","post":"Trish, I am so sorry about your (temporary) loss of your Dad. Just remember that one day, there will be no more tears & you will reunite with those who departed first, forever.  I’ve lost my Dad, too. My thoughts and prayers are with you at this time. May God keep you, and wrap His comforting arms around you as you dwell on the reality that your Dad is not “gone”;  he’s just in a much better place!\n\n","date":"January 18, 2012 at 10:40 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"leina","post":"A  “P.S.” to the above, RE: my quote that God is light, and previous post(s) questioning why Akiane’s Jesus has a dark side to His face—  On Akiane’s site, she describes her Prince of Peace painting in her own words:  “Love and truth are represented on the light side of Jesus’ face; the other (side) is of darkness and suffering — Yet there’s light in His eye. This light is a reminder that He is ALWAYS with us.” — Akiane\nYes, He IS always with us, even in our own times of darkness and suffering. What a poignant observation to come from the mind of a then 8-yr.-old child.\nAnnie Cee had mentioned how modern society has become less sensitive to spiritual things. I see this in America. But I believe that Europeans in general still fit the description Annie gave of being more superstitious and open to spiritual beliefs. When I asked my Eastern European friends how they met/became engaged, my girl friend said, ” I saw a comet or a shooting star, and I made a wish that I would have a boyfriend, and here he is!”  It is interesting to note that Akiane’s Mother is Lithuanian.  So it was in Akiane’s European heritage to be perceptive of things beyond the material world. At the time her visions started, Akiane’s father was an American “lapsed” Catholic. So even though he was “lapsed”, at some point in time he or his ancestors believed. It does not surprise me at all that God chose Akiane to be the recipient of visions of Heaven.\nI ordered Colton’s book today!  Can’t wait until it arrives!  :)\n\n","date":"September 12, 2011 at 10:54 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"leina","post":"Ann, your post blessed me. How sweet & honest!\nDon’t EVER let anyone or anything extinguish your faith.\nYou will see the child you lost again someday, and also you will see Jesus face-to-face.\nI own a copy of the book HEAVEN IS FOR REAL now. Absolutely LOVE this book!   :)\n\n","date":"October 1, 2011 at 12:02 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"leina","post":"Theresa, I agree w/you that the noise of our present-day technology attempts to drown out that “still, small voice”— that is why it is such a blessing to discover a blog like this! I have been SO ENCOURAGED, and provoked to examine my own heart/faith in a deeper way, by reading all the comments left here. It feels like a beautiful, loving little community of ppl who are here strengthening each others’ faith! Have enjoyed everyone’s stories SO MUCH! I ALMOST bought the book (Heaven Is For Real) two days ago, but instead purchased a Prayer & Praise Organizer journal in the hopes that having it in front of me will motivate me to make daily entries in it. I skimmed through the Burpo’s book, saw Akiane’s Jesus picture, jotted down her name, and a later search for her art led me to this blog! Now I want to buy Colton’s book!\nIt occurred to me that Pops, in Heaven, could have greeted Colton with “You’re Todd’s son, aren’t you?” (a statement), which later could have been re-phrased by the mind of a small child as, “Are you Todd’s son?” We must remember that 4-year olds are not English majors. Even adults sharing a spoken testimony will rarely share it the same way twice, sometimes adding more details, other times omitting them. Time also blurs memories, which is why it is so important to capture something as soon as possible after it occurs.\nI watched a special on The Shroud of Turin years ago, around Easter. They had scientifically taken samples of all the pollens found on the Shroud. Some of the pollens were exclusively indigenous to plants found only in one country, and the pollens confirmed the route the Shroud had taken over the centuries as it was hidden & moved in an attempt to  keep it safe. It was a riveting program, which gave me goosebumps and a sense of awe. Since God is light, and in Him is no darkness at all, it makes perfect sense that the Resurrection power which raised Christ from the grave was a flash of light so immense and blinding that it  could imprint Jesus’ image on the cloth. Our cameras and floodlights are puny by comparison.\nAnnie Cee, you and others here may want to keep an eye out for a Lionsgate film premiering sometime the end of this month, “Machine Gun Preacher”. It is a true story about a former biker & drug dealer who is now rescuing children in Sudan. Based on the book “Another Man’s War: The True Story of One Man’s Battle to Save Children in Sudan” by Sam Childers, published by Thomas Nelson. I previewed some of the book on Barnes & Noble, and it is amazing the way that God protected this man in his work. God is going “all out”, using children (Colton & Akiane) and reformed violent drug dealers, and anything He can to convert the lost and to edify believers, in times like these.\nAkiane’s Jesus has the kindest eyes I’ve ever seen!  :)\n\n","date":"September 11, 2011 at 11:38 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"leina","post":"Tom, in the Epilogue of “Heaven is for Real”, Colton’s Dad Todd is answering questions people have asked them. He says there are animals in Heaven, and that Colton saw dogs, birds, and even a friendly lion. While he didn’t specifically mention noticing a cat, I’d like to hope that there are cats, being really big on cats, myself.\nI bought my copy of the book from CBD (Christian Book Distributors) for only $8.99. It seemed a small price to pay for such an uplifting, faith-inspiring book. I was not disappointed!\n\n","date":"October 4, 2011 at 1:12 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"leina","post":"Let’s let scripture settle it.\nIn the book of John, Chapter 20, we read the account of  “Doubting” Thomas, one of the twelve disciples. After Jesus had risen, He appeared to the disciples. But Thomas was not with them at the time. When the other disciples told Thomas “We have seen the Lord”, Thomas replied (verse 25):\n“Unless I see IN HIS HANDS the print of the nails, and put my finger into the print of the nails… I will not believe.” In Verse 27, Jesus tells Thomas, “Reach hither thy finger, and behold MY HANDS…”\nI would never want to argue with the Word of God. Colton’s account lines up with scripture. And most traditional churches teach that the nails went into the palms of Jesus’ hands. Blood would also have run down from the hands onto the wrists. With all the physical brutality that Jesus suffered, I don’t doubt that his wrists were injured, as well.There was nary a part of His body that wasn’t scourged.\nThere is so much that we won’t know & understand until we get to Heaven. That is why childlike faith is required. We are to trust & believe, and not attempt to argue our way out of all He has done for us. Remember that it was the serpent who argued with Eve, and caused her to doubt, ultimately leading to her downfall.\n\n","date":"November 10, 2011 at 1:07 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"leina","post":"Beth, it took guts to share your story!  I hope any future “curve balls” that life throws your way, will inspire you to remember the great love He has for you, to have intervened so dramatically in your life. I pray you will know that in the same way He provided your mother as the solution in that situation, that He will ALWAYS have an answer or solution for you, no matter what life throws at you! You were in a tough place, but you received a touch directly from the Master. Little Colton & his parents were in a tough place too, but they also received a very special gift from Him. Having that in common is probably a part of why you love this book so much! (Plus, it’s just a GREAT book!)\n\n","date":"October 27, 2011 at 11:08 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"leina","post":"Annie, I had that very same thought as I was writing last night— that hands and wrists might have been considered part of the same thing.\nThe important thing for all of us to bear in mind, is not to get into dissension over trifles.\nI think that most of us are on here because we enjoyed the Burpo’s book.\nThere always be those who will try to argue their way out of believing  ANYTHING, but those of us who have faith must maintain unity & agreement in the basics, and not allow anything to derail our faith. And the point you made is since Jesus Himself hasn’t appeared among us in November 2011, we should focus on the main things, the ones that DO matter, and the ones that promote unity.\n\n","date":"November 10, 2011 at 4:15 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"leina","post":"My church supports missionaries in Turkey, and one week we watched a video re-enactment of a true story that occurred in Turkey.  Jesus appeared to a leader in a Muslim community, a man who beat his wife and had other vices. Jesus called the man by name, and said “you are mine.” The Lord touched the man’s chest in the area of his heart, and it left a permanent impression of the Jesus’ handprint seared on the man’s chest. Many salvations occurred because of the man’s testimony & changed life!  (The handprint played a big role, too, of course!)\nAnnieCee, who hasn’t had problems with churches? Be it because of people who are judgmental, controlling, prideful, jealous, cliquish, cruel, selfish, gossipy, or whatever. Whenever God has a special calling or purpose for someone, guess who Satan jumps in & uses to offend the believer, and cause them to stumble? Other people. It is to your credit that you are still standing with your faith in God intact! NOBODY has the power to snatch you from God’s hand!\nMy church is a mess right now— we recently lost 800 people. but I am loyally “staying put” and praying, as God winnows out the chaff & brings revival and renewal amongst those who remain. I supplement my spiritual feedings by listening to Dr. David Jeremiah’s radio program “Turning Point”, and I agree he is really “spot on” in his teachings. What is great about his messages is how easily they are applied to real life.\nYou spoke of ppl being alienated from church now. The Bible speaks about a falling away in the last days. And, it IS hard to find a good Bible-based church that teaches truth. I have heard that Internet Church is the next big wave that is starting. As for me, since I am in a “real life” church which is far less than perfect, what works is keeping my eyes on Jesus and not on the people. And, like you, I can’t allow the past to hold me back, if I want to grow & move forward. I could so relate to & identify with all your comments! God bless you & your parents, and I’m glad you found a solution that works for you. God bless David Jeremiah, too!\nthem to stumble? Other people.\n\n","date":"December 1, 2011 at 2:35 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"leina","post":"Seija, I knew that the book was a  #1  New York Times Bestseller, but I had no idea it had been translated into Finnish!  It was only first published in 2010, and this is only the first month of 2012!  Well, God is at work, speedily blessing many with the opportunity to read this inspiring, faith-building book! It is amazing to hear how far-reaching the blessing of this book is becoming! I am praying that God will use this blog to get many prayers going for your husband to recognize the truth, and come to know Jesus, too.\n\n","date":"January 13, 2012 at 10:20 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"leina","post":"Tracy, it’s interesting that you said your experience wasn’t a NDE, but that you were very scared.\nYears ago, my sister shared a true story that she experienced. She was on a church bus full of people. When the bus stopped to let the associate pastor exit, he walked in front of the idling bus— and was hit and killed by a car on the other side that he couldn’t see, and that couldn’t see him until it was too late. Of course, all the people on the bus were really shook up. Suddenly, a small child piped up loudly “I see Jesus!”  His Mother asked, “Where? What is Jesus doing?”  The little boy said, “He’s praying for the people on the bus.”\nJesus wasn’t needed there because of the Pastor— the Pastor was already safely in Heaven. Jesus was there for the people who remained here on earth, who were upset and frightened at what they couldn’t understand.\nAnd isn’t it also interesting that here again, we have a case of a small child seeing Him.\n\n","date":"January 18, 2012 at 11:10 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}],"opinion":[{"author":"leina","post":"I read in several articles that appeared the day of his death, that he was a Buddhist.\nWhich would account for the non-committal attitude towards God.\nGuess he knows NOW, doesn’t he?\nThe man was a hard worker, a family man, and a genius who left us all a great legacy, as far as technology.\nI can only hope & pray that he had a moment of reckoning, and made peace with God while he still had breath to do so.\n\n","date":"October 24, 2011 at 10:34 pm","url":"https://shroudstory.com/2011/10/24/steve-jobs-belief-in-god-maybe/","cat":"news_&_views","title":"Steve Jobs’ Belief in God. Maybe."},{"author":"leina","post":"Woo-Hoo!!! You go, Mark Shea!  “If it’s a fraud, make another one” : inarguable truth! Everything you mentioned, plus the bloodstains (NOT paint) and the photoelectric image seared into the cloth at a time when flash cameras hadn’t even been invented yet.\nIn the same way that great pains were taken over the centuries to protect & preserve God’s word (the Bible) from being destroyed, so countless individuals over the course of history have gone to great lengths to protect & preserve the Shroud. The Shroud itself affirms & backs up the truth of Jesus’ resurrection as stated in the Bible. No wonder the devil is working overtime to discredit it.\nI applaud the purity of your faith!\n\n","date":"January 3, 2012 at 11:57 pm","url":"https://shroudstory.com/2012/01/03/if-its-a-fraud-make-another-one/","cat":"other_blogs","title":"If it’s a fraud, make another one."}]}
