{"misc":[{"id":"comment-15056","author":"les_fredette","post":"First, I’d like to thank you for posting the story. I will working on addressing your concerns and posting my replies today. Les F..","date":"2012-08-16","mins":"7:35 am","url":"https://shroudstory.com/2012/08/16/i-think-i-see-another-different-nail-on-the-shroud-of-turin/","cat":"news_&_views","title":"I think I see another, different nail on the Shroud of Turin"},{"id":"comment-15145","author":"les_fredette","post":"Thanks for the book name. I’ll check it out..","date":"2012-08-17","mins":"4:55 pm","url":"https://shroudstory.com/2012/08/16/i-think-i-see-another-different-nail-on-the-shroud-of-turin/","cat":"news_&_views","title":"I think I see another, different nail on the Shroud of Turin"},{"id":"comment-15086","author":"les_fredette","post":"Max, I have added an update to my blog entry with regards to point #3. Thanks for the input. I’ll post it here (without a picture) as well. Les F. In 2010, Mr. Wehrkamp Richter reported what he believed a “geometric form in the centre of surrounding blood traces” on the foot image portion of the Shroud. Mr. Wehrkamp Richter, however, does not indicate that he specifically identified the image of a nail on the Shroud, rather a shape that is consistent with a three sided nail being used to inflict the wound on the foot (see below). So, the suggestion that images of nails are being found all over the Shroud, thereby making my discovery just one of many such claims, is a false ascertain. [Source: http://www.sudariumchristi.com/img/thoughts/jean carmignac en.pdf%5 D I believe that Mr. Wehrkamp Richter work only serves to support my findings in at least one respect: that roman crucifixion nails have unique, identifiable qualities that make them distinct from other common nails used in the 1st century. With regards to Alan and Mary Whanger’s purported identification of a nail image on the Shroud, I have not found any photographic information regarding this discovery. On their Duke University website link (http://www.duke.edu/~adw2/shroud/whanger.htm), the following reference to the nail image is provided: “On closer examination, the Whangers have found that there are images of many objects in addition to those of the body, and that these images show evidence of electron coronal discharge radiation. These additional objects include a crucifixion nail, a Roman spear, a sponge on a stick, a crown of thorns, two scourges, a large hammer, a pair of pliers, and two desecrated Jewish phylacteries or prayer boxes. All are consistent with 1st Century objects, with Roman crucifixions of Jews, with Jewish burial practices, and/or with Biblical accounts of the Crucifixion of Jesus.” Given a lack of information, I can’t determine whether or not the images that the Whagners have found are genuinely present on the Shroud. What I can say after studying the Shroud of many years is that if these images exist they are at all readily apparent, either in 2 D or in 3 D Shroud imaging. This stands in stark contrast to the nail image that I have identified on the Shroud, which is clearly visible in both 2 D and, more strikingly, in 3 D. What my discovery has done is rationally identify a fully discernable object on the Shroud, one that has been seen and noted by other Shroud researchers, and connect it with a real and tangible 1st century crucifixion nail found in the tomb of Caiaphas in 1990. Based on my review of the two other nail “discoveries”, they do not impact the significance or the validity of my discovery because a) Mr. Wehrkamp Richter did not discovery a nail image on the Shroud, and b) given the lack of specific information or photographic evidence, the Whangers’ nail image is unsubstantiated. And even if the Whangers’ have found what they believe is an image of nail on the Shroud, along with the plethora of other items, the clarity of these items on the Shroud are so faint as to render any conclusion about them to be debatable..","date":"2012-08-16","mins":"5:34 pm","url":"https://shroudstory.com/2012/08/16/i-think-i-see-another-different-nail-on-the-shroud-of-turin/","cat":"news_&_views","title":"I think I see another, different nail on the Shroud of Turin"},{"id":"comment-15093","author":"les_fredette","post":"I have finally found at least one picture identifying the plethora of objects that the Whangers discovered on the Shroud (http://santafaz.info/ing t33.html). Based on this imagery, I stand by my assertion that the evidence supporting the object over the hands is a crucifixion nail is sustainability more supportable than the Whagners’ evidence supporting their identification of nails. I believe this mainly because a) one can actually see the nail in 3 D over the hands and perform very specific measurements of its dimensions an shape, and b) the nail image over the hands has may points of congruence with the Caiaphas tomb nails..","date":"2012-08-16","mins":"6:41 pm","url":"https://shroudstory.com/2012/08/16/i-think-i-see-another-different-nail-on-the-shroud-of-turin/","cat":"news_&_views","title":"I think I see another, different nail on the Shroud of Turin"},{"id":"comment-15088","author":"les_fredette","post":"Dave, Your post is interesting, but I think some clarification is needed. While crucifixions were common, from my understanding it was not common practice to use nails during crucifixions. If nails were used in the tens of thousands of crucifixions that took place in the first century, it is likely that more than just a handful would have been found. In addition, if they were so common then they would not have been so “highly prized by the Roman soldiery” as you noted.It is more likely the case that the rarity and value of crucifixion nails as talismans was due to their infrequent use, which would explain why few have survived to this day. With regards to your comment that the Caiaphas nails could have come from any crucifixion, this is true. But assuming that crucifixion nails were rarely used and Caiaphas was known in history for only one major event – having Jesus arrested, my conclusion is not without reasoning (not to mention of startling congruence between the purported Caiaphas nails and the nail image on the Shroud). Les F..","date":"2012-08-16","mins":"5:49 pm","url":"https://shroudstory.com/2012/08/16/i-think-i-see-another-different-nail-on-the-shroud-of-turin/","cat":"news_&_views","title":"I think I see another, different nail on the Shroud of Turin"},{"id":"comment-15091","author":"les_fredette","post":"Dave, One other note with regards to “lions and crocodiles”. Are you suggesting that there is NO object laying over the hands? If so, then I am confused as to why others have noted this object with an attempt to identify it. I believe the object is clearly there and is three dimensional in nature. The only question is … what is it! I did not discovery this object; what I believe I have done is identify what it is – a crucifixion nail..","date":"2012-08-16","mins":"6:33 pm","url":"https://shroudstory.com/2012/08/16/i-think-i-see-another-different-nail-on-the-shroud-of-turin/","cat":"news_&_views","title":"I think I see another, different nail on the Shroud of Turin"},{"id":"comment-15090","author":"les_fredette","post":"All, First, as a literacy instruction is one of my forte’s, it drives me nuts to see people use words such as ‘speculation’ and ‘theory’ as having negative connotations. Whenever the Theory of Evolution is attacked, it’s attacked for “just being a theory”. Those that understand science also understand that a theory is one of the strongest arguments that can be posed in science. A theory is not a conjecture, rather a theory is “a coherent group of tested general propositions, commonly regarded as correct, that can be used as principles of explanation and prediction for a class of phenomena.” In the same vain, speculation is a “process of consideration”. There is no such thing as “pure” speculation. In any event, Yes, I am speculating, in the true sense of the word, that the nail on the Shroud may very well be one of the nails found in the Caiaphas tomb. My speculation, however, is supported by the evidence I have expounded in my paper. I believe that the conclusion that the imaged object is a crucifixion nail is substantially stronger than any previous non body image identified on the Shroud, all of which are so faint as to be unnoticeable by the naked eye. My speculation that the nail may be one of the nails found in the Caiaphas tomb is may not be 100% provable, but the circumstantial evidence is strong enough to consider. Thanks, Les F..","date":"2012-08-16","mins":"6:11 pm","url":"https://shroudstory.com/2012/08/16/i-think-i-see-another-different-nail-on-the-shroud-of-turin/","cat":"news_&_views","title":"I think I see another, different nail on the Shroud of Turin"},{"id":"comment-15107","author":"les_fredette","post":"Anoxie, Would you care to speculate what the object over the hand might be? Or do you think the “object” is a complete anomaly (i.e., an artifact of image processing)? Les F..","date":"2012-08-17","mins":"7:04 am","url":"https://shroudstory.com/2012/08/16/i-think-i-see-another-different-nail-on-the-shroud-of-turin/","cat":"news_&_views","title":"I think I see another, different nail on the Shroud of Turin"}]}
