{"art":[{"author":"leslie_trotter","post":"Here is an interesting story I am going to\nshare with everyone.  I was on my way to\nConnecticut to visit friends, when I stopped\noff in an airport bookstore to search for a\nbook to read on my flight. I was interested in\nreading a book called “Heaven Is For real”\nabout a little boy who had a near death\nexperience and went to Heaven and met Jesus.\nI could not find this book, either the airport\nbookstore was out or they never had it in\nstock. I ended up not getting anything to\nread and nap on the way to Connecticut\ninstead. After my visit to Connecticut\nI was a bit upset because I had a big\nfight with one of my good friends.\nI got a flight out of Hartford, CT\nand had to change planes in Baltimore, MD.\nI had to wait at least an hour an a half\nto change planes in Baltimore, so as I sat\nthere bored and a little down about the\nargument I had with my friend. I felt a\nsense of relief that I was in a strange\ncity and knew no one. I was one who never\nliked being alone but at this point my\nmind was at ease, until this woman I’d\nguess about 60 years old made a beeline\nover to me.  She told me that God spoke to\nher heart for her to come over and speak to\nme. She showed me a before photo of how\nmuch she used to weigh and I can tell she had\nlost a lot of weight because her photo looked\nas thought she must have weighed about 400lbs\nand standing before me I’d guess she weighed\nabout 150lbs. She looked good and she introduced\nme to this product called Nuvia3… it was a weight\nlose supplement/drink. She told me that you drink\none before each meal. She went on to tell me a little\nmore info on it and gave me her business card\nbecause she sells it. She also pulled out a book,\nthe book that I was looking for called “Heaven Is for\nReal” She wanted to know if I ever heard of it.\nI told her I searched for it to read as I traveled.\nHowever, I could not find it.  she told me that\nI could have it and she also gave me a sample of\nthe nuvia3 drink. I was grateful to her and I\nreached into my purse and pulled out my\npublished book called “In Due Season: We Will Hear God’s Voice” I gave\nher a copy and she was thrilled and asked me\nto autograph it for her. She as well as I knew\nthat God led her over to me. She called me the next\nday and told me she read the book and loved it and that it was a\nblessing to her, she also told several other people\nabout my book. Not Many know about my book. However, when\nsomeone does read it they are moved. These Stories like mine\nand Colton Burpo’s are gifts from God to the world.\n\n","date":"October 9, 2011 at 1:27 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
