{"art":[{"author":"louie","post":"In revelation, during the anti-christ’s reign, there are 2 prophets/witnesses4u Jesus who do wondrous miracles & cause major problems 4 the anti-christ resulting in their death. After they are murdered, their bodies are dragged through the streets & left out in public to rot. After 3 days of this, the prophets come back 2 life…..Maybe you will be one of the chosen two. Now before you laugh, please keep in mind that most of the New Testament was written by Paul, a guy who was not only “not going down the greatest path” but who was murdering Christians, for being Christians. God loves to use the least likely folks in His plans. I think to show us how we have it all wrong in our assessments of each other, or maybe to surprise & confound Satan. Read revelation. It’s particularly interesting that you would get this vision & not know of this revelation prophesy.\n\n","date":"November 3, 2011 at 1:14 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"louie","post":"Akiane does state that she used a model for that pic btw, a carpenter (interestingly) who did work in her home. I have a different pic that Akiane painted as the screen saver on my computer, it’s sort of a different Jesus, he has a robe over his head. Anyway, I’ve never given the shroud much thought until one day the laptop lid was bent away from me, you know how it gets out of focus, & at that angle OMG! you see the shroud. Anyway I’m an ICU RN & here to tell that just like foxholes, there are no atheists in the ICU! I’ve heard many of the after-death experiences & they do not always involve the light & dead grandma- the scarry ones are of getting sucked down to hell!\n\n","date":"November 3, 2011 at 1:00 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
