{"opinion":[{"id":"comment-23639","author":"lulu","post":"I am AB as are 2 brothers and 2 sisters out of a total of 10 children. My father was AB+ and my mother A+. From what I was told, both parents must have the recessive AB gene. One cannot go by the parents blood types. Also, I went into a coma when I had my first child, who’s blood type was AB+ when she was born. Because we lived abroad and in third world countries, we were tested again In case of accidents, war, etc. She remained AB+ until later in life ( perhaps puberty) when she wanted to give her own blood for surgery she was to undergo. She was now AB. This caused so much controversy that her doctor wanted to know if I was close to death when delivering her. The doctor said she had seen this before and the mother usually died during delivery. I had the Rho Gam shots ( just starting to be used in the late 1960’s). I had several miscarriages and finally succeeded in having another child. I have heard the story about the shroud before but do not believe AB blood types are related to Jesus..","date":"2013-02-06","mins":"5:26 pm","url":"https://shroudstory.com/2011/07/25/tales-of-blood-type-ab-negative/","cat":"other_blogs","title":"Tales of Blood Type AB Negative"},{"id":"comment-28744","author":"lulu","post":"I’ve never read so many ridiculous things in one place before. There is NO such thing as a female blood type. Whomever came up to that must have been ignorant bordering on madness. A baby can take from their parents any element either parent has. I’m AB negative, as was my father and several other male and female relatives. My mother was B positive. My husband is also B positive. Our son is AB positive and our daughter is A negative. I had rhogam with both of them. It doesn’t change anyone’s blood type; it simply protects a baby with an RH type that is incompatible with the mother’s. There is no proof that the Shroud of Turin is old enough to belong to anyone living in the same century as Jesus, let alone that it was Jesus, or indeed, that he ever existed. No wonder the blogger’s brother was sarcastic to his sister. He’s probably so sick of these hare brained things she says he can barely speak to her at all. Especially since she feeds him ‘golden nuggets’ (aka turds) like he has a female blood type..","date":"2013-03-29","mins":"3:38 pm","url":"https://shroudstory.com/2011/07/25/tales-of-blood-type-ab-negative/","cat":"other_blogs","title":"Tales of Blood Type AB Negative"}]}
