{"art":[{"author":"lyfe","post":"Everyone knows how cloth is woven, with long unbroken threads.(P.S. I have worked in a museum textile department.) So if you want to copy a weave you have to show the threads going through. The artist has decided not to do this because he wants to follow other patterns of decoration from medieval art that have nothing to do with the Shroud. WHY NOT JUST SHOW THE SHROUD IF IT IS THAT IMPORTANT? No image of a body anywhere, he does not even bother to copy the bearded face of Christ which is surely what everyone would notice. Can we not just start with a common sense approach on this? Who are all these medievalists/art historians who can see the Shroud? Is this the Courtauld view? Please provide the medieval art experts!\n\n","date":"June 2, 2012 at 11:49 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"lyfe","post":"When I first saw the reference to the Pray Codex showing the Shroud of Turin I could not think what they were talking about. As David Mo says, the second scene of the Marys is always shown, and in much better illustrations than the Pray Codex, with an empty tomb and a lid. I never imagined otherwise. I really was amazed that some people thought the tomb and its lid were the Shroud. It seems that the Pray Codex is the only picture of these scenes they have seen and that is why they are so mistaken. If you had seen the Shroud you would have shown the image which is the most important thing about it, so the Pray Codex tells us nothing. No one has answered the question of why anyone would want to venerate the kind of weaving of which the Shroud is made rather than the image and , one has to say it again, the pattern on the lid is not a picture of a woven cloth. Does anyone know who was the first person who had this crazy idea about the Shroud being seen on the Codex? Normally one wants to show relics in full, this is what the public expected to see, so why try and hide away that it is the Turin Shroud by making it ‘symbolic’, rather than showing it as it really is. The more one reads on this blog, the less one believes in the Shroud being shown. Well done, Colin Berry and David Mo for keeping up the pressure. The replies show there is no evidence to support the Shroud being shown here,\n\n","date":"June 9, 2012 at 1:40 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"lyfe","post":"Colinsberry is right- time to give this whole idea of the Pray Codex shows the Shroud a decent burial. Medieval art shows that if one wanted to show a relic one showed it in full- there was no point in hiding it away. The defenders of the idea that the  Pray Codex shows the Shroud have had to make the Shroud in the Codex more and more obscure (once they had realised that the tomb lid was not the Shroud!!)- this is not a Dan Brown mystery where some people are trying to pass on a secret message which only a few people will be able to guess. And if you were trying to pass on a secret message why do it in this Hungarian manuscript? What is extraordinary is that anyone ever believed this idea in the first place: Christ is being shown buried according to the custom of the twelfth century, he has no beard, the Shroud is too small for the Turin Shroud, there is no image on the Shroud in the Two Marys picture, It seems that there is a separate face cloth as in other pictures of the time, the pattern on the tomb lid is not weaving and there is no reason why the way the cloth was woven should be venerated, any more than the holes in the Shroud. I suppose some people will go on thinking that they can still see the Shroud but i cannot believe anyone will believe them. There are still no medival art historians ready to come out in support! Let’s move on.\n\n","date":"June 10, 2012 at 6:19 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"lyfe","post":"Final point. Can we please know who put forward the idea that the Turin Shroud can be seen on the Codex?  Where is it argued? The idea must have come from somewhere because it is not at all obvious. Did they mistake the tomb for the Shroud? Did they really believe that the tomb lid showed weaving and why did they think the weaving was more important than the image?\n\n","date":"June 10, 2012 at 4:50 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"lyfe","post":"So Ian Wilson has a lot to answer for. How does someone with no qualifications in this field have so much power? Is it because people will swallow anything? I expect most people will have seen Charles Freeman’s article on The Shroud of Turin and the Image of Edessa ( it is referred to in one of the earlier postings by Dan). It is interesting that Freeman suggests a whole new avenue of research on the Shroud ( tracing back the Blachernae Shroud) because Wilson’s own arguments collapse so completely for lack of evidence. Perhaps a new start here.\n\n","date":"June 11, 2012 at 2:23 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"lyfe","post":"In relic worship  the relic was exposed once or twice a year for the faithful to see it.  Look at the reports of the exposure of the Veil of Veronica in Rome. The faithful expected to see it in full .  The more the relic looked like what it was supposed to be the better, that is what aroused the veneration. You did not need to hide the relic away.\n So why would a Hungarian illustrator try and show it as a symbolic, cryptic, object when he could have shown the Shroud as it was  with an image on it? He would reach a much bigger audience if he showed it as it was.  It reminds me of Dan Brown ,only a few initiates would have known about this secret relic and they would be given special clues (e.g. the four holes) no one else would know about. So did the llustrator of the Pray Codex belong to a secret cult, passing on a message about the Shroud that he did not dare show as it really was?  We must look out for examples of art where there are four holes in a L shape, put them together in a story and then we will have a new Dan Brown bestseller! The Knights Templar and the Holy Grail will be fitted in there somehow as in any good medieval mystery!\nWe must remember what has been established: that this was the idea of Ian Wilson who certainly knows nothing about medieval art  and iconography. If Charles Freeman is right Ian Wilson does not even know when Byzantine art begins. It is not an idea which comes out of a reputable department of medieval art. So the same question repeated: why do people follow Ian Wilson?\n\n","date":"June 11, 2012 at 10:37 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"lyfe","post":"No, Max, I am not expectng anyone to follow me because I am not putting forward any theory. All I am saying is that as someone who knows a little about medieval art ( for instance, unlike some , I knew that the tomb and the tomb lid were being shown and that these patterns were not the weaving of the  Shroud), I cannot see the Turn Shroud in this Codex. I have listened to those who say they can but they have not convinced me of anything. As I have said from the very first, I cannot  understand why anyone sees the Shroud here. You have had lots of chances to prove your point but you have failed and your arguments seem to get weaker every time you try. Then I ask who first thought of this idea and all anyone can come up with is Ian Wilson who is not an art historian. So I am just left where I started, completely unconvinced that anyone has proved that one relic of many thousands known in the Middle Ages is to be seen here but only by those who can spot it. \nIt seems to me that this is a desperate attempt to find the Turin Shroud somewhere. Have you ever thought that the Turin shroud was not seen to be important by anyone because there were so many other relics that had greater prestige, like the Cross, the Crown of Thorns, the Blood of Christ, the Veil of Veronica and hundreds of others? These are all well documented and the crowds followed them. No crowds are reported for any shroud. The most important Shroud was at Cadouin where the abbey grew rich from the pilgrims visiting it. ( Now, of course, we know it is a fake but ,like the Turin Shroud ,it was a large piece of cloth, made ,in this case, by workhops in the Muslim east.)\nThe Turin Shroud is a relic cult of today ,not one of the medieval ages- we would have known more about it if it had been and it would have een illustrated properly- a large cloth with a double image of a dead man with a beard  on it. Otherwise what is the point of playing Dan Brown games?\n\n","date":"June 11, 2012 at 12:00 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"lyfe","post":"Well, if you need a magnifying glass to see it, that rules out anyone seeing it before the age of magnifying glasses. You completely fail to answer the basic question, why could the Shroud not be shown as it really was if the illustrator of the Pray Codx was wanting people to know it existed. And why was it considered as, or more, important than the many thousands of other first centrury relics that were being displayed troughout Europe at this time?\nThe Turin Shroud is a reality, the theories about where it was when and how we know this are largely fiction unless and until better supporting evidence is found- I have no objections to accepting this evidence  but some reputable scholar has to actually provide it!. I am waiting!\nThis is a desperate and weak attempt to show that the Shroud existed before the carbon-14 dating – if it is the best anyone can do, it is hardly convincing.\n\n","date":"June 11, 2012 at 1:00 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"lyfe","post":"So we have one name of a medieval art historian, Thomas de Wesselow. Then we look up his book The Sign on Google and everyone thinks he is writing nonsense about the Shroud. He is not respected by anyone. So please can we have the real experts who can tell us that they can see the Shroud in the Pray Codex. I have googled Pray Codex too and I can find the art historian in Wikipedia who has argued against the Shroud being seen on the Codex but no art historian who can see it. I think the art historians are not even prepared to think about it as they can see no evidence of the Shroud and know that this shows Christ being buried as he is in other Christian paintings and the customs of the medieival times when the hands were crossed., Are you all experts, if not please give us some who know something different!\n\n","date":"June 3, 2012 at 12:52 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"lyfe","post":"There is already the link on this blog to Charles Freeman’s article on the Shroud. it is important for anyone who says you have to be open-minded to read it and it is very interesting. When he discusses the Pray Codex he says that they were burying people  as Christ is shown on the Pray Codex all over Europe many centuries before the Pray Codex. So the Turin Shroud cannot have inspired  all these burial pictures that daveb talks about..\n\n","date":"June 3, 2012 at 1:17 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"lyfe","post":"It seems to be even between those who cannot see anything like the Shroud of Turin in the Pray Codex and those who can ,even if they cannot explain why the artist cannot simply show the Shroud in clear detail. The ‘yes’we can spot the Shroud’ team have not been able to show why the Shroud was considered so important when there were so many thousands of much more prestigious relics. Please read Charles Freeman’s article- the Crown of Thorns was so much more important as was the real blood of Jesus and pieces of the Cross and the Holy Lance. Why do you think the Shroud was more important than these?  I know Freeman is a historian who is criticising another historian ,Ian Wilson , and I am sure that there will be good debates on this, but his ideas seem relevant here too.\nThis debate has surely got nowhere. I still wait to hear of a respected art historian who can see the Shroud in the Pray Codex!\nP.S. From what I know about textiles, it would be very rare for linen to last two thousand years unless it was in a very dry climate such as Egypt. I don’t see much in this debate from anyone who has worked with textiles and knows this really big problem!\n\n","date":"June 4, 2012 at 2:30 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"lyfe","post":"So you guys  are still arguing! Who can see a large cloth with an image on it anywhere here? A tomb lid as seen in many other pictures with a pattern of steps on it is said to be a picture of weaving. But why is the way the weaving is done important -it has nothing to do with the relic and is the last thing you would see . The image would come first.  Then the Charles Freeman article shows that people were being buried like this in the sixth century. Had they seen the \\Turin Shroud all over Europe by then? You must have magic glasses the rest of us don’t have if you can see the Shroud. There is not even any evidence that anyone saw a shroud as important as a relic when compared to the relics of the Cross and the Crown of Thorns. Haven’t you got carried away with the Shroud?\n\n","date":"June 5, 2012 at 4:49 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"lyfe","post":"Can those who can see the Shroud in the Codex ,please explain why it is the weave that is important? When you see the Shroud exposed can you see the weave at all? Why would the artist want to show it and not the image? By this time, it was not a special weave as this was a great age of European weaving. Anyway the markings on the tomb lid are not a weave , unless you have the special glasses you are given if you are a supporter of the Shroud. No sign yet of a respected art historan who can see the Shroud in the Codex!\n\n","date":"June 6, 2012 at 12:49 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"lyfe","post":"I hadn’t even heard of the Pray Codex until recently. Whoever came up with the idea that the Turin Shroud could be seen in it? Where might the Shroud have been seen and why would it not have been copied directly in the pictures?. This just seems to be a poor piece of medieval art which is drawing on conventions from more sophisticated works. Christ is just being shown buried in a way that Christians were buried in the Middle Ages and the pattern on the tomb has nothing to do with the weave of the cloth and why would you want to venerate the weave and not the image which could have been put there if the artist had wanted to. It is amazing how some people see things the rest of us can’t!\n\n","date":"June 2, 2012 at 6:42 am","url":"https://shroudstory.com/2012/05/27/jones-on-the-hungarian-pray-manuscript-codex-as-discussed-in-wikipedia/","cat":"art","title":"Jones on the Hungarian Pray Manuscript Codex as discussed in Wikipedia"}],"dating":[{"author":"lyfe","post":"Haven’t contributed anything to this website for ages and it seems that the same old debates are going on.. and on, with very little light on the issues. But it does seem that people like Hugh are working through some of the deadwood and making those who believe that the case for the authenticity of the Shroud is watertight tighten up their act. That can only be healthy! perhaps i ought to tune in more!\n\n","date":"January 21, 2014 at 4:38 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"lyfe","post":"Am I right in following Charles’ logic as follows?\nIn order to achieve a medieval date for a first century cloth, the reweave must have made up at least sixty per cent of the total sample.\nCotton only made up at most twenty per cent of the reweave (Thibault Heimberger’s research) and so eighty per cent of the reweave must have been linen.\nBut linen does not take dye so in principle the ‘new’ linen would have looked different unless the weavers used yarn that was indistinguishable from the original linen.\nBut if they had found yarn that was indistinguishable then they would not have needed to add dyed cotton to it, especially as that would have made it more unlikely that the reweave would have remained invisible.\nSo the cotton is likely to have drifted in as fibres as was the original claim of the textile expert Gilbert Raes and not been added by the invisible weavers. In addition Charles seems to argue that it would have been impossible to have dyed fibres of cotton or cotton that was bonded with linen as Thibault claims it was.\nSo Rogers was wrong to call the added material he found a dye because it is impossible to imagine a scenario where cotton would have needed to have been dyed. But it could have been a sealant covering this whole area of the cloth to protect it.\n have I got this right? I am looking forward to hearing some responses.\n\n","date":"January 26, 2014 at 6:57 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"lyfe","post":"And I see that Ian Wilson rejects reweaving as well according to pages 129 onwards of his 2010, The Shroud. So it seems that Hugh has some quite impressive support on his side.\n\n","date":"January 22, 2014 at 11:11 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"}],"history":[{"author":"lyfe","post":"It seems essential to remember as Yannick has pointed out that the word tetradiplon was only applied to the cloth that was applied ti Jesus’ face before he wiped himself with it. If you read Wilson’s 2010 book he gives the impression that the cloth is referred to as tetradiplon only AFTER it has become the image of Edessa. In the Acts of Thaddeus there is, though Wilson does not tell us this, a SERARATE reference to the burial cloths as remaining in the tomb. Wilson’s argument collapses completely as soon as the original document is read.\n\n","date":"July 13, 2012 at 5:17 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"author":"lyfe","post":"Thanks, Yannick. It does seem to undermine the Freeman argument that tetradiplon referred to the way the Edessa Image was folded for storage, after the image was made, but it does seem to support Freeman (and you) when he says never trust Wilson without reading the documents he quotes for yourself. They often say something completely different from what he says they say and anyone who bothers can find this out on the internet. Not a difficult man to out and you have done some good work here.\nAs you say , you can take out ALL the Wilson stuff and still have an authentic Shroud.\n\n","date":"July 14, 2012 at 1:16 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"author":"lyfe","post":"Yannick. You have hit on a big problem. Too few people have seen that Wilson’s theory of the Edessa Image being the same as the Turin Shroud has had zero support from any specialist working in this field. Because they go on believiing it ,people have failed to do any work at looking at the other ways in which the history of the Shroud might be traced. If only Wilson could be discared you would release a lot of new ideas some of which might have more evidence to support them\n\n","date":"July 17, 2012 at 9:42 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"author":"lyfe","post":"Max, I think it is you who must do the explaining.\n1) The only source Wilson gives for tetradiplon is The Acts of the Holy Apostle Thaddeus, sixth century. Do you know of any others as it is important we have all the known examples to work from?\n2) In the Acts the word is only used to describe the sindon ( a normal name for a linen cloth) BEFORE Jesus wiped his face with it. In other words a cloth was brought that was tetradiplon ,and THEN given to Jesus. The word tetradiplon is, so far as I know not used otherwise.\nSo how does Wilson deal with this?\nP. 190. 2010 edition of The Shroud.\n‘Although its initially off-putting aspect [of the Acts] is that it ‘explains’ the creation of the Image as by Jesus washing himself, it intriguingly GOES ON [my capitals] to describe the cloth on which the Image was imprinted as tetradiplon’.\nNow by using ‘goes on’ Wilson implies that tetradiplon is used of the cloth AFTER the image is on it, instead of BEFORE as the Acts make clear. Is he simply being imprecise or is he deliberately misleading? Please let us know what you think.\nHe is misleadng on sindon. Look up any traditional Greek lexicon, e.g. Lddell and Scott and you will find the word probably originated as cloth from India but then became a generic term for fine linen or just linen. So forget any connection with burial shrouds from the gospels, this is simply a linen cloth being brought to Jesus for him to wipe his image on.\nWilson also makes great play about a four folded cloth having to be large- nonsense- if you have a pocket handkerchief you will see that during ironing, if you do such thngs, it is folded over four times. (Sometimes being the family ironer pays off!) So size has nothing to do with it.\nAs Yannick suggests this makes Jackson’s folding irrelevant  to the issue.\nRead on in the Acts and there is a separate reference to the crucifixion and burial of Jesus with the burial cloths described in the same Acts as being LEFT in the tomb. (This would not,of course, stop them from being gathered from there and becoming what is now the Turin Shroud.)\nSo it is up to you to provide any reason why these burial cloths should be tetradiplon. Contrary to what Wilson argues it is the ACTs temsleves, the very document he uses, that destroys his own argument about tetradiplon. By using ‘goes on’ you could say he is being misleading by misrepresenting the order of events as set out in the Acts and so creating an argument that has never existed.\nThis is why Yannick feels so strongly about these things- it only needs a little,bit of research, and Yannick has done a lot to see how quickly much of what Wilson writes collapses when the original sources are consulted.\n\n","date":"July 14, 2012 at 7:59 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"author":"lyfe","post":"Please help as I am confused.An ordinary handkerchief that one takes out of a drawer is folded four times so tetradiplon cloth does not have to be large.\nIn the only reference to tetradiplon I can find (the Acts of Thaddeus) tetradiplon describes the cloth BEFORE Christ wipes his face with it so it can’t be the Turin Shroud. The Acts also say that the burial shrouds,not the same cloth, remained in the tomb. So perhaps there are some documents I have missed . Yannick and Matt please help as this tetradiplon argumnt is seen to be so important.\n\n","date":"July 10, 2012 at 4:45 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"author":"lyfe","post":"Davebs comments are  unfair in that Yannick Clement has provided long academic posts refuting many of Wilson’s arguments. It is Stephen Jones who uses ad hominem attacks as this post and his recent comments on his site to anyone who disagrees with him show all too clearly. Are you right to give him space here?\n\n","date":"August 28, 2012 at 12:39 pm","url":"https://shroudstory.com/2012/08/23/scholarly-incompetence-or-dishonesty/","cat":"history","title":"Scholarly Incompetence or Dishonesty?"},{"author":"lyfe","post":"Well, I am sure Stephen Jones can defend his own interpretation of the Vignon markings that I have not seen anywhere before.\nIt does leave open the question as to which is the first portrait of Jesus that shows the Vignon markings when they have not been present in any earlier portrait.\nEveryone knows the problem of looking at the Shroud of Turinwithout any enhancement. Some people say that they can only see the face if they stand some way back from it and that theycannot see any markings clearly if they look at it close up. I remain amazed that when there is such a fuss over the Vignon markings when we have according to Stephen Jones,a man who admits that he is replacing science by meditation and can give no clear account that he has examined the Shroud carefullybut ,of course ‘if you already know exactly what you are looking for and where’ youare bound to find it!\nPerhaps you can tell us which is your earliest Vignon portrait of Christ.\n\n","date":"September 30, 2012 at 8:38 am","url":"https://shroudstory.com/2012/09/22/stephen-jones-is-up-with-part-10-of-his-critique-of-charles-freeman/","cat":"history","title":"Stephen Jones is up with Part 10 of his critique of Charles Freeman"},{"author":"lyfe","post":"Stephen Jones ,in the posting above, includes the Christ Pantocrator from Sant’ Apollinare Nuovo in Ravenna. According to the Sacred destinations description this is dated to c. 500. So Jones accepts that the Vignon markings are in place by then which presumably fits with his fourth century date for the copying. Does Wilson include this image among his own study of the subject as one of those influenced by the Shroud?\n\n","date":"September 30, 2012 at 11:08 am","url":"https://shroudstory.com/2012/09/22/stephen-jones-is-up-with-part-10-of-his-critique-of-charles-freeman/","cat":"history","title":"Stephen Jones is up with Part 10 of his critique of Charles Freeman"},{"author":"lyfe","post":"Yannick. I think everyone is agreed that the Ravenna Pantocrator was made before Wilson says that the Image of Edessa was discovered in the wall in Edessa.I asked a friend who knows about Byzantine art for his view on the date ( he has studied the Ravenna mosaics) and he thinks it is about 500 AD (the same date you get if you put Christ Enthroned, Sant’Apollinare Nuovo in the Sacred Destinations website)because it was completed before the church was consecrated in 504. He said this is the view of Robert Cormack who is an expert on Byzantine art. I think your point that the Image of Edessa has many similarities with earlier art is a very interesting one and it does make sense because of the fully frontal bearded face. I hope you do more research on this.\n\n","date":"October 1, 2012 at 2:27 am","url":"https://shroudstory.com/2012/09/22/stephen-jones-is-up-with-part-10-of-his-critique-of-charles-freeman/","cat":"history","title":"Stephen Jones is up with Part 10 of his critique of Charles Freeman"},{"author":"lyfe","post":"Sorry ,it is ROBIN Cormack- I have just googled him. Apparently the 500 AD date is given alongside an illustration in his Oxford University Press book on Byzantine Art.\n\n","date":"October 1, 2012 at 2:50 am","url":"https://shroudstory.com/2012/09/22/stephen-jones-is-up-with-part-10-of-his-critique-of-charles-freeman/","cat":"history","title":"Stephen Jones is up with Part 10 of his critique of Charles Freeman"},{"author":"lyfe","post":"Can anyone tell me whether Paul Vignon took his markings from the Shroud as it is seen in normal light because from photographs it is difficult to see any markings at all and unless it was much clearer in ancient times it is difficult to know how anyone could have copied it.\nThere is a famous mosaic of the emperor Justinian in the church of San Vitale in Ravenna dating apparently from 548. There seem to be Vignon markings on it – can Dan please post it so people can make the comparison with those of Christ? Would a copier  use the face of Christ to depict an emperor?\n\n","date":"September 23, 2012 at 5:35 pm","url":"https://shroudstory.com/2012/09/22/stephen-jones-is-up-with-part-10-of-his-critique-of-charles-freeman/","cat":"history","title":"Stephen Jones is up with Part 10 of his critique of Charles Freeman"},{"author":"lyfe","post":"Stephen Jones was challenged on the Vignon markings  in comments on Part Six of his critique of Charles Freeman (his post of August 23rd). Faced with examples of Vignon markings, from catacomb art, of the fourth century, Jones, at the end of the comments postings,  suggested that the Shroud was copied in Antioch in the fourth century. (Stephen Jones prefers the Markwardt’s Antioch theory over Wilson’s Edessa theory for the early hiding of the Shroud.)The presence of Vignon markings in earlier Christian and imperial art has always been a problem for Wilson’s theory of the copying of the Shroud in the sixth century.\nI was amazed how limited Vignon’s examination of the Shroud was- an hour with a group of others at midnight and ten minutes in the open air when there was a crowd around it-not much time for a scholarly assessment!\n\n","date":"September 29, 2012 at 3:13 am","url":"https://shroudstory.com/2012/09/22/stephen-jones-is-up-with-part-10-of-his-critique-of-charles-freeman/","cat":"history","title":"Stephen Jones is up with Part 10 of his critique of Charles Freeman"}],"resources":[{"author":"lyfe","post":"I am not sure how radiation ever got into it in the first place. The way that Di Lazzaro is heading, It could only have been some kind of supernatural event but that would not explain why the images are of a dead body rather than a transformed or transforming one radiating energy.The present Shroud does not offer any clue as to the fact of the Resurrection- the body is still dead. I can’t find anything that Di Lazzaro has written that helps me here but you know his work better than I do.\n\n","date":"August 13, 2015 at 4:47 pm","url":"https://shroudstory.com/2015/08/11/tantalizingly-close-enough/","cat":"article","title":"Tantalizingly Close Enough?"},{"author":"lyfe","post":"Louis/ Thomas/Hugh- thanks.. I can see why the Shroud is such a mystery when there is even controversy over some of these basic issues. Interesting though trying to sort it out.\n\n","date":"August 14, 2015 at 4:47 am","url":"https://shroudstory.com/2015/08/11/tantalizingly-close-enough/","cat":"article","title":"Tantalizingly Close Enough?"},{"author":"lyfe","post":"I have some problems,which I am sure that hose who have been working on the Shroud for many years can help answer.\n1) From what I read, Di Lazzaro’s experiments have lasted over several years but he has not reproduced the images. He says that he now knows what would be required to do so and it seems beyond the bounds of possibility. So might it be that we can call it a day for radiation as a cause of the image?  If so this would be scientifically important.\n2) Some people talk as if the images were caused by the Resurrection but the images are not of Christ going through a Resurrection-they are pre-Resurrection images.\n3) If there is human blood on the Shroud, where does this fit in with the images, radiated or otherwise? What is the best thinking of when the blood came onto the Shroud, before or after the images? obviously the blood cannot be the result of radiation so how can it be separated out from the rest?\n4) Where does the funding for all this work come from? it seems to have taken up a lot of resources at a prestigious laboratory- or perhaps it is after hours work.\n\n","date":"August 13, 2015 at 8:16 am","url":"https://shroudstory.com/2015/08/11/tantalizingly-close-enough/","cat":"article","title":"Tantalizingly Close Enough?"},{"author":"lyfe","post":"Thanks, Hugh and Louis. It will be interesting to follow up more on Dr.Lazzaro. Not sure I am up to church politics on this one though. What does Di Lazzaro want to do that the Church does not want him to do? Can’t he just get on with his experiments even if they haven’t created anything positive  so far- they don’t seem to need access to the Shroud itself. Will need to get on with the reading to find out.\nIf the apostle Paul is right, that the Resurrection was the transformation of Christ’s physical body into a spiritual body, then the Shroud does not show that but something before that. So I presume the images could not have been from a source of  energy created by the body as it was being changed into a spiritual form as they would not have come out in the static form we have now. They would have shown something of the life that the apostles saw.\nWill get reading. Thanks for the suggestions.\n\n","date":"August 13, 2015 at 2:28 pm","url":"https://shroudstory.com/2015/08/11/tantalizingly-close-enough/","cat":"article","title":"Tantalizingly Close Enough?"}]}
