{"art":[{"author":"lynne","post":"Jane just consider how very much you love your animals (“they are my babies”.) Then consider the love you have for them magnified infinitely greater…..and you will begin to grasp the love that God the Creator of all life has for you. As for answered prayers, in Matthew 6:8 God “…knows what you need before you ask Him.”  Personally I have found writing in a journal helps me make important life decisions, and to learn what God wants for me of my life and purpose.  There are several great books out there, among them “Journaling As A Spiritual Practice: Encountering God Through Attentive Writing” by Helen Cepero, and “Love Letters to God: Deeper Intimacy Through Written Prayer” by Lynn Morrissey. Don’t by terrified of God – be terrified of life here on earth and after death WITHOUT God. Matthew 7:7  “…seek and you will find; knock and the door will be opened to you.”\n\n","date":"July 16, 2011 at 2:42 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"lynne","post":"A treatise of the physical descriptions of Jesus (not from the bible but from historical manuscripts) can be found at the Nazarene Way (website below). Several of the documents there describe Jesus with gray or blue eyes, and hair with golden highlights, not uncommon for the tribe He was from. They are fascinating to read and ponder.  \nhttp://www.thenazareneway.com/likeness_of_our_saviour.htm\n\n","date":"July 27, 2011 at 3:33 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"lynne","post":"In March 1998 I had a life-changing dream in which Jesus confronted me face-to-face. In all my life I have never before or since dreamt of Jesus, and the dream was so vivid and remarkable I can recall it in detail to this day. I wrote about the vision in my journal a few weeks after having it, and for several days following, added additional insights and implications of the dream. Jesus had asked me “Where is the work I asked you to do?” In my dream I knew exactly what he meant but knew I had barely started it, and so I stalled, searching for excuses.  But He went on, “You are the only one who can do this for me now. I’m counting on you.”  There was no condemnation nor threat in His remarks. After processing the dream for some time I came to realize that the “work” He asked me to do was the essence of John 13:44 –  “A new command I give you: Love one another. As I have loved you, so you must love one another” NIV. Like others I had found it easy to love those who are lovable and likable, but to love the “unlovely” is different. This dream convinced me He expects us to love ALL OTHERS just as He does. LOVE – that’s the work I had not finished for Him. When I read earlier postings to this blog I was amazed there were several that confirmed the image of the Jesus in my dream. I had told others at the time  that Jesus in my dream did not look at all like the typical religious art we see of Him. Until I read “Heaven Is For Real” and saw Akiane’s Prince of Peace drawing, I had never seen a likeness of Jesus so close to my vision, and to the entries I had made about it in my journal. The vision of Christ and His message became for me an epiphany.\n\n","date":"May 30, 2011 at 8:52 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}],"misc":[{"author":"lynne","post":"Thanks episcopalian. I so enjoyed your sharing of the article by Jim Goldsworthy – a fascinating account of yet another similarity of Jesus of the shroud and in the paint by number painting of his grandpa.\n\n","date":"August 1, 2011 at 3:36 pm","url":"https://shroudstory.com/2011/08/01/the-american-dream-mention-of-the-shroud-of-turin/","cat":"news_&_views","title":"The American Dream? Mention of the Shroud of Turin"}]}
