{"art":[{"id":"comment-7864","author":"maria_da_glória_gonçalves_barroso","post":"After reading previous comments on this matter I can’t help saying that I disagree with Gabriel when he asserted that «we are far from having scientific evidences». When it comes to the Shroud being a painting or not scientific evidences indeed point to it’s image not being a paintig as Dr. John Heller and Dr. Alan Adler concluded in several peer reviewd papers. The question of the presence of flower images on the Shroud is still a matter of controversy even between sindonologists but their true existence remains a strong possibility. If someone wants to get real scientific information about the Shroud one of the easiest ways to do it is searching the wonderful website of Dr. Barrie Schwortz http://www.shroud.com scientific articles and papers or «google» Ohio Shroud Conference, http://www.shroudstory.com http://www.sindonology.org and so on. Don’t forget the Shroud of Turin is the most studied relic in the history of mankind regards Maria da Glória Centro Português de Sindonologia.","date":"2012-02-02","mins":"1:07 pm","url":"https://shroudstory.com/2012/02/02/luciano-buso-whats-the-point-of-denying-my-theory/","cat":"art","title":"Luciano Buso: What’s the point of denying my theory"}],"blood":[{"id":"comment-12880","author":"maria_da_glória_gonçalves_barroso","post":"To «anoxie» If you have any doubts on scientific questions concerning bloodstains my advice is not to ask Dr. Colinsberry because he’ll always provide misleading answers with the aim of discredit the Shroud. You had better read previous excellent post on this blog concerning Shroud bloodstains by medical immunologist Dr. Kelly Kearse. My husband is a medical doctor and he read all Drs. John Heller and Alan Adler’s papers on blood issue in their book «The Orphaned Manuscript». This book contains several papers by these investigators most of them published in «peer reviewed» scientific journals and the conclusion is crystal clear, Shroud red stains are not red ochre and vermillion in a collagen tempera, actually they are blood. Inasmuch, Professor Adler and Dr. John Heller did nor perform just the Hydrazine test that Dr Collinberry described in a very confusing way. They actually tested not one but several samples from red stains and also studied red stains from human blood on fabrics as controls. The finding of hemoglobin characteristic spectra, other spectrometry data, detection of blood proteins, bilirrubin and other blood components enables them to conclude that there is indeed blood on the Shroud. Italian forensic investigator Professor Baima Bollone obtained similar results working with material collected from other locations on the Shroud. BLOOD ON THE SHROUD IS NOT A GUESS IT IS A SCIENTIFIC FACT. Kindest regards Maria da Glória Centro Português de Sindonologia.","date":"2012-06-22","mins":"5:25 am","url":"https://shroudstory.com/2012/06/20/berry-shroud-was-scourged-not-the-man-a-critical-look-at-faccini-and-fanti/","cat":"blood_studies","title":"Berry: Shroud was Scourged, Not the Man. A Critical Look at Faccini and Fanti"},{"id":"comment-8387","author":"maria_da_glória_gonçalves_barroso","post":"Bravo Dr Kelly Kearse My husband who is a medical doctor and a Shroud researcher commented that at last someone from the medical field shed some light on the AB controversy of the blood on the Shroud. Thus this is a very important independent statement on red stains on the Shroud concluding on the basis of Dr John Heller,Dr Alan Adler and Professor Pierluigi Baima Bollone’s studies that red stains are indeed blood and Dr. Mc Crone’s theory of red ochre and vermillion is to be dismissed once more. I congratulate with all previous comments, this blog is really awesome! Shroudies gotta praise Dr. Kelly Kearse’s amazing work, my husband said it’s excellent and crystal clear there is nothing more to add on this matter and this is one of the best posts ever published on this blog regards Maria da Glória Centro Português de Sindonologia.","date":"2012-02-17","mins":"5:22 am","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-21845","author":"maria_da_glória_gonçalves_barroso","post":"It’s crystal clear that Professor Charles Freeman’s claims on the issue of Shroud’s bloodtyping AB have no other aim but trying to prove that the Shroud of Turin cannot be the one that wrapped Jesus’ body some 2000 years ago. Why is that possibility discarded only on the basis of a single misleading claim and all the other aspects of the Shroud namely concerning ALL THE UNIQUE IMAGE PECULIARITIES are simply neglected? Although he is right questioning the value of performing only serological tests, maybe in a near future there will appear DNA studies on that matter as Dr Kelly Kearse pointed out. Nonetheless Dr. Kelly Kearse provided us one excellent posting entitled «Just how old is the AB blood type?» on this blog last October 13 and she also wrote a very interesting comment on ABO anthropological evolution making a rebuttal of D’Adamo’s theory. I guess that for the moment, what she explained it’s all we can know on this matter without speculating, and surely AB blood type existed long before Christ was born. Best regards Maria da Gloria Centro Português de Sindonologia.","date":"2013-01-10","mins":"12:29 pm","url":"https://shroudstory.com/2013/01/08/positive-for-ab-is-not-the-same-as-ab-positive/","cat":"blood_studies","title":"Positive for AB is not the same as AB positive"}],"dating":[{"id":"comment-1413","author":"maria_da_glória_gonçalves_barroso","post":"It’s worth watching nevertheless I guess it focused too much on Dr Jackson’s theory on flawed radiocarbon tests allegedly by enrichment with new C14 atoms from carbon monoxide produced in 1532 Chambery’s fire. As far as I remember there was no mention of Sue Benford and Joe Marino’s work or Professor Raymond Rogers studies. BBC has released a good Shroud documentary but newer documentaries such as Unwrapping the Shroud and The Real Face of Jesus provide more reliable scientific information. Regards Maria da Glória Centro Português de Sindonologia.","date":"2010-08-27","mins":"2:41 pm","url":"https://shroudstory.com/2010/08/20/a-must-see-shroud-of-turin-material-evidence-on-veoh/","cat":"carbon_14_dating","title":"A Must See: Shroud of Turin (Material Evidence) on Veoh"},{"id":"comment-33315","author":"maria_da_glória_gonçalves_barroso","post":"Dear friends I guess Professor Fanti’s new methods of dating ancient textiles were recognized as accurate by scientific standards. Other scientists from several italian universities collaborated in the development of this new methodology and their paper on two of the tests employed was accepted in Vibrational Specroscopy Journal. Professor Giulio Fanti is a honest and competent scientist and those who accused him of doing «bad science» are absolutely wrong and making a tremendous injustice towards him. Professor Fanti has given important contribution to Shroud research namely on the image issue and now he provided more strong arguments to doubt 1988 radiocarbon dating of the Shroud. IIT’S EXTREMELY IMPORTANT TO HAVE A SCIENTIFIC DATING OF THE SHROUD 280 B.C. 220 A.D. SO THE POSSIBILITY OF THE FABRIC BEEING FROM THE TIME OF CHRIST IS A REALITY AND NOT A DESIRE FROM DEVOUT CHRISTIANS. On the contrary Shroud skeptic Joe Nickell adds nothing to what we were used to hear from him and nevertheless he is praised by his publisher on his new book. Portuguese members of Centro Português de Sindonologia praise Professor Fanti’s dedication to Shroud research and expressed their support to this discovery after listening to a presentation entitled « Recent Scientific developments on the Shroud» included in the program of « Solemn Feast of The Holy Shroud» held in Fátima Portugal saturday May 4. Best regards Maria da Glória Centro Português de Sindonologia.","date":"2013-05-09","mins":"6:23 am","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","title":"Best News Article on Fanti’s Methods"},{"id":"comment-141","author":"maria_da_glória_gonçalves_barroso","post":"Those who seek the truth shouldn´t be bothered by the predictable behaviour of so called skeptics. They are not interested to know and they hide new evidence that contradicts their claims. I know by heart what they claim about the Shroud beeing a painting , a kind of protophotograph, the conclusions of the «world famous microscopist and forensic expert Walter Mccrone » ,the anatomical errors of the image of The Man of the Shroud, the coherent results of the 3 radiocarbon labs , the lack of historical Shroud records before 1356 ,and a lot of more crap. What do they argue to disclaim the works published in peer reviewed scientific magazines ? I don´t ask them to be believers I just ask them to be honest and have an opened mind to undeniable facts which I summarize FACTS: 1) The Shroud of Turin is neither a painting nor a photograph 2) Science already knows the chemistry of that superficial image and the way it was impressed on the fabric 3) There is yet no explanation ( not from a theological but from a scientific point of view ) for what caused the cromophores on the topmost fibers of the cloth to produce as a whole such an unique negative image with 3 D and Holographic encoding. 4) At present time no one was able to create an image with all the characteristics of the one in the Turin Shroud 5) The image of The Man of the Shroud has forensic evidence that legitimates connecting it to the descriptions of Christ´s Passion as we read in the Gospels 6) As the agnostic doctor Yves Delage concluded in 1902 the man´s image depicted on the Shroud IS INDEED JESUS CHRIST 7) There are indeed reliable documental and pictorial recordings of the Shroud before 1356, altough not in western Europe. It´s preposterous to claim that « the medieval forger of the Shroud was inspired by the Pray Codex » !!! 8) 1988 radiocarbon dating of the Shroud is invalid ; all peer reviewed scientific works concuded that the sample was cut from a area of medieval invisible mending ,so there is no radiocarbon dating of the Shroud ´ The late chemist Raymond Rogers concluded in his peer reviewed article published in Thermochimica Acta that the age of the cloth was surely 1300 3000 years , it could be Christ´s burial cloth 9) Shroud scientific researchers are not trying to convince unbelievers or flawing conclusions to .give support to christian beliefs. They are making non profit investigation on this such unique relic that deserves a special status in scientific world. Greetings, Maria da Glória.","date":"2008-10-01","mins":"9:53 pm","url":"https://shroudstory.com/2008/09/29/francis-bacon-and-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Francis Bacon and the Shroud of Turin"},{"id":"comment-2248","author":"maria_da_glória_gonçalves_barroso","post":"This post pointed out an important fact dealing with intrusion material which I can’t help quoting “so many scientists didn’t anticipate the problem given that there were ample warning signs at the time.” As far as I remember no one mentions Dr. John Tyrer’s advice on that matter, but I think it’s worth remembering. Dr. John Tyrer a british textile expert published an article on the Shroud in textile journal Textile Horizons December 1981 entitled «Looking at the Shroud of Turin as a Textile» and after analyzing photographs of the Shroud ,just by looking at the place where Raes sample had been taken he stated “There is therefore some doubt as to wheter the sample described by Professor Raes as Piece II is the edging strip or part of a patch.IT IS IMPORTANT THAT THIS MATTER BE RESOLVED IF IT IS INTENDED THAT THE FORTHCOMING CARBONDATING TESTS ARE TO BE MADE ON RAES SAMPLE.THE PATCH IS PROBABLY MEDIEVAL.” This was written in 1981.Is this the first clue to help invalidate radiocarbon test dating of the Shroud? I guess radiocarbon labs ignored this advice. If someone is interested to read it the article is available in http://www.shroud.it scientific articles best regards Maria da Glória Centro Português de Sindonologia.","date":"2011-01-20","mins":"10:21 am","url":"https://shroudstory.com/2011/01/19/joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-24","author":"maria_da_glória_gonçalves_barroso","post":"Skeptics can claim whatever fits their hate for religion and God ,nevertheless its not honest to doubt the accuracy and meaning of scientific studies like the Robert Villareal´s and his team from Los Alamos National Laboratory. As we know this study confirms once more that the radiocarbon sample was taken from a rewoven area ( the late professor Raymond Rogers himself a researcher who followed the scientific method applied to the Shroud of Turin had already concluded that in 2005) so 1988 carbon dating can no longer be an argument against authenticity. All other evidences namely historical documents ( skeptics always «ignore » pre 1356 facts that proof Shroud´s existence before that time like Robert de Clari´s text, the sermon of Gregory Referendarius , Pray Codex , Codex Vossianus Latinus and so on ) forensic data and the chemical and physical properties of the image point to only one conclusion THE IMAGE OF JESUS CHRIST after all the inflicted sufferings as the Gospels talk about true science tells us the image was not man made and even now with most advanced technologies its not possible to produce even the face of the Man of the Shroud ( remember that the claimed 3 D encoding of the last experiment to my knowledge by Nathan Wilson – the Shadow Shroud was reliably debunked by the french expert in computer image processing Christophe Mignot who is not a shroud researcher ) As Dan Porter says in his amazing website SCIENCE CANNOT RULE OUT A MIRACLE BUT IT CAN AND DOES RULE OUT FAKERY The only logical conclusion (obviously not explained by science ) is that the Shroud of Turin was the silent witness of that unique event CHRIST ´ RESURRECTION So what else culd it be ? greetings Maria da Glória.","date":"2008-08-27","mins":"9:34 pm","url":"https://shroudstory.com/2008/08/26/more-tetherd-cow-ahead-on-the-shroud-of-turin/","cat":"carbon_14_dating","title":"More Tetherd Cow Ahead on the Shroud of Turin"},{"id":"comment-228","author":"maria_da_glória_gonçalves_barroso","post":"With great sorrow I couldn´t watch Discovery Channel´s documentary « Unwrapping the Shroud » aired last sunday night because portuguese Discovery Channel scheduled other programs and I don´t even know if it will be aired. So ,trying to know people opinion about the subject I read the comments on this blog and I was surprised with so much inaccuracies stated by Mr « uncleducke 316 ». When he mentions «the french scientist » I guess it`s about an experience that took place in June 2005 in Paris Natural History Museum sponsored by Cercle Zéthetique ( a kind of atheist society ) in which Paul Eric Blancrue ( he´s not a scientist but an historian and declared atheist who holds a skeptic website against Shroud´s authenticity ) purportedly would produce ( not a shroud , as uncleduke 316 states) a face like the one in Turin Shroud in 5 minutes with all his properties namely 3 D encoding. To achieve this task iron oxide mixed with a gelatin binder was applied over a cloth moulded on a bas relief of Christ´s face inspired on the Shroud of Turin Obviously the result is quite different from the original, just to mention: The image is not superficial, iron oxide particles go deep in the threads and there is cementation of fibers. It is chemically different ( real Shroud Face results from change in color of a superficial impurity layer composed of starch residues and polysaccharides in topmost thread fibers there is no cementation and colored fibers are side by side with colorless ones ). That face shows obvious distortion, has sharp boundaries ,and appears quite different from the original. Mr. Uncleduke 316 should visit the website http://www.suaire science.com and read Dr. Thibault Heimburger´s article on that subject , compare the images and make his own opinion The alleged 3 D encoding was debunked by a computer sciences and image software expert engineer Christophe Mignot who isn´t even a shroud researcher who after studying that face , «shadow shroud´s face »from Nathan Wilson experiment, and the real Shroud´s Face concluded that only the real one had true 3 D encoding As Episcopalian says there is the possibility that the Man of the Shroud was cleaned before entombment by a scanty washing but that doesn´t preclude remaining blood stains over the body and new blood oozing from the wounds as forensic pathologists like Pierre Barbet , Robert Bucklin and Frederick Zugibe stated. It´s just preposterous to say that «they left the crown of thorns ». It was not a crown of thorns ,forensic analyses of scalp forehead and back of the head of the Man of the Shroud concludes that the multiple puncture wounds namely injury to forehead arteries and veins were produced by a kind of helmet of thorns that was obviously removed when the body was placed and covered by the Shroud If Mr. Uncleduke 316 reads my comment and honestly thinks to have got reliable information I´ll be very pleased. Greetings Maria da Glória.","date":"2008-12-16","mins":"11:28 pm","url":"https://shroudstory.com/2008/12/01/new-shroud-documentary-to-air-on-discovery-channel-in-december/","cat":"carbon_14_dating","title":"New Shroud Documentary To Air On Discovery Channel In December"},{"id":"comment-105","author":"maria_da_glória_gonçalves_barroso","post":"No matter if the person who writes about the Shroud is religious or non believer , should be careful about information sources and always seek the truth. Everybody knows Joe Nickell is an old anti shroud authenticity and his arguments are indeed predictable he mixes little relevant information with misleading one and conceals important data. I agree totally with your rebuttal but I´d like to add some stuff It´s totally false that Gospels don´t mention a burial cloth : you just have to read Matthew , Mark and Luke , all of them mention a cloth that wrapped Christ´s body. If Joe Nickell knew the meaning of « othonia » he wouldn´t take John´s gospel as an argument , and besides he ignores the existence of a tenth century document relative to Edessa cloth which corroborates the evidences that it was indeed the Shroud folded in a way to show only the face – obviously I’m takking about « Codex Vossianus Latinus» kept in Leyden University Lybrary. It´s also ludicrious to say that the image should have distortions , who says that ignores that scientific image studies concluded that whatever made the image acted in an orthogonal way paralell to the gravity line to impress «every surface area point » on the cloth; he also ignores the amazing work of Mario Latendresse explaining why the present distorsions are meaningless. And at last , to finish my long comments just a few words about the so called modern fake I guess it was Nathan Wilson´s Shadow Shroud whose image is completely different from a physical and chemically aspect and although his author claimed 3 D encoding , such claim was debunked by Christophe Mignot a scientist not a Shroud researcher whose expertise is 3 D image analysis ( in http://www.suaire science.com ) I recall Dan Porter´s sentence «Science cannot rule out a miracle but it can and does rule out fakery ». And till now science didn´t rule out the Shroud as a fake. Greetings Maria da Glória.","date":"2008-09-11","mins":"9:24 pm","url":"https://shroudstory.com/2008/09/11/ridiculous-shroud-is-fake-article-at-suite101com/","cat":"carbon_14_dating","title":"Ridiculous ‘Shroud is fake’ article at Suite101.com"},{"id":"comment-1195","author":"maria_da_glória_gonçalves_barroso","post":"I am not a chemist expert but after reading this post I became really worried thinking of the possibility of the Shroud beeing submited to such dating method. When Dr Rowes admits the possibility of employing this new technique for dating the Shroud of Turin I make a legitimate question does he know the nature of chemical change of topmost linen fibers that produced the cromophore? The late Dr. Alan Adler published at least two papers on Shroud conservation and oxidation was considered a big threat to mantain the contrast between image and non image areas. If this method of applying an electrically chargedgas causes oxidation of the surface nonimage fibers will change color and image areas will no longer be discernible. I sincerely hope church authorities listen to a scientific commission opinion before irreversible damage occurs. I utterly agree with all comments namely from Professor Stephen Jones. Let´s preserve the Shroud this sacred linen cloth is a legacy to Mankind best regards Maria da Glória CENTRO PORTUGUÊS DE SINDONOLOGIA.","date":"2010-03-30","mins":"5:09 pm","url":"https://shroudstory.com/2010/03/24/new-dating-technique-might-help-with-the-shroud-of-turin/","cat":"carbon_14_dating","title":"New dating technique might help with the Shroud of Turin"},{"id":"comment-274","author":"maria_da_glória_gonçalves_barroso","post":"Hi Mr. John Andrews Scientific studies concluded that Jesus Christ was wrapped in the Shroud as a corpse and left the imprints of the dorsal and ventral regions of His body on it which are separated by a distance that fits the lenght of the top of the head. The logical conclusion is that the Shroud was folded in two parts. Image studies concluded that some bloodstains don´t match anatomic origin showing cilindrical distortion when the Shroud is flattened namely from head area and clots don´t have abraded surfaces. Not entering into details the logical conclusion is that the body didn´t move while wrapped in the Shroud and there is no scientific explanation how the body was removed from the Shroud. From a theological point of view the Resurection explains all those facts and the Shroud probably stayed folded in two parts as it was before. Nevertheless we can´t be absolutely sure because the only clues we have is the Mozarabic rite intoduced in religious practices in sixth century visigothic Spain by St. Leander bishop of Seville who travelled to East and probably saw the Shroud with the body imprints and so added that to the gospel of John stating « Peter and John ran to the tomb and saw the linen cloths with the imprints of the dead and risen Man » Nobody knows exactly how the Shroud was when the disciples entered the empty tomb that Sunday morning nonetheless we surely know that the Shroud was folded that way by the people who buried Jesus. We cannot say that folding means He will return but we certainly can infer that the image left on the Shroud of Turin is the absolute proof of His Resurrection best regards Maria da Glória CENTRO PORTUGUÊS DE SINDONOLOGIA.","date":"2009-02-19","mins":"10:26 pm","url":"https://shroudstory.com/2009/01/30/tv-alert-unwrapping-the-shroud-new-evidence-to-be-rebroadcast/","cat":"carbon_14_dating","title":"Television Special Feb 1: Unwrapping the Shroud: New Evidence"},{"id":"comment-443","author":"maria_da_glória_gonçalves_barroso","post":"I guess Mita Jain´s post is quite interesting nonetheless I don´t agree with several assertions. She doesn´t care wether the Shroud is authentic or a forgery for her the only thing that matters is that the Shroud is allegedly a symbol of peace and believing it is Christ´s burial cloth is not harmful. For a christian the central question of his faith is Christ´s resurection and that event is the main tenet of christian religion. The apostle St. Paul wrote that if Christ did not rise from the dead then our faith is vain and our preaching is vain. The Shroud of Turin bears an image that has not yet been explained by scientific studies and probably will never be. May be in a near future scientific studies will conclude that what caused the chemical changes responsible for coloring the uppermost fibers of Shroud´s threads was an electomagnetic energy with such a wavelength but that is as far as science can reach As Mita Jain focussed 1988 radiocarbon dating was flawed and can no longer be a skeptic claim against Shroud´s authenticity. As a longtime Shroud researcher with all knowledge I gathered from historical and scientific studies the SHROUD TURNS OUT AS AUTHENTIC and for me it does really matter if it is genuine. Science obviously cannot prove or disprove Christ´s resurection and also cannot prove that the image depicted on the Shroud belongs to Jesus Christ. But the only logical conclusion we can infer is that it is an unexplained image of Jesus crucified naked body on a linen cloth and the result of a miracle and from a theological point of view that miracle was Christ´s Resurection. That´s why I care if the Shroud is genuine it is a material legacy of Jesus Christ to mankind. Let´s think about this best regards Maria da Glória CENTRO PORTUGÊS DE SINDONOLOGIA.","date":"2009-05-04","mins":"9:31 pm","url":"https://shroudstory.com/2009/03/12/shroud-of-turin-opinion/","cat":"carbon_14_dating","title":"Shroud of Turin Opinion"}],"history":[{"id":"comment-185","author":"maria_da_glória_gonçalves_barroso","post":"After reading this article I can´t help making some comments about Picknett and Prince´s ridiulous theory about the Shroud image. 1 Everybody knows that the first Shroud display in western Europe was in 1356 in a Lirey church in France ; Leonardo da Vinci was born in 1452. How could he make such an artifact before even beiing born? The theory that Duke Louis of Savoy later ordered him to make a more perfect Shroud is preposterous. 2 Their theory deals with a lot of inaccuracies , just to mention: If the photographic emulsion had egg Shroud image fibers shoud test positive for proteins that doesn´t happen and the late chemist Raymond Rogers submited image fibers to Pyrolysis Mass Spectrometry which discarded nitrogenous residues. There were no refrigerators at that time so the tortured and flogged bodies Leonardo «got» would have rotten before such images formed on the cloth. The face of the Man of the Shroud has the features of a semitic man that´s the opinion of anthropologic experts ; Leonardo was an italian. 2 The image of the Shroud is not a photograph Photographs reult from reflected light and from analysis of highlights and shadows an image expert can infer light direction. In the Shroud image there is no light directionality it just seems that the light or whatever made the image comes from the body itself ! A face in a photograph has sharp contours ; the face of the Man of the Shroud has no distinct boundaries fading into colorless areas. Photographic image of a body is always an «albedo » image it don´t has 3 D encoded data unveiled by a VP 8 scan. How can these authors explain that it was possible to produce an hologram from such a photograph? It´s not possible to obtain Holograms from 2 D images as Dr Petrus Soons states and the hologram of the Man of the Shroud had missing data that produced hole like defects explained by the israeli botanist expert Professor Avinoam Danim as places where flowers were laid over the body ! They don´t deal either with the fact that underneath blood stains there is no image. EXPLAIN ALL THIS STUFF Ms Picknett and Mr. Prince !!! If you want to read a detailed explanation just go to Barrie Schwortz´s wonderful website ( http://www.shroud.com ) and search scientific papers his article « Is the Shroud of Turin a Medieval Photograph? » Some years ago, before getting interested in Shroud studies I bought their book Templar Revelation but soon I realized that their claims were absolutely ludicrous and I didn´t finish it and it is still in my bookshelf. It´s just time waste to read such books. Greetings Maria da Glória.","date":"2008-10-23","mins":"10:00 pm","url":"https://shroudstory.com/2008/10/21/the-ridiculous-picknett-and-prince-photograph-theory/","cat":"history","title":"The Ridiculous Picknett and Prince Photograph Theory"},{"id":"comment-11070","author":"maria_da_glória_gonçalves_barroso","post":"I and my husband have been at Valencia Shroud Congress and listened to Dr Marcia Boi´s presentation on the Shroud pollens on April 30, and we guess ETWN News misinterpreted what was conveyed by her lecture. We apologize if we will afford wrong information because the presentation was spoken in spanish and we are portuguese, nevertheless portuguese people usually understand spanish language. Basically she claimed: Gundelia Tournefortii pollens were misidentified, and actually they belong to the species Helychrisum which is an insect borne pollen. The Man of the Shroud (Jesus) was buried as a king so His body was annointed with burial spices accordingly to Jewish burial customs and the body had not been washed. Pollens were tranfered to the cloth only because they were contained in the burial ointments. At the end the attendance questioned her, and my husband asked Dr. Marcia Boi if she had ever considered the possibility that flowers had been laid on the cloth, so there could be an alternative possibility for the presence of insect borne pollens. She answered that Jewish burial rites precluded flowers being laid beside the corpse. We think this presentation deals with several problems: 1 Did experienced israeli botanists Professors Avinoam Danim and Uri Baruch misidentified Gundelia Tournefortii pollens on microscopic examination? 2 What observations back up her claims? It was not clearly stated that she had access to the same pollen samples israeli botanists had observed which were collected by the late Dr. Max Frei. 3 We utterly disagree that the Man of the Shroud was buried like a king, actually who buried him did it hastilly and surely without the honors a king should be granted. 4 Then comes the caveat of body not beeing washed as she asserted. If the body had not been washed is it logical to annoint it thoroughly? Would it be logical to make a «mix» of blood and ointments covering all the body surface? If the body had been covered by a layer of burial oils and blood we must consider two problems: How would it be possible image to be produced on the cloth, namely dorsal image, if blood halts whatever produced chemical tranformations on the cloth responsible for the image? How would it be possible to observe those perfect images of scourging injuries with a roman flagrum with defined outlines and a serum halo? For Dr. Marcia Boi the presence of burial ointments is an an undisputable fact. How can she be so sure if this issue is a debatable question even among sindonologists nevertheless it being a strong possibility. Although Professor Adler and Dr John Heller’s studies did not conclude for their presence onthe cloth they did not exclude it either, and Professor Pierluigi Baima Bollone detected the presence of Aloes and Myrrh onthe cloth by immunofluorescence( at a Shroud Conference in Turin 2000 we have the book with all the lectures) Thats what I and my husband commented after Dr.Marcia Boi’s presentation, which although it showed images with a good quality, did not convince us on the validity of her claims. Warmest regards Maria da Glória and Antero de Frias Moreira Centro Português de Sindonologia.","date":"2012-05-02","mins":"2:19 pm","url":"https://shroudstory.com/2012/05/02/two-thousand-year-old-ointment-residue-discovered-on-the-shroud/","cat":"history","title":"Two Thousand Year-Old Ointment Residue Discovered on the Shroud"},{"id":"comment-1444","author":"maria_da_glória_gonçalves_barroso","post":"In my opinion even if 21st century technologies achieve to obtain an image on a linen fabric with ALL Shroud of Turin’s characteristics that cannot be used either as a skeptical argument or a true pro authenticity one. When I wrote ALL I meant all optical physical and chemical properties of the Shroud image on a fabric,ruling out all the purported Shroud fakes namely Shadow Shroud and Garlaschelli’s, because if we go deeper on scientific analysis neither has the chemistry and optical characteristics of the true Shroud. But let me explain my viewpoint: If a medieval forger managed to fake the Shroud of Turin undoubtedly he would have to perform a miracle and skeptics don’t believe miracles that defy laws of nature. I agree with Dr.Andrew Silverman’s comment because to duplicate Shroud image scientists got to figure out how the image formed on the cloth and till now scientific theories just approach how the image could possibly form on the cloth. But even if an image just like the original one could hypothetically be reproduced by a laboratory experiment it would argue neither against authenticity nor pro authenticity (because if the Shroud is authentic it’s image originated from a human body… and not from an experiment using some kind of energy acting on a linen cloth to color it’s fibers). If the Shroud originates from the 1st century and an hypothetically 1st century forger by a theorethical unknown technology faked the Shroud, that would be still a miracle, perhaps a bigger miracle, but that’s complete nonsense. Considering the third possibility that the Shroud of Turin has imprinted an image resulting from the projection onto the cloth of ventral and dorsal surface points of a real human body (and that is true from a scientific and forensic point of view)that is an unique event which happened once in all the History of Mankind all facts pointing to that body beeing the one of Jesus Christ. Leaving out of discussion here so many other issues I guess will be mentioned on «trial» by Shroud’s attorney the Jury’s verdict can be no other than the SHROUD IS AUTHENTIC. Best regards Maria da Glória CENTRO PORTUGUÊS DE SINDONOLOGIA.","date":"2010-09-23","mins":"10:21 am","url":"https://shroudstory.com/2010/09/22/trial-of-the-shroud-of-turin-at-newman-university-in-wichita/","cat":"history","title":"Trial of the Shroud of Turin at Newman University in Wichita"}],"forensic":[{"id":"comment-3469","author":"maria_da_glória_gonçalves_barroso","post":"Hi It’s always a pleasure to read such interesting remarks about the Shroud made by well informed Shroud researchers. I agree that not all roman flagrums have the same size dumbells but there’s no doubt scourge stains are blood marks dumbell shaped with a halo of serum. As far as I remember Professor Alan Adler stated that they are not whole blood but a blood clot exsudate produced by direct contact with the cloth. Nevertheless if we examine the Image of the Shroud surely there are image areas of the body that were not in contact with the fabric but appear on the cloth because image was not produced by a contact mechanism but by a kind of collimated raditional mechanism as Dr Alan Adler stated. Professor Fanti and Professor Mario Latendresse presented interesting papers concluding that the Man of the Shroud’s kind of wrapping was not too tigh the Shroud simply beeing draped over the body just like sixteenth century Della Rovere’s beautiful picture depicted. Holograms of the Man of the Shroud produced by Dr. Petrus Soons and his team showed that scourge marks followed anatomical body segments shape for example concerning thighs or legs they curve in cilindrical way even where there was no contact with the cloth. My doubt is apparently we’re left with a paradoxical situation because we see on the cloth scourge marks that had to be imprinted on the cloth by contact but paradoxically they are in non contact image areas e.g. Inferior thigh areas and superior leg in dorsal body image. Had the body first been tightly wwrapped Dr John Jackson’s way and blood clot exsudate stained the cloth, and afterwards someone released the strips so the Shroud was just covering the body in the tomb when image was produced? It seems to me we’re left with a conundrum. If Yannick , Ron or someone else can help me to solve this I’d appreciate. Best regards Maria da Glória Centro Português de Sindonologia.","date":"2011-07-29","mins":"8:12 am","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","title":"More on Flagrum Proportions and Measurements and Now the Side Strip"}],"image":[{"id":"comment-423","author":"maria_da_glória_gonçalves_barroso","post":"I agree with Mr.Miller when he states that even famous painters from the renaissance period could not have painted such an image but not just because of lack of technical means the reason is just because microscopical spectromety and chemical analysis discarded paint pigments dyes or stains responsible for the image. As a matter of fact the image «did happen by a means other than painting» it is the visual effect of colored areas of the Shroud fading into colorless ones.Colored areas are the result of chemical change in a thin polysaccharide layer on topmost fibers of Shroud threads but what caused that has not yet been determined with certainty by scientific studies. Of course that it is beyond the scope of science to prove that the image is of Jesus body but with all the historical and scientific knowledge it turns out that it cannot be other than Jesus´image that is the only logical conclusion. When it comes to Mr. Anagliph I guess his claims are simply ludicrous and nobody would believe that painting a body and wrapping it in a cloth authomatically creates a negative like effect on it not to mention 3 D and Holographic properties as the Shroud image posseses. And by the way not just contact body areas produced image on the Shroud non contact areas produced also lighter color effects as distance from the cloth incrases.The flows depicted on the Shroud are real human aged blood as forensic and biochemistry experts concluded. Even so called skeptics or dyed in the wool total skeptic should be wise enough not to equivocate and not to behave as iconoclasts making preposterous assertions. Regards Maria da Glória CENTRO PORTUGUÊS DE SINDONOLOGIA.","date":"2009-04-30","mins":"7:12 pm","url":"https://shroudstory.com/2009/03/08/a-new-comment-promoted-on-tetherd-cow-ahead-discussion-on-the-shroud-of-turin/","cat":"image_theory","title":"A New Comment Promoted on Tetherd Cow Ahead Discussion on the Shroud of Turin"},{"id":"comment-9241","author":"maria_da_glória_gonçalves_barroso","post":"Once more Da Vinci conspiracy theories about Shroud image production are resurrected, this time not by a kind of protophotography technique but by «pyrography». My husband’s new upcoming book about the Shroud does focus on this issue and the reader will understand why such claims are just preposterous. Let’s unveil what he wrote on this subject. As Dr. Barrie Schwortz pointed out back in 2003, areas of scorched linen fluoresce under U.V. Light exposition and Shroud image does not fluoresce under such condition, and besides Irene Corgiat’s scorch image has not encoded 3 D data like the Shroud and doesn’t deal with blood stains problem either. If a microscopic observation would be done on fibers from this scorched image surely the crystalline pattern of cellulose molecules organization would be altered to an amorphous one, which does not happen with Shroud image fibers and colored fibers would not be found side by side with uncolored ones. The Shroud Image is unique and as Professor Alan Adler once stated «Leonardo can rest in his grave» Best regards Maria da Glória Centro Português de Sindonologia.","date":"2012-03-12","mins":"6:46 am","url":"https://shroudstory.com/2012/03/12/irene-corgiats-shroud-of-turin-image/","cat":"image_theory","title":"Irene Corgiat’s Shroud of Turin Image"},{"id":"comment-9274","author":"maria_da_glória_gonçalves_barroso","post":"I’m not a scientist and neither is my husband who is a medical doctor but there are some members of Centro Português de Sindonoogia from several fields of science who agree with scientific information conveyed by S.T.U.R.P. Investigators and others. When it comes to the Shroud, real scientific information is gotten mainly from those who had access to direct study of the Shroud and gathered samples for off site studies and later published their findings on peer reviewed scientific journals. S.T.U.R.P. Studies, Professor Raymond Rogers and Professor Adler’s studies are considered crap by Dr.Colinsberry, to him only does matter his own opinion, and that’s truly outrageous to honest Shroud scholars. Shroud science should be based on facts and not guesses. The late Dr. Walter Mc Crone is on the skeptic side but nevertheless his conclusions disagree from Dr. Colinsberry claims of the image on the Shroud being a scorch. Dr. Colinsberry stated that scientific investigation should be done so here goes a challenge for him. Dr. Colinsberry as a great scientist he claims to be should be able to reproduce by his scorch technique a life size image of the Shroud that would fit ALL characteristics and properties of the Shroud image namely optical, microscopical , physical and chemical and which would deal with the blood marks being impressed on the cloth before the image. And why not present this hypothetical work at «Scientific Conference on the Holy Shroud» which will be held at Valencia University Spain next April 28 29 30 ? I guess the comitee is still accepting papers just search http://www.linteum.com best regards Maria da Glória Centro Português de Sindonologia.","date":"2012-03-13","mins":"7:12 am","url":"https://shroudstory.com/2012/03/12/irene-corgiats-shroud-of-turin-image/","cat":"image_theory","title":"Irene Corgiat’s Shroud of Turin Image"},{"id":"comment-826","author":"maria_da_glória_gonçalves_barroso","post":"Hi I agree with everything shroud scholar Russ Breault stated in this excellent post but nonetheless I´d like to focus on some particular aspects of Shroud image. It does not surprises me at all that as Shroud Exhibit is approaching skeptics posit theories and make alleged scientific experiences do discredit the Shroud.The same has happened on Lents with the Gospel of Jude, Talpiot Tombs and all that sort of stuff after da Vinci Code… Actually italian chemistry professor Luigi Garlaschelli claims a medieval forger could have easilly accessed to materials like a linen cloth and red ocher to fake the Shroud. THIS SOUNDS LIKE A DÉJA VU It is a well known fact that red ocher is not responsible for the image on the Shroud and we have a reliable «corpus of evidence» to stste that: Red ocher is mainly natural iron oxide with impurities such as Mn Ni and Co ; Shroud iron oxide appears in a pure form and results from oxidation of Fe bound to cellulose linen fibers in water stains and in scorch areas from charred blood. X Ray Fluorescence and microchemical tests discarded the presence of such metallic contaminants so it turns out red ocher does not make the image neither does iron oxide and why? X ray fluorescence concluded that iron concentration is not increased in image areas but as expected is actually increased in bloodstained areas due to hemoglobin iron So beeing neither red ocher nor iron oxide are responsible for image color and iron oxide does not disappear from the fabric like a touch of magic as professor Garlaschelli tries make us to believe. It is also an established fact that the chromophore of image fibers is a conjugated carbonyl. If we remember the backlit photograph of the Shroud the image is no longer discernible so iron cannot be there in sufficient concentration to form the image. Another aspect I´d like to focus is 3 D encoding No doubt at first sight photogaphic negative of Garlaschelli´s shroud face looks like the real one but if we watch carefully it is not so. Professor Giulio Fanti has already analized the alleged 3 D encoding and results are quite elucidative THE IMAGE APPEARS DISTORTED AND WITHOUT REAL 3 D ENCODING. So beeing I guess it will not have holographic encoding as the true Shroud image does. We cannot take seriously a claim that instead of resulting from a research published in a peer reviewed scientific journal appears in a press release No doubt we have to admit that Garlaschelli´s shroud was a clever experiment and him and his team cunningly produced a shroud with some similarities to the real one but I utterly disagree from CNN news stating «Scientist re creates Turin Shroud to show it´s fake» it should rather state Scientist tries to fake the real Shroud of Turin. But there is just one real SHROUD OF TURIN AND IT WAS NOT MAN MADE best regards Maria da Glória CENTRO PORTUGUÊS DE SINDONOLOGIA http://www.santosudariodeturim.blogspot.com.","date":"2009-10-17","mins":"11:08 am","url":"https://shroudstory.com/2009/10/16/is-the-shroud-of-turin-a-fake/","cat":"image_theory","title":"Is the Shroud of Turin a Fake?"},{"id":"comment-5437","author":"maria_da_glória_gonçalves_barroso","post":"Dear friends I’m really amazed with the wealth of excellent comments on this issue and there is very few lett to add, nevertheless I’d like to make my own statement on this amazing forum of discussion. The bloodstains are overwhelming evidence that the image on the Shroud is from a crucified man who was crucified the way romans did it in ancient times, and besides he had been flogged with a roman torture device called flagrum as has been pointed out. The blood stains are indeed human blood and,even honest agnostics or atheists cannot deny it. Blood marks convey more information as the pattern of puncture head wounds and the spear wound on the right side of the chest ,which match the way Jesus of Nazareth endured His Passion and death on the cross. My husband who is also a Shroud researcher has just finished writting a book (which will be released in Portugal next year) about the Shroud, focussing on the scientific aspects and there roman crucifixion is studied from a medical and archaeological point of view. When romans put someone to death by crucifixion the condemned could not be taken down from the cross alive so on rare circunstances soldiers pierced the chest to confirm death a fact that Yannick Clement very well pointed out, cannot be distinctive from other crucified victims. But when it comes to the blood marks on the head that’s another story because there are no historical records of someone other than Christ to have suffered such a mocking torture. Anyway as Gabriel hypothesized Middle Age fanatics could have crucified someone the way Christ had been crucified namely in Spain, but this interesting theory has to deal with two facts, artistic renditions of Christ depicted Him with a crown of thorns and not with a helmet or cap and there is nothing in the Shroud history linking it to Spain, let alone many other peculiarities of blood marks, and the fact dead bodies don’t impress images on the cloths covering them, at least till now none was found. Ron pointed out the unique characteristics of the Image on the Shroud and I guess that’s a very important fact, and even Professor Garlaschelli with his knowledge of the chemical characteristics of the image on the Shroud could not achieve a similar image on linen. Physical and Mathematics Turin University Professor Bruno Barberis is the author of an interesting book entitled «Shroud, carbon dating and calculus of probabilities» Edition St. Pauls U.K. 1998 that my husband bought at Museo della Sindone in Turin. In chapter The Man of the Shroud and the Calculus of Probabilities he considers seven aspects shared by the Man of the Shroud and Jesus of Nazareth, namely the wrapping of the corpse in a sheet,the head wounds, carrying the cross,crucifixion with nails, the side wound,the hasty burial, and time the corpse stayed in the sheet after burial, and concluded that only one in two hundred billion crucified people could satisfy ALL these conditions put together, in other words, the Man of the Shroud is indeed Jesus of Nazareth. Even not agreeing with criteria Professor Barberis used we must remember that when romans crucified people corpses were usually left on the cross as a deterrent for by passers and the body either rot on the cross or was food for wild animals or birds of prey. Even when the body was removed it was usually thrown into a ditch and only on rare instances if roman authority granted permission for burial, family members could bury the corpse, as Gospels account on Joseph of Arimathea and Jesus burial wrapping with a linen sheet. Most Jewish shrouds did not survive because of the effects of decomposition products from decaying bodies, the Shroud of Turin is one of the very few exceptions. I’ll share with you a fact my husband mentioned and I feel the same. It’s worthless to argue with some atheists on the Shroud because they have no sound knowledge of it and when they are faced with facts as the blood and the oddities of the image they cannot deny, they just «neglect» those facts and simply ask something like this «but why can’t the image on the Shroud be of some guy other than Jesus? there should be lots of bearded males with long hair in ancient Palestine»…it seems that the fact the Shroud could be a «proof» of the existence of the historical Jesus messes with their minds, and their dogmatic atheistic beliefs. Even skeptics consider the image on the Shroud an artistic rendition by painting, photograph, and so on of Jesus Christ. For me it is not unreasonable to think that if image production on the Shroud is still an unexplained phenomena, the image and blood marks entirely matches Jesus Christ as Passion is described in the Gospels, no doubt that is a weird fact. But if JESUS CHRIST WAS ALLEGEDLY THE SON OF GOD HE AND NO ONE ELSE was the only candidate to produce such a weird phenomena. It is not by chance that the last chapter of my husband’s book is entitled «Who is the man of the Shroud final remarks». Best regards Maria da Glória Centro Português de Sindonologia.","date":"2011-12-11","mins":"1:36 pm","url":"https://shroudstory.com/2011/12/07/why-do-we-think-it-is-an-image-of-jesus-on-the-shroud-of-turin/","cat":"image_theory","title":"Why do we think it is an image of Jesus on the Shroud of Turin?"}],"misc":[{"id":"comment-8228","author":"maria_da_glória_gonçalves_barroso","post":"Hi! Mr «Superfluous Man» seems to be honest when dealing with the Shroud but despite assuming he is not aware of «the state of the art» asserts «technically if one were able to prove that the Shroud was certainly from the year 33 A.D. Even this still would not conclusively prove that it belonged to «Christ» (i.e. There were many other men who were crucified and died in or around that period)». That’s a good question indeed, and I invite him to read the post and excellent comments on this blog entitled « Why do we think it is an image of Jesus on the Shroud of Turin» December 7, 2011. Maybe there he’ll find the answer. I’d be glad to know his advice regards Maria da Glória Centro Português de Sindonologia.","date":"2012-02-14","mins":"8:19 am","url":"https://shroudstory.com/2012/02/13/comment-of-a-superfluous-man-brought-to-the-top/","cat":"news_&_views","title":"Comment of A Superfluous Man Brought to the top"},{"id":"comment-2","author":"maria_da_glória_gonçalves_barroso","post":"Hi shroudies I´m a member of Centro Portugês de Sindonologia ( it´s a center for Shroud studies in Portugal that´s the country where last Savoy´s owner of the relic died in exhile ). It´s a great joy for all portuguese Shroud devoutees to have soon the happyness to contemplate the face of our Saviour as He left His imprint to testify the Resurrection. We hope our good american friends who without any material profit allow access to so wonderful and reliable information in their websites have new scientific information about Ohio Shroud Conference. I´m very curious about what skeptics will claim… Perhaps they´ll say again that´s pseudoscience… We are planning to make new Shroud activities next Lent c you greetings Maria da Glória.","date":"2008-08-20","mins":"7:28 pm","url":"https://shroudstory.com/2008/08/20/dates-for-2010-exhibition-of-the-shroud-of-turin/","cat":"2010","title":"Dates for 2010 Exhibition of the Shroud of Turin"},{"id":"comment-145980","author":"maria_da_glória_gonçalves_barroso","post":"Congratulations. Thank God you found another place for the Museum Go on spreading the Shroud message. Regards. On behalf of Centro Portugês de Sindonologia Maria da Glória.","date":"2014-08-25","mins":"4:36 am","url":"https://shroudstory.com/2014/08/23/new-mexico-shroud-museum-to-reopen/","cat":"news_&_views","title":"New Mexico Shroud Museum to Reopen"},{"id":"comment-1302","author":"maria_da_glória_gonçalves_barroso","post":"I´ve bought the DVD Shroud when I visited Museum della Sindone (Shroud Museum in Turin) during a pilgrimage to Shroud Exhibit May 15. I consider it a very interesting documentary providing the viewers recent and reliable historic and scientific information on the subject nevertheless it contains some unforgivable inaccuracies such as the kind of cross where the Man of the Shroud was crucified and besides it is shown a «crown of thorns» piercing His head. This is misleading information because forensic studies point rather to a kind of torture device like a helmet made of thorny plants. This is an important clue to discard artistic rendition of the Shroud because as far as I know there are no medieval or renaissance Jesus paintings or sculptures with a helmet of thorns. For those who seek recent and accurate information I recommend to watch it. Best regards Maria da Glória Centro Português de Sindonologia.","date":"2010-06-02","mins":"6:39 am","url":"https://shroudstory.com/2010/04/12/press-release-from-performance-films-new-shroud-dvd-from-david-rolfe/","cat":"2010","title":"Press Release from Performance Films: New Shroud DVD from David Rolfe"},{"id":"comment-143361","author":"maria_da_glória_gonçalves_barroso","post":"Accept our sympathy We’re sure God will provide you a way to continue your mission From Portugal,, warmest regards Maria da Glória Centro Português de Sindonologia.","date":"2014-08-11","mins":"4:52 am","url":"https://shroudstory.com/2014/08/10/seam-is-closing-today-the-end-of-an-era/","cat":"news_&_views","title":"SEAM is Closing Today:  The End of an Era?"},{"id":"comment-3238","author":"maria_da_glória_gonçalves_barroso","post":"Dear Dr. Dan Porter On behalf of Centro Português de Sindonologia I wish you get better to keep your wonderful shroud blog always updated Maria da Glória.","date":"2011-06-14","mins":"7:32 am","url":"https://shroudstory.com/2011/06/09/where-have-you-been/","cat":"uncategorized","title":"Where have you been?"}],"opinion":[{"id":"comment-11111","author":"maria_da_glória_gonçalves_barroso","post":"I’ve been at Valencia attending the Congress with my husband an we’re privileged to watch the documentary «The night of the Shroud» which is very interesting and surely no biased on the matter of 1988 radiocarbon dating and their rebuttal by Benford, Marino and Professors Raymond Rogers and Robert Villareal. At the end my husband asked producer Francesca Sarracino when would the DVD be available to the public, and she said maybe next September best regards Maria da Glória Centro Português de Sindonologia.","date":"2012-05-04","mins":"7:45 am","url":"https://shroudstory.com/2012/05/04/the-night-of-the-shroud-premiered-in-spain-by-rai-in-valencia/","cat":"other_blogs","title":"The Night of the Shroud premiered in Spain by RAI in Valencia"},{"id":"comment-11189","author":"maria_da_glória_gonçalves_barroso","post":"Hi Ron I don´t mind answering your question nonetheless the best is to wait for having the opportunity to watch this interesting documentary and then draw our own conclusions. We’ll do it for the second time and with grat pleasure. T He documentary deals with several Shroud issues but it focusses mainly on 1988 radiocarbon tests and the aftermath of their daing results, hence the name of the documentary. I’ll highlight the following aspects The hidden agenda behind planning radiocarbon dating tests involving the labs, Professor Harry Gove and the Vatican is thoroughly analyzed. An updated information about Sue Benford and Joe Marino’s invisible reweaving repair theory, and unbiased information on Professor Raymond Rogers and Robert Villareal’s investigations on residual material from 1988 radiocarbon samples. At the end, people watching the documentary become aware that «the night of the Shroud» has come to an end and the truth will prevail I strongly recommend watching this documentary. Best regards Maria da Glória Centro Português de Sindonologia.","date":"2012-05-07","mins":"5:30 am","url":"https://shroudstory.com/2012/05/04/the-night-of-the-shroud-premiered-in-spain-by-rai-in-valencia/","cat":"other_blogs","title":"The Night of the Shroud premiered in Spain by RAI in Valencia"},{"id":"comment-1436","author":"maria_da_glória_gonçalves_barroso","post":"I utterly agree with comments from Noya and Tersio and despite we’re dealing with Universe creation and Big bang phenomenon I guess we can establish a parallel reasoning with the Shroud of Turin. May be in a near future science will be able to conclude what made de image that is to say determine what caused chemical change on tha thin polysaccharide layer around topmost fibers of the fabric, nevertheless even if a kind of mechanism for example corona discharge ocurred in a given moment and may account for that effect there will be a lotta questions without answer. What caused corona discharge? Why so called by products of that or other phenomena caused those chemical changes? Why those chemical changes resulted in an image effect with such weird charactristics as Shroud of Turin’s image? Did that effect ocur just by chance? I’m sure science won’t answer these questions and like in Big Bang the only logical and right answers will be God and Resurrection regards Maria da Glória Centro Português de Sindonologia.","date":"2010-09-16","mins":"7:06 am","url":"https://shroudstory.com/2010/09/02/stephen-hawking-says-gods-not-needed-so/","cat":"news_&_views","title":"Stephen Hawking says God’s not needed. So?"}],"researchers":[{"id":"comment-4599","author":"maria_da_glória_gonçalves_barroso","post":"Dear friends Professor Fanti is a great scientist who has given important contribution to the scientific study of the Shroud of Turin last couple of years, following the important S.T.U.R.P.’s studies and many others by american researchers. His image computer studies on the Image definitely shed light on the way the Man of the Shroud had been wrapped and his height and relative body parts position by extracting information from image luminance. If you read his papers about the hypothesis of image formation by Corona Discharge you’ll become aware of the complexity of the subject, and no way it goes scientifically against rational hypotheses. Read also his paper about comments on gas diffusion hypotheses and you’ll understand why Professor Rogers’ theory on amyno carbonyl reaction cannot explain all the characteristics of the Shroud of Turin image as admited by himself. Professor Giulio Fanti is crystal clear when he asserts that the Resurrection is a phenomenon non reproducible by science but LEAVING SCIENTIFIC GROUNDS could be the explanation for the hypothezised Corona Discharge and its by products. I agree that the image on the Shroud of Turin is not «the proof» of the Resurrection, and Ressurection cannot be explained by science nonetheless if you’re Christian or Catholic and you believe the Shroud of Turin is authentic and really did wrap the crucified body of Jesus Christ, then it is not absurd to consider the Shroud as the material witness of a weird phenomenon that happened in a dark tomb about 2000 years ago with a man who is supposed to be the Son of God. If scientifically speaking the Shroud is not the «proof» of the Resurrection, from a theological and phylosophical stand point no doubt it is. If we consider ourselves Christians we should not fear to state that the Resurrection was a physical event and the Shroud is an important clue to belive it really was. Best regards Maria da Glória Centro Português de Sindonologia.","date":"2011-11-05","mins":"2:50 pm","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","title":"A Guest Posting by Giulio Fanti"},{"id":"comment-4640","author":"maria_da_glória_gonçalves_barroso","post":"Dear friends When I wrote my comment I didn’t imagine it was going to start a kind of debate on the Resurrection and the Shroud.I guess I stated crystal clear my opinion on that subject and after reading Yannick’s comment it turns out his point of view doesn’t differ too much from mine. If from a scientific point of view it cannot be stated that the Shroud of Turin is the «scentific proof» of the Resurrection, I and even scientists may infer that although the image depicted on the Shroud was produced by a natural but yet unknown agent,that happened under unknown conditions. So the big question is why a dead body imprints its image on a cloth? The answer will be quite staightforward BECAUSE THAT BODY WAS UNIQUE and a special event happened on that dark tomb some time after the burial. I guess maybe Yannick misunderstood the word «by products» I meant not by products of the Resurrection but by products of a possible natural event such as Professor Fanti’s Corona Discharge hypothesis or other kind of natural phenomena. I think Domenico understands what I mean, nevertheless that was an uncommon phenomena and it happened only once in the History of Mankind and only with a man whom we believe was Jesus Christ. So be it a sign as Yannick calls it or a clue the fact is that the image on the Shroud backs up christian belief on a real and physical Resurecction of Jesus and not a kind of «spiritual» Resurection whatever it may be. We should not claim that the Shroud is the proof of the Resurrection but no doubt its own existence and the message it contains supports that belief. Maria da Glória Centro Português de Sindonologia.","date":"2011-11-07","mins":"10:33 am","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","title":"A Guest Posting by Giulio Fanti"}],"resources":[{"id":"comment-141403","author":"maria_da_glória_gonçalves_barroso","post":"Commenters on this blog are going astray from the point. Iread very interesting comments on ancient art but, The real thing is as follows: There is no known artistic image or produced by any other means, being it of Christ or any other historical or fictional person, with the characteristics pointed out by Dr. John klotz, neither there is any image on a cloth that wrapped a corpse with the mentioned properties. These are ESTABLISHED FACTS and that’s it. Skeptic community keep on searching…… (what a worthless task…) Congratulations to Dr. John Klotz for this Challenge and for his new book THE IMAGE OF THE MAN OF THE SHROUD IS UNIQUE regards Maria da Glória Centro Português de Sindonoogia.","date":"2014-07-31","mins":"5:15 am","url":"https://shroudstory.com/2014/07/26/john-klotz-issues-a-challenge-show-me-an-image/","cat":"books","title":"John Klotz Issues a Challenge:  Show Me an Image"},{"id":"comment-2052","author":"maria_da_glória_gonçalves_barroso","post":"As a modest Shroud researcher I can’t help comment, Dr Mark Oxley’s post is just brilliant it´s the kind of explanation that summarizes crystal clear all reliable scientific information on the controversy of 1988 radiocarbon dating of the Shroud, so there is almost nothing left to add nevertheless I´ll remember one more fact Dr.J. Timothy Jull apparently has neglected. Let alone all microscopic and chemical aspects the late Dr Raymond Rogers pointed out in his paper, he noticed spliced threads in material from the Raes sample and this finding was later confirmed in a study by Dr Robert Villareal and his team from Los Alamos National Laboratory presented at Ohio Shroud Conference held in Columbus 2008. Dr Thibault Heimburger by contrast phase micoscopic studies in remaining material from radiocarbon sampling area,also confirmed the presence of threads where dyed cotton fibers were spliced to linen fibers. I utterly disagree with William, Skeptics Dictionary has nothing worth reading about the Shroud of Turin and Mr. Joe Nickell’s assertions on Shroud matters are always biased by an atheis point of view. Mr Joe Nickell is not a scientist so he has not the right to criticize from a technical point of view Dr Raymond Rogers’ paper which was published in a peer reviewed scientific journal and Dr.Raymond Rogers was absolutely honest stating that Dr Luigi Gonella provided him the radiocarbon threads. Most information about the Shroud on so called skeptic websites is completely misleading and nothing but utter bogus. Dr Mark Oxley’s book «The Callenge of the Shroud» is truly one of the best easy ways to get reliable and updated information on the Shroud of Turin. Hystorical information provided is fantastic and it was a great pleasure reading this book. My sincere congratulations to Dr Mark Oxley for his book and his post. I wish all Shroud of Turin blogger’s a HAPPY NEW YEAR Maria da Glória CENTRO PORTUGUÊS DE SINDONOLOGIA.","date":"2010-12-31","mins":"1:08 pm","url":"https://shroudstory.com/2010/12/30/outstanding-response-to-recent-carbon-dating-paper/","cat":"books","title":"Outstanding Response to Recent Carbon Dating Paper"},{"id":"comment-24643","author":"maria_da_glória_gonçalves_barroso","post":"I’m sorry Ron. Please try to google «the unknown life of christ edgar j. Goodspeed» or http://www.tentmaker.org/books/Famous Biblical Hoaxes.html hope this will work Thanks to Hugh farey for the help Maria da Glória.","date":"2013-02-18","mins":"5:33 am","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","title":"The Evidence Strongly Suggests Nothing of the Kind"},{"id":"comment-24342","author":"maria_da_glória_gonçalves_barroso","post":"Holger Kertsten claims are just speculations and the swoon theory has been dismissed long ago by forensic experts. Nevertheless like the Da Vinci theory on Shroud image production this theory surfaces from time to time and we must be aware of it. My husband approaches this subject thoroughly in his book «Sudário de Turim, mortalha de Cristo ou fraude medieval?» (unfortunately not yet in english language..)and for those interested on this issue I provide one of the references he consulted, an interesting reading by historian Edgar J. Goodspeed Famous Biblical Hoaxes or Modern Apochrypha Chapter one The Unknown Life of Christ http://www.tentmaker.org/books/Famous Biblical Hoaxes.html regards Maria da Glória Centro Português de Sindonologia.","date":"2013-02-15","mins":"4:58 am","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","title":"The Evidence Strongly Suggests Nothing of the Kind"},{"id":"comment-24646","author":"maria_da_glória_gonçalves_barroso","post":"Sorry for mistyping Hugh Farey Maria da Glória.","date":"2013-02-18","mins":"5:46 am","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","title":"The Evidence Strongly Suggests Nothing of the Kind"},{"id":"comment-248","author":"maria_da_glória_gonçalves_barroso","post":"Very good video indeed I guess it´s not an updated one nonetheless it provides quick and reliable information on this subject. Why not the famous new Shroud documentary Unwrapping the Shroud on next post ? greetings Maria da Glória CENTRO PORTUGUÊS DE SINDONOLOGIA.","date":"2009-01-10","mins":"6:09 pm","url":"https://shroudstory.com/2009/01/04/talking-about-youtube-shroud-of-turin-windows-live/","cat":"news_&_views","title":"Shroud Of Turin Video on YouTube"}]}
