{"art":[{"id":"comment-6785","author":"maria","post":"In August of 2010, I lost my job of 20 years. I trust in God, and always pray that His will be done, no matter the cost, so when this catastrophe happened, I took a deep breath, walked out of the conference room, and out my good Wall St. Job. Trusting God while in a storm can still be frightful so one night soon after, while in pining over what happened, and how would I financially take care of my family, I decided to meditate on the goodness of God and to praise Him in this storm, of which I went into a dreamlike state and Jesus appeared. He walked down a graduating black Onyx staircase where a thrown sat upon. He was dressed in a radiant white robe type of loose clothing, and reached out His hand to me. We then began to dance a dance I do not know of, like when a couple dancing their first dance at their wedding. He lead the dance, and I followed. The floor was made of crystal like glass. What was different this time when I saw Jesus, then other visions I’ve had of Him, was this time I saw His face. His face, skin color, hair type and body type appear like they do in this picture. He’s so beautiful and He is such a graceful dancer; words cannot describe… When I look at this picture the only thing I can think of is how much I love Him, my true husband, and the husband of us all. I can’t wait to be with Him again and dance that dance..","date":"2012-01-10","mins":"4:32 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-6937","author":"maria","post":"Glory to God Lee, what a testimony! My mother always told me, if you can’t think of what to pray when you are in a situation, just say His Name, “Jesus”. When I was a girl, I was visited and harassed by demons. Probably because when I was ten years old my friends and I for a short time played with a wigi board, and I made friends with a new girl in the neighborhood whose mother was a witch. At that time, no one knew what to do about the situation. At last, when I was about 14 my other was going to talk to the priest in my parish. However, one night while having one of these visits, I was able to get the Lord’s name out of my mouth, and at the speed of thought the demon vanished. That’s when I learned about the power in His Name… that beautiful Name. Last week a believer friend and I got together for an after Holiday get together. We talked about all the things God is doing, and has done in our lives. She told me that recently, her brother who is a Psychiatrist (non believer) and his wife; a lawyer (and believer) were in a would be mortal car accident in their Lexis car. After they left my friend’s home that night something came over my friend to pray for them for their long car ride back home from New Jersey to Philadelphia. Their car was struck, and flipped onto its top, completely flattening and crushing it. While they were still inside, they heard the police, paramedics and fire company talking among themselves about cutting the car open with the jaws of life, and preparing themselves for what would be inside. Once they cut the car apart, they were completely shocked to find the two of the alive and untouched. My friend’s brother gave the credit to the Lexis, but his wife and my friend knew it was God. Sad for him, grand for his wife and my friend..","date":"2012-01-13","mins":"3:15 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7468","author":"maria","post":"Linda I’m writing to you at 6 am EST by the spirit of God. I’m Maria, who wrote on this blog for the first time on January 13. This is new for me, as I don’t usually blog with strangers. However, even though I’m tired, I believe God wants me to share my story with you. Only a few people know it, because it is hard for me sometimes to share this particular story. Thirty years ago when I was 21, I had an audible encounter with Father God that forever changed me. About a year later, I had a vision dream where I went to Heaven. There is much to this vision, but there is one part of the vision I think will continue to help you on your faith journey. At one point in my vision, angels were asked to take me and all of the hundreds, maybe thousands of people at my banquet table on a trip around Heaven. The angels came by in wagons, pulled by horses, and driven by angels. They took us around, and I saw the three Heavens, mansions, mountains, and a pond type grotto surrounded by snow (of which was not cold, just beautiful). As we were driven around, we asked the angels questions and were just enjoying the trip. During the ride I saw a building compound which looks like an Ivy League campus. The sound of young children’s voices singing was coming out of this building, so I asked one of the angels what that building was and what was going on inside. The angel said to me, “It’s where the boys live who died, but never lived, they sing before the Throne of God both day and night”. When I came out of this dream vision, I didn’t know what the angel meant, so I prayed about it and asked God. He told me it was where the boys who died went, and that there were babies there being raised who were sent to earth, but for one reason or another had died before they had a chance to live. At the time, I enjoyed the vision, received insight to many things that happened on that trip, but the part about the boys and where they lived didn’t make personal sense to me, because I was young and didn’t know of any babies that died. I got married at 30, and had my first child at 31 after a troublesome pregnancy. My husband and I tried to add to our little family for six years after my daughter was born, and then finally became pregnant. This pregnancy was far worse than the first. I was hospitalized, bed ridden, had in home nurse care, had an in home feeding IV and catheters dispensing medicine into my thigh 24 hours a day. I lost 48 pounds in 4 months and was close to death. The doctors decided to artificially make an opening so they could insert a feeding tube. The tube was to go in on a Tuesday, the day after Martin Luther King Day, but in morning of the Sunday before the procedure, my water broke. I was only 21 weeks along. Daniel was born that morning, and lived only four minutes. About 10:30 pm one night, about eight months after before going to sleep I decided to read a Psalm. After reading the Psalm, I closed the Bible, and asked God, what exactly was that whole event about and what possible could be the reason He allowed it to happen. Well, I didn’t get an answer, and so I shut the light and was drifting off to sleep when my daughter who had been asleep from about 8:30 pm was calling me to come in her room. She was calling mommy, mommmyyyy, mommmyyyy. Her voice was soft, and not frightened, or urgent. I got up and went inside to ask her what was the matter. She said that Jesus was standing in front of her with two angels, of which she said, my angel was there and his name was John, and He wants to tell you something. I ran and got my Bible because I was scared. I decided to test her so I asked her to ask Jesus what He wanted. She said Jesus said to her, “Let your mother know that Daniel is where the boys are, who died, but never lived…and that he sings before the Throne of God both day and night”. I stood there in the most reverent fear and trembling, because I knew that my daughter did not know my story of the vision I had so many years ago, and I knew that she really was seeing Jesus and talking with Him. In my mind, I was saying who takes care of these boys…silly thoughts that only an earthly mom would think. But Jesus knew what I was thinking and also added the following, he said, “tell your mother that Daniel is being raised by an angel named Marla. I must admit, even though Jesus comforted me in such a huge dramatic way, humanly, the loss of Daniel still hurts when we think about it, and I’d rather have been the one to raise him, and not Marla. However, God’s plans are perfect, and one day I will meet my son, and understand the things that I do not understand now. I’m also glad that I can at least say that I definitely know of one person who is in Heaven, my boy Daniel…and now your son..","date":"2012-01-24","mins":"8:24 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7739","author":"maria","post":"Rebecca, yes it is wonderful when these things happen, however, with me, I think perhaps, it’s because I constantly need the encouragement. It concerns me that I’m not strong enough to say that I pray to one day have faith like Mother Theresa, who walked a life of trust even though she walked it in the dark throughout her life, she still faithfully kept on even though she didn’t see, hear, or smell anything. But whatever it takes, I am grateful for “my” walk”. Anyway, thank you for sharing your experience, it did make me remember those special times, and how much I love when things like that happen to me. Glad that it happened to you to..","date":"2012-01-31","mins":"6:52 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7711","author":"maria","post":"I’ve smelled that flower like scent too, and love it when it happens. Recently, shortly after retiring to sleep, I turned on my side, and had that lovely scent in front of me. I knew instantly who was standing there, and just started to praise Him. Anything I had planned to pray and meditate on just vanished, and all I could do was praise Him. I’ve also smelled the scent of Frankincense, even once as I was waited on a train platform in New York City, and everyone knows what that smells like. At the time, I belonged to a non denominational weekly mid day prayer meeting at St. Patrick’s Cathedral. I met with one of the priests to ask him what this meant. He said that the scent of Frankincense is associated with deliverance… either for yourself, or for someone you were praying for. So, whenever I smell Frankincense, it’s like an Angel gets its wings on “It’s a Wonderful Life”. When I smell the flowery scent, I just stop whatever I’m doing and take a lot of long deep breaths to enjoy the Lord’s presence..","date":"2012-01-30","mins":"1:38 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7671","author":"maria","post":"Exactly marymargar… it doesn’t matter what He looks like… just people Be Ready Be Ready Be Ready!!!!!!!!!!!!!!!.","date":"2012-01-29","mins":"7:56 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7881","author":"maria","post":"Dear Sara M: Hi and welcome to this blog. I’m Maria and I just joined this blog on 1/10/2012, and I’m writing to you to let you know that I’ve seen heaven and there are horses there. When people argue that there aren’t animals in heaven, I just say to myself that they must not have read their Bible. The Book of Revelation tells of Jesus’ return while riding on a horse to the battle of Armageddon. If God doesn’t love animals, then why would He have created them in the Garden of Eden in the first place…He even created them before creating Eve! And why would it be so important for Him to instruct Noah to build an enormous arc to save so many of them? Why not just have Noah save himself and his family? Animals are very important to Him. While in Heaven, I came upon a compound like building that hosted and housed boys being raised by Angels, who were learning music and they were singing. My blog entry on 1/24/12 tells more about the boys in Heaven. Now, I am sure that many many people would say that this is just a story, or a hallucination or something like that, well all I have to say is that I had the vision in or around 1982 at the age of 22, and everyone knows that it is not cool for a 22 years old to be telling a story of a vision of Heaven, it was not something at the time I was desiring for myself. I’m an everyday Italian girl from Brooklyn, now a wife and mother, living in a bedroom community in New Jersey, who loves God and loves His beautiful Son, and is humbly grateful for His Holy Spirit. I hope to have blessed you more about animals and children being in Heaven. Bless you and thank you for sharing your story..","date":"2012-02-02","mins":"11:43 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7996","author":"maria","post":"Rebecca, first of all… hi and Shalom! On January 10th I wrote my first blog about the time I had a vision where Jesus let me see His face. I just wanted to add that the time I saw Jesus when we danced, He did look like the man in the Shroud, which also looks like the picture of Akiane. What was different about His appearance though is when I saw Him, His hair was all dark, I would say black, and very shiny, without highlights, but the room we were dancing in was also dark… we were surrounded by a smooth shiny Onyx type of stone with some type slight sparkle to it, and His skin was definitely olive, and the arm He reached out to me had some noticeable black hair on it, not too woolly though, just enough to notice that it was not without hair. His eyes did look like those in the picture… they were dark brown with very little hazel color to them, the color is indescribable though because when He looks at you, you aren’t looking at the color, instead you are pierced to the core of yourself and it’s as though they are telling you of things about yourself, the world you came from, the world you are in now, eternity… love… everything all at once, at the speed of sight… it is too hard to explain. The only word that comes to mind is rapture, and the closest thing is like when two people are in love where it takes their breath away, and when they are together they feel as though everything is right with the world and themselves, without concern or fear. All I can say is that His eyes spiritually pierce you to the core of all you are, were, and ever will be. In the first vision of Jesus I ever had, I did not see His face, but I did see His body and hair from the back and side, and it did look like it does in the picture. What was different that time was that the room was brighter and lighter, perhaps the reason why the picture Jesus with highlights is maybe the boy saw Him in a lighter atmosphere..","date":"2012-02-06","mins":"3:20 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7999","author":"maria","post":"Rebecca, when I read the last words of your message, without me doing anything, the Holy Spirit started to rest on me, and even now as I am writing this to you, right now as I am writing this to you, I am witnessing that beautiful rapture kind of chill type of feeling. All I could say is Yes, I believe you are so very right, the time is so very near for His return. Wow, finally… Come Lord Jesus Come..","date":"2012-02-06","mins":"3:46 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8102","author":"maria","post":"Thanks Rebecca, for your study. John may have seen Jesus’ face shining white because in that instance, He was being revealed as God..","date":"2012-02-09","mins":"2:43 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8379","author":"maria","post":"Hi Kristin, welcome to this very special blog. Back in January, I wrote for the first time on this blog, telling of a time when I had a dream like vision of Heaven and of the boys that were there among other things. Your above story is so full of the Love of God, and is just beautiful. I to are from a Catholic background, and was baptized in the fire of the Holy Spirit during a Mass, while on a retreat. As the Priest was getting ready to serve the Eucharist, Father God started to audibly speak to me and after that, I remained in the Church for roughly 45 minutes after the Mass had ended, but neither the people, priest or I realized what had happened. It was as if I was there with Father God alone. Over the past 30 years, I’ve noticed the Church constantly directing focus on Jesus as the only One who should be worshiped because He alone is Savior, and that Mary’s place is to be admired, appreciated and adored, just as Jesus admired, appreciated and adored her. But, from one Catholic to another, and from one Jewish Son to His Jewish mother, I am sure Jesus has a very high and honorable place in heaven for Mary, and I’m sure He will want us to know her. Blessings to you and your children. Peace..","date":"2012-02-17","mins":"12:12 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9047","author":"maria","post":"Hi Robert, that is a remarkable testimony! Wow, the world needs to hear more stories like yours. I believe more and more of these types of events are happening to people and God is allowing them so that people like you can share these stories to the unbelieving world. There is a show on FIOS TV here on the east cost called “Beyond and Back” where people tell their life after death stories. This day we are living in is so amazing, and I feel that a lot is going on in the heavens that we are not aware of… like the anticipation of a wedding! Although the news tells of horrors and sadness, and of desperate times, God is sending His message of Life! Hallelujah!.","date":"2012-03-07","mins":"4:57 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9044","author":"maria","post":"Dearest Ashwini, pray for the Holy Spirit to come upon, and “in” you, He leads us into all truths about Jesus, and to know and understand everything about Him. The Book of John is a great place to begin reading the Good News. Pray for the Holy Spirit to bring you wisdom, and knowledge of Jesus Christ, He will do it, it’s His job :).","date":"2012-03-07","mins":"4:44 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9686","author":"maria","post":"Dear Michael, welcome to the family of God! We never forget the hour when we first believed, as a matter of fact, that moment when you knew God was real will take you throughout the rest of your life. You will reflect back upon it when the going gets rough, as well as when the going is great. You will always remember that day and that hour you first believed. Hallelujah!.","date":"2012-03-27","mins":"6:41 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9727","author":"maria","post":"What date did Joe write his testimony? I’d like to check it out. Best regards, Maria.","date":"2012-03-28","mins":"12:01 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9762","author":"maria","post":"I too once met an angel, he was dressed as an old bag man. When I was in my 20s I was attending drafting school and was absolutely broke. One day, before class began, I was going into a coffee shop across the street from the school for a small coffee and do nut because all I had was one dollar and 55 cents for something to eat that night. This man stood outside to the left of the door opening of the shop and asked for money. My mind had one of those angel devil debates saying, give him money, and the devil side saying, no, he’s probably going to buy liquor with it. I continued to enter the shop and the Lord spoke to me saying, “he is my child too, and what happens to him and what he does is my business… what if he did buy alcohol with the money, but this was his last day alive, you would have made him happy and that is what I ask of my children, to love and make each other happy, their lives are up to me”. So, reluctantly I obeyed the Spirit and just bought a small coffee and gave the man one dollar on my way out. This time when I looked at his face, it was young, his skin was bright, smooth and glowing as did his bright childlike brilliant baby blue eyes… his hair under his old hooded coat was bright white. I kind of was baffled somewhat by what just happened, but had to get to class so I crossed the street and went on my way. Two weeks later I received a check in the mail from the tax department for $1,000+ and didn’t know why, so I called them to find out and they said that a mistake was made, that too much money had been taken all year, and I was to be issued this refund. I was sitting on my bed when the man’s face came to me and the Lord told me that he had been an angel. The Lord also told me that we are to treat people with love and kindness always, because we never know when we are entertaining angels unaware. So to this day, when I hear stories like your, or mine, I tell the person that it probably was an angel… unaware :) Blessings to you, stay passionate! Best regards, Maria.","date":"2012-03-29","mins":"2:56 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}],"events":[{"id":"comment-8643","author":"maria","post":"Beautiful..","date":"2012-02-22","mins":"2:16 pm","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","title":"Ash Wednesday"}],"misc":[{"id":"comment-7221","author":"maria","post":"Can someone tell me what unicorns have to do with the book “Heaven is for Real”, or the Shroud?.","date":"2012-01-20","mins":"7:26 am","url":"https://shroudstory.com/2012/01/19/comment-promoted-unicorns/","cat":"off_topic","title":"Comment Promoted: Unicorns"},{"id":"comment-21428","author":"maria","post":"Happy New Year, and thank you ever so very much for keeping this blog, it means so much for so many people. God bless you and all of your family members and friends..","date":"2013-01-01","mins":"1:57 pm","url":"https://shroudstory.com/2013/01/01/some-2012-stats-for-this-blog/","cat":"news_&_views","title":"Some 2012 stats for this blog"}]}
