{"image":[{"author":"mark_antonacci","post":"While I appreciate your interest, I wish to address some of your concerns.     With regard to the number of signatures on the petition, more people have signed identical hard copies that I have not yet posted on Test the Shroud’s web site, which I’ll be updating soon.     All naturalistic and artistic attempts that have been proposed since Vignon and Delage led the first scientific inquiry in 1900-02 have failed to duplicate the body images or blood marks found on the Shroud of Turin, including Vignon’s naturalistic method.  One advantage to naturalistic and artistic methods is that they can be tested and their results examined.     Dan also focused on two statements regarding naturalistic and artistic methods and other image forming hypotheses.  Only yesterday I was advised of some image forming papers that have been published in various journals, some of which may have been peer-reviewed.  Several of these papers do not account for all of the Shroud’s body image features.  While aware of most of these papers, I was not aware that some may also been have published in peer reviewed science journals. If they have been, I welcome the interest of the scientific journals and congratulate the authors.    My hypothesis was originally published in my book, The Resurrection of the Shroud (New York: M. Evans and Co., 2000) after almost 20 years of research regarding the evidence relating to many aspects of the Shroud’s provenance and the cause of its many unique features.  I first wrote to several STURP scientists in 1984 about an initial image forming hypothesis that was eventually incorporated into the Historically Consistent hypothesis.  I actually wrote two letters to John Jackson at that time and subsequently had the privilege of assisting John, and helping to advance the publication of his landmark Cloth Collapse hypothesis at the Paris Conference in 1989 and at the St. Louis Conference in 1991.   I had the benefit of learning from one of the very best how to devise the most logical explanations for the observable features on the Shroud. Furthermore, only one scientific test result among thousands is inconsistent with the Shroud’s authenticity as Jesus’ burial garment.  This, of course, is the controversial radiocarbon dating that the Historically Consistent hypothesis can explain.  John mentioned several times how important it was to devise tests whose results could be shown to be consistent or inconsistent with a proposed hypothesis.     A series of general tests and experiments to test this and all other image forming hypotheses was first published in my 2000 book, along with an extensive discussion of the proposed naturalistic and artistic image forming methods.  Since then I have continued to study all subsequent methods that have been proposed to account for the Shroud’s many features.  I updated the Historically Consistent hypothesis in 2012, as well as the tests and experiments in 2010.  Those tests were proposed in the keynote address given at the Shroud conference that was held in Frascati during the Shroud’s last public exhibition.       So I was a little amazed when Dan closed his comment with “… frankly, I would like to see Mark present a paper so that it can be examined in a public forum.”  My name is on four important papers given or published at three Shroud conferences in Italy and the U.S, which were attended by Shroud experts from throughout the world. These papers not only passed the conference review process, but the last paper passed a peer-review process of scientists. My 2000 book is now in its third printing.  The above papers and book cite hundreds of end notes for support. All of my statements relating to the Shroud have been open for public review for the last thirteen years.     The Shroud encompasses fields ranging from science to medicine to archaeology and countless others.  You could never be an expert in all of these fields. Even if you were trained in one area of one field, such as physics, this would not make you an expert throughout your entire field, nor would you be an expert in the other fields.  You can, however, study these fields as they relate to the Shroud and communicate with experts in these fields.      I’ve always felt that being an attorney was beneficial with Shroud studies.  The veracity and relevance of items of evidence is central in all areas of Shroud analysis.  Whether this evidence is also independent, or can be forged, or is corroborated by other such evidence is also critical.  If I had to choose one profession to have been trained in before investigating the Shroud, I’d choose the legal profession. The extent of your study and knowledge of the Shroud, and the quality of your published work is the best indicator of one’s qualifications or expertise.     Please study the keynote address, which can be found on TesttheShroud.com.  I’m not trying to be self-congratulatory or subjective, but these procedures could test every explanation for the Shroud’s radiocarbon dating and answer all the mysteries surrounding the Shroud.  If the Shroud linen cloth, blood and other particles on it were examined at the molecular and atomic level, you could also collect enough new information that scientists could analyze this data for many years to come.  I will be further updating this proposal, as well.","date":"September 18, 2013 at 12:24 pm","url":"https://shroudstory.com/2013/09/16/speaking-of-more-scientific-testing-of-the-shroud/","cat":"image_theory","title":"Speaking of more scientific testing of the shroud"}],"researchers":[{"author":"mark_antonacci","post":"Dan, the petition has always described the testing as minimally invasive (except for a one day typo).  Other statements such as press releases may use similar, but not always identical language such as minimally invasive or non-invasive.  The only changes made to the petition were a) to identify the pope by name after a successor to Pope Benedict XVI was named, and b) to ask Pope Francis to include the tests and experiments that I have described extensively on the web site and elsewhere in any future testing.Mark AntonacciP.S. Colinsberry, thanks for the “compliment.”  (I’ll be looking for a check soon.)  Thanks also for an initial look at the scientific merits behind the testing.","date":"November 7, 2013 at 3:54 pm","url":"https://shroudstory.com/2013/11/07/some-questions-about-mark-antonaccis-petition/","cat":"news_&_views","title":"Some Questions About Mark Antonacci’s Petition"}]}
