{"art":[{"id":"comment-8186","author":"mary","post":"I am not a child artist but I had a vision in 2005, which I painted quickly and then wrote about. God came to me and told me about healing broken hearts. I saw Jesus binding one up with white gauze. He told me my message is a blessing to get many peoples’ hearts healed all over the world. I am writing books for use with different ages and cultures. As they are done we are putting a link to them on the site: http://www.healingheartbook.com If you get healed, or someone you know does – please share the site with as many people as you can. Some bad people have copied my website name and put evil stuff on their site. They put “my” in front of Healingheartbook. Please ignore them as they are spiritists. Thank you, Mary.","date":"2012-02-12","mins":"11:52 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-10116","author":"mary","post":"It’s Easter Eve and I’m reading everyone entries, and crying … crying not sad tears, but happy tears — tears for Christ. And my old standby comes to my mind … there is not ONE thing I can do to make Him love me more, there is not ONE thing I can do to make Him love me less. What a Savior we have in Christ! Thank God Almighty for Easter, thank God Almighty for our Risen Christ! For those of you who God revealed Himself to in a “physical” way, what a beautful blessing. I can only imagine what a treasure that is for you. Don’t ever let it fade, hold fast to it until you meet Him in Heaven. Warmly, Mary.","date":"2012-04-07","mins":"10:35 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-17434","author":"mary","post":"The man i saw that came to me when i was sick was the face of Akiane Jesus ,when i turned it on to watch katie c show i started to cry i dont know why but that is the face i saw in my room!.","date":"2012-10-10","mins":"3:49 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3575","author":"mary","post":"That picture is accurate, that is the same Jesus I saw in a dream, also when I was in the hospital, a man that looked the same way, dressed in white (he was not tall) brought me food, encouraged me and then disappeared. I always knew that Jesus hair is not long as in the pictures, but short like the painting. When I saw the little girls’ picture a while back on her website, I said the same thing. We have seen God’s Glory Jesus Christ..","date":"2011-08-11","mins":"1:54 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9390","author":"mary","post":"I believe the same ,we are His hands ,without us He can’t reach people and help them .I myself have seen Jesus three times. Yes, he is amazing. I can still remember His smile .He still speak to me and ask me to do things for Him.Lot of time I don’t wait for Him. May God help each one of us to be yielded vessels..","date":"2012-03-16","mins":"9:35 pm","url":"https://shroudstory.com/2011/03/17/still-more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","title":"Still More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud"},{"id":"comment-10180","author":"mary","post":"James, invite Jesus into your heart. Ask Him to help you understand, but on His terms, not your own. God and everything He is, is a mystery, one we may never come to understand. Ask Him to give you a heart of love and forgiveness for what your parents did to you, physically and emotionally. Pray for this every day, and be patient. God will answer you on His terms, not yours. This is OK, there is a time for everything, and God is in control of everything. I will pray for you James. God Bless, Mary.","date":"2012-04-08","mins":"6:32 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}],"researchers":[{"id":"comment-14261","author":"mary","post":"Barrie is one of the kindest and most decent people I have met. His unwavering commitment to the authenticity of the Shroud, and the research that has been done thus far will continue to have a far reaching impact on the scientific as well as the religious world. The integrity he puts forth in the work is evident when you speak with him. Simply put, he has given his life his career to the Shroud of Turin. In the end, he and all of us must anwser to our God, and having said that, it seems to me his obligation to the sacred preservation of it (in all its forms) is not taken lightly. Bless you Barrie….God be with you..","date":"2012-07-27","mins":"8:43 am","url":"https://shroudstory.com/2012/07/24/barrie-schwortz-responds-to-colin-berrys-rude-criticisms/","cat":"news_&_views","title":"Barrie Schwortz responds to Colin Berry’s Rude Criticisms"}]}
