{"art":[{"author":"michelle","post":"Thank you. I feel always drawn to follow God. My now husband was brought up in the Jehovah Witness back ground and his mother disassosiated herself after his teens and it caused conflict for the family. She said she knew that faith was wrong while raising him but couldn’t bring herself to stop. So when I asked him to go to a baptist church he was VERY apprehensive not really believing in anything. After many years he has come to know Christ.  I have to think that maybe I was to show him to the path. I have many things to be thankful for but on the other hand I am always wondering why I was put through all that I have. I guess in the end everything will work out. I will stay true to what I feel is the truth. Thank you for the kind words.\n\n","date":"December 1, 2011 at 12:18 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"michelle","post":"I have had an interesting life. Not yet turning 40 but feeling like I am 100. My father was killed when I was 8. My mother has been married 7 times. I was molested for years. So bad that it has affected me in my adult life. My mother was addicted to drugs and alcohol. My neighbor insisted that I attend church as a child and that was how I was introduced to religion. I had a car accident at 17 and was pronounced dead during a life flight. To their amazement after several minutes of no oxygen my heart tried to beat. After many hours of heart, abdomen and other areas of surgery I was put on life support. My mother was told that there was no brain activity and that I would not survive. With no insurance they asked if they could take me off the support. My mom begged to leave me on it. Long story short after lots of rehab I walked out of that hospital. I have some problems but brain activity is not one of them. I was in a horrible abusive marriage straight out of high school. I struggled as a single parent once I finally became strong enough to leave. Somehow I always have made it back to church. I can not quote the bible and I am learning something new everyday. I did not have any heavenly experiences while I was “out”. Or atleast that I remember. I really wish that I had so that I would know WHY did he send me back to this earth!!!!??????? Is there a limit as to how much one can be put through?? I believe in God. Even though I have been through so much……more than I have listed……I still believe. I do not know if it is because I pray for a better life or something is just evident to my mind that God is real. I will keep trying to find the reason for my continued existence on this earth………\n\n","date":"November 30, 2011 at 1:21 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"michelle","post":"Funny thing…I actually have begun to think that I was put through some things so that I can be sympathetic with others in that situation. I feel that I have helped a few people along the way. I guess the pain has not been in vain. I just wonder what it would be like to be “normal”. If there is such a thing. I know we are to live by faith but I would have loved for my near death experience to come along with a vision or some kind encouraging words. I feel selfish for saying it. I am jealous of the ones that have had some sort of vision.\n\n","date":"December 1, 2011 at 4:10 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"michelle","post":"I feel like your mom. I guess my faith is just being tested. It’s funny….I have never doubted that Jesus is real. It seems it has been instilled in me and something that I can not change. Even when I was away from the church in my early 20s I always had this voice telling me that something was wrong and that I needed to get back into church!\n\n","date":"December 2, 2011 at 2:01 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"michelle","post":"I can not wait until He returns. Until then I will hold a candle for Him. Thank you for the kind words and I will trudge on. I know that everything happens for a reason…..just I wish I knew what the game plan was!!\n\n","date":"December 4, 2011 at 5:13 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"michelle","post":"Thank you Michele for your story. I am sorry you have experienced all that. I keep trudging forward no matter what. And just like this site that I decided to take part in I have some sort of sign everyday that Jesus is real. Things do not just work out the way that some things have. I learn something one day that becomes knowledge that I will need another day. We will all know our purpose one day. Some I guess are later than others!!\n\n","date":"December 2, 2011 at 1:57 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"michelle","post":"After reading the book Heaven is Real, I don’t think anyone can look upon Akiane’s portrait of Jesus without being absolutely awestruck! I truly feel I am looking upon Christ Himself and it greatly humbles me. Do  not let the bitterness of your life experiences taint what God is trying to show you!\n\n","date":"February 27, 2012 at 11:28 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"michelle","post":"I loved reading “Heaven is for Real.”  In the past few years my fear of sickness and dying began to increase.  I have always been afraid of death but recently more so than ever before.  I suppose I have come to realize how precious life is and how it can be lost in the blink of an eye and its frightening to think about.  And although I was raised Roman Catholic I am sorry to admit that at times I have questioned if this is all for real.  I don’t remember how I came to hear about this book but I’m glad that I did.  I downloaded it on my Kindle and am so glad that I did because this book has changed my life in a positive way.  It has deepened my faith in God and has encouraged me to build a better relationship with Him.  I have always wanted to read the Bible but never could get past Genesis.  My first step in building my relationship with God is to read the Bible all the way through.  After reading this book I downloaded the Bible and am currently on Second Kings (Farther than I have ever gotten!).  I feel my relationship with God grow stronger as I get through each book and I can’t wait to finally get into the New Testament to learn more about Jesus.  I talk to Jesus all the time now and share my feelings about anything that comes to mind.  Even though he doesn’t “talk back” I know that He is listening.  I have recommended this book to friends and family because I believe every word.  I know that there’s is nothing to be afraid of when you die because there is a paradise where we will be forever young and beautiful surrounded by God and all of our loved ones who we cherish so much on Earth.\n\n","date":"January 5, 2012 at 6:48 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"michelle","post":"my heart feels peace whenever i look at this photo….beautiful…beautiful eyes…\n\n","date":"April 3, 2012 at 6:42 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
