{"art":[{"author":"michele_mohrmann","post":"Joe…what a blessing you have had.  The ball is now in your court…Admitting our sinfulness, believing that Jesus died for our sins, inviting him into our lives as Lord and Savior, and accepting God’s forgiveness is what makes us real Christians.  Have you ever said the sinner’s prayer?  Here it is…  “Dear God, I confess that I am a sinner and am sorry for all the wrongs that I have done and the sins that I have committed. I believe that your Son, Jesus Christ, died on the cross for my sins. Please forgive me and I invite you, Jesus, to come into my heart and life as my personal Lord and Savior. I commit and trust my life and way to you. Please forgive me, and give me the desire to be what you want me to be and to do what you want me to do. Thank for the greatest gift anyone could ever receive; that is for coming to earth and dying on the cross in my place to pay the just penalty for all my sins. Thank you, too, for your forgiveness and free pardon, for the gift of eternal life, and for hearing and answering my prayer. Gratefully in Jesus’ name, amen.”Here is a website to go to where you can get some very helpful guidlines…\nhttp://www.actsweb.org/decision.php .  God bless you ~ Michele\n\n","date":"February 1, 2012 at 12:22 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"michele_mohrmann","post":"Very simply, in the words of Christ…”36Whoever believes in the Son has eternal life, but whoever rejects the Son will not see life, for God’s wrath remains on him.” John 3:36\nFrom this simple statement, you may conclude that he who has not accepted Christ in this lifetime as his Savior will not find himself in Heaven upon his death.\nMay you know Jesus at your Savior and may you know the blessings this will bring to your life.\nBlessings ~ Michele\n\n","date":"October 21, 2012 at 7:00 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"michele_mohrmann","post":"Hi Ray ~ I am not a Christian just because I say I am…I have  to have some evidence of a changed life.  If you say you are a Christian, you’ve got to have more than an “I prayed a prayer” story…You have to have a changed life.  That’s why Jesus said in John 8, “You will know the truth and the truth will set you free.”\n      The two characteristics of a genuine believer are that you have a growing love of God’s Word, and the result of that is that you have a growing pattern of freedom in your life.  You are no longer controlled by a sin nature.\n     People who don’t know Christ are slaves to sin…there are certain sins in those people’s lives that every time it calls their name, they come running…and they can’t change it.  They try not to be angry, they try not to be selfish, they try not to be prideful, they try not to be lustful…but they are.  And they always come back to it like a dog to its vomit…so a fool returns to his folly. (Proverbs 26:11)\n     By the way, what I wrote above is from a sermon  a Pastor named James MacDonald gave in May of 2010.  Our Pastor’s name is Carl Broggi. If you want to hear the Word of God preached as you have never heard it before…listen to Pastor Carl on Search the Scriptures, or go to http://www.wagp.net .  You will be able to get archives of his past sermons and they will blow your mind!  He has written on his lectern Sola Scriptura.  That means ONLY THE WORD OF GOD.\n     May God help you in your walk, Ray, and if you are ever in Beaufort, SC, come to Community Bible Church, where we worship the Living God every day of the week.\nBlessings ~ MIchele\n\n","date":"October 25, 2012 at 8:44 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"michele_mohrmann","post":"You are right, Diane…I think I did give the simplest answer I knew how to give, because my own words are so very inadequate.  I can only quote scripture, since scripture does not contradict itself.  And I lacked compassion, too.  I pray that you and Senior 110 will forgive me.  Sometimes I get so wrapped up in the answer that I don’t take into consideration the disposition of the asker.\nAs to a more compassionate answer, I cannot mislead anyone as to what the Lord said.  I went to a funeral for a 21 year old young man yesterday who had taken his won life…it was not held at our church, but at an Episcopal Church in town.  It was so sad to see his family so tormented by his last act on this earth.  His little sister tried to read aloud the note he left, but was nearly unable to get through it…\nDid this young man go to Heaven when his body was left here on earth?  I cannot say, but the Bible does.  Reading the Bible is the only way I know of getting an answer if my Pastor is not within speaking distance.  I am sorry to have offended, Diane, and I thank you for your response to me re compassion.  May God bless you and may He light your way.\n\n","date":"October 26, 2012 at 12:52 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"michele_mohrmann","post":"Hi Senior 110, I believe that Jesus was referring to the Jews who were still alive in 1948, when Israel became a state.  You have not offended anyone, but are asking with a sincere and questioning heart.  \nMay God bless you and may He open your eyes through the power of His Holy Spirit to understand fully the meaning of Scripture as it was divinely inspired by the Holy Spirit.      \nYours in Christ ~ Michele\n\n","date":"October 23, 2012 at 12:04 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
