{"art":[{"author":"michael_kincaid","post":"I am 57. All my life up until age 53 I questioned whether there was a God, I tried to make sense of Adam and Eve and Noah and Moses and miracles and even prayed at 15 if God existed, to make a ripple in a bowl of water I set before me one day..Nothing Happened. Most of my life was filled with sex and drugs, anger and a huge void that I thought the sex and drugs would fill. I would cuss the very God that I doubted. We never cuss Satan do we?\nAt 53, my life in shambles, one night I went to my computer and typed in…Does God exist?\nFunny,it brought up about Jesus. Then it hit me. IF Jesus was the answer, I did not need to figure out the stories of the Old Testament that had once made God seem like Santa Claus, I needed to figure out if there was a Jesus, because I did know through family and people talking that Christ said he was the only way. First I had to see if there was historical evidence and was excited when I read there was, then I turned to the bible and read articles about Jesus and his diciples and it hit me in the face…The actions of his followers. Why did they go from cowards to bold after the man had died. What would do that, and what would cause them to live out thier lives for him long after he was gone. It could only be The Ressurection!!! Thats all that made sense. I was over joyed, I went to my bed, got on my knees and poured out my heart to God and begged for his forgiveness. I promised I woud go anywhere and do anything for him. I just wanted peace in my life. Minutes later I felt what surely was the Holy Spirit enter my life, I felt the biggest high I ever felt, I felt my feet were barely touching the ground. It gets better!! I was smoking Black N Mild cigars to the tune of what would have been about 3-4 packs of cigarettes a day,my addiction wasa out of control. Before I went to bed on the fourth night after being saved, I asked God to help me,  that I was going to try as hard as I could to quit because I felt they were killing me. I swear what I am about to say here is the honest truth, I awoke the next day and was up for about 4 hours when I realized that I was holding strong and had not wanted yet for nicotine, hours went by and I waited for the urge, that urge to begin my battle, and it never came. I never had a withdrawel symptom, even after eating when the urge is so strong as smokers well know. I was afraid to tell anyone until midnight because I just knew it would break the magic spell if I did, but it was really gone. I never, not for one split second wanted for a smoke again.\nSo funny, it hit me the next day…..The water rippled in the bowl!!!!!!! When I came to God unconditionally, he did more more for me than make a ripple in a bowl of water, a ripple that could have been explained away as something that fell from the ceiling, he took away a habit that I could not control with no effort of my own, I lay no claim to do anything, but trusting him. I never thought it would just go away, I thought I would at least have to prove I would try and fight, but what I did was believed that he loved me and knew it was bad for me and he showed me that all those times that I doubted him, that he was always there waiting for me. I got even more than living by faith alone, he took away an addiction that I know in my heart I could not have quit without at least withdraw symptoms. When the devil comes to test my faith, I have even more ammunition to believe. God was so good to me. I will never doubt his existence, and I asked in the name of Jesus, if Jesus was not the answer, God would have misled me by allowing the addiction to just go away. That is why I know that Christ is the answer and the only way to Heaven.\n\n","date":"March 24, 2012 at 11:25 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
