{"image":[{"author":"mickeymullen","post":"When I was redeemed outside of a gas station at 9pm at night after leaving a protestant church the Spirit that did the work was a light, and that might be what put the image on the cloth. [mickeymullen@yahoo.com}","date":"March 3, 2015 at 7:23 am","url":"https://shroudstory.com/2015/03/03/checking-in-on-colin-berry-a-new-image-model-forming-in-my-mind/","cat":"image_theory","title":"Checking In On Colin Berry:  A New Image Model  ‘forming in my mind’"},{"author":"mickeymullen","post":"I explained to Dan how the image got on the cloth but it has to do with being born again or receiving salvation, and who wants that? I received a new heart from the Spirit in Genesis, and at that time it was a bright light of the Spirit that did the work. It must have been this same light, when it brought life back into Jesus body, that put the image on the cloth. Ezekiel 36:26 So keep ranting about it if you don’t have anything else to do.","date":"July 25, 2015 at 4:47 pm","url":"https://shroudstory.com/2015/07/25/manipulated-miracles/","cat":"image_theory","title":"Manipulated Miracles"}],"misc":[{"author":"mickeymullen","post":"The computer just automatically shut off and I lost my reply. It boiled down to, It is not God nor Jesus in the churches or religious organizations it is Satan, and if you want to read about it in the King James Bible of 1611 go to Isaiah 14:13-14 or Joel 1:13 or St John 14:30 St John 8:38, 44, 45 or St John 5:43 The preachers are preaching what Paul said that is why God removed the Spirit for redemption and Holy Ghost, from the churches. [https://www.createspace.com/4612897} If you don’t believe me go to the church of your choice.","date":"May 16, 2015 at 3:34 pm","url":"https://shroudstory.com/2015/05/16/christianity-in-sharp-decline-in-the-u-s/","cat":"news_&_views","title":"Christianity in Sharp Decline in the U.S."}],"resources":[{"author":"mickeymullen","post":"When I was reedemed or saved it was after I left a protestant church, and drove to a gas station. It was 9pm at night. I believed in my heart I could heal my mother on a pay phone. At that time the Spirit of Genesis 1:2 was a light or photographic light with the power of God behind it. It removed my heart and gave me another from God.Ezekiel 36:26 A new heart also will I give you, —and I will take away the stoney heart out of your flesh, and I will give you a heart of flesh. (from God) [Mickeymullen@yahoo.com]","date":"March 1, 2015 at 7:45 pm","url":"https://shroudstory.com/2015/03/01/from-a-small-news-segment-on-cnn/","cat":"press_coverage","title":"From a small news segment on CNN"},{"author":"mickeymullen","post":"They say a light was needed to put the image on the cloth. It was 9pm when the Spirit (a powerful  light) of Genesis removed my heart that I was born with, and gave me another from God Ezekiel 36:26.","date":"March 5, 2015 at 3:08 pm","url":"https://shroudstory.com/2015/03/05/keeping-an-audience-in-suspense/","cat":"television","title":"Keeping an audience in suspense"},{"author":"mickeymullen","post":"The Shroud of Turin could be real because it was put on the cloth photographically, God’s Spirit removed my heart and gave me another, and in the process the Spirit was a light with the power of God behind it, which the same Spirit could have put the image on the cloth photographically. mrmullen@vcn.com","date":"February 28, 2015 at 6:40 pm","url":"https://shroudstory.com/2015/02/23/while-awaiting-the-cnn-documentary/","cat":"television","title":"While awaiting the CNN Documentary"}]}
