{"art":[{"id":"comment-191485","author":"mikem","post":"I can’t believe how bad this was….This is a new level of bad. B Bad (Beyond bad).","date":"2015-02-21","mins":"10:05 am","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","title":"A Bas Relief Match to the Shroud of Turin Image?"},{"id":"comment-188043","author":"mikem","post":"Daveb, you need the opinion of a professional art conservationist. Anyway, leave it there for a year you will be surprised what comes out of it. All the feed back from people much smarter than you have been very positive..","date":"2015-02-01","mins":"7:26 am","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","title":"Picture for Today"}],"dating":[{"id":"comment-196979","author":"mikem","post":"“If it’s not documented, It’s only a Rumor”, the rule usually given by FDA inspectors applies here. Thus whole thing is hearsay with absolutely no evidence, why put any weight on it?.","date":"2015-04-20","mins":"5:39 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"}],"events":[{"id":"comment-196702","author":"mikem","post":"Watching this today, I can’t help but to think about the numerous times the Shroud has been mishandled over the years for storage, display or examination. The fact that it is still in its current, good, condition is truly amazing..","date":"2015-04-18","mins":"9:23 am","url":"https://shroudstory.com/2015/04/18/transferring-the-shroud-to-the-display-case-for-the-exhibition/","cat":"2015","title":"Transferring the Shroud to the Display Case for the Exhibition"}],"misc":[{"id":"comment-184020","author":"mikem","post":"If it’s the product of artwork then it’s expected to have comparable artwork from the same era. But if it’s the result of a first century miracle then it’s supposed to be unique, as unique as the miracle which brought it into existence..","date":"2015-01-17","mins":"7:25 am","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","title":"Ponderable for Today"},{"id":"comment-184024","author":"mikem","post":"If it was the product of the resurrection of Jesus then it’s expected to be unique since this was a unique event in history. If it was the product of an artwork then it’s expected to have comparative artwork from that era. Art techniques don’t just pop up in history and then disappear..","date":"2015-01-17","mins":"7:41 am","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","title":"Ponderable for Today"},{"id":"comment-197230","author":"mikem","post":"Nabber; thanks for those quotes. Proved the point.","date":"2015-04-22","mins":"3:29 pm","url":"https://shroudstory.com/2015/04/22/short-shrift-article-at-huffpo-uk/","cat":"2015","title":"Short Shrift Article at HuffPo-UK"},{"id":"comment-215718","author":"mikem","post":"Hey Collin, sorry I don’t comment much because of the time it consumes but you referenced an older discussion so I am kinda dragged back into this. I don’t think people were aware of the rest of the image’s existence. I lean towards the hypothesis that the Shroud was folded into a Mandylion type of display (because of the nudity) how many people were given access to the Mandylion and how often? Also who dared to open it up and see the backside of this legendary face cloth and for what reason? The nudity was the reason the image was initially folded like this and placed in a reliquary with an opening to the face but I don’t believe subsequent generations had access or knowledge of this fact. This is my 2 cents and what I personally believe..","date":"2015-12-06","mins":"9:22 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216616","author":"mikem","post":"Dan, Thank you for all your effort keeping this blog running and may God bless your Future projects..","date":"2015-12-15","mins":"6:00 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-215719","author":"mikem","post":"I might also add, In the Orthodox Church, relics are not readily accessible to the public and no body opens the reliquaries for investigative purposes. Now I have to leave to go to my Orthodox Church for Sunday mass, God bless..","date":"2015-12-06","mins":"9:29 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-215749","author":"mikem","post":"As I said there are relics in my church that nobody dares to touch. Those relics were received from elsewhere and again no one dared to touch them over there either and son on. Relics are treated with great respect in our church, the weight difference is a nonstarter for me because the weight of the cloth could easily evaporate in the weight of the reliquary (probably made of solid wood &/or metal). This is not a 1300 years conspiracy theory. It just takes one believer early on (probably in Jerusalem, Antioch or Edessa) to make that decision and hide the body for respect and the Mandylion would be treated as a Mandylion ever since. It was probably unfolded after it was taken into Constantinople, displayed and witnesses by the crusaders (which is documented). That’s what I believe in and will leave it there. Let’s respectfully agree to disagree..","date":"2015-12-06","mins":"8:46 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"}],"opinion":[{"id":"comment-196759","author":"mikem","post":"Why would someone go to that length to put the blood above the image in the Middle Ages? What is he/she trying to accomplish without proteolyses to remove the blood and a microscope to examine the fibers beneath the blood stains?.","date":"2015-04-18","mins":"6:16 pm","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"}],"resources":[{"id":"comment-196781","author":"mikem","post":"I like how they label the “Pocker holes” as Probably before 1200. I assume this is in reference to the Pray Codex..","date":"2015-04-18","mins":"11:15 pm","url":"https://shroudstory.com/2015/04/18/feature-story-in-national-geographic/","cat":"article","title":"Feature Story in National Geographic"},{"id":"comment-192023","author":"mikem","post":"New video: http://www.cnn.com/videos/tv/2015/02/25/finding jesus shroud 3.cnn.","date":"2015-02-28","mins":"9:55 am","url":"https://shroudstory.com/2015/02/28/hints-about-shroud-of-turin-episode-in-cnn-series/","cat":"press_coverage","title":"Hints About Shroud of Turin Episode in CNN Series"},{"id":"comment-192327","author":"mikem","post":"I have given up on CNN since the Egyptian revolution because of the double standards and their selective reporting as I compared them to other sources. This program was nothing different, selective information & misleading conclusion..","date":"2015-03-03","mins":"6:46 pm","url":"https://shroudstory.com/2015/03/02/full-shroud-of-turin-episode-of-finding-jesus-available-on-cnn-website/","cat":"television","title":"Full Shroud of Turin Episode of Finding Jesus Available on CNN Website"},{"id":"comment-190232","author":"mikem","post":"Colin, how do you add a loin cloth to a cloth? Or do you mean to spoil an original by painting over it. The logical thing to do is to fold it so that the nudity would be covered, then expose the complete Shroud when it became more acceptable to see a naked Christ..","date":"2015-02-08","mins":"9:52 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","title":"More Press Coverage of the Upcoming CNN Series About Jesus"},{"id":"comment-190151","author":"mikem","post":"Colin, the reason is simple. The man is naked, here is quote from Wikipedia on nude art : “Christian emphasis on chastity and celibacy further discouraged depictions of nakedness, even in the few surviving Early Medieval survivals of secular art. Completely unclothed figures are rare in medieval art”. Before it was incomprehensible to show the Shroud completely unfolded because of the nudity depicted. You want examples of the double image in art pre 1355 but how much naked art of Jesus is there?.","date":"2015-02-07","mins":"10:57 pm","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","title":"More Press Coverage of the Upcoming CNN Series About Jesus"}]}
