{"dating":[{"id":"comment-51159","author":"mike_morcous","post":"Look what happened to the Vineland Map. Even after Mc Crone was proven wrong by the C14 date, they concluded it must’ve been forged on an old parchment. I guess the same will happen to the shroud..","date":"2013-11-13","mins":"7:48 pm","url":"https://shroudstory.com/2013/11/13/what-lab-director-is-so-crazy/","cat":"carbon_14_dating","title":"What Lab Director is So Crazy?"}],"forensic":[{"id":"comment-50385","author":"mike_morcous","post":"Thanks O.K., Excellent posting. The position of the knuckles in the first set of pictures clears the confusion over the elongated fingers claim. The appearance of bones, especially on the hands, is consistent with the bible. There are several indications that Jesus was severely dehydrated “My strength is dried up like a potsherd, And my tongue cleaves to my jaws; And You lay me in the dust of death. For dogs have surrounded me; A band of evildoers has encompassed me; They pierced my hands and my feet. I can count all my bones.” (Psalms 22:15 17 NASB).","date":"2013-11-07","mins":"10:52 pm","url":"https://shroudstory.com/2013/11/07/a-guest-posting-by-o-k-on-the-allegedly-too-long-fingers/","cat":"guest_posting","title":"A Guest Posting by O.K. on the Allegedly Too-Long Fingers"}],"history":[{"id":"comment-72438","author":"mike_morcous","post":"Why don’t we look at the evidence Markwardt gives instead of going personal? I find Anonymous to be unreasonable because he/she generalizes a lot.. Historians who are pro shroudies and non shroudies…why are we bunching everybody, labelling some opinions as facts and dismissing others as legends? They are Opinions at best…..nothing mentioned in this thread can be labelled Fact yet..","date":"2014-01-06","mins":"7:22 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72401","author":"mike_morcous","post":"As a wise man once said, “there is no smoke without fire”. I never believed the letters were authentic but I think they were made up to try to explain the presence of the Mandylion in Edessa. The description of the Mandylion as an Image not made by hand, sweat imprint, tetradiplon, coincides perfectly with the shroud. The art showing the Mandilion being received from Edessa as a long cloth with a face sticking out also makes sense..","date":"2014-01-06","mins":"9:06 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72841","author":"mike_morcous","post":"Very well said O.K..","date":"2014-01-10","mins":"12:46 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"}],"image":[{"id":"comment-57756","author":"mike_morcous","post":"The labels are irrelevant. It is a nice Xray I found on the internet. The point I’am trying to make and has been largely ignored is this. It is clear from the overlay ( I matched the knuckles and fingers on both the shroud and the X ray) the blood stain matches Zugibe’s exit point. Barbet’s exit point is too low to match the blood stain. I hope someone else would find an X ray for a hand and can overlay it on the shroud and tell me where the error is instead of ignoring the point..","date":"2013-12-10","mins":"7:28 pm","url":"https://shroudstory.com/2013/12/10/barbets-vs-zugibes-exit-points/","cat":"image_theory","title":"Barbet’s  vs   Zugibe’s Exit Points"},{"id":"comment-49827","author":"mike_morcous","post":"The scorches in the example given are way to strong to compare to the Turin Shroud, you dont really need a microscope to tell. How long do you need to expose a full body hot statue ( or bas relief) to a cloth back and forth to get the subtlety and superficiality consistent throughout the whole image of the Shroud of Turin. Without even over burning or under burning any spots. Was the blood there first? If yes why wasn’t it burned too? It doesn’t make sense to me as a viable theory to explain the shroud. Any promoter of such a theory should be able to produce a complete shroud with such a technique not a coin size scorch, then maybe he will begin to make sense..","date":"2013-11-04","mins":"12:43 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-49914","author":"mike_morcous","post":"Colinsberry : My interest in the Shroud image is a response to those who say it has properties that cannot be reproduced. When you look at the scant evidence for so called unique properties, you could understand many not bothering to rise to the challenge. 1 I thought Scientific interest should be with the goal of finding the truth rather than countering others?. I think, only then we may agree with others if we are wrong. Unlike in a boxing match, a good scientist may agree with the other side if the evidence leads there. 2 30 scientists from different backgrounds and faiths including Jews, agnostics..etc, spent thousands of hours studying the shroud collected thousands of data (photographs, microphotographs, chemical analysis, spectrophotometry, UV Fluorescence, x rays…etc), published 30 papers in credible peer reviewed scientific journals and came up with the conclusion that it is unique (not a work of art and cannot be explained at this time). I don’t know exactly what you mean by scant evidence. 3 Not bothering is not the word to describe why people can’t reproduce it. As you can see, a or can’t see, any credible attempt to replicate the shroud immediately attracts media attention. Lack of interest is not the true reason, The reason no body rises up to the challenge is very simple…no one can reproduce it. 4 To me, Luigi’s body image doesn’t look life like to the eye if the shroud looked like this people would have no problem refuting it. It also doesn’t match the shroud under the microscope. The blood stains look childish at best. Pigments don’t just disappear overtime, so simulating ageing by heating and then washing the cloth is not a logical sequence of events..","date":"2013-11-04","mins":"12:56 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"}],"key_evidence":[{"id":"comment-72199","author":"mike_morcous","post":"For me the following characteristics convince me it’s not an art work ( each one of them is sufficient to convince me actually): 1 negative image: why would a medieval artist produce something that can only be fully appreciated 600 years after it’s creation, how would check his work, how did he produce it and why didn’t he produce anything else) 2 3d information illustrated by VP8 image analyzer ( arguments same as above). 3 blood stains (Kelly’s arguments work for me) 4 the fact that a multidisciplinary team with some of the best image analysis experts spent all this time yet failed to explain the image creation technique and illustrated further questions re image superficiality and half tone effects. 5 forensic accuracy re rigor mortis, serum halos , high bilirubin, blood stains profiles unlike any depicted in art. Characteristic that convince me it is Jesus: 1 the profile of injuries match the biblical account perfectly. 2 the argument that this is a victim subjected to the same process described in the bible to create an artifact doesn’t convince me because it fails to explain how the image was formed, and is not required since people would be convinced with much less evidence as we can see in other relics. Questions for pro authenticity camp: 1 c14 dating (the sampling process is an embarrassment and is not a representative of the whole cloth, against the original protocol, not blind) 2 history gaps ( a valuable object like that with a naked Jesus would likely be hidden for long times as well, the mandilion hypothesis makes sense to me especially because they could only show the face of a naked Jesus) 3 was the body washed or not or partially washed.? Thus far the questions for pro authenticity camp are all non essential to the argument but are good for further inquiry. I am currently 100% convinced it’s authentic. I know I lose credibility by claiming 100% but I honestly don’t feel any doubt that I am looking at Jesus’s burial cloth..","date":"2014-01-04","mins":"12:15 pm","url":"https://shroudstory.com/2014/01/04/what-one-single-characteristic-about-the-shroud/","cat":"uncategorized","title":"What one single characteristic about the shroud  . . . ?"}],"misc":[{"id":"comment-58049","author":"mike_morcous","post":"Good choice, I am not a catholic but this pope is my favourite.","date":"2013-12-11","mins":"1:11 pm","url":"https://shroudstory.com/2013/12/11/bruised-hurting-and-dirty/","cat":"news_&_views","title":"Bruised, Hurting and Dirty"},{"id":"comment-67429","author":"mike_morcous","post":"One thing about the nativity is usually missed. A manger, in the Middle East, is a filthy place. I remember when I was young I refused to step into one because the ground was covered in animal excrement. I think one needs to see a manger in the middle east for himself to understand the depth of the humbleness of the Son of God. To choose a place like this to come to earth is beyond comprehension..","date":"2013-12-25","mins":"10:34 am","url":"https://shroudstory.com/2013/12/24/merry-christmas/","cat":"news_&_views","title":"Merry Christmas"}],"opinion":[{"id":"comment-72319","author":"mike_morcous","post":"What an amazing Job Barrie, God bless you.","date":"2014-01-05","mins":"3:20 pm","url":"https://shroudstory.com/2014/01/05/paper-chase-the-role-of-the-internet-in-the-future-of-shroud-research-way-back-in-1998/","cat":"other_blogs","title":"Paper Chase: The Role of the Internet in the Future of Shroud Research way back in 1998"}],"researchers":[{"id":"comment-59106","author":"mike_morcous","post":"I agree with you. We shouldn’t be accusing people with dishonesty, especially if the are dead and can’t defend themselves. I believe Barbet was honest when he reported the flexing of the thumb which is an observation, we could differ on his explanation though. As you said any nail (8mm wide) passing through the wrist would likely cause significant damage to the nerves and tendons in the wrist. This may stimulate the flexion of the thumb, Zugibe even indicated that it might be the case, but only temporarily. It is logical to think that the thumb would be paralyzed afterward due to the damage of the median nerve. It is possible that a paralysed thumb would drop into that position due to gravity on the cross, also it is possible that the people arranging the corpse for burial placed the hands with the paralyzed thumbs inwards. It is impossible to tell what exactly caused the thumbs to be kept in this position, but I think Zugibe’s exit point matches the blood stain position more than Barbet’s.","date":"2013-12-13","mins":"10:22 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?"},{"id":"comment-54414","author":"mike_morcous","post":"Amazing post. Thanks.","date":"2013-12-01","mins":"2:37 pm","url":"https://shroudstory.com/2013/12/01/remembering-shroud-blood-scientist-dr-john-h-hellera-guest-posting-by-kelly-kearse/","cat":"uncategorized","title":"Remembering Shroud Blood Scientist Dr. John H. Heller–A Guest Posting by Kelly Kearse"}],"resources":[{"id":"comment-69929","author":"mike_morcous","post":"I can understand why it may be claimed that the disciples stole the body ( although it is untenable because they all died for their faith in the resurrection, people don’t die for lies like this). But why would the Romans or Jewish leaders do that. It seems ultimately foolish to try to propagate the same faith they are trying to destroy by killing the leader of that faith and then stealing the body, they already knew that Jesus talked about coming back to life..","date":"2013-12-29","mins":"10:50 pm","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","title":"New Video: Discovering Jesus in His Holy Shroud"},{"id":"comment-70222","author":"mike_morcous","post":"Hugh, I am Coptic orthodox myself. I find your assumption that the church would go into the effort of imprinting an image like that (pseudo negative, with 3d information, superficial at the fibre level..etc), and put real human blood with high levels of bilirubin on it for liturgical purposes absurd. A good piece of artwork with fibres that has real gold or real silver with precious stones is more likely what the Orthodox Church would do to honour a liturgical item like this..","date":"2013-12-30","mins":"3:35 pm","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","title":"New Video: Discovering Jesus in His Holy Shroud"},{"id":"comment-70239","author":"mike_morcous","post":"Daveb, you are absolutely right .. Liturgy clarified scripture. The Orthodox Church uses iconography and liturgy to explain scripture to the public. I find very unlikely that they would create a burial cloth with an image that was only full appreciated after the invention of photography. The symbolism in liturgy and iconography is very clear and simple..","date":"2013-12-30","mins":"4:13 pm","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","title":"New Video: Discovering Jesus in His Holy Shroud"},{"id":"comment-70264","author":"mike_morcous","post":"Thanks Dave, it is a tragedy indeed, we celebrate Christmas on the 7th of January and the Christians in Egypt are expecting a bomb to go of in a church at that time. Imagine going to a church knowing that you may not survive it. However, the Coptic Orthodox Church has survived periods like that, or even much worse, in the past. I personally have left Egypt 15 years ago because I saw this coming, my parents however refuse to leave. We try to preserve the Coptic culture in our satellite communities, even here in North America. If anything history proves, persecution serves to strengthen our faith..","date":"2013-12-30","mins":"5:56 pm","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","title":"New Video: Discovering Jesus in His Holy Shroud"},{"id":"comment-70246","author":"mike_morcous","post":"I don’t believe in the resurrection because I believe in the shroud. My interest in the shroud is mainly because it helps me realize how much Christ suffered as a man. It gives me a chance to “Behold the man” in the 21st century. I don’t need the shroud to prove Jesus to me..","date":"2013-12-30","mins":"5:00 pm","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","title":"New Video: Discovering Jesus in His Holy Shroud"}]}
