{"art":[{"author":"mike","post":"Glenn, Jesus did not allow the two on the road to Emmaneus to recognize him on the journey so that He could witness about Himself in all the scriptures.  He put a veil on their eyes until He was finished.  He still looks the same, albeit cleaned up, but still has the “marks” to show He was ALIVE!!\n\n","date":"October 10, 2012 at 7:21 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}],"events":[{"author":"mike","post":"You know you are in a scary culture, when religious blowhards are making fashion decisions.\n\n","date":"February 3, 2013 at 4:21 am","url":"https://shroudstory.com/2013/01/30/like-a-catholic-hippie-jesus/","cat":"event","title":"Like a Catholic Hippie Jesus"}],"image":[{"author":"mike","post":"UV from a nearby flash would just radiate on the outside of any close objects I guess. UV is light.\nHow could it penetrate and affect the shroud the way it is?\nStrong UV light may only be produced by the most energetic phase of lightning called the return stroke (20-30 kiloamperes on average) ,\n,so to have a possible interaction with the shroud, a direct strike should be needed.\nA direct return stroke would have produced considerable damage to\nthe shroud as well as to the corpse. As far as I know this is not the case.\nPrior to lightning strike, corona discharges may take place on nearby objects.\nThis indeed could possibly radiate from the body, if the shroud is rather dry. No direct strike is required for that.\nBut, such a strong corona effect is usually produced in open air, in the immediate vicinity of the stroke.\nWhen the shroud image was produced, rigor mortis seems to imply that the body had been in the tomb for several hours.\nIn such a place, no lightning strike could occur, no lightning-induced corona discharge could be expected.\nMike\n\n","date":"August 15, 2015 at 9:24 am","url":"https://shroudstory.com/2015/08/14/lightening-striking-the-other-crucified-person-in-his-shroud/","cat":"image_theory","title":"Lightening Striking the Other Crucified Person in His Shroud"}],"misc":[{"author":"mike","post":"thank you! merry christmas & happy new year.\n\n","date":"December 21, 2013 at 1:57 pm","url":"https://shroudstory.com/2013/12/20/christmas-card/","cat":"news_&_views","title":"Christmas Card"},{"author":"mike","post":"The a absence of the shroud from the magazine doesn’t upset me. Science was never drawn to the shroud willingly, it was always the, in your face, shocks that kept the interest (the negative image, 3d information, forensic accuracy, superficiality at fibre level, half tone effect, absence of pigments…etc) and it has always been an uphill climb to overcome the burdens .periods of interest and lake of interest vacillate all over shroud history and it won’t be long that scientists will be drawn again as better analytical methods reveal more secrets.\n\n","date":"December 29, 2013 at 11:34 am","url":"https://shroudstory.com/2013/12/29/questions-questions-everywhere-and-not-one-on-the-shroud-of-turin/","cat":"news_&_views","title":"Questions, Questions Everywhere and not one on the Shroud of Turin"}],"researchers":[{"author":"mike","post":"I agree with your measurements. That puts the exit wound exactly where Zugibe indicated\n\n","date":"December 15, 2013 at 1:39 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?"}]}
