{"art":[{"id":"comment-3515","author":"militza","post":"Lei el libro del cielo es real con Colton y parece q todo lo dice acerca del cielo es muy cierto. Tuve hace uno años, una experiencia mientras dormia. Pude ver q estaba parada en una entrada como de unas murallas de piedra blanca, ( lo q conocemos por la Biblia como “A la puerta de la ciudad”), Senti el impulso de entrar, asi q lo hice, cuando camine unos pasos dentro de la ciudad me di cuenta q el piso era en ladrillos blancos en una pequeña bajada, y al levantar la vista, toda la ciudad era blanca y era de dia aunque no vi el sol. Pude ver muchas personas que caminaban en esa calle como deprisa teniendo cosas que hacer , pero se veian contentos. Mientras admiraba toda la blancura del lugar, vi como las personas se dispersaban a cada lado de la calle hasta desaparecer de manera inexplicable, pero antes, pude ver una figura de hombre parado sin moverse en medio de la multitud, me llamo tanto la atención que me no me di cuenta cuando todos desaparecieron, quedando solo la figura de ese hombre frente a mi, como a un tiro de piedra de distancia, aunque luego parecia mas cerca cada vez. El tenia el pelo corto algo despeinado y castaño, sus ojos eran una mezcla de azules intenso, rostro perfilado y una sonrisa tenue q le llegaba a los ojos,(sentia q me daba la bienvenida, pero no podia soportar esa mirada sin llorar, pues era como fuego en mi alma, tuve esa sensación de fuego durante dias y lo único que hacia al recordar era llorar, pues solo le preguntaba, porque me miraba así), vestia una túnica blanca y me hizo q observara el detalle de esta túnica, pues era de una sola pieza sin costuras por ninguna parte y le cubrian los pies y las manos apenas se veian. No sabia que era Jesús, pues siempre lo presentan con pelo largo, realmente muy diferente. Pero dejenme decirles que al ver esta foto echa por una niña de ocho años, si es el hombre que vi recibiendome en la cuidad, no hay duda, ese era él. Que bueno es mi Jesús!!! He tenido mas experiencias, no lo he visto mas en esas experiencias pero si lo he escuchado y dejenme decirle algo, SIEMPRE habla por su PALABRA, para que no dudemos que es él.Gloria a Dios!!!.","date":"2011-08-04","mins":"11:12 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
