{"resources":[{"id":"comment-3002","author":"monica_saunders","post":"Right next to the most helpful critical review on amazon is the most helpful favourable review and in the interest of balance and fairness I would like to put an extract of this before you and anyone who might be interested in this book. As I’ve read this book I can vouch for its serious philosophical and scientific content and I have to say the way you discuss this man’s ideas without any real familiarity with them is at best childish and at worst imbecilic. “Kerner’s thesis also justifies the existence of a very different God to the OT variety, a God demonstrated by Jesus but disregarded by most Christians in favour of the Old Testament version. An implicate God that is the infinite centre of perfection described in Buddhism and implied by quantum physics. It is a natural connection to that state of perfection that this writer says the aliens are missing and that is why they are fascinated with us because we have that connection, a Soul in other words. These alien visitors are artificial creations, probes sent out by technologically advanced civilisations to explore hostile environments and warn their creators of threat. Kerner offers a good deal of evidence from Gnostic texts to suggest that Jesus warned his apostles of the threat posed by the alien phenomenon. There is evidence he presents from the recently found Gospel of Judas that seems to imply that Jesus told Judas his biological line was genetically intercepted. All in all I can’t recommend this book highly enough to the serious minded reader. Scientist or philosopher, if you can hitch up your prejudices for a moment and I for one know how difficult this is , and give this a go you’ll find this book a very interesting read at the very least and one that might inspire you to take these ideas further. It provides not just the most terrifying warning of our predicament as a species but it also gives us a deeply realistic look at the marvellous alternative that awaits those who heed this warning. It’s life transforming stuff. “.","date":"2011-04-22","mins":"3:54 pm","url":"https://shroudstory.com/2011/04/20/dissent-of-the-day-to-a-silly-old-fuddy-duddy/","cat":"books","title":"Dissent of the Day to a Silly Old Fuddy Duddy"}]}
