{"art":[{"author":"mr_moose","post":"David Mo, \nthanks for uploading all these interesting paintings. This one definitely shows some striking similarities with the PM and I agree that they certainly had some kind of common model.\nNotice for example how the shroud continues over Josef’s right shoulder in both cases, in the PM however it goes on behind his neck and proceeds all the way to John. We have the same kind of folds under Jesus head in both paintings where it is apparent that the shroud is being rolled up in the PM and therefore more narrow as it continues to John (?) who also participate in the ceremony by holding the shroud in his left hand.\nHowever, this seems to fit Jesus placement relative to the burial shroud according to the Turin Shroud (with head at cloth center) perfectly well. Maybe too well considering all the other similar features?\nSo while there are many striking similarities due to a common way of depicting the anointment scene, the PM seems to abandon the template exactly where the Turin Shroud Jesus and cloth differ. And I think that makes all the difference.\n\n","date":"June 6, 2012 at 8:31 pm","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"author":"mr_moose","post":"What I had in mind was certain traditions in depicting these scenes of the PM (Pray manuscript) rather than a single common painting.  \nI certainly don´t think it´s impossible to interpret the distinct line at Jesus shoulder as a division into two different cloths. But the same kind of sharp edged lines are occurring in the middle of what you consider to be a single piece of cloth? So I still think it´s plausible to imagine the continuation of the cloth Jesus is lying upon over Josef’s shoulder given the artist’s way of depicting fold marks.\nNow given a certain tradition of depicting the shroud resting over a participants shoulder, a tradition the artist certainly knew, don’t you think this comparison give any weight to the claim that we only have one shroud in the upper scene (instead of two or more)?\n\n","date":"June 14, 2012 at 5:19 pm","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"}],"history":[{"author":"mr_moose","post":"The most interesting link between this finding and the Shroud of Turin got to be the relationship between Mary and Elizabeth, the mother of John. A DNA test is supposed to indicate this.\n\n","date":"June 19, 2012 at 1:57 pm","url":"https://shroudstory.com/2012/06/17/john-the-baptist-relics/","cat":"history","title":"John the Baptist Relics?"},{"author":"mr_moose","post":"When considering alternative explanations for the image which not include the historical Jesus and taking into account the only constraint that a crucified body (with the same bloodmarks as Jesus) at some time must have been placed in the shroud, I can think of other possibilities that would fit somewhere between your first two points:\nIn the year 715 when Suleiman had risen to the caliphate he started to prepare a massive attack on the city of Constantinople. The Muslim chronicler al-Tabari tells us about the confrontations that took place while the Muslims tried to make their way through the land between the Byzantine and Umayyad empires:\n“The inhabitants of the city were filled with terror the likes of which they had never experienced before. All they saw were Muslims in their midst screaming ‘Allahu Akbar!’ Allah planted terror in their hearts…. The men were crucified over the course of 24 km.”\nI don’t think this scenario really fits your second point which addresses “an accidental resemblance with the Jesus of the Gospels”. The resemblance would be a main goal in the case of martyrs on the other hand. But your second point could of course easily be extended to include this situation as well (or your first point depending on how you stress the word “forger”).\nNevertheless, I think the scenario is interesting. It explains how crucifixions at certain times and areas despite the influence of Christian culture and law and scenarios like this could give us a lot of corpses with exactly the same blood patterns we find in the case of Jesus which of course raises the possibility of surviving burial shrouds. And if you prefer some place over another; pick your choice: Jerusalem, Spain, Turkey. Christians have been persecuted in many places for being Christians.\n\n","date":"October 19, 2012 at 9:34 pm","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","title":"The Central Dilemma of the Shroud?"}],"researchers":[{"author":"mr_moose","post":"DNA test on pollen? It´s at least possible (2005) to retrieve aDNA from sediment fossil pollen as old as 10000 years:\nhttp://www.anst.uu.se/lapar168/Projects_files/Parducci%20et%20al%202005.pdf\nAnd you can find numerous other similar papers. The question is how good it works for pollen in the same condition as the Turin shroud pollen. Promising reading on p. 2: \n“The outer walls of pollen grains are extremely resistant to chemical and physical attack”\nIf it´s possible to analyze DNA segments from pollen it would then be possible, I guess, to classify pollen down to species level which would be interesting in the case of the Turin shroud.\nAnd it´s possible to radiocarbon date pollen as well. That’s a quit interesting potential combination of place and time determination. And even place and time determination over the shrouds history considering pollen attached at different times and locations.\nThe risk is of course that we lose materials which in the future could help us understand the shroud in even greater extent.\n\n","date":"January 8, 2012 at 4:22 pm","url":"https://shroudstory.com/2012/01/07/bill-meacham-responds-to-gabriel-on-using-trace-elements-to-determine-geographic-origen-of-the-shroud-of-turin/","cat":"news_&_views","title":"Bill Meacham responds to Gabriel on using trace elements to determine geographic origin of the Shroud of Turin"},{"author":"mr_moose","post":"Shroud pollen determined to young age wouldn’t prove anything I agree, though it would put the shroud in general, and Max Frei in particular, into some doubts if for example the Jerusalem originated pollen (species now established through DNA) only could be traced back a couple of decays or if none could be traced back any longer than some centuries. But I think you have a point that we after all would have been left with just speculations. It would certainly be harder though to explain away Jerusalem pollen dated to around Jesus lifetime.\nRegarding the amount of pollen needed: one pollen grain is actually enough. One grain = many atoms!\nRegarding Bollone:\nWith age I guess you mean 33 A.D. and not 33 years old? (Even if that would be interesting information as well).  Never heard of Baima Bollone before, I´m kind of new to this subject. If he´s talking about DNA it´s probably related to what we know of human mutation patterns and rates. Something I know very little about, I´m more into physics.  My guess though would be that the greatest challenge concerning DNA test of the blood would be too separate the DNA components in first place from DNA belonging to other persons. But other fields, for example those related to criminal investigations, would certainly have a great interest in this particular question and I´m certain that methods will be developed in the future. How far we will reach are of course only speculations.\n\n","date":"January 9, 2012 at 8:04 pm","url":"https://shroudstory.com/2012/01/07/bill-meacham-responds-to-gabriel-on-using-trace-elements-to-determine-geographic-origen-of-the-shroud-of-turin/","cat":"news_&_views","title":"Bill Meacham responds to Gabriel on using trace elements to determine geographic origin of the Shroud of Turin"},{"author":"mr_moose","post":"Thank you for the quotation Yannick, found it fascinating. And I have never heard about these types of tests before. It always strikes me when I consider the shroud from a scientific perspective how many possibilities there should be out there, 2012, to reach some very conclusive results regarding place, time and authenticity. There is so much “stuff” to analyze. At the same time there seems to be so much ambiguity present, like the interesting contact formation of the blood hypothesis you mentioned for example with all its accompanied complications. Not to talk about what the restoration caused. A link between the Shroud and the Sudarium of Oviedo would really be beneficial. Maybe pollen (introduced again) can play a role here. If I had more time over I would have done some more detailed research in this area and not only present speculative ideas.\n\n","date":"January 14, 2012 at 9:04 pm","url":"https://shroudstory.com/2012/01/07/bill-meacham-responds-to-gabriel-on-using-trace-elements-to-determine-geographic-origen-of-the-shroud-of-turin/","cat":"news_&_views","title":"Bill Meacham responds to Gabriel on using trace elements to determine geographic origin of the Shroud of Turin"}]}
