{"blood":[{"author":"nag","post":"Mark 14:1-9 says it was 2 days before Passover when they were seeking a way to arrest Jesus.  Then it says he was in Bethany reclining at table when a woman poured [not sprinkled] some of the costly genuine spikenard perfumed oil onto his head.  In Matthew 26:12 Jesus says “In pouring this perfumed oil upon my body, she did it to prepare me for burial.”  In John 12:7 he says “Let her keep this for the day of my burial.”  Luke 22:44 says He was in such agony and he prayed so fervently that his sweat became like drops of blood falling on the ground.  The oil and the blood and sweat must have been mixed on his skin.\n\n","date":"January 30, 2015 at 7:03 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"}],"misc":[{"author":"nag","post":"If you google APOD: 2014 May 28 – The Cone Nebula from Hubble, does it look like the Romans would stop at nothing to humiliate anyone who would claim to be a king?\n\n","date":"December 17, 2015 at 1:26 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"}],"resources":[{"author":"nag","post":"Reminds me of the legendary Knights of the Round Table, in England.\n\n","date":"September 28, 2015 at 12:55 pm","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","title":"The Shroud of Canterbury"},{"author":"nag","post":"Isn’t Tim Tebow now working for Good Morning America, to find interesting topics for the show?\n\n","date":"October 3, 2014 at 12:37 pm","url":"https://shroudstory.com/2014/10/02/new-book-the-coming-of-the-quantum-christ/","cat":"books","title":"New Book:  The Coming of the Quantum Christ:"}],"sudarium":[{"author":"nag","post":"The cap of many long, thick, thorns, pointing in different directions,  was repeatedly driven into His head, so it would have been very difficult to remove it without taking some of the flesh with it.  Maybe they did leave it on his head?\n\n","date":"December 2, 2015 at 6:03 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"}]}
