{"misc":[{"author":"ncalibey","post":"I have never understood this type of fideism as the only possible way to have faith (and of course this type of epistemological dichotomy is not what Hebrews 11:1 is talking about as it is often so misquoted as saying such). Did not the Apostles not believe until they saw the Risen Christ or the empty tomb? Did not St. Thomas not believe until Christ appeared before him? Did not Paul see Christ before he stopped persecuting and began preaching? What about the countless peoples who were brought to faith by seeing the miracles of the Apostles? I completely agree with daveb, that there are many things that can bring people to faith, and the Shroud of Turin is certainly one of them.","date":"September 22, 2012 at 8:49 pm","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","title":"Really? We must come to God by faith, not by sight?"},{"author":"ncalibey","post":"Yannick,Faith, as you probably know, comes from the Greek work pistis which means ‘loyalty’ or ‘trust’. It’s a developing relationship that grows over time in Christ; while one may need the Shroud to start, just as St. Thomas needed to see Christ himself, it can develop to the point where it will no longer need it.","date":"September 22, 2012 at 9:49 pm","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","title":"Really? We must come to God by faith, not by sight?"}],"opinion":[{"author":"ncalibey","post":"Translated from google translate:Have you ever seen the piece of cloth that was cut for the C14 dating?Flury-Lemberg not participate in the election of the piece that was cut, so I could hardly know that area before.See the before and after on my blog:http://lasabanaylosescepticos.blogspot.com.es/2006/01/la-zona-de-donde-se-cort.html[Photo of BEFORE is little known, I asked Dan to take it down to your blog but have not done]They are high-resolution pictures you can see the dramatic deterioration in the cut for the C14, in addition to finding that was much higher than indicated NATURE (1 × 7 cm).There may be patches and anything you can think of ………..We know also that the exact parts cut sample were sent to laboratories.Almost all the damaged part is no longer observed after cutting the sample, and badly so he could see Flury-Lemberg.Bad choice on the court!Carlos Otal","date":"September 24, 2012 at 2:22 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"ncalibey","post":"I know that a lot of people roll their eyes at the re-weave theory because of the idea of experts somehow missing it. However, Marino responded to Madame Flury-Lemburg (who claimed this herself) and explained that unless one was specifically looking for a French Invisible Re-weave they were unlikely to find it. He backed this up with multiple authorities who explained the technique and how it is difficult to spot. I can’t seem to find it on Shroud.com, but I have it on my laptop so I’ll be able to link it to you at some point.","date":"September 25, 2012 at 9:46 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"ncalibey","post":"Thanks, Carlos!","date":"September 26, 2012 at 5:02 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"}]}
