{"misc":[{"author":"nigel_kerner","post":"Very well said Joe Marino, your comments are apposite and very well put. I found Mr.Porter’s post of the Shopenhauer quote rather ironic considering his comments about the ‘nuttiness’ of any discussion of the UFO subject in connection with the Shroud. The limits of his own ‘field of vision’ would seem to be very much determining his view of the ‘limits of the world.’\nMy name is Nigel Kerner and I have a profound interest in the Shroud of Turin which I am convinced is the most remarkable and significant artifact present in the world today. I have also written two books on the alien phenomenon. I have no hesitation in saying that I believe the two are profoundly connected in the sense that one is the antithesis of the other. I have presented evidence from the Nag Hammadi texts in my books to suggest that Christ in fact warned his apostles about a threat from beyond this planet.\nFor me the ‘Shroud of Turin’ can no longer be doubted as the burial cloth of Jesus Christ.  Anyone who has done a smidgen of sound research into this with the slightest measure of objectivity will know this.\nI came at the Shroud as a gross skeptic many years ago and I am now after three decades of looking at it through every empirical set of research studies possible, overwhelmingly convinced that it is beyond any reasonable doubt the most significant pointer to the veracity of a beautiful Jew’s claim that he ‘came to bear witness to the truth’. The truth that may well illustrate with ultimate irony that it is science itself that stands indicted as a mental paradigm that falters when it sets itself against the size of free intuitive notional human powerthat can provide ideas outside of its deadly rigid box.\nI submit that Science, or ‘scientism, the new religion of modern times, is as much faith based as any other religion. As Robert Matthews, science writer, reviewing the latest developments in physics for the New Scientist points out: “It remains hard to escape the conclusion that there just hasn’t been much progress toward answering the Big Questions.That is not to deny that some very significant discoveries have been made. But all too often these discoveries have shown that physicists are far from reaching their summit, and in some cases may be on the wrong path altogether.” He points out that although key cosmic parameters such as an accurate determination of the age of the universe have been arrived at “put simply, these measurements point to a universe filled with a kind of matter we have never seen and propelled by a force we do not understand. Such a revelation is progress of a sort, but it hardly suggests that the peak of Mount En-lightenment is just over the next hump. The impression is one of physicists not so much approaching a beckoning peak as wandering about in a thick fog.” As all the great thinkers of the past could testify from Galileo onwards, science ironically progresses out of the premise of being wrong and arguably leaves more casualties in its wake by placing blinkers on the view of its faithful flock and leading them over the precipice than all the wars and conflagrations that have ever happened on the face of the planet.\nThe shroud is a magnificat that raises us, by that I mean all humanity as a living quantum, beyond all other artifacts that can be measured with physical material tools. In this piece of linen is written the size and wondrous prospect of the human condition and the awesome power of ‘Mind over Matter’ as nothing else bears it out to be.The under-base of all reason and indeed all science lies in the twin abstractions we know as Awareness and Will through the directive of self-propagated free compunction. That incidentally is Dr Andrew Silverman’s point in his brilliant ethos on the shroud.\nThe happenings that went on in a Judean tomb 2000 or so years ago point to a manifest in human capacity of the grandest plenipotentiary powers possible, as the recent ENEA findings about the shroud may well indicate and imply. I was privileged to be present at the Frascati workshop where this research was first presented. But we have to seek as many ways as is possible to explain how it all happened. Just saying that it is all to do with the properties of ‘Godmen’ and leave it at that, just will not suffice in this contemporary world of ours. ‘Faith’ and ‘Internet’ are two words that don’t sit alongside each other easily.\nI know we are all in agreement that no conspiracy to try to rubbish it or dismiss the image on the shroud as a painting or some medieval forgery implicating it as the body covering of Jesus Christ himself based on exudate chemistry, will stand up to scrutiny. Its verification must point a way through all the various and pertinent values of meaning and reason that science can uphold.  There are so many empirically significant verifications of this particular artifact that would proclaim it a measure of our innate ignorance bias and prejudice if we deny its veracity.\nI do not mean this in any way as an insult to Dan Porter. I respect his sincerity and his devotion in trying to elicit the truth. I see him as an enigmatic contradiction. He sees the closed mindedness of many within the scientific community and makes a brave attempt to open that out but he fences himself into his own little pen of restricted view. Hence his stereotypical comments about the ‘nuttiness’ of any discussion of the phenomenon of sentient life beyond our planet.\nIn the multi trillions of worlds out there if there are indeed civilizations that have found a way past the Einsteinian adjunct E=Mc² then this might account for the phenomenon we describe as UFOs. With a mere 200 year old technology we send out robots to investigate asteroids. Just what is so impossible about a world out there that might have sent highly sophisticated biologically contrived roboids, run on a non-living programmed artificial intelligence to carry out their own agendas, agendas that might seek to superimpose their will on us through a superior technology. Stephen Hawking, Michio Kaku and Seth Shostak at SETI all believe this to be an entirely feasible proposition.\nDid we in the Euro-Caucasian world not do it to the countless indigenous people through colonialism? Do we not do it here as humans to the animal world? Yet we turn a Nelsonian eye to something with possible catastrophic ramifications to our human family. There is a tsunami of evidence now that points to the presence of UFOs verified as craft not of this world and acknowledged by reputable experts to be of extra-terrestrial origin here on this planet. Some of the most credible people on this planet have now stood testament to this including astronauts, military men, pilots, policeman lawyers, doctors and priests. They come in their thousands to testify.  The most illustrious names amongst them went on record recently putting their reputations on the line at the Washington Press Club to present their first hand reports of sightings of UFOs near nuclear installations thus affirming the presence of an extraterrestrial  technological quantum here on this planet. It is foolishness bordering on insanity to ignore such reports as the figment of people’s imagination.\nDan Porter has sadly missed the point. If the presence of extra terrestrial craft with their occupants on this planet is even remotely true, you come over a deeply short sighted man in not seeing that it is as significant as what is implied by the verity of the Turin relic. In fact I will go so far as to say now that the two are intimately connected and that the man depicted on the cloth resolved his presence on this planet to warn us about the consequences of this presence. Ironically your attitude in all this might be described with the old fashioned word ‘sin’. Where sin is seen for what it truly is – Mere restriction.\nThe ‘Man’ depicted on the Shroud proclaimed a remedy for ‘sin’. He said simply ‘Repent’. The Greek translation of the  Aramaic word ‘repent’ as used by Christ  in the original Aramaic tongue was ‘metanoiete’. And ‘metanoiete’ in Greek meant simply: Change your mind. Just a simple change of mind was all that was required to forgive anything and anyone including your self. Changing one’s mind requires information, information that will allow and adorn the reconciliation of facts that might banish ignorance and thus restriction.\nSin is not some tired old fundamentalist religious invective or directive notion soliciting shame, placation, compensation, and forgiveness by a remote authority. The Church translated the word ‘repent’ in its own way to give a pack of scoundrels who were forming the organizational aspects of the Christian faith (then and to the time of the Counsel of Nicea in 325 AD and later), the power to control the destiny of millions by making the burgeoning flocks rely on their sanction to receive ‘forgiveness’ from ‘sin.’ They loaded church dogma with sanctions that included corollaries for fear, guilt, and the seeking of forgiveness. These were nothing more than political tools through which they gave themselves the power to control the behavior of millions and enrich themselves at the same time through the distribution of indulgences. All this had the huge built in implication that if you did not get the sanction and approval of the Church fathers in all things, all rewards beyond life were closed to you. However, if you can change your existential prospectus by simply changing your mind on your own recognizance, then you do not need anyone else to make the shape of the sign of the cross in front of you and maintain your license for eternal life. Something on which the church authorities relied to give them power over and control over of the flock. I cannot help feeling that millions have been robbed of their natural eternal destiny through the denouement of this dreadful canard by the Christian organized circus.\nI see the word ‘soul’ as simply an information field. I say simply, but it is the most profound of information fields when it belongs to a living individuality that came in with the Universe at the Big Bang. That is the crucial thing. It all came out of the point that began the Universe and would thus be expected to hold the whole quantum of information that defined the Universe from its very beginning. The ‘God-point’ if you like. We make this point an anthropocentric reference we call GOD.  It is much easier to relate to in this way and why not make God more user-friendly by seeing it in human anthropomorphic terms or any other species terms that might exist out there in the Universe on other planets.  However the disadvantage is that it can be so easily confused in our neck of the woods with that other great and powerful influence, parentage or other models of authority such as the local ‘Lord of The Manor’ or indeed the State or the governance mechanisms that rule our lives. For that reason I believe it is better seen in a secular way,\nScience tells us that Information can never be destroyed. It follows therefore that we as living beings carry on past the tenure of the body at its demise. I believe we all as living beings carry on as individual fields of information we might call a SOUL. The body that gives it form and isolation is just a holding frame or capacity for all this information to be individual with life running as the under-base property to hold it in a universe of force. This total quantum of all information comes down through a concatenate birth ancestry of billions of years and settles as individual living points that live and die continually as physical living beings in countless planets Universe wide.\nBut it all comes from a primal origin: The God Singularity. This primal origin is thus conscience itself, the final quantum of all knowledge and thus the reference library against which all options and choices may be measured and seen existentially. \nThe SOUL to me operates somewhat like a mobile phone and I use this mechanism to explain the paradigm to children.\nThe device is held in your hand and on it a message is written. The message is simply a unique quantum of information defining itself and a moment in space and time. In essence the message is a selection of electro-magnetic shapes of force no different than any thought scenario each of us might make with and through our physical senses by our body.  In the mobile phone, at the press of a button the messageis sent at the speed of light silently and invisibly to another location which may be feet away or thousands of miles away. To all intents and purposes it is instantly sent and received. No one sees it or knows it is there when it is moving yet this pattern of force, (the message) carrying sense and meaning, travels in space and time between two or more points till it is intercepted and received and made discernable as a message by the receiver pressing a button. It can never be destroyed once it is sent.  It is ‘information’ itself but in a package spatially dimensionally congruent moving in space/time.\nAnother illustrative tool is a reel to reel or audio/video cassette recorder. Anyone who has owned a reel to reel or cassette tape recorder will know that these work on a similar principal. The tape is coated with an oxide of iron. It passes across a transducer which through enforcement arranges the sound as a randomized array of electrons on this ferrous based recording field of electromagnetically dopable material. The randomly arranged electrons of iron oxide are forced to take on the shapes of the sound or a picture of the speaker or singer and this is then read and retranslated back into a shaped power that pushes pixels of reactive chemistry or the air in a speaker cone and that makes the vision and sound you hear. In other words information is passed from one location to another as a quantum and this information whole and entire is reproduced.\nLet me propose that we as living beings have propensities somewhat alike, but also in other ways profoundly different, to an electronic phone or video message device. I SAY THIS ADVISEDLY. We are in reality awesomely different to a message made by an electronic device because our information field can hold all information available including information on the abstract and the intangible. This is the crucial thing. Electronic device messages can only hold a portion of information. They cannot hold information that allows for imagination and ideas in abstraction. They cannot imaginatively create messages of their own accord. On the other hand our natural information field called a SOUL holds absolutely everything. It can make messages out of its own accord log it and transmit it.\nThe intriguing thing is this.\nThe human body is a powered dynamo. Its bio-electric power is made through the circulation of the blood. The blood contains hemoglobin (something that might be seen as liquid iron) and the heart pumps this liquid iron in a circulation. The circulation is in effect a coil. When you circulate iron in a coil you make an electromagnetic field manifest. This is the basis for producing and holding the information field in a single location. During any lifetime this information field is held to and through the body cataloguing all experience and when at death the circulation stops, the electromagnetic holding power ceases and the information field (soul) is released. The Soul or information field is indestructible and defines all there is to us as individuals.  It holds all the information that makes a living identity, in-house. A duplicate of that which was held as the master singularity from the very beginning of the Universe itself and in a connected line through ancestry and birth through the countless lifetimes through which It comes (perhaps through reincarnation – once believed by all the main religious theosophies). It is qualified and stunted by the various restrictions it makes for itself through its experiences that make it unique and thus individual. This information in its entirety is then released to move on at death to another form of existence or, if reincarnation is true, into another body somewhere in this reality, in this universe in this or some other planet. I believe that this mechanism exists in all living things and can, beyond death reallocate our presence elsewhere with all the propensities and capacities we hold in life on a format that is similar or perhaps more advanced. That is NOT new age philosophy it is a rational and common sense surmise.\nThat is a basic look at the whole thing explained as simply as I can in this blog. I have explained my own takes on the hows, whys, whens and wherefores of all this in my books in more technical and explicit detail with reference to scientific articles and studies.\nSeth Shostak at SETI has stated that he believes the most likely form of extra-terrestrial entity would be artificially intelligent and therefore robotic. Stephen Hawking is now suggesting that we send our own biological information out into space so that our species can be preserved elsewhere should this planet become uninhabitable.The Grey alien entities that are witnessed and experienced by so many reliable individuals may well be such as this. I believe that what we call UFOs may well include this highly advanced extra-terrestrial roboidal entity (commonly called the ‘Greys’). It is my thesis that these entities, an artificially intelligent synthetically produced reconstruction of beings on other planets, may well be attempting to hack into our individual fields of information with their advanced technology, to bridge their information into us, thus taking away our specific identities, making us serve their operating systems and their purposes and not our own. If such is the case we might lose ourselves forever and no more exist as the unique individuals we are naturally. Individualizations that the great Jewish teacher Jesus Christ alluded to when he said: ”ye are Gods”.\nIn summary, I believe that the problem comes when this individualized natural record of the cascade of life and livingness (I call a soul) is added to by supplanting on it a created mechanical means of directed influence such as a computerized program deployed through an entity that doubles for a natural one. A robotic or roboidal creation that works on artificial intelligence run by a controlling synthetic mechanism we might call a programmed operating system.  I believe that this is what is likely to come with UFOs and the super intelligent synthetic life-forms that might come with them. Remember robots created by beings with a supremely advanced technology looking for a way to extend their existence perhaps after their own planet has become no longer habitable would be programmed with the ultimate in artificial intelligence. This artificial intelligence would logically involve a program to extend its scope to cover all possible knowledge to promote the survival and continuance of the information it contains in the best possible aspect. So, if this intelligence detected something it could not understand or know it would seek to somehow find out about it. This would mean somehow bridging its artificially intelligent program into any unknown quantity that has all the adaptations necessary to survive at any particular hospitable planetary location. In other words, by bridging their artificial intelligence into us they would be extending the existence of the information given to them by their creators, just as transhumanists like Kurzweil seek to do when they look for ways to download an entire individuality into an artificial information format in the interests of seeking continuance for that individuality. Any artificially intelligent visitors could achieve this goal via transhumanism and the insertion of chipping technology into our biologies or via some kind of genetic engineering. Which incidentally is exactly what is reported by individuals who have been subject to what has been described as the abduction phenomenon.\nNothing can be more catastrophic for humankind than to buy into this coming momentum of chip induced ‘transhumanism’.\nWe don’t have to look to 2012 for some catastrophic event that might wipe out human kind. I believe trans-humanism techniques will do it. I believe it is already here inexorably creeping into the commercial, social and political body-politic of the human family through the technological perspectives extra terrestrial entities and their cohorts imposing on us, feeding us and selling us. Sadly, I cannot help feeling the whole swell of humanity will buy into it without much resistance.\nBefore 2050, Ray Kurzweil predicts that AI and nanotech will have advanced so far that our brains, with their memories, capabilities and characteristics, can be reduced to pure information and programmed into a non-biological interface be it a supercomputer, or a swarm of nanobots. The way advances in technology seem to be progressing this possibility seems more and more realisable. The trans-humanist perspective is by no means science fiction any longer. All this with 200 years of technology, can you imagine what other civilisations beyond this planet might have achieved with a longer time span?\nThe coming battle lines are set as the natural against the synthetic. It will become the only game in town. If the natural and implicit way of things includes a means of accessing through death a universal deployment to existence on an eternal scale as alluded to by the great teachers of the great religions, then the machinations of synthetically created, entities may well interrupt or terminate this exigency. Their promise will have to be a temporal kind of eternity that extends human scope and meaning in aspects remotely controlled by machines and gadgets not by the inertias of self will. Nothing will be more catastrophic than this for any individualised living being with the scope of humanity.\nI am not one of these New agers running on the fuel of tooth fairies and rainbow mist. I am a scientist at mental root and my ideas come through routes run in empirical ways. I detest putting letters after my name to attest my persona, though I come from a family of scientists. Ironically I came to understand what might be termed ‘spiritual things’ more profoundly through science than religion. You might do me the courtesy of reading my book ‘Grey Aliens And The Harvesting Of Souls’ before you dismiss it just because it alludes among other things to the phenomenon of UFOs. I admit the title is a bit bizarre but that is the publisher’s license not mine. But you should never judge a book by its cover if you choose to criticize its content publicly. That kind of judgment would contradict your own scientific inlay.\nWhen we have walked on to face the folly of our thinking one nanosecond after our individual ‘information field’ leaves our body and crosses the threshold beyond atoms, we might turn back a moment and see the sadness on the faces of those who tried to point us away from the predicament in which we may find ourselves beyond life – in the frames of death. Then perhaps we might simply seek to change our mind but find we cannot because our information field has been hacked into by some super android with the technology to do this and whose program and operating system will run us for its own purpose and not ours. Indeed if we all are made into some kind of machine human amalgam through implanted chips that can be controlled remotely we are likely to have lost the concept of ‘self’, because the quantumly computed machine that will run our mind can never have a concept of ‘self’.\nI am convinced of this after over thirty years research into these extra-terrestrial pseudo biological entities and their deployments on our planet.  It is to make that point that I write you this discourse.\nYou defend the scientific way with such dismissive vehemence I can only think you are a romantic. These days anyone who has done any research in science knows it is not the pursuit of truth but the pursuit of funding that motivates all.This dislocation indicts all those small men with their sulphurous egos and comic spreads of letters after their names.They walk with noses so up in the air they cannot see where they are heading, claiming that Science or any academia is the best and only way to truth. Nothing can be further from the truth. The greatest tray of wisdom put before mankind came from individuals who did not have a single letter after their names. They are yet to be proved wrong thousands of years later and it seems are each day being proved right with the discoveries made ironically by science artisans themselves as they observe the enigmas of the Universe and uncover through quantum mechanics and other new fields of endeavour, that the original great teachers may well have been right all along. These discoveries now imply that that which is unseen and immeasurable empirically is far more existentially valuable and relevant in affirming truth and benefit to our frame of existence. \nIt’s such a pity in a way, Dan Porter has a good honest face. Somewhat like my grandfather’s. While there is no empirical ruler that will measure that surmise with any accuracy, in the interests of some personal sentiment I hope he might repent or else hold a small smile on his face while he reads this.\n\n","date":"March 5, 2012 at 8:36 am","url":"https://shroudstory.com/2012/02/07/quote-for-today-by-arthur-schopenhauer/","cat":"quotations","title":"Quote for today by Arthur Schopenhauer"}]}
