{"history":[{"author":"noya","post":"Hi Shroudies,\nTersio point is 100 % valid. The shroud is neither Forged nor a Copy. It is a miracle, to tell the Humanity, what God Almighty can do and lame science has still to prove, the scientific action of God Almighty. Pray to the living Almighty God, and He will guide you to understand the scientific phenomena. Why Almighty God preserved this image, to tell the Truth about the Holy Christ of History.\nAnd correct the story of Holy Christ of Faith.\n\n","date":"April 14, 2010 at 7:15 pm","url":"https://shroudstory.com/2010/04/12/tersio-makes-and-important-point/","cat":"history","title":"Tersio makes an important point"}],"misc":[{"author":"noya","post":"The summary of various ideologies, leads to a conclusion that hell is a place like hospital, where treatment is provided to all those souls who are suffering from some moral sickness. Once they are cured, they are made to enter eternal paradise. If sick souls are allowed to enter the paradise, they can start an epidemic and make everybody sick. God Almighty, created everything for the progeny of Adam & Eve. HE new that sickness will be infused by SATAN in simple and greedy people while on earth. So HE prepared an Hospital for their treatment called Hell. No need to worry, think positive and God will help you to understand HIS universe.\n\n","date":"April 5, 2011 at 5:50 pm","url":"https://shroudstory.com/2011/03/24/fired-for-doubting-hells-existence/","cat":"news_&_views","title":"Fired for doubting hell’s existence"},{"author":"noya","post":"A truthful and scientific comment.\nReligion and Science move proving and reproving, each other.\nScience is an act of God, while Faith is the guided way of God to understand His Acts, the Science.\nHuman mistakes in understanding faith, will lead to defective reproving in science. similar is the case here. Certainly, Shroud is a fact, visible to everybody, if we fail to understand, how this picture was created, it is our defective faith or our defective science, which is standing in our way to solve the mystery.\nWe should be bold enough in correcting our faith, and science will certainly come forward to prove it, that this is “picture of Real Jesus Christ, who never died on the cross”, all Biblical statements, about HIS appearances, after disappearance from the temporary sepulcher, are true facts. He, our beloved Jesus Christ was a true beloved Prophet of God.\nScientists should give a serious thought, to what is claimed by Mirza Ghulam Ahmad of Qadian, India. He is the claimant of being Second Coming of Jesus Christ, in spirit. He claimed that our beloved Jesus Christ, lived a long life (to spread the message of God, to all tribes of Israelites), after fulfilling the prophesy of Bible, as per guidance given to him by God Himself.\nHe further claimed that disciples of our Beloved Jesus Christ, prepared a special Ointment to cure fast the wounds of our Beloved Jesus Christ, which might have been applied on the whole body of our Beloved Christ. If after application, of this ointment, Our beloved Christ was wrapped in the Shroud Cloth, the evaporation of this Ointment, might have created this image on the shroud. All the references of this Ointment components are given in several books. The name of this ointment is also referred as “Marham Issa”, which means, an ointment specially made for Jesus Christ. These are Historical facts, which are being completely overlooked, due to our Faith only. Please set aside the Faith, for a moment and look into the historical facts, claimed by the claimant of the Second Coming of Jesus Christ, in spirit. This may show us a new cavern with a lot of scientific light.\n\n","date":"October 23, 2010 at 8:56 am","url":"https://shroudstory.com/2010/10/22/intellectual-sifting-get-real-a-lesson-for-shroud-of-turin-studies/","cat":"news_&_views","title":"Intellectual Sifting: Get Real – A Lesson for Shroud of Turin Studies"},{"author":"noya","post":"Little knowledge and big statements by sons’ of Adam, is itself a proof that both scientists and theologians need more schooling of elementary theology and alphabet of scientific investigation.\n\n","date":"November 17, 2010 at 5:33 pm","url":"https://shroudstory.com/2010/11/16/maybe-god-doesnt-know-the-future/","cat":"news_&_views","title":"Maybe God Doesn’t Know the Future"}],"opinion":[{"author":"noya","post":"A question to Physicist Stephen Hawkins.\nHow His theory will tell difference between a living human Body and a dead human Body. Gravity is all the time existing….but something is missing from the dead human body. Existence of God can explain it. Let your theory explain it.\n\n","date":"September 4, 2010 at 10:55 pm","url":"https://shroudstory.com/2010/09/02/stephen-hawking-says-gods-not-needed-so/","cat":"news_&_views","title":"Stephen Hawking says God’s not needed. So?"}]}
