{"dating":[{"author":"pakeha","post":"Mme MF showed her knowledge f the reweavingtechniques by writing a thorough rebuttal of the Marino Benford theory, correct me if I’m wrong.\n\n","date":"October 20, 2013 at 11:48 am","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"author":"pakeha","post":"\ncolinsberry :\n“I hope to be able to publish it before the end of this year.”\nIn your position, Thibault, I would feel duty bound to say what I knew back then immediately, and not keep people waiting a day longer for what you knew about an extraordinary abuse of trust and position – the covert removal and sequestration of even a single thread being a gross breach of professional standards in my view…\n\nI second you on that thought, colinsberry.\n\n","date":"October 20, 2013 at 10:57 am","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"author":"pakeha","post":"\nO.K. :\nNo, just the threads used must resemble original as much as possible, so usually threads from the same fabric are used. But it was not possible in case of the Shroud -repairing one damage would create another in different place of the precious cloth.\n\nIn that case, the patch wouldn’t be invisible, even to the naked eye or touch.\n\n","date":"October 20, 2013 at 11:25 am","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"author":"pakeha","post":"Please keep in mind an invisible reweave depends of using thread from the original fabric. It would affect the dating in the least.\n\n","date":"October 20, 2013 at 11:00 am","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"author":"pakeha","post":"Hi, Max.\nI didn’t understand how  66% contamination from additional material added in the 17th century account for a 14th century dating of a 1st century artefact. Could you walk me through that calculation, please?\n\n","date":"October 4, 2013 at 8:48 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"}],"image":[{"author":"pakeha","post":"Barrie, what are your sources for that information?\n\n","date":"September 18, 2013 at 3:13 am","url":"https://shroudstory.com/2013/09/16/speaking-of-more-scientific-testing-of-the-shroud/","cat":"image_theory","title":"Speaking of more scientific testing of the shroud"}],"misc":[{"author":"pakeha","post":"\nLouis :\nKouznetsov is irrelevant to Shroud studies, he was discarded long ago, so why waste time with him?\n\nWould that it were in the past.\nIn another thread here, it was brought out the fellow was mentioned in a paper given by Marinelli in the 2012 Conference in Valencia as a legitimate source of information.\nIt’s amazing how long the shadow of his fraud extends.\n\n","date":"October 1, 2013 at 2:46 am","url":"https://shroudstory.com/2013/09/30/on-dmitry-a-kuznetsov/","cat":"news_&_views","title":"On Dmitry A. Kuznetsov"},{"author":"pakeha","post":"Thanks for posting up this comprehensive list of posts exposing that fellow! I’ve book-marked it for future reference.\n\n","date":"October 4, 2013 at 8:22 am","url":"https://shroudstory.com/2013/10/01/more-on-dmitry-kuznetsov/","cat":"news_&_views","title":"More on Dmitry Kuznetsov"},{"author":"pakeha","post":"Dan, thanks for posting up this article. Though it seems hard to believe, the fellow’s hoax continues to cited as legitimate research and I hope your contribution helps nullify the damage he’s done.\n\n","date":"October 1, 2013 at 2:50 am","url":"https://shroudstory.com/2013/09/30/on-dmitry-a-kuznetsov/","cat":"news_&_views","title":"On Dmitry A. Kuznetsov"}],"resources":[{"author":"pakeha","post":"\nO.K. :\nPakeha:\nGenerally I saw that google translated some previous articles well, but unfortunately not in this case. In fact those articles were written for Poles, and I don’t bother translating them into English -too much work. The main point: the Shroud didn’t lay flat, neither it was in strict contact with the body. The situation was something between the two, and Mario Latendresse showed in his paper, that it doesn’t create any major distortions which were argued before, both by sceptics and Shroud proponents.\n\nThanks for the heads up on the Mario Latendresse article.\nI’ll hunt it out and read it and let you know what I think of it.\n\n","date":"October 4, 2013 at 8:18 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"pakeha","post":"\nJoe Marino :\nI’m dealing with a sick dog.  Will get back when I’m able.\n\nAll the best with the dog. These faithful friends deserve all attention and care we can give them.\n\n","date":"October 4, 2013 at 8:20 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"pakeha","post":"Could you give a source for that interview, please?\n\n","date":"September 28, 2013 at 5:47 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"pakeha","post":"Thanks for your comments, Dave Mo.\nIt’ll be interesting to see how mr Marino defends those charges!\n\n","date":"September 28, 2013 at 5:51 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"pakeha","post":"Freemasonry?\nDo you agree with this?\n\n","date":"September 29, 2013 at 8:38 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"pakeha","post":"I read your reply and was astonished to see you\n“highly recommend Emmanuela Marinelli’s article “The Setting of the Radiocarbon Dating of the Shroud” at http://www.shroud.com/pdfs/marinelliv.pdf”\nWhat is it in Marinelli’s article you find convincing?\n\n","date":"September 28, 2013 at 5:56 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"pakeha","post":"Flury-Lemburg wasn’t of that opinion re the reweaving question. Could you explain why she’s wrong, please?\nThanks!\n\n","date":"September 29, 2013 at 4:58 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"pakeha","post":"Just for starters, Marinelli says in her introduction “The Shroud is an extraordinary relic because, in addition to its being stained with blood 1.,bears the imprinted image of the corpse that was wrapped in it.”\nShe used the Heller-Adler paper as her source material.\nAt the very least, that paper has been disputed repeatedly.\nSo right from the start, from the very first foot note, Marinelli, seems to be on dodgy ground.\nIn the very same sentence, Marinelli states the cloth ” bears the imprinted image of the corpse that was wrapped in it.”\nIf there’s anything thing we can say about the image on the cloth, it wasn’t the product of being wrapped around a head, let alone a corpse. I think we’re all familiar with the Mercator Projection?\nMy point is that in one sentence and with the very first footnote, Marinelli’s 2012 presentation in Valencia shows reason to doubt her seriousness . It’s why I asked  why jmarino claims this is valuable reading.\n\n","date":"September 29, 2013 at 5:32 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"pakeha","post":"\nJoe Marino :\nWith my problems with copying and pasting, I’m trying replying to the email in my in box rather than starting in the comments section.  Since I don’t know if doing this will post Pakeha’s comment that I’m replying to, I’m going to reproduce it again here.\nPakeha wrote, <>\nIt’s scholarly with numerous footnotes and references, extremely detailed and dispassionate.  Marinelli has been a sindonologist for decades and is renowned for her research.  I’m astonished that you’re astonished that I recommended it.  What is it in Marinelli’s article you question?\n\nWhat I’ve read by Marinelli hasn’t impressed me at all. Still, in the hopes of getting a more detailed reply from you, I’ll detail the flaws in this presentation of hers.\n\n","date":"September 29, 2013 at 5:02 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"pakeha","post":"Embarrassingly enough, from page 16 onward, Marinelli actually refers to Kouznetzov’s infamous ‘findings’. And sources the fellow in footnotes!\nIs Marinelli the last person in the world to learn Kouznetzov was a fraudulent conman and that his findings were a blatant hoax?\nAgain I ask jmarino, why should we take Marinelli’s presentation seriously?\n\n","date":"September 29, 2013 at 5:42 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"pakeha","post":"Sorry, no prize.\nMarinelli failed to mention the fellow is  a recognised con artist.\nThis only encouraged readers to give some sort of credence to a notorious hoax.\nThere was no need to mention the fellow without explaining he’s a scammer, unless Marinelli was taken in by the scam or is supporting it.\nDo you see any other option, jmarino?\n\n","date":"September 29, 2013 at 5:23 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"pakeha","post":"\njmarino240 :\nO.K. says in #54 that Marinelli’s paper is a reprint of her 1990 book.  First of all, her book is over 250 pages and covers other aspects of the Shroud besides C-14.  Her paper is only 35 pages.  Secondly, in her article, she has many footnotes and references to materials published after 1990.\n\nI can see your point, jmarino, of course.\nHowever, leaving in the Kouznetsov hoax was a serious blunder, as it only served to perpetrate the fellow’s scam.\n\n","date":"September 29, 2013 at 5:49 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"pakeha","post":"\nHugh Farey :\nOK’s reference agrees with Pakeha and disagrees with Marinelli. This one (http://www.shroudofjesus.com/page6.html) says pretty well the opposite. There is almost as little consensus among pro-authenticitists as there is among the antis regarding the exact mechanism of production.\n\nhugh, are you saying the Mercater Projection doesn’t apply to the TS?\n\n","date":"September 29, 2013 at 5:26 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"pakeha","post":"\nJoe Marino :\nIn response to pakeha’s #45 posting, Marinelli’s 1st sentence also footnotes 2 other medical doctors.  The Heller-Adler paper was in a scientific peer-review journal.  You say it’s been disputed repeatedly but give no names.  Skeptics may dispute it repeatedly but that carries no weight.  Practically any Shroud paper by proponent or skeptic alike is disputed repeatedly.  I’m not familiar with the Mercator Projection.  For Marinelli to state that the Shroud “bears the imprinted image of the corpse that was wrapped in it,” which has been a traditional observation by many for numerous years, is hardly a reason, in part or in full, to doubt her seriousness.  I believe the scholarly nature of the paper is evident\n\nSeriously, jmarino, you didn’t take the trouble to find out what the Mercater Projection is?\nHere’s a good place to start\nhttp://en.wikipedia.org/wiki/Mercator_projection\nWhether it’s traditional or not, Marinelli’s observation a cloth wrapped around a three dimensional object would produce anything like what we observe in the TS is foolish.\nI invite you, jmarino, to try for yourself just what impression is left on a cloth which is wrapped around a three dimensional object.\n\n","date":"September 29, 2013 at 5:32 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"pakeha","post":"\nJoe Marino :\nIn response to pakeha’s #45 posting, Marinelli’s 1st sentence also footnotes 2 other medical doctors.  The Heller-Adler paper was in a scientific peer-review journal.  You say it’s been disputed repeatedly but give no names.  Skeptics may dispute it repeatedly but that carries no weight.  Practically any Shroud paper by proponent or skeptic alike is disputed repeatedly.  I’m not familiar with the Mercator Projection.  For Marinelli to state that the Shroud “bears the imprinted image of the corpse that was wrapped in it,” which has been a traditional observation by many for numerous years, is hardly a reason, in part or in full, to doubt her seriousness.  I believe the scholarly nature of the paper is evident\n\nI don’t think anything approaching a scholarly nature is shown in that paper.\nAnyone who would perpetrate Kouznetsov’s con game cannot be considered a scholar.\nCorrect me if I’m wrong, but the fellow was exposed for a hoaxer on a number of pro-authenticity sites.\nI’ll get back to you sources which rebutt the Heller-Adler paper, jmarino.\nSorry not to have included them earlier!\nIn any case, could you explain why Flury-Lemburg’s evaluation of the possibility of reweaving is untenable?\nThanks.\n\n","date":"September 29, 2013 at 5:38 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"pakeha","post":"\nChrisB :\n“If there’s anything thing we can say about the image on the cloth, it wasn’t the product of being wrapped around a head, let alone a corpse. I think we’re all familiar with the Mercator Projection?”\nSo what’s your explanation? Orthogonal projection?\n\nA 14th century icon.\nWhat’s your explanation?\n\n","date":"September 29, 2013 at 5:40 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"pakeha","post":"No it isn’t indeed.\nIt’s simply a description of what the cloth is, based on the evidence we have to date.\n\n","date":"September 30, 2013 at 4:46 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"pakeha","post":"\nO.K. :\n\nHugh Farey :\nOK’s reference agrees with Pakeha and disagrees with Marinelli. This one (http://www.shroudofjesus.com/page6.html) says pretty well the opposite. There is almost as little consensus among pro-authenticitists as there is among the antis regarding the exact mechanism of production.\n\nGuys and girls, the problem with Marinelli’s paper is that it is actually a reprint of her 1990 book “The Enigma of the Shroud”, written together with Orazio Petrosillo, so some of the Marinelli’s arguments are outdated. The book was a harsh criticism of 1988 C14 test, basing on what was known at that time.\n\nThanks for that information, OK.\nYou have to wonder why a scholar would, in 2012,  present a paper which is over 20 years old and without bothering to update it.\nThe Kouznetsov scam really sticks out like a sore thumb, doesn’t it.\nI daresay that also explains why the results of the Oxford lab’s testing of Jackson’s idea isn’t mentioned, either.\n\n","date":"September 29, 2013 at 5:45 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"pakeha","post":"\nO.K. :\n\njmarino240 :\npakeha wrote:  “Flury-Lemburg wasn’t of that opinion re the reweaving question. Could you explain why she’s wrong, please?”\nPlease see the end portion of my reply to David in #37.\n\nRemember there is some conflict of interest (and responsibility!) here. Flury-Lemberg has been hired by the Archidiocese of Turin. And they don’t want to admit that the samples they cut from the Shroud and gave to the laboratories were actually flawed.\n\nWhy ever not?\nKeep in mind that Flury-Lemburg, while rebutting the patching idea, believes the 14th century datingto be flawed.\n\n","date":"September 29, 2013 at 6:04 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"pakeha","post":"\njmarino240 :\nI can’t speak for Marinelli–I’ve posted a response from her in one   posting–but I don’t disagree that she should have mentioned Kouznetsov’s   credibility issues as part of the background and data.\n\nI’m glad you see that, jmarino, because I believe what has to be a priority in any discussion of the TS is an earnest desire to establish the truth.\nHere are several links on the subject of Kouznetsov’s credibility issues\nhttp://greatshroudofturinfaq.com/Science/Dating/Kouznetsov2.html\nhttp://www.shroud.com/bsts4312.htm\nhttp://www.csicop.org/si/show/case_of_the_holy_fraudster/\nhttp://www.thefreelibrary.com/The+amazing+Dr+Kouznetsov.-a0169923805\nIt’s an unsavoury subject, yes, but better to know the truth of the matter.\n\n","date":"September 29, 2013 at 6:02 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"pakeha","post":"Thank you very much for posting up those links. They were new to me and I was glad to read them.\n\n","date":"September 30, 2013 at 4:43 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"pakeha","post":"\nO.K. :\nPakeha: No, the imprint on the Shroud is not Mercator projection. Actually, Mario Latendresse has shown that contrary to previous beliefs (which claimed that the Shroud must have been completely flat), it is possible for the body to leave projection without creating major distortions. They would appear ONLY if the image had been a contact image, of which the Shroud is not the case. However there are some minor distortions, which is totally consistent with Shroud enveloping the real human body, contrary to what Joe Nickell and Stevven Schafersmann claim.\nI have dealed with one sceptic who claimed the same. See my article: http://ok.apologetyka.info/racjonalista/caun-turynski-faszerstwo-niedokonane-cz-1,558.htm It is in polish, but Google can translate it.\n\nThanks for the link.\nI’ll read it and get back to you.\n\n","date":"September 29, 2013 at 6:06 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"pakeha","post":"O.K., I’m finding the Google translate very confusing and I’m sure it doesn’t do justice to your work. Is there any chance you could get that properly translated for your blog?\n\n","date":"September 30, 2013 at 4:48 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"pakeha","post":"But we know the samples weren’t bad. Flury-Lemburg is most steadfast in explaining why that is so. Remember, Flury-Lemburg headed the team of the 2002 restoration. Is there anyone alive who is more familiar the that linen fabric?\nIn any case, because of the observable ‘banding’ of the weave of the cloth, we know there’s no  sign of patching or reweaving in the area.\n\n","date":"September 30, 2013 at 4:40 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"pakeha","post":"\njmarino240 :\npakeha wrote:  “Flury-Lemburg wasn’t of that opinion re the reweaving question. Could you explain why she’s wrong, please?”\nPlease see the end portion of my reply to David in #37.\n\nHang on.\nAre you saying Flury Lemburg was incompetant to find cotton fibres in the area?\nAnd seriously, do you understand the amount of extraneous fibre need to have skewed the dating.\nAre you claiming Fleury-Lemburg wouldn’t notice there was over 50% cotton in that area?\nOr is she part of the conspiracy?\n\n","date":"October 1, 2013 at 2:39 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"pakeha","post":"\nJoe Marino :\nIn response to pakeha’s #45 posting, Marinelli’s 1st sentence also footnotes 2 other medical doctors.  The Heller-Adler paper was in a scientific peer-review journal.  You say it’s been disputed repeatedly but give no names.  Skeptics may dispute it repeatedly but that carries no weight.  Practically any Shroud paper by proponent or skeptic alike is disputed repeatedly.  I’m not familiar with the Mercator Projection.  For Marinelli to state that the Shroud “bears the imprinted image of the corpse that was wrapped in it,” which has been a traditional observation by many for numerous years, is hardly a reason, in part or in full, to doubt her seriousness.  I believe the scholarly nature of the paper is evident\n\nHi, jmarino.\nSorry to have taken so long in providing links to arguments against the Heller/Adler conclusions.\nThey’re written by hugh farey and I found them to be most interesting.\nhttp://forums.randi.org/showthread.php?p=9387545&highlight=Adler+blood#post9387545\nhttp://forums.randi.org/showpost.php?p=9394626&postcount=8900\nhttp://forums.randi.org/showthread.php?p=9386857&highlight=Adler+blood#post9386857\nhttp://forums.randi.org/showpost.php?p=9386813&postcount=8803\n\n","date":"September 30, 2013 at 4:29 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"pakeha","post":"\nHugh Farey :\nI have also examined these radiographs and do not agree with the Whangers. The two photos directly referred to in the quotation above (Figures 17 and 18 of Radiological Aspects of the Shroud of Turin) actually show at least three layers of cloth, where the Holland backing appears to have been folded back over the foot of the shroud, including all the area from which the Raes sample was taken. Strange that they don’t mention that. No wonder the “herringbone weave pattern is much less obvious than in the nearby body of the Shroud fabric.”\n\nThat’s very interesting, hugh.\n\n","date":"October 1, 2013 at 2:41 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"}]}
