{"art":[{"author":"paul_sarab","post":"My 19 year old son died a few weeks back. He was the sweetest child ever. Everybody loved him as he was concerned for all. I loved him with all my heart. When he was sick in hospital for over 6 weeks, I fasted, prayed and read the Bible with all my heart. Our church prayed for him. I even requested Philip Yancey to pray for him and he did. But God wanted Junior back. He died 31st July 2012 at 18:30.My world went upside down. I had had a very happy and fulfilling life. Life was good. I was well off financially. I had a happy marriage and basically everything good. Life w so good that I was wary about it. I consider myself a good Christian and pray together with the family every morning and before going to sleep. I read the Bible daily. But after Junior passed away, my world changed. I never know so much pain before. Till today, everything reminds me of my loving son. My good life was completely shattered. We went everywhere together. We did everything together – watching movies, eating out, going on vacations. He was my best friend.After he passed away, a friend at the church gave me Heaven Is For Real. I was somewhat comforted after reading it. I have had a lot of direct experience with God since I was 9 years old. I have no doubt in my faith. After Junior passed away, I was upset with God for a while (like Todd, Colton’s father). But now I thank God for letting me borrow his angel for 19 years. Junior was truly an angel. He prayed regularly. He loved God and Jesus. He had the innocence of an angel. He cared for everybody – people on the street, people he read about etc. I cry everyday. I do not know when the pain will stop. I miss my son terribly. Even now tears are falling down my cheeks. I am now not afraid of dying. In fact, I desire to depart and be with Christ which is better by far. I just wish I could hold his hands and hug him one more time. I love you, Junior.","date":"November 5, 2012 at 9:31 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
