{"art":[{"author":"paul_gell","post":"Gentleman, thank you for your comments. I am Paul Gell, the creator of those videos. I would like to have discussions with any of you that are willing. It is exciting for me to even find others that are interested in the shroud. I am not a scientist, and so just learning the terminology is new to me. I do have confidence in what I found, and I welcome all comments. I know that there where be many negative ones, skeptics, etc. I am not a scientist. I have fulltime commitments as a family man and graphic artist. So if I don’t get back to comments quickly, it is not because I am shying from them. I would like to speak with anyone willing to converse. Thanks again everyone… Paul Gell\n\n","date":"February 22, 2015 at 10:14 am","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","title":"A Bas Relief Match to the Shroud of Turin Image?"},{"author":"paul_gell","post":"Hugh.. your point 1) 1355 may seem extremely late to you for a manufacture of the shroud, but it falls within the radiometric dating results of 1988. I find this significant (you may have dismissed those results. I have not). You say that because geoffroi de charney may have been “of Templar stock” and that the hospitallers were a separate order, that it seems unlikely that the shroud would be produced by one group, and then be rushed to another group. Unlikely, maybe, but not beyond the laws of physics by any means. Remember that all the knightly orders answered to the papacy. Pope Innocent VI was having disputes with pierre de corneillan at the time. He wanted to return the headquarters of their order back within hostile ottoman territory. Peter I of Cyprus (titular king of Jerusalem, also), was canvasing Europe, trying to drum up a new crusade. The byzantine emperor also was pleading for help. What better motivator to get potential knights to go on crusade, then THE burial shroud of Jesus? Picture the sales pitch..”look valiant knights, HERE we have THE HOLY SHROUD ITSELF! THIS IS THE MAN (GOD) YOU ARE FIGHTING FOR! NOW GO TAKE BACK OUR HOLY LAND!”.  This is how I imagine it. So the fact that the shroud was created over pierres sarcophagus, but ended up in france in the hands of a different French knight, doesn’t phase me.\n\n","date":"February 22, 2015 at 10:10 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","title":"A Bas Relief Match to the Shroud of Turin Image?"},{"author":"paul_gell","post":"for hugh again… your point 2..you are RIGHT,  I do NOT know if the shroud image and sarcophagus image are sized properly. But all I did was size it ONCE, to line up the beard. And many things (from my perspective) fell into place. I found that significant, and I feel it warrants further study. Your point 3, the burn marks and water marks. Again I do not have enough knowledge of these, and I just looked at them INDEED as being from a single event, or perhaps a second cover up event (the fire) to follow the first. After all, if we are asserting a forgery, there is no reason for the creators of the shroud to be “truthful” in other areas. Documents could have been forged, by the Vatican itself. See the Donation of Constantine if you don’t think that the Vatican has forged documents in the past. Again, I am not dismissing the burn marks, watermarks, etc. I would like to know HOW EXACTLY you and others have come to the conclusion that they themselves are legitimate. What other papers can I study? I am genuinely asking these questions. Finally, your question number 4. What about the back of the shroud? If you watched part 3 of my video, I DO cover the back of the shroud, albeit in only a few points. I also speed up and add a few points into one statement, because I was trying to fit my video into a total of 45 minutes, and I needed to save time. My understanding was that youtube only allows videos up to 15 minutes. I didn’t want to have more than three parts to my video. Most compelling on the back of the shroud, I think, is my POINT 44, which is the beard impression. To my eye, there is a very strong and obvious correlation between the beard of the sarcophagus, and the way that the stain near the head on the shroud back looks.  Okay, I need to get to get to bed for tonight. Thanks again to all of you for your comments.\n\n","date":"February 22, 2015 at 10:22 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","title":"A Bas Relief Match to the Shroud of Turin Image?"},{"author":"paul_gell","post":"oh, one more point..this one to answer renny’s comment. I do claim that space was left where the broken hand was. Instead, the shroud was rotated 90 degrees counter-clockwise to use the same sarcophagus hand again for an impression. I said this not because I thought they were trying to “hide every detail” of the sarcophagus from future detection, but simply because it would look ridiculous to show jesus with missing fingers. In addition, the sarcophagus hands taken together seem anatomically over-sized. They fudged the fingers as best as they could. That’s my guess.\n\n","date":"February 22, 2015 at 10:31 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","title":"A Bas Relief Match to the Shroud of Turin Image?"},{"author":"paul_gell","post":"Hugh, thank you for those references. I will check them out.\n\n","date":"February 24, 2015 at 11:59 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","title":"A Bas Relief Match to the Shroud of Turin Image?"},{"author":"paul_gell","post":"Hugh, I have read Guerreschi and Salcitos paper in regards to the burn marks and water stains. I will be reconstructing the folds myself, to see how it accords with my findings. The Paper has a two points which I find completely unscientific: \nThe first and most glaring of those, is the introduction of a proposed “ANCIENT earthenware vessel” to explain the water stains on the shroud. This is complete conjecture, and a deliberate attempt to give the shroud an ancient character. They then point out that the waterstained corner is where the c-14 dating sample was taken from. (YET this sample came back with a date range of 1260-1390 from all three testing labs. Not ancient at all).\n  The paper concludes that there were three separate incidents of damage to the shroud:\n1. the chambery fire\n2. the water stains (which they conclude happened before the fire)\n3. the poker holes (which they conclude happened before the fire)\nThe second point of contention I have is with the arbitrary date thrown out for the poker holes of 1190. The shroud is unknown before its appearance in Lirey in the late 1350s. While there may be mentions earlier in history of shroud-like objects, there is no proof that such objects are the shroud of Turin. The affixing of a date of 1190, therefore, cannot stand as an accepted date for the event.\nIt is therefore wholly possible that incident 2 (the water stains) and 3. the poker holes, occurred during the same time period.\n\n","date":"February 25, 2015 at 12:41 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","title":"A Bas Relief Match to the Shroud of Turin Image?"},{"author":"paul_gell","post":"Okay, where to start? I guess I did just say I was willing to jump into the fire. My presentation was not meant to be considered as official scientific proof. I merely saw correspondences and then took them as far as I could.  I was excited to find many elements that to my eye and mind, make sense, and correlate. It is true that I currently don’t have knowledge of what marks are considered to be from the fire, or separate water staining, etc. I offer up that with my open mind, I may be seeing past further levels of forgery. In other words, those that created the shroud may have also falsely created the other marks, or created false documents claiming when other marks happened. This is probably is not a scholarly assumption. And I am not dismissing the remarks above at all. I intend to look into it all further. I look at it this way: How many of us were around in the 1350s to confirm exactly when the shroud appeared? Or were we there in the 1500s when the fire was there, etc. These dates themselves, may all be further attempts to cover up the truth. Who is it that contends certain marks were made during the fire? The house of Savoy? The Vatican? I would like to know more about how scholars have concluded all of these assumptions. I have a bachelors degree in art, which does not compare to some of the Phd’s that are probably floating around here. But I am here because all of us DO have one thing in common, and that is an INTEREST in the shroud. I would much rather talk about this, or the Italian renaissance, then watch a football game, or the Oscars which are on right now. Hugh and Patrick, thank you for softening the blow for me on this page. Hugh, I will answer all four of your questions in another comment.\n\n","date":"February 22, 2015 at 9:56 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","title":"A Bas Relief Match to the Shroud of Turin Image?"}]}
