{"dating":[{"author":"peter_ford","post":"As far as i am concerned I have discovered an Australian film scientist who has solved the mystery of the Shroud of Turin by discovering the second Shroud check this out name is Vincenzo Giovanni Ruello. Using a simple film system he discovered the alive face of Christ in the St Peters Veronica Veil","date":"April 8, 2012 at 10:26 am","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins"}],"history":[{"author":"peter_ford","post":"Check this out Dan","date":"April 8, 2012 at 10:19 am","url":"https://shroudstory.com/2012/04/08/the-lord-is-risen-he-is-risen-indeed/","cat":"history","title":"The Lord Is Risen! He is Risen Indeed!"},{"author":"peter_ford","post":"I have been following an incredibly talented experimental film scientist an amateur who has discovered in 2011 the second Shroud or the first, a decoded photograph of an alive Jesus Christ in the St Peters Veronica Veil resembling the face of the Shroud of Turin. He also has been rediculed by this group of so called Shroudies. His discovery is of immense importance as he has given evidence to both cloths coming from the same man and the St Peters Veronica has far greater time history recorded. He has solved the mystery without carbon dating by his discovery and several of these Shroud groups who have vested interests in conitueing the circus are terrified of his discovery. He even revealed three toes ripped off the mysterious left foot which scientists have said was crossing over but was not visible , his name is Vincenzo Giovanni Ruello","date":"August 12, 2012 at 1:44 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/23/a-reply-to-dan-porter-and-his-shroud-of-turin-associates-re-the-significance-of-the-lirey-pilgrims-badge/","cat":"badge_lirey","title":"A reply to Dan Porter and his Shroud of Turin associates re the significance of the Lirey Pilgrim’s Badge"}],"misc":[{"author":"peter_ford","post":"Ruello deserves more respect for his work and now for the discovery of the face in the Veronica Veil. Seems like he has made the greatest discovery since the Turin Shroud","date":"April 12, 2012 at 1:13 pm","url":"https://shroudstory.com/2011/03/25/you-couldnt-make-this-up-vinny-pop-is-back/","cat":"news_&_views","title":"You Couldn’t Make This Up: Vinny Pop is Back"}],"art":[{"author":"peter_ford","post":"Dr Dan there needs to be a critical examination of Ruellos work. To dismiss him I think is wrong for the simple reason that he has discovered a face image in the Veronica Veil that has similarities to the Turin Shroud","date":"April 6, 2012 at 11:15 pm","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","title":"Using the Shroud of Turin as a Rorschach Ink Blot"}],"resources":[{"author":"peter_ford","post":"Incredible a genius. So an amateur film scientist has solved the mystery ?","date":"April 3, 2012 at 10:44 pm","url":"https://shroudstory.com/2012/01/11/you-couldnt-make-this-up-no-you-couldnt-no-really-you-could-not/","cat":"video","title":"You couldn’t make this up. No you couldn’t. No. Really. You could not."},{"author":"peter_ford","post":"","date":"April 17, 2012 at 8:09 am","url":"https://shroudstory.com/2012/01/11/you-couldnt-make-this-up-no-you-couldnt-no-really-you-could-not/","cat":"video","title":"You couldn’t make this up. No you couldn’t. No. Really. You could not."}]}
