{"opinion":[{"author":"piero_&_afm","post":"First of all : the exact italian name is Linoli (Odoardo) and not Lonoli …\nMy interest is in the textile field and my old idea (1998) to control the linen fibrils\nusing the advanced the SPMs (= Scanning Probe Microscopies… and working,\nfor example :  with the three-point bending tests and also with the controls about\nthe cellulosic DP) can also be useful in the biological domain … because we\ncan study the relics in a better manner with all the adequate tools for\nSPM investigations (= Applied Structural Mechanics and Applied Nanotechnology).\nUnder the address :\nhttp://www.therealpresence.org/eucharst/mir/lanciano.html\nwe can read the following words :\n>In 1970-’71 and taken up again partly in 1981 there took place a scientific investigation by the most illustrious scientist Prof. Odoardo Linoli, eminent Professor in Anatomy and Pathological Histology and in Chemistry and Clinical Microscopy. He was assisted by Prof. Ruggero Bertelli of the University of Siena.\n>The analyses were conducted with absolute and unquestionable scientific precision and they were documented with a series of microscopic photographs.\ninstead under :\nhttp://www.zenit.org/en/articles/physician-tells-of-eucharistic-miracle-of-lanciano\nwe can read :\n>Linoli extracted parts of the relics with great care and then analyzed the remains of “miraculous flesh and blood.” He presented his findings on March 4, 1971.\n>His study confirmed that the flesh and blood were of human origin. The flesh was unequivocally cardiac tissue, and the blood was of type AB.\n>Consulted by ZENIT, Linoli explained that “as regards the flesh, I had in my hand the endocardium. Therefore, there is no doubt at all that it is cardiac tissue.”\n>In regard to the blood, the scientist emphasized that “the blood group is the same as that of the man of the holy Shroud of Turin\nIn any case the possible key to solve the enigma of Lanciano (apart the Faith)\nis the DNA analysis. But I remember that an ancient DNA can be very difficult to control …\nSo … How to see the scientific truth ?\nIn the past (in Civitavecchia, Italy) the statue of Mary was weeping tears of blood.\nPerhaps this happened because Jesus is her only Son and She wants us to follow him.\nBut (clearly) this is not a scientific explanation and we don’t know what is the scientific answer from the new intruments.\n— — —\nSorry.  I am not an expert in the field of coagulation/fibrinolysis of normal blood and pathological blood. I am only curious to know where are located the Labs interested in these particular experiments.\n— —\nI have found a vague bibliographic reference :\nS. Thalhammer, W.M. Heckl (2004) : Atomic Force Microscopy as a tool in nanobiology\nBut I don’t agree with idea to do the nano-destructions.\nSee for example the previous work :\nR. Stark, S. Thalhammer, J. Wienberg, W.M. Heckl (1998): The AFM as a tool for\nchromosomal dissection – the influence of physical parameters. Appl.Phys., A66, 579-584\n\n","date":"March 13, 2013 at 10:21 am","url":"https://shroudstory.com/2013/03/10/old-video-ancient-secrets-of-the-bible-the-shroud-of-turin/","cat":"other_blogs","title":"Old Video: Ancient Secrets of the Bible – The Shroud of Turin"},{"author":"piero_&_afm","post":"If you have read something … Goldoni, Lavoie\nand others worked with the blood … !\n— —\nI tried to watch under the address :\nhttp://www.practical-haemostasis.com/Miscellaneous/Miscellaneous%20Tests/teg.html\nand\nI have read the following words :\n>Thromboelastography [TE] was first described by Hartert in 1948.\n>Thromboelastography® (TEG®) and Thromboelastometry (ROTEM®) provide global information on the dynamics of clot development, stabilisation and dissolution that reflect in vivo haemostasis.\n>Although TE has not been subjected to the same evaluation processes as conventional haemostatic tests, its use as a POCT monitor in complex major surgery has been shown to significantly reduce the use of blood component therapy and overall blood loss.\nSo …\nYou have to take into account that now (on Turin Shroud) we can only\ncontrol the bloodstains (on linen) of a (presumed) deceased person.\nWhat is the meaning of that thromboelastography in a dead person ?\nIn any case …\nI want to respect the sacred blood of Jesus !\nSee also (for the blood and the cardiac muscle) : the famous Miracle of\nLanciano (and the old analyses by Dr. Linoli) !\nThe blood turned out as a true blood (of Jesus. But, until now, we have\nnot yet seen an interesting plan about the DNA analyses for the true\ncardiac muscle) !\nInstead, in my opinion, we have to control the linen fibrils using the advanced\ntools, using the SPMs (= Scanning Probe Microscopies)…\n— —\nWhy we are not yet able to  do that “very simple” operation ?\nFor example : Atomic Force Microscopy (= AFM) is a tool not only to image\nthe topography, but also provides valuable information regarding adhesion\nand surface density using force curves !\n— —\nIt is very simple to test the linen fibrils under an adequate probe in an AFM\nthree-point bending test !\nIf you have some exact knowledge in the field of Structural Mechanics you\ncan work with good gains … and you can also explore (in a non-destructive\nmanner) the biological traces.\nAm I wrong in my old ideas (= 1998) about these Secrets ?\n— —\nWhat will be the result from the controls for the Ancient Secrets of the\nBible (and then see also : the SPM controls about the papyrus of\nQumran, a more exact way to test these ancient reperts) under\nthe SPMs survey ?\n\n","date":"March 11, 2013 at 1:18 pm","url":"https://shroudstory.com/2013/03/10/old-video-ancient-secrets-of-the-bible-the-shroud-of-turin/","cat":"other_blogs","title":"Old Video: Ancient Secrets of the Bible – The Shroud of Turin"}]}
