{"image":[{"author":"piero_as_piezonuclear_zealot","post":"I have read the interesting intervention and the wrong phrases\nwritten by Yannick :\n-I tried to expressed\nIn my opinion this is an incorrect English language instead of :\n“I tried to express”\n– to proved the image was not the result …\nIn my opinion this is an incorrect English language instead of :\n“to prove the image was not the result …”\n— —\nBut the ideas on energy of our dear friend Napo-Yannick\nare clearly expressed … (Sorry… I nicknamed Yannick-Napoleon\nbecause, often, several errors appear in my messages on this blog and then\nI tried to undramatize …). \nThen (in my opinion) a careful control about the heat transfer on linen fibrils\nis of paramount importance.\nAnd a COMSOL model will be useful.\nDo you agree on that very simple remark/suggestion ?\n— —\nIn any case I don’t believe that Rogers was able\nto prove the lack of supernatural process.\nHe had very few linen material at disposal…\nThe questions about the lack of image\nbehind the knees and feet area\nworth to be deepened.\nB.T.W. :\nWhat are the exact ideas about the linen draping\nover the corpse laid in rigor mortis ?\nWhere is the (presumed) heat flux discontinuity ?\nIf we have the human body model (like the remarkable sculpture by Mattei)\nat disposal these missing parts will be more simple\nto discuss and (perhasps) to understand …\nPost-mortem temperatures and Computer Model.\nThe bio-heat transfer problems can be solved\nusing the bio-heat transfer model.\nDo you know the bioheat equation, the Fourier’s law and the\ndifferent kind of thermal conductivity of tissues ?\nThermal infrared images obtained using a plastic\ndolly /mannikin (= corpse model) filled with relatively hot\nwater (20-14 Celsius ???) can be used to verify the\ninherent claims …\nThen see also the question about the improved\nbody segmentation (with detailed segments and temperature profiles).\nVerify what wrote Arpad Vass in the past about the decomposition\nchemistry and the bacterial metabolism (metabolic heat source in a dead body…\nhmmm … perhaps this is very low) and the possible news\n(measurements about the exact amount of heat transfer rate at skin surface\nexpressed as W/[squared m], evaporative heat transfer rate\nexpressed as W/[squared m], evaporative heat loss, etc. …) …\n— —\nAnd at the end …\nhere a vague reference :\nCOMSOL – Introduction to Heat Transfer Module (VERSION 4.3)\nCopyright 1998–2012 COMSOL\nThe Medical Technology section in the Model Library introduces the concept of bioheating…\nSee at page 9 (of 38) of that document.\nhttp://www.comsol.com/model/download/142935/IntroductionToHeatTransferModule.pdf\n>The Bioheat Transfer interface is a dedicated interface for heat transfer in living (!!!!) tissue. The bioheat model described in this interface has been verified for different types of living (!!!!) tissue..\n(at page 12 (of 38) of that document).\n\n","date":"May 8, 2014 at 7:59 am","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","title":"To Yannick on Science and Philosophy"}],"misc":[{"author":"piero_as_piezonuclear_zealot","post":"Discussing on Earth’s Crust…\nGeologic events and Steno :\n“… he became fascinated with the layered limestone strata of Italy. He made major discoveries in crystallography, particularly quartz.  Steno was the first to realize that the Earth’s crust contains a chronological history of geologic events … etc. …”\nSo … in our times…\nWhat is the new idea ?\nHave you read the article by Carpinteri, Lacidogna, Manuello and Borla on Earth’s Crust ?\nEvidence of piezonuclear reactions: From geological and tectonic transformations to neutron detection and measurements\nExperimental Mechanics on Emerging Energy Systems and Materials, Volume 5\nConference Proceedings of the Society for Experimental Mechanics Series\n2011, pp 41-48 \nLink :  http://link.springer.com/chapter/10.1007%2F978-1-4419-9798-2_6\nAbstract\n>Neutron emission measurements, by means of helium-3 and neutron bubble detectors, were performed on solid specimens during three different kinds of mechanical tests: compression tests under displacement control, under cyclic loading, and by ultrasonic vibration. The material used for the tests was Green Luserna granite. Since the analyzed material contains iron, our conjecture was that piezonuclear fission reactions involving fission of iron into aluminum, and of iron into magnesium and silicon, should have occurred during compression damage and failure. It is also interesting to emphasize that the present natural abundances of aluminum (~8%), and silicon (28%) and scarcity of iron (~4%) in the continental Earth’s crust should be possibly due to the piezonuclear fission reactions considered above.\nAnd then, see also :\nGeomechanical and Geochemical Evidence of Piezonuclear Fission Reactions in the Earth’s Crust\nA. Carpinteri, A. Manuello\nPolitecnico di Torino, Department of Structural Engineering & Geotechnics, Corso Duca degli Abruzzi 24, 10129 Torino, Italy\nStrain 11/2011; 47(s2):267 – 281. \nAbstract\n>Piezonuclear reactions, which occur in inert and non-radioactive\nelements, are induced by high pressure and, in particular, by\nbrittle fracture phenomena in solids under compression. These\nlow-energy reactions generally take place in nuclei with an\natomic weight that is lower or equal to that of iron (Fe). The\nexperimental evidence, obtained from repeatable measurements\nof neutron emissions [Strain 45, 2009, 332; Strain (in press);\nPhys. Lett. A. 373, 2009, 4158], can be also recognised\nconsidering the anomalous chemical balances of the major\nevents that have affected the Earth’s crust, oceans and\natmosphere, over the last 4 billion years. These anomalies\ninclude (i) abrupt variations in the most abundant elements\nin correspondence with the formation of tectonic plates;\n(ii) the ‘Great Oxidation Event’ (2.7–2.4 billion years ago),\nwith a sharp increase in atmospheric oxygen and the\nsubsequent origin of life; (iii) the current climate acceleration\npartially because of ‘carbon pollution’. Natural piezonuclear\nreactions are induced by fault sliding and plate subduction phenomena.\nHere another title :\nReply to “Comments on ‘Geomechanical and Geochemical Evidence of Piezonuclear Fission Reactions in the Earth’s Crust’  by  A. Carpinteri and A. Manuello”  by  U. Bardi and G. Comoretto\nIt was the answer by Alberto Carpinteri and Amedeo Manuello …\nAbstract\n>In the paper entitled “Comments on ‘Geomechanical and Geochemical Evidence of Piezonuclear Fission Reactions in the Earth’s Crust’ by A. Carpinteri and Manuello” by U. Bardi and G. Comoretto, the authors criticise the hypothesis based on piezonuclear reactions for the interpretation of the compositional evolution of the Earth’s crust. We report a detailed reply of how the traditional theories, used by the authors of the comments, are obviously inadequate to describe this new kind of nuclear phenomena. Only very recently, independent authors proposed a theoretical model explaining the anomalous energy emissions in the form of neutrons, involved in piezonuclear reactions, during fracture of nonradioactive rocks. It is also known how the evidences that Bardi and Comoretto claim to be non-existent could be found in many independent works that appeared in most important journals about unexplained questions of the Earth’s crust and environment. The data reported in the original work and the details included in this reply show that it is incorrect to consider impossible or simply to ignore the existence of unexplained phenomena only because they cannot be described by traditional models and conventional theories.\nLink :\nhttp://www.researchgate.net/publication/259556161_Reply_to_Comments_on_Geomechanical_and_Geochemical_Evidence_of_Piezonuclear_Fission_Reactions_in_the_Earth%27s_Crust_by_A._Carpinteri_and_A._Manuello_by_U._Bardi_and_G._Comoretto\nUnfortunately, until now, I have not yet see the use\nof SSNTD (= solid state nuclear track detector) during\nthe experiments … or the AFM images of stones before\nand after piezonuclear reactions …\nCarpinteri used only FESEM = Field Emission Scanning Electron Microscope.\nLink :\nhttp://staff.polito.it/alberto.carpinteri/papers/CARPINTERI_2012_N.683_EM.pdf\nSee at p. 11 of 21 (= FESEM for quantitative elemental analyses) and see also at p. 13 (of 21).\nThen, here the possible title about the inherent study :\nAtomic force microscopy study of several stone surfaces, before and after piezonuclear reactions.\nBut we have to investigate two ideas\n1) that neutron emissions from an ancient earthquake that rocked Jerusalem could have created the iconic image,\n2) … and messed up the radiocarbon levels …\n\n","date":"April 24, 2014 at 8:47 am","url":"https://shroudstory.com/2014/04/24/ridiculous-quote-for-today/","cat":"quotations","title":"Ridiculous Quote for Today"}]}
