{"blood":[{"author":"piero_iacazio","post":"… and what happens if you treat some area of the Face with the talc powder as it seems to be happened following (in an acritical manner) the discovery by Lucotte ?\nRegards,\nPiero\n\n","date":"August 9, 2012 at 9:35 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","title":"Giulio Fanti Responds. Are you listening Yannick and Colin?"},{"author":"piero_iacazio","post":"In any case the discovery of the talc is an interesting fact (if the material controlled is the true material from the Shroud) and now we can try to do some simple experiments (included the works about the hypotheis of the talc as material used during the ceremonies for the “sanctified copies” ! See also : the strange case for the discovery about the HgS and McCrone … ).\nSo, we have to find the truth about the use of the talc powder …\nRegards,\nPiero\n\n","date":"August 10, 2012 at 10:37 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","title":"Giulio Fanti Responds. Are you listening Yannick and Colin?"},{"author":"piero_iacazio","post":"Dear Prof. Fanti,\nFirst of all I agree with you about the extremely vague certification about the samples used by Lucotte. But you are the responsible for some dust particles taken by Riggi that you used and perhaps you can say some other words also about the advanced analyses, the possible SPMs analyses … remembering that we have to work in a non-destructive manner.\n— — — —\nLast week I have read all the papers of the Special Issue (!).\nThe work by Lucotte seemed interesting because he has found the talc powder sticked together the blood particles.\nThen we have to explain this fact.\nThe possible reasons for that particular fact are the following :\n1) contamination. Included the process similar the inclusion of the HgS particles in the linen cloth that McCrone has found. Then the explanation can be the same. During the copy (contact) the transfer of the particles happened and then the talc powder was sticked with bloodstains (this phenomenon requires a certain pressure).\n2) treatment of the corpse : this happened during the phase of the Deposition. After the use of the Oviedo’s cloth (Sudarium of Oviedo) the disciples used the talc powder (perhaps before to cover the corpse, into the tomb. This fact can also be considered as a proof for the preparation of the corpse (also in order to stolen the body !?!). But we have no proof about this particular idea. The work by Lucotte cannot be used for that purpose. It is too rough (from the point of view of the SPM controls). The level of the analyses for the talc powder sticked with blood particles is not useful because it is too rough. He has not used the SPMs analyses and then, reading that work, we have no exact idea. What is the reason for the blood particles sticked with blood particles ? We can only speak about the vague hypotheses.\n3) the entire linen was covered with talc powder (this seems to be a very strange idea). See the previous scenario. We have no useful proof to speak in one manner or another.\n— — —\nIn conclusion : we have to see what will be the verdict obtained from the use of the Scanning Probe Microscopies (= SPMs).\nDo you agree on that simple perspective ?\nI underlined this fact in 1998…\nRegards,\nPiero\n\n","date":"August 13, 2012 at 10:41 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","title":"Giulio Fanti Responds. Are you listening Yannick and Colin?"},{"author":"piero_iacazio","post":"I beg pardon : hypothesis and not hypotheis !\n— —\nAt present the question of the bloodstains treated with talc powder seems to be only an hypothesis (without the inherent proofs).\nWhat is your idea ?\nPiero\n\n","date":"August 10, 2012 at 10:42 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","title":"Giulio Fanti Responds. Are you listening Yannick and Colin?"},{"author":"piero_iacazio","post":"Dear Prof. Fanti,\nThank you for your praise …\nNow, what I want to underline is the question opened by Lucotte with these rough analyses (on material not properly certified).\nIs it possible to test in the right (non-destructive) manner the blood  crusts (with direct inspection) ?\nThis seems to be very difficult, but I believe that using the SPMs techniques we can discover the situation (but, after the centuries, the material can be brittle).\nThe evaluation for the adhesion of the blood on linen is another interesting point to investigate. Unfortunately (if I am right) there is no adequate study (for an ancient archaeological linen) on that forensic argument.\nSo, we have to work for the right research about the Shroud.\nI believe that some experiment about the blood stain dried into the weave of the linen samples and the subsequent ageing treatment is the starting point in order to see what happens in the case of the talc treated (or not) stains.\nWhat is your answer ?\nWhat is the true response from the linen treated with blood in the case of vibrations ?\nSee also : the “earthquake scenario” (in the Special Issue : Lattarulo, Carpinteri, and other researchers indicated the presumed earthquake and the inherent consequences) and the different level of vibrations.\nI believe you are an expert in this field of vibrations because I have read your study on damping measurement of bending vibrations in alpine skis (an improvement of Standard ISO 6267, year = 2006).\nSo …\nThank you in advance !\nRegards,\nPI\n\n","date":"August 14, 2012 at 10:39 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","title":"Giulio Fanti Responds. Are you listening Yannick and Colin?"},{"author":"piero_iacazio","post":"I see that my remark about the difficult measurements on linen (connected to the vibrations in the presumed earthquake scenario) has no answers.\nIn my opinion it is possible to measure the cellulosic degree of polymerization in order to understand what is the true epoch of the old material (= the Shroud). This is the right way to work (in my opinion), the earthquake is a particular idea and we have not yet focused the limit to take in account when we speak on that subject.\n— —\nIn order to show what is the true age we have to control the linen fibrils.\nPerhaps we can think to do something about the Viscoelastic Measurements of cellulosic chains (see also : the single cellulosic chains and the hydrogen bonds) by Driven Oscillation of an Atomic Force Microscope Cantilever… or similar works.\nIs it too difficult that control ?\nregards,\nPiero\n\n","date":"August 20, 2012 at 10:45 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","title":"Giulio Fanti Responds. Are you listening Yannick and Colin?"},{"author":"piero_iacazio","post":"In my idea there is an interesting argument to develop : the high atomic resolution and the control about the cellulosic chains and the different kind of molecules into the linen fibrils (that are mainly composed by Cellulose).\nI believe there is an interesting indication in the study :\nProspects for Resolving Chemical Structure by Atomic Force Microscopy: A First-Principles Study\nby\nChun-Sheng Guo, Michel A. Van Hove, Rui-Qin Zhang, and Christian Minot\nPlease, read the abstract, under the address :\nhttp://pubs.acs.org/doi/abs/10.1021/la101317s\nUsing a metal tip (of the AFM) terminated in a CO molecule, the authors could image the internal bonding arrangement of a pentacene molecule with remarkable spatial resolution.\nThe findings indicated that further application of that approach requires, for each sample, the careful selection of a suitable “imaging” molecule as tip termination.\nThe name for the adequate system to investigate the material is the CFM (= Chemical Force Microscopy).\nSee, for example, the study :\nChemical force microscopy of cellulosic fibers [Carbohydrate Polymers 62 (2005) 369–378],\nunder the address :\nhttp://biomaterials.forestry.ubc.ca/publications/Carbohydrate%20Polymers%202005.pdf\nReading the inherent abstract you can see that :\n>Atomic force microscopy with chemically modified cantilever tips (chemical force microscopy) was used to study the pull-off forces (adhesion forces) on cellulose model surfaces and bleached softwood kraft pulp fibers in aqueous media. It was found that for the –COOH terminated tips, he adhesion forces are dependent on pH, whereas for the -CH3 (= methyl group) and –OH terminated tips adhesion is not strongly affected by pH. …\nSo (in my opinion), you have to try to work using the AFM-CFM apparels in order to improve the knowledges and also to  discover the material truth, instead to write the heterogeneous things. … sorry.\nFollowing these SPMs (= Scanning Probe Microscopies) systems of control You can also discover something about the presumed BIF (Body Image Formation) and the presence or absence of radiations in the true BIF mechanisms.\nAm I wrong ?\nWhy ?\n— — —\nRegards\n\n","date":"August 28, 2012 at 11:33 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","title":"Giulio Fanti Responds. Are you listening Yannick and Colin?"},{"author":"piero_iacazio","post":"I hope you have read the studies by Baker that\nI have indicated in my previous message.\nWell …\nIn my idea the problem to solve is the following :\nHow to  find the length of a single chain ?\nYou can think that a cellulosic chain can be a vibrating string…\nFor example, see under :\nhttp://en.wikipedia.org/wiki/Vibrating_stringv\nYou can also remember Lord Kelvin and the dissipation of the mechanical energy, the mechanical damping, etc.\nThese things are more interesting at level of fibres, for the characterisation of mechanical behaviour of deformations (or stresses) below the level of destruction.  See also : the damping coefficient (and the viscous damping ratio, etc.) and the inherent equations.\nThe range of tensile deformations where the Hook’s law can be applied to the textile fibres can be as small as 0.03%.\nBut (in order to detect the epoch for that ancient material) we have to work at molecular level, perhaps with a great amount of observations…  …\nSo …\nWhich types of playing techniques for the molecular chain ?\nAnd, at the end …\nHaving observed the great number of cellulosic chains you must use the Statistics.\nRegards,\nPiero\n\n","date":"August 24, 2012 at 10:43 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","title":"Giulio Fanti Responds. Are you listening Yannick and Colin?"}],"dating":[{"author":"piero_iacazio","post":"I agree about the Antiquity for the linen cloth, but we have to prove that idea (for the original ancient time) around the Shroud using the adequate SPM techniques.\nWhere is the new demonstration for that important relic ?\nWhat is your opinion about the different kind of SPM ways ?\nIs it feasible the AFM control on cellulosic chains or not ?\n— —\nIn my idea the SPM techniques are the useful way to obtain something (instead to speak in vain !).\nBut (if we want to do an exact and  great job) we have to take into account the mechanical stresses and the fungal attacks on that ancient linen (see also the wrong areas [involved in the Fire of the year 1531] to avoid. These surfaces have to be disregarded from the point of view of the SPM controls. Am I wrong in this remark about the accuracy of the future work ?).\n\n","date":"November 19, 2012 at 12:26 pm","url":"https://shroudstory.com/2012/11/14/berry-no-matter-where-he-or-she-considers-themselves-to-be-on-the-scale-of-infallibility/","cat":"carbon_14_dating","title":"Berry: No matter where he or she considers themselves to be on the scale of infallibility"},{"author":"piero_iacazio","post":"In my idea the words that you wrote were a bit exaggerated :\n>The Shroud has already been completely contaminated.  This is more of a pipe dream than anything.\nThe Shroud was contaminated (from the Fire of 1531, etc.), but in my opinion, your intervention (without the exact explanations) seems to be an excessive claim …  Sorry.\nBut, in any case, I think we can try to see what will be the result from the SPM controls on some linen samples taken from the Shroud in the past. This is a work without the useless destructions of the 14C tests.\nI believe that using the AFM techniques we can see what is the exact level of contamination in different areas or on linen fibrils (under the adequate non destructive controls), but this is not the main problem to solve.\nWhy the SPM controls were not possible in the year 2002 ?\nWhy the results from the Raman controls of the year 2002 are still unknown ?\n… and now :\nWhat is your reply ?\n— —\nWe cannot destroy the Shroud with the wrong analytical methods !\nIn my opinion the SPM controls are the possible solution against the destructive systems.\nDo you know the different SPM ways to control the lignocellulosic materials ?\nI believe we have to discuss this argument instead to indicate the wrong analyses.\nAm I wrong ?\n\n","date":"November 16, 2012 at 11:38 am","url":"https://shroudstory.com/2012/11/14/berry-no-matter-where-he-or-she-considers-themselves-to-be-on-the-scale-of-infallibility/","cat":"carbon_14_dating","title":"Berry: No matter where he or she considers themselves to be on the scale of infallibility"},{"author":"piero_iacazio","post":"Dear Andy Weiss,\nFirst of all (if I am right): the fire of the year 1998 has not burnt the Holy Shroud !\n— —\nI am a technician dyer and not “a world class chemist” (in order to speak with great authority on this argument). But, if you have read my previous words about the IGC (Inverse Gas Chromatography) in other area of this Blog (try to search), you can understand that we can try to do something also about the (presumed) thymol contamination.\nDo you understand the meaning of that claim ?\nHere my explanation : we can try to show what happens using the different percentages of thymol on linen samples prepared for the IGC controls = experiments about the exact level of contamination (now I have not the exact Hansen parameters [= HSP] about the different areas of the ancient linen sheet and the HSP for Thymol, but I believe these data as interesting in order to do the inherent calculations.\nB.T.W . : Do you know the cohesive energy, the Hansen Theory and the Hildebrandt Theory ? Sorry…).\nObviously we cannot use that particular way (= the IGC) on the Holy Shroud !!!\nSo …\nIn order to detect the traces (of thymol) on linen fibrils we can use the adequate SPM controls. For example : the CFM (= Chemical Force Microscopy).\nWhat is your opinion ?\nIs it feasible that non-destructive control ?\n— —\nIn my idea we can compare (in that manner) the linen fibrils taken from the Shroud before (the Thymol treatment) with the other new fibrils. This scientific work requires a good Plan (and, obviously, we cannot work only to detect the level of that presumed thymol contamination ! We have to prepare the adequate set of experiments …).\nIn any case, the thymol contamination is not the main problem in order to know the true epoch for the Shroud.\nDo you agree with me on that statement ?\n— —\nI want to add that, perhaps, we can try to do some\ncalculation about the “Vanillin loss from Lignin”\nalso using the HSP (and the three parameters or contributions are the following :\n– dispersive\n– polar\n– Hydrogen bonding … ).\nWhat is your comment on that particular idea ?\n— —\nHave you found an exact opinion (apart Ray Rogers)\nabout the temperature, the time and the Vanillin loss ?\nI remember this question as a troubling argument …\n— —\nI am curious about the effect from the Corona Discharge\n(see : Fanti and the inherent experiments) on Vanillin loss. But this is another particular question (perhaps there are very little areas of the sheet involved)…\n\n","date":"November 19, 2012 at 12:00 pm","url":"https://shroudstory.com/2012/11/14/berry-no-matter-where-he-or-she-considers-themselves-to-be-on-the-scale-of-infallibility/","cat":"carbon_14_dating","title":"Berry: No matter where he or she considers themselves to be on the scale of infallibility"},{"author":"piero_iacazio","post":"I remember that Dr. Ray N. Rogers indicated us the fact that\nthe wood reliquary can take a certain amount of thymol and\nthen this quantity will be released after a certain amount of time.\nSo … the first question seems to be the following :\nWhat are the exact quantities involved ?\n(but, unfortunately, Riggi is dead since months …)\nand the second question is :\nThe presumed thymol contamination can change the 14C results ?\nThis question seems to be strange … There is a little amount of C, so there is not the great change, but (in my opinion) this is not the true problem.\nThe problem is the 14C in itself. We cannot destroy a relic using the 14C (or another destructive analysis) on that ancient cloth.\nThere are the SPM analyses and then we have to use this new way in order to discover the truth about the true epoch.\nDo you agree with me about this simple SPM idea ?\nIf you agree on that new way (to observe the material) perhaps\nwe can discuss how to improve the analyses avoiding the destructions.\nThere is a lot of work to do using the SPM analyses, included the question\nof the detection of thymol contamination on linen fibrils.\nBut, before to start with the controls on linen fibrils coming from the Shroud,\nwe have to try to do some interesting experiments about the contaminations\n(on linen samples) to improve the knowledges before to waste the time\n(perhaps) in useless analyses…\n","date":"November 20, 2012 at 5:33 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/11/16/draft-document-discovered-in-the-paper-skip-at-my-local-recycling-centre-ten-killer-arguments-for-opposing-any-re-run-of-the-radiocarbon-dating/","cat":"killer_arguments","title":"Draft document discovered in the paper-skip at my local recycling centre: “Ten killer arguments for opposing any re-run of the radiocarbon dating.”"}],"image":[{"author":"piero_iacazio","post":"Try to see under the address :\nhttp://en.wikipedia.org/wiki/Inverse_gas_chromatography\nWhile in gas chromatography a sample containing multiple species is separated into its components on a stationary phase, Inverse gas chromatography uses injection of a single species to probe the characteristics of a stationary phase sample.\n— —\nObserve the movie (= Inverse gas chromatography and retention time for Cellulose and Nonane) under the address :\n\n and\nthink what are the different molecules near the linen of the Shroud…\nand\nwhy we never have studied that interesting question in a deep manner in the studies about the linen of the Shroud ?\nSee also : the question of the presumed “second Face” indicated (by prof. Fanti and other researchers) as present in the reverse side of the Shroud …\nThen the questions can be the following :\nWhat is the retention time (on linen) for the different kind of cadaveric amines ?\nWhich is the retention time (on linen) for the aromas ?\nIt seems that we were not able to find the inherent answers.\nIs that scientific work an useless waste of time ?\nWhat is your remark now ?\n\n","date":"October 25, 2012 at 11:37 am","url":"https://shroudstory.com/2012/10/24/comment-promoted-denis-mannix-on-his-proposal/","cat":"image_theory","title":"Comment Promoted: Denis Mannix on his proposal"},{"author":"piero_iacazio","post":"First of all : I want to respect You and the International Meetings about the Shroud of Turin.\n— —\nYou wrote : “”You must contact … “.\nWell.\nIn the past I tried to contact some expert in the field of the AFM, but I obtained no great results.\nIn my opinion “the many scientists involved” in the studies don’t follow the right way : the advanced analyses about the material (taking apart the other interesting questions : old and new Carbon dating, etc.).\nWhy ?\nWhat is the exact reason for that behaviour after 14 years (= 1998-2012) ?\nIt seems that only Ray Rogers tried to do something using the XPS analyses.\nRecently Prof. Fanti claimed something in the field of mechanical controls, but the proper way (IMO) is the use of the SPM. In this manner we can observe the linen fibrils and the thin layers (= also the so-called “ghosts”, obtained from the tapes).\n— —\nWhat is your preferred way to control the linen sheet ?\nWhat is your professional level ?\nI am curious to understand your approach.\nFor example : you discarded the question of the Raman analyses of the year 2002 (avoiding that argument), but this is (IMO) an interesting point to discuss.\nThe Raman analyses can show something about the BIF.\nNow we can improve the precision (with respect the past Raman analyses of 2002) about the Raman analyses.\nDo you agree ?\nI hope you can send an answer also about this point.\n— —\nThe other unclear statement that you wrote was the following :\n>the Church always moves slowly\nI don’t agree on that.\nIn the case of the Shroud the Science moves slowly !\nAfter 14 years we still wait for the exact answer.\nThis is a very long period without the right works (apart the first rough attempts).\n— —\nWhat is your answer ?\n— —\nIn my opinion no researcher (= no big name) is interested in a “simple work” that don’t offer the adequate fame or reward.\n\n","date":"October 16, 2012 at 11:09 am","url":"https://shroudstory.com/2012/10/11/it-is-thus-but-may-not-berichard-dawkins-should-ignore-the-challenge/","cat":"image_theory","title":"It is thus but may not be–Richard Dawkins should ignore the challenge"},{"author":"piero_iacazio","post":"I remember that in 2010 (after the IWSAI) a researcher indicated the emotion to see in vivo a genuine Shroud fiber at the microscope in transmission light, reflected light and between crossed polarizers. But no AFM controls … !\n— —\nIn my opinion it’s difficult to avoid the little destructions when we want to work with the analyses. But, at least, the SPM techniques seem to be the right way because using the 14C tests there is a great destruction without repeatibility for the controls. Instead following the SPM controls we can work also on pollen without the great destructions and we can repeat the controls.\nIn the past I tried to ask for the IWSAI, but my paper was not complete (with the new analyses).\n— —\nWe can speak about the Turin Shroud, the Sudarium of Oviedo, the Manoppello Veil and the Tilma of Guadalupe for hours, but we have also to work in order to show (… if it is possible to receive the permission to investigate) what is the answer from the materials under the advanced analyses …\nObviously we cannot destroy these relics/reperts during the analyses.\n— —\nIn order to avoid the confusions it is better to work on similar relics (for Shroud and Oviedo’s Cloth are lignocellulosic materials instead the Manoppello’s Veil seems to be silkmarine byssus).\n— —\nB.T.W.  :\nYesterday I have found a very old AFM work (1996) :\nAtomic force microscopy of pollen grains, cellulose microfibrils, and protoplasts.\nAt that time the level of the analyses was very rough :\n>The AFM analysis of the cellulose microfibrils did not show any substructures. …. !\n— —\nThe problem was due to the convolution effects.\nIt was also indicated a deconvolution technique (to calculate the true structure of a biomacomolecule) based on gold particle as reference.\nNow the new AFM systems have a good precision.\nHere the address for the old study :\nhttp://www.biophysics.leidenuniv.nl/noort/publications/vanderwel96protoplasma.pdf\n— —\nOnline :\nhttp://onlinelibrary.wiley.com/doi/10.1111/j.1365-2818.1995.tb03675.x/abstract\nyou can read something about the :\n“Stereo representation of atomic force micrographs: Optimizing the view”,\nby Z. Shao, A. P. Somlyo\nSummary\n>The usefulness of stereographs for atomic force microscopy (AFM) is discussed and illustrated with AFM stereo images of biological macromolecules. The three-dimensional nature of AFM data makes such display particularly appropriate, as it contains the information in an optimal format for creating stereographs suitable for direct evaluation by the human observer. We describe a simple procedure that employs standard functions in a commercial AFM for creating such stereographs.\nBut I am not a biologist …\n— —\nPreviously I wrote :\n>If we know the length of the cellulosic chains we can know the degree of polymerization\nBut we have also to take into account the centuries and the possible damages (= fungal attacks, Fire of 1532, etc.) and then we have to chosen the proper area to test (after the first attempts on linen fibrils already taken from  the Holy Shroud in the past).\n— —\nHave you an idea about the useful address where to send a paper ?\nWhat is your idea ?\n\n","date":"October 18, 2012 at 8:56 am","url":"https://shroudstory.com/2012/10/11/it-is-thus-but-may-not-berichard-dawkins-should-ignore-the-challenge/","cat":"image_theory","title":"It is thus but may not be–Richard Dawkins should ignore the challenge"}],"misc":[{"author":"piero_iacazio","post":"I beg pardon for this very long message.\nBut I tried to contact the website (Nature) and I was not able to send the following message :\nIn the past (year 2002) appeared an interesting study :\nAnalysis of Pigmentary Materials on the Vinland\nMap and Tartar Relation by Raman Microprobe Spectroscopy\nby\nKatherine L. Brown and Robin J. H. Clark\n— — —\nThe VM is a world map on parchment measuring 28 cm by 40 cm which\nincludes, significantly, representations of Iceland, Greenland and\nthe north-eastern seaboard of North America (“Vinland”).\n— — —\nThe map and manuscript were analyzed by Raman microprobe\nspectroscopy using a Renishaw System 100 with a 632.8-nm laser\nand fiber-optic probe. Laser powers of between 0.5 and 5 mW at\nthe sample were used over accumulation times of up to 800 s.\nThe laser spot size was \u00185 ím in diameter using a 10\u0002 lens as\nthe probe objective.\nAreas of study were selected on the basis of pigment density\nor other specific features of interest.\n— — —-\nThe use of Raman microprobe spectrometry has conclusively\nidentified the materials used in the construction of two significant\nhistorical documents, the Vinland Map and the Tartar Relation.\nAlthough the inks used for the Tartar Relation are entirely\nappropriate for the period of its construction, one of those used\nto draw the Vinland Map is not. The presence of a yellow line\ncontaining anatase, closely associated with a stable carbon ink,\nindicates that the VM is a modern forgery.\n— —-\nBut the Raman analyses are very interesting also in another case.\nHere the question :\nWhat were the results obtained for the Holy Shroud of Turin using the Raman analyses ?\nUnder the address :\nhttp://www.renishaw.it/it/restauro-di-opere-darte–7982\nyou can read the words :\n>Raman analysis is non destructive, and the use of remote fibre probes allows analysis to be performed on virtually any sample in-situ. Renishaw’s expertise in this area was recognised in 2002 when the Sindonic Conservation Committee in agreement with Cardinal Poletto of the Turin diocese, selected their Raman instrumentation to provide analysis of the Holy shroud (also referred to as the ‘Turin’ shroud).\nApparently (and after near ten years) we cannot yet say what happened in 2002 because there is not a public paper on this particular argument.\nSo we cannot see the truth about the Raman analyses …\n— —\nIn the past we have read the old results published in “Nature” (in 1989) and these data are very questionable with respect the probable truth about the age (see : the wrong Chi square value and other presumed errors indicated years ago) also because the recents remarks by prof. Jull (Univ. of Arizona) seemed to be a sort of inconclusive step regarding the total truth for the true epoch (= the main question !) for this ancient relic.\nWhat is the answer from the scientific community ?\n— —\nI believe there is an interesting opportunity for the scientists who want to show the way to obtain the truth : the future papers for the review “Current Physical Chemistry” (see : bentham.org/cpc/FantiHT%20rev.pdf) recollected by the prof. Giulio Fanti.\n—\nI believe that preliminar experiments on several AFM-Raman apparels are able to furnish the useful explanations in order to try the important exploration about the linen fibrils of the famous relic.\nIn any case the silence about the Raman analysis on the Shroud during the year 2002 seems to be an enigma.\nWas that Raman control a failure ?\nHave you found the solution of this enigma before to read the new papers ?\n— —\nRegards,\nPiero Iacazio\n\n","date":"February 18, 2011 at 1:50 pm","url":"https://shroudstory.com/2011/02/18/from-nature-news-on-science-and-religion/","cat":"news_&_views","title":"From Nature News: On Science and Religion"}],"researchers":[{"author":"piero_iacazio","post":"Do you know dibenzodioxocin ?\nMolecular Formula = C14H10O2\nAverage mass = 210.228 Da\nDibenzodioxocins are thermally unstable products.\nBoth semi-empirical and density functional theory quantum calculations show that both C-O bonds, which connect the biphenyl part of the dibenzodioxocin molecule to the phenolic group, can be broken under increasing temperature.\nSo, I think it is possible to search something (advanced analyses) into your linen samples and other attempts to produce a Shroud-like material…\nDo you know the thermal degradation of a phenolic dibenzodioxocin lignin model ?\nSo…\nIs it possible to apply these chemical knowledges in the field of the studies about the Shroud ?\nWhat is your own opinion ?\nAm I wrong about the idea to search dibenzodioxocin as a sorto of “key-molecule”?\n— — —\nI believe that AFM and SNOM technique can be useful to solve the Enigma.\nIn any case we have to remember Ash and Nicholls [“Super-resolution Aperture Scanning Microscope”, Nature 237, 510 – 512 (30 June 1972)] …because they first demonstrated the concept of Near-field scanning optical microscopy …\nRegards,\nPiero Iacazio\nReference :\n>…A specific condensed lignin substructure, dibenzodioxocin, was immunolocalized in differentiating cell walls of Norway spruce ( Picea abies (L.) H. Karsten) and silver birch ( Betula pendula Roth) xylem. …\nLinks:\nhttps://www.ncbi.nlm.nih.gov/pubmed/13680231\nhttps://www.lenzing.com/fileadmin/template/pdf/konzern/lenzinger_berichte/ausgabe_87_2009/LB_2009_Kudanga_10_ev.pdf\n","date":"October 3, 2017 at 4:53 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/08/24/a-solution-at-last-to-the-turin-shroud-based-on-my-5-years-of-continuous-experimental-research/","cat":"shroud_of_turin,","title":"A solution (at last!) to the Turin Shroud – based on my 5 years of continuous experimental research."},{"author":"piero_iacazio","post":"Dear Dan and friends,\nIn my opinion it will be near impossible to show the historical evidence that Jesus was resurrected using the analyses of the Turin Shroud. Why ?\nWe can start from the fact that\n                                                 the Resurrection is a Mystery of Faith\nand not a simple scientific fact to show ! Are you able to reproduce a Resurrection in the Lab ?\nIn any case the claims by de Wesselow about the Origin of the Christian Faith are not completely original.\nI refer (for example) to the booklet :\n“The Shroud Was the Resurrection: The Body Theft, the Shroud in the Tomb, and the Image that Inspired a Myth” by John Loken (Paperback – April 16, 2006)\nI have read that strange book some year ago …\nAm I wrong ? How is possible to forget all the past (and present) History (and also the particular image of the Veil of Manoppello)?\n— —\nThe only interesting and reasonable thing that we can underline is the possibility for new dating attempts, with the advanced systems.\nIn this manner we have the solution for the true epoch of that ancient linen and this is an important step.\nHow is possible to reach that solution ?\nI know that there are the new 14C tests (see the work of two Italian teams from National Institute of Optics and from European Laboratory of non linear spectroscopy, Florence. They published a very interesting paper on the high-impact-factor journal “Physical Review Letters” entitled Molecular Gas Sensing Below Parts Per Trillion: Radiocarbon-Dioxide Optical Detection. = They were able to measure 14C concentrations at a 43 parts-per-quadrillion level. Wow !!!) but I don’t believe in the (useless) destructions.\n— —\nHere I cannot write a too long message, so I want to suggest two ways :\n1) the use of the SPMs (= the new advanced microscopies = AFM, CFM, SNOM, used in order to discover the cellulosic Dp value and then the probable epoch)\n2) the use of the new system by Miao and others. There is an article under the address :\nhttp://www1.cnsi.ucla.edu/news/item?item_id=2045547\n“New technique lets scientists peer within nanoparticles, see atomic structure in 3-D”.\nand\nthis is the inherent text :\n>March 21, 2012 – UCLA researchers are now able to peer deep within the world’s tiniest structures to create three-dimensional images of individual atoms and their positions. Their research, published March 22 in the journal Nature, presents a new method for directly measuring the atomic structure of nanomaterials.\n>”This is the first experiment where we can directly see local structures in three dimensions at atomic-scale resolution — that’s never been done before,” said Miao.\n— —\nWhat is your opinion ?\nIs the problem about the cellulosic Dp measurement a sort of enquiring work too difficult to perform ?\nIs it impossible to work (on ancient linen fibrils) without the destructions ?\nSo the question is the following :\nWhat is the level of destruction that we can accept for the Holy Shroud or for the Sudarium of Oviedo (or for both the cellulosic reperts) ?\n— —\nIn any case the 14C tests are more destructive … So, I want to know what are your perspectives.\n— —\nRegards,\nPiero Iacazio\n\n","date":"March 29, 2012 at 10:09 am","url":"https://shroudstory.com/2012/03/28/quote-for-today-stephen-e-jones-on-thomas-de-wesselow/","cat":"books","title":"Quote for Today: Stephen E. Jones on Thomas de Wesselow:"}]}
