{"dating":[{"author":"piero_(piedmont)","post":"Dear Colin,\nIn the case of cellulosic materials (=Cotton, linen, paper, etc.)\nthe measurement of the cellulosic DP is an interesting way to know\nthe true epoch for that ancient linen sheet and this method\n(the detection of the cellulosic degree of polym. for the cellulosic chains)\nis very interesting … and that … not only in my opinion !\nSee, for example the previous studies by Diana and Marinelli.\nIn 1997 during the Symposium of the CIELT (in Nice, France) and also\npreviously they indicated that way …\nUnfortunately they indicated a wrong system (using the presumed proper\napparel) for the right analyses about the Holy Shroud :\nthe viscometric measurement.\nThis way requires a lot of material with respect the very little amount\nof linen fibrils (… obviously here … I speak in a rough manner. Thus : taking\napart the problems connected with the Applied Statistics … and the calculations\ninherent the exact amount of material required to obtain a decent and\nincontrovertible work with the fibrils) in the case of the AFM measurements !\nAnother problem is due to the effect of the past fungal attacks.\nThen the inherent areas involved in these degradation are to avoid\nduring the controls (of the cellulosic DP).\nAnd now (= after this simple attempt to explain the scientific question) :\nWhat is your idea ?\n— —\nYou can try to improve your knowledges about the degradation of the\ncellulose (and the cellulosic DP) and the degradation evolution equation\nof cellulose, reading the following paper :\nAuthor response to the comments by P. Calvini regarding the article “On the degradation evolution equations of cellulose” by H.-Z. Ding and Z. D. Wang\nSource :\nthe review\nCellulose,\nApril 2008, Volume 15, Issue 2, pp 229-237\nSpringer\n— —\nI guess that in your reply you point another time\nthe attention about the (presumed) unsolved problem\nof the absolute scale of dating …\nBut we can try to obtain the useful scale measuring the ancient and old\ncellulosic materials.\nSee for example the recent dating for the portrait of Bianca Sforza\n(by Leonardo da Vinci). They used a spectral method. But, in my idea,\nwe can try to do something using the measurement of the cellulosic DP.\nDo you agree ?\nIn the past our common friend Dan Porter indicated the book by\nPeter Silverman (who, the january 30, 1998, was curious about the painting\nby Leonard) and then the portrait of the belle princesse (Bianca Sforza\npassed away at 13 years old !) was an interesting challenge, an argument\nto use in order to show what is possible to obtain with the SPM dating\nversus the 14C test.\nDespite the fact that dating of the portrait to 1496 and the identification\nof the sitter as Bianca were confirmed to a high level of probabily, the\nidea to obtain the SPM confirmation can be interesting to develope\nbecause this will show the level of precision for the SPM tests.\n— —\nThe similar SPM analyses can be applied for the well known ancient\ndocuments coming from the sites of Qumran …\n— —\nIf you want to improve some control there is the CFM (= Chemical Force\nMicroscopy). So, you can hope to detect also the few molecules of thymol.\nThe CFM can distinguish between distinct chemical regions on a surface.\nChemical force microscopy provides quantitative information on the interactions between chemically modified tips and the surface.\n— —\nI hope in your answer.\n— * —\nHappy New Year 2013 !\n","date":"December 28, 2012 at 5:06 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/11/16/draft-document-discovered-in-the-paper-skip-at-my-local-recycling-centre-ten-killer-arguments-for-opposing-any-re-run-of-the-radiocarbon-dating/","cat":"killer_arguments","title":"Draft document discovered in the paper-skip at my local recycling centre: “Ten killer arguments for opposing any re-run of the radiocarbon dating.”"},{"author":"piero_(piedmont)","post":"Personally I think at the Shroud as the authentic relic (2000 years old)\nthat permits to see something about the Holy Face of Jesus.\nBut this is only a personal idea (then this is the reason about the true\nepoch to demonstrate, through the adequate controls !).\nIn any case I don’t believe in your destructive way to proceed ! It’s too\ndestructive, IMO.\nInstead, using the SPMs (= Scanning Probe Microscopies) we can try to\nestimate the cellulosic degree of polymerization (= cellulosic DP) and\nalso try to observe what is the amount of different kind of contaminants,\nincluded the thymol (… molecules !!!).\nI want to add that (in my opinion) perhaps the Raman analyses of the year\n2002 (in Turin, by Renishaw) were not published because they testified\nthe previous thymol contaminations. Am I wrong in this hard conjecture ?\nHave you found another more simple explanation about this\nlack of communication (= ten years !) about the Raman controls ?\nWhat is your opinion ?\nSo …\nWe have to choose to do the right controls on right areas.\nAt least we have to ask for new controls using the advanced controls\n(= AFM or AFM-Raman techniques applied in a careful manner) on linen\nfibrils taken from the Holy Shroud in the past (= before the thymol treatment)\nand on linen fibrils taken after the thymol treatment. This is an interesting\nscientific argument (for a paper).\nI believe these useful linen samples are already taken and kept apart.\nThen there is the necessity for an adequate request about the inherent new\n(and open ?) scientific Committee.\nDo you agree on that idea ?\n— —\nRecently I tried to search for other ways, for example : the ptychographic\nelectron diffractive imaging at atomic resolution, permitting identification\nof structures …\nIf I am right a STEM (= scanning transmission electron microscope)\nand the X-rays are used to work …\nThe STEM permits a more deep control with respect the AFM\ntechniques (= superficial controls).\nBut the STEM was an old way with respect the AFM and the CFM.\nI have not a great knowledge in this interesting field and (u\nnfortunately) in my mind these ways seemed to be more feasible\nin the mineral world … I had some doubt.\n— —\nThere is another way : the scanning X-ray fluorescence microscopy (XFM).\nThis a particularly useful method for studying the spatial distribution\nof trace metals (= Sr, etc.) in biological samples. In my idea this is a possible\nway to work in order to search the Strontium (that an interesting geographical signature).\nBut (if I am right) this way has a “low” precision (near 30 nm)…\nThe quantitative elemental maps are also interesting for the\nanalysis of the pollen.\nDo you know the X-ray fluorescence micro-computed tomography ?\nIn the Web there is some document about the X-ray Fluorescence\nMicroscopy for Biology and Bionanotechnology.\nTry to see … I don’t want to be too boring, here.\n— —\nWhat is your idea ?\nWhat will be the choice of the future scientific Commission ?\nWhat is your prevision ?\nHow to make credible forecasts without the work on the Labs\nusing the adequate tools ?\n— —\nRegards,\nPiero\n","date":"November 23, 2012 at 5:31 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/11/16/draft-document-discovered-in-the-paper-skip-at-my-local-recycling-centre-ten-killer-arguments-for-opposing-any-re-run-of-the-radiocarbon-dating/","cat":"killer_arguments","title":"Draft document discovered in the paper-skip at my local recycling centre: “Ten killer arguments for opposing any re-run of the radiocarbon dating.”"}]}
