{"dating":[{"id":"comment-18681","author":"r","post":"Your not implying that ‘some’ church officials had any dubious dealings with the C14 issues are you? ; ) I think it would have been more appropriate to state “Greatest Conspiracy of All Times” then specifically Greatest ‘scientific’ cheat of all times….Can I say conspiracy? LOL. The whole thing was a sham, from the Church’s dealings to the scientific testing to compromised results. It is really truly a wonder, that a documentary of this type has not come to light much much earlier…or maybe one has, but has not been given much press. R.","date":"2012-10-31","mins":"1:50 pm","url":"https://shroudstory.com/2012/10/30/another-article-on-francesca-saracinos-la-notte-della-sindone-documentary/","cat":"carbon_14_dating","title":"Another Article on Francesca Saracino’s “La notte della Sindone” Documentary"},{"id":"comment-6702","author":"r","post":"Yannick Clément :I know the Catholic teaching well enough to know that resurrection is only a term of faith that cannot be proved scientifically. There’s nothing in the gospel or in the letters of the New Testament to support a burst of radiation or a burst of UV light or a corona discharge or something similar. There’s no scientific data found by the STURP team that can really support the ASSUMPTION that a burst of radiation, a burst of UV light, a corona discharge or something similar had anything to do with the body images. All these kind of ideas are only based on the ASSUMPTION that the resurrection of Jesus SHOULD have produced a burst of some form of energy from his body. Personally, I found this idea close to the New Age philosophy or something like that and I’m fully aware that it was propagated by Hollywood movies. One thing’s for sure : this whole idea is not a catholic concept. We are not talking scientific proof here Yannick, you are talking Church doctrine and you can’t know the church’s stance on the resurrection or what they think the resurrection actually was because they (The Church), have never made any comments on it, whatsoever (That I know of officially)…Furthermore; of course there is nothing in scriptures about a burst of energy! As no one actually witnessed the resurrection! So how could there be? Whether or not the ‘means’ of the resurrection is a catholic concept or not, means nothing in the study of the Shroud anyways. I dare to differ with you that STURP findings do not support a ‘possibility’ of some form of light emission to cause the image. It is in what they HAVE NOT found, that has caused many scientists to look at this possibility, amongst others possibilities. So not just me saying or thinking this but scientists who have studied the Shroud and in depth. So this ‘assumption’ as you call it does not come from Hollywood but from scientific study!….Anyways, don’t all hypotheses start off as assumptions? Just like the vapour or milliard hypotheses do? R.","date":"2012-01-09","mins":"1:11 am","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them"},{"id":"comment-6705","author":"r","post":"I think if you actually believe what you’ve written in your first two paragraphs, then you are simply naive and not very schooled in what actually occurred with the carbon dating. But your term ‘FIASCO’ was the right term, I’ll submit. Irresponsible media reports etc; existed before 1988 Yannick and since, so If the Church took the brunt of it after the ‘fiasco’, it’s because they deserved it. Your security theory makes absolutely no sense, if you think about it…If the Vatican didn’t care to use the Shroud for “any purpose at all”, why would they show it at all? Why not just bury the thing in the vatican vaults, never to be seen again? …don’t be so naive Yannick. R.","date":"2012-01-09","mins":"1:28 am","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them"}],"history":[{"id":"comment-17595","author":"r","post":"…and miraculous does not mean unexplainable ; ) R.","date":"2012-10-13","mins":"3:47 pm","url":"https://shroudstory.com/2012/10/13/the-beast-is-sindonology/","cat":"history","title":"The beast is ‘sindonology"}]}
