{"dating":[{"author":"randy","post":"However, Colin has landed over there and has attacked Pam\nMoon’s integrity by calling her work pseudo science. Even though he\nwould never admit it, Colin must be really bothered by the\npossibility that this cloth may show an image of the Son of\nGod.\n\n","date":"February 13, 2013 at 7:18 pm","url":"https://shroudstory.com/2013/02/13/special-paper-chase-new-possibilities-why-the-c14-dating-of-the-shroud-may-be-wrong/","cat":"carbon_14_dating","title":"SPECIAL PAPER CHASE: New Possibilities Why the C14 Dating of the Shroud May Be Wrong"}],"misc":[{"author":"randy","post":"I had the pleasure of meeting Russ and attending his incredibly moving presentation on the Shroud last evening at Providence Academy in Plymouth, MN.  The session was well attended and the audience was very engaged.   Even though I know a fair amount about the Shroud, I really liked how Russ integrated his discussion with Sacred Scripture (both Old and New Testaments), which made it very appropriate in these early days of Lent.\n\n","date":"March 1, 2012 at 10:04 am","url":"https://shroudstory.com/2012/03/01/excellent-interview-with-the-creator-of-shroud-encounter/","cat":"news_&_views","title":"Excellent Interview with the creator of Shroud Encounter"},{"author":"randy","post":"Dan, can you supply Colin with  photomicrographs of the blood areas from the 1978 STURP investigation of the Shroud?   It seems that he is not aware that those exist and I believe would give him more information about the blood than is available thru the Shroud Scope tool.\n\n","date":"June 11, 2012 at 9:15 am","url":"https://shroudstory.com/2012/06/10/useful-and-fun-the-absolutely-fantastic-shroud-scope-tool/","cat":"news_&_views","title":"Useful and Fun: The Absolutely Fantastic Shroud Scope Tool"}],"image":[{"author":"randy","post":"Am I missing something here?   My understanding is that while the scorches on the Shroud from the various fire related events fluoresce, the image itself does not.  See V.D.Miller and S.F.Pellicori, J.Biol.Photograph.Assoc., 49 (1981) 71.  I’m assuming the Sciencebod “hot statue” images would fluoresce, and therefore cannot be the way the Shroud image was formed.\n\n","date":"February 2, 2012 at 11:59 am","url":"https://shroudstory.com/2012/02/01/a-new-theory-for-how-the-turin-shroud-was-faked/","cat":"image_theory","title":"A new “theory” for how the Turin Shroud was faked"}],"events":[{"author":"randy","post":"Go to this site for live streaming:\nhttp://www.ktotv.com/\n\n","date":"March 30, 2013 at 12:25 pm","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","title":"Awaiting Live Stream from RAI Uno"}],"opinion":[{"author":"randy","post":"Dan, I’m sure you are recognizing this and are concerned, but Colin has effectively taken over your blog.  \nI like to come here  daily to understand what’s new in regard to the Shroud and to monitor the debates, but I think Colin made his point a couple months ago.   I believe most of the readers understand his theory by now.  But he continues to hammer his points in an attempt to convince everyone that he has come up with a breakthrough that has been missed by all the researchers over the past 40 years.   Even if the Shroud was an artist’s work (which I don’t believe for an instant), to execute his theory of a scorch created by a hot statue seems like a ton of work, and that simpler methods that McCrone (painting) and Nickell (rubbings) have described seem more reasonable and could be as effective in “fooling” those medieval believers.  I know Colin isn’t concerned about “arts and crafts”, but it seems unrealistic to not consider that as a major factor in proving the theory.  I can imagine how many ruined linen cloths there would be for the artist before they got it right (if they ever would) under his theory.  And while you might apply the blood first before you did the the hot statue, the flows that we see on the Shroud seem very realistic and must come from a real body.  For example, why would the hot statue artist even consider creating the flow of blood from the wound in the side that trickles over to the back of the image, especially if the dorsal image was done at a different time.  \nUntil Colin actually recreates the Shroud image (or a portion thereof) and determines that it is consistent with all the chemical and physical properties that have been published, I am not particularly interested in hearing more about his theory.\nThanks for your well-done and compelling blog.\n\n","date":"March 22, 2012 at 4:53 pm","url":"https://shroudstory.com/2012/03/22/the-secrets-of-mfol-revealed/","cat":"other_blogs","title":"The secrets of MFOL revealed"},{"author":"randy","post":"Colin,\nAnd maybe what I’m saying is that Dan should not report on your blog anymore until you have done much more intensive work on proving your theory.  Then I’m sure all of us would be very interested in understanding how you were able to come up with your breakthrough.  I would guess you could author a book explaining how you successfully debunked the Shroud.  That might be a good investment of time for a retired Sciencebod.\nThe only reasonable way for the artist to determine what the blood flows would look like as a result of a wound to the side is to actually see it happen to a human body.   Now we have a highly skilled metal sculptor, who knows how to scorch linen with his work to create a superficial image, and is also expert on blood flows and how to make those appear natural on a linen cloth by using his statue to apply before the scorching exercise.   This is the “arts and crafts” aspect that doesn’t seem to support your theory.   Remember too that the Shroud first appeared in a small French church, under ownership of a Knights Templar.   If this was forged, I still can’t see why someone would go thru this much trouble to “fool” the pilgrims.\n\n","date":"March 23, 2012 at 12:00 pm","url":"https://shroudstory.com/2012/03/22/the-secrets-of-mfol-revealed/","cat":"other_blogs","title":"The secrets of MFOL revealed"}],"resources":[{"author":"randy","post":"One thing that Tabor does not seem inclined to mention is that the “Jesus” ossuary from the Talpiot tomb is essentially empty.   One of the authors of the original Talpiot story, Charles Pellegrino recently stated the following in a blog response:\n“Almost two years ago, Simcha told me that another lab had independently come to conclusions consistent with my survey of trace fiber evidence from the Talpiot tomb’s Jesus Ossuary. The fibers are inconsistent with a primary burial. Only a single hemispherical bone fragment, consistent with a carpal, appears ever to have been placed in the ossuary, with two cloths of unusual composition. In any case, he’s not there, in the ossuary.”\nIs it possible that the Shroud may have been stored in an ossuary in some Jerusalem tomb (maybe not at the original burial site) for a period of time (possibly centuries) after the Resurrection?   Given that this is an object related to a Jewish burial, I assume that the disciples would have been mystified by it and  might default to how the burial remains would’ve been handled.   In any event, I can’t see how it would’ve been handled casually.\n\n","date":"March 1, 2012 at 10:43 am","url":"https://shroudstory.com/2012/03/01/fasten-your-seatbelt-more-archeology-from-tabor-and-jacobovic/","cat":"books","title":"Fasten your seatbelt: More Archeology from Tabor and Jacobovic"}]}
