{"dating":[{"author":"ray_schneider","post":"We are certainly still in need of information to answer Brad Gore’s question.  What we know is that the samples taken in 1988 dated to 14th century.  We also know that the samples had a position dependent age gradient which may be due to random differences in the calibration of the AMS laboratories or may be due to some property of the sample that caused a position based variation in the amount of C14 present.  We don’t know which.Finally we know that the sample contained anomalous cotton which is not commonly present in the shroud as a whole and so indicates that there is something clearly unrepresentative about the sample site.  Some suggestions have been that the site was the site of a 15th century sample which was taken and the area invisibly rewoven using French invisible reweaving technology.  This suggestion has been criticized, but not eliminated from consideration.  Samples of threads from the sample are give a positive test for vanillin while shroud fibers in general do not, again indicating that the sample area is anomalous.  So while there is not particular reason to doubt the 14th century AMS result (although there are statistical problems) there is quite strong reason to doubt that the sample was truly representative of the shroud as a whole.  There is also quite a lot of other data which calls into question the 14th century result.  However much of that data is historical in character and somewhat fragmentary.  The Pray codex, the report of Robert de Clari from the 4th crusade and other historical data suggests the shroud is much older than the carbon date.  So until a more statistically satisfactory, multi-site test is conducted the date we currently have seems to have been generated on a non-representative sample.Regards, Ray Schneidermember of the Shroud Science Group","date":"September 28, 2008 at 7:52 pm","url":"https://shroudstory.com/2008/09/28/brad-h-gore-says/","cat":"carbon_14_dating","title":"Brad H. Gore Says"}],"resources":[{"author":"ray_schneider","post":"Whatever the defects in Ian Wilson’s speculative account of the pre-history of the Shroud of Turin, it seems to me that Christopher Freeman’s account is simply a tissue of debunking repeating many poorly substantiated claims about relics and then lampooning Wilson’s treatment.He fails to mention explicitly the Gregory sermon or the chronicler Robert de Clari’s observation of an object that is described and sounds very like the shroud in 1204.  He does note the location and claims that the identification of the Image of Edessa with this other relic which certainly sounds like the shroud can’t be.  He doesn’t address Wilson’s speculation that on arrival in the city in 944 if was found to be a shroud and not just an image of the head of Jesus. Also it seems to me that the cloth of Oviedo (regardless of its Carbon date) has stains on it that have the same blood type as the blood on the shroud and have configurations that can be matched to the shroud which tends to corroborate Wilson’s conjecture that the shroud is authentic.It is difficult to be certain of anything from all the fragmentary evidence, but simply pointing out in every case that perhaps there are other interpretations or that Freeman doesn’t see Wilson’s point is not really an argument but a preconceived conviction.  If Wilson can be convicted of being prejudiced in favor of shroud authenticity it seems to me that Freeman can be convicted of the opposite prejudice.  One agenda driven account is not more convincing than another.  Wilson never claims to prove the shroud authentic.  He is making a fragmentary case with what evidence there is.  The shroud is a very mysterious object with remarkable and wholly unique properties and unless we can convincingly explain it then the possibility of authenticity cannot be simply ruled out.   There are many small things that point to authenticity and there are some that point in the opposite direction.I do think that Freeman has a point about the handling of shroud research.  STURP did what it could but it was a quickly thrown together association of scientists with relatively few resources.  If they were not as professional as they might have been it should be remembered that they were the first and only investigation that has taken place and their research was compressed into 120 continuous hours.  These are hardly ideal circumstances.  Freeman’s criticisms are Monday morning quarterbacking from the armchair position.","date":"May 29, 2012 at 12:43 pm","url":"https://shroudstory.com/2012/05/29/scientific-study-of-the-shroud-of-turin-hampered-by-sturp/","cat":"books","title":"Scientific Study of the Shroud of Turin hampered by STURP?"},{"author":"ray_schneider","post":"Charles Freeman … sorry","date":"May 29, 2012 at 12:45 pm","url":"https://shroudstory.com/2012/05/29/scientific-study-of-the-shroud-of-turin-hampered-by-sturp/","cat":"books","title":"Scientific Study of the Shroud of Turin hampered by STURP?"},{"author":"ray_schneider","post":"Before giving any credibility to the coin conjecture I think not only the apparent coin image should be presented but its registration should be demonstrated.  The best of the “enhancements” do present the impression of elements of the Pilate coin, however the elements seem to be out of placement and not in the correct scale, so it may well simply be a case of similarity and not a real image at all.  Remember that the folks doing the processing were looking for a particular appearance so there is a selection phenomenon at work which will drive the process to the best apparent fit.","date":"October 25, 2011 at 12:56 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue"}]}
