{"art":[{"author":"ray_matthew","post":"Your first question has perplexed me too. In the beginning of my Christian journey, age 15, I had the standard answer you hear so often. Basicly, you’ll end up in hell if you don’t accept Christ and personal Lord and savior. But that answer seems a little too simple to me now, age 56. I have no doubt about the truth of what the New Testament claims for Christ, but I’ve seen subtle things in the scripture that the churches don’t talk much about, things that place such an emphasis on proper lifestyle and not so much emphasis on proper theology. I’d say theological statements are outnumbered about 3 to 1 by lifestyle statementsin the scripture, especially in the New Testament. They are esspecially outnumbered in the teachings of Christ in the Gospels. I think there are many who think they are saved but aren’t saved. They make  their claim because they did accept Christ and believe all the right things, but many cannot prove Christ actually is their Lord by the way they live; while others, who didn’t even know who Christ is, live much as he taught. If I had to choose, I’d rather be in the second camp. In general, I’ve decided  that we will be judged according to the light we had. Proper theology is required from those who, in God’s opinion, had every opportunity to know it. To be willfully ignorant is nothing to brag about, and we don’t have the right to twist the clear teaching of scripture on the nature and character of God to fit into whatever theological agenda we might have. But not to live as Christ taught is inexcusable for people like me who knew what do but often didn’t do it. All we can do is repent, and ask God to help us do better. For those who knew nothing of Christ, and yet acted in accordance with his teaching, my hat is off to them. Moral truth is indeed written large over the earth. God bless them. I still have a responsiblity to get Christ’s message out to the world. He told us to “make diciples of all nations, teaching them to observe all that I have commanded of you.” But notice his emphasis on dicipling, not merely making converts. And notice his emphasis on his commands, which deals with lifestyle issues. Would that the churches would make better diciples and not merely converts.","date":"October 25, 2012 at 12:39 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"ray_matthew","post":"I was just thinking about faith today. I think God intentionally doesn’t give us absolute proof, with no angle of plausable deniablility. The scripture says “Without faith it is impossible to please God.” I guess he wants us to please Him. He always leaves a little tiny door open for doubt, if we choose to go there. He wants us to exercise our free will.","date":"October 13, 2012 at 2:33 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
