{"blood":[{"author":"richard_savage","post":"– But is Berry correct that our opinion (the blood being on first) “rests on  somewhat token and insubstantial evidence based on a single spot test with proteolytic enzyme on a microscope slide.”  In http://shroud.com/pdfs/adler.pdf, Adler bases his claim on publications by himself, Heller and Jumper — but, are they all referring to “a single spot test”?\n\n","date":"August 3, 2012 at 10:19 am","url":"https://shroudstory.com/2012/08/03/did-the-bloodstains-really-precede-image-formation-on-the-shroud-of-turin/","cat":"blood_studies","title":"Did the bloodstains really precede image formation on the Shroud of Turin?"},{"author":"richard_savage","post":"Hugh,\n– I meant to thank you before, but got distracted…\n– Thanks.\n— Rich\n\n","date":"February 22, 2013 at 1:47 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"author":"richard_savage","post":"Hugh,\n– I haven’t kept up as well as I should, but do you believe that the stains are real blood?\n— Rich\n\n","date":"February 19, 2013 at 2:35 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"author":"richard_savage","post":"Max,\n– Thanks.  That ought to do it.\n— Rich\n\n","date":"February 22, 2013 at 1:37 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"author":"richard_savage","post":"Max,\n– I haven’t been able to find a source for the aspects of “Jewish/Judean burial core procedures” that you describe above.  Got something handy?  I’m arguing with the skeptics at http://forums.randi.org/showthread.php?p=9022566&posted=1#post9022566, and they want my sources.\n— Rich\n\n","date":"February 22, 2013 at 10:01 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"author":"richard_savage","post":"Colin,\n– I’m slow — and, haven’t been able to find your WordPress site (!#$%^&*!).  Nor, did I realize how closely you follow this blog.\n– Anyway, by “real blood,”I meant  “the red fluid that circulates through the heart, veins, and arteries of animals” (http://www.ask.com/dictionary?q=blood&qsrc=999&o=3986).  Actually, in this case, I meant “the remains of red fluid that had circulated through the heart, veins, and arteries of an animal.”\n– Thanks.  I look forward to corresponding with you.  Hope you have the time…\n— Rich\n\n","date":"February 26, 2013 at 11:19 am","url":"https://shroudstory.com/2013/02/26/that-is-not-what-one-would-expect-to-see-if-the-blood-first-dogma-were-true/","cat":"blood_studies","title":"That is not what one would expect to see if the blood-first dogma were true."},{"author":"richard_savage","post":"\nanoxie :\nRich, if you haven’t yet, you should read Kelly Kearse’s article on this blog : https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/\nIt is true science.\n\nanoxie,\n– Wilco.\n– Thanks.\n— Rich\n\n","date":"February 26, 2013 at 11:33 am","url":"https://shroudstory.com/2013/02/26/that-is-not-what-one-would-expect-to-see-if-the-blood-first-dogma-were-true/","cat":"blood_studies","title":"That is not what one would expect to see if the blood-first dogma were true."},{"author":"richard_savage","post":"– For some reason, the blog didn’t recognize me the last time — but whatever, I need to ask my question again.  Does anyone know whether or not Colin accepts that the “bloodstains” are, in fact, real blood?\n– Thanks.\n— Rich\n\n","date":"February 26, 2013 at 9:29 am","url":"https://shroudstory.com/2013/02/26/that-is-not-what-one-would-expect-to-see-if-the-blood-first-dogma-were-true/","cat":"blood_studies","title":"That is not what one would expect to see if the blood-first dogma were true."}],"dating":[{"author":"richard_savage","post":"Paulette,\n– Sorry not to respond sooner — have a lot to read and think about…\n– I don’t have a picture, but I’ll see if I can get a copy of Jackson’s paper claiming to show how the banding continues through the region that the sample was taken from.  I do wonder about his use of “region” to describe what he sees — does the banding clearly go through the sample itself, or just through the general area?  I’m biased, and hoping the latter.\n— Rich\n\n","date":"June 30, 2013 at 1:12 pm","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","title":"A bit of interweaving in the Arizona sample?"},{"author":"richard_savage","post":"Paulette,\n– I don’t quite understand Rogers’ explanation for banding itself, and don’t think I can effectively communicate what I’m tripping over.  Do you have an explanation, or know of a link with an explanation?\n— Rich\n\n","date":"June 30, 2013 at 2:24 pm","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","title":"A bit of interweaving in the Arizona sample?"},{"author":"richard_savage","post":"Hugh,\n– Do you have an estimate as to how many years the current evidence of medieval contamination, and biological contamination otherwise, IS sufficient to skew the radiocarbon date by?  (Hope that’s coherent.)\n\n","date":"March 10, 2015 at 6:18 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"author":"richard_savage","post":"Paulette,\n– Whew!  Interesting stuff.\n— Rich\n\n","date":"June 30, 2013 at 1:14 pm","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","title":"A bit of interweaving in the Arizona sample?"},{"author":"richard_savage","post":"Hugh,\n– Thanks.\n– But, doesn’t that contradict the 95% confidence level?\n– Just in case you don’t recognize me, I’m “Jabba” from the other forum.\n\n","date":"March 10, 2015 at 8:34 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"author":"richard_savage","post":"– Thanks, Hugh.\n– I have to ask…  Does the banding show up with the Holland cloth removed?\n\n","date":"March 11, 2015 at 9:42 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"author":"richard_savage","post":"Hugh,\n– Unfortunately, I was thinking of it backwards…  that 25% from 50 AD, and 75% from 1600 would show a carbon date of 360 AD.  Oh well.\n– I’ll try to figure it out for myself, but what date would a 50/50 ratio show?\n\n","date":"March 10, 2015 at 3:06 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"author":"richard_savage","post":"– As I understand the current situation, it is generally accepted that there HAS been SOME addition of new threads, as well as some contamination otherwise, to the Shroud. Three questions:\n1. Does the age gradient go in the right direction — from young to old as measured from outside to inside?\n2.Could the COMBINATION of new threads, and contamination otherwise, account for 1300 years?\n3. How many years WOULD be accounted for by the accepted new thread/contamination combination?\n\n","date":"March 8, 2015 at 12:38 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"author":"richard_savage","post":"– I probably missed something (above) dealing with the following — but Michael Ehrlich, head man at “Without a Trace,” told me on the phone that French Weaving required using only thread from the original cloth (taken from less noticeable areas) to do the reweave.  If I understood that correctly, French Weaving should have little (if any) effect on the C14 date.\n\n","date":"October 7, 2013 at 11:26 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"author":"richard_savage","post":"Sorry Max.  I can’t seem to find it…\n\n","date":"October 7, 2013 at 4:12 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"author":"richard_savage","post":"Max,\n– Thanks.\nJoe,\n1. So far, it appears — to me — that while the French Weaving described by Michael Ehrlich was not fully applied to the Shroud, IT COULD HAVE BEEN largely applied (the only diversion being the failure to use original material for the reweaving).\n2) I would have said that the French Weave technique “WAS PROBABLY, largely, applied,” except I can’t explain Hugh’s results…\n– What do you think?\n\n","date":"October 8, 2013 at 9:40 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"author":"richard_savage","post":"– Do we have any better idea as to when this DVD will be available to us?\n– Will we be able to get an English translation?\n\n","date":"October 30, 2012 at 11:30 am","url":"https://shroudstory.com/2012/10/30/another-article-on-francesca-saracinos-la-notte-della-sindone-documentary/","cat":"carbon_14_dating","title":"Another Article on Francesca Saracino’s “La notte della Sindone” Documentary"},{"author":"richard_savage","post":"Max,\n– Could these techniques account for the (apparent) uninterrupted banding through the sample area?\n– Can you give me the date in June?\n– Thanks.\n— Rich\n\n","date":"August 15, 2013 at 9:54 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","title":"How can any true scientist unconditionally defend the C14 dating?"},{"author":"richard_savage","post":"OK: Maybe. Maybe the patch goes much deeper than everyone thought, with new vs old threads ratio gradually changing. BTW: the bandings go interrupted from the main cloth to he side strip, but WE KNOW that the side strip was carefully re-attached to the main cloth. So perhaps it is possible.\nOK,\n– I had never seen the “deeper” possibility discussed.  Can you refer me to something?\n\n","date":"August 13, 2013 at 10:25 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","title":"How can any true scientist unconditionally defend the C14 dating?"},{"author":"richard_savage","post":"– So far, the banding seems to preclude the reweave hypothesis…\n– The “deeper” idea seems reasonable to me, but since it seems that none of the experts (except OK) has mentioned that as an explanation, there is probably a good reason not to.\n– Any one have any suggestions re “deeper” or otherwise?\n\n","date":"August 13, 2013 at 12:27 pm","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","title":"How can any true scientist unconditionally defend the C14 dating?"},{"author":"richard_savage","post":"OK,\n– Sorry to keep after this issue, but\n1) I don’t really understand how   “BTW: the bandings go UNINTERRUPTED from the main cloth to he side strip, but WE KNOW that the side strip was carefully re-attached to the main cloth. So perhaps it is possible.”   supports a potential reweave in the sample area.  And,\n2) I have read the two papers you site (more than once), but don’t see them explaining how a reweave wouldn’t interrupt the banding.  I’ll go back and look harder.\n— Rich\n\n","date":"August 13, 2013 at 4:19 pm","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","title":"How can any true scientist unconditionally defend the C14 dating?"},{"author":"richard_savage","post":"OK,\n– Thanks again.\n– So far, the “deeper” idea is my best hope for explaining the banding without discarding the reweave theory.  Though, I actually use the idea in a second way…\n– Perhaps, the reweave was done in such a way so as to not disturb the banding — like the reweave was simply done on top of the original material.  I’m sort of “reaching” here, but it’s the best I can do. \n– Anybody else have a potential explanation for the banding apparently continuing through the sample area?\n— Rich\n\n","date":"August 15, 2013 at 9:22 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","title":"How can any true scientist unconditionally defend the C14 dating?"},{"author":"richard_savage","post":"– At this point (10/3/2012), I can’t seem to get a coherent version of Oxley’s paper.  http://www.shroud.com/pdfs/oxley.pdf only gets me hieroglyphics.  Any suggestions?\n— Rich\n\n","date":"October 3, 2012 at 8:36 pm","url":"https://shroudstory.com/2011/01/21/mark-oxleys-paper-is-a-must-read/","cat":"carbon_14_dating","title":"Mark Oxley’s Paper is a Must Read"},{"author":"richard_savage","post":"Ron,\n– Unfortunately, you are speaking to a computer neanderthal.  Though I’ve been using computers since the late 70’s, I seem to have learned about them only what’s been forced upon me.  I don’t seem to have the “acrobat” reader; I just have the “Adobe Reader.”  Is that good enough?\n– And then, to be honest, I don’t know what, exactly, my “settings” are, or how to reset them to default…  You can see my problem…\n– But, don’t feel obliged to teach me — it’s something I should have been doing FOR MYSELF all along.  I’ve been immature for a long time.\n– Unless you have a possible quick solution, no worries — I should quit being lazy, and figure this out for myself.  For someone as backwards as me, bringing him up to speed through email should be quite difficult.\n– Someone had directed me to Oxley’s paper.  In Googling it, I was quickly sent to Dan’s blog — and here I am.\n– I’ll let you know of my progress.\n— Rich\n\n","date":"October 5, 2012 at 8:00 am","url":"https://shroudstory.com/2011/01/21/mark-oxleys-paper-is-a-must-read/","cat":"carbon_14_dating","title":"Mark Oxley’s Paper is a Must Read"},{"author":"richard_savage","post":"Ron,\n– Also, I’m happy to be of help, and I should be able to use the comments above for my own benefit — even if I’m not able to read Oxley’s paper.  Thanks again.\n— Rich\n\n","date":"October 5, 2012 at 8:07 am","url":"https://shroudstory.com/2011/01/21/mark-oxleys-paper-is-a-must-read/","cat":"carbon_14_dating","title":"Mark Oxley’s Paper is a Must Read"},{"author":"richard_savage","post":"Cute title.\n\n","date":"July 27, 2012 at 8:14 am","url":"https://shroudstory.com/2012/07/27/savage-treatment-in-randi-land/","cat":"carbon_14_dating","title":"Savage Treatment in Randi Land"},{"author":"richard_savage","post":"– I appreciate your responses (very interesting information) and will salt them away for future use, but it’s starting to look like we don’t have a good answer to the apparent similarity of trace elements between the Raes sample and the rest of the cloth — which seems like strong evidence against the invisible re-weave hypothesis.\n– Any suggestions?\n— Rich\n\n","date":"July 28, 2012 at 11:29 am","url":"https://shroudstory.com/2012/07/27/savage-treatment-in-randi-land/","cat":"carbon_14_dating","title":"Savage Treatment in Randi Land"}],"events":[{"author":"richard_savage","post":"– Thanks Charles.  I think that’s my cue!\n– How about an ONGOING, well controlled Internet debate?\n– That’s what I propose, and try to explain, on my blog at http://shrouddebates.com and my website at http://messiahornot.com/Treatise.php.  Though, I haven’t worked on either of those sites for a long time, as I’ve been seduced into debate (as “Jabba”) on the James Randi forum at http://forums.randi.org/showthread.php?t=226761 and http://forums.randi.org/showthread.php?t=248163.  The first URL refers to the Shroud.  I haven’t done very well in the Shroud debate, but have a lot of excuses…\n– Anyway, I’m suggesting some sort of team, with one spokesperson per narrow “sub-issue.”  (For instance re “narrow sub-issue,” on the Randi forum, most recently, we’ve been debating Carbon Dating/Reweave/Percent Needed/Getting Past the Experts.)\n– Through Dan’s website — if I could somehow develop some real interest (I’ve been trying for awhile) — we could probably suit up a very serious team.  In fact, we could probably suit up multiple serious teams and deal with multiple narrow sub-issues at the same time.  While, just one narrow sub-issue at a time would be extremely tedious, but then, one spokesperson per sub-issue would seem like a necessity — at least, in the beginning, in order to “get anywhere.”\n.\n– Mostly, I think that\n1) We humans need to develop a way for adversaries to effectively “negotiate” with each other (before it’s too late).\n2) Contrary to popular opinion, ACTUALLY EFFECTIVE public debate is a real possibility — though, it would probably need to be WRITTEN, at least at the beginning.\n3) But then, actually effective public debate could prove revolutionary and could be the beginning of actually effective “negotiating” between serious adversaries.\n4) What we desperately need are some recognized scholars of the subject at hand to begin working on and promoting such a thing, and\n5) Authenticity of the Shroud is an excellent subject for the beta model….\n\n","date":"October 30, 2013 at 1:46 pm","url":"https://shroudstory.com/2013/10/30/ideas-for-conferences/","cat":"event","title":"Ideas for conferences"}],"history":[{"author":"richard_savage","post":"– I have several reasons for the dates suggested.  The first is given in Beyer, David W. “Josephus Rexamined: Unraveling the Twenty-Second Year of Tiberius,” pp. 85-96. Chronos, Kairos, Christos II: Chronological, Nativity, and Religious Studies in Memory of Ray Summers. ed. E. Jerry Vardaman. Mercer University Press: 1998. ISBN 0-86554-582-0.  This book appears to prove that there was a typo in a printing press version of Antiquities, and scholars began referring to the 20th year of Tiberius instead of the 22nd year, and consequently figured Jesus’ birth in 4 BC instead of 2 BC.\n– A good summary of the story can be found a little over halfway down the page, posted by Alleymom, at http://www.jehovahs-witness.net/jw/friends/24979/1/Christs-BirthYear#.Ur8BFyjC420.\n– If anyone is interested, I can probably dig up the data underlying my other reasons.\n\n","date":"December 28, 2013 at 1:00 pm","url":"https://shroudstory.com/2013/12/25/did-jesus-talk-funny-and-when-was-he-born/","cat":"history","title":"Did Jesus Talk Funny and When Was He Born?"}],"image":[{"author":"richard_savage","post":"– I’m missing something.  I would have thought that the “substrate” for the image on the Shroud was linen, and that everyone agreed…\n\n","date":"May 10, 2012 at 12:18 pm","url":"https://shroudstory.com/2012/05/10/richard-dawkins-challenge-no-consensus-on-the-image-substrate/","cat":"image_theory","title":"Richard Dawkins Challenge:  No Consensus on the Image Substrate"}],"misc":[{"author":"richard_savage","post":"Ron,\n– Thanks, anyway.  Check in on us again when you get a chance.\n— Jabba\n\n","date":"March 26, 2012 at 6:46 am","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","title":"A Guest Posting by “Jabba” (Rich Savage)"},{"author":"richard_savage","post":"\nRon :\n…But be specific and thorough. With the c14 you may want to explain to them first, it’s fallibility and it’s propensity to errors, from it’s basic assumptions, up to written documents showing very good ‘reviews’ of the supposed peer-reviewed Nature paper. Little unknown facts such as all labs using samples of too small or of too low weight to be properly sampled, for example.\n\nRon,\n– If possible, and not too time-consuming, please point me to your favorite, appropriate article.\n– Also, what do you mean by “supposed peer-reviewed”?\n– Also, if you feel like it’s inappropriate to be going back and forth like this on Dan’s blog, my email is rsavage@nycap.rr.com.\n– Thanks, again.\n— Rich\n\n","date":"March 27, 2012 at 6:29 am","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","title":"A Guest Posting by “Jabba” (Rich Savage)"},{"author":"richard_savage","post":"\nAnnieCee :\nYes, I agree. They change topics constantly. They aren’t willing to actually DISCUSS anything. This shows their blatant dishonesty, in my opinion. You may learn some things by debating them, but it would be a miracle if they learned anything from you – because most of them aren’t interested in knowing the truth. Still, if this is what God wants you to do for now it may be worthwhile. It will certainly sharpen your own debate skills and increase your own understanding of the points involved. \nAnnie,\n– I am learning a lot, and I do doubt that any of them will change their minds — but then,\n1) one of them does seem open-minded about the issue;\n2) I’m still hoping that I can keep narrowing the focus enough so that we (most of us) can finally agree upon exactly what it is that we disagree about; and,\n3) I’ll be able to attract someone to our website where we can reduce their spokesperson to one, and (with a little luck) drum up a somewhat neutral audience.\n\nOne thing they can’t handle is anything supernatural. And yet the evidence collected so far about the Shroud indicates that something supernatural most likely DID happen in order to imprint the image on the cloth.\nMaybe you can’t exactly prove it, but they can’t disprove it either. However, they are not content to leave that alone, which is why the Shroud nags at them. And explains why people are able to sell ridiculous books that (attempt) to discredit the Shroud.\nThe Shroud is about Jesus Christ, first of all. If it is really the Shroud of Christ, then the real power in the Shroud is the story of Christ’s Passion. The whole story is THERE, a flannelgraph lesson of what Christ did for us.\n\nYeah.  I also expect it to be “supernatural,” but it should give us great pause, whether or not it’s supernatural.  An authentic Shroud makes makes Jesus extremely personal.\n– Any advice will be greatly appreciated, and my email address is rsavage@nycap.rr.com.\n– Thanks, again.\n— Rich\n\n","date":"March 27, 2012 at 8:24 am","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","title":"A Guest Posting by “Jabba” (Rich Savage)"},{"author":"richard_savage","post":"– Thanks, guys.  Looks like I’ve got my work cut out for me. \n– I would sure like to stay in touch — can we do that effectively on Dan’s blog?\n– If not, my email address is rsavage@nycap.rr.com; my Shroud blog is http://shrouddebates.com/; my attempt at a fair trial for Jesus is found at http://messiahornot.com/.\n– I’ve been involved in Internet debates since 1997, and began analyzing human debate back in 1970.  To see more about where I’m coming from, go to my Shroud blog, and especially to section #5.\n– Previously, I had been trying to recruit “team members,” for the Shroud debates I’m proposing, but it appears that actually knowledgeable “Shroudies” don’t have the time to really commit themselves to such an undertaking.  So now, I’m just looking for “advisers.”  And mostly, what I need from advisers is direction away from dead ends, and help in finding relevant information…\n– Whatever help you can provide would be greatly appreciated.\n— Rich\n\n","date":"March 30, 2012 at 10:46 am","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","title":"A Guest Posting by “Jabba” (Rich Savage)"},{"author":"richard_savage","post":"Annie,\n– Running in circles is probably my biggest problem, and I think that I know how to prevent such foolishness — it’s just hard to resist the temptation to try to answer all my opponents questions and objections as quickly as possible…\n– Instead, I should be constantly narrowing my focus — from one issue, to one “sub-issue,” to one sub-sub issue, to one sub-sub-sub-issue”, etc.  Hope that’s coherent…\n– Whatever, I’ll keep working on it.\n— Rich\n\n","date":"March 30, 2012 at 10:59 am","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","title":"A Guest Posting by “Jabba” (Rich Savage)"},{"author":"richard_savage","post":"Annie,\n– Thanks for keeping in touch.\n– I would love to watch O’Reilly’s report — but, I don’t any have time for watching TV by myself, and Lauren (my wife) doesn’t like O’Reilly…\n– My debate opponents seem to be getting madder with each post.  That’s probably a good sign, but I still hope that I can eventually change their minds a little.\n– I doubt that any of them will accept my invitation, but I’ll probably start asking pretty soon that one of them join me on my website to continue the debate, and bring with them all their friends — as advisers and audience.  I’ll ask my friends to do the same, and we could end up with a pretty neutral audience — and with a little luck begin to attract undecided viewers…\n– I’d better get to my chores.\n— Rich\n\n","date":"March 31, 2012 at 1:42 pm","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","title":"A Guest Posting by “Jabba” (Rich Savage)"},{"author":"richard_savage","post":"Thanks, Annie.  I can use all the encouragement I can get.\n— Jabba\n\n","date":"March 26, 2012 at 3:40 pm","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","title":"A Guest Posting by “Jabba” (Rich Savage)"},{"author":"richard_savage","post":"Ron and Annie,\n– I don’t have time to address your points tonight, but I’ll be back tomorrow.  So, don’t go away.\n— Rich\n\n","date":"March 26, 2012 at 8:53 pm","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","title":"A Guest Posting by “Jabba” (Rich Savage)"},{"author":"richard_savage","post":"Ron,\n– I’m responding experimentally — hopefully, the format I’ll be trying will be effective.\n\nRon :\nRichard, seeing as these athiests seem to attack you on all fronts, never really giving you a chance to direct yourself to one area (A typical strategy by the way). Here’s a tip; Attack them directly at their strongest points for inauthenticity and don’t waver from this strategy.They don’t have many points;…\n– I fully agree.  In fact, that’s exactly what I’m trying to do.  I’ve asked them to tell me which sub-sub-etc-issue to address first.  Without having a singular spokesperson, however, they’ve given me numerous sub…issues to address, and I’ve had to pare them down  to one.  At this point, it’s carbon dating/non-representative section/problematic selection…  Hopefully, that’s decipherable.\n– If it is, and if you have a favorite article (or two) regarding that sub-issue, please point me to it (them).\n— Rich\n\n","date":"March 27, 2012 at 6:17 am","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","title":"A Guest Posting by “Jabba” (Rich Savage)"},{"author":"richard_savage","post":"– Would you exist if your parents had never met?  How about if either of your two sets of grandparents had never met?  Etc?\n– Your dad probably produced a quintillion or so sperm cells in his lifetime, and your mom probably had several hundred ovum.  Would you exist if your particular sperm cell had not met up with your particular ovum?\n– What about all the kids that your Dads sperm cells and Cleopatra’s ovum could have created?\n– How many potential souls (selves, individual consciousnesses) are there?\n– What’s the probability that the time of your existence would be now?\n– Did you HAVE to exist?\n– Why are you a “self”?\n\n","date":"July 23, 2013 at 2:45 pm","url":"https://shroudstory.com/2013/07/23/a-point-now-where-science-and-religion-are-in-fact-treading-on-the-same-ground/","cat":"news_&_views","title":"A point now where science and religion are in fact treading on the same ground"},{"author":"richard_savage","post":"Yannick, Sorry about that!  ;-)\n\n","date":"July 23, 2013 at 3:32 pm","url":"https://shroudstory.com/2013/07/23/a-point-now-where-science-and-religion-are-in-fact-treading-on-the-same-ground/","cat":"news_&_views","title":"A point now where science and religion are in fact treading on the same ground"},{"author":"richard_savage","post":"Dan,\n– The following is something I posted at\nhttp://forums.randi.org/showthread.php?t=226761&page=26 on the James Randi forum for skeptics of everything.\n1. In regard to doubting Rogers’ honesty (as was suggested in this thread), we have little or no reason to do that. Perhaps he was wrong in his conclusions, but we have no significant reason to doubt his honesty regarding them. It’s clearly possible that he was being dishonest, but the available evidence supports his honesty much more than it undermines his honesty.\n2. The scientific processes surrounding the carbon dating were not especially rigorous.\n3. Rogers found 3 major differences between the carbon dating (and Raes) samples and the rest of the cloth.\n4. In 2005, John L. Brown of the Georgia Institute of Technology confirmed Rogers’ findings.\n5. In 2008, a group from the Los Alamos National Naboratories also confirmed Rogers’ findings.\n6. Other scientific evidence supports a much earlier date than that concluded by the carbon dating.\n7. Historical evidence does also.\n8. Carbon dating is not foolproof, and is only part of the evidence. \n– I’m sure that there are more reasons for doubting the carbon dating results (some of which I probably, vaguely know about). Perhaps, you and the followers of this blog could point me to them.\n– Thanks.\n\n","date":"April 15, 2012 at 1:35 pm","url":"https://shroudstory.com/2012/04/15/francis-turretin-had-long-hair/","cat":"news_&_views","title":"Francis Turretin had long hair"},{"author":"richard_savage","post":"Ron,\n– At this point, I figure that the probability of getting ANYWHERE at all on the Randi forum is about 5%.  But, I do think that I’m still learning a lot about human debate over there.\n— Rich\n\n","date":"April 16, 2012 at 10:12 am","url":"https://shroudstory.com/2012/04/15/francis-turretin-had-long-hair/","cat":"news_&_views","title":"Francis Turretin had long hair"},{"author":"richard_savage","post":"John,\n– I just now read your April 14 post, and tried to reply — but didn’t seem able to.  Your comment above gives me another chance.  Mostly, I’d like to get in touch, and ask for your help…  You and I seem to be ‘writing the same book’ — only you’re much further along.\n– I have two unpopular websites: http://messiahornot.com/ and http://shrouddebates.com/.\n– My email address is rsavage@nycap.rr.com.\n– If you have the time, please take a look at my sites and get in touch.\n– On the first site, I have an old section on the Shroud that I will now try to rush over and update.\n– Whatever, thanks.\n— Rich\n\n","date":"April 16, 2012 at 11:09 am","url":"https://shroudstory.com/2012/04/15/francis-turretin-had-long-hair/","cat":"news_&_views","title":"Francis Turretin had long hair"},{"author":"richard_savage","post":"John,\n– Would you consider coming over to JREF for awhile?  I think that you know a lot more about the shroud than do I.\n– Plus, you could tell them that courtroom concepts that I’ve been advocating are altogether appropriate for debates about scientific issues…\n– Thanks.\n— Rich (Jabba)\n\n","date":"July 1, 2013 at 8:34 am","url":"https://shroudstory.com/2013/07/01/jref-catholics-answers-and-the-like/","cat":"news_&_views","title":"JREF, Catholics Answers and the like"},{"author":"richard_savage","post":"\nJohn Klotz :\nIt’s tempting but I have to take a pass for a few months. My family is leaving for a joint vacation in four days and I start a trial (hopefully) two days after I return. It’s a chancy thing but very important to my client and me. After trial hpoefully I’ll be able to finish my manuscript completely with out too much further delay. I’ve been at it for two years.\nBut thanks for the invite Rich. when I am ready, I’ll jump in with both feet. I you like, E-Mail me at klotzlaw@gmail.com and I’ll try to keep you up to date.\n\nJohn,\n– That’s a shame (for me).  Hurry back, and good luck with the trial.\n– I have two websites (http://messiahornot.com/ and http://shrouddebates.com/) that I’ve pretty much left fallow since logging onto the Randi forum.  In each site, I give an explanation of my alleged courtroom method for insuring actually effective public debate.  Each site  presents its own perspective, so it would be useful for anyone trying to understand what I’m trying to say to read both variations…  In other words, I’m asking you to let me know what you think of my alleged method — when you get the chance.\n– Thanks.\n— Rich\n\n","date":"July 1, 2013 at 12:56 pm","url":"https://shroudstory.com/2013/07/01/jref-catholics-answers-and-the-like/","cat":"news_&_views","title":"JREF, Catholics Answers and the like"},{"author":"richard_savage","post":"AMEN…\n\n","date":"July 1, 2013 at 1:13 pm","url":"https://shroudstory.com/2013/07/01/jref-catholics-answers-and-the-like/","cat":"news_&_views","title":"JREF, Catholics Answers and the like"},{"author":"richard_savage","post":"Paulette,\n– I do agree, but do keep learning more about the Shroud and hope to eventually make some headway, even over there.  Somewhere in these current comments, I give John Klotz the addresses of my two websites in which I provide two different versions of an explanation of my alleged method for insuring actually effective public debate.  I would encourage you, also, to take a look at what I’m trying to do and give me your thoughts.\n— Rich\n\n","date":"July 1, 2013 at 1:09 pm","url":"https://shroudstory.com/2013/07/01/jref-catholics-answers-and-the-like/","cat":"news_&_views","title":"JREF, Catholics Answers and the like"},{"author":"richard_savage","post":"Chris,\n– Thanks for the invite.  Sounds good to me.  I could use a few of both…  But then, how do I get there?\n— Rich\n\n","date":"July 1, 2013 at 4:35 pm","url":"https://shroudstory.com/2013/07/01/jref-catholics-answers-and-the-like/","cat":"news_&_views","title":"JREF, Catholics Answers and the like"},{"author":"richard_savage","post":"It won’t be easy.\n— Rich\n\n","date":"May 2, 2012 at 1:26 pm","url":"https://shroudstory.com/2012/05/02/shroud-debates-progress/","cat":"news_&_views","title":"Shroud Debates Progress"}],"opinion":[{"author":"richard_savage","post":"Anoxie,\n– That seems to be the only one they really depend upon.\n– Sorry that I didn’t get back to yo sooner.\n— Rich\n\nPassing Stranger :\nRight……..\nSo why have neither Rick (who “hid behind the pseudonym” of Jabba) no any other shroudie dealt with the evidence for the medieval origin of the shroud. At JREF or elsewhere…","date":"September 27, 2012 at 11:12 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"Carlos and ncalibey,\n– Thanks.\n– Unfortunately, the Google translation is hard to understand.  I speak a little Spanish, but not enough to help.\n– Basically, I think that Carlos is saying that the sample was a very bad choice.  I agree — but still, the experts seemed satisfied with it — and claim, or at least imply, that the sample itself was not a patch.  Certainly, there seems to be a patching involved, but the experts seem to accept that the attached patch is the real thing, and not a reweave — and, they should know.\n– Hopefully, that can be translated into Spanish well enough to make sense.\n– Below, I tried to add the images and their explanation, but could only add the explanation. Anyone wanting to see the images will have to go to Carlos’ blog at http://lasabanaylosescepticos.blogspot.com.es/2006/01/la-zona-de-donde-se-cort.html. \n— Rich\n“The top photo in b / n shows the area of the sheet before being cut strip 1cm x 7 cm and weighing 150 mg.\n“The bottom photo shows the area in color and cut.\n“The cut was much higher amount, 478.1 mg indicated the electronic balance (Mettler, model AE 166, exactness 0.1 mg) to weigh the piece Prof.Testore G.Riggi had cut from the Shroud. More than three times as agreed in the Protocol and what relates Nature, 150 mg.\n“[entire event was videotaped, except for the introduction of samples in containers made solo and Cardinal Ballestrero Dr.Tite].”\n— Rich\n\n","date":"September 25, 2012 at 11:54 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"Carlos,\n– Are these images from the Zurich sample?\n– Are they “official”?  That is, can we CONFIRM that they are images from the Zurich sample?  For some reason, the article doesn’t really explain what we’re looking at.\n– The different sections of the sample seem to show several different weaves — but, I don’t understand what that is supposed to indicate.  Does it just indicate that some patching had been done within the sample?  If so, shouldn’t that be enough to reject the sample, and shouldn’t the experts have noticed that problem early on?\n— Richard\nCarlos,\n– ¿Son estas imágenes de la muestra Zurich?\n– ¿Son “oficial”? Es decir, podemos CONFIMAR que se trata de imágenes de la muestra de Zurich? Por alguna razón, el artículo no explica realmente lo que estamos viendo.\n– Las distintas secciones de la muestra parecen mostrar varios tejidos diferentes – pero, no entiendo lo que se supone que indica. ¿Se acaba de indicar que algunos parches que se había hecho en la muestra? Si es así, no debe ser suficiente para que rechazar la muestra, y no se debe a los expertos han notado que problema desde el principio?\n— Ricardo\n\n","date":"September 25, 2012 at 6:31 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"Ron,\n– May I quote you over in the Randi forum?\n– I’d have to remove what I consider to be “inciting” words — lol, farce, fiasco.\n– I wouldn’t use your name if you didn’t want me to, but I would point out that it comes from Dan’s blog.\n— Rich\n\n","date":"September 25, 2012 at 8:32 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"Carlos,\n– May I quote you over in the Randi forum?\n— Rich\n\n","date":"September 26, 2012 at 6:03 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"– Interesting.\n– I should have known that I’d have difficulty just keeping up — even over here, in a friendly (to me) atmosphere.  I suppose that I’m naturally slow in trying to express my responses to what anyone says, and now I have several responses to which to respond — each of my responses likely to provoke multiple more responses themselves.  Consequently, I quickly develop a quickly growing exponential tree of responses to which I need, or just want, to respond…\n– And NOW, counting the Randi forum, I’m quickly growing TWO exponential trees of responses to which I need, or just want, to respond…\n– In my proposed model for actually effective debate, each side has a single spokesperson with his/her own sub-thread where he/she directs the conversation and tells his/her opponent which response to answer next.  Both sides accept that the process will be tedious, but POTENTIALLY EFFECTIVE — which would be revolutionary…\n– What we’re having over here is not an OVERALL debate, but there are, and will be, numerous moments of needed clarification, reservation and, even, objection.\n– Anyway, I have some pressing chores to get done — but, I’ll be back to begin addressing the various responses that need addressing.\n— Rich\n\n","date":"September 26, 2012 at 10:38 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"\nRon :\nNo problem, but why leave out fiasco or farce? …as, it is fact ;-)\nDid you ever get around to reading those papers I mentioned a while back? Seriously Rich if your going to debate anything, you should study up extensively on the subject. These things I just mentioned, I would think would be common knowledge to anyone serious about the Shroud or Sindonology.\nRemember knowledge is power….In almost every post I read on there by your ‘opponents’, I noticed major errors. It is obvious most are not well read on the subject, but you must be, if you want to be taken seriously…and shown respect.\nR\n\nRon,\n– I’m not sure to which papers you’re referring. \n– I suspect that some of what I’ve said in previous posts has made it appear that I have read much less than I have.  I asked to quote you in addressing the Randi forum — even though I knew about almost all of the issues you raised, and had already pointed out many of them in the Randi forum myself — because I had failed to include some of them, and I liked the way you had put them all together.\n– In addition,\n1) I’m getting pretty old (70), and my memory simply isn’t what it used to be.\n2) I think that compared to the mean human population, my memory for specifics (which is what’s important in arguing a case) has always been in the lowest quartile — though I seem to do fine with generalities…\n3) Though I include about 60 links about the Shroud at http://messiahornot.com/Bibliography.php, and have 25 more on a separate spreadsheet, I haven’t done a good job of compiling an actually useful “bibliography” — never recording many of the links I’ve used, and poorly describing what I have recorded.  I was directed to “Evernote,” and did download it, but haven’t found the time to actually learn how to use it.  And,\n4) What makes this failure (to develop a useful bibliography) such a big problem over in the Randi forum is the exponential tree (I addressed in my last post above) of responses that I need, or want, to answer over there, leaving me overwhelmed with the need to track down old sources — as well as new sources.\n– Whatever — thanks for the help, I’ll use your post over there and will greatly appreciate any more help you can give me as we go along…\n— Rich\n\n","date":"September 26, 2012 at 5:52 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"– Thanks, Ron.\n– I now remember you saying something about the “separate roots.”  I don’t really remember those specific words, but I do remember the warning in general…  You were right.\n– I’ve actually TRIED to do exactly what you suggest above, but it isn’t easy.\n– For one thing, I will forget my objective of focusing on one aspect at a time, and respond to something that seems especially provocative — and, also easy to answer — but, that provokes multiple responses from the other side…  Hard to keep my cool.\n– I also have NOTES all over the place, but not in the easily accessible list that you imply. I’ll try to gather up the last twenty or so, and make that my list.  That should help me to let them go unanswered for “now.”\n– I do think that I’m still learning a lot about human debate.  I include “human” here cause it has to do with human nature.\n– Thanks for your help — it’s probably exactly what I need.\n— Rich\n\n","date":"September 28, 2012 at 9:19 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"\nRichard Savage :\nAnoxie,\n– That seems to be the only one they really depend upon.\n– Sorry that I didn’t get back to yo sooner.\n— Rich\n\n– The above is all I meant to say in my previous post.  Sorry about the extra.\n– Hopefully, I’m doing this right…\n— Rich","date":"September 27, 2012 at 11:17 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"– Apparently, I wasn’t doing it right.  Oh well…\n– I’ll try to go back to anoxie’s early post, and answer it there.\n— Rich\n\n","date":"September 27, 2012 at 11:22 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"\nPassing Stranger :\nRight……..\nSo why have neither Rick (who “hid behind the pseudonym” of Jabba) no any other shroudie dealt with the evidence for the medieval origin of the shroud. At JREF or elsewhere…\n\nPassing Stranger,\n– I wasn’t hiding.  “Jabba” has been my preferred pseudonym “forever,” and I just figured that “everybody” used a pseudonym…\n– I’ve tried to explain my tardiness over there — regarding dealing with the different claims of evidence — numerous times, but no one has  taken my excuses seriously…\n– I will get to those claims of evidence, and my own claims of evidence, as I can find the time.\n– I think that the other “Shroudies” have preferred to avoid the REACTION to Shroudies at JREF.\n— Rich\n\n","date":"September 27, 2012 at 11:52 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"Daveb and Ron,\n– You’re both right, of course… \n– Let’s see if I can explain why I wish to continue in the Randi forum, in spite of the situation over there.  (I know that I’ll sound like some kind of nut, but I honestly believe what I’m about to say…  Or at least, I honestly believe that I believe what I’m about to say.)\n– My first general reason for wanting to continue is HOW IMPORTANT I perceive my two basic goals to be.  I think that\n1) A METHOD FOR ENSURING ACTUALLY EFFECTIVE DEBATE WOULD BE REVOLUTIONARY,\n2) AS WOULD A GENERAL SCIENTIFIC ACCEPTANCE THAT THE SHROUD IS PROBABLY GENUINE…\n– My second general reason is that I think that both are quite possible…\n– Now, even though most of the posts from my opponents over on the Randi forum are basically just insults, some of the posts include “accusations” that seem at least somewhat reasonable.  I had wanted to unearth the reasonable accusations against Shroud authenticity, and see if we could effectively refute them — and these guys are happy to spell out just what the accusations are.\n– And then, there is at least one guy over there that seems to be genuinely seeking the truth\nabout the Shroud — and others that might be close.  If I can give them some good answers to their reservations, they might actually begin to rethink.  I think that would be a giant step in the right direction.\n– Also, they are somewhat correct about my inability to present satisfactory evidence myself – just that I have a lot of excuses and these guys don’t recognize (or admit?) the validity of my excuses…\n– Probably, my Number One excuse, is the exponential growth of responses to which I need, or at least wish, to respond.  Whatever my response, it tends to trigger numerous new, often provocative, responses .  I keep thinking that if I can just stay on point — instead of being seduced off the trail, we will eventually make some progress…\n– Unfortunately, even responding to you guys takes me off point…\n– And then,\n1. The Randi forum seems to be an extremely popular and respected (by skeptics) advocate for skepticism in general.\n2. The aim of my method for debate is not to enlighten my opponents.  My aim is to attract a large audience, and enlighten THEM.\n3. I think that if we can develop just a SLIGHTLY effective debate between us and those on the Randi forum, we have the beginnings of something important.  That is,\n3.1. I can’t fully impose my method on their current forum – so, even if I’m right about the overall method, I can’t expect to directly accomplish a whole lot over there, as things stand.\n3.2. But then, if I can show just a little bit of “progress” (defined below) over there, and keep working on it, I might eventually be able to convince the administrators over there to allow for an experimental thread using my suggested method.\n3.3. Maybe, I could convince Dan, or another one of our leaders to “sponsor” such a debate in front of a large audience on whatever website.\n3.4. Whatever, I sure think that someone with some influence needs to be researching the possibility of actually effective debate.\n(“Progress” being the explicit isolation of BASIC disagreements — where the two sides don’t have anything further to add re the particular, specific, disagreement, and can thereby agree to disagree for now re that particular disagreement – thereby, allowing the audience to best judge that particular disagreement for themselves.  Progress does not require “enlightenment” of one of the opponents.)\n– I’d best get back on point.\n– Thanks.\n— Rich\n\n","date":"October 2, 2012 at 8:50 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"\nanoxie :\nThere has been no chemical or physical analysis of the samples before c14 datation.\nYou can’t draw any conclusion on the nature of the samples based on Nature’s article.\nDo they have any other source ?\n\nanoxie,\n– Do we basically know that neither Flury-Lemberg or anyone else did no chemical or physical analysis of the samples before c14 datation, or is it that they just haven’t told us specifically what they did in accepting the samples?\n– But also, what did the 78 STURP research say about that particular area?\n— Rich\n\n","date":"October 2, 2012 at 10:51 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"Ron,\n– The ultimate goal is to get our debate in front of a neutral audience — people who haven’t made up their minds — and let them chose for themselves who is making the most sense.\n— Rich\n\n","date":"September 22, 2012 at 8:02 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"anoxie,\n– Thanks again.  I’ll do as you suggest.\n– Mostly, I wanted to know what STURP said about that corner.  Did they say anything that would support a patch theory, or that the area is anomalous?  Did they do any testing on that corner that should have exposed a patch?  I’ll see what I can find.  I’ll start with “Discrepancies in the Radiocarbon Dating Area of the Turin Shroud.”\n— Rich\n\n","date":"October 9, 2012 at 7:39 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"anoxie,\n– Thanks a lot, again.\n– I’ll pass this on.\n– Do you know where I can get more specific info from STURP re that corner?\n— Rich\n\n","date":"October 8, 2012 at 8:17 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"anoxie,\n– Woops.  Unfortunately, that link didn’t work.\n— Rich\n\n","date":"October 9, 2012 at 7:41 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"anoxie,\n– Thanks.\n– Got it.\n– Got my work cut out for me.\n— Rich\n\n","date":"October 10, 2012 at 9:17 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"Anoxie,\n` I didn’t really understand what you said — immediately above — but, I’m about to give up on the patch theory for now anyway — unless you, or someone else knows a way around what I discovered yesterday.  I’ll explain in my next post.\n— Rich\n\n","date":"October 19, 2012 at 11:06 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"anoxie,\n– Re the “dead end.”  I don’t really expect to convince any of my opponents on the Randi forum that any of my “contrary” claims are correct…  Instead, I’m vaguely hoping to use that thread to show a somewhat neutral audience that my claims are correct.  I’m also getting some much needed on-the-job training — I have what I believe to be the “basics” of effective debate; what I’m learning through the Randi debate is some of the details.\n– Obviously, I have a lot of explaining to do — but for now, I need to go take a nap…\n– Just to keep the Randi thread handy, you can find it at http://forums.randi.org/showthread.php?t=226761&page=90.\n– Thanks, again.\n— Rich\n\n","date":"October 15, 2012 at 8:34 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"Anoxie,\n– But, as far as I know, Ehrlich is the only expert who has accepted that a French re-weaving patch would be essentially invisible — and also, he is the Expert to whom Joe Marino referred in supporting his case.  And, as we look closer at what Ehrlich said, it does NOT seem to support Marino’s case.\n— Rich\n\n","date":"October 22, 2012 at 8:50 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"– Yesterday, I spoke to Michael Ehrlich, of http://withoutatrace.com/ — the expert to whom Marino and Pryor referred in 2008 (http://shroud.com/pdfs/chronology.pdf) about French Re-weaving.  He told me that the “invisibility” depended upon using only undamaged threads from the main cloth.\n– That being the case, the dating wouldn’t be affected…\n– Does anyone here have an answer to that?\n– I’ll write to Joe Marino, but I suspect that he’s too busy to answer all his emails…\n— Rich\n\n","date":"October 19, 2012 at 11:19 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"Anoxie,\n– I wrote to Joe a couple of days ago.  So far he hasn’t responded.  I figure that Joe only has enough time to respond to a small percentage of his incoming mail.  Writing to Joe must be something like writing to Rush Limbaugh.\n— Rich\n\n","date":"October 24, 2012 at 8:42 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"– The following is my current best attempt at summarizing the “first level” of claims supporting the authenticity of the Shroud.  I plan to present this list to the Randi forum.  Please let me know how you think I should revise, delete or add to my list.\n– I say “first level” because each claim below is supported by other claims — which, in turn, will be supported by more claims, etc.  For instance, the Pray Codex would be introduced and discussed under claim # 10 – and, would therefore, need not be added to THIS list.  Hopefully, at some point, I’ll get around to focusing on #10, and then, the Pray Codex…\n– I will present this to the Randi forum as a lead-in to beefing up my current focus on #11 – the reliability and validity of the carbon dating.  I present this list because my attempt at actually effective debate requires a kind of “murder board” (like they show on detective TV shows) with a diagram giving structure to the overall argument.  I hope that translates.\n1.The shroud is one of the most studied artifacts in human history.  Also, it is at least 700 years old.  Even so, no modern artist or scientist has ever been able to fully reproduce or explain it.\n2.No similar ancient artifact has ever been found.  (If this was a forgery, the genius who forged it, didn’t leave any other (what would have been extremely valuable) examples, or attempts, behind.)\n3.Though, in 1981 a mattress cover did develop a similar image when it was left on a man who had just died…  (Is this some kind of rare, but totally NATURAL, phenomenon?)\n4.Science has essentially proven that the shroud\n4.1.Is not a painting.\n4.2.Is not a photograph.\n4.3.Is 3D.\n4.4.Is holographic.\n5.The image on the shroud almost has to be some sort of imprint of someone who was recently tortured and crucified.\n6.The figure on the shroud is extremely detailed and in total agreement with the Biblical account of the crucifixion.\n7.Some of the correct detail of a victim of crucifixion could not have been known by, seen by, painted by or desired to be painted by any forger 700 years ago.\n8.The historical evidence for its early existence is actually substantial and growing.\n9.There is plenty of reasonable doubt re the validity of the 1988 carbon dating.\n10.Other than the carbon dating, the evidence against the shroud’s authenticity is really quite unimpressive.\n11.Other than the scientists involved in the carbon dating, only one involved scientist has argued that the Shroud is not authentic (Walter McCrone) – whereas, there have been numerous involved scientists that have argued the opposite.  The other notable skeptics are only in the “audience.”\n12.There is real blood on the shroud (involving some of the details noted in #7, above), and in the right places.\n13.The one involved scientist (from #11) claimed that there was no blood on the shroud.\n14.There is a barely visible second image of the face on the back of the shroud – with no discoloration between the two layers.  How would an artist do that? \n15.In effect, the shroud is a negative.  How would a forger know how to do that, be able to do that and why WOULD he do that — hundreds of years before photography was invented?\n16.One very unusual aspect of the stitching on the shroud (the side strip) has also been found on a shroud in the ruins of Masada (an ancient Israeli fortress).  Masada was destroyed in 70 CE by the Romans.\n17.Evidence of pollen and flowers — specific to Palestine in the first century — has been found on the shroud.  Other pollen evidence on the shroud fits with the shrouds traditional itinerary.\n18.Evidence of appropriate Roman coins is found on the closed eyelids of the victim.\n19.If the shroud is not the burial cloth of Jesus, its most likely explanation is that of a forgery perpetrated by space aliens.\n— Rich\n\n","date":"October 24, 2012 at 9:03 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"Anoxie,\n– Thanks again.\n– I think that the following is a good article on the hologram theory.  http://shroud3d.com/home-page/introduction-holographic-observations-in-the-shroud-image-holographic-theory.  As far as I know, this claim has not been discounted…\n– Note that in regard to the flowers and coins (#’s 17 & 18 of my claims), I only say that there is EVIDENCE of these things.  Have the claims about flowers, and/or coins, been disproven, or essentially disproven?\n– A couple of articles about the Hospice mattress cover:  http://shroud.com/pdfs/imprint.pdf and http://www.shroud.com/pdfs/mattress.pdf.\n– You’ve given me a lot of your time already, so I’m reluctant to ask for more – but, I’ll do it anyway…  Could you possibly outline your reasons for believing that the Shroud is probably authentic?\n— Rich\n\n","date":"October 25, 2012 at 7:55 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"Anoxie,\n– OK.  I’ll leave those out.\n— Rich\n\n","date":"October 25, 2012 at 5:41 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"– I think that I asked about this previously (somewhere on Dan’s blog) — but, if I did, I can’t find it…\n– According to Michael Ehrlich — the head of “Without a Trace,” the company to which Joe Marino refers when claiming that a really invisible patch is possible — the process for producing a really invisible patch requires the exclusive use of undamaged threads from the original cloth.  In other words, even if this process was used on the carbon dating sample from the Shroud, the patch should show the same age as the rest of the cloth…\n– Do we have a counter claim?\n– (I have a possibility, but don’t know that it really makes sense.)\n— Rich\n\n","date":"March 18, 2013 at 9:38 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"Anoxie,\n– Thanks — but, how do I do that?\n— Rich\n\n","date":"March 18, 2013 at 10:22 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"– Currently, I’m trying to address the claim made on the Randi forum that the involved scientists chose the sample to be taken from the Shroud.  I claimed that the scientists didn’t choose the sample — the church did, and the scientists were just forced to go along with the Church’s choice.  Here’s the argument that I eventually came up with.  I’ve probably mistated here and there, so any additions, deletions or corrections otherwise would be greatly appreciated.\n1.On 26 Aug 1974, on the urging of Ian Wilson, Walter McCrone sent a letter to Father Peter Rinaldi, S.D.B., in Turin.  In that letter, McCrone submitted a proposal to carbon date the shroud.\n2.In his book, McCrone notes that his proposal changed over the next three years, so he didn’t include the original in his book … but by 1977 at least, as you will see below, he was advocating one of the Raes samples.\n3.Harry Gove first learned of the Shroud in a letter dated 8 Jun 1977, from Reverend David Sox – the Secretary General of the British Society for the Turin Shroud (BSTS) — asking if Gove’s new carbon dating method could be applied to the Shroud.\n4.In his letter, Sox included the 1977 version of McCrone’s proposal that suggested using one of the Raes samples for dating.\n5.In July of 77, Gove responded that his new carbon dating method could be used, but that the method would require more work before it should be applied to something so “renowned” as the shroud (even though Gove hadn’t known about the shroud himself, he apparently realized that a lot of people had)…\n6.On  16 Feb 1979, Gove sent a letter to the Archbishop of Turin, Cardinal Ballestrero by way of Don Piero Coero-Borga (whoever the latter was, for whatever the reason) proposing carbon dating of the Shroud using one of the Raes samples.\n7.I can’t get the timing quite straight, or who got the idea from whom, but by 1979 Luigi Gonella, science advisor to the archbishop of Turin, was also advocating one of the Raes samples for the carbon dating.\n8.Though, Gonella may have just been following instructions from the Pontifical Academy of Sciences…\n9.At that time, STURP also accepted the suggestion.\n10.Gove’s letter (#5 above) didn’t make it to Ballestrero until years later (1984?).\n11.Somewhere in that time, Gonella changed his mind, claiming that the Raes samples had not been properly cared for and were probably too contaminated to use for the carbon dating.\n12.Gove agreed – accepting something else (what, I don’t know) instead.\n13.In 84, STURP submitted a protocol, of its own, requiring samples to be taken from 3 different areas on the Shroud.\n14.In June of 85, a summary (by David Sox) of the Trondheim protocol just indicated samples (plural).\n15.So far, I can’t find a copy of that protocol, but supposedly it specified taking samples from 3 different areas.\n16.In the fall of 86, several interested scientific groups sent representatives to Turin, and turned out the Turin Protocol, which called for 7 different tiny samples – but apparently, all adjacent to each other.\n17.This conference was organized by Harry Gove, and most of those attending the conference were associated with carbon dating labs.\n18.Together, they decided to exclude STURP and STURP’s multi-disciplinary approach.\n19.The Turin Protocol did require that the samples taken not be near any patched or charred areas.\n20.In the end (21 April 1988), Giovanni Riggi, foremost Scientific Advisor to Cardinal Ballestrero, Luigi Gonella and two linen experts, after an hour or two of debate selected one small area adjacent to the Raes sample.\n21.They made this selection even though the Raes area had appeared to involve patching, was a few inches away from an area charred by the fire of 1532, was contaminated by the water used to put out the fire, and being one of the two corners held by “volunteers” when displayed hundreds of times over the centuries had to be somewhat contaminated and not chemically representative of the greater shroud…\n22.So far, I haven’t been able to find out the limitation of their choices, nor who determined the limitations.  (I may have known at one point, but if I did, I can’t remember them now…)\n23.From William Meacham at http://shroud.wikispaces.com/CARBON.14.DATING… It is frequently reported that the original C-14 protocol drawn up at the Turin conference of 1986, jointly sponsored by the Pontifical Academy of Sciences and the Turin Archdiocese, was to have seven samples from seven different sites on the Shroud. This is incorrect. At that conference a rough compromise emerged with the protocol calling for seven samples to be taken but from only ONE sampling site. The lab directors rejected the strong resistance on the latter point from a few individuals at the conference, because in the directors’ view having two or more sampling sites increased the possibility of an outlier. They sought at all costs to have a result supported by the largest possible number of labs, primarily for public consumption.\n24.So, here’s what I think so far.\n25.At first, the scientists were thinking small – and, were trying to take advantage of the samples already tested.  They would have preferred samples from multiple areas over the shroud, but knowing the difficulty of getting approval for such samples, were happy to have SOMETHING.\n26.Most likely, they would have accepted that the results of using just the one Raes sample would be highly suspect, but under the circumstances, well worth the effort required to obtain them.\n27.Later, they realized the possibility of obtaining (slightly) more material, and began trying to advance that possibility.\n28.The Turin workshop of 86 allowed the CARBON DATING LABS to advance their own agenda/preferences – and, “the rest is history.”\n29.In other words, Scientists did first propose one of the Raes samples, but they did that because they figured that such would be easily allowed by those in charge of the decision (the Church), whereas getting anything more might be impossible.\n30.Later, when there seemed to be room for enlarging their expectations, scientists of the carbon dating mentality were in control, outvoted the remaining scientists and allowed for only a tiny sample from a highly suspect corner of the Shroud to be their target.\n\n","date":"May 21, 2013 at 8:58 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"Challenge #1:\n– Regarding the carbon dating, several claims have been made as to how the dating could be so far off if the Shroud is authentic.  I don’t think that any of those claims (explanations) “hold water.”  Let’s consider one at a time.\n– Probably the most “popular” claim is that the sample tested was actually a patch invisibly re-woven by French nuns in the 16th century.  I have several reservations to such a claim.  Let’s consider just one of those at a time…\n1.  How could such a patch get past all the experts examining the Shroud?\n– Thanks.\n— D.A. (Devil’s Advocate)\n\n","date":"September 22, 2012 at 2:14 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"author":"richard_savage","post":"– I’m leaving this reply as a reminder of a particular REASONABLE objection to Shroud authenticity raised at JREF (http://forums.randi.org/showthread.php?p=8642787#post8642787), and as a catalyst to inspire some answers.\n– Obviously, these guys don’t give any credence to the Shroud anyway — but then, they do have some reasonable objections which I hope we can answer more effectively than I have managed so far…\n— Rich\n\n","date":"September 24, 2012 at 9:39 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"}],"researchers":[{"author":"richard_savage","post":"Colins (I hope I got that right),\n– I appreciate your priorities and time constraints – I have, myself, miles to go before I sleep.\n– But anyway, have you read my ‘chapters’ 3 and 4?\n– If not, and if you get a chance, please do so – and then, rethink your decision. The debate we propose should advance very slowly and require very little of your time…\n– Whatever, thanks for the quick response.\n— Rich\n","date":"February 17, 2012 at 3:17 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/12/hello-all-you-shroud-sceptics-out-there/","cat":"cellulose","title":"Hello, all you Shroud sceptics out there"},{"author":"richard_savage","post":"Colin,\n1. Our Purpose:\n1.1. “We” are a small team of ‘commentators’ imported from http://www.shroudblog.com.\n1.2. We believe – apparently, contrary to current popular opinion – that the preponderance of evidence regarding the Shroud of Turin somehow – but clearly – favors the Shroud’s authenticity…\n1.3. (“Authentic” meaning simply that the Shroud was, in fact, the burial cloth of Jesus — at this point, we are not claiming that there is anything supernatural about the Shroud…)\n1.4. We also believe that we will be doing a great public service if we can bring our conclusion to worldly consensus.  (Such a conclusion should give anyone serious pause – whether believer or nonbeliever, and whether the image on the Shroud is supernatural or not — and should also put any sarcastic skeptics into their rightful places… which would be a good thing.)\n1.5. So, our purpose here is to show that the preponderance of evidence clearly favors shroud authenticity, and to bring that conclusion to a worldly consensus…\n– The above was taken from our website – http://shrouddebates.com/.\n– Would you like to have a friendly, patient, on-line, written debate with us?\n– You would be ‘allowed’ to recruit all the help you desired, but you would be the official spokesperson.\n— Rich Savage, rsavage@nycap.rr.com\n","date":"February 15, 2012 at 2:03 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/12/hello-all-you-shroud-sceptics-out-there/","cat":"cellulose","title":"Hello, all you Shroud sceptics out there"}],"textile":[{"author":"richard_savage","post":"Charles,,\n– Do you have that link?\n– I had thought that there were some anomalies.\n\n","date":"October 28, 2015 at 10:45 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"},{"author":"richard_savage","post":"Charles,\n– It’s me again.\n– As you know, I’m the guy you mentioned from the International Skeptics forum.  I have a lot of excuses for not answering questions — number 1 of which is that I AM the only authenticist on the forum, and for each response I give, I tend to get numerous retorts (DIFFERENT retorts).  \n– I keep asking for someone to act as a spokesperson for my adversaries, but so far, can’t get anyone to just tell me which retort (question/comment) to address next.  And, unanswered retorts keep piling up…\n– If you would come back to the forum, you could provide your own retorts, and tell me which specific retort (maybe yours) to deal with next.\n– I think that’s the way to have some actually effective debate.  I see our debate as a tree with multiple branches, each branch itself having multiple branches, each new branch having multiple branches, etc.  What we need to do is follow one ‘branching’ to its end, then drop back to its preceding branch or branching.\n– Slow and tedious, but forward — which is a lot better than fast and exciting,but in circles,\n– Your position may be correct.  If so, this is the way to show that it is.\n\n","date":"October 29, 2015 at 1:24 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"},{"author":"richard_savage","post":"Charles,\n– Don’t forget me.\n– Do you have a link to Jackson’s claim and photographs?\n– Thanks.\n\n","date":"October 29, 2015 at 10:53 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"},{"author":"richard_savage","post":"– Is Joe Marino around?  Does anyone know his current assessment regarding repair, and also regarding the banding implications?\n\n","date":"October 30, 2015 at 9:11 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"},{"author":"richard_savage","post":"Thibault,\n– Why not?\n– Thanks.\n\n","date":"October 30, 2015 at 6:44 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"},{"author":"richard_savage","post":"Thibault,\n– Thanks.\n\n","date":"November 1, 2015 at 1:03 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"},{"author":"richard_savage","post":"Thanks EK, and thanks John.\n\n","date":"October 28, 2015 at 9:58 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"},{"author":"richard_savage","post":"John,\n– My fellows came back with a retort to “If the goal of the those that repaired the corner was an invisible repair that they would per force have replicated the banding where necessary.”\n– I.e., “The banding was [b]unknown[/b] until recently so it would have been impossible for any medieval craftsman to even attempt to avoid disrupting it.”\n– Did he ‘getcha’ there?\n\n","date":"October 30, 2015 at 11:30 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"}]}
