{"misc":[{"id":"comment-44004","author":"richard_orareo","post":"Hey Dan, Sorry to say the web site is a work in progress just as the museum is a work in progress. We have not had a formal opening as yet; but it is nearly ready. The interior restoration is complete and the exterior is just starting. To be worked on. I expect completion will be a month or so away. We had a tornado touch down in the neighborhood; and lost about 15 trees, the clean up is also nearing completion. As close as we are, we are not there yet. I will let you know, Richard.","date":"2013-09-12","mins":"9:15 pm","url":"https://shroudstory.com/2013/09/12/the-wabash-shroud-of-turin-museum/","cat":"news_&_views","title":"The Wabash Shroud of Turin Museum"}],"events":[{"id":"comment-50436","author":"richard_orareo","post":"I just happen upon Barrie’s interview on EWTN right at the beginning. It was a great interview with just the right amount of humor and a perfect mix of up to date status as well as a reflection of his personal, hands on experience of being on the scene. I tried to call in during the whole hour, but couldn’t connect. Ray Downing phoned in and made it! Perfect job Barrie, Richard Orareo.","date":"2013-11-08","mins":"11:17 am","url":"https://shroudstory.com/2013/11/06/barrie-on-ewtn-liveand-again-in-repeats/","cat":"event","title":"Barrie on EWTN, Live–and again in repeats"}],"image":[{"id":"comment-83936","author":"richard_orareo","post":"Msgr. Ricci’s early books, prior to the 78 photographs opined about the gap using the Enrie photographs. Applying Occam’s razor he suggested a simple fold over, a pleat over the top of the head..","date":"2014-03-01","mins":"9:32 pm","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"}],"resources":[{"id":"comment-6378","author":"richard_orareo","post":"I JUST RETURNED FROM MY NEIGHBORHOOD BARNES AND NOBLE AND ORDERIED JOE’S BOOK. IT WAS $18 WITH NO SHIPPING CHARGE. AN EAGERLY AWAITED BARGAIN..","date":"2011-12-31","mins":"1:05 pm","url":"https://shroudstory.com/2011/12/31/new-book-wrapped-up-in-the-shroud-of-turin-chronicle-of-a-passion-by-joseph-g-marino/","cat":"books","title":"New Book: Wrapped Up in the Shroud of Turin, Chronicle of a Passion by Joseph G Marino"},{"id":"comment-30982","author":"richard_orareo","post":"Dan, In reply to John Klotz reporting on David Sox speaking about the faith of Fr. Rinaldi, I doubt that Fr. Rinaldi ever relied on the shroud as the basis of his faith. He repeatedly said that one’s faith should NOT be based on the shroud, belief in the shroud would enhance one’s faith. Further, Sox would have been referring to the early, unauthorized carbon 14 test that reported a fifth century result. At that time Fr. Rinaldi was concerned about the faith of the shroudies who relied on the shroud as the basis of their faith. Those of us who were with Dorothy Crispino at her home when Fr. Rinaldi called from Turin to inform us of the result of that C14 test can attest to that call and its content. I spoke with him on that call! Richard Orareo.","date":"2013-04-16","mins":"3:19 pm","url":"https://shroudstory.com/2013/04/13/john-klotz-unpacks-details-about-the-1988-debacle/","cat":"books","title":"John Klotz unpacks details about the 1988 debacle"},{"id":"comment-194878","author":"richard_orareo","post":"The John Walsh book brought me into the Shroud world nearly forty years ago. Since then having met many shroudies, American and European, attended many conferences and having seen the Shroud at all exhibitions since 1978. It has been a life changing experience thanks to John Walsh. He epitomized the melding of scholarship and faith, stressing the need for scientific exactitude and historical accuracy. His creativity was wide ranging and enlightening; a master of his craft. Thank you John. Richard Orareo.","date":"2015-03-30","mins":"2:18 pm","url":"https://shroudstory.com/2015/03/30/rip-john-evangelist-walsh/","cat":"books","title":"RIP John Evangelist Walsh"}],"art":[{"id":"comment-191500","author":"richard_orareo","post":"If your mindset is to demonstrate a fraud, then it is necessary to stretch, fold and otherwise manipulate time and space to make the cloth fit your mindset. Reverse your logic; the sculptor used the shroud as a model for his sarcophagus. There is no need to manipulate time, space, or the cloth. The artist simply copied the image to his sculpture..","date":"2015-02-21","mins":"1:16 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","title":"A Bas Relief Match to the Shroud of Turin Image?"}]}
