{"forgery":[{"id":"comment-3010","author":"robert","post":"It seems that my intentions were not understood. I just wanted to stress that the changes I have introduced to the article will make it different from your copy. This is probably due to the fact that I am not a native English speaker/writter. Conversely I did not feel any offense in what you have written. This being said I doubt that the embrace of Shroud authenticity was the overpowering force might have the reason why the French langage does not really make a difference in suaire/linceul. I have however not evidence to show it or to show the contrary. As to the reason why de Charny came into possession of the shroud I would like to stress that during the Middle Ages relics fabrication (or forgery) has been an industry. In his Treatise on Relics John Calvin lists at least half a dozen shrouds of Jesus, af course all given as the authentic one by their holders. Furthermore it seems that the shroud has neve been mentioned as being the ownership of Geoffroi de Charny but only as being owned by his widow Jeanne de Vergy. The tradition (what does this mean?) reports she said to have received it from her ancestors. I must however acknowlege that one cannot exclude that she could have said this because she did not want to openly make a link with Jacques de Morlay of Geoffroy de Charnay (assuming the later was indeed the uncle of his dead husband – which I am still not convinced). Beside I have also found this story ( http://h2g2.com/edited entry/A462458 ), but maybe you have already seen it..","date":"2014-02-15","mins":"9:21 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2014/02/15/how-a-cunning-14th-century-visuo-semantic-marketing-ploy-helped-establish-the-authenticity-of-the-shroud-and-corrupted-the-french-language-into-the-bargain/","cat":"alain_hourseau","title":"How a cunning 14th century visuo-semantic marketing ploy helped establish the ‘authenticity’ of the Shroud – and corrupted the French language into the bargain."},{"id":"comment-3007","author":"robert","post":"Well, having seen your comment relating to the “Suaire d’Oviedo” article in French wikipedia (to which I am a regular contributor) I have undertaken some changes to the structure of this article: https://fr.wikipedia.org/w/index.php?title=Suaire d%27 Oviedo&diff=101285115&oldid=96397135 It will definitely not look anymore as what you have shown in your blog. Now with respect to the reasons why in French the words “linceul” and “suaire” are both used for designating the shroud of Turin, it is difficult to provide a logical explanation. It is clear that they had different signification and have once meant different objects which is not really the case anymore. As I am a French speaking Belgian (who lives in Geneva) please do not ask me to answer the question “So how do the famously logical and rational French defend this uncharacteristic lapse into ambiguity?”. As a matter of fact a language changes over the centuries and French is no exception. It is therefore difficult to know whether this confusion between “suaire” and “linceul” is due to the shroud of Turin (which is indeed usually – but improperly – named “suaire de Turin” and not “linceul de Turin”) or to other reasons. One would need to get the help of a linguist to have more information on this topic. I seize this opportunity to tell you that I appreciate your blog even if I do not necessarily share all your theories. For instance if I agree that the shroud is an artifact from the 14th century I do not think that the men of the shrould could be Jacques de Molay or his fellow Geoffroy de Charnay. First of all because to the best of my knowledge all know relations of de Molay et de Charny death say they were burned at the stake. I have never read that they could have been roasted on a grill like Saint Lawrence. Beside one can also question the existence of any link between Geoffroi de Charny – named according to the French city of Charny (https://en.wikipedia.org/wiki/Charny, C%C3%B4te d%27 Or ) and Geoffroy de Charnay (there are several cities names Charnay in France). I am not aware of any records that would make a familial link between these two men. I hope my comment was not too long..","date":"2014-02-15","mins":"8:12 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2014/02/15/how-a-cunning-14th-century-visuo-semantic-marketing-ploy-helped-establish-the-authenticity-of-the-shroud-and-corrupted-the-french-language-into-the-bargain/","cat":"alain_hourseau","title":"How a cunning 14th century visuo-semantic marketing ploy helped establish the ‘authenticity’ of the Shroud – and corrupted the French language into the bargain."}],"art":[{"id":"comment-4124","author":"robert","post":"I believe these people, children all to be what I call God sensitive, we all have it to to some degree but children are much more sensitive to it, praise the Lord in the highest, may He show you and us all grace and peace!.","date":"2011-10-05","mins":"9:45 am","url":"https://shroudstory.com/2011/03/17/still-more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","title":"Still More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud"}],"history":[{"id":"comment-10480","author":"robert","post":"For my own tastes, a faith that exists prior to facts and not held up by them, is a faith not worth having. Dalton mentions the historical reasons for believing in the resurrection, like the empty tomb, and these have been important for me too. For anyone interested, here is a piece I just wrote on a particularly important slice of those historical reasons: http://subversivethinking.blogspot.co.uk/2012/04/robert perry on resurrection body.html.","date":"2012-04-17","mins":"5:16 am","url":"https://shroudstory.com/2012/04/17/the-shroud-as-reasons-to-believe-in-the-resurrection/","cat":"news_&_views","title":"The Shroud as Reasons to Believe in the Resurrection"}],"image":[{"id":"comment-6999","author":"robert","post":"Ray Rogers’ image formation hypothesis seems eminently testable. I wonder why more hasn’t been done along those lines. I’m glad to hear that he did some testing himself. Is there a place where we can learn more about whatever tests he did, and hopefully even see photos of the results?.","date":"2012-01-15","mins":"9:14 am","url":"https://shroudstory.com/2012/01/15/tough-questions-from-sciencebod/","cat":"image_theory","title":"Tough Questions from Sciencebod"}],"misc":[{"id":"comment-8090","author":"robert","post":"I must admit that, however grateful I am for this blog, I do at times feel disheartened by how harsh the rhetoric can get here, on both sides of the divide. It’s true that the skeptics seem to have an astonishingly difficult time just facing the evidence, and that does need to be pointed out. But there has to be a way of doing it while still remaining respectful. I think most believers would agree that if the Shroud is for real, then it records events which at their heart were about love. I personally feel that unless we can strive to reflect that love, even while we hold skeptics’ feet to the fire, we are not doing justice to the meaning of the cloth. We can be honoring its science while not honoring its real import. I know this is all easier said than done, but I think just setting it as an ideal can elevate the level of discourse..","date":"2012-02-09","mins":"9:17 am","url":"https://shroudstory.com/2012/02/09/more-on-dont-confuse-him-with-facts-his-mind-is-made-up/","cat":"news_&_views","title":"More on don’t confuse him with facts, his mind is made up"}],"opinion":[{"id":"comment-7497","author":"robert","post":"I just read it, too. The tone says it all. Actually, I was just going to say what Chris has: If he’s so confident, he should go ahead and make one. But maybe after he’s read a bit more about the Shroud..","date":"2012-01-25","mins":"5:42 am","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","title":"He’s back and it’s a doozy"},{"id":"comment-10804","author":"robert","post":"I have a deep interest in ND Es. I had a short piece published in the recent edition of the Journal of Near Death Studies and am working on another piece for that journal. This article was surprisingly well done, in my view, and I’m glad to know about the book it came from. Is there a relationship between the Shroud and ND Es? I think that is certainly possible. It’s what I have intuitively felt. There is a fascinating case of a woman named Anita Moorjani (her book, Dying to Be Me, was released last month and is doing very well on Amazon). After a long battle, she “died” from stage 4 lymphoma, her body riddled with tumors the size of lemons. While on the other side (her description), she was shown that she had been living in fear, while she was meant to live in love. She was told that, now that she had realized that, if she chose to go back, her body would adjust to her new love based way of being, and would heal quite quickly. This, miraculously, turned out to be true. What is particularly interesting from the standpoint of the Shroud is that she was also told that, depending on her choice to return to her body or not, test results would yield different verdicts. If she chose to stay, the results would show she died from her cancer. If she returned to her body, the results would show a cancer on the retreat. The really mind bending thing is that this test had already been done; however, the results were not yet in. When she did return to her body, it happened exactly as she was told it would. Taken at face value, her story is one in which some kind of spiritual influence came from (through?) her disembodied mind to her “dead” body, transforming that body and, what’s more, leaving an (apparently back dated) imprint on a medical test. The obvious implication is that the Shroud could have been the result of a similar kind of phenomenon (though without the “back dating” element); only, in the Shroud’s case, this phenomenon would have been taken to a much greater extreme, so that, rather than the body being healed, over weeks, of what killed it, the body would have been instantly transformed into some other order of being. So maybe the Shroud was produced by the same sort of thing as we see with Anita Moorjani, only in this case, the spiritual influx would have been far greater..","date":"2012-04-24","mins":"4:19 am","url":"https://shroudstory.com/2012/04/23/shroud-of-turin-relationship-to-nde-and-obe/","cat":"other_blogs","title":"Shroud of Turin Relationship to NDE and OBE?"}],"researchers":[{"id":"comment-7163","author":"robert","post":"I think Jackson’s hypothesis should get an open minded hearing. It does rather neatly account for a great many of the image characteristics. The requirement that a hypothesis fit current scientific theory is, in my view, unscientific, and is responsible for a host of past embarrassments, like the outright rejection of meteorites and continental drift. However, my immediate problem with Jackson’s hypothesis is that, at least in the version he has on video tape, he is clear that it leaves no room for 3 D properties on the back image, and I think it’s clear that these properties do exist on the back image, even if to a lesser degree than on the front image..","date":"2012-01-19","mins":"5:32 am","url":"https://shroudstory.com/2012/01/18/paper-chase-jones-republishes-jacksons-an-unconventional-hypothesis-to-explain-all-image-characteristics-found-on-the-shroud-image/","cat":"news_&_views","title":"Paper Chase: Jones republishes Jackson’s, \"An Unconventional Hypothesis to Explain all Image Characteristics Found on the Shroud Image\""}],"resources":[{"id":"comment-10993","author":"robert","post":"Explaining how something really could come from nothing is an incredibly hard problem. But it gets a lot easier if you redefine “nothing,” and then cast aspersions on those who want to stick with the actual meaning of the word. A nothing that can become “unstable” is not nothing..","date":"2012-04-30","mins":"9:06 am","url":"https://shroudstory.com/2012/04/30/krauss-i-dont-really-give-a-damn-what-nothing-means-to-philosophers-i-care-about-the-nothing-of-reality/","cat":"books","title":"Krauss:  I don’t really give a damn what \"nothing\" means to philosophers; I care about the \"nothing\" of reality.\""},{"id":"comment-7862","author":"robert","post":"I don’t know anything about Josh Mc Dowell’s position on the Shroud. But my experience is that right wing Protestants tend to treat the Shroud as a threat to the authority of scripture. Mining the words of scripture to understand what happened–that’s a good thing. But something outside scripture that could provide hard, physical evidence for key events reported in scripture, and could thus conceivably carry more authority than scripture–definitely not all right. It seems odd at first that even conservative Protestants who argue for the resurrection don’t mention the Shroud. They muster detailed (and I think often quite good) historical arguments as to why Jesus was actually raised. You’d think they would give their eye teeth for something like the Shroud, which could turn out to be real, scientific evidence of the very thing they are arguing for. Yet it’s not on their radar screen. The idea I relate above is the only way I have been able to explain it..","date":"2012-02-02","mins":"12:38 pm","url":"https://shroudstory.com/2012/02/02/so-what-is-josh-mcdowells-take-on-the-shroud-of-turin-these-days/","cat":"books","title":"So what is Josh McDowell’s take on the Shroud of Turin these days?"}]}
