{"blood":[{"id":"comment-214000","author":"robert_a_rucker","post":"Yes, the intensity distance relationship is just one of the evidences that something was going from the body to the shroud across the air gaps in between. As they travel through the air, sub atomic particles could be absorbed, scattered, or decay. Photons such as ultraviolet light could be absorbed or scattered. The information content that is on the shroud that defines an image of a crucified man had to come from the body, and it could only be communicated from the body to the Shroud of Turin by radiation. I will soon be publishing an article that discusses this. The title is “Information Content on the Shroud of Turin”. Bob Rucker.","date":"2015-10-31","mins":"11:27 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-214005","author":"robert_a_rucker","post":"Mat. 22:30 does not say that we will have a body like an angel in the resurrection. It does say “but are like angels in heaven” but the context is that we will not “marry nor are given in marriage”. So the meaning is that in the resurrection, we will not be married just as the angels in heaven are not married. It is also clear that Jesus in his post resurrection appearances had a physical body that could be felt (Luke 24:39, John 20:27) and he could eat food that was given to him (Luke 24:42 43). It should also be clear that our resurrection bodies will also have physicality since our resurrection bodies will be patterned after Jesus’ resurrection body (Phil. 3:20 21)..","date":"2015-10-31","mins":"11:59 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-213997","author":"robert_a_rucker","post":"Please read what I said carefully. I did not say that “the Image of the Shroud had been formed “through a neutron absorption event””. What I said was “The dating laboratories, not realizing that the shroud had been through a neutron absorption event, would have misinterpreted their result by assuming the wrong C14 decay curve.” The neutrons shifted the C14 date, but it should be clear that the neutrons did not cause the image on the Shroud of Turin. The reasoning is fairly simple. Neutrons have no electrical charge, so that they do not interact with the cloud of electrons going around the very small nucleus in the center of each atom. Neutrons only interact with an atom if they hit and interact with the nucleus, which is thousands of times smaller than the cloud of electrons going around the nucleus. This means that neutrons are highly penetrating particles. They would probably penetrate one or two feet into the limestone before being stopped. As a result, neutrons emitted from within the body would easily go through the thin cloth of the shroud. So if somehow neutrons caused the image on the inside of the cloth, then they would have also caused the same image all the way through the cloth and onto the outside of the cloth. But this is not the case so the image was not produced by neutrons. Since the image is just a surface effect, it must have been caused by something that would be stopped by just the thinnest of materials such as low energy charged particles such as protons and electrons, or by low energy photons of electromagnetic radiation in the ultraviolet energy range, which is why Lazzaro is working on experiments with ultraviolet. You make reference to Ray Rogers’ paper from 2005. Please don’t believe this paper at face value. The certainty of his statement in the abstract “It is concluded that the image could not have been involved energetic radiation of any kind; electrons, protons, alpha particles, and/or neutrons” is contradicted by the tentativeness of his statement at the end of the body of the paper “I believe that the current evidence suggests that all radiation based hypothesis for image formation will ultimately be rejected.” From this latter statement it is clear that Rogers knew that the information that he presented in his paper did not prove that radiation could not be involved in the image formation. The issue is that Rogers knew that the discoloration in the image on the Shroud of Turin could be formed by lower energy radiation than he had experimental evidence of and discussed in his paper. So how then did he know that radiation would “ultimately” be rejected? It’s because of his philosophical presupposition of naturalism. His statement “I do not believe in miracles” can be seen on youtube.com. Radiation being emitted from a dead body would be a miracle in his mind, so he just knew that it would ultimately be rejected. So why would he allow the statement in his abstract to contradict the conclusion in the body of the paper? There is no evidence that this paper was ever published or peer reviewed, and Ray Rogers died on March 8 of 2005, so he only lived for 67 days out of that year. Realize also that authors often, if not usually, write the abstract based on what they hope and think that they can prove in the body of the paper so that the abstract will act as a guide to them to keep them on track, so that they write the abstract prior to writing the body of the paper. Then after writing the body of the paper they go back and revise the abstract to reflect what was actually proven in the body of the paper. What I am suggesting is that Ray Rogers evidently never did this last step probably because of his health problems while in the process of dying of cancer. I, along with others, have completed a thorough review of Rogers 2005 paper and have documented the inadequacy of his evidence that he presented. I will soon be publishing this as a 13 page review of his 10 page 2005 paper under the title “Review of “The Shroud of Turin: Radiation Effects, Aging, and Image Formation” by Ray Rogers”. At this point, I don’t feel like searching for what Gonella said about radiation but if you could find it and include it in a reply to me, I will try to respond to it. Bob Rucker.","date":"2015-10-31","mins":"11:12 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-214017","author":"robert_a_rucker","post":"Your first sentence sounds like it is based on the assumption that it was the neutrons that caused the image on the cloth. I am not saying that and do not believe that. Please see my response above to piero..","date":"2015-10-31","mins":"3:40 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-214116","author":"robert_a_rucker","post":"For backgroud on the reasons for my statement, please see chapter 9 of Mark Antonacci’s new book titled “Test the Shroud”..","date":"2015-11-02","mins":"11:01 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-214028","author":"robert_a_rucker","post":"Experiments have shown that protons and ultraviolet light can cause discoloration similar to that found in the image on the Shroud of Turin. I think both of these are good candidates..","date":"2015-10-31","mins":"6:28 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-213918","author":"robert_a_rucker","post":"I just did an internet search and found that linen in 92% cellulose, 4% lignin, and 2% hemi cellulose. These are also the values that I used to determine the atom densities for linen that I had to input into the MCNP nuclear analysis computer code. These three compounds are composed of only carbon, hydrogen, and oxygen, with no nitrogen at all. In my search, the remaining 2% was listed as “other”, and was ignored in my MCNP calculations except for very small amounts of nitrogen and chlorine, which are down at the impurity level. Based on an email from Art Lind on 3 3 14, modern linen has 500 to 900 ppm (parts per million by weight) with an average of 650 ppm for nitrogen and 35 to 150 ppm (70 ppm average) for chlorine. Art had to know these values for his previous work (“Production of Radiocarbon by Neutron Radiation on Linen” by Lind, Antonacci, Fanti, Elmore, and Guthrie). I used a weight percent of 0.0650 for nitrogen in linen in my MCNP calculations, which is equivalent to Art’s average value of 650 ppm for nitrogen in linen. The point is that there is only a very small amount of nitrogen in linen so that even if all of the N14 were converted to C14, you would see no difference in the linen. If a different value is assumed for the nitrogen content in linen, then the results can be adjusted. For example, if only half as much N14 were present in the linen, i.e. 0.0325 wt.%, then the number of neutrons that would be required to be emitted in the body to cause a shift in the C14 date from 30 to 1260 AD at the sample location would be doubled to 6.0 x 10 E18. At the assumed nitrogen content of 0.0650 wt.% for linen, the N14 atom density input into MCNP was 2.57 E 05 atoms/b cm (atoms per barn centimeter), where a barn is 10 E 24 cm2, and is a typical unit used in the nuclear industry. The total atom density for all elements in the linen was input to MCNP as 7.05 E 02 atoms/b cm. According to Wikipedia, the atom fraction of C14 in carbon in the air is between 1.0 and 1.5 x 10 E 12, with the higher value being assumed in my calculations. This results in only 3.07 E 14 atoms/b cm of C14 in the linen. With a half life of 5730 years for the C14, the C14 atom density must be increased by only 4.93 E 15 atoms/b cm to cause a shift in the C14 date from 30 AD to 1260 AD. This is only a 16.0% increase. So only 4.93 E 15 atoms/b cm of the N14 in the linen must be converted into C14 by neutron absorption (N14 + neutron –> C14 + proton) out of the 2.57 E 05 atoms/b cm of the N14 that is in the linen. 4.93 E 15 divided by 2.57 E 05 is an atom fraction of only 1.92 E 10, so that only 0.000000192 % of the N14 that is assumed to be in the linen at 650 ppm must be converted into C14 to shift the C14 date from 30 AD to 1260 AD. This small change in the N14 content in the Shroud would not even be measurable. I hope this answers your questions. Bob Rucker.","date":"2015-10-30","mins":"8:53 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-214179","author":"robert_a_rucker","post":"As with other human bodies, the atoms that made up the human body of Jesus would have been composed of neutrons, protons, and electrons. I am suggesting that a very small fraction of these (0.000000015%) were left behind, ie. Emitted, when the body disappeared from the tomb in the resurrection. My MNCP computer code calculated that 3.0 x 10 E18 neutrons emitted from the body would be needed to shift the C14 date in the sample region from 30 to 1260 AD. Protons and electrons, as well as photons in the ultraviolet energy range, could also have been emitted from the body in the resurrection as well as neutrons. So I am saying that the neutrons would have shifted the C14 date, and the protons, electrons, and ultraviolet could have caused the image as a radiation burn. An alpa particle is a combination of two neutrons and two protons with no electrons. I am not considering the emission of alpha particles from the body at this time. Bob Rucker.","date":"2015-11-04","mins":"12:42 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-214020","author":"robert_a_rucker","post":"It is difficult to even talk about “miracle” and “super natural” because people have so many different ideas about what the words even mean. “Miracle” to many scientists simply means a violation of the laws of science, but there have been many violations of the “laws of science” in the past due to discovery of new phenomena so that the “violation” was a very natural thing and a good thing that lead to a revision of the “laws of science” to bring them into conformity with reality. So a better definition of a miracle would be a violation of the laws of science as we currently understand them. A Christian definition of a miracle might be “an event caused by God that causes awe in the beholder” but then even a flower growing might be called a miracle. The word supper natural has the same problems. Does it mean above or outside of the laws of science as we currently understand them? But the “laws of science” are not static things, but have been developed over time so that something that would have been outside of the laws of science in 1890 might not be outside of the laws of science in 2015 because the laws of science have been adjusted over the last 125 to account for the new phenomena. I think nearly everyone would consider the resurrection of Jesus to be a miracle and a super natural event but perhaps that is only from our perspective. Perhaps God used a process that was well known to him from before the foundation of the world, yet He had never used it before. So to us it would be totally outside of the laws of science as we currently know them, though it would not be new to God as all. As I see it, the main problem in Shroud research is the philosophical presupposition of naturalism, which rules out the possibility of the resurrection of Jesus as well as ruling out the possibility of radiation being emitted from within the body, which I believe is the main solution to the enigma of the Shroud. Regarding the blood having too red of appearance, I have encountered two explanations: 1) the high bilirubin content would keep the blood red, and 2) neutron irradiation of the blood may have kept the blood red. I’m not sure about either one so that both probably need further experimentation. Of course the second explanation fits in nicely with my emphasis on neutrons being emitted from within the body. Bob Rucker.","date":"2015-10-31","mins":"4:18 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-214118","author":"robert_a_rucker","post":"It sounds like you are suggesting that Radon, which is a gas, is released from the limestone of the tomb when an earthquake occurs. The radon then diffuses around in the air of the tomb until it decays presumably by neutron emission. I see several problems with this idea. First, radon 222 decays by alpha emission with a half life of 3.8 days. An alpha particle consists of two neutrons + two protons and has an electrical charge of +2. Absorption of an alpha particle in the Shroud would not cause N14 in the cloth to go to C14, so it would not have an affect on the C14 date. But even if it released neuterons instead of alpha particles, the 3.8 day halflife must also be taken into account. Since radon is a gas, it would gradually diffuse out ot the tomb through the gap between the stone and the opening of the tomb. My calculations indicate that at leaset 3.0 x 10 E18 neutrons would have to be released inside the tomb (and actually with a starting location inside the Shroud) to achieve a shift in the C14 date from 30 to 1260 AD for the sample area near the feet. I do not have the data to do the calculation right now, but I seriously doubt that enough radon atoms could be released from the limestone in an earthquake that would cause this many neutrons to be released in the tomb before it leaked out of the tomb. Next, my computer calculations show that the neutrons must be emitted uniformly inside the body in order to achieve the neutron distribution inside the tomb that could produce a slope or gradient in the C14 date of 42 to 57 years per cm across the C14 dates from the three laboratories. With the radon assumed to be emitting neutrons fairly uniformly in the air in the tomb, the date on the side bench would also be about 1260 AD for the face cloth. Thus, the slope of the C14 dates at the sample location in the Shroud and the C14 date for the Sudarium of Oeido would not be explained by radon releasing neutrons in the air in the tomb. I hope this is enough to persuade you that this is not a feasible option..","date":"2015-11-03","mins":"12:04 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-213987","author":"robert_a_rucker","post":"Perhaps you are asking whether I know of any other human bodies that have emitted neutrons from within Perhaps you are asking whether I know of any other human bodies that have emitted neutrons from within their bodies, and the answer to this question is no. Perhaps you are asking whether I know of any other linen that was exposed to neutron radiation that resulted in a shift in the C14 date, and the answer to this question is yes – see “Production of Radiocarbon by Neutron Radiation of Linen” by Art Lind, et al. The process of transporting the neutrons, slowing them down, and absorbing them is all being handled by the MCNP computer code, which has been validated and verified to NRC and DOE standards, so that all of these aspects of the issue are according to the normal laws of physics. The only thing that is not according to the laws of physics as we currently understand them is the emission of neutrons from within the dead body that was wrapped in the shroud. To put this issue into perspective, think about the estimated 7.3 billion people on earth at this time. In the trillions of times they put clothing on and take clothing off, at no time does their body leave an image on the inside of the clothing. Perhaps something like 10 billion people previously died on this planet, and probably most of them were buried in some kind cloth, yet none of them have left an image of their body on the cloth. If the process by which an image of a body can be left on cloth is a naturalistic process, then we should have seen other examples of a body image on cloth. But we only see an image of a body on cloth for one person, whose bearded naked body was very evidently crucified exactly as the New Testament gospels say that Jesus was crucified. It should be obvious that something very special and very unique is going on here. Thus, we should be open to something going on here that is outside the bounds of our current understanding of the laws of science. So yes, I believe that what science is saying from the Shroud of Turin is consistent with what the historical records (the New Testament gospels) are saying – that Jesus was raised from the dead in the resurrection. It makes sense Biblically, theologically, and physically. See Appendix H in Mark Antonacci’s new book “Test the Shroud” where Mark has included a paper that I wrote on how Jesus’ body disappeared from the tomb, where I discuss the Biblical, theological, and physical/scientific issues related to the disappearance of Jesus’ body from the tomb. This paper will be soon be published and available in two parts under the title “The Disappearance of Jesus’ Body Part 1: Biblical and Theological Considerations” and “The Disappearance of Jesus’ Body Part 2: Physical Considerations”..","date":"2015-10-31","mins":"9:51 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"}],"dating":[{"id":"comment-206006","author":"robert_a_rucker","post":"The three C 14 dating laboratories did not obtain the same value for the C 14 date of the Shroud, and more than one statistical analysis of their results indicate that there is only a 5% chance (or less) that the three values are within the measurement uncertainties of each other. It should therefore be concluded that there is probably something causing the difference. When the three values are plotted with their measurement uncertainties as a function of the distance of the sample points from the end of the Shroud, the slope or gradient to the values is obvious. I believe that I know why there is a slope to these values. Last year, I used the MCNP nuclear analysis computer code to calculate the effect of neutrons being released homogeneously from the body of Jesus in the resurrection. I reported my results at the Shroud conference in St. Louis in 2014. The title of my presentation was “MCNP Analysis of Neutrons Released from Jesus’ Body in the Resurrection.” This Power Point presentation and the narration to it are available at shroud.com or by doing a Google search on the title. In these computer calculations, when I assumed that neutrons are homogeneously released from Jesus’ body (probably due to the resurrection), my results agree with three items: the uncorrected C 14 date for the Shroud of Turin of 1260 AD, the correct slope of the C 14 date across the three sample locations, and the correct C 14 date for the Sudarium of Oveido of about 700 AD. Therefore, the three C 14 dates have a slope or gradient as a function of distance from the end of the Shroud because of the distribution that the neutrons naturally take in the tomb when they are emitted homogeneously from the body. The shape of the neutron distribution in the tomb assuming that neutrons are homogeneously emitted from Jesus’ body is a cosine shape. The sample location used in the C 14 dating was near the feet at the bottom of the Shroud. Thus, the neutron density was near a minimum at the sample location due to the cosine shape, but increasing rapidly as you move the sample point away from the end of the shroud again due to the cosine shape. So the cosine shape of the neutron distribution in the tomb explains the slope across the three C 14 dates obtained by the three laboratories. This is evidence that there were neutrons released from Jesus’ body, and if so, then some of the neutrons would have been absorbed in the N 14 in the Shroud to produce new C 14 atoms in the Shroud which would be indistinguishable from the original C 14 atoms in the Shroud, which would produce a much more recent C 14 date than the actual date for the Shroud. In other words, if Jesus was resurrected from the dead, then radiation including neutrons may have been emitted from the body in the process, and if neutrons were emitted from Jesus’ body while it was in the tomb, then C 14 dating would be expected to give a more recent date than the actual date. Robert A. Rucker (robertarucker@yahoo.com).","date":"2015-07-17","mins":"4:18 am","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","title":"BSTS Article by Hugh Farey"}],"image":[{"id":"comment-206489","author":"robert_a_rucker","post":"There is always a problem in communicating a technical subject to laymen, but I spent much time on this presentation to put the cookies on the bottom shelf if at all possible. The response of the people at the conference indicates that I succeeded in this effort, at least for the most part. Several laymen came up to me after the presentation and indicated that they were surprised, even amazed, that they understood the presentation. One couple told me this several times as I encountered them during the remainder of the conference. Admittedly, my presentation will not be understood by those only willing to put in a few minutes on it, but an hour or two of time should be sufficient. On the topic of an independent review, this is something that I very much want to obtain because it is standard operating procedure in the nuclear industry. But consider the problems in finding an appropriate peer reviewer in this situation. He or she would need to have preferably 10 to 15 years of experience in running the MCNP nuclear analysis computer code in order to check my computer calculations, and to not have worked with me on anything that I have already done in order to be an independent reviewer, and have about 50 to 100 hours of preferably full time available for the review, and have a sufficiently strong interest in the Shroud of Turin that would motivate him to be willing to work this 50 to 100 hours without charge, since I have no funding for this project. The plan for my path forward is to update my MCNP computer calculations to confirm certain technical issues with how I am running the calculations and to update my results to take into account my new understanding of the Tucson lab’s subsampling procedure. I will then write a WORD document on my results. These new calculations and the corresponding WORD document can then be used for an independent review. I will probably have to seek an appropriate peer reviewer from among my friends in the nuclear criticality safety industry that have retired. I will then have the task of persuading them to do the work for free. I hope this gives you a better understanding of the situation. Bob Rucker.","date":"2015-07-24","mins":"5:48 pm","url":"https://shroudstory.com/2015/07/17/another-reaction-to-ray-rogers-paper-on-radiation/","cat":"image_theory","title":"Another Reaction to Ray Rogers’ Paper on Radiation"}],"misc":[{"id":"comment-206001","author":"robert_a_rucker","post":"Barry Schwortz’s report on the 2014 Shroud conference in St. Louise was quoted above as saying “[There was] a presentation on another radiation theory of image formation from Robert Rucker, in this case, claiming neutron radiation released from Jesus’ body during the Resurrection created the image. Naturally, this was well received by some in the audience, but not by everyone.” Unfortunately, this statement in Barrie’s report was in error. I used the MCNP nuclear analysis computer code to determine the effect of neutrons released from Jesus’ body on the C 14 dating of the Shroud of Turin and the Sudarium of Oviedo, but I said nothing about the neutrons creating the image. In fact, I strongly believe that neutrons had nothing to do with formation of the image. I have discussed this with Barrie, and he has now corrected his statement. My presentation was titled “MCNP Analysis of Neutrons Released from Jesus’ Body in the Resurrection.” Both my Power Point slides and my narration to them area available at shroud.com or can be located by doing a Google search on the title..","date":"2015-07-17","mins":"3:06 am","url":"https://shroudstory.com/2014/12/02/the-neutron-conference/","cat":"news_&_views","title":"The Neutron Conference"}],"textile":[{"id":"comment-213875","author":"robert_a_rucker","post":"It is my opinion that enough evidence has accumulated that we should now realize that there was no invisible repair/reweave in the C14 sample area, and that the solution to the C14 dating problem is what I presented at the St. Louis conference in 2014. I showed that MCNP nuclear analysis calculations indicate that if 3.0 x 10^18 neutrons are emitted uniformly in the body while it was in the shroud in the tomb, then three mysteries related to C14 dating are solved: 1) Neutron absorption in N14 in the shroud creates new C14 in the shroud that is identical to the original C14 in the shroud so that the C14 date is shifted from 30 AD to 1260 AD. The dating laboratories, not realizing that the shroud had been through a neutron absorption event, would have misinterpreted their result by assuming the wrong C14 decay curve. 2) The results reported by the three dating laboratories were not in good agreement with each other. Statistical analysis indicates only a 5% chance that their results were within their measurement uncertainty, so that the differences were probably (95% probability?) caused by something. Plotting their results as a function of the distance from the end of the shroud indicates that there is a slope or gradient of 42 to 57 years per cm across their data depending on the sampling done in Tucson. This slope in the C14 dates from the three laboratories agrees with the MCNP nuclear analysis calculations, which calculate that a uniform neutron emission in the body causes a neutron distribution in the tomb which produces just this range in the C14 dates across the sample region, so that the disagreement between the laboratory values is the result of the slope of the neutron distribution at the sample location resulting from homogeneous emission of neutrons in the body. 3) These same MCNP calculations predict that a piece of cloth placed on the side bench about a foot in front of the back bench where the body in the shroud was located would date to about 700 AD. This location in the tomb is a natural location for the person working on the body in the tomb to lay the face/head cloth. According to tradition, the Sudarium of Oviedo is the face/head cloth of Jesus. It was C14 dated to 700 AD, in excellent agreement with the MCNP results. We should realize the importance of not making the common a priori presupposition of naturalism, so that we not automatically rule out anything that is beyond the laws of science as we currently understand them, so that we can follow the scientific evidence where it leads. When this is done, I believe that the scientific evidence indicates that the solution to the enigma of the shroud is that a burst of radiation occurred within the body that did three things: 1) It caused the image, perhaps either by protons or ultraviolet based on experiments. 2) It thrust the blood off of the body, heated it turning it into a liquid, and thrust it against and into the fibers of the shroud, and 3) It caused the shift in the C14 date from 30 to 1260 AD and the slope in the C14 dates as discussed above. Bob Rucker.","date":"2015-10-29","mins":"8:02 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"}]}
