{"misc":[{"id":"comment-103643","author":"roger","post":"The Ten Commandments are Old Testament. Can we please associate Christianity with the New??? There’s a difference between the two, no? Or else, we would not have one called “the New”….","date":"2014-04-25","mins":"11:52 am","url":"https://shroudstory.com/2014/04/25/bill-donohue-on-the-ten-commandments-the-shroud-of-turin-and-more/","cat":"news_&_views","title":"Bill Donohue on the Ten Commandments, the Shroud of Turin and More"}],"researchers":[{"id":"comment-103567","author":"roger","post":"If we would enter the Kingdom through our good works, then there would be a big bunch of God’s children (those for whom he died on the cross) who will be left outside… This idea that you need to do good deeds to merit the Kingdom is a Jewish idea (repeated some times in the New Testament by the Jewish writers) that comes from the Old Testament and they put this in Jesus mouth. Of course, the ideal in life is to do good deeds and to be merciful, but that’s not what matters the most for God (as Jesus show us on the cross when he forgives even his executioners and when he said, just prior to his Passion that once lifted up, he would attract EVERY person to him). No! What matters the most (at least for God) is simply the fact that we’re all his beloved childrens… Look : When your child do bad deeds, do you reject and condemn him for eternity or do you keep on loving him (even more than before maybe)? For God at least, be sure that he will ALWAYS choose the second option… And it’s a blessing that it is like that because I would certainly be one of those who would be left outside his Kingdom if he would be the God of Daveb! I repeat it : Doing good deeds and being merciful is what God would love to see us do all the time, but at the same time, he know perfectly well that we’re all sinners and poor people and that’s why the Kingdom is a FREE gift. A FREE GIFT. He we still keep on believing the Kingdom will only be for those who do good deeds, then we don’t believe in that it’s free and we’re simply not worthy of being called Christian and in fact, we’re just another pharisee (since this idea of a Kingdom for the good persons only was already the central belief of these Jews of Jesus time). Look again : Did St Paul received all his blessings from the Resurrected Jesus for having done good deeds? Not at all! It was a FREE GIFT of God for him and we must see this as a very great sign of the FREE GIFT God wants to give to us all….","date":"2014-04-25","mins":"8:49 am","url":"https://shroudstory.com/2014/04/25/some-advice-from-stephen-jones/","cat":"other_blogs","title":"Some Advice from Stephen Jones"},{"id":"comment-103601","author":"roger","post":"To conclude my though about judgment, I would say that another very important and Christian way to act is to try hard to keep separate our judgment concerning someone’s way to act or talk and the person himself (because this persone, whoever that is, is a beloved child of God, no matter his bad deeds)..","date":"2014-04-25","mins":"10:36 am","url":"https://shroudstory.com/2014/04/25/some-advice-from-stephen-jones/","cat":"other_blogs","title":"Some Advice from Stephen Jones"},{"id":"comment-103610","author":"roger","post":"Nice comment. I would add: it’s important to understand that we must try hard to love, while always keeping in mind that we will always be loved by God, no matter if we succeed or not. God is not only love, but eternal loving mercy for the poor people that we all are. Read again the parable of the two sons if you don’t believe me… The youngest was the first to enter into God’s Kingdom, even though all that he did was bad deeds. Same thing for St Paul: it was surely not his good deeds (or his faith) that were the reason why the Resurrected Christ visited him….","date":"2014-04-25","mins":"10:52 am","url":"https://shroudstory.com/2014/04/25/some-advice-from-stephen-jones/","cat":"other_blogs","title":"Some Advice from Stephen Jones"},{"id":"comment-103635","author":"roger","post":"Quote: “The best scientists are those who are willing to try to prove their own ideas wrong, not merely reinforce them.” Comment: I agree totally with this point of view and, concerning the question of image formation, I just want to underline with a big red marker the FACT that, on the contrary to a lot of pro Shroud researchers who have proposed image formation theories over the years (most of those are in direct link with the Resurrection of Jesus Christ), Raymond N. Rogers did just what Kelly Kearse said, i.e. He was willing to challenge his own image formation hypothesis whenever he could and was not affraid, while he was still seeking for the best explanation, to test the image formation proposals of Jackson, Fanti, Rinaudo, Moran, etc., in order to see if some of those ideas could explain, at least partially, the Shroud image. It’s interesting to note that he came out of all these tests completely empty… And isn’t that interesting also to note that we never heard of Fanti, Di Lazzaro, Rinaudo, Moran, Jackson, etc. Doing the same thing as Rogers (i.e. Doing some lab testing to see if Rogers’ hypothesis could have some chances to explain the Shroud image)? All we see from those people is endless trials to back up their ideas about image formation, which is very different from what Rogers did. This is a very good clue to judge the profesionalism of all these Shroud researchers….","date":"2014-04-25","mins":"11:39 am","url":"https://shroudstory.com/2014/04/25/some-advice-from-stephen-jones/","cat":"other_blogs","title":"Some Advice from Stephen Jones"},{"id":"comment-103638","author":"roger","post":"Oh, I forgot that we also hear sometimes from some of these researchers big trials to not only back up their personal idea about image formation but also to crush down other explanations (like the one proposed by Rogers) that doesn’t fit with their notion of what could have been the primary cause of the Shroud image….","date":"2014-04-25","mins":"11:45 am","url":"https://shroudstory.com/2014/04/25/some-advice-from-stephen-jones/","cat":"other_blogs","title":"Some Advice from Stephen Jones"},{"id":"comment-103572","author":"roger","post":"Correction: You should read “IF we still keep on believing the Kingdom will only be for those who do good deeds, then we don’t believe in that it’s free and we’re simply not worthy of being called Christian and in fact, we’re just another pharisee…”.","date":"2014-04-25","mins":"9:02 am","url":"https://shroudstory.com/2014/04/25/some-advice-from-stephen-jones/","cat":"other_blogs","title":"Some Advice from Stephen Jones"},{"id":"comment-103592","author":"roger","post":"Oh, by the way, Salvation is no more a question of faith in Jesus than a question of doing good deeds and being merciful. Again, if this would be the case, that would mean that a majority of human beings would be left outside of God’s Kingdom (including our friend Barrie Schwortz!) and that would also mean Salvation would not be free at all. The only thing that save us in the end is our being of God’s children. Life is not a passing exam. It is simply a growing process that is needed to prepare us for eternal life. To believe in Jesus can help some (like me) going through life, but that’s not an obligation in order to be saved. In fact, everyone is already saved. The only difference is that there are some who believe it while they’re still on Earth and the rest who will be face to face with this great truth when they’ll die. Some understand quicker than others… That’s the only difference and that’s not very important in the end..","date":"2014-04-25","mins":"10:03 am","url":"https://shroudstory.com/2014/04/25/some-advice-from-stephen-jones/","cat":"other_blogs","title":"Some Advice from Stephen Jones"},{"id":"comment-103579","author":"roger","post":"Don’t you know that we judge all the time? It’s an integral part of human nature… The Christian way to act is trying hard to not condemn… That’s very different. In other words, when you judge, try to understand why the person you judge is acting or talking or believing that way (there’s ALWAYS extenuating circumstances), instead of blindly condemning him to hell, eternal pain or whatever else..","date":"2014-04-25","mins":"9:18 am","url":"https://shroudstory.com/2014/04/25/some-advice-from-stephen-jones/","cat":"other_blogs","title":"Some Advice from Stephen Jones"}]}
