{"art":[{"id":"comment-3589","author":"rosanne","post":"KAC, I’m so sorry for the loss you and your wife have endured. It breaks my heart to hear your story. You are indeed a father and your wife, a mother. I will pray for you and your wife. I feel strongly that if others pray for us in our hour of need, our prayers are more likely to be heard. So if there is anyway you can ask others to pray for you and your wife to have a family, I believe God will hear your prayer. I would also like to encourage you to pray steadfastly to the Virgin Mary, the mother of all mothers. She answered my prayer for a wonderful husband and eventually a daughter. She takes our prayers to our Heavenly Father and her Son, Jesus. God bless you and your wife. And someday you will be reunited with your little one. I have yet to read the book, “Heaven Is for Real”. I’m looking forward to reading it. One of my brothers recommends it highly. I saw an interview of Akiane and saw her incredible paintings (on You Tube). What an amazing young person. We will all be so blessed to be in the presence of our Lord one day in Heaven, no matter how he appears. In the meantime, we must remember our blessings here on Earth and fulfill our purpose – love one another and keep the commandments..","date":"2011-08-13","mins":"12:15 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3732","author":"rosanne","post":"Cody, I wish I knew what your dream meant. Could the city represent all humanity? Thus, are you supposed to be thinking about others rather than yourself? Just a thought. Rosalie, I am so sorry to hear about the horrible event in your life. It hits close to home, as my grandmother was a victim of incest. In your hour of need HE – Jesus was with you. How incredible. Being Catholic, I often envision the picture of Jesus with the Sacred Heart, so I envision him, God the Father, and the Holy Spirit living in my heart. When I think of it that way, it compels me to try to do better in my life..","date":"2011-08-29","mins":"10:42 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3568","author":"rosanne","post":"In 1999, my brother committed suicide. It was very difficult for me and my siblings (7 of us) to comprehend what had happened. Many questions came up, “Did he believe in God?”, “Do you think he’s in heaven?” I believe, after much prayer that he is, indeed in heaven. He was raised Catholic but didn’t attend any organized religion as an adult. Supposedly, he considered himself agnostic. He was severely depressed when he took his life. In my attempt to understand what he went through God sent me a vision and a very real feeling of “anguish” that was so powerful, I then believed he was not to blame for his “choice” and is now in God’s loving hands. Another brother of mine, related a dream he had around the time we lost my brother. My brother was trying to understand why. My brother saw a vision of my dead brother pointing to a wooden statue of the Virgin Mary (a statue that my father made of the Virgin praying) and he told him that this is what we are here on Earth for – to pray for each other, to love each other. FAITH. One other story, I was a lonely child even though I grew up in a large family. When I was at my loneliest, I would pray to Mary and I would ask her for a husband some day. I believe that she went to God, Our Father and brought my petitions to him. I did marry an incredible man and have one lovely child. We believe we are soulmates and were chosen to be together. When I found out I was pregnant, the words just flowed out of me without even thinking. I said to my husband, “If it’s a girl, can we name her Mary?” It hadn’t been a name I even considered in my dreams. It was because of the outpouring of her love for me that it was only right to name my daughter, Mary. We need to pray for those who are being lead by the devil. The devil is real and wants as many follows as possible. I know that sounds crazy but it’s true. Pray for one another that we will be stronger and do God’s will. God bless all of you reading this..","date":"2011-08-11","mins":"1:04 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-4187","author":"rosanne","post":"MC, faith in God can be a funny thing. I’m so sorry that you feel that your prayer wasn’t answered or even acknowledged. I’ve found in life that my prayers aren’t always answered the way I think they should be answered. You are a spiritual person and the fact that you aren’t shutting him out even though you’ve felt betrayed says a lot about your faith. In fact, that is the word you used yourself, “possible renewed faith in this topic – God.” Faith is what is ultimately important, not where you go to church. My grandfather wasn’t “religious” but he was a very good man and lived a “faithful” life. As far as science is concerned, I love it too. I wish everything was black and white. I think understanding the world would be so much easier but that isn’t what life is like. We are called to be “believers”. I love the story of doubting Thomas because we have Jesus’ own words, “Blessed are those who have not seen and yet have believed.” How incredibly powerful. I love the story of your travels and the desire to photograph the churches. I’m drawn toward the beautiful images and architecture of God’s glory. When I was growing up, I felt lonely a lot and would find myself running often to a grotto that was tucked under some stairs at my parish church. It was very secluded and so peaceful. There was a statue of Mary. I’d cry my heart out to her, asking her to bring my petitions to our Lord. It gave me so much comfort. It felt like I’d never have my prayers answered. I’m guessing that it took about twenty years for things to fall into place. Give God, our Father, his Son, Jesus and the Holy Spirit a chance. If I can bestow some advice, study the lives of some of the saints (perhaps Thomas is a place to start) and then pray to them. Ask them to take your prayers to our Lord and be very patient. God bless you in this journey. Rosanne.","date":"2011-10-13","mins":"11:36 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-13990","author":"rosanne","post":"Alex, praise God that you didn’t commit suicide. I’m so glad that Jesus was there for you. My brother took his life over 12 years ago and since then have known too many beautiful people leave this world by their own hands. I feel like there is an epidemic of suicides. I’m sorry for the loss of your parent but happy to hear that Jesus was there for you. It’s wonderful that you are giving back to the youth. Your personal experiences will guide other young people to better themselves and believe in Jesus and God’s love. God bless you in all you do..","date":"2012-07-19","mins":"4:36 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
