{"image":[{"id":"comment-5222","author":"royalcanadian2011","post":"Donald, along with many other amature and/or zealous shroud enthusiasts suffers from pareidolia. That is, picking a pattern out of random information. Examples include clouds that look like elephants, or the island of Great Britain (my favorite to pick out on a spring day). We see many times what we want to see. Donald is no worse than the guys who say they found coins in the image’s eyes. As the main article mentioned, what Donald thinks of as swords and armor are simply creases, burn marks, water damage, natural graining and the light areas that show the separation of the legs. Also, the width and mass of the body seems to be the same. Wouldn’t armor significantly expand the size of the image? Unless it was skin tight (like modern athletic “armor”), We should not fault Donald, but he should not be so affended when after making bold assertions to the world, the world makes them right back. And to poor Martin, you are a long time blogger. You know the world is full of the impulsive and half informed. Humans are savages and internet discourse proves it. If you don’t like it, get out of the kitchen..","date":"2011-12-04","mins":"10:33 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor"}],"misc":[{"id":"comment-6610","author":"royalcanadian2011","post":"People are designed to seek and see god. It’s a function of our design, a predisposition. Spirituality is difficult to discuss in the modern forum ideas because materialism, and its high church sect scientism, control the Grand Inquisition of the realm. Stuff to distract us from beauty and truth, narcotics and alchohol to numb the angst of existance and perverse sexuality to tantalize the flesh and deaden any sense of the sacred have placed a shroud over the soul of western man. We can deny the existance of the sun as long as we refuse to look up, as long as we shuffle through life from one endorphine high to the next. We can deny the Son by doing the same..","date":"2012-01-06","mins":"3:28 pm","url":"https://shroudstory.com/2012/01/06/and-so-is-the-shroud-of-turin-another-so-what/","cat":"news_&_views","title":"And so, is the Shroud of Turin another “So What?”"}],"blood":[{"id":"comment-17336","author":"royalcanadian2011","post":"Tabor is a fringe theorist who makes money and prestige for himself by pushing his pet controversial theories on a heartbreakingly ill informed populace. The fact that he has hitched his his intellectual wagon to Jacobovici really should help us decide if he is qualified to call other scholars ideas into question..","date":"2012-10-08","mins":"1:55 pm","url":"https://shroudstory.com/2012/10/08/james-d-tabor-taken-aback-claims-about-the-shroud-blood-x-and-y-chromosomes/","cat":"blood_studies","title":"James D. Tabor Taken Aback:  Claims About the Shroud Blood X and Y Chromosomes"}],"resources":[{"id":"comment-9010","author":"royalcanadian2011","post":"According to researchers (Pelligrino) involved in the project, the Talpiot ossuary labled Yeshua seems not to have ever contained a full complement of bones, just a carpal bone fragment and some unusual fabrics. Carpal bones seem to be removed from the body during the gruesome crucifixion process, one was taken by those (Joseph or one of the Mary’s), plus the linens left in his tomb and placed as relics of sorts in the the ossuary. I first read this a couple years ago, it made me think that the ossuary was a rememberance or memorial to the risen Lord who was the center of the new faith. If we buy Simcha and James’ conjecture, that the jar is a fish and the inscription supports the idea of a belief in resurrection, than I think it is possible that the evidence supports the belief that Christ rose again, a belief held by those whose tomb was built nearby. Rather than solving any mysteries about the origin of Christianity, the odd couple simply have deepened the ones we all ready have. Here is a quote by Pellegrino: ” A skeleton was never placed in the (Yeshua) ossuary. The only things that appear to have been placed in the ossuary were two shrouds of unusual composition (one a burlap like material, the other flax based linen woven on a loom with a high degree of cotton contamination [consistent with the Turin Shroud but not with fina wool burial shrouds in other ossuaries and in Ttabor Gibson’s Tomb of the Shroud]) … The only bone found inside the ossuary, evidently wrapped or folded in with the shrouds, was consistent with a single metacarpal. No other biological or chemical traces of larger amounts of bone were present. … New York’s former medical examiner, Zugibe, discovered that during crucifixion he would expect several metacarpals to pop out of the wrists, like wisdom teeth. (He’s actually demonstrated this on cadavers, and compared the results with the image of the Turin man.) He noted that the metacarpal was the only bone he could think of finding in a burial cloth bearing ossuary, consistent with crucifixion as a cause of death.” Interesting….","date":"2012-03-07","mins":"12:13 am","url":"https://shroudstory.com/2012/03/05/even-more-on-archaeology-from-tabor-and-jacobovic/","cat":"books","title":"Even more on Archaeology from Tabor and Jacobovic"},{"id":"comment-9057","author":"royalcanadian2011","post":"1. The Names in the Tomb A. Paucity of Patronyms Most of the names in the tomb lack patronyms. That is, we have no idea of the relationships between the people in the tomb. This applies to “Jesus son of Joseph” and either of the Marys in the tomb. Jacobovici (and Dan Brown, another scholar) wants people to think that Jesus and one of the Marys (the one whose name allegedly reads “Mariamne,” and alleged reference to Mary Magdalene) as being married.But why not brother and sister? Aunt and nephew? Grandmother and grandson? Second cousins twice removed? No patronyms = guesswork. The same goes for any of the other names lacking patronyms. There is ZERO evidence in any ancient text that Jesus was married to anyone. For example, you can click here to watch some exciting screen capture videos of me searching the Gnostic gospels (in vain) for a Jesus’ marriage. You can see Goodacre’s list of errors in regard to the “Mariamne” red herring as well. B. The Commonality Issue Most of the names in the tomb are common. The retort to this is that the assemblage of these names in a single tomb is not common. But how would we know that? Rahmani lists 227 inscribed ossuaries, many of which are from the same tomb, and so few family tombs have actually been discovered. The most reasonable scholarly estimates of the population of first century Jerusalem at no more than 100,000, most of whom were Jews (Samuel Rocca, Herod’s Judaea [Mohr Siebeck, 2008], p. 333). So let’s say 75,000 Jews in first century Jerusalem. Numerically, there would have been many more family tombs than have been discovered, so any estimate of the rarity of any collection of names is based on navigating without instruments. The point: Rarity in terms of the data we have is not the same as rarity in terms of the data that corresponded to a first century Jerusalem reality. Not having the latter gives no warrant to substituting the former and pretending it’s the latter. That’s a little thing I like to call “cheating.” The statistical likelihood of this being Jesus’ family tomb is also greatly influenced by the name Yoseh. If this name is just a variant of the more common Joseph, the probability that the tomb is truly that of Jesus of Nazareth is 2 3%. If, on the other hand, Yoseh is a rare name, then the probability is 47%. Mark Goodacre has pointed out for years now that Yoseh and Joseph are interchanged in the gospels for the same person: The difficulty over (1) is that the names Joses and Joseph are clearly regarded as similar or the same in the New Testament. Mark 6.3 calls Jesus’ brother “Joses” while the parallel in Matt. 13.55 calls him “Joseph”. Matthew clearly regards Joseph as an alternative, preferable way of saying “Joses”. Likewise, the character who appears in Mark 15.40 and 15.47 is called Joses in Mark and Joseph the Matthean parallel (Matt. 27.56). Moreover, the fact that this character may be a different character than the brother of Jesus also witnesses against the alleged extraordinary nature of the name. The same Joseph / Joses variation is found in the texts too, and not just here in Matthew but also in Acts 4.36, Joses / Joseph Barnabas. So, if we go with the data we have for the persons actually in question (Jesus’ family) the name is not rare; it is a variant for “Joseph.” 2. Logical Coherence A. Yoseh and Judas The above issue with the name Yoseh is important for another reason. On one hand, Jacobovici would have us be breathlessly astonished with how his evidence coincides with the gospels, while on the other hand, we are to ignore where it simply is not. Goodacre succinctly notes this inconsistency in two regards: (1) They claim that “Yoseh” is significant because it is rare, a claim that does not take the New Testament evidence seriously. (2) They do not regard “Judas son of Jesus” as contradictory evidence for the identification with the Jesus family. Honestly, we are supposed to believe Jesus had a son (by Mary Magdalene) and named him JUDAS!? Yes; that is what we are asked to believe. B. Logic Check I can’t help asking what to me are some obvious questions: •This tomb was not hidden underground. Given its famous occupants, how is it that no enemy of the early church, Roman or Jewish, simply didn’t end Christianity by exhuming the bones of Jesus of Nazareth from his own tomb showing the whole thing to be a sham? •“Matthew” is a name on one of the ossuaries. So, presuming with Jacobovici that he is the Matthew who wrote the Gospel of Matthew, and that Jesus of course was long dead before he wrote it, how in the world would Matthew get away with that scam? No one local in Jerusalem knew it was a scam? Seriously.","date":"2012-03-07","mins":"11:04 pm","url":"https://shroudstory.com/2012/03/05/even-more-on-archaeology-from-tabor-and-jacobovic/","cat":"books","title":"Even more on Archaeology from Tabor and Jacobovic"},{"id":"comment-9058","author":"royalcanadian2011","post":"Hi Ron, I meant to add that, according to the medical examiner who did the research on post mortem anatomy, the carpal bones were not actually broken. They “popped out” like wisdom teeth. So the scriptures do not seem to be contradicted, which is important to me as a Christian..","date":"2012-03-07","mins":"11:32 pm","url":"https://shroudstory.com/2012/03/05/even-more-on-archaeology-from-tabor-and-jacobovic/","cat":"books","title":"Even more on Archaeology from Tabor and Jacobovic"},{"id":"comment-8863","author":"royalcanadian2011","post":"Here are some sites to visit for expert analysis on this “Just In Time for Easter” offering: http://michaelsheiser.com/Paleo Babble/ http://asorblog.org/?p=1610 http://asorblog.org/?p=1612 http://www.antoniolombatti.it/B/Blog02 11/Voci/2012/3/1 Never seen a fish depicted upside down.html Jacobovici and Tabor’s conclusions seem very “fishy” to me!.","date":"2012-03-01","mins":"1:36 pm","url":"https://shroudstory.com/2012/03/01/fasten-your-seatbelt-more-archeology-from-tabor-and-jacobovic/","cat":"books","title":"Fasten your seatbelt: More Archeology from Tabor and Jacobovic"},{"id":"comment-7103","author":"royalcanadian2011","post":"The same question could be asked of many things. Why would God send His Son to die on the cross, to be abused and tortured? Why not come down to the earth, ripping and roaring and set a shining being on a golden throne? Unfortunately, your question is really not a about the shroud. You are impugning faith, which does not belong on this forum. It exposes your motive, which is not scientific but philosophical. That being said, the answer to your question can be found in nature. God is an non finite being. His creation is finite. It has bounderies and time. A sun flower may begin as a seed. A stem grows, a bulb forms, then a flower opens recreating the seed. In the divine realm, there is no time. There is only absolute, there is only “flower”, no seeds or stems or bulbs. Evolution and physical processes are aspects of creation. Pain and suffering are simply human language descriptions of processes that all things in the universe go through, rocks and erosion, humans and broken hearts. It’s evolution, trial and error, a universe perfecting itself, moving towards its destiny ingrained within the photons that make up its building blocks. How does this relate to the shroud? As with Jesus, the Creator, the Mind behind Nature, expresses his creation as a process. What we see as flawed scientific experiments and imperfect impericalism is nothing more than the natural progression of the universe, evolution changing reality over time. God allows it as he allows any imperfection, because in the flaws we discover that perfection in possible and there exists a path that leads to it. Sciencebod is making the shroud question a matter of theology. The creator of this site has gone to great lengths to accentuate the real science behind shroud (versus campy experiments that mock authentic research). That being said, faith is bound up in the subject matter. Faith in God, faith in Christ as communicated to us through sacred scripture and the tradition of the early church. The message of the cross is truly foolishness to those who are commited to another path. We should be honest about this. If this image was of Abraham Lincoln, we would be mystified, but millions of dollars, hours of research and philosophical debate wouldn’t be aimed at it. This debate is no longer about an old piece of linen with a familiar image mysteriously imprented upon it. Sciencebod, and those like him, have perverted it into a stage for tired attacks on faith. Remember this as sciencebod continues to troll this site, as the dialogue rambles on, back and forth, smug comment after snarky comment, ending up at the point from which we began, with nothing really new brought into the discussion. His true colors bleed through his last comment and are unmistakable. This about arrogance and bigotry, not science..","date":"2012-01-17","mins":"2:26 pm","url":"https://shroudstory.com/2012/01/17/the-coming-together-of-sturp-its-a-secular-miracle/","cat":"books","title":"The coming together of STURP:  It’s a secular miracle!"}],"dating":[{"id":"comment-6586","author":"royalcanadian2011","post":"#Sciencebod. Bless your heart. You’re good little scientist, making that cute face out of charcoal and heat and calling it a mini Shroud of Turin. And your light experiment puts the folks at cern just to shame. To the grown ups and critical thinkers who know the subject and the parade of hucksters who’ve “replicated” the shroud, I can waltz into a museum and pick up a Declaration of Independence that looks and feels just like the original, with the artsy script and fauthentic aging. I could put it in frame and tell the uninitiated that it is the real deal. Nice try. Whose next? I’m making one using old coffee grounds..","date":"2012-01-06","mins":"3:08 am","url":"https://shroudstory.com/2012/01/05/tom-chivers-has-an-opportunity-to-do-some-real-investigative-journalism/","cat":"carbon_14_dating","title":"Tom Chivers has an opportunity to do some real investigative journalism"}]}
