{"dating":[{"author":"rschneider42","post":"I contacted Barrie Schwortz and talked with him about the John Morgan paper and he confirmed that the image was indeed from the Verne Miller UV-F data.  So I think we’ll have to roll back to the earlier point in the thread where we were talking about your preposterous view that just because there is a correlation in the sample region that correlates increased fluorescence with younger dates that it must mean the shroud as a whole is younger than the C14 date.   Sorry but that doesn’t follow.The question really is why there is a correlation at all with a variable that should have no relationship at all with date, a better correlation than the Bryan Walsh result which showed a spatial correlation.Apparently however, the standard of truth around here leaves something to be desired.  Cheers, –Ray","date":"March 22, 2015 at 9:46 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"author":"rschneider42","post":"BTW Hugh I agree that I should have been clearer in my presentation at St. Louis since it wasn’t clear that it was the “contamination” that fluoresced since it was equally possible that some sort of phenomena suppressed the natural fluorescence of the cloth.  Of course the additional content of this overall thread now is claiming that the image was not even a UV-F image.  If that’s true I’m not sure it changes my conclusion but it would certainly change the interpretation of the data. –Ray","date":"March 22, 2015 at 5:25 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"author":"rschneider42","post":"Actually if that is true so that Morgan’s data is on a regular photograph it would still be bizarre that it correlates better than the Brian Walsh correlation.  The non uniformity of the lighting has been discussed by Barrie in the matter of the Blue Quad Mosaic and similar non-uniformities occur in the backlite images.  Perhaps we’re just looking at a proxie for distance from the edge of the shroud.  That would explain the correlation but not the degree of correlation  If this is just a measure of reflectance instead of fluorescence then it is still peculiar that it correlates so well.  If your identification of the photograph as incorrectly communicated to Morgan then it merely changes what was measured from fluorescence to reflectance and everything else applies.  Why do we get such an excellent correlation?  Riddle me that!   — Ray","date":"March 22, 2015 at 4:46 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"author":"rschneider42","post":"I think I checked that when I did the original correlation but I don’t recall.  So what you’re saying is that because you think half of area one was reserved.  The impression I is that the part that was reserved was from the second Arizona sample.  In any case I don’t think that claim justifies dismissal of the observed correlation.  This is doubly true if in fact the sample is a reflectance image and not a fluorescence image.  Frankly I think the fact of the anomalous character of the sample has been demonstrated in spades not only by these observations but by the many others.  So this discourse even if it were true would not change the conclusion. –Ray","date":"March 22, 2015 at 5:43 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"author":"rschneider42","post":"I verified that you’re right about some fraction of the initial sample being reserved.  It’s not clear that it was half however.  That certainly is a likely modifier to the significance of the correlation although it doesn’t make it meaningless only somewhat less meaningful in my judgment.  It would have been nice if the carbon labs had been more transparent and accurate about how they managed the samples.  It would reduce the confusion.  The question becomes which half and how big an effect would be produced?  This is probably impossible to pin down.  — Ray","date":"March 22, 2015 at 10:02 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"author":"rschneider42","post":"I have to say that that message made exactly no sense to me.  The discovery of a correlation between two variables that ought not to correlate means there is something wrong with the sample which is what was to be demonstrated.  All the rest is sheer speculation.  I notice you don’t engage the data that shows positive results such as vanillin and the mechanical properties of linen.  They don’t fit your narrative?  Is that it?","date":"March 22, 2015 at 5:16 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"author":"rschneider42","post":"It’s interesting how Hugh wants to spin the data.  The fact of the matter is that a correlation coefficient that high is hard to obtain even with only three points unless there is some linkage.  As for wriggling, my main wriggle is the problem presented with the word “contamination” — we don’t know why we get a linear correlation in C14 age measured from the edge of the cloth and we don’t know why we get such a good linear correlation coefficient from the fluorescence data.  Because that is so anomalous and unexplained it is primarily evidence that there is a serious problem with the sample.  So I certainly admit to making a less than precise use of the word “contamination” — but as I pointed out the actual conclusion I drew was that the sample was inappropriate being clearly anomalous and I pointed out the other problems with it.  So I think it is altogether special pleading and not science to pretend on the one hand that the correlation didn’t mean anything and then on the other to suggest that it means the cloth is even younger than the carbon date.  I guess having your cake and eating it too is a Hugh Farey specialty.The Carbon 14 date is anomalous.  The absence of vanillin is an indicator of a much older date and the additional tests of Fanti, while they need to be further validated, all point to a much earlier date.  So the magic C14 date is not the silver bullet that invalidates the shroud’s authenticity.  There is way too much evidence on the other side of things to bet on something as frankly problematical as this bizarre C14 date with it’s high Chi-square and demonstrable deficiencies.If anyone is wriggling it looks like Hugh.  Regards, Ray—Ray Schneider, PhDAssociate Professor EmeritusBridgewater College","date":"March 22, 2015 at 4:34 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"}],"events":[{"author":"rschneider42","post":"Of course the problem of creation of the shroud in the middle ages is addressed in the lectures.  Such a creation as a minimum would appear to require actually crucifying someone which is hardly something that can be casually explained and then hidden items of fidelity would have had to be added that don’t make sense since they would not be visible such as the dirt from Jerusalem.  The early provenance of the shroud remains obscure although the many reasons for the silence are pretty obvious.  I think the Hymn of the Pearl is pretty good earth 3rd century evidence that the shroud was known.  Then the correspondences with the Sudarium of Oviedo completely destroy the C14 as well as any fabrication in the middle ages hypothesis.  To ice that of course one would need something like DNA data which would finally make the correspondences between the two cloths complete if it turns out to be feasible to do such DNA identification.","date":"March 28, 2015 at 1:34 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"author":"rschneider42","post":"I’m quite sure that there are things I left out of my presentations.  I put the whole thing together in a couple of weeks.  It was a lot of fun catching up on some of my shroud reading.  On the electric field theory, I thought it was important because it offers a means of improving the resolution of a vaporagraph type image.  It doesn’t necessarily imply a Maillard reaction.  Any oxidation might be adequate in a surface layer.  The Rogers hypothesis just offers a mechanism for a thin impurity layer which might explain the extremely superficial nature of the image.If Charles Freeman has a mechanism that is plausible or even implausible I’d be happy to include it in the future.  I have not encountered it.  In fact, when push comes to shove I’m not sure I’ve encountered a really plausible image mechanism yet.  They all seem to have substantial defects.  Some however are testable and insofar as they are tested we can get an idea of how far they fall short.I’m particularly uncomfortable with mechanisms that demand miraculous intervention or extreme mechanisms that are so implausible that they appear impossible short of miraculous intervention.  However, I’m inclined to cover them, especially if they have any basis.  I think Coronal Discharge for example, is pretty far out.  The degree of work that Giulio Fanti has put into makes it impossible to not say something about it.  But I have a hard time seeing how it could actually be the image process. Any ideas would be gratefully received.","date":"March 29, 2015 at 7:22 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"author":"rschneider42","post":"A couple of things.  The course was offered through the Lifelong Learning Institute of James Madison University, not Bridgewater College as Russ wrote.  The polar molecule idea is quite interesting.  The entrainment would be cause by the reaction of the molecule to the ambient electric field.  It would cause the molecule to align with the field and should reduce the degree of diffusion and give a mechanism for a sharper image.  It is also an hypothesis which can be tested experimentally.  For more details the authors of the paper from which I drew the material should be consulted.  http://www.shroud.com/pdfs/stlspicerpaper.pdf","date":"March 27, 2015 at 1:43 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"author":"rschneider42","post":"I think it is important that there be no “litmus test” that decides a priori what is acceptable and not acceptable as a hypothesis.  You only get a real dialogue going when the only rules are competency and honesty.  Investigators, especially investigating something as mysterious as the Shroud of Turin, will disagree and ought to be heard out and any decision made on the basis of the strength of the evidence.Science is always a work in progress and often what was accepted at one point in time proves to be unsatisfactory in the light of new evidence.  The conference in 2008 was a model of openness I thought and a very interesting conference.  I have every reason to believe that St. Louis will be as well.Regards, Ray","date":"October 26, 2013 at 1:19 pm","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","title":"Some thoughts on the St. Louis conference announcement"},{"author":"rschneider42","post":"If Russ doesn’t I will! B)","date":"October 27, 2013 at 10:47 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","title":"Some thoughts on the St. Louis conference announcement"}],"image":[{"author":"rschneider42","post":"That was certainly fast Dan.  I enjoyed watching the video.  Those of us who are steeped in all this stuff probably won’t find anything all that new.  I was intrigued by the attempt to test the maillard reaction hypothesis and a little disappointed that the result was largely limited to similarity of appearance at the microscopic level.  Still it’s a start.  It is always striking to me how poorly the results end up compared with the actual shroud.","date":"May 17, 2013 at 12:35 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"},{"author":"rschneider42","post":"Of course, was there any doubt.  There are many things to learn.  None of the suggested mechanism come anywhere close to duplicating the shroud except in the most superficial way.  There are four keys characteristics and a flock of others that need to be reproduced to duplicate the shroud.  The four major ones I call the STAR characteristics.  S)uperficial: image only extends a few hundred nanometers into the fibers and then on the surface.  They don’t penetrate.  T)hree dimensional: intensity varies with cloth to body distance so that rendered with that in mind you get a three dimensional image.  A)real Density: the image behaves like a half-tone image, all the image elements being the same color (within about 2%) so that apparent density changes are relatively more or less colored areas not changes in color.  R)esolution — the image is focused and relatively high in definition.Commonly suggested mechanisms rarely can explain more than one or two of these features and I’ve seen none that adequately explain all.","date":"May 17, 2013 at 9:22 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"},{"author":"rschneider42","post":"“Relic-based faith is no faith at all.” — said Louis.  I don’t think that faith is baseless.  That is unwarranted.  Moreover it is also somewhat irrelevant.  The question is how the image got on the shroud and what kind of image is it?  This is a question of fact which can be explored with science and technology.  The testimony of the shroud is something else.  It is a kind of 1st century photograph of Jesus Christ if it is authentic.  It has been called the Fifth Gospel for it tells the story of the passion rather directly.  That however is a religious matter and largely outside the competence of science.The apostle Thomas had to see Christ risen and put his hand into his side before he would believe.  Those who believe with less evidence are not thereby better, although Jesus describes them as “blessed”.  What is important is the truth and the truth demands evidence. “Faith without works is dead” said James.  Perhaps that could be construed to also mean that faith motivates the work needed to gain understanding.","date":"May 19, 2013 at 1:04 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"},{"author":"rschneider42","post":"The problem of course is that you are the one that raised this red-herring of an issue.  No one, at least not me, raised any such argument and certainly there is no test for “Christ” but that’s irrelevant the question whether the Shroud of Turin is consistent with being the burial cloth of Christ.  That’s rather a different question.The Resurrection was the central message of the gospel from the beginning.  One can’t prove the Resurrection from the Shroud of Turin.  Lazarus was not resurrected.  He was resuscitated.","date":"May 19, 2013 at 1:55 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"},{"author":"rschneider42","post":"Of course the difference between resurrection and resuscitation is that the person resuscitated dies again.","date":"May 19, 2013 at 2:28 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"},{"author":"rschneider42","post":"Maillard reaction alone?  The Maillard reaction would potentially explain the coloration and the superficiality.  It does not explain other characteristics.  For that you need a uniform linear transfer mechanism of a reagent that would react with the surface layer in a very limited way since it can’t propagate too far without blurring the image.  It has to be collimated so that you’ll get resolution, and the reagent must disappear or be rendered non-reactive by transfer through nominally four centimeters of air.  The collimation mechanism may be gravity or the electrostatic field (those are the two most obvious fields available).  The reagent might be materials in a water solution used to pat clean the body which came off the body in a very fine microaerosol which was neutralized as it was transported through air.  Some such process would potentially duplicate the image.Problems are that ordinary gas diffusion would normally tend to blur the image although a massive enough reagent would not diffuse as much and might solve the problem.  What I don’t think is particularly justified is a miraculous hypothesis both because the image isn’t perfect and there are image lacuna which suggest the image take up sensitivity is yarn dependent.  It might simply be a combination of rare characteristics that coming together allowed the image to be formed.  I tend to think of these kinds of events as miracles of the 2nd kind (not supernatural, but extraordinary because of the required cooperation of many natural but rare events).","date":"May 19, 2013 at 11:04 am","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"},{"author":"rschneider42","post":"I thought also that the move towards experimental observation was encouraging.  I thought the cloth should have been draped across features of the pig that might create an image rather than just a stain, like some articulated part of the head.  None of the examples in the piece were striking unless strikingly wrong is a criteria.  There are lots of arguments against the photography example that go beyond the lack of silver on the cloth and the bas-relief rubbing is a total loser and frankly looked it on the video.  The lack of gradient in the maillard experiment didn’t recommend it very much in the video but at least the discoloration seems to have something like the right characteristics.All in all the emphasis on experiment and comparison may be the best features of the piece.","date":"May 18, 2013 at 7:17 am","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"}],"researchers":[{"author":"rschneider42","post":"The French reweave theory is not “contamination” in the sense that John Jackson uses it, but “substitution” so his teetertotter diagram should show that possibility as a reduction in the 1st century material and a corresponding increase in the contemporary (likely 16th century) material.  So the kinds of biases we could have are:1) Contamination (i.e. contemporary material added)2) Substitution (i.e. contemporary material swapped out for original material)3) Selective enrichment (i.e. mechanisms that increase C14 selectively)4) Irradiation, or5) Combinations of the above.All of these are in principle open to verification by testing.  Bioplastic may be present as could contemporary material of other biological kinds that wasn’t subject to effective removal by the methods used by the labs.  We know there are intrusives (i.e. substitution material) is the form of cotton and evidence of dyes and manipulation in the area.  There could be some enrichment due to various natural radiation if the shroud was stored in locations subject to prolonged low level neutron flux, or perhaps (more speculatively) a burst of neutrons could have accompanied the resurrection and skewed the whole cloth and the sudarium as one paper at the conference simulated.  The matter is not at all simple nor “one answer fits all” but it is subject to verification.  You can hardly ask for more.","date":"October 14, 2014 at 8:31 am","url":"https://shroudstory.com/2014/10/14/dj-vu-squared/","cat":"critical_summary","title":"Déjà vu Squared"}]}
