{"art":[{"id":"comment-136454","author":"russ_breault","post":"Great timing on this image, I was looking for something to illustrate Gregory’s sermon on August 16, 944. This is perfect..","date":"2014-07-09","mins":"12:57 am","url":"https://shroudstory.com/2014/07/08/a-long-cloth-mandylion/","cat":"art","title":"A Long Cloth Mandylion?"},{"id":"comment-171887","author":"russ_breault","post":"Many people have asked me about this. They ask me about the apparent difference in appearance, most notably the shorter hair. I just tell them its proof they have barber shops and hair salons in heaven!.","date":"2014-11-18","mins":"11:17 am","url":"https://shroudstory.com/2014/11/18/akiane-kramarik-the-prince-of-peace-and-the-shroud-of-turin/","cat":"art","title":"Akiane Kramarik, The Prince of Peace and the Shroud of Turin"},{"id":"comment-101967","author":"russ_breault","post":"I am confident that if we were to overlay the Shroud over the image almost anyone, we would find 40 50 points of congruence. However, at some level, the points of congruence must become statistically significant as in the case of the Justinian coins–particularly the Tremesis coin, and the Sinai Icon from the Monastery of St. Catherine. These are at the 180 range regarding points of congruence and my view must be considered more than random or accidental..","date":"2014-04-21","mins":"10:34 am","url":"https://shroudstory.com/2014/04/21/heaven-is-for-real-the-akiane-prince-of-peace-the-isa-mosaic-and-the-shroud-of-turin/","cat":"akiane_kramarik","title":"Heaven is for Real, the Akiane Prince of Peace, the ISA Mosaic and the Shroud of Turin"},{"id":"comment-19619","author":"russ_breault","post":"Dan, Not sure if this is the best place to write this but I am interested in developing a secondary presentation to be called “Secrets of the Shroud”. In this presentation I want to cover many of the unique data points that are often left out of a general overview for time sake. These could be details related to the blood, the image, the cloth itself and even nuances of history. I would love to hear from your knowledgeable readers some of their thoughts on what to include..","date":"2012-11-29","mins":"1:18 am","url":"https://shroudstory.com/2012/11/28/do-nobody-knows-nothing/","cat":"art","title":"Do Nobody Knows Nothing?"},{"id":"comment-197847","author":"russ_breault","post":"Dan, I can understand how an artist may be able to paint something free hand that is the size of a standard canvass. However, a 14 foot linen cloth may be a different story. This is why Isabel develops an underlying “cartoon” first to make sure the proportions are correct. I have a replica and it is a BIG canvass to try to “paint” free hand..","date":"2015-04-28","mins":"10:57 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","title":"Having Nightmares"},{"id":"comment-47250","author":"russ_breault","post":"I don’t know what Isabel’s credentials are as a physicist, but her credentials as a world class artist speak for itself. She is a genuine prodigy to have been commissioned to paint a 400 square foot mural in the Vatican at age 14. Her testimony as an artist is critically important because, if the Shroud is not authentic, it MUST be the work of an artist. And who better to analyze it but another artist who is familiar with medieval art techniques and materials..","date":"2013-10-12","mins":"1:43 pm","url":"https://shroudstory.com/2013/10/12/in-case-you-missed-isabel-piczeks-wonderful-paper/","cat":"art","title":"In case you missed Isabel Piczek’s wonderful paper"},{"id":"comment-144826","author":"russ_breault","post":"The video says this is a second century icon image. Is there any information on where this is found? I do find the frontal facing image with long hair and beard interesting if indeed it is from second century..","date":"2014-08-19","mins":"4:32 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-144862","author":"russ_breault","post":"Thanks for your nice comments regarding Shroud Encounter. The info you provided is helpful..","date":"2014-08-19","mins":"9:35 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-140010","author":"russ_breault","post":"Max, thanks for re posting all of your prior posts. Very helpful!.","date":"2014-07-23","mins":"3:23 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","title":"Origin of the Gammadia"},{"id":"comment-139875","author":"russ_breault","post":"Aldo Guerreschi demonstrated very clearly that the water stain pattern was probably a result from when the Shroud was folded in a particular manner and rolled up to be kept in an urn similar to how the Dead Sea Scrolls were kept. If water or condensation got into the bottom of the urn it would create the same water stain patterns as seen on the Shroud. I usually say the stains are from the dowsing of the 1532 fire but it is probably not the case given the repetitive pattern of the water stains over the entire cloth. This relates to the “L” shaped pattern of holes as Mario posted above in that it seemed to be a Jewish symbol circa first century. So now it has me wondering if the burn hole pattern was just an accident with a Byzantine censor (as I usually say) or a more deliberate symbol applied by first century Jews who may have kept the cloth in an urn until it was taken out of Jerusalem two years prior to 66 when the uprising began that led to the destruction of the temple. According to Eusebius the faithful were “warned by the Holy Ghost” to leave Jerusalem around 64. Eusebius writes that all the sacred objects related to Christ were taken to Syria and were dispersed to Beruit, Pella and Edessa. Is it possible that as a symbol of ancient Judaism that the burn hole pattern was kind of Jewish “branding” to establish its authenticity? I am just speculating…but it has my juices going..","date":"2014-07-22","mins":"9:42 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","title":"Origin of the Gammadia"},{"id":"comment-139867","author":"russ_breault","post":"I did some additional research and it appears that the Gamma symbol is the third letter of the Greek alphabet and also because of the three points on the symbol similar to a backwards “7” it is the oldest symbol of the Trinity. I have no idea if it has any relation to the burn holes on the Shroud but it would fascinating to find a connection..","date":"2014-07-22","mins":"8:39 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","title":"Origin of the Gammadia"},{"id":"comment-139903","author":"russ_breault","post":"Here is another image showing the Gammadia symbol on an altar cloth showing Abel and Melchezidek. The use on an altar cloth is intriguing because the L shaped pattern of holes is shown 4 times on the Shroud–two times where the front image can be seen and two more where the dorsal image can be seen. Http://ldstempleendowment.blogspot.com/2010/03/garments veil and gammadia markings 03.html.","date":"2014-07-22","mins":"11:45 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","title":"Origin of the Gammadia"},{"id":"comment-139909","author":"russ_breault","post":"I am trying to figure out why the “L” symbol came to mean victory over death for the early Jewish believers circa first century. It could also symbolize a general belief in the resurrection–not necessarily Christian ie, the Pharisees believed in the resurrection whereas the Sadducees did not. Could it be because the bottom part of the L represents the body in death where as the vertical part of the L represents the body rising from the dead? Did the Jews at Masada place this emblem on their clothes because they knew they would all die at the hands of the Romans but believed they would see each other again at the resurrection? Not one Jew was found alive when the Romans reached the summit..","date":"2014-07-23","mins":"12:52 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","title":"Origin of the Gammadia"},{"id":"comment-124758","author":"russ_breault","post":"I use a series of these exhibition etchings in my lecture in dealing with the C 14 debacle. At the very least it demonstrates the absolute insanity of choosing either of the outside corners where we know it had been held and handled hundreds of times. Here is a clip from one of my lectures, the etchings start about 8 minutes into the clip. Https://www.youtube.com/watch?v=e 7 Ge ul6hs.","date":"2014-05-26","mins":"8:51 am","url":"https://shroudstory.com/2014/05/26/pictures-of-ostentations/","cat":"art","title":"Pictures of Ostentations"},{"id":"comment-188060","author":"russ_breault","post":"I agree Dave. That is the first thing I noticed is how faint the image looks contrary to Charles’ premise..","date":"2015-02-01","mins":"8:59 am","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","title":"Picture for Today"},{"id":"comment-124781","author":"russ_breault","post":"You are right Hugh. In fact I usually do correct that statement during the Q&A. The question always comes up, “Why haven’t they carbon dated it again?” That is when I reveal the sad news it was the Church itself who made the decision as to how many labs were involved, where the sample(s) would be cut and the location. No wonder they haven’t asked for another test! If the 1988 test results are questionable…it is their own fault for allowing aesthetics to supersede a rigorous protocol. However, I do not hold the carbon labs blameless. They knew the risks of taking one sample and the risks of a sample taken from the corner edge. Did they raise a protest? Not to my knowledge..","date":"2014-05-26","mins":"10:06 am","url":"https://shroudstory.com/2014/05/26/pictures-of-ostentations/","cat":"art","title":"Pictures of Ostentations"},{"id":"comment-25605","author":"russ_breault","post":"That is an excellent concise statement and one De Wesselow, as an art historian would completely agree with. Well said..","date":"2013-02-25","mins":"9:15 am","url":"https://shroudstory.com/2013/02/25/the-art-of-the-impossible/","cat":"art","title":"The Art of the Impossible?"},{"id":"comment-184028","author":"russ_breault","post":"Charles, what about these pictures from the Holkham Bible has ANY resemblance to the Shroud? I don’t see any comparable details except the beard, long hair and that he is naked. So what? As far as the blood, there is no resemblance at all to what is seen on the Shroud. You are simply trying to lead people–the uninitiated– to a conclusion that simply cannot be sustained by the facts. It is time to give up. Colin Berry destroyed your calcium carbonate theory as “proof” for you gesso hypothesis..","date":"2015-01-17","mins":"7:55 am","url":"https://shroudstory.com/2015/01/17/squiggles-of-blood-on-the-head-almost-identical-to-holkham-bible/","cat":"art","title":"Squiggles of Blood on the Head Almost Identical to Holkham Bible?"},{"id":"comment-47570","author":"russ_breault","post":"I think the most convincing are the two Justinian coins–first coins ever minted with an image of Jesus in 692. The Tremesis is amazing and the Solidus also quite convincing but the clincher for me is a the double line across the neck on both coins which corresponds exactly with a fold mark seen on the Shroud. One might dismiss face, hair or beard similarities but the fold mark is unique to the Shroud and very significant in my view..","date":"2013-10-15","mins":"11:22 am","url":"https://shroudstory.com/2013/10/15/three-examples-of-artistic-likeness/","cat":"art","title":"Three Examples of Artistic Likeness"},{"id":"comment-132086","author":"russ_breault","post":"Great post OK. I have long believed the HPG is the smoking gun that definitively links the Shroud to Constantinople. As I remind audiences, if the Shroud disappeared in 1204…that is already older than the oldest carbon date of 1260…and it didn’t just get there in 1204, it had been there for hundreds of years…most likely since 944..","date":"2014-06-21","mins":"10:02 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"}],"blood":[{"id":"comment-41755","author":"russ_breault","post":"Dan, I hear dogs love this book! I gave my copy to the dog and he tore it to shreds and had great fun doing it. He seemed to be ready for another and went straight for Inquest on The Shroud of Turin by Joe Nickell. Amazing!.","date":"2013-08-22","mins":"9:37 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-47634","author":"russ_breault","post":"I completely agree with your position Matthias. Here is my standard answer when someone asks me if I think it is authentic: “I am 90% certain it is, however I still must give 10% to the notion that there is a medieval artist out there who predated Leonardo Da Vinci by several hundred years, we don’t know who is, we don’t know how he did it, and he never did anything else of any significance. I guess that is possible, but in my view, not very likely.” Unless and until it is carbon dated again with a definitive first century origin, I will be stuck at 90%. In the meantime, the message of the Shroud completely correlates with Scripture and I am 100% certain the message of Scripture is true and accurate..","date":"2013-10-16","mins":"8:48 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","title":"Holding the Shroud to an impossible standard?"}],"dating":[{"id":"comment-192490","author":"russ_breault","post":"It is beyond annoying that anyone gets away with saying the first appearance of the Shroud is in the 14th century. A fact for western Europe but totally ignores the clear likelihood the Shroud was stolen from Constantinople in 1204. There was clearly a shroud in Constantinople, it clearly had an image on it with descriptions that match the TS. The HPM clearly links the two cloths with the obvious burn holes. The inconvenient truth is that 1204 is already older than the oldest carbon date of 1260. It doesn’t prove the Shroud is first century but it certainly indicates the carbon date is wrong..","date":"2015-03-05","mins":"8:46 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-8815","author":"russ_breault","post":"The most rediculous paragraph is the last one. It demonstrates the secular mind set that the Shroud simply cannot be authentic…regardless of any evidence to the contrary: “And of course ‘authenticity’ is not really a scientific issue at all here: even if there were compelling evidence that the shroud was made in first century Palestine, that would not even come close to establishing that the cloth bears the imprint of Christ.”.","date":"2012-02-28","mins":"10:40 pm","url":"https://shroudstory.com/2012/02/28/paper-chase-to-know-a-veil-by-philip-ball/","cat":"carbon_14_dating","title":"Paper Chase: To know a veil by Philip Ball"},{"id":"comment-70829","author":"russ_breault","post":"I have known for years about this alleged unauthorized C 14 test that was done circa 1982. My understanding is that one end dated 200 and the other 1000. Two ends of the same thread yielded radically different dates. Now the alleged participants are in denial that said test ever occurred. Since this test supposedly occurred six years before it was formally dated, and if it was a made up story…why concoct a story supposing such disparate dates from a single thread? Why not just claim it dated to first century? That doesn’t pass the smell test. Such aberrant dates from the same sample area that has garnered so much controversy post 1988 seems to be consistent what Rogers determined and published in 2005. Seems to me the test indeed happened but politics has trumped truth telling..","date":"2014-01-01","mins":"9:13 am","url":"https://shroudstory.com/2014/01/01/for-sure-someone-is-lying-here-talk-about-chumming-the-comment-pool/","cat":"carbon_14_dating","title":"“For Sure Someone is Lying Here” — Talk About Chumming the Comment Pool"}],"events":[{"id":"comment-34514","author":"russ_breault","post":"I like your last statement that perhaps it was an event that mortal humans could not endure. He wouldn’t allow Mary to touch him that morning…yet that evening in the upper room everyone touched him. Regarding faith, Jesus made at least six post resurrection appearances specifically to bolster their faith. In fact Acts 1:3 says “After his suffering he showed himself to be alive through many convincing proofs.” Those proofs were the post resurrection appearances…but perhaps the Shroud is left behind as a convincing proof for the generations that would follow…especially this one where knowledge of the Shroud is communicated around the world instantly just like this blog. Maybe?.","date":"2013-05-23","mins":"5:53 pm","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","title":"A kind of witness?"},{"id":"comment-34433","author":"russ_breault","post":"I think the witness issue is very important. It is a biblical principle established in Deuteronomy 19:15 that the truth of a matter is established by the testimony of two or three witnesses. There must be some significance as to why there were no human witnesses to the most important miracle of Christianity. God does not violate his own rules therefore there must be two or three witnesses…and there are! The linen cloth “lying there” was the first piece of evidence that Jesus had risen from the dead. There was also the “napkin” that was about his head folded next to the linen. This we believe is the Sudarium of Oviedo (Spain). And lastly the empty tomb itself–all three are witnesses to Christ’s resurrection today. Any one of them can be seen today, examined today, and venerated for their meaning today. The eye witnesses to his post resurrection appearances are significant but they are all dead–all we have is their written testimony two thousand years later. The Shroud, the Sudarium and the empty tomb all testify today and for all generations and fulfill the mandate laid down in Deuteronomy..","date":"2013-05-23","mins":"6:49 am","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","title":"A kind of witness?"},{"id":"comment-128327","author":"russ_breault","post":"Louis, I like your comment regarding the Resurrection Movement. Great point..","date":"2014-06-10","mins":"8:26 pm","url":"https://shroudstory.com/2014/06/10/add-to-cart-the-shroud-of-turin-prophecy-package-by-russ-breault/","cat":"lectures","title":"Add to Cart:  The Shroud of Turin Prophecy Package by Russ Breault"},{"id":"comment-128208","author":"russ_breault","post":"Thanks Dan, you found this out before I did. For clarification, I always tell audiences that the message of the Shroud is Past, Present and Future. It is past in that it takes us back to the empty tomb–the resurrection seen as a historical event. It is present in that we can see on the shroud today–in the now–the extreme price that was paid for our salvation. It is future in that it represents a future event. Some may dismiss this, but what Paul writes about in 1 Cor 15: 51 53 references a future event…it hasn’t happened yet…but it is exactly what happened to Jesus in the tomb. How can I say that? Because Jesus is also called “the first fruits of the resurrection.” This means that if he is the first fruits…we are the rest of the fruit that follows at a later time. It is exactly the same concept as when the Jewish high priest was in the temple waving the first fruits of the barley harvest asking God’s blessing on the rest of the harvest. It is no accident that when Jesus rose from the dead…it was on the Jewish Feast of First Fruits! So my view is that the shroud is a picture of not just a past event but also a foreshadow of a future event as well. This is how the Shroud fits into a discussion of biblical prophecy..","date":"2014-06-10","mins":"9:33 am","url":"https://shroudstory.com/2014/06/10/add-to-cart-the-shroud-of-turin-prophecy-package-by-russ-breault/","cat":"lectures","title":"Add to Cart:  The Shroud of Turin Prophecy Package by Russ Breault"},{"id":"comment-213877","author":"russ_breault","post":"Andy, I will get that done. The methodology I mentioned in the PPT slides is primarily related to how Mc Crone analyzed the particles on the mylar tape without removing them from the tape. Mc Crone only found particles that were birefringent–two indexes of refraction indicated the substance was iron oxide. Adler and Heller removed all the particles from the tape fearing the tape would interfere. They found both blood which is non birefringent and they also found iron oxide. Why didn’t Mc Crone find the blood that Heller and Adler found? Because he was sloppy in his methodology. My contention therefore is that Heller and Adler used a much more careful approach resulting in more accurate data..","date":"2015-10-29","mins":"9:15 pm","url":"https://shroudstory.com/2015/10/29/battle-of-the-chemists/","cat":"presentation","title":"Battle of the Chemists"},{"id":"comment-22675","author":"russ_breault","post":"I think many scientists capitulated to the C 14 results because to do otherwise would have been a career killer..","date":"2013-01-25","mins":"6:46 pm","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","title":"Eric J. Jumper to Speak on the Shroud of Turin"},{"id":"comment-8757","author":"russ_breault","post":"There is more info on this series of lectures at http://www.Catholic Man Night.com which is my sponsor for these events..","date":"2012-02-26","mins":"12:57 pm","url":"https://shroudstory.com/2012/02/26/csi-jerusalem-the-case-of-the-missing-body/","cat":"event","title":"CSI Jerusalem: The case of the missing body"},{"id":"comment-22732","author":"russ_breault","post":"Regarding the identity of the man, if we can assume that the forensic pathologists are correct, ie Bucklin, Zugibe and others, that the man seen on the shroud was a real man who died from the wounds pictured. AND if we can assume that the blood chemistry is correct, ie Adler, Heller and others, that the blood is in fact blood from actual wounds. Then there are two choices, either the shroud is the result of an actual crucifixion or one that was staged. The problem with the staged hypothesis, is that as far as we know, corpses do not make images on linen shrouds. There is nothing else like it in all the museums in the world…only shrouds covered with stains of body decomposition…no images. If it was the result of an actual crucifixion then a simple comparison should reveal the identity. The uniqueness of Christ’s crucifixion are numerous starting with a crown of thorns as a singular mockery as King of the Jews, severe scourging as a last ditch effort by Pilate to release him–he didn’t think he was guilty of a crime worthy of capital punishment–plus he was spooked by his wife’s dream. His legs were not broken and he received a side wound instead because he was already dead when it came time to remove the bodies–consequence of the scourging no doubt. He was given an individual burial even though most who were crucified were thrown into a common grave. He was wrapped in a very expensive linen–one suited for a high priestly garment. All this together would indicate it is probably Jesus. Is it Conclusive? Not by today’s scientific standards—but probably enough to hold up in a courtroom as the “preponderance of evidence”–the burden of proof necessary for a civil trial..","date":"2013-01-26","mins":"11:02 am","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","title":"Eric J. Jumper to Speak on the Shroud of Turin"},{"id":"comment-211123","author":"russ_breault","post":"Colin, I certainly hope that Barrie earned several thousand dollars for STERA with his recent talks–but he probably didn’t. Why is it that people feel that a comedian, musician, magician or any number of thousands of people on the college, church or corporate lecture circuit can command $5 K, $10 K up to $50 K for a one hour talk, yet if someone speaks professionally on the Shroud it should be free. That is total BS and you know it. When someone stands up before a crowd and offers their lifelong expertise on a subject, takes two days out of their life and endures the hardships of travel, they better damn well get paid for it. It is ludicrous and obtuse to think otherwise..","date":"2015-09-24","mins":"8:02 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","title":"Facebook:  Barrie Schwortz on Indianapolis"},{"id":"comment-211140","author":"russ_breault","post":"Well said Barrie. All who actually know you are honored to be your friend. You are a man of honesty and integrity and you shouldn’t have to defend yourself against idiots..","date":"2015-09-24","mins":"11:51 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","title":"Facebook:  Barrie Schwortz on Indianapolis"},{"id":"comment-26852","author":"russ_breault","post":"When it comes to matters of belief, perhaps science should take a back seat. We have a choice, do we fill in the gaps with doubt or with faith? It is really a choice we each make. Sure there are gaps in the data with the Shroud. A purely scientific view would conclude that a determination of authenticity can never be achieved…we don’t have the DNA of Jesus to make a definitive match. But my faith tells me it is authentic and I “venerate” it as such. Skepticism is good to a point, but too much of it could rob you of the simplicity of faith. This is exactly why Jesus said unless we have the faith of a little child we cannot enter the Kingdom. There is enough evidence to indicate the Shroud COULD be authentic. Faith takes me the rest of the way. Perhaps this is Benedict’s view as well..","date":"2013-03-08","mins":"3:49 pm","url":"https://shroudstory.com/2013/03/08/pope-benedict-says-shroud-of-turin-authentic-burial-robe-of-jesus-it-doesnt-matter-what-science-says-about-its-authenticity/","cat":"event","title":"Pope Benedict says Shroud of Turin authentic burial robe of Jesus & it doesn’t matter what science says about its authenticity"},{"id":"comment-33711","author":"russ_breault","post":"She is only guilty of overstating established facts. The word “impervious” is not appropriate but the water stain over the knees showed us the image is not water soluble–an important clue since many artistic substances are water soluble. The image does not seem to be effected by heat…other than the burns or charred areas, the image does not seem to be effected by the heat of the 1532 fire. Medieval descriptions such as, “barely able to make out an outline” would also suggest the image was faint and hard to discern over 500 years ago. So perhaps these things are over stated but they are also based on observations made by the STURP team and historical references..","date":"2013-05-15","mins":"10:56 am","url":"https://shroudstory.com/2013/05/15/review-of-the-holy-shroud-exhibition-in-seville/","cat":"event","title":"Review of the Holy Shroud Exhibition in Seville"},{"id":"comment-23054","author":"russ_breault","post":"Donn, you just missed it. I was at Roberts Wesleyan College in Rochester on Jan 14th. Not sure at this point when I will be back..","date":"2013-01-30","mins":"12:38 pm","url":"https://shroudstory.com/2013/01/30/russ-breault-and-shroud-encounter-also-in-west-simsbury-connecticut/","cat":"event","title":"Russ Breault and Shroud Encounter also in West Simsbury, Connecticut"},{"id":"comment-85625","author":"russ_breault","post":"Thanks Dan for posting. I list all events on my FB page. If its ok to post, here it is: https://www.facebook.com/pages/Shroud Encounter/163146517115961 Just “Like” the page and updates will appear in your FB newsfeed..","date":"2014-03-06","mins":"5:30 pm","url":"https://shroudstory.com/2014/03/06/russ-breault-on-the-road-again/","cat":"event","title":"Russ Breault on the Road Again"},{"id":"comment-122698","author":"russ_breault","post":"Really!! Where was the news on this? Good grief, seems like quite a nice exhibit that no one knew existed. C’mon people…Field of Dreams is nonsense. Build it and they will NOT come unless they know about it!.","date":"2014-05-21","mins":"1:05 pm","url":"https://shroudstory.com/2014/05/21/seventy-cities-in-twenty-years-starting-in-royal-oak-michigan/","cat":"event","title":"Seventy Cities in Twenty Years Starting in Royal Oak, Michigan"},{"id":"comment-85897","author":"russ_breault","post":"Thanks Yannick! Thanks for the link too….I will review your paper again. I appreciate your work..","date":"2014-03-07","mins":"10:43 am","url":"https://shroudstory.com/2014/03/06/russ-breault-on-the-road-again/","cat":"event","title":"Russ Breault on the Road Again"},{"id":"comment-18828","author":"russ_breault","post":"Hope you can make it Ron. Please introduce yourself if you can..","date":"2012-11-05","mins":"8:56 pm","url":"https://shroudstory.com/2012/11/03/shroud-encounter-coming-to-cresson-pa-and-buffalo-ny/","cat":"event","title":"Shroud Encounter Coming to Cresson, PA and Buffalo, NY"},{"id":"comment-146346","author":"russ_breault","post":"Thanks Dan!.","date":"2014-08-26","mins":"5:16 pm","url":"https://shroudstory.com/2014/08/26/shroud-encounter-in-minnesota-on-august-28/","cat":"presentation","title":"Shroud Encounter in Minnesota on August 28"},{"id":"comment-48924","author":"russ_breault","post":"Looking forward to seeing old friends and making new ones!.","date":"2013-10-27","mins":"5:01 pm","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","title":"Some thoughts on the St. Louis conference announcement"},{"id":"comment-48775","author":"russ_breault","post":"Joe Marino who helped organize the 2008 Ohio conference will be very involved in refereeing the papers selected. I am confident his involvement will make for a solid conference..","date":"2013-10-26","mins":"9:46 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","title":"Some thoughts on the St. Louis conference announcement"},{"id":"comment-135739","author":"russ_breault","post":"Sal, you are right about the videos on Shroud University. They were originally encoded with WMV and hosted on my server site. At the time in 2008, Youtube only allowed 10 minute videos. After I upload the 2014 conference to Vimeo, I will link everything to Shroud University. I may then also create a You Tube Channel for broader distribution. Its a good idea. I have a channel for Shroud Encounter but I would want to keep them separate. I also plan, God willing and a student I can hire for cheap, to re upload to Vimeo all past conferences which include Ohio 2008, Rome 1993 and St. Louis 1991. I will then terminate the link to my own server so anyone with any computer should be able to stream all the content. That is the goal. Pray it happens! Its a lot of work!.","date":"2014-07-06","mins":"5:25 pm","url":"https://shroudstory.com/2014/07/06/put-st-louis-on-the-map/","cat":"st_louis_2014","title":"Put St. Louis on the Map"},{"id":"comment-28897","author":"russ_breault","post":"I am not sure if the use of the word “icon” used by Pope Francis should indicate how he feels about the Shroud. The word icon in Italian is often used when in English we might use “image”. This is seen with past Pope Benedict who called the Shroud “an icon written in blood.” In his book on the Passion of Christ he refers to the Shroud as a relic..","date":"2013-03-30","mins":"8:00 pm","url":"https://shroudstory.com/2013/03/30/stories-are-rolling-out-now-on-the-exhibition-of-the-shroud-of-turin/","cat":"event","title":"Stories are rolling out now on the Exhibition of the Shroud of Turin"},{"id":"comment-174915","author":"russ_breault","post":"In this paper/presentation I am only looking at how the Shroud corresponds with either theological or apologetic concepts. It is a fact that the image does not fluoresce so that certainly suggests the image is not the result of heat. It may not be absolute proof that low level heat was not involved. However experiments done by Thibault are enough to convince me that this premise is highly unlikely. And if such a sculpture or bas relief was ever created to fabricate the Shroud image, as renowned artist Isabel Piczek said, they kept the wrong artwork, the sculpture itself would have been a masterpiece unlike anything else of the period..","date":"2014-12-06","mins":"8:54 am","url":"https://shroudstory.com/2014/12/06/st-louis-theology-presentation-by-russ-breault/","cat":"st_louis_2014","title":"St. Louis Theology Presentation by Russ Breault"},{"id":"comment-173208","author":"russ_breault","post":"This site is still in progress. The audio levels are very low. You will have to crank up the volume very high to hear. I will be re editing each one to raise the audio levels. As a result the links may change. Not exactly sure when all this will be complete–probably a couple weeks. Thank God for tech savvy teenagers who will work for $10/hr or none of this would happen..","date":"2014-11-26","mins":"10:55 pm","url":"https://shroudstory.com/2014/11/26/st-louis-videos/","cat":"st_louis_2014","title":"St. Louis Videos"},{"id":"comment-173213","author":"russ_breault","post":"Also, if you get no audio at all, make sure your flash player is not on mute. Put your curser over the speaker icon and it should tell you if it is muted or not..","date":"2014-11-26","mins":"11:26 pm","url":"https://shroudstory.com/2014/11/26/st-louis-videos/","cat":"st_louis_2014","title":"St. Louis Videos"},{"id":"comment-173925","author":"russ_breault","post":"Thibault, unfortunately I had a tape failure with your talk. My apologies but I won’t have a video of your presentation. Thankfully Barrie will publish your paper on Shroud.com.","date":"2014-11-30","mins":"7:36 pm","url":"https://shroudstory.com/2014/11/26/st-louis-videos/","cat":"st_louis_2014","title":"St. Louis Videos"},{"id":"comment-173339","author":"russ_breault","post":"Hmmm. He should be on the list. I will check into that and make the addition. Thanks for letting me know..","date":"2014-11-27","mins":"2:32 pm","url":"https://shroudstory.com/2014/11/26/st-louis-videos/","cat":"st_louis_2014","title":"St. Louis Videos"},{"id":"comment-163111","author":"russ_breault","post":"The subtitle for Shroud Encounter is “CSI Jerusalem–The Case of the Missing Body”. The apostles were not hallucinating when they reported numerous encounters with a resurrected Jesus that involved eating, touching, and conversing. The apostles all (except John) went to their deaths for their testimony. What was their testimony? That Jesus who the Romans crucified has risen from the dead. They were eye witnesses. Nobody dies for a lie. The body was not stolen. Who stole it? Not the apostles–what would be the motive? Not the Romans or the Jews–their motive was to discredit Jesus not to affirm his deity. Any theory that does not also explain how this body disappeared is pointless. The only alternative is that it is indeed the work of an unknown medieval artist who predated Leonardo Da Vinci by several hundred years and no one knows who he is or how he did it and he never did anything else of any significance..","date":"2014-10-17","mins":"8:15 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-24908","author":"russ_breault","post":"There are more in the pipeline including Chattanooga, Chicago, Ontario, Atlanta and Ft. Lauderdale. I will provide details as it gets closer..","date":"2013-02-19","mins":"4:04 pm","url":"https://shroudstory.com/2013/02/19/upcoming-shroud-encounter-talks-with-russ-breault/","cat":"event","title":"Upcoming Shroud Encounter Talks with Russ Breault"},{"id":"comment-47464","author":"russ_breault","post":"I have also learned that even though this will be held in Italy, all the papers will be presented in English..","date":"2013-10-14","mins":"8:00 am","url":"https://shroudstory.com/2013/10/14/update-on-the-ieee-workshop-september-in-italy/","cat":"event","title":"Update on the IEEE Workshop: September in Italy"},{"id":"comment-164323","author":"russ_breault","post":"LOL I love your headline Dan. They had over 900 attend and each one paid $10 as a fund raiser for seminarians. The Villages is HUGE…over 100 K live there and at least that many golf carts. A great place to retire..","date":"2014-10-21","mins":"8:27 am","url":"https://shroudstory.com/2014/10/21/what-next-stadiums/","cat":"presentation","title":"What Next?  Stadiums?"},{"id":"comment-164635","author":"russ_breault","post":"Eric, it is unfortunately only in English. My main Shroud Encounter presentation is 90 minutes…to involve translators would make it twice that long. Perhaps a video of the presentation could be dubbed into Spanish or other languages. I have not yet investigated that..","date":"2014-10-22","mins":"11:00 am","url":"https://shroudstory.com/2014/10/21/what-next-stadiums/","cat":"presentation","title":"What Next?  Stadiums?"}],"forensic":[{"id":"comment-181345","author":"russ_breault","post":"Remember, Dr. Gilbert Lavoie did a lot of this blood experimentation back in the 1980’s and his results along with photos are published in his book, “Unlocking the Secrets of the Shroud.” Art Lind collaborated with Gil for the paper he presented..","date":"2015-01-04","mins":"5:19 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-121981","author":"russ_breault","post":"Yannick’s comment is right on the mark. Perhaps not everything Vignon identified can be considered unique to the Shroud image but there is a global pattern that allows everyone in the world, whether they believe or not, to see a picture of the Shroud face and know it is Jesus. Regarding comments as to which one came first…the Shroud or the icon, keep in mind that the earliest descriptions of the Mandylion/Image of Edessa are “The True Likeness” and “Not Made by Human Hands.” I think even in the 6th century, people were smart enough to know whether something was made with paint or not. Seeing that the Shroud conforms exactly with the “True Likeness” as depicted in various icon images and we know today from science that it is not the result of artistic substances, ie…”Not Made by Human Hands.” It is both logical and certain that the Shroud is in fact the original True Likeness discovered or perhaps rediscovered in 525..","date":"2014-05-20","mins":"8:36 am","url":"https://shroudstory.com/2014/05/20/the-vignon-markings-issue-a-promoted-comment/","cat":"art","title":"The Vignon Markings Issue:  A Promoted Comment"},{"id":"comment-122103","author":"russ_breault","post":"Most alleged relics were small pieces of bone, hair, clothing, etc. Nothing on the order of the Shroud. And most alleged relics were associated with various saints..","date":"2014-05-20","mins":"1:15 pm","url":"https://shroudstory.com/2014/05/20/the-vignon-markings-issue-a-promoted-comment/","cat":"art","title":"The Vignon Markings Issue:  A Promoted Comment"}],"history":[{"id":"comment-8761","author":"russ_breault","post":"Nick, That is a wonderful testimony you have shared. Father Peter Rinaldi of the Holy Shroud Guild always said we need to lead people “through the linen to the Lord.” The Shroud may or may not be authentic but it certainly testifies to the historical events of the crucifixion and resurrection. It lines up perfectly with Scripture which makes it a perfect tool to explore what happened to Jesus as we also explore the mystery of the Shroud itself. The very fact that the Shroud remains a mystery is amazing itself. If it was an obvious work of art, we would have figured that out a long time ago. Kudos to your new found faith!.","date":"2012-02-26","mins":"5:04 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture"},{"id":"comment-8756","author":"russ_breault","post":"This is very good comprehensive summary of facts that might form a case for the Shroud’s authenticity. I guess it is a matter of style, but I prefer to leave the Shroud as a mystery, a fabulous mystery in the same league as the pyramids or Stonehenge…all of which remain unsolved at their core regarding who and how they were made…many theories but no definitive answer. As you lecture, make every effort to refrain from dogmatism. The Shroud could be authentic. Thats it, that is as far as we can take it. Who knows…maybe there is a medieval artist out there who predated Leonardo by at least 100 years, and we don’t know who he is, or how he did it. Not likely I grant you yet still a possibility. In fact if the Shroud was on trial we would have to look at two burdens of proof…”beyond a reasonable doubt” for a criminal trial and “preponderance of evidence” for a civil trial. Personally, I don’t think will ever get to “beyond a reasonable doubt.” Preponderance of evidence I would agree with…but that really only means there is better than a 50% chance of it being authentic. But that is ok. It is fun to explore the mystery, and as we do, we encounter the heart of the gospel. I love letting the audience decide. Is it possible? Did God preserve an image of himself for an age when we communicate more with images than we do with words? Is it silent witness to the one miracle that had no eyewitnesses? All these are tantalizing and wonderful things to ponder. But at the end of the day, it is up to each person to decide..","date":"2012-02-26","mins":"11:56 am","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture"},{"id":"comment-125006","author":"russ_breault","post":"Using the Shroud as a tool for Christian education is terrific idea. One young woman at a lecture commented that “the Shroud makes it real.” In the 21st century, as the Church struggles against pervasive secularism and a new and aggressive form of atheism, the Shroud stands as a witness for the core message of Christianity…the bulls eye of the faith. Some evangelicals assert that God would not use something like the Shroud. Why not? Jesus said, “If you have SEEN me, you have SEEN the father.” Paul describes Jesus as, “the image of the invisible God.” Certainly something dramatic changed between the OT where no one, not even Moses saw the face of God…to the NT where everyone beheld the glory of God in the face of Jesus. In Acts 1:3, it says, “After his suffering he showed many convincing proofs that he was alive.” Is it not possible that the Shroud is a “proof” for all generations? In the 21st century we communicate more images than we do with words. Perhaps the Shroud was preserved for this time in human history more than any other and has the same message as Scripture, “I am the way, the truth and the life…”.","date":"2014-05-27","mins":"7:47 am","url":"https://shroudstory.com/2014/05/27/the-shroud-as-a-sunday-school-tool/","cat":"news_&_views","title":"The Shroud as a Sunday School Tool"},{"id":"comment-8771","author":"russ_breault","post":"Paul, I think you are missing my point. The Shroud remans an unsolved mystery. In that same vein, so are Stonehenge and the Pyramids. As a lecturer and a presenter, I have been invited to some of the best universities in the country (Duke, Penn State, Cal State, and many others). I am totally focused on how to get the world at large to embrace the Shroud as a legitimate artifact to study and explore. And the only way (IMO) is by focusing on the mystery and losing the dogmatism. Once we become so oriented towards claiming and proving it to be authentic, we lose the very people we are trying to reach with the message of the Shroud. I am all for building a case for authenticity. However, carbon 14 will remain an issue until it is dated again. There remain many reasonable questions that do not yet have adequate answers. I am happy with the Shroud being a mystery. Who can argue with that? Whether it is authentic or not, it remains a mystery. That is what makes it fascinating. If we had all the answers, it wouldn’t be nearly as interesting. Again, if I didn’t make it clear, I am speaking to my approach in taking the Shroud outside the walls of the Church..","date":"2012-02-26","mins":"11:31 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture"},{"id":"comment-38709","author":"russ_breault","post":"I agree with you Dave. How someone can spin the finding of a plain weave cloth as proof against the Shroud is nonsense. It is clearly written in Scripture, “Joseph of Arimathea, A RICH MAN PURCHASED A FINE LINEN CLOTH”. The Scripture itself lets us know that the cloth was not plain and not ordinary. In fact, Joseph was a Pharisee, he had access to the temple and the temple store. The high priest was commanded in Deuteronomy before entering the Holy of Holies to perform the sacrifice, to take off his ordinary clothes and put on clothing made of “fine twisted linen” which represented the holiness of God. Seems likely that the Shroud was made of fine twisted linen (3:1 herringbone twill with a Z twist) and was purchased directly from the Temple. Joseph was sending us a message. He knew who Jesus was, and he IMO, purchased linen worthy of a high priest about to enter the Holy of Holies..","date":"2013-07-07","mins":"7:10 pm","url":"https://shroudstory.com/2013/07/07/nbc-news-on-the-archaeology-of-christianity/","cat":"history","title":"NBC News on the archaeology of Christianity"},{"id":"comment-142986","author":"russ_breault","post":"Here are the facts. Hitler visited Italy in 1938, two months after he invaded Austria and obtained the “Spear of Destiny”. One of the cities he visited was Turin. His henchmen began asking questions about the King’s Sacred Relic. After just stealing the Spear of Destiny from the Hoffburg Museum in Vienna, no wonder the King was concerned. Hitler invaded Poland on Sept 1, 1939. Within two weeks the Shroud was secretly removed from Turin and brought to Rome for 18 days and then moved to Montevergine about 150 miles south of Rome in the hills near Avellino. Why was the Shroud moved? Until 2010 it was thought to keep it safe from Allied bombs but Italy did not enter the war until June of 1940 after Hitler invaded France. So the real reason must have been to keep away from Hitler as new documents indicate. In April of 1943, the Nazis came looking for the Shroud in Turin only to find out it was moved to a secret location. At this time a press release was issued by the Vatican and carried by the NY Times that the Shroud had been moved to a safe location. This announcement no doubt came after the Nazis came looking for it. Did they find out where it was taken? In Sept of 1943, the Nazis stormed the monastery under cover of darkness claiming they were looking for Allied spies. The Abbot ordered all the monks to gather in the choir chapel where the Shroud had been secretly encased inside the Altar. None of the monks knew it was there. The Nazis searched room by room and when they came to the Choir Chapel and saw the monks gathered in prayer, one of the officers said, “Don’t bother the monks, let them pray.” And so the soldiers left not finding any spies nor the Shroud. Were they specifically looking for the Shroud? No one really knows. That is the story. In my presentation I document Hitler’s obsession with the occult, how he coveted the Spear of Longinus, how he and Himmler were both obsessed with finding the Holy Grail and also the Shroud. Unlike all the art works stolen as documented in the recent movie, Monuments Men, Hitler’s desire for religious artifacts stemmed from his belief they would give him supernatural power in his bid for world domination. One last thing, in his twisted mind he had convinced himself that Jesus was of an Arian bloodline and was not a Jew–hence his obsession with finding things related to Christ..","date":"2014-08-08","mins":"12:04 pm","url":"https://shroudstory.com/2014/08/08/from-shroud-encounter-the-day-the-shroud-foiled-hitler/","cat":"history","title":"Revised: The Day the Shroud Foiled Hitler"},{"id":"comment-30019","author":"russ_breault","post":"Looks interesting! How can we get the full article? Publication only allows you to see the abtract..","date":"2013-04-09","mins":"8:42 am","url":"https://shroudstory.com/2013/04/09/paper-chase-new-peer-reviewed-article/","cat":"history","title":"Paper Chase:  New Peer Reviewed Article"},{"id":"comment-19912","author":"russ_breault","post":"Thanks Dan, here is an example of what I might include. This comes from Dr. Gil Lavoie’s work. On the Shroud we see blood that appears to be in the hair. Its not in the hair. The blood was on the face. Since the image came later, the blood only appears to be in the hair when you pull the cloth flat. This is a powerful proof point that the cloth indeed wrapped a corpse. Now why the image is vertically collimated is anyone’s guess..","date":"2012-12-06","mins":"9:32 am","url":"https://shroudstory.com/2012/12/06/secrets-of-the-shroud-what-say-you-all/","cat":"history","title":"Secrets of the Shroud:  What say you all?"},{"id":"comment-174476","author":"russ_breault","post":"If you want to watch and listen to Jack Markwardt, go to: http://www.shrouduniversity.com/stlouis14.php All the audio problems have been resolved. Jack has gave two papers..","date":"2014-12-03","mins":"10:58 am","url":"https://shroudstory.com/2014/12/03/the-shroud-of-turin-is-not-the-image-of-edessa/","cat":"history","title":"The Shroud of Turin is not the Image of Edessa?"},{"id":"comment-44992","author":"russ_breault","post":"Great point John. “As far as the Pray Codex is concerned, we have several points of comparison. It is clearly a shroud. Is there any other work of art or artifact that has more points of comparison to the Pray Codex than the Shroud. If so, I haven’t seen it. Has anyone?” In my opinion the HPM is the smoking gun that places the Shroud in Constantinople in 1204…which is 56 years older than the oldest carbon date. Doesn’t seem like much, but the Shroud didn’t just get there in 1204. It is most likely the same cloth that arrived in 944. The point is simple. The carbon date is wrong. How wrong? No one can say. Does it prove it to be first century? No. But it does prove the carbon date is wrong. So for anyone looking for the alleged medieval artist, stop looking in the 14th century..","date":"2013-09-21","mins":"2:04 pm","url":"https://shroudstory.com/2013/09/21/so-is-that-the-shroud-of-turin-depicted-in-the-hungarian-pray-codex/","cat":"history","title":"So is that the Shroud of Turin depicted in the Hungarian Pray Codex?"},{"id":"comment-55823","author":"russ_breault","post":"It is interesting and I like the comparison to Elijah’s mantle. Perhaps Paul asked for these things but there is no evidence that Timothy came through. Perhaps the Shroud remained in Turkey for some reason. I agree with Dave that Paul did not need the Shroud as some evidentiary proof of the resurrection. Paul frequently refers to the “power” that accompanied his preaching. This was not long after Pentecost and no doubt people getting healed or delivered was all the evidence they needed..","date":"2013-12-03","mins":"2:45 pm","url":"https://shroudstory.com/2013/12/03/translation-when-you-come-bring-the-shroud-of-turin/","cat":"history","title":"Translation: When you come, bring the Shroud of Turin"}],"image":[{"id":"comment-127935","author":"russ_breault","post":"I think the person best able to address the 3 D attributes of the Shroud is Ray Downing, who is generally very skeptical of “shroud science”. I had dinner with him and his wife Maria at an event near Albany, NY about a month ago. In fact, the one compelling piece of data that would cause him to consider the Shroud’s possible authenticity is the apparent distance information that appears to be encoded into the image. The only reason he was able to extract a 3 D image from a flat surface without distortion is because the information or data is there…in other words…it must have wrapped a real human form for that to be possible..","date":"2014-06-09","mins":"6:16 am","url":"https://shroudstory.com/2014/06/08/speaking-of-3d/","cat":"3d","title":"Speaking of 3D"},{"id":"comment-211252","author":"russ_breault","post":"Yes, The Real Face of Jesus? is one of the best documentaries made (2 hours) and focuses on the work of 3 D animator Ray Downing using state of the art technology. I had dinner with him and his wife Maria a few years ago. Ray is not yet convinced the Shroud is authentic but he is totally convinced the Shroud contains unique data that allows for an accurate 3 D rendering of the image. There is no way he should be able to extract a 3 D image from a flat surface without distortion and yet that is precisely the case..","date":"2015-09-26","mins":"8:05 am","url":"https://shroudstory.com/2015/09/26/the-vp8-cinderella-question/","cat":"3d","title":"The VP8 Cinderella Question"},{"id":"comment-150925","author":"russ_breault","post":"Where the Maillard reaction breaks down for me, is I don’t see how gas would uniformly emit from a decaying body at the same intensity whether from the torso, orifices or from extremities. The uniform intensity of the image, top to bottom and front to back, is one of its most profound attributes. As Eric mentioned, Rogers knew that the Maillard reaction alone could not be responsible for the highly resolved image we see on the Shroud. IMHO, there is something else at work. What that may be is anyone’s guess..","date":"2014-09-14","mins":"8:45 am","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level"},{"id":"comment-210514","author":"russ_breault","post":"I had to download and save/print as a pdf..","date":"2015-09-16","mins":"6:30 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","title":"Faint Images:  The Case of the Shroud of Arquata"},{"id":"comment-32884","author":"russ_breault","post":"The whole argument that the Shroud looks “too perfect” is ridiculous. Notice how all the pictures of the Shroud they claim are “too perfect” are all in the photo negative. Funny how the alleged artist had no clue that such an image even existed but was discovered 600 years later. He would not have purposely created a negative image–and why bother? It is only revealed via photography. So this image described as “too perfect” was just an accidental bi product of the forger’s technique? That sounds a little too perfect for me..","date":"2013-05-04","mins":"9:03 am","url":"https://shroudstory.com/2013/05/04/a-mysterious-work-of-art/","cat":"image_theory","title":"A mysterious work of art?"},{"id":"comment-8467","author":"russ_breault","post":"This is not an adequate explanation either. He is suggesting that pressure somehow resulted in a greater concentration of darkened fibers such as the tip of the nose. Yet we already know that the image is NOT pressure sensitive since the image intensity is the same on the dorsal image which would have borne the full weight of the body…or in this instance, the alleged statue which was no doubt made out of metal to be an even conductor of heat. Can you imagine the weight of that thing? Have you picked up a bronze bust? Kim Dreisbach had several in his collection. They are heavy…I can’t imagine the weight of a full bronze body. I don’t think there is any doubt that heat would cause a pressure sensitive effect, even if placed on sand. The dorsal image would have a different density versus the frontal where the cloth was simply draped over the front of the supposed statue. Any experiment to relicate the shroud in this fashion must replicate the entire shroud otherwise it is irrelevant..","date":"2012-02-19","mins":"12:58 pm","url":"https://shroudstory.com/2012/02/19/i-dont-get-it-writes-a-reader-about-colin-berrys-hypothesis/","cat":"image_theory","title":"I don’t get it, writes a reader about Colin Berry’s Hypothesis"},{"id":"comment-172562","author":"russ_breault","post":"One more comment regarding Charles’ painting theory. He alleges that in earlier centuries…before the paint flaked off, the loin cloth was more pronounced, which is why it is featured in nearly all copies or replicas. However the Lier copy from 1516 barely shows any such loin cloth and the image is noticeably faint. The Exhibition Poster from 1663 also shows the image very faint versus the darker images we find on other copies. Regarding the loin cloth, if there was any attempt to copy with realism what was seen on the original Shroud, why do all the loin cloths vary so much? From 1579 it looks like a bath towel, others look like boxer shorts and yet others look like a stuffed diaper. There is no consistency whatsoever regarding the presumed loin cloth. Maybe that is because it never existed on the original and therefore invites artistic license!.","date":"2014-11-22","mins":"1:47 pm","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","title":"Image of the Resurrection?"},{"id":"comment-8473","author":"russ_breault","post":"Do you also assume that the blood was somehow applied prior to this alleged imprinting? All observations are that there is no image under the blood indicating it was applied first followed by the image. Also, we know now with certainty that the Shroud today is the same one stolen from Constantinople in 1204. Historical references would indicate the artist who crafted the Hungarian Pray Manuscript was an eye witness to that cloth sometime between 1160 to 1170. It had obviously been there for some time as well. Does your theory have any precedent in the Byzantine era? The western fascination with relics and all the consequent fakes largely started after the 4th Crusade..","date":"2012-02-19","mins":"3:28 pm","url":"https://shroudstory.com/2012/02/19/i-dont-get-it-writes-a-reader-about-colin-berrys-hypothesis/","cat":"image_theory","title":"I don’t get it, writes a reader about Colin Berry’s Hypothesis"},{"id":"comment-172546","author":"russ_breault","post":"Charles proposes that the Shroud was painted and the paint has now all flaked off. One of his proof points is that copies or replicas of the cloth all show a much darker image than we see now. Perhaps he is right. Or perhaps the image has grown more faint over time by natural means or perhaps there is a third option. I lecture extensively on the Shroud. When showing images of the Shroud, I often use the more contrast enhanced images from Enri–1931. He used monochromatic film which enhances lights and darks. Why would I do this? SO THE AUDIENCE CAN SEE THE IMAGE! Is it not likely that copies of the Shroud were made so people could see it? Think of how the replica would have been displayed, in a dark church with no electric lighting. Add to the problem of how one might paint something so faint in the first place. Why not paint it so everyone can see it…even from the back of the church? (As a note: Barrie’s pictures from 1978 are perfectly accurate in terms of color–but as a result the image is more faint. Post 2002 restoration images are even harder to see because of a brighter backing cloth which has somehow effected the contrast.).","date":"2014-11-22","mins":"11:55 am","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","title":"Image of the Resurrection?"},{"id":"comment-48554","author":"russ_breault","post":"What happened to Walter Mc Crone? I thought the esteemed chemist determined it was nothing more than iron oxide suspended in a thin binder to create a jewelers rouge? And of course the paint was nothing more than vermilion. Why would anyone give notice to other theories when the founder of the Mc Crone Institute has already issued his decree? Didn’t he debunk the Vinland Map? Why consider other theories? Just saying….","date":"2013-10-23","mins":"4:38 pm","url":"https://shroudstory.com/2013/10/23/is-the-shroud-of-turin-a-medieval-photograph/","cat":"image_theory","title":"Is the Shroud of Turin a Medieval Photograph?"},{"id":"comment-51489","author":"russ_breault","post":"Now we are back to the scorch hypothesis? Does anything ever die? I think Thibault Heimburger did a good job dealing with this issue. Https://shroudofturin.files.wordpress.com/2012/10/scorch paper en.pdf.","date":"2013-11-15","mins":"2:06 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-58484","author":"russ_breault","post":"I submitted this to Dan a few months ago. It is a little video called “The Mystery is the Message.” https://vimeo.com/71629598.","date":"2013-12-12","mins":"2:55 pm","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"},{"id":"comment-8581","author":"russ_breault","post":"Dan, this is a good summary of Roger’s theory. I believe that a maillard reaction may account for something. I remember early discussions of this when it was first proposed and many still wonder whether such reaction can account for the photo like quality of the face. It is very possible that more than one thing is responsible for the totality of the image. What still bothers me is the dorsal image. Gases tend to rise. One would think there would be a difference of image intensity between the dorsal and frontal images, yet that is not the case. I am in the maillard plus camp…maillard plus something else. Not sure what, but I can certainly speculate!.","date":"2012-02-21","mins":"10:19 am","url":"https://shroudstory.com/2012/02/21/of-the-crowns-of-fibers-and-the-shroud-of-turin-image/","cat":"image_theory","title":"Of the crowns of fibers and the Shroud of Turin image"},{"id":"comment-49711","author":"russ_breault","post":"Would love to get Ray Downing to comment on this. He is the 3 D animator who developed “The Real Face of Jesus” for History Channel. In a conversation with him, he assured me that he was able to extract a 3 D image from a 2 D surface because the data is there to allow for it..","date":"2013-11-03","mins":"8:40 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","title":"Maybe the 3D data doesn’t mean what we think it does"},{"id":"comment-9277","author":"russ_breault","post":"Thanks for the onion skin comparison, that the skin of an onion is 1000x thicker than image layer on the Shroud. Great word picture. It is hard to articulate to an audience. One I have been using is as follows: Each thread is composed of about 200 microfibers. The image penetrates only the top two AND only effects the top of the fibers. Therefore the image penetrates less than 1% of a single thread. The impurity layer can best be described as being similar to a soapy film..","date":"2012-03-13","mins":"10:51 am","url":"https://shroudstory.com/2012/03/13/revisiting-rogers-evaporation-concentrations-for-scorching-an-image/","cat":"image_theory","title":"Revisiting Rogers’ evaporation concentrations for scorching an image."},{"id":"comment-8919","author":"russ_breault","post":"I agree, this is a great read and a great summary of why the “hot statue” theory is untenable. Funny how all the proponents of such a theory never bother to actually recreate the Shroud thereby proving their hypothesis. Rather their meager attempts have thus far have falsified it according to the basic rules of the scientific method..","date":"2012-03-04","mins":"10:45 am","url":"https://shroudstory.com/2012/03/04/stephen-jones-has-an-important-posting-on-heated-bas-relief-images/","cat":"image_theory","title":"Stephen Jones has an important posting on heated bas relief images"},{"id":"comment-155035","author":"russ_breault","post":"Mc Crone’s copy created by his artist friend was examined by others including Dr. Gilbert Lavoie who debated Mc Crone on Chicago radio. Following Mc Crone’s instructions, the image soaked all the way through the cloth and was visible on the other side, STURP has already determined there is no evidence of capillary action. No liquids were applied to create the image..","date":"2014-09-24","mins":"10:03 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-8928","author":"russ_breault","post":"Colin, your comparison to Piltdown man is exceedingly weak. How does part of a skull and a jawbone fraudulently hyped as the missing link in any way compare with the Shroud? All the detractors of the Shroud allege that it was the work of an artist in some way shape or form. If that is the case, then certainly the process or technique used by the alleged artist should be able to be replicated. Its that simple. So far Mc Crone, Nickell, Allen and others have all been proven wrong. None of them to date, including you have made a credible copy using some alleged medieval technique. It is a reasonable request. If it is the work of an artist, it shouldn’t be that hard to prove..","date":"2012-03-04","mins":"3:35 pm","url":"https://shroudstory.com/2012/03/04/stephen-jones-has-an-important-posting-on-heated-bas-relief-images/","cat":"image_theory","title":"Stephen Jones has an important posting on heated bas relief images"},{"id":"comment-111738","author":"russ_breault","post":"I recall trading messages with Rogers on the SSG. Dan is correct. Although Rogers was looking for a natural explanation for the image, he acknowledged that the lack of decomposition stains supported the biblical claim of resurrection. He wasn’t trying to deny that a miracle occurred, only that the image itself was not miraculous. While I personally don’t agree with the logic of his argument, that is where he was coming from..","date":"2014-05-05","mins":"8:33 am","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","title":"To Yannick on Science and Philosophy"},{"id":"comment-42870","author":"russ_breault","post":"Excellent summary and analysis. I will confess to being guilty as charged as one who holds to a “magical” explanation. One of the reasons is that Rogers himself wasn’t convinced that the maillard reaction alone could explain the high resolution image we see especially of the face and hands. Second, it is hard to imagine that gas emitting from a decaying body could produce an image of identical intensity top to bottom and front to back. Others who have experimented or explored this theory have also indicated that such emission of gases would be more pronounced around bodily orifices but this is not the case. Rogers did not support any supernatural cause of the image yet he acknowledged that the lack of decomposition stains on the cloth supported the resurrection hypothesis. Unless we assume that the body was stolen and the cloth left behind…or that Jesus woke up found Mary Magdalene and headed for the coast of France, then somehow and in some way the body literally disappeared. There are too many verses of scripture that suggest light was involved. So while current experiments with lasers don’t explain everything neither does gas emitting from a decaying body. Perhaps the answer is not an all or none approach but a combination of causes..","date":"2013-09-04","mins":"7:22 am","url":"https://shroudstory.com/2013/09/04/thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","title":"Thoughts on the newly published paper by Ray Rogers (REVISED)"},{"id":"comment-112284","author":"russ_breault","post":"I do not accept the Maillard theory primarily because it is based on gaseous emissions (of ammonia that somehow interacted with a carbohydrate layer.) One of the key attributes of the Shroud image is the intensity of the image is uniform top to bottom and front to back. No difference in image intensity. To think that gaseous emissions could have created such a uniform image is beyond reason. Gas does not escape a decaying corpse in any uniform manner. Thicker parts of the torso would exhibit more decay and therefore more gas emissions. Natural orifices in the body would offer the path of least resistance and should also show more gas emissions. This is not seen on the Shroud. Vignon proposed gas and was dismissed early in Shroud research. Why this is any different is beyond me. Rogers has made important contributions, this is not one of them IMHO..","date":"2014-05-05","mins":"8:52 pm","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","title":"To Yannick on Science and Philosophy"},{"id":"comment-42170","author":"russ_breault","post":"Part of exploring the Shroud is looking at the clues. Some of those clues come from science, others from history. If the Shroud is authentic then there must be clues in the bible as well..","date":"2013-08-27","mins":"8:27 pm","url":"https://shroudstory.com/2013/08/27/when-is-a-scorch-not-a-scorch/","cat":"image_theory","title":"When is a Scorch NOT a Scorch?"}],"key_evidence":[{"id":"comment-72197","author":"russ_breault","post":"My number one reason is the extreme superficiality of the image effecting only the top two microfibers or approximately 1% of a single thread. The image does not penetrate the cloth as does the burns, water stains and bloodstains. This extreme superficial image has the same image intensity top to bottom and front to back. One would think a piece of technology would be required for this phenomenon..","date":"2014-01-04","mins":"12:01 pm","url":"https://shroudstory.com/2014/01/04/what-one-single-characteristic-about-the-shroud/","cat":"uncategorized","title":"What one single characteristic about the shroud  . . . ?"}],"misc":[{"id":"comment-83768","author":"russ_breault","post":"I saw Arlo when he recorded Alice’s Restaurant at the Newport Folk Festival…1969? Not sure the year. My dad was with the Kiwanis club that handled all the concessions. We got in free for many years during my early teens. Then I saw him again about five years ago. Sounded the same 40 years later. I don’t want a pickle, I just want to ride my motorsickle. Congrats on 25 K comments!.","date":"2014-03-01","mins":"8:19 am","url":"https://shroudstory.com/2014/03/01/25000-comments-and-counting/","cat":"news_&_views","title":"25,000 Comments and Counting"},{"id":"comment-29622","author":"russ_breault","post":"Dave, are we throwing out the baby with the bathwater? Perhaps Fanti’s 95% confidence may be overstated but on the face of it, he has provided yet another basis to question the carbon date. The Hungarian Pray Manuscript proves conclusively that the Shroud was in Constantinople prior to 1204 and thereby proves the carbon date is wrong….couldn’t possibly be from 1260 to 1390. In fact the artist who crafted the HPM was an eye witness to the cloth in Constantinople somewhere between 1160 1170…one hundred years older than the oldest carbon date. So we know the carbon date is wrong. How wrong? No one knows. Fanti adds physical evidence to the argument. Rogers decay of vanillin also supports on older date. Is it first century? We will need another carbon date to know that..","date":"2013-04-06","mins":"8:06 am","url":"https://shroudstory.com/2013/04/05/a-committee-far-removed-from-padua/","cat":"news_&_views","title":"A Committee Far Removed from Padua"},{"id":"comment-29492","author":"russ_breault","post":"Yes peer review is needed but MIT and Oxford specifically? We also have to be careful that we are not casting a sheep into a pack of wolves. There are many who would love to discredit the Shroud, who have an anti God world view. Science–yes. Agenda driven science–No. Fanti is accused of this very thing. Yet, most of the scientific community is still hanging on to C 14 as the final arbiter of truth. The review posted yesterday did a good job of questioning Fanti’s samples and methodology–all the reasons why it may be flawed. I also want to hear all the reasons why he may be onto something significant. Is it possible to get that balance? So far all I have heard in this forum is why it is unreliable..","date":"2013-04-05","mins":"10:54 am","url":"https://shroudstory.com/2013/04/05/a-committee-far-removed-from-padua/","cat":"news_&_views","title":"A Committee Far Removed from Padua"},{"id":"comment-46662","author":"russ_breault","post":"This is a fabulous article because it show so many pictures of the procession through Old Jerusalem. I keep thinking of how it might have been when they were taking Jesus from Golgotha to the tomb. What kind of procession? Were there people lining the streets? What a perfect example to illustrate the Shroud!.","date":"2013-10-09","mins":"11:14 am","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-15069","author":"russ_breault","post":"Great find! I hope she stays engaged in Shroud research. We need the younger generation to pick up the torch. I do have a question about the xx chromosome. I had never heard that before. Where was that published? Is that Garza Valdez?.","date":"2012-08-16","mins":"11:01 am","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","title":"A Winning Shroud of Turin Expository Speech"},{"id":"comment-15099","author":"russ_breault","post":"Chris, I agree. She did a fine job on her presentation but she should not have made a big deal about something so speculative. But I do hope she stays with her research. We need more young people like her to get excited and run with the message..","date":"2012-08-16","mins":"9:28 pm","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","title":"A Winning Shroud of Turin Expository Speech"},{"id":"comment-8869","author":"russ_breault","post":"Thanks Randy, it was great to meet you. I was at the University of St. Thomas today with a packed house. I have an interview with the local Fox affiliate on Saturday morning and then back home. If you can watch, I should be on between 7:30 and 9:00. Not exactly sure when..","date":"2012-03-01","mins":"5:12 pm","url":"https://shroudstory.com/2012/03/01/excellent-interview-with-the-creator-of-shroud-encounter/","cat":"news_&_views","title":"Excellent Interview with the creator of Shroud Encounter"},{"id":"comment-70831","author":"russ_breault","post":"This speaks volumes about Mc Crone’s legendary arrogance. I would trust the science of Adler and Heller long before I would give any credence to Mc Crone. He was wrong on the Vinland Map too..","date":"2014-01-01","mins":"9:23 am","url":"https://shroudstory.com/2013/12/31/favorite-stupid-stupid-science-picture-for-2013/","cat":"science","title":"Favorite Stupid, Stupid Science Picture for 2013"},{"id":"comment-32599","author":"russ_breault","post":"I don’t know how God plans to use the Shroud in the future. Personally I am happy with the Shroud as an unsolved mystery. I like the intrigue of it. I don’t think it was meant to be a substitute for faith. Sure I rejoice when new data supports authenticity…but absolute proof is not necessary nor do I think we will ever get there. Is there a message in the mystery? Absolutely! All the deep things of God are all mysteries anyway. The fact that the Shroud remains a mystery after all the analysis is one of its strongest claims for authenticity! If it was an obvious work of art, we would have figured that out years ago..","date":"2013-05-02","mins":"9:21 am","url":"https://shroudstory.com/2013/05/02/good-question-what-would-proving-shroud-do/","cat":"news_&_views","title":"Good Question: What would ‘proving’ Shroud do?"},{"id":"comment-45935","author":"russ_breault","post":"I remember the quote from Frei. Even then, I couldn’t figure out how pollen could indicate anything other than the cloth’s probable presence in the Middle East at some time in its history. How he ever concluded that it was 2,000 years old based on pollen is beyond me. Sounds like wishful thinking. I’m not saying he is wrong, its just that pollen data cannot provide that conclusion..","date":"2013-09-30","mins":"1:13 pm","url":"https://shroudstory.com/2013/09/30/how-things-get-reported-in-the-media/","cat":"news_&_views","title":"How things get reported in the media"},{"id":"comment-23587","author":"russ_breault","post":"Funny ad except for the last line. Some stains ARE sacred!.","date":"2013-02-06","mins":"10:05 am","url":"https://shroudstory.com/2013/02/06/miracle-stain/","cat":"humor","title":"Miracle Stain"},{"id":"comment-21784","author":"russ_breault","post":"Isn’t this fragment from the 4th century? For the life of me, I don’t know why any credence is given to a single document, a small fragment thereof, with a cryptic reference to Jesus and “wife” in the same sentence without knowing the larger context….and written 300 years after the events in question. It just goes to show that there is an element in the world and unfortunately in the church too, that want to humanize Jesus as much as possible. It reminds me of the pop song by Joan Osborne, “What if God was one of us? Just a slob like one of us, just a stranger on the bus trying to make his way home.”.","date":"2013-01-09","mins":"10:36 am","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","title":"Jesus’ Wife Papyrus Update"},{"id":"comment-25413","author":"russ_breault","post":"Funny how both lead actors have the name “Christ” in their name…Christopher Walken and Christian Slater. Hmmmmm Maybe they’re onto something!.","date":"2013-02-23","mins":"12:39 pm","url":"https://shroudstory.com/2013/02/23/more-on-the-power-of-few-movie/","cat":"news_&_views","title":"More on The Power of Few Movie"},{"id":"comment-35447","author":"russ_breault","post":"Great example of how arrogant Mc Crone was. His arrogance allowed him to get away with shoddy work and then pretend how his analysis was so superior to others. The Vinland Map episode clearly shows that Mc Crone’s pride wouldn’t even let him admit it when he was clearly proven wrong..","date":"2013-05-31","mins":"8:04 am","url":"https://shroudstory.com/2013/05/31/photograph-for-today/","cat":"news_&_views","title":"Photograph for Today"},{"id":"comment-150689","author":"russ_breault","post":"Dan, I agree with this in general, however when it comes to the Shroud, I see mystery as a key component. All the deep things of God are all mysteries. Who can explain the Incarnation–the Word made flesh? Even the resurrection–how does a body just disappear? How does that same body walk on water or pass through a wall? How does one command a storm or feed 5,000 with a boys lunch? The Church may call them miracles but I just call them mysteries. So, if today we discovered a collection of relics associated with Jesus, and one of them was his burial shroud, the cloth that wrapped his bloody crucified body and was impacted by the resurrection event, wouldn’t it be consistent that the cloth itself would also remain a mystery? The fact that the Shroud of Turin remains a mystery, despite thousands of hours of analysis is not proof of authenticity, but it is consistent with the deep things of God, which are all mysteries..","date":"2014-09-13","mins":"8:39 am","url":"https://shroudstory.com/2014/09/13/mystery-is-never-ever-proof-of-anything/","cat":"science_and_religion","title":"Mystery is never ever proof of anything"},{"id":"comment-2761","author":"russ_breault","post":"Wow, that is really depressing. Of course Paul writes in Thessalonians about the great apostasy so I shouldn’t be surprised..","date":"2011-03-30","mins":"5:39 pm","url":"https://shroudstory.com/2011/03/30/physicists-predict-the-end-of-religion/","cat":"news_&_views","title":"Physicists Predict the End of Religion"},{"id":"comment-40431","author":"russ_breault","post":"It is good that the Shroud is used as a metaphor for anything mysterious. Despite the reference however, there are still vast swaths of people, especially young people who are totally unaware. Maybe they will take to Wikipedia to uncover the meaning. Most however won’t make the effort. Kudos to all who do what they can to advance the knowledge of the Shroud..","date":"2013-08-04","mins":"12:37 pm","url":"https://shroudstory.com/2013/08/04/remember-when-nobody-had-heard-of-the-shroud-of-turin/","cat":"humor","title":"Remember When Nobody Had Heard of the Shroud of Turin?"},{"id":"comment-22421","author":"russ_breault","post":"Actually I am glad to see the Shroud included in a prophecy conference. I have always felt the message of the Shroud is past present and future. It is past because it speaks to the empty tomb, or more significantly, the vacant shroud which was the first piece of evidence that something extraordinary occurred. It is present in that the Shroud uniquely displays the price that was paid for our salvation. Scripture uses words like “ransom” that we were “bought” and that we were “purchased” and “redeemed”. What was the price? It is clearly displayed on the Shroud. But it is also future and that enters the realm of the prophetic. And why not, nearly one third of the bible is prophetic in nature. How is the Shroud prophetic? It speaks to a future event. Jesus is called, “the firstfruits of the resurrection.” That implies that whatever happened to Jesus in the tomb is what will happen to all who believe at some point in the future. This is what First Corinthians 15 talks about when Paul says, “Behold I show you a mystery, we will not all sleep, but we will all be changed, in a moment, in a flash, in the twinkling of an eye.” The amazing thing is that Paul is not talking about Jesus in this passage but about the ultimate resurrection of all who believe. There are many such prophecy conferences, this is the only one that has embraced the Shroud and I am glad they did. I hope it opens new doors of discussion. I think the Shroud should be included in paranormal conferences too! Why not…if the Shroud is authentic, then it recorded the greatest paranormal event of all time. Perhaps there are other venues where the Shroud can be discussed. I would love to hear about them..","date":"2013-01-22","mins":"11:44 pm","url":"https://shroudstory.com/2013/01/22/pitn-taking-advantage-of-the-shroud-of-turin/","cat":"news_&_views","title":"PITN Taking Advantage of the Shroud of Turin"},{"id":"comment-40461","author":"russ_breault","post":"I have not checked Wikipedia lately. I just assumed it would be the first place many people would check. Maybe we need to get more active on Wikipedia to set the record straight!.","date":"2013-08-04","mins":"11:18 pm","url":"https://shroudstory.com/2013/08/04/remember-when-nobody-had-heard-of-the-shroud-of-turin/","cat":"humor","title":"Remember When Nobody Had Heard of the Shroud of Turin?"},{"id":"comment-19684","author":"russ_breault","post":"BT makes a good point. This is exactly why I never say that the Shroud is in fact the burial cloth of Jesus. Based on data for and against, assessing the preponderance of evidence, I believe it could be. That is far as I can take it. The Catholic church does not officially call it a relic or an icon, they recognize it as a “symbol of Christ’s suffering worthy of veneration.” I like the use of the word symbol, it forges a middle path. Whether authentic or not, it certainly remains a symbol. However, the word I use is mystery. It is a profound mystery and why not, all the deep things of God are all mysteries anyway. Who can comprehend either the incarnation or the resurrection? Seems reasonable that the Shroud would remain a mystery too..","date":"2012-11-30","mins":"1:04 pm","url":"https://shroudstory.com/2012/11/30/strong-ignorance-is-not-strong-evidence/","cat":"news_&_views","title":"Strong ignorance is not strong evidence"},{"id":"comment-216561","author":"russ_breault","post":"You have totally ruined my routine! Now what am I going to read in the morning? The news? How boring. Thanks Dan for all your work on this blog. There have been many many stellar contributions. I hope one day to get to Hilton Head to see you again like I did in NYC. Be blessed in your new phase of life..","date":"2015-12-15","mins":"7:59 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-73308","author":"russ_breault","post":"It is an interesting video however the laughable part is how he describes the backing cloth, patches and particulate matter removed in 2002 are now available for additional study. Really? It has been 12 years since the “restoration” and I am not aware of anyone having access or doing any research on these items..","date":"2014-01-14","mins":"9:45 am","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","title":"The Questionable Restoration of the Shroud of Turin"},{"id":"comment-197294","author":"russ_breault","post":"As far as I am concerned, the verdict is still out. It is not enough to simply claim the cloth is medieval without offering a credible process the alleged artist used to create this masterpiece. We are clearly looking for an artist who predated Leonardo by several hundred years. Charles Freeman has offered the most recent hypothesis but it too fails to explain why the blood penetrated the cloth whereas the paint did not, nor is it credible to assume that every speck of paint used to form the image has now disappeared. Garlaschelli’s attempt was compelling but still does not replicate the fine gradient that correlates with body to cloth distance, nor does it account for no image being under the blood. Contest this point all you want, this was a clear determination of STURP—you know, the scientists who had hands on access to the cloth for five days and nights. I also get annoyed when the cloth’s obvious origin in Constantinople is conveniently ignored so as to allege the history only begins in the 1300’s. This is irresponsible in view of the numerous documents both historical and visual that give strong evidence for the Shroud being stolen in 1204 by the French during the 4th Crusade. Too many unanswered questions for the Shroud to be dismissed as a Medieval fake..","date":"2015-04-23","mins":"7:31 am","url":"https://shroudstory.com/2015/04/23/the-real-meaning-is-not-authenticity/","cat":"2015","title":"The Real Meaning Is Not Authenticity"},{"id":"comment-9149","author":"russ_breault","post":"I was intrigued and was waiting for his meter to respond…but then he took a break, edited the video and obviously doctored the results…or so it seems. Needless to say, I won’t be running out to buy his ELF meter..","date":"2012-03-10","mins":"9:49 am","url":"https://shroudstory.com/2012/03/08/the-holy-ghost-communications-channel-and-the-shroud-of-turin/","cat":"tinfoil_hats","title":"The Holy Ghost Communications Channel and the Shroud of Turin"},{"id":"comment-198215","author":"russ_breault","post":"FANTASTIC DAN! Kudos to you and all your work to keep this blog going. You are making an important contribution to the work of the Shroud and all of us who read and contribute greatly appreciate it. May you be blessed for your efforts..","date":"2015-05-03","mins":"1:48 pm","url":"https://shroudstory.com/2015/05/03/three-millions-page-views/","cat":"uncategorized","title":"Three Millions Page Views"},{"id":"comment-149654","author":"russ_breault","post":"God help us. What total nonsense. This plays right into what many fundamentalists have said about the Shroud, that it is a tool of satan to deceive. While I categorically reject that notion, it is curious to see how the Shroud is being used to validate certain “false Christs” Jesus warned about. I guess imitation is the sincerest form of flattery. It would be hard for satan to produce a counterfeit shroud, but he could use the real shroud to promote a counterfeit Christ. Very clever…but should we expect any less from the serpent who has made deception an art form?.","date":"2014-09-09","mins":"9:29 am","url":"https://shroudstory.com/2014/09/09/tinfoil-hat-version-of-face-matching/","cat":"tinfoil_hats","title":"Tinfoil Hat Version of Face Matching"}],"opinion":[{"id":"comment-213507","author":"russ_breault","post":"Add this to the arsenal as well, from Hebrews 2:3 4 “This salvation, which was first announced by the Lord, was confirmed to us by those who heard him. God also testified to it by signs, wonders and various miracles, and by gifts of the Holy Spirit distributed according to his will.”.","date":"2015-10-24","mins":"12:42 pm","url":"https://shroudstory.com/2015/10/24/and-now-you-have-something-to-do-this-weekend/","cat":"other_blogs","title":"And now you have something to do this weekend"},{"id":"comment-180552","author":"russ_breault","post":"I find it both strange and ironic that people who believe God exists at the same time assert we can find no evidence of His existence. I will never understand this point of view. Apply Occum’s Razor to the subject of creation and the answer is quite obvious. If it walks like a duck… But not when it comes to the debate over origins. Apparently common sense has no place in this debate. Any time an evolutionist mentions “design” it must always be preceded with the adjective “apparent” because it is not actual design but only apparent. Try applying this logic to anything else in life and you would be a candidate for psychiatric care. The earliest symbol of the Christian faith is the fish because Jesus said “follow me and I will make you fishers of men.” I have determined that the fish in question is a COD. It stands for Complexity, Order and Design. All of life demonstrates these three primary attributes. I will never believe that randomness and chance (even with adding natural selection and time to the equation) can ever produce living structures characterized by COD. This is achieved through plan and purpose which can only be derived from intelligence..","date":"2015-01-01","mins":"10:05 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-167162","author":"russ_breault","post":"It is not a huge revelation that we all filter information according to our world view, our preconceived ideas and opinions. It is standard psychology that information that conflicts with our world view creates cognitive dissonance and must either be rejected (most likely) or accepted and integrated (less likely). For those who hold strong opinions, conflicting information must be very persuasive to effect a change in that opinion. We cannot tolerate being in a state of confusion so we form opinions that integrates information in accordance with our world view and rejects everything else. The white lab coat of pure objectivity is an illusion. Everyone has a bias and no one has all the information available on a given topic. This is exactly why the legal system of prosecutor and defense with 12 jurors is so important. Not only will both lawyers present radically different views of the facts it is now up to 12 individuals to come to a reasoned consensus. Each juror heard something different from the testimony of witnesses and evidence presented by both sides. It is the closest we will ever get to the truth–and even then they get it wrong from time to time. I have often said that when it comes to the Shroud, we cannot get to a verdict that is “beyond a reasonable doubt” as in a criminal trial. However, I believe the “preponderance of evidence” will support authenticity. But then again, thats my opinion based on my world view!.","date":"2014-10-31","mins":"6:04 am","url":"https://shroudstory.com/2014/10/31/how-knowledge-is-created-the-shroud-of-turin/","cat":"other_blogs","title":"How Knowledge is Created:  The Shroud of Turin"},{"id":"comment-167363","author":"russ_breault","post":"Exactly!.","date":"2014-10-31","mins":"3:59 pm","url":"https://shroudstory.com/2014/10/31/how-knowledge-is-created-the-shroud-of-turin/","cat":"other_blogs","title":"How Knowledge is Created:  The Shroud of Turin"},{"id":"comment-213411","author":"russ_breault","post":"She can be forgiven for linking Mc Crone to the C 14 tests, he did call for the tests to be done. But as an art critic, the most important part of the article is the last half. She skillfully counters Mc Crone’s attribution of two paintings now in Florida, one to Da Vinci and the other to Raphael. She challenges his assessment based on her intricate knowledge of both artist’s style and technique. She is not the only one to question Mc Crone’s judgement in the realm of art. This is important because in the world of chemistry he carries high credentials yet where he inserted himself into art authentication, many seriously question his methodology and expertise. This article is just one example..","date":"2015-10-23","mins":"5:54 am","url":"https://shroudstory.com/2015/10/23/proof-that-art-experts-are-not-always-right/","cat":"other_blogs","title":"Proof that art experts are not always right"},{"id":"comment-205235","author":"russ_breault","post":"Hey Dan, glad to see the Shroud made it to the top of his list of relics!.","date":"2015-07-11","mins":"7:07 am","url":"https://shroudstory.com/2015/07/11/ignorance-with-wings/","cat":"other_blogs","title":"Ignorance with Wings"},{"id":"comment-8709","author":"russ_breault","post":"Well said Dan–both post and comment!.","date":"2012-02-25","mins":"10:45 am","url":"https://shroudstory.com/2012/02/25/the-coloration-is-a-caramel-like-product-or-the-product-of-an-aminocarbonyl-reaction/","cat":"other_blogs","title":"The coloration is a caramel-like product or the product of an amino/carbonyl reaction"}],"researchers":[{"id":"comment-31969","author":"russ_breault","post":"Barrie’s quote from Sherlock Holmes is perfect. I may have to steal it..","date":"2013-04-26","mins":"10:33 am","url":"https://shroudstory.com/2013/04/26/barrie-schwortz-this-has-to-be-what-it-appears-to-be/","cat":"news_&_views","title":"Barrie Schwortz: This has to be what it appears to be"},{"id":"comment-21492","author":"russ_breault","post":"Wow…and she is a teenager! There is hope for world afterall. She did a fantastic job…I have a feeling her dad is in the video production business…very well done..","date":"2013-01-02","mins":"6:11 pm","url":"https://shroudstory.com/2013/01/02/david-rolfe-some-hip-dude-in-england/","cat":"other_blogs","title":"David Rolfe, some hip dude in England"},{"id":"comment-57111","author":"russ_breault","post":"It cannot be taken as authoritative. However it is excellent anecdotal evidence supporting the premise that the 1988 tests were flawed. For that reason, Fanti’s contribution is significant. In view of the fact that it has been 25 years and no additional carbon date has been authorized, what are researchers supposed to do—sit on their hands? I applaud Fanti for pursuing a different tact..","date":"2013-12-07","mins":"11:54 am","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-163756","author":"russ_breault","post":"Fanti may be the only researcher who has funding from a university. As such, he is able to conduct experiments, do diligent research and publish the results albeit in book form. He is a dedicated scientist and my only wish is that his books were made available in English..","date":"2014-10-19","mins":"9:13 am","url":"https://shroudstory.com/2014/10/19/an-interview-with-giulio-fanti/","cat":"news_&_views","title":"An Interview with Giulio Fanti"},{"id":"comment-199883","author":"russ_breault","post":"John, I loved your discourse on the HPM. You are right on the money..","date":"2015-05-22","mins":"12:26 pm","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin"},{"id":"comment-146528","author":"russ_breault","post":"Wish I could go! It was great seeing them in Colorado Springs at the recent Prophecy Conference–along with Barrie Schwortz and Pete Schumacher who just happened to be in the area!.","date":"2014-08-27","mins":"11:01 am","url":"https://shroudstory.com/2014/08/27/john-and-rebecca-jackson-to-speak-at-conference-in-hanover-pennsylvania/","cat":"presentation","title":"John and Rebecca Jackson to Speak at Conference in Hanover, Pennsylvania"},{"id":"comment-54442","author":"russ_breault","post":"Kelly, I thought your post was spot on and quite aromatic. Thanks for improving the aroma!.","date":"2013-12-01","mins":"3:45 pm","url":"https://shroudstory.com/2013/12/01/remembering-shroud-blood-scientist-dr-john-h-hellera-guest-posting-by-kelly-kearse/","cat":"uncategorized","title":"Remembering Shroud Blood Scientist Dr. John H. Heller–A Guest Posting by Kelly Kearse"},{"id":"comment-34846","author":"russ_breault","post":"Thanks Ron. Music by Al Marconi..","date":"2013-05-26","mins":"1:41 am","url":"https://shroudstory.com/2013/05/24/a-powerpoint-from-russ-breault/","cat":"news_&_views","title":"A PowerPoint from Russ Breault"},{"id":"comment-36640","author":"russ_breault","post":"Personally I think his one your lecture at the BSTS last year was more significant than his book. Here is the link. Scroll down a little to find it. Well worth watching. Http://www.shroud enigma.com/BSTS/bsts uk homepage.html.","date":"2013-06-10","mins":"2:33 pm","url":"https://shroudstory.com/2013/06/09/in-case-anyone-thinks-thomas-de-wesselow-isnt-important/","cat":"books","title":"In case anyone thinks Thomas de Wesselow isn’t important"}],"resources":[{"id":"comment-200421","author":"russ_breault","post":"The old saying is that if you repeat a lie often enough people will believe it. I find it strange that all of the forensic pathologists who have studied the Shroud say the man was dead. I guess their testimony doesn’t mean anything..","date":"2015-05-28","mins":"7:39 am","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"id":"comment-168693","author":"russ_breault","post":"A few years ago I did a presentation for the American Chemical society called “The Battle of the Chemists.” In it I compared Mc Crone’s findings and his methodology with the findings of Dr’s Alan Adler and John Heller using the same instruments (SEM) but with a different and more thorough methodology and consequently found something quite different. Now it appears we have the battle of the historians. Enter Thomas de Wesselow, Postdoctoral Research Associate at Cambridge University, studied art history at Edinburgh University and was a research scholar at the British School in Rome—seems to have all the academic credentials one would need to have a legitimate dog in the fight. Here is the take away quote from his book, The Sign (2012): “Accepting the carbon date (as true), art historians should have leaped on the Shroud as on of the most fascinating visual creations of the medieval period, a true masterpiece of devotional imagery. Strangely though, they have remained almost entirely silent. The reason is simple: the negative photo of the cloth is an unmistakable sign that the Shroud’s famous image could not have been created by a medieval artist. Technically, conceptually and stylistically the Shroud makes no sense as a medieval artwork. The field of art history has had over a century to study the Shroud since it was first photographed. And in all that time no art historian has ever ventured to attribute it to a medieval artist.” End quote. So I guess kudos are in order for Charles Freeman in that he has gone where no art historian has yet to venture–however he has yet to address de Wesselow’s key assertion that “technically, conceptually, and stylistically the Shroud makes no sense as a medieval artwork.” As a personal comment, It does seem rather bizarre that the Shroud is a perfect negative which means the reverse positive image we see through photography would have been a complete accident–totally unknown to the alleged artist who crafted the image. That seems to stretch credulity to the breaking point..","date":"2014-11-04","mins":"3:47 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-101672","author":"russ_breault","post":"The extreme superficiality of the image, effecting only the top one or two micro fibers implies that, by way of explanation, that if someone shaved the surface of the cloth the image would disappear..","date":"2014-04-20","mins":"11:24 am","url":"https://shroudstory.com/2014/04/20/myra-adams-the-larger-question-for-easter-sunday-is-how-did-the-shroud-survive/","cat":"press_coverage","title":"Myra Adams:  The larger question for Easter Sunday is how did the Shroud survive"},{"id":"comment-192993","author":"russ_breault","post":"Rick, I almost always tell people that I am 90% certain it is authentic, I will always give 10% to the possibility that it is the work of some medieval artist who predated Leonardo by several hundred years, we don’t know who he is, we don’t know how he did it, and he never did anything else of any significance. I guess that is possible but not very likely in my opinion. As far as whether Jesus left something behind, he surely did. In fact it was the “linen cloth lying there” that was the first piece of evidence that Jesus rose from the dead. The only question is whether the Shroud of Turin is the same cloth..","date":"2015-03-09","mins":"5:46 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"id":"comment-209945","author":"russ_breault","post":"I read “The Untold Story of the Holy Shroud” by Carlos Evaristo and was impressed by how much support the history of the cloth while in possession of the Savoy’s gave credence to the reweave theory..","date":"2015-09-09","mins":"5:54 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"},{"id":"comment-193055","author":"russ_breault","post":"My whole mission for the past 35 years is finding and using the middle path. I fully recognize there are gaps in the data. C 14 is not a settled issue one way or the other. That said, do we just sit on our hands until we have absolute proof? I will be in heaven with the angels before that happens. The middle path is this: Can we use the Shroud for its phenomenal witness for Christ even though we don’t have absolute proof of authenticity? And the answer is a resounding YES as long as we recognize the message is what matters. Either the Shroud is the authentic burial cloth of Christ or it represents the biblical truths upon which it is based. I always say, “Explore the Mystery–Encounter the Message”. The message remains the same regardless of authenticity. Do I think it is authentic? Yes. Do I hope it is authentic? Yes. Can I prove it absolutely? No. Can I still use it effectively as a unique way of telling the “Greatest story ever told”? Absolutely! The enduring mystery of the Shroud is what makes it so compelling. “It is the glory of God to conceal things, but the glory of kings is to search things out.” Proverbs 25:2 ESV.","date":"2015-03-10","mins":"10:48 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"id":"comment-29215","author":"russ_breault","post":"The sad truth is that the media will rarely pick up a positive story about Christianity outside of Holy Week or Christmas. These are the two times they are actually looking for stories with a Christian theme. Otherwise its back to business bashing the Church and any kook who claims to be believe. The fact that Fanti chose to publish in a book first doesn’t surprise me. It allowed him to control when and what was released to the media and it worked. The story was picked up all over the world. One never knows IF a paper will be accepted or WHEN they will publish AND it is surely frowned upon to submit to more than one journal at a time so the process leaves the author completely powerless. Fanti controlled the situation and I don’t blame him. I agree with others that he now needs to publish in English and hopefully to a respectable journal…but if it is turned down…so what…his book is published and the media ran with it. It ended up being a trifecta for the Shroud with the Pope’s exhibition, Shroud 2.0 AP and Fanti’s book..","date":"2013-04-03","mins":"10:33 am","url":"https://shroudstory.com/2013/04/03/giulio-fanti-tie/","cat":"books","title":"Giulio Fanti’ Tie"},{"id":"comment-82938","author":"russ_breault","post":"The morning of the resurrection, Jesus said to Mary, “Why do you seek the living among the dead?” In similar fashion, one might ask, “Why do you look for a naturalistic explanation when clearly the event in question is beyond anything natural?” The only “natural” explanation would involve the bloodstains being in contact with a corpse. There is no such explanation for the image. The only natural explanation for the image would be that it is the result of some medieval artistic process. If this shroud did indeed wrap the body of Jesus, it is pointless to invoke ball lightning, or neutron radiation from an earthquake or anything else, because none of these theories deal with the fact that the body disappeared. Any theory that assumes this cloth belonged to Jesus must account for the missing body..","date":"2014-02-27","mins":"1:39 am","url":"https://shroudstory.com/2014/02/26/giulio-fantis-book-launched/","cat":"books","title":"Giulio Fanti’s Book Launched"},{"id":"comment-189096","author":"russ_breault","post":"Glad it is getting good press. I am surprised they used the title of an earlier book on the Shroud by the same title in 1974 by Thomas Humber. It was republished in 1978 as Sacred Shroud. It should actually be called the First Gospel!.","date":"2015-02-04","mins":"10:47 am","url":"https://shroudstory.com/2015/02/04/a-most-anticipated-book-of-spring-2015-about-the-shroud-of-turin/","cat":"books","title":"A Most Anticipated Book of Spring 2015:  About the Shroud of Turin"},{"id":"comment-30762","author":"russ_breault","post":"Regarding Father Peter Rinaldi, he would always say that you can’t leave people at the Shroud, but that you need to lead them “from the linen to the Lord.”. He never wanted people to base their faith on the Shroud but that it simply yet prodoundly points the way..","date":"2013-04-14","mins":"10:55 am","url":"https://shroudstory.com/2013/04/13/john-klotz-unpacks-details-about-the-1988-debacle/","cat":"books","title":"John Klotz unpacks details about the 1988 debacle"},{"id":"comment-83182","author":"russ_breault","post":"If the Shroud of Turin belonged to Jesus, then it was subjected to a resurrection event. Science needs to figure out how a 180 pound man converted to light in less than a second and didn’t level Jerusalem in the process! IMHO..","date":"2014-02-27","mins":"5:58 pm","url":"https://shroudstory.com/2014/02/26/giulio-fantis-book-launched/","cat":"books","title":"Giulio Fanti’s Book Launched"},{"id":"comment-208610","author":"russ_breault","post":"Simon Brown is very pro Shroud and a strong evangelical at the same time. His view is that the Shroud should be used or promoted in the context of world evangelism. He tends to overstate things but I admire his zeal..","date":"2015-08-20","mins":"8:06 am","url":"https://shroudstory.com/2015/08/20/new-book-on-the-shroud-of-turin-2/","cat":"books","title":"New Book on the Shroud of Turin"},{"id":"comment-185806","author":"russ_breault","post":"Papers may be corrected but not videos. I have no plans to take it down. I can add a correction if need be to the metadata that describes the video..","date":"2015-01-23","mins":"5:52 pm","url":"https://shroudstory.com/2015/01/23/should-a-st-louis-conference-paper-be-withdrawn/","cat":"paper_chase","title":"Should a St. Louis Conference Paper be Withdrawn?"},{"id":"comment-168412","author":"russ_breault","post":"So someone depicts Christ with more scourge marks than the artistic norm at the time and that’s proof the Shroud is an Easter prop? All the paint just happened to flake off? I might add that none of these images show any anatomical realism–they just show the body scourged more than usual. How these images from the Holkham bible are used as a reference point seems a little obtuse..","date":"2014-11-03","mins":"7:59 pm","url":"https://shroudstory.com/2014/11/03/the-holkham-bible-recently-much-mentioned/","cat":"books","title":"The Holkham Bible Recently Much Mentioned"},{"id":"comment-182196","author":"russ_breault","post":"Charles, if the gesso you mentioned was applied to the cloth ahead of time as a preparation to receive the paint pigments, why does the blood soak all the way through? Wouldn’t the same gesso have kept the blood on the surface as well? Blood is no more liquefied than paint. Then of course, if it is not blood at all but only vermilion as Mc Crone alleged, then again, why did it soak through yet paint forming the body image remained only on the surface? You can allege that that the supposed artist in question applied gesso after the blood, however I would find this to be a tortured hypothesis indeed. Knowing where the blood was supposed to go prior to the application of the image would be nearly impossible and clearly unnecessary for it to function as an Easter prop as you have postulated..","date":"2015-01-09","mins":"12:49 pm","url":"https://shroudstory.com/2015/01/08/an-early-morning-google-find/","cat":"video","title":"An Early Morning Google Find"},{"id":"comment-182266","author":"russ_breault","post":"Why does this sound like nothing that can be related to the Shroud? Gesso? I guess not! “Gesso”, also known “glue gesso” or “Italian gesso”[2] is a traditional mix of an animal glue binder (usually rabbit skin glue), chalk, and white pigment, used to coat rigid surfaces such as wooden painting panels as an absorbent primer coat substrate for painting. The colour of gesso was usually white or off white. Its absorbency makes it work with all painting media, including water based media, different types of tempera, and oil paint. It is also used as a base on three dimensional surfaces for the application of paint or gold leaf.[3] Mixing and applying it is an art form in itself since it is usually applied in 10 or more extremely thin layers. It is a permanent and brilliant white substrate used on wood, masonite and other surfaces. The standard hide glue mixture is rather brittle and susceptible to cracking, thus making it suitable for rigid surfaces only. For priming flexible canvas, an emulsion of gesso and linseed oil, also called “half chalk ground”, is used.[4] In geology, the Italian “gesso” corresponds to the English “gypsum”, as it is a calcium sulfate mineral (Ca SO4·2 H2 O). Funny how no binder was found on the Shroud, no evidence of animal protein, and it is certainly not a rigid surface. The notion that gesso was used to treat the Shroud seems far fetched at best. IMHO.","date":"2015-01-09","mins":"11:44 pm","url":"https://shroudstory.com/2015/01/08/an-early-morning-google-find/","cat":"video","title":"An Early Morning Google Find"},{"id":"comment-174676","author":"russ_breault","post":"Thanks Mike and David. It is my happy contribution. Barrie does Shroud.com–the world’s primary archive and research site, Dan does the daily blog and I try to do streaming media. Seems like a good balance of labor and resources..","date":"2014-12-04","mins":"7:20 pm","url":"https://shroudstory.com/2014/12/03/revised-st-louis-conference-videos/","cat":"other_sites","title":"Revised St. Louis Conference Videos"},{"id":"comment-77518","author":"russ_breault","post":"David, the evidence for the image appearing faintly on the other side of the cloth is not well accepted. It is very hard to discern, if at all. And as Dan always points out, our mind is prone to play tricks on us causing us to “see” what is really not there. However, if the image on the reverse side is really there, it is not because any substance soaked through to the other side as with the blood and water stains. In fact it would lend support to Jackson’s collapse theory..","date":"2014-02-08","mins":"1:52 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-189572","author":"russ_breault","post":"They interviewed me for the Shroud segment but I have no idea how this is going to come out. The best we can hope for is something balanced..","date":"2015-02-06","mins":"12:35 am","url":"https://shroudstory.com/2015/02/05/set-your-dvr-an-unprecedented-cnn-event-on-march-1/","cat":"video","title":"Set Your DVR:  An Unprecedented CNN Event on March 1"},{"id":"comment-39159","author":"russ_breault","post":"All the deep things of God are all mysteries. Who can really understand the incarnation–much less the resurrection? How does someone calm a storm with a command? How does someone feed five thousand with a boy’s lunch? All of these are mysteries beyond our human understanding. If the Shroud was an obvious work of art–we would have figured that out years ago. So it stands to reason that the Shroud, if authentic, would defy explanation despite thousands of hours of scientific analysis. In my view, one of the strongest arguments for the Shroud’s authenticity is that it remains a mystery..","date":"2013-07-17","mins":"10:02 pm","url":"https://shroudstory.com/2013/07/16/the-investigator-new-film-about-the-death-and-resurrection-of-christ/","cat":"movie","title":"The Investigator:  New Film About the Death and Resurrection of Christ"},{"id":"comment-77753","author":"russ_breault","post":"My rudimentary understanding of Gnosticism was that they rejected the belief that Jesus came in the flesh because they considered the physical world to be evil. That would have made Jesus evil too. Consequently they believe that he only came in spirit thus denying the incarnation. It seems that John wrote the book of First John to expressly confront some of these early Gnostic views. So why in the world would a Gnostic artist create a burial shroud with the image of a crucified man when that only seems to confirm that Jesus did indeed come in the flesh. I further believe that early iconographic representations of Jesus whether independent or based on the Shroud itself such as the Sinai Icon, were meant to be clear statements that Jesus did indeed come in the flesh…and here is a picture..","date":"2014-02-09","mins":"9:42 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-181032","author":"russ_breault","post":"I guess the question is whether the Italian professor is Fanti or Garlaschelli..","date":"2015-01-03","mins":"10:08 am","url":"https://shroudstory.com/2015/01/03/television-an-italian-professor-believes-he-has-the-answer/","cat":"video","title":"Television:  An Italian Professor believes he has the answer."},{"id":"comment-153329","author":"russ_breault","post":"Dave, I agree with you. Unfortunately I could not see the slides. I told them which ones to use but they messed up the order so what I was describing was not what was being shown. Too bad. Very disappointing..","date":"2014-09-21","mins":"7:34 pm","url":"https://shroudstory.com/2014/09/20/time-out-productions-presents-russ-breault/","cat":"video","title":"Time Out Productions presents Russ Breault"}]}
