{"archaeology":[{"author":"sampath_fernando","post":"You may be correct OK but St. Thomas must have sent some sort to progress to Jerusalem (to James). So today we can’t read any of those historical documents from early church. Most probably those documents must have got destroyed in 70AD.","date":"October 14, 2015 at 5:28 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"author":"sampath_fernando","post":"Hi Louis – What about your views regarding compilation of New Testament? If they have come out from catacombs then how did they selects 29 books out of many. Why they discard so many?","date":"October 14, 2015 at 4:43 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"author":"sampath_fernando","post":"We are leaning from each other. So I respect everyone.Piero – And … if the Shroud had been a gift of the Magi?From where did they come to Bethlehem?How did Magi came to see Jesus. Did they walk? Did they come by Camels? or Did they come by some sort of Horse cart?No one knows definite answers to those question. Same way no one know how that linen cloth came to Jeruselem. Joseph of Arimathea must have paid paid a lot of money to buy that linen cloth. It must be very special one for him. He may have already bought that thing for his burial as he already had a newly constructed tomb. So he may have used that linen cloth to cover the body of Jesus as a respect.For me there is no doubt that the linen cloth came from Idia as confirm by DNA. Another thought is that when they covered the body of Jesus that linen cloth may very wet due to heavy rain at that time. So another possiblity that they did not washed the body of Jesus but they wrapped the body of Jesus using a very wet linen cloth.","date":"October 15, 2015 at 9:16 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"author":"sampath_fernando","post":"Dan please continue your blog. I learnt everything about the Shroud of Turin from this site.","date":"October 18, 2015 at 3:45 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"author":"sampath_fernando","post":"Sorry in New Testament.","date":"October 14, 2015 at 4:59 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"author":"sampath_fernando","post":"Why in 325AD (about 300 years after death of Jesus) dominant Christians in Rome ignored or forget to imnclude mission of St Thomas in India?As Daveb said there was communication and transport between India and the Middle East, and consequently trade. Not only with India, middle East also had trade with Sri Lanka (Ceylon) as well.","date":"October 14, 2015 at 3:45 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"}],"art":[{"author":"sampath_fernando","post":"When the creator of TS introduce blood to the image if he use brass rubbing technique?","date":"July 29, 2014 at 6:27 pm","url":"https://shroudstory.com/2014/07/29/beyond-luwu-and-lotto/","cat":"art","title":"Beyond LUWU and LOTTO"},{"author":"sampath_fernando","post":"I am always wondering how all the pigment removed from the original painting to leave us a negative image? Furthermore it gave us  3D coding as well.","date":"April 28, 2015 at 4:39 pm","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","title":"Having Nightmares"},{"author":"sampath_fernando","post":"I am agreeing with Daveb.As Image on TS is a negative image, you need special knowledge and skills to work with it. But the negative of the photograpgh (or positive image of the TS) taken by Mr. Secondo Pia,  give us more detail information of the hand wounds. It clearly show that nail went through the wrist area rather than the middle of the palm.","date":"February 25, 2015 at 5:30 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","title":"Maybe the Nails Didn’t Go Through the Wrists"},{"author":"sampath_fernando","post":"Unlike other paintings, no one can explain how the (negative) image of a person got printed on the Turin Shroud.  In 14th centuary no one knew how to produce a negative of a photopraph. Although many people are trying to explain the image using their expertise still no one managed to give us a reasonble explaination.TS image is a negative of a photograph.  No one can deny that.Due to the complex nature of the image of TS, I don’t think noone will be able to give a explaination how the negative image got printed in near future as well.","date":"February 26, 2015 at 7:27 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","title":"Maybe the Nails Didn’t Go Through the Wrists"},{"author":"sampath_fernando","post":"I like the words of Isabel – “no human being has a brain to create this image”. My intuition says this god made image was created by some form of radiation. Like to hear some comments from Mr. Freeman.","date":"August 1, 2015 at 4:44 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","title":"Not a Work of Art by Leonardo da Vinci"},{"author":"sampath_fernando","post":"Of course people could have made painted copies in the past. However I have not come across another copy similar to the image like TS. As TS is a negative image of a crucified person no one was able to duplicate another one similar to TS with many hidden details.","date":"March 1, 2015 at 4:47 am","url":"https://shroudstory.com/2015/03/01/picture-for-today-fresco-in-pinerolo/","cat":"art","title":"Picture for Today: Fresco in Pinerolo"},{"author":"sampath_fernando","post":"Four fingers confirmed that nails went through the wrists rather than the palm. Mr. Farey – if possible, could you demonstrate your explaination through a sketch please.","date":"February 22, 2015 at 7:57 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"author":"sampath_fernando","post":"Yes it is a excellent article. Before the development of technology, most of the peoiple, like today – including Popes, thought TS is just a painting. Now technology is changing our perception.","date":"December 11, 2014 at 10:26 pm","url":"https://shroudstory.com/2014/12/11/roger-bassetts-clarifying-art/","cat":"art","title":"Roger Bassett’s Clarifying Art"},{"author":"sampath_fernando","post":"Mr Farey – Have you ever notice the position of the hand wound in the positive image of the Shroud? Any comments please.Remember that the palm image in Shroud has some X-Ray qualities","date":"February 23, 2015 at 5:48 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"author":"sampath_fernando","post":"Mr Thomas, how can you prove that it is as a myth. Anyone can see it from the image.","date":"February 23, 2015 at 4:02 am","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"author":"sampath_fernando","post":"Mr. Farey – I don’t know how to attach the picture. Wrist wound is very clear in the Positive image.","date":"February 23, 2015 at 6:12 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"author":"sampath_fernando","post":"Yes, you have to make a lot of assumptions when you are dealing with the negative image. Please check the positive image of the TS.","date":"February 23, 2015 at 11:17 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"author":"sampath_fernando","post":"Mr Farey – I cannot attach. Could you please attach the picture taken by Mr. Secondo Pia. Please see the wound location at that photo.","date":"February 24, 2015 at 7:26 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"author":"sampath_fernando","post":"Sorry – Negative of the photograph taken by Mr. Secondo Pia.","date":"February 24, 2015 at 7:43 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"author":"sampath_fernando","post":"Sorry for my ignorance of creating a link of an image. What do you think about the negative photo of the following link. Negative image shows clearly the wounds around the wrist area. http://www.acheiropoietos.info/","date":"February 25, 2015 at 12:20 am","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"author":"sampath_fernando","post":"Why image on TS is unique? Can anyone produce a negative photograph like image on TS which was produced in medieval time? (Image on TS is the first and last one)Furthermore there is no any other painting or another medieval photographic negative showing Jesus was crucified by nailing through his wrists. Almost all paintings show that Jesus was crucified by nailing his palms.Why image on TS is the only one tell us that Jesus was crucified by nailing through his wrists.","date":"February 22, 2015 at 5:18 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"author":"sampath_fernando","post":"Still with many assumptions used by Hugh, for me this wound is more closer to the wrist than the middle of the palm as shown in many other crucifixion paintings","date":"February 24, 2015 at 6:24 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"}],"blood":[{"author":"sampath_fernando","post":"Thank you Daveb. According to Jesus on Judgement Day or at Resurrection we get glorified bodies. My understanding is Angels are having Glorified Bodies.According to Hebrews 13:2 -Do not forget to show hospitality to strangers, for by so doing some people have shown hospitality to angels without knowing it.According to that verse Jesus act like an Angel. According to that verse angels can have special type of body.","date":"October 31, 2015 at 4:13 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"author":"sampath_fernando","post":"As I mentioned sometime back Jesus told that at resurrection we get a body like Angel. (Matthew 22:30). After resurrection Jesus appeared to many as an Angel. So we have to get rid the conception of Jesus resurrected bodily. As Jesus had a body like Angel. Then at resurrection Jesus body had to be dematerialised. That is how neutrons were emitted uniformly from the body of Jesus.","date":"October 30, 2015 at 6:40 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"author":"sampath_fernando","post":"We humans can’t imagine the resurrection activity and it process. As Mr. Rucker says neutrons must have emitted during the resurrection process. So in addition to neutrons what sort of radiation emitted from the Jesus body to create the image on his burial cloth?","date":"October 31, 2015 at 4:30 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"author":"sampath_fernando","post":"Has anyone detected Radon Gas in soils/limestone around Jeruselam?","date":"November 3, 2015 at 1:34 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"author":"sampath_fernando","post":"Hi ekmcmahon – I like the statement “Jesus changed from the Human body/God Soul to the God Physical Body/God Soul”.My imagination is the same. No scientist can understand or can explain the resurrection activity and the resurrection process. Answer to resurrection process has to come only from the Father God. I think in this situation we can’t use human logic. So far I have not heard from any scientists or any human how Jesus performed miracles or how Jesus raised 3 dead bodies or how Jesus commanded to stop the storm or how he feed 5000 men (excluding women and children)","date":"November 1, 2015 at 3:56 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"author":"sampath_fernando","post":"Hi Daveb/mr. GreenThese are the possiblities:After the resurrection Jesus must have gone out from the tomb without moving the StoneOr.Angels must have moved the StoneEarth quake must have moved the StoneSoldiers must have moved the Stone to check the body of Jesus after the Earth quake.No one mentioned where the Stone was when Mary Madgelene reached the tomb. Only thing mentioned was it was moved. We don’t  know whether Stone was fallen to ground or left next to the Tomb entrance.","date":"November 4, 2015 at 4:08 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"author":"sampath_fernando","post":"Hi Mr Farey – Everything depend on whether you believe in resurrection or not. If you believe in resurrection, then it is a unknown process to human beings and also the creating of an image on the Shroud is also and unknown process to human beings.If you are not believing in resurrection then the creation of the image is a forgery to human beings. That why Mr Freeman and his experts think it is a painting. Also controversial Carbon dating supports views of Mr. Farey and Mr. Freeman.But most of the Shroud researches proved that image on the Shroud is not a painting.","date":"May 28, 2015 at 4:07 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"author":"sampath_fernando","post":"As I mentioned sometime back, we have not come across any person who is dead or alive leaving a image like TS on his burial cloth if dead or on his covered cloth if he is still alive.So far no human being has managed to explain how person can resurrect from dead or what reactions are happening during the resurrection process.Old or young doctors can give their own opinions based on their experience on dead or live human bodies.John what is the real meaning of Quantum Christ?","date":"August 27, 2015 at 11:06 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"author":"sampath_fernando","post":"Thank you OK. I can’t can’t imagine how forger included all these features into the image on the Shroud. Why forger believed Jesus was crucified by nailing through the wrists rather than the palm? IN 14th centuary what was influenced the forger to imagine Jesus was crucified by nailing through his wrists?","date":"April 15, 2015 at 4:45 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"author":"sampath_fernando","post":"Mr GreenJesus Christ, Jehovah, Allah– please include Brahma as well“We can accomplish miraculous things in the world by merging our faiths, and the time for such a movement is now. No longer shall we slaughter our neighbors over differences in reference to their God.””What a wonderful saying Mr. Green. Thank you very much we must discard all sort of fundamentalism. (unlike Christians believe Jesus discarded all sort of fundamentalism)","date":"August 27, 2015 at 8:49 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"author":"sampath_fernando","post":"Mr.Farey  your logic is correct. Otherwise they may have carried Jesus to tomb from cross by holding from his arms and legs. (how many people carried Jesus from Cross to Tomb? Did soldiers help them to carry Jesus body after hearing the words of Centurian.","date":"October 14, 2015 at 5:16 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"author":"sampath_fernando","post":"I don’t think they wash the body of Jesus. According to Synoptic Gospels they did not have time even to Anoint the body. As a result of that they wrap the body till Sunday morning to anoint the body and give a proper burial.","date":"October 12, 2015 at 3:05 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"author":"sampath_fernando","post":"Hi Louis – But there are no evidence from the Shroud of Turin to tell us that it was the same shroud used to transport Jesus body from the cross to the Tomb.","date":"October 12, 2015 at 8:07 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"}],"dating":[{"author":"sampath_fernando","post":"There is no difference between Atheists and skeptics of shrouds. You can’t convince them. They ignore all available data purposely.","date":"March 8, 2015 at 4:01 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"author":"sampath_fernando","post":"I am sorry Mr. Farey if I have hurt you. I never consider Carbon Dating as an accurate reading to condemn Shroud of Turin as a fake painting because the sample they took is not a representative one and also the sample took from that corner is not a good place take a one to test. Also considering the properties of the image such as a negative of  a positive photograph and also wound at the wrists  and the X-ray properties of the bones of the palm and fingers convinced me that it is not a paint or a scorch. But in addition to above many scientists (not historians) published  many scientific papers giving many clues to consider the image as an authentic one.God Bless You too.","date":"March 8, 2015 at 9:20 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"author":"sampath_fernando","post":"Thank you anoxie. I believe same thing applies to the results of Carbon Dating of Turin Shroud as they overlooked the external contamination.","date":"March 11, 2015 at 4:53 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"author":"sampath_fernando","post":"Sorry if I am wrong. We don’t know from where and from whom  Aramathia Joseph bought the linen to wrap the body of Jesus.So Cotton can be in the Shroud but do all of the cotton in the Shroud have the same age?","date":"March 10, 2015 at 10:36 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"author":"sampath_fernando","post":"Thank you Louis for giving the link of the research paper. People need to talk about the image formation rather than finding material in the Shroud. No one can explain how this image was formed. That is a mystery.","date":"March 11, 2015 at 9:01 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"author":"sampath_fernando","post":"Yes According to Gospels Jesus appeared and then again disapeared. Also Gospels tells us Jesus entetred to completely closed room without opening the door? I can’t explain this with a material body.","date":"September 17, 2014 at 7:39 pm","url":"https://shroudstory.com/2014/09/16/and-interview-with-lind-and-antonacci/","cat":"carbon_14_dating","title":"An Interview with Lind and Antonacci"},{"author":"sampath_fernando","post":"Thank you daveb. Like Padro Pia NDE people also had this sort of out of body experience. That is mainly due to their spiritual bodies and not due to the material body.","date":"September 17, 2014 at 8:40 pm","url":"https://shroudstory.com/2014/09/16/and-interview-with-lind-and-antonacci/","cat":"carbon_14_dating","title":"An Interview with Lind and Antonacci"},{"author":"sampath_fernando","post":"Thank you DavebThat didn’t happen to Jesus. After his death, his body was living and tangible.This is what you are believing. However I believe that Jesus was raised with his Glorified Body rather than a Material body. Also at resurrection we will also recieve our Glorified bodies.","date":"September 17, 2014 at 11:54 pm","url":"https://shroudstory.com/2014/09/16/and-interview-with-lind-and-antonacci/","cat":"carbon_14_dating","title":"An Interview with Lind and Antonacci"},{"author":"sampath_fernando","post":"1. Do parallel universes exist, or multi-verses?2. I might speculate for example that this universe in which we exist is actually a subset of a higher universe.Yes Jesus mentioned about many mansions. So may I speculate that there are material Universes as well as Spiritual Universes. Recent studies in NDE proves this. There is a spiritual body as well as a material body for each human. Even Jesus mentioned that at resurrection we are like angels. So I strongly believe that Jesus resurrected spiritualy rather than materialy. Image on shroud is an evidence for that. So dematerialisation of the material body by emiting radiation seems to be true for me.","date":"September 17, 2014 at 7:12 pm","url":"https://shroudstory.com/2014/09/16/and-interview-with-lind-and-antonacci/","cat":"carbon_14_dating","title":"An Interview with Lind and Antonacci"},{"author":"sampath_fernando","post":"Thank you David“you will not be able to explain many things about God”.Yes, that is why each one of us are having our own opinions. Yes, I respect your opinions but only God knows whose opinion is true. None of the Gospels mentioned anything about the Image of Jesus on his Burial Cloth (TS). Why didn’t they mention it? As a result of that now we are speculating how his image got printed on his burial cloth. Still there are so many opinions and hypothesis but only God (or Creator) knows exactly how that image got printed.","date":"September 18, 2014 at 6:04 pm","url":"https://shroudstory.com/2014/09/16/and-interview-with-lind-and-antonacci/","cat":"carbon_14_dating","title":"An Interview with Lind and Antonacci"},{"author":"sampath_fernando","post":"Why Issaiah please read 4 Gospels and see how John contradicting with Matthew, Mark and Luke about the burial procedure of Jesus. Who told you that scriptures are telling the absolute truth. Scripyures tell some truth. Jesus asked you to read things with open eyes and open mind.By the way sampling procedure used get a sample to test Carbon Dating are  not sccientific.","date":"November 2, 2015 at 8:13 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"author":"sampath_fernando","post":"Those who were responsible for sampling and testing should have done enough to do the proper sampling techniques, veryfying the internal and external contamination of the corner, rather than, now, skeptics of the shroud are trying their best to give all sort of explainations to justify the controversial results.","date":"March 22, 2015 at 5:11 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"author":"sampath_fernando","post":"only engineers are considering representative sampling but not the scientists.","date":"August 24, 2015 at 6:47 pm","url":"https://shroudstory.com/2015/08/22/food-for-thought-an-important-paper-on-radiocarbon-dating/","cat":"carbon_14_dating","title":"Food for Thought: An Important Paper on Radiocarbon Dating"},{"author":"sampath_fernando","post":"Oh Oh on line Calculators?Garbage in Garbage out. Try your own calculation method using first principles. Do you know how they created on line Calcilator?","date":"March 24, 2015 at 5:02 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"author":"sampath_fernando","post":"Ignorance of Mr. Jones. Rather than results he must concentrate on sampling procedure.","date":"November 21, 2015 at 4:19 pm","url":"https://shroudstory.com/2015/11/21/computer-hacking-theory-for-carbon-dating-continues/","cat":"uncategorized","title":"Computer Hacking Theory for Carbon Dating Continues"},{"author":"sampath_fernando","post":"Hi JohnThank you very much for your excellent essaySampath","date":"March 21, 2015 at 5:02 pm","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","title":"John Klotz Delivers the Knockout"},{"author":"sampath_fernando","post":"Other than using a contaminated piece to do the Carbon Dating Test and obtaining very controversial results, there are no other reasons to tell that Shroud of Turin is fake thing.","date":"December 22, 2014 at 11:26 pm","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","title":"Just Published:  What Went Wrong with the Radiocarbon Date?"},{"author":"sampath_fernando","post":"Thank you Mr. Farey. So both C-Dating results and Prof. Fanti’s results are controversial. However still people like to use controversial Carbon Dating results rather than Prof. Fanti’s results.","date":"April 26, 2015 at 7:46 pm","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","title":"Look at what happened between 1988 and 2015"},{"author":"sampath_fernando","post":"From the Gospels we know that Jesus handed over his spirit to Father at his death. After that de died. As Jesus told at the cross, then the Soul (may be spirit) of Jesus went to paradise with the Soul of the thief. After three days Jesus Soul (or spirit) came back to his body.As I mentioned previously no one knows what sort reactions would happens during the resurrection process.  During that resurrection process radiation could have happened. Todate, except the Father and Son no one knows about this process. Scientists are still struggling to create a living micro-organisms in the lab. So far they failed to  do that. However thay can create life with using another living organism. So to create new life from nothing they have to undertand the resurrection mechanism.","date":"April 23, 2015 at 4:57 pm","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","title":"Look at what happened between 1988 and 2015"},{"author":"sampath_fernando","post":"Why people are ignoring Prof. Fanti’s dating results. Did anyone challenge his methodology and results?","date":"April 26, 2015 at 1:14 am","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","title":"Look at what happened between 1988 and 2015"},{"author":"sampath_fernando","post":"Thank you Dave for the link.Best fit, Mean, Standard deviation, Chi  Value Square interesting. First grab sample, then ignore internal contamination and external contamination. Coming to a conclusion of the date of Shroud by ignoring the 95% confidence level of Carbon Dating results and also condemning it as a medieval fake is a joke. How bad is this? Those scientists deceived the world.Thank you Louis for the link of Dr. Paolo Di Lazzaro  interview. This convinced me that no medieval artists or technologist can make an image or painting like the image on the Shroud of Turin.Thank you again","date":"March 12, 2015 at 4:56 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"author":"sampath_fernando","post":"Sorry, people  like Mr. Farey don’t know how the image got printed, yet they openly state that Shroud is not authentic.","date":"March 28, 2015 at 8:36 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"author":"sampath_fernando","post":"I strongly believe in Resurrection and Science can’t prove the process of Resurrection.  Same with the image as it got printed during the Resurrection process and it is beyond the sciencetific knowledge.","date":"March 31, 2015 at 9:23 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"author":"sampath_fernando","post":"Thank you Daveb. Why these inteligent people can’t understand the meaning of representative sampling? To justify their claims they purposely ignore this fact and give so many excuses to fool their followers.As an Envoronmental engineer, I never take the results of a grab sample to give a solution.","date":"March 5, 2015 at 10:26 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"author":"sampath_fernando","post":"Thank you Dan for giving us this valuable information. Definitely those scientists used a contaminated sample (as well as Grab sample) and misled many.","date":"November 23, 2014 at 5:17 am","url":"https://shroudstory.com/2014/11/23/paper-chase-the-shroud-of-turin-and-its-radiodating/","cat":"carbon_14_dating","title":"Paper Chase:  The Shroud of Turin and its Radiodating"},{"author":"sampath_fernando","post":"Hi DaveSorry to troble you. Could you please give us a example explaining why Chi Value Square test failed in the case of the 1988 Radio Carbon Dating. Thank you.","date":"March 12, 2015 at 12:51 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"author":"sampath_fernando","post":"Skurka’s own theory takes Rogers’ scientific paper one step beyond, theorizing that the act of Christ’s “resurrection to a glorified body,” physically involved some sort of what we would call today a nuclear event. And that the effect of this on the cloth would result in a skewed radiocarbon reading.I am supporting Skurka’s Hypothesis.Yes, it is necessary to discard the New Testament writers opinion about the Bodily Resurrection to explain the image on the TS. I don’t have any doubt to accept that Jesus resurrected with a Glorified Body.","date":"September 24, 2014 at 5:52 am","url":"https://shroudstory.com/2014/09/24/superparamagnetism/","cat":"carbon_14_dating","title":"Superparamagnetism"},{"author":"sampath_fernando","post":"100% agree with Daveb. I don’t know why expert scientists are still accepting C14 results. Why can’t they understand sampling procedure was wrong. We never take grab samples to decide to get the clear picture of any event.","date":"November 23, 2015 at 1:32 am","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"author":"sampath_fernando","post":"What is this joke. Scientists are attacking each others work. As Daveb says there must be an agenda.Who is misinforming the world. Earlier eggs are bad now good for health. Coconut oil is worse now it is the best oil for health.","date":"September 15, 2015 at 2:35 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"author":"sampath_fernando","post":"Based on Gospel account I cannot agree on Bodily Resurrection. Looking at the properties of the Image on Shroud and image formation most probaly due to dematerilization of the body. As such I suuport Spiritual resurrection.That is why those who support bodily resurrection like to promote earth quake theory. It is not possible earth quake to form both frontal and dorsal image on the wrapped burial cloth.","date":"November 24, 2015 at 6:21 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"author":"sampath_fernando","post":"Louis, Where did I support earth quake theory? I never supported an earth quake theory as it never gives a dorsal and a frontal images. My hypothesis is dematerialization and emission of radiation from inside to outside. That is the only way you get both frontal and dorsal images.","date":"November 24, 2015 at 8:09 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"author":"sampath_fernando","post":"Yes there is a possibility of anything. But this does not mean that I support that theory. From earth quakes you never get frontal and dorsal images.","date":"November 25, 2015 at 1:23 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"author":"sampath_fernando","post":"Yes I saw De Liso images. But it is only oneside image. So that is why it is a possibility. If he providing wrong information then he is cheating.","date":"November 25, 2015 at 3:35 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"author":"sampath_fernando","post":"No frontal and dorsal images can be formed by Earth Quake on a wrapped burial cloth. And that is why I did not support the earth quake hypothesis. I support only Dematerilization hypothesis.","date":"November 25, 2015 at 5:52 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"author":"sampath_fernando","post":"I never changed my mind. You can decide what you want. I am not worried. According to your statements only Prof Fanti change his mind about Corona discharge.","date":"November 25, 2015 at 7:26 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"}],"dna":[{"author":"sampath_fernando","post":"From where Scientists took a sample to do Mass spectrometry and Carbon Dating. Is it a reliable sample. Why scientists did not take a representative sample from the Shroud?From where scientists took a sample to do DNA testing. Can we consider that sample as a representative one?However no one knows how the imaged was formed on the Shroud of Turin. Which scientist can prove that there is no God. I think same way no scientist can tell exactly how the image on Shroud was formed.","date":"October 9, 2015 at 3:33 am","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"author":"sampath_fernando","post":"Louis – Methodist Hymn book has picture of Syrian Cross dated 4th century found in Anuradhapura Sri Lanka.","date":"October 6, 2015 at 6:40 pm","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"author":"sampath_fernando","post":"Thank you Louis. Also must thank Dan for publishing this article.New Testament does not tell anything about mission of Thomas in India. However we know that Thomas came to India and spread the Gospel. Also we know that Thomas was killed in Chennai.Why Thomas was sent to India?During Jesus time many Jewish Traders visited India and Sri lanka. Also we know that there were some Jewish colonies in South India and Sri Lanka before the birth of Jesus and and also after the death of Jesus. Still there are Christians in India who believe that their church was established by Thomas.Most probably Joseph of Arimathia must have bought the linen cloth to wrap Jesus from a Jewish Trader who came from India to Jerusalem to sell various items during the passover.","date":"October 6, 2015 at 4:56 pm","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"author":"sampath_fernando","post":"Who is this Paul? Last Sunday I told my wife that I like Paul very much because of him only now you are submitting to me. Why Paul did not say husband must submitt to their wives. Also this Paul condemned homosexuals but Jesus always told us to love your neighbour as thyself. Unlike Jesus, Paul did not know about how people were created.","date":"December 9, 2015 at 3:44 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"author":"sampath_fernando","post":"According to John who asked Jesus to give wine? It is Mother Mary. Why did she asked Jesus?","date":"December 8, 2015 at 3:59 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"author":"sampath_fernando","post":"Sorry I am telling about the first miracle stated in John. Jesus mother knew who Jesus was.","date":"December 8, 2015 at 4:30 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"author":"sampath_fernando","post":"His mother said to the servants, “Whatever He says to you, do it.” According to John, Mary had great faith on Jesus. Yes those who are not believing in miracles can think Mary asked servants go and get money from Jesus to buy wine.","date":"December 8, 2015 at 7:32 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"author":"sampath_fernando","post":"I don’t know why these Non Catholics abd Catholics are always deabating about Mother Mary. Shame and shame. Mother Mary is a very special person that is why God the Father selected her as mother of Jesus..Mother Mary had only one Son and that that why at cross Jesus asked John to look after his Mother. If Jesus had own sibliings (not step brothers and sisters) Jesus would not have  asked John to look after his Mother.How can those Christians who cannot understand virgin birth can accept resurrection of Jesus from death?","date":"December 9, 2015 at 4:12 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"author":"sampath_fernando","post":"Who says you need Mary to be saved? I think Catholics are asking Mother Mary to pray for them as you Christians asking your priests and/or your so called Christian brothers and sisters to pray for you. Are there any difference?I am very sad when I hear these ignorant non Catholics are condeming mother Mary.","date":"December 9, 2015 at 4:59 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"author":"sampath_fernando","post":"Loius – The New Testament is safe so far, as far as archaeology is concerned.Yes Louis you are correct. However I don’t agree with Paul’s ideas about wife must submit to your husband and condemning homosexuals.For some Christians Paul’s ideas like those are very important than virgin birth. They ignore Jesus’s new commandment.For me Gospels are the most important books from the new testament.","date":"December 9, 2015 at 5:13 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"author":"sampath_fernando","post":"Thank you Rick and Louis.I agree with you Louis. I like Pope Francis. I thinkk he also not agreeing with Paul on many issues and that is why he told even Atheists can go to Heaven.I discard all sort of fundamentalism. That is why I meditate only on the teachings of Jesus. As Jesus taught us we must Love each other. When we think about us we have to think about others also. We must not not condemn any other religion. Jesus was teaching us only about Kingdom of God and how can we inherit that. He treated all as the children of God and never discriminated anyone who was following oter religions and faiths. Shame today Christians are condeming Catholics and not talking about the Kingdom of God.One day Shroud and Sudarium tell us more things about Jesus.","date":"December 10, 2015 at 3:51 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"author":"sampath_fernando","post":"Thank you Louis.","date":"December 10, 2015 at 6:51 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"author":"sampath_fernando","post":"Thank you Rick. One of my friend who is an Anglican saw 3 times Mother Mary in vision. Now he has started a charity (VACD) to help disable children in Sri Lanka (in Bandarawela area). Currently he is helping 150 children.","date":"December 11, 2015 at 1:42 am","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"}],"events":[{"author":"sampath_fernando","post":"Dear Mr. KlotzI am agreeing with you regarding consciousness and quantum information of the universe.One of my Irish friend who was living in Canberra had a twin brother in Ireland. One day while he was practicing for church choir he got a feeling that his brother died. As soon as he went home after the practice he got a call from Ireland informing his brother died at the same moment he got that feeling.But unlike you I do believe in miracles and guardian angels as I have experience in that areas.Regarding image on the Shroud I agree with Mr. Barrie Schwortz. The image printed on the Shroud is a miracle and no one including Quantum mecahanics or Quantum Energy experts can explain the formation of that image.Sampath","date":"March 16, 2015 at 5:51 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"author":"sampath_fernando","post":"Hi Mr. Farey  Their finding of a medieval date was wrong  because their sampling was wrong. Are you agreeing or not?","date":"November 26, 2015 at 8:09 pm","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","title":"Finally, An Explanation for the Exclamation Mark!"},{"author":"sampath_fernando","post":"Jesus did many miracles and I believe those. Jesus resurrected and it is another miracle which I believe. According to history he is the only one got resurrected and no one knows how it happen. So it is very difficult for scientists explain that resurrection process. To do that scientists have to resurrect someone from the death. If they do so then they can find that process and can explain how the image on Shroud got printed. Yes some sort of external energy (quantum) may have involved in that process. (or may be some divine energy).","date":"March 16, 2015 at 6:56 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"author":"sampath_fernando","post":"Yes Hugh your logic iscorrect. My problem is why no one is talking about the sampling procedure. Although the scientists followed the correct procedures to get the results the sample they analysed was not a representative one. Why these scientists are not mentioning the sample is a Grab sample from the controversial corner and not the representative one from the whole shroud.","date":"November 26, 2015 at 6:29 pm","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","title":"Finally, An Explanation for the Exclamation Mark!"},{"author":"sampath_fernando","post":"Why these scientists are still defending the results of Carbon Dating and not the sampling procedure? This implies that they traded results for money.","date":"November 26, 2015 at 4:47 pm","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","title":"Finally, An Explanation for the Exclamation Mark!"},{"author":"sampath_fernando","post":"Yes I will remember this and try to get more information from Kerala as well as from my Tamil friends.","date":"June 2, 2015 at 5:31 pm","url":"https://shroudstory.com/2015/06/02/pope-francis-june-21-22-schedule-details/","cat":"2015","title":"Pope Francis’ June 21 & 22 Schedule Details"},{"author":"sampath_fernando","post":"Very interesting obsevation John. Corners are the most contaminated places of the Shroud.","date":"May 10, 2015 at 4:37 pm","url":"https://shroudstory.com/2015/05/10/picture-for-today-getting-ready-for-the-shroud-exhibition-in-1931/","cat":"exhibition","title":"Picture for Today:  Getting Ready for the Shroud Exhibition in 1931"},{"author":"sampath_fernando","post":"Thank you Daveb for the information and thank you Louis for your expectation of Pope Francis. I like Pope Francis very much. Even Francis did simmilar things before he became the Pope. Hope one day he authorise to do more research on the Shroud of Turin and I have no doubt that the outcome of this will help to bring more Catholics and Evangicals together.","date":"June 2, 2015 at 5:08 pm","url":"https://shroudstory.com/2015/06/02/pope-francis-june-21-22-schedule-details/","cat":"2015","title":"Pope Francis’ June 21 & 22 Schedule Details"},{"author":"sampath_fernando","post":"Error: Remember as Mr. Freeman think that image on the Shroud is a painting.","date":"March 28, 2015 at 10:34 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"author":"sampath_fernando","post":"Mr. Freeman:  why there is no sign of any of the contours one would expect if the Shroud had ever actually laid on a body.Very good question, if people know how the image got printed on the Shroud. How can you answer if we don’t know the mechanism of printing that image on the shroud as well as what energy involved in the process of resurrection.Remember as Mr. Freeman think that image on the Shroud is not a painting.","date":"March 28, 2015 at 8:42 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"author":"sampath_fernando","post":"Now world know that corners were contaminated.May God Bless all the people who discarded the results of Carbon Tests. Without these brave people world would have think Shroud of Turin is another fake artifact.  Why foolish scientists who tested a contaminated sample confirmed to the world that Shoud of Turin is made only in 14th Century?","date":"December 18, 2014 at 4:51 pm","url":"https://shroudstory.com/2014/12/18/new-paper-by-pam-moon/","cat":"st_louis_2014","title":"New Paper by Pam Moon"},{"author":"sampath_fernando","post":"MCNP Analysis of Neutrons Released From Jesus’ Body In The Resurrection by Robert Rucker – I think Mr. Rucker’s hypothesis that a very small fraction of neutrons in the body of Jesus were emitted from the body as it disappeared in the resurrection is the best hypothesis out of all the previous hypothesises. I am waiting to read more on his paper.Most probably this is the best hypothesis to explain the Glorified body according to Gospels. So far other hypothesises such as Painting, Scorch, Earth Quake Neutrons release, Corona Discharge etc. have failed to explain properly, the formation of the image on the Shroud of TurinThank you very much for the organisers of St. Louis Conference. Otherwise we never get a chance to hear this type of hypothesis.","date":"October 16, 2014 at 7:41 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"author":"sampath_fernando","post":"In another occasion Jesus told like this –Matthew 22:30 – At the resurrection people will neither marry nor be given in marriage; they will be like the angels in heaven.That is why I support Mr. Rucker’s hypothesis about the disappearance of the body.","date":"October 16, 2014 at 10:44 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"author":"sampath_fernando","post":"Hi Mr. FareyAre there any reason why they never talk anything about the wrong sampling procedure? They talk only about the results. Why?","date":"November 27, 2015 at 4:30 pm","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","title":"Finally, An Explanation for the Exclamation Mark!"}],"forensic":[{"author":"sampath_fernando","post":"Dear Flavia: Some educated think they are the authority for many things and make all sort of nonsense comments without knowing the real truth. That is why you did not get an answer from that Professor. Furthermore many educated people are trying to visualise ancient itemss using today’s technology and they don’t know how people survived about 2000 years ago. Even they don’t know how people think about 2000 years ago.","date":"April 9, 2015 at 4:45 pm","url":"https://shroudstory.com/2015/01/18/a-number-of-marks-falling-all-over-the-surface-of-the-body/","cat":"history","title":"A number of marks falling all over the surface of the body"}],"history":[{"author":"sampath_fernando","post":"Thank you Thomas and Davebfor your valuble contribution to discard Shroud created as a liturgical tool as suggested by Mr. Freeman and supported by Mr. Farey.","date":"July 21, 2015 at 5:02 pm","url":"https://shroudstory.com/2015/07/21/a-rare-piece-of-cloth/","cat":"history","title":"A Rare Piece of Cloth"},{"author":"sampath_fernando","post":"About two weeks ago when I saw the shadow of that “Crown of Thorns” in Paris, I wondered why it is circlet. Thank you Daveb for your imagination and clarification.","date":"August 8, 2015 at 3:18 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"author":"sampath_fernando","post":"Colin: Its exquisite response to 3D-enhancement is just one of them.Good on you Colin. Why Historian did not consider this fact.","date":"November 1, 2014 at 4:43 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"author":"sampath_fernando","post":"Yes I believe you Mr. McMahon. Only very few people have experienced Guardian Angels.When you read Dan’s blog you can see that all the theories of painting, schorch, sweat are collapsing from the comments of experts. Skeptics always have points to disagree.","date":"November 13, 2014 at 9:59 pm","url":"https://shroudstory.com/2014/11/13/over-at-history-todays-blog-space/","cat":"history","title":"Over at History Today’s blog space"},{"author":"sampath_fernando","post":"As an Engineer I felt that a Historian who doesn’t know how to paint or print that image on a piece of linen with current technology wrote that article in the Guardian to gain some sort of cheap publicity.","date":"October 24, 2014 at 5:02 am","url":"https://shroudstory.com/2014/10/23/the-guardian-notes-the-history-today-article-by-charles-freeman/","cat":"history","title":"The Guardian Notes the History Today Article by Charles Freeman"},{"author":"sampath_fernando","post":"Thank you Louis. I don’t know why we can read that sort of statement in Gnostic gospels.  According to my understanding Jesus never consider anything as unclean like humans do. Jesus touch all sort of untouchable people.So there must be a reason why Gnostic gospels have mentioned the Shroud in second century and not the canonical gospels in the first century. As such I don’t want to ignore gnostic gospels as today many people can identify Shroud as a genuine object.Furthermore today many Churches are not only discarding Gnostic Gospels but also they discarding the Shroud.","date":"August 22, 2015 at 5:06 am","url":"https://shroudstory.com/2015/08/19/who-is-addai/","cat":"history","title":"Who is Addai?"},{"author":"sampath_fernando","post":"Louis you are a very good resource person. Thank you very much.","date":"August 22, 2015 at 10:47 pm","url":"https://shroudstory.com/2015/08/19/who-is-addai/","cat":"history","title":"Who is Addai?"},{"author":"sampath_fernando","post":"Thank you Dan for this publicationAccording to the Gospel of Hebrews – “And when the Lord had given the linen cloth to the servant of the priest, he went to James and appeared to him”Then based on above, I think most probably, Jesus gave the linen cloth to the James (but not to Peter)","date":"August 19, 2015 at 5:54 pm","url":"https://shroudstory.com/2015/08/19/who-is-addai/","cat":"history","title":"Who is Addai?"}],"image":[{"author":"sampath_fernando","post":"I like the number 1128 and finally it add up to 3.Yes some sort of electromagnetic waves were involved in creating the image on the shroud and it came out from the body.","date":"July 21, 2015 at 4:34 am","url":"https://shroudstory.com/2015/07/18/blow-your-mind-3d-scanning-technology-and-what-it-could-mean/","cat":"3d","title":"Blow Your Mind 3D Scanning Technology And What It Could Mean"},{"author":"sampath_fernando","post":"Yes Louis Colin has to go so far to get the exact image simillar to Turin Shroud.I admire Collin’s efforts, but his experiemnts are still in the infant stage. Pilot scale models are quite diffetent to prototype models.Shroud is the only prototype image we have for the last 2000 years.","date":"September 3, 2015 at 9:59 pm","url":"https://shroudstory.com/2015/09/03/colin-berrys-latest-and-greatest-is-it-enough/","cat":"3d","title":"Colin Berry’s Latest and Greatest. Is it Enough?"},{"author":"sampath_fernando","post":"Fully agree with StanWe think today technology is far more advanced than 2000 years or 600 years ago. Yet people with Doctorates in Science or Technology and also History and Archaeology cannot explain how those finer details recorded on the shroud. Instead of explaining how the whole image was formed, experts are giving only piece meal solutions. They give their opinions and/or hypothesis for only just minor aspect of the image. Today we have so many hypotheses of the image formation but none of the hypothesis cannot fully explains, all the details or aspects of the whole image. Why is that?","date":"December 9, 2014 at 7:10 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"author":"sampath_fernando","post":"No Mercury found so definitely it is not vermillion.","date":"December 11, 2014 at 9:12 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"author":"sampath_fernando","post":"Thank you OK for your interesting presentation. You are going in the correct direction OK. Today Astronomers get more information about our Universe from images. So image on the Shroud is giving us a lot of information.My interests go for the Slide 7 of Part 3. I think most probably either possibility of 1 or 2 or the combination of 1 and 2 was the  cause for the formation of image on the Shroud of Turin.My imagination is during the process of Resurrection some sort of radiation emitted from the body of Jesus and that was the reason for the image formation.","date":"October 5, 2015 at 4:18 pm","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"author":"sampath_fernando","post":"“but is probably following the shortest path to the sheet”. – Yes that is a very good assumption.Thank you OK.","date":"October 7, 2015 at 8:30 pm","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"author":"sampath_fernando","post":"OK –In the case of the Shroud and 3D effect, we suppose that there is a relation between image intensity and the distance between the cloth and supposed body wrapped within it.I am fully agreeing with you OK.","date":"October 9, 2015 at 5:02 pm","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"author":"sampath_fernando","post":"Thanks OK. When you have an Agenda then you have to ignore Ethics.","date":"September 17, 2015 at 9:55 pm","url":"https://shroudstory.com/2015/09/17/guest-posting-on-the-thermochimica-acta-editorial/","cat":"paper_chase","title":"Guest Posting on the Thermochimica Acta Editorial"},{"author":"sampath_fernando","post":"Thank you Dan for publishing this very interesting and educating video. Nicely explained with Four points why Shroud is not a painting.“Shroud is actually not a painting”, “it so mysterious ” and “the blue print of the future”.","date":"July 26, 2015 at 3:32 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","title":"1999 Interview with Isabel Piczek"},{"author":"sampath_fernando","post":"Thank you Daveb, my fellow engineer. Mr. Farey has to prove that Shroud is a painting. I am 100% gurantee that Mr. Farey never prove that Shroud is a painting.","date":"July 26, 2015 at 6:04 pm","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","title":"1999 Interview with Isabel Piczek"},{"author":"sampath_fernando","post":"On July 21, 2015 at 4:27 am – Mr. Farey wrote that he is agreeing with Mr. Freeman that Shroud is a painting and it was created for a liturgical purpose","date":"July 26, 2015 at 7:22 pm","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","title":"1999 Interview with Isabel Piczek"},{"author":"sampath_fernando","post":"Very interesting paper.Some believe that every living cell produce some sort of Bio Field (very faint electrical field). After the death this field vanishes due to extinguish of blood circulation. Recent research detected very weak electrical fields around the living things including plants.To my knowledge no one has resurrected from death except Jesus. So no one knows exactly what sorts of mechanisms are involved in this resurrection process. Furthermore no one knows, exactly, how much energy is required to start the blood re-circulation after 3 days of death. If Jesus resurrected from death and his blood circulation started again, then at the inception of that blood circulation, there is a high probability that some sort of electrical field generated. No one knows how strong that electrical field is? This could have been the reason to print the image on the burial cloth of Jesus.Although not related, I want to mention the following:After reading Gospels I have realised that Jesus was a unique human being born to this world. He preached about the kingdom of God and also attacked the religion of Jews at that time. He used parables to explain the Kingdom of God and told that Kingdom of God is for everyone and not only for the Jews. That was the one of the reason reasons Jewish religious leaders killed him. According to Gospels Jesus did many miracles such as healing sick, casting out evils, walking on water, calming storms and feeding more than 5000 people from few fish and bread. Furthermore he raised 3 people from the dead and most famous one was raising Lazarus from the death. Unfortunately Lazarus did not have a burial cloth like Jesus. If he had a burial cloth like Jesus then his body image also would have got printed on that burial cloth. Before his death Jesus predicted that Jews will kill him and but he will resurrect on the third day from the death. According to gospels there are witnesses for his resurrection and also to the burial cloth.","date":"December 17, 2014 at 6:29 pm","url":"https://shroudstory.com/2014/12/17/a-gedankened-image-forming-process/","cat":"image_theory","title":"A Gedankened Image Forming Process"},{"author":"sampath_fernando","post":"I like his hypothesis on hand movements during resurrection","date":"July 30, 2015 at 7:08 pm","url":"https://shroudstory.com/2015/07/29/a-new-astonishing-phenomenon/","cat":"image_theory","title":"A New Astonishing Phenomenon?"},{"author":"sampath_fernando","post":"Thank you Dan for this amazing video. What a presentation. Oneday Science and Geometry will reveal more information of the image on the Shroud.","date":"July 29, 2015 at 10:34 pm","url":"https://shroudstory.com/2015/07/29/a-new-astonishing-phenomenon/","cat":"image_theory","title":"A New Astonishing Phenomenon?"},{"author":"sampath_fernando","post":"Louis—-What happened between the two events?Believe or not it is another miracle","date":"December 17, 2014 at 10:13 pm","url":"https://shroudstory.com/2014/12/17/a-gedankened-image-forming-process/","cat":"image_theory","title":"A Gedankened Image Forming Process"},{"author":"sampath_fernando","post":"Blood stains are there. Is it a painting? Or is it created by Biological or chemical or radiation process?So far no one was able to give an reasonable answer to those questions. However Mr Freeman is 100% sure that it is a painting.","date":"June 11, 2015 at 5:24 pm","url":"https://shroudstory.com/2015/06/11/comment-promoted-charles-freeman-comes-closest/","cat":"image_theory","title":"Comment Promoted:  Charles Freeman Comes Closest"},{"author":"sampath_fernando","post":"Colin may correct if it is a painting. As far as I am concern TS is not a painting. (according to word of mouth TS is not made by man). If painter is such a intelligent person then he will paint the image according to the way Colin think. He won’t miss those details if he considered the other unthinkable properties at that time.I have to agree with Thibault. It take years to find out how the TS image got formed.","date":"May 17, 2015 at 3:17 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"author":"sampath_fernando","post":"No one knows how “Big Bang” was happened. So there are many hypotheses for it. So far no one has given a reasonable explanation beyond any doubt. Same thing with the image on the Shroud of Turin, no one has given a explanation beyond any doubt.  Who can give a correct explanation?  No one. But there are so many people publishing articles and misleading the mankind. Is it the biggest sin they are doing?","date":"March 18, 2015 at 4:48 pm","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"author":"sampath_fernando","post":"That is interesting. Colin is trying hard to find out how the image was formed.If shroud is a fake, then creating an image on a piece of linen cloth 14th feet long and 3 feet wide was a responsibility of a technologist who lived either on 1st century or 14th century.However we know that that sort of technology was not available as there are no other linen clothes where we can’t find a image similar to the shroud.","date":"August 8, 2015 at 2:44 am","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"author":"sampath_fernando","post":"Hi Yannick- Did STURP find the traces of burial products. Only Gospel John tells us that body was wound with the spices where as other 3 synoptic Gospels tell us that body was wrapped with a clean linnen and on Sunday women went to annoint the body of Jesus with spices.","date":"August 11, 2015 at 6:17 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"author":"sampath_fernando","post":"I don’t know what Paul meant by truckloads of linen. But today we have only one and only one piece of linen which have an unexplainable image of a crucified person with a sign of a crown of thorn and pierced wound on a chest. Furthermore also with a tortured body with scourge marks,  and a dislocated shoulder.","date":"August 7, 2015 at 8:54 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"author":"sampath_fernando","post":"Thank you Louis. I want to find out whether the spices had any role in the  formation of image on the Shroud.","date":"August 11, 2015 at 8:32 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"author":"sampath_fernando","post":"Thank you Mr. Farey and Louis and for the valuable information.Still I can’t understand why women went on Sunday morning to annoint the body of Jesus if that body was already annointed by Joseph of Aramathia on Good Friday.","date":"August 12, 2015 at 4:46 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"author":"sampath_fernando","post":"Yes Daveb you are absolutely correct. That is how image on TS was formed. These researchers are ignoring that basic fact.","date":"August 23, 2015 at 3:54 pm","url":"https://shroudstory.com/2015/08/23/have-we-all-been-looking-in-the-wrong-place/","cat":"image_theory","title":"Have we all been looking in the wrong place?"},{"author":"sampath_fernando","post":"I like to interpret the story of 3 monkeys in different way:1.Hear  only who support (or from experts who don’t want to divulge their names),2.Speak (or write) only to get popular,3.See (or read) only the area of your speciality.","date":"June 1, 2015 at 11:04 pm","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?"},{"author":"sampath_fernando","post":"Hi Daveb – Yes there is a possibility to get images during  seismic events with Radon. I don’t know whether  De Liso managed to get both frontal and dorsal images from the experiments.","date":"November 13, 2015 at 3:56 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","title":"Nevertheless, the images are real enough!"},{"author":"sampath_fernando","post":"I recomend scientists to study remote sensing and also images and photography before they comment anything on the properties of the Shroud of Turin","date":"August 10, 2015 at 6:33 pm","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","title":"It is really, really time to rethink what we think about 3D"},{"author":"sampath_fernando","post":"Very interesting paper and it will help many to understand why different grey scales were produced of the negative image on the shroud of Turin. Furthermore it help to understand why the image on the Shroud of Turin cannot be produce by a painter.","date":"March 2, 2015 at 12:41 am","url":"https://shroudstory.com/2015/03/01/new-paper-variations-in-image-due-to-amounts-of-burial-ointments/","cat":"image_theory","title":"New Paper:  Variations in Image Due to Amounts of Burial Ointments?"},{"author":"sampath_fernando","post":"According to New Testament Jesus was resurrected but not the Herod. Image may have got printed during the resurrection process. Neither Average Human being nor a Scientist don’t anything about this resurrection process. That is why still we are stuggling to understand how the image was formed on the Shroud of Turin.Hope one day someone can find that process.","date":"March 2, 2015 at 5:12 pm","url":"https://shroudstory.com/2015/03/01/new-paper-variations-in-image-due-to-amounts-of-burial-ointments/","cat":"image_theory","title":"New Paper:  Variations in Image Due to Amounts of Burial Ointments?"},{"author":"sampath_fernando","post":"Sorry. typoNeither Average Human being nor a Scientist don’t know anything about this resurrection process.","date":"March 2, 2015 at 6:05 pm","url":"https://shroudstory.com/2015/03/01/new-paper-variations-in-image-due-to-amounts-of-burial-ointments/","cat":"image_theory","title":"New Paper:  Variations in Image Due to Amounts of Burial Ointments?"},{"author":"sampath_fernando","post":"Daveb: What’s the answer?Our brains are so complex and goes in many directions. How can we minimise or maximise the Objective Function. But it is so complex that as there are so many variables and so many constraints. So we will never get an answer from the data availble.Based on my wisdom I think Image on the Shroud of Turin is not a man made one. If it a man made one then today with our knowledge in science and technology we would have produced more than Billions of Shroud of Turins.So only solution is, hope, one day Church authorities will allow scientists to do more testing to do to determine the age of the Shroud of Turin.","date":"April 16, 2015 at 6:24 pm","url":"https://shroudstory.com/2015/04/16/rogers-impurity-layer-and-di-lazzaros-experiments/","cat":"image_theory","title":"Rogers’ Impurity Layer and Di Lazzaro’s Experiments"},{"author":"sampath_fernando","post":"Charles : In short, this area remains open for further research especially through seeking expert opinion as to why the calcium might have been on the cloth in ‘large’ quantities.High quantity of Calcium –  Most probably this could have occured as a result of the radiation of the body (read Skurka hypothesis). Ca would have come as a residue from the bones of the body.","date":"September 24, 2014 at 7:24 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"author":"sampath_fernando","post":"What is the most probable process to print/paint an image of a crucified man on 14 feet * 3 feet linen sheet? Does any such technology available in 1st centuary or 14 Centuary to create an image like that on linnen? Resurrection is really a miracle. That is what most (all) Christians believe. So creating a image simmilar to image on the Shroud of Turin is “out the realm of science”","date":"March 31, 2015 at 6:17 pm","url":"https://shroudstory.com/2015/03/31/whats-to-like-over-on-colins-blog-right-now/","cat":"image_theory","title":"What’s to like over on Colin’s blog right now?"},{"author":"sampath_fernando","post":"Mr. Mo: Are you believing in resurrection?","date":"April 2, 2015 at 5:15 am","url":"https://shroudstory.com/2015/03/31/whats-to-like-over-on-colins-blog-right-now/","cat":"image_theory","title":"What’s to like over on Colin’s blog right now?"},{"author":"sampath_fernando","post":"Those days Church Leaders killed the scientists, and today Historians are trying to do the same thing.","date":"November 11, 2014 at 6:32 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"author":"sampath_fernando","post":"Thank you Louis. Considering all the properties/aspects of the image of TS I am quite sure that it is not a man made thing.","date":"May 20, 2015 at 4:42 pm","url":"https://shroudstory.com/2015/05/19/guest-posting-the-shroud-of-turin-an-x-ray/","cat":"uncategorized","title":"Guest Posting:  The Shroud of Turin – An X-Ray?"},{"author":"sampath_fernando","post":"Daveb -I do not believe it is necessary for high energy X-rays to emanate from the bones of the person, which requires a miracleYes resurrection is a miracle. But to get a image like TS radiation have to come from internally (from the body) and nor from externally","date":"May 21, 2015 at 4:24 pm","url":"https://shroudstory.com/2015/05/19/guest-posting-the-shroud-of-turin-an-x-ray/","cat":"uncategorized","title":"Guest Posting:  The Shroud of Turin – An X-Ray?"},{"author":"sampath_fernando","post":"Hi Daveb – Shroud image is quite different to De Liso’s images. By his method he can’t get both Dorsal and Frontal images. To get frontal and dorsal images radiation has to come from inside..","date":"May 21, 2015 at 10:16 pm","url":"https://shroudstory.com/2015/05/19/guest-posting-the-shroud-of-turin-an-x-ray/","cat":"uncategorized","title":"Guest Posting:  The Shroud of Turin – An X-Ray?"},{"author":"sampath_fernando","post":"Jesus body did not decay it was in the tomb from Friday evening till Sunday dawn. According to experts who analyzed the Shroud image tells that the person who was wrapped in that Turin shroud was dead and also they did not find any signs that the body was decayed or decaying.Prior to Jesus death he told that resurrected bodies are similar to the Angels. According to Gospels we can read that Angels have bodies similar to humans. But Angels are quite different to humans. They can appear and also they can disappear. Angels also can sing, talk and carry things.Jesus never told that his resurrected body is same as the body he had prior to his death. Furthermore after the resurrection Jesus appeared and disappeared like Angels.Even Mary Magdalene and another two disciples couldn’t recognize resurrected Jesus. Mary recognized him from his voice but the other two disciples couldn’t recognize Jesus even hearing the voice of resurrected Jesus. Furthermore Jesus asked Mary not to touch his resurrected body as he has no being to the Father. Most probably, after being to the Father, resurrected Jesus ate. Jesus also has wounded scour marks on his resurrected body (Jesus asked Thomas to touch those) similar to the image on the TS. But resurrected body of Jesus is quite different to the body Jesus had prior to his death.As I mentioned previously no one knows about the resurrection process. If we assume Jesus resurrected bodily then we have to consider external energy sources (ie. earth quakes) to form the body image on the shroud. If assume Jesus resurrected like an angel then we can consider internally generated energy sources (ie. Radiation, X-Ray) to form the body image on the TS. As Gospel accounts supports both the bodily resurrection and resurrection with a body like Angels then we can consider both external (to body) and internal (from the body) energy sources to form the image. But based on the properties/aspects of the image on TS most probably an internal energy source is the reason to form an image on the TS.","date":"May 20, 2015 at 9:21 pm","url":"https://shroudstory.com/2015/05/19/guest-posting-the-shroud-of-turin-an-x-ray/","cat":"uncategorized","title":"Guest Posting:  The Shroud of Turin – An X-Ray?"},{"author":"sampath_fernando","post":"Thank you Dan for this posting. I am a strong believer that X-Rays (or simmilar type of radiation) were emitted from the body of Jesus during the Resurrection Process and as a result of that  image was formed on the burial cloth.As Jesus was the only one resurrected from death, it is impossible to stimulate that rwsurrection process. No one knows what sort of energy emitted during spirit (or/and soul) came back to the material body (or flesh) of Jesus.","date":"May 19, 2015 at 4:33 pm","url":"https://shroudstory.com/2015/05/19/guest-posting-the-shroud-of-turin-an-x-ray/","cat":"uncategorized","title":"Guest Posting:  The Shroud of Turin – An X-Ray?"},{"author":"sampath_fernando","post":"If X-rays are the reason for forming the image, then as historians claimed TS is not a 14th centuary creation.","date":"May 19, 2015 at 8:42 pm","url":"https://shroudstory.com/2015/05/19/guest-posting-the-shroud-of-turin-an-x-ray/","cat":"uncategorized","title":"Guest Posting:  The Shroud of Turin – An X-Ray?"},{"author":"sampath_fernando","post":"Thank you OK for your very informative article. Thank you Dan for publishing it. To get an idea about grey scales historians must learn/study digital imaginary. Short course in remote sensing applications helped me to understand about grey scales and digital images.","date":"November 10, 2014 at 2:15 am","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","title":"Guest Posting by O.K. on the Shroud as a Negative"}],"misc":[{"author":"sampath_fernando","post":"Thank you Nabber","date":"June 21, 2015 at 6:55 pm","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","title":"A Memorable Photograph Worth a Thousand Words"},{"author":"sampath_fernando","post":"I always respect Pope Francis. He selected the longest day (for us shortest day) to visit the site. Hope one day Pope Francis will make a comment of the Shroud.","date":"June 21, 2015 at 4:25 pm","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","title":"A Memorable Photograph Worth a Thousand Words"},{"author":"sampath_fernando","post":"Yes I am agreeing with you OK. We must not give any credit to Catholic or Protestant. Although I was a protestant, thanks to Shroud of Turin (or real burial cloth of Jesus), now I am a follower of Jesus. Now I am not calling myself as neither a Catholic nor a Protestant. Sorry to say that in the past and even now Protestants and Catholics are confusing Christians.  However, now. I go to any church (Protestant or Catholic) when possible and pray to my Father.","date":"March 4, 2015 at 4:59 pm","url":"https://shroudstory.com/2015/03/04/after-cnn/","cat":"news_&_views","title":"After CNN"},{"author":"sampath_fernando","post":"I am a follower of Jesus not Protestant or Catholic. Last year I went to Turin to pay my respect to the burial cloth of Jesus (Shroud of Turin). Before I left one Anglican Priest from Sydney told me that “why are your going there it is a fake one”. So majority of Protestants condemn Shroud of Turin because they don’t know much about it and they like to condemn images of Jesus because of that Protestant movement started in Germany.","date":"March 4, 2015 at 7:50 pm","url":"https://shroudstory.com/2015/03/04/after-cnn/","cat":"news_&_views","title":"After CNN"},{"author":"sampath_fernando","post":"Once I told those priests not to condemn Mother Mary from their pulpits.","date":"March 4, 2015 at 8:22 pm","url":"https://shroudstory.com/2015/03/04/after-cnn/","cat":"news_&_views","title":"After CNN"},{"author":"sampath_fernando","post":"Mr Farey – Thank goodness there are authenticists (and non-authenticists) who understand that there is reasonable evidence for both originsWhat evidence non authenticists hve other than flawed Carbon Dating Results?","date":"May 17, 2015 at 9:45 pm","url":"https://shroudstory.com/2015/05/16/christianity-in-sharp-decline-in-the-u-s/","cat":"news_&_views","title":"Christianity in Sharp Decline in the U.S."},{"author":"sampath_fernando","post":"Hi Louis – According to Gospels ladies went to tomb on the early Sunday morning. Is this a cultural practice or they went to tomb to anoint the body with those spices which they could not do it on Friday evening as they did not have time to do it?","date":"July 31, 2015 at 6:30 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","title":"Cherry Jam, the Metaphor"},{"author":"sampath_fernando","post":"Dematerialization – miracle, miracle – that is how the burial cloth got the negative image of the battered body of Jesus for us to debate like this.","date":"November 17, 2015 at 5:12 am","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"author":"sampath_fernando","post":"This guy is mad and so mad. There are many people like him and they call themselves as they are incarnations of past religious leaders.If that mad guy read the Gospels he has to understand that Jesus is not to reincarnate again.I am waiting for spring to go to Canberra to see Floriade.","date":"July 29, 2015 at 4:42 pm","url":"https://shroudstory.com/2015/07/29/and-while-we-are-talking-about-australians/","cat":"tinfoil_hats","title":"And While We Are Talking About Australians"},{"author":"sampath_fernando","post":"Thank you I really enjoyed this discussion. Many thanks to Thibault for his papers.","date":"March 6, 2015 at 9:02 pm","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"author":"sampath_fernando","post":"Daveb ; . A pure spirit does not have a body, nor is a body pure spirit. I do not agree on this as when Mother Mary got the message about her concievement she saw the Angel. Even Sheppards saw the angels.What sort of bodies these angels had? Bodies simmilar to humans or not?","date":"November 17, 2015 at 5:07 pm","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"author":"sampath_fernando","post":"Hi DavebThank you. But my experience is quite different. My Father had a different experience. He had a Guardian Angel and that Guardian Angel walked with him. Carried a torch to take him in dark. Told many things about his children. When they came to a place where there is light he disappeared. With one promise he told many things to my Father and ask him not to tell to anyone. But my Father broke that promise and by telling those stories to my mother. After that incident that Guardian Angel did not come to walk with my Father.That is a true story.","date":"November 17, 2015 at 11:35 pm","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"author":"sampath_fernando","post":"Hi Mr. Weiss – I have experience with both situations. As Aquinas asserted my father really came across a Angel who took actual matter. That is why Angel managed to hold a torch. Other fact was most of things Angel told to my Father was fulfilled. My 4 siblings are the witness to that story (1. Dentist, 2. Former Surveyor General of SL,  3. Active member of Sri Lanka Catholic Church 4. PhD in Structural Engineering, and me)That is why I don’t have any doubts to accept the dematerialization process during the resurrection and subsequent formation of the image. Most of the people who can not understand dematerialization process do not anything about Angels and post resurrection body of Jesus.","date":"November 20, 2015 at 6:00 pm","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"author":"sampath_fernando","post":"Thank you Mr. Andy.","date":"November 20, 2015 at 1:33 am","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"author":"sampath_fernando","post":"Don Andy – I am not questioning the veracity of your claim, just wondering how you can be so certain it was not a vision?How can the same vision could happen during so many weeks?What the guardian angel told to my father was fulfilled.","date":"November 25, 2015 at 11:05 pm","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"author":"sampath_fernando","post":"Hi DavebSorry to trouble you. Most Aaccept that Gospel of Luke was copied from other avaiable sources (Q and may be another)Which book Luke wrote first? Acts or Gospel of Luke? Furthermore in Acts Luke give us 3 versions of Paul confrontation with Jesus. Which one was correct?","date":"November 19, 2015 at 6:09 pm","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"author":"sampath_fernando","post":"Thank you Daveb.Then I can’t understand why Paul did not learn from Luke about the Gospel of Jesus.How can they talk about Jesus without knowing the missioin of Jesus.Jesus main mission was telling about the Kingdom of God and how can we go there.Based on Parable of Goats and Sheep Jesus told that Work (doing things to others in the name of Love) are more important than faith and that is the criteria for Judgement on the Judgement Day.","date":"November 19, 2015 at 11:05 pm","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"author":"sampath_fernando","post":"Out of the many hypothesises, I can see, there are only two possibilities to form an image on the burial cloth. Either from the Painting hypothesis suggested by Mr. Freeman or Dematerialization and related Radiation from the body hypothesis suggested by some. Otherwise there are no other possibilities to form a Negative Image on the shroud from the other various hypothesises.","date":"November 18, 2015 at 9:17 pm","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"author":"sampath_fernando","post":"Thank you Louis. I like the final answer:Brienne: The secret of the Turin Shroud is the process by which the image of Christ was imprinted on the cloth. This process remains unexplained by modern science. Due to its characteristics, the image even contradicts certain scientific laws. The word “miracle” burns lips.","date":"March 26, 2015 at 7:52 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","title":"Double-0-7’s  Big 3 Analysis"},{"author":"sampath_fernando","post":"More 3s3 temptations, Jesus raised 3 dead people, 3 disciples to pray at Gethsemane, 3 disciples when transfigured,","date":"March 25, 2015 at 9:08 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","title":"Double-0-7’s  Big 3 Analysis"},{"author":"sampath_fernando","post":"Hi DavidAgain this year Good Friday is coming on 3 April.","date":"March 29, 2015 at 5:49 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","title":"Double-0-7’s  Big 3 Analysis"},{"author":"sampath_fernando","post":"Hope all Christians undersatand the real meaning of the Parable of “Goats and Sheep” rather than preaching about “Grace”. Actually “Grace” is foriegn concept to the ministry of Jesus.","date":"June 3, 2015 at 4:49 pm","url":"https://shroudstory.com/2015/06/03/homeless-from-rome-visit-shroud-of-turin/","cat":"2015","title":"Homeless From Rome Visit Shroud of Turin"},{"author":"sampath_fernando","post":"Thank you NabberYes Paul says this. But Jesus said the Parable of Goats and Sheep the criteria to Judge on the Judgement Day.There is a big difference between what Jesus says and what Paul says. In this sort situation I always give the priority to the words of Son of God. Yes Naber you can give priority to Paul. That is up to you.","date":"June 4, 2015 at 4:26 pm","url":"https://shroudstory.com/2015/06/03/homeless-from-rome-visit-shroud-of-turin/","cat":"2015","title":"Homeless From Rome Visit Shroud of Turin"},{"author":"sampath_fernando","post":"Nabber: the entire New Testament is inspired by God. Hope you know that Paul wrote that.My role model is Jesus and I am always following him.","date":"June 5, 2015 at 5:17 pm","url":"https://shroudstory.com/2015/06/03/homeless-from-rome-visit-shroud-of-turin/","cat":"2015","title":"Homeless From Rome Visit Shroud of Turin"},{"author":"sampath_fernando","post":"Andy: “He should try to disprove it as authentic and should also be ready for the level of scrutiny given to those attempting to prove the opposite.”Pre Judging is a common mistake of a human being. Why can’t we take a neutral stand until some one prove it or disaprove it. So far no one has come to a conclusion without ant doubt.According to my stand Science is the only tool which we can use to prove the Authenticity of TS.","date":"September 21, 2014 at 6:46 pm","url":"https://shroudstory.com/2014/09/21/lest-the-wrath-of-god-descend-upon-them-like-a-ton-of-bricks/","cat":"humor","title":"Lest the wrath of God descend upon them like a ton of bricks"},{"author":"sampath_fernando","post":"About 6 months ago I was at Eifel Tower.Why religions are teaching to kill others?","date":"November 14, 2015 at 4:14 pm","url":"https://shroudstory.com/2015/11/14/paris/","cat":"news_&_views","title":"Paris"},{"author":"sampath_fernando","post":"Thank you very much Davab.Even Popes’ discarded TS as a fake painting. However Development of science completely changed that opinion (starting from 1894 AD) (yes photography and based on scientific evidence such as dirt, limestone, pollen etc).","date":"September 23, 2014 at 5:55 pm","url":"https://shroudstory.com/2014/09/21/lest-the-wrath-of-god-descend-upon-them-like-a-ton-of-bricks/","cat":"humor","title":"Lest the wrath of God descend upon them like a ton of bricks"},{"author":"sampath_fernando","post":"Sorry to say that. A Historian misled so many millions ignoring all the scientific facts and by considering only guess work.","date":"October 28, 2014 at 5:21 pm","url":"https://shroudstory.com/2014/10/28/posting-correction/","cat":"uncategorized","title":"Posting Correction"},{"author":"sampath_fernando","post":"I was born as a Methodist. But I attended most of the protestant Churches on Sundays as well as Roman Catholic Church Masses. Protestant Churches condemn Mother Mary as well as Images and also they give higher status to Epistles of Paul than the teachings of Jesus.Furthermore they don’t know the meaning of the parable of Goats and Sheep. They give higher value to Grace than the “New Commandment of Love” given by Jesus. Or they think believing in Jesus is more important than the things Jesus asked us to do to enter into the Kingdom of God. That is why there are more than 41, 000 denominations of Protestants. These Protestants compete with each other for power. That is why they carry the message of Grace. Yes Protestants sometimes reject the miracles performed by Jesus. On the other side of the story once St Mary’s Cathedral Sydney refused give me Holy Communion (or Eucharist) on 2014 Ash Wednesday. I was saddened by that event and stop calling myself as a Christian. Now I am only a follower of Jesus without any denomination.I am giving priority to teachings of Jesus over any other teachings or writings. So for me Shroud of Turin is the most important thing. Even I like to give more respect to the Shroud of Turin than the Holy Bible because Shroud of Turin show the Love of God and how Son of God suffered for us.","date":"May 24, 2015 at 5:44 pm","url":"https://shroudstory.com/2015/05/24/rejecting-authenticity-out-of-hand/","cat":"news_&_views","title":"Rejecting Authenticity Out of Hand"},{"author":"sampath_fernando","post":"Why don’t you just go to the RCA study groups to learn the history and dogma of the church and the instructions needed to be a baptized member?  This is much needed to understand the catholic church.  Without this study you will not understand WH some people cannot take communion they(host).","date":"July 11, 2015 at 11:29 am","url":"https://shroudstory.com/2015/05/24/rejecting-authenticity-out-of-hand/","cat":"news_&_views","title":"Rejecting Authenticity Out of Hand"},{"author":"sampath_fernando","post":"sampath fernando let me jump in here.  Anyone can go to the catholic church , gay, divorced, or not a baptized catholic.  You can go to the services and participate.  You just can’t receive communion.  Anyone in the state of mortal sin cannot receive communion.  They must go to confession first. Members know this.  If gays want to receive .communion they must change their way of living. Same goes for divorced people that co-habitate","date":"July 11, 2015 at 11:18 am","url":"https://shroudstory.com/2015/05/24/rejecting-authenticity-out-of-hand/","cat":"news_&_views","title":"Rejecting Authenticity Out of Hand"},{"author":"sampath_fernando","post":"Thank you Daveb. Although I am not belong to any denomination I am more aligned to Catholic Church than Protestant Churches. Even when Pope Francis gave his first Easter Message in Italian Language I was at Vatican.Everday I attended lunch time Mass at St. Mary’s Cathedral in Sydney. Althogh I am supporting Catholic version of Holy Communion, now I am reluctant to go and recieve it from the Catholic Church.","date":"May 25, 2015 at 9:57 pm","url":"https://shroudstory.com/2015/05/24/rejecting-authenticity-out-of-hand/","cat":"news_&_views","title":"Rejecting Authenticity Out of Hand"},{"author":"sampath_fernando","post":"Mr. Farey – Where did you notice that blood in the Valleys more than Ridges – on the dorsal image or on the frontal image or on the both images?","date":"October 11, 2015 at 10:12 pm","url":"https://shroudstory.com/2015/10/11/removing-weave-pattern-from-images-of-the-shroud-of-turin/","cat":"other_sites","title":"Removing Weave Pattern from Images of the Shroud of Turin"},{"author":"sampath_fernando","post":"Sorry to trouble you Mr Farey – Did you notice this on negative (original image) or positive image?","date":"October 14, 2015 at 1:54 am","url":"https://shroudstory.com/2015/10/11/removing-weave-pattern-from-images-of-the-shroud-of-turin/","cat":"other_sites","title":"Removing Weave Pattern from Images of the Shroud of Turin"},{"author":"sampath_fernando","post":"Nice to hear wonderful words from Yannick. One addition – Breaking the “New Commandment” is the only sin I know. New Commandment is the only one can bring Peace to this World. I can see the New Commandment on the Shroud.","date":"October 24, 2014 at 5:06 pm","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","title":"Scientific truth is a pathway to God"},{"author":"sampath_fernando","post":"According to Gospel of Hebrews (GOH) – Jesus gave the linen cloth to the servant of Priest. I don’t know why the author of GOH stated this linen cloth in 2nd century?","date":"December 23, 2015 at 9:20 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"author":"sampath_fernando","post":"Thank you Dan. I got a lot of information about the Shroud from your site.","date":"December 15, 2015 at 3:36 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"author":"sampath_fernando","post":"According to News- “Skeptics say the cloth bearing the image of a crucified man is a medieval forgery.”Without any proof how these skeptics say “image is a medieval forgery”Are their decision based on controversial Carbon Dating Results? or based on Mr. Freeman’s hypothesis of “painting”? or any other reason?","date":"June 22, 2015 at 5:00 pm","url":"https://shroudstory.com/2015/06/22/the-day-was-not-about-the-shroud/","cat":"2015","title":"The Day Was Not About the Shroud"},{"author":"sampath_fernando","post":"Thank you Louis. I know that image was created by some sort of Supernatural activity.Yes I am 100% agreeing with Mr Schwortz .","date":"June 22, 2015 at 6:18 pm","url":"https://shroudstory.com/2015/06/22/the-day-was-not-about-the-shroud/","cat":"2015","title":"The Day Was Not About the Shroud"},{"author":"sampath_fernando","post":"Based on the evidence available it quite possible that image was formed due to some sort of radiation.Looking at the image we know that it is a photographic negative. We also can see X-Ray (film) properties. Can see the hair, beard and eye brows in the image and can see hair was blown out due to some sort of radiation.Any chemical, biological or natural reaction of a dead or living body cannot make an image like that.  I am quite sure that none of the biological or chemical processes can create an image like on the TS with the hair, beard and eyebrows. Dr. Accetta’s experiment confirmed that image was created by some sort of radiation.As confirmed by many scientists blood stains are real and blood soaked to the linen before the creation of the body.Most probably body dematerialized and some sort of radiation activity emerged within the body to create dorsal and frontal images and linen acted like a (photographic or X-ray film). Also image spread uniformly only on the very top of the burial linen.Gospel accounts also confirmed that after the resurrection Jesus body was different to a normal human body.","date":"June 17, 2015 at 7:31 pm","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","title":"The Masters of Comedy in Piedmont"},{"author":"sampath_fernando","post":"Thank you Louis for the article. I really enjoy reading articles on Parapsycology.","date":"June 15, 2015 at 5:34 pm","url":"https://shroudstory.com/2015/06/08/the-pope-and-the-tramps/","cat":"2015","title":"The Pope and the Tramps"},{"author":"sampath_fernando","post":"I think Kovoor’s Father is a Methodist Priest and I was told that at the time of Kovoor’s death he changed his views (I may be wrong).Hi Louis – image on the shroud is a negative one whereas the image on the Jospice Mattress is a positive one.","date":"June 15, 2015 at 7:19 pm","url":"https://shroudstory.com/2015/06/08/the-pope-and-the-tramps/","cat":"2015","title":"The Pope and the Tramps"},{"author":"sampath_fernando","post":"Thanks Dan; I have learnt many things about the Shroud of Turin from your blog.","date":"May 3, 2015 at 9:15 pm","url":"https://shroudstory.com/2015/05/03/three-millions-page-views/","cat":"uncategorized","title":"Three Millions Page Views"}],"opinion":[{"author":"sampath_fernando","post":"Hi OK – Thank you for the posting. For me it is not difficult to understand your logic. I am totally agreeing with you.","date":"December 12, 2015 at 5:21 pm","url":"https://shroudstory.com/2015/12/10/allusions/","cat":"guest_posting","title":"Allusions"},{"author":"sampath_fernando","post":"Dan —I must admit I feel a little sceptical, not based on the evidence, but froman innate doubt that God would work in this way…If you are a true Christian (Catholic or non Catholic) or a follower of only Jesus (like me) we don’t want any sort of evidence like Shroud of Turin as a true burial cloth of Jesus.But for agnostics or atheists require some sort of evidence to accept the Shroud of Turin as a true burial cloth of Jesus. This may be the reason Jesus left his battered image on this burial cloth that he really lived on this earth and resurrected from the death.","date":"October 24, 2015 at 4:08 am","url":"https://shroudstory.com/2015/10/24/and-now-you-have-something-to-do-this-weekend/","cat":"other_blogs","title":"And now you have something to do this weekend"},{"author":"sampath_fernando","post":"Don’t take seriously Dave. No one knows how to explain the Resurrection Process and as such no one knows how the image was formed.Either you or Dan may correct or both may wrong.Please keep doing research on Holograms.","date":"July 28, 2015 at 9:39 pm","url":"https://shroudstory.com/2015/07/27/and-we-are-all-mathematician-even-if-we-dont-know-it/","cat":"other_blogs","title":"And We Are All Mathematician Even if We Don’t Know It"},{"author":"sampath_fernando","post":"Nothingness is only Buddha’s (another human being) imagination. No one has really experience the Nothingness.","date":"January 1, 2015 at 5:37 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"author":"sampath_fernando","post":"Yes David please don’t get discourage. Remember that there are so many who appreciate your opinions.","date":"January 4, 2015 at 5:42 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"author":"sampath_fernando","post":"Thank you for your wisdom Daveb.Spirit is willing but Flesh is weak.","date":"August 12, 2015 at 9:14 pm","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"author":"sampath_fernando","post":"I consider that Shroud of Turin is the First and primary Gospel and other gospels and also other books in New Testament are secondary.These days the “Top most Topic” in Australia is the Gay Marriage.Shroud image tell us that Jesus is the true Son of God and who came to this world tell us about the “Golden Rule”. – Don’t discriminate anyone on this world on any reason as all are the children of God and God love them all equally.","date":"August 12, 2015 at 4:54 pm","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"author":"sampath_fernando","post":"Hi Paul – you are absolutely correct. How many can understand your statement.","date":"April 19, 2015 at 5:09 am","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"},{"author":"sampath_fernando","post":"Have you ever heard about Grab sampling and Composite sampling. As an Environmental Engineer I always go for Composite sampling, rather than Grab sampling, when I design water or wastewater treatment plants. Yes method of analysis is same for both type of samples but they give different results. Grab samples never give a true picture of the quality of water.Same way, as I believe, the results of Carbon test is not accurate, Scientists took a sample  from only one corner of the shroud. They did not take a representative sample of the Shroud.I never think the results of that Carbon test as accurate. The sample they took may be a contaminated one. Why these intelligent scientists did not think, before publishing their results that their sample is a contaminated one. There is a high probability that their results are wrong.Their results are a very good tool for non believers to discard the authenticity of the Shroud. Those who have ears may hear.","date":"November 14, 2014 at 3:49 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","title":"God in his lab"},{"author":"sampath_fernando","post":"Thank you Mr. Davab, for pdf documents. Most probably, as I stated previously,  600years or 2000 years of manual handling of the shroud should have contaminated the corners of the shroud. So definitely it is not a place to take a sample for C dating. How these people mislead believers and non believers.","date":"November 18, 2014 at 2:06 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","title":"God in his lab"},{"author":"sampath_fernando","post":"Hi Mr. Farey – Do you think corners of Shroud have not contaminated by manual handling?","date":"November 14, 2014 at 6:51 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","title":"God in his lab"},{"author":"sampath_fernando","post":"This Gyotaku gives you a positive image and not a negative image. The image on the Shroud of Turin is a negative image.I don’t think if we wrap a live body or dead body (whether traumatised or not) with a linen cloth we won’t get a negative image through any biological process or chemical process similar to the image on the Shroud of Turin.To get a negative image like on the Shroud of Turin, some sort of light, X-ray or some sort of radiation type waves have to be involved and also the surface of the linen cloth has to act like photographic or X-ray paper.According to Gospels only Jesus knew when he is going to die and resurrect. As such no one prepare a special linen cloth to wrap the body of Jesus. However Joseph of Arimathia found a brand new linen cloth to wrap the dead body of Jesus in hurry.However as a result of that we now got a miraculously printed image which was not painted as well as scorched.","date":"June 10, 2015 at 6:28 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"author":"sampath_fernando","post":"I have never heard a printing an image on a linen cloth due to following occasions:1.By a Dead body before or after 3 days (or 72 hours)2. By a living body before or after 3 days3. By a traumatised dead body before or after 3 days4. By a traumatised living body before or after 3 daysHope scientists can do more research based on the above conditionsHowever we know that Shroud Image was created by a person who was dead and crucified, wore a crown of thorn, chest pierced and nailed at wrists and ankels.","date":"June 8, 2015 at 10:15 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"author":"sampath_fernando","post":"Hugh – That the comparison is illusory is easily understood by considering the beard, and eyebrows of the image of the Shroud. These may be assumed to have been darker in colour,No Mr. Farey – Fine things like hair is acting like a lightening arrester when radiating.","date":"June 10, 2015 at 9:43 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"author":"sampath_fernando","post":"Another very interesting aspect about the hair and static electricity.Watch this videoWe don’t know anything about the resurrection process.","date":"June 10, 2015 at 11:43 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"author":"sampath_fernando","post":"I am not comparing the hair of Jesus to that child Mr Farey. But I am using it show the effect of radiation to the Shroud image.No biological or chemical processes print the hair on a piece of linen.","date":"June 11, 2015 at 4:27 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"author":"sampath_fernando","post":"Shroud image is not a painting. Also image including hair couldn’t be be created by either biological or chemical processes.As I mentioned a negative image could only be created by some sort of radiation (most probably came from the body)Also Dr. Acceta’s experiement (using radio active elements) give clues to the emission of radiation to create an image.","date":"June 11, 2015 at 5:14 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"author":"sampath_fernando","post":"According to Gospel of Hebrews (not in the Christian Holy Bible) “And when the Lord had given Linen cloth to the servant of the Priest, he went to James and appeared to him” Gospel of Hebrews was written in First half of the second century. Why did the author mentioned about the Linen Cloth? Why Cannonical Gospels did not mentioned about it?Why can’t we assume that the Linen Cloth mentioned in the Gospel of Hebrews as The Shroud of Turin. We know that Scientised used a grab sample (from the most contaminated place) to do the Carbon Dating Test. As such we can’t accept those results.No one knows how the is image was formed on Shroud of Turin. Until some one tell the world how that image was formed we have to assme that Shroud of Turin and the Linen cloth mentioned in the Gospel of Hebrews as the same one.","date":"October 11, 2015 at 9:05 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","title":"No Closer to the Truth Because of Simony"},{"author":"sampath_fernando","post":"Hi Marco, do you know that the results you have analysed is only from a grab sample and not a representative sample from the shroud. How do you justified your results and tell the world that you are the best scientist. Don’t bark like a mad dog.","date":"October 9, 2015 at 4:48 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","title":"No Closer to the Truth Because of Simony"},{"author":"sampath_fernando","post":"One doesn’t know the difference between the photographic negative image and a painting. Other one tried to tell that the image was a scorch but he failed to prove it. Now he is using controversial Carbon Dating to support his new claim.","date":"February 15, 2015 at 4:35 am","url":"https://shroudstory.com/2015/02/14/on-deaf-ears-here/","cat":"other_blogs","title":"On Deaf Ears Here?"},{"author":"sampath_fernando","post":"Thank you OK. I learnt some very good information from your paper.","date":"March 15, 2015 at 1:55 am","url":"https://shroudstory.com/2015/03/14/rebuttal-of-a-long-standing-sindonological-myth/","cat":"guest_posting","title":"Rebuttal of a long-standing sindonological myth"},{"author":"sampath_fernando","post":"Yes when I visited museum There were only 4 or 5 people.","date":"October 9, 2015 at 3:38 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","title":"No Closer to the Truth Because of Simony"},{"author":"sampath_fernando","post":"Controversial C-Dating is only the evidence to say that Shroud of Turin  is created by medieval artisan.","date":"October 30, 2015 at 2:43 am","url":"https://shroudstory.com/2015/10/29/splish-splash/","cat":"comments_promoted","title":"Splish Splash"},{"author":"sampath_fernando","post":"Oh…Destruction. Yes it is a sad thing.But Jesus message to everyone “don’t build any buildings on this world”.Jesus message “New Commandment of Love” That is Love is permanent building. All the other things are temporarily.","date":"August 23, 2015 at 12:41 am","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","title":"The End if Near"},{"author":"sampath_fernando","post":"Louis: why should it only have happened to his body?Yes many people can’t comprehend that fact. One and only image. There is no any other image like that. Why forger did not make at least two or three of that image. He may not have enough chemicals to do that or it is not an man made image?","date":"May 10, 2015 at 4:33 pm","url":"https://shroudstory.com/2015/05/10/yannick-clment-on-colin-berrys-latest-hypothesis/","cat":"guest_posting","title":"Yannick Clément on Colin Berry’s Latest Hypothesis"}],"pollen":[{"author":"sampath_fernando","post":"According to Mr. Rucker’s hypothesis Carbon Dating of Shroud wonn’t give you a proper date but as Daveb says radiocarbon dating of pollen from Middle East may give an approximate date for the Shroud as it came to the Shroud after the any suspecting radiation.Today DNA results are using to convict many suspects. Also now we know that according to DNA analysis we can suspect that the linen cloth came from India and used it in some where in Middle East.","date":"November 5, 2015 at 4:29 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","title":"Paper Chase:  New Paper on SEM Analysis of Pollen"},{"author":"sampath_fernando","post":"Mr. Freeman please don’t underestimate the Indian weavers. They had technology to do many things before Jesus was born. Have you been to Elora Caves? If you visit those caves you will realise that India had high technology to construct many complex things.","date":"November 5, 2015 at 4:41 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","title":"Paper Chase:  New Paper on SEM Analysis of Pollen"}],"researchers":[{"author":"sampath_fernando","post":"For me Jesus is more than other preachers like Paul. Did Jesus tell us that we are saved through faith. James says faith is useless without works.Jesus never Judge who says Lord Lord. Read the parable of Goats and Sheep.No faith there.That Love we can see from the Shroud. William please go and do research on the Shroud rather than condeming the images","date":"April 20, 2015 at 12:19 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"author":"sampath_fernando","post":"Willian must be another decieved Christian out of more than 1000 denominations of protestants. These protestants has to be united and form a one denoimination if they are true followers of Jesus. Having more than 1000 denominations we can see what sort of LOVE, these protestants are showing. Once I was a protestant but now I am a free follower of Jesus because of the Shroud. From there I can see what word of God (Bible) is not telling.","date":"April 19, 2015 at 11:46 pm","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"author":"sampath_fernando","post":"Dear William-  Faith will never save you but faith can do marvelous things according to Jesus. Believe in Jesus and do what ever thing he ask you to do to recieve the Eternal Life. Remember new commandment and practice it to receive the Eternal Life rather than just thinking “only faith can save you”.. You guys have been fooled by Paul and Martin Luthur. Jesus never says faith will save you. Even Peter says sometimes he can’t understand the things written by Paul. (read Bible)Jesus is a doer rather than warming the seat what church goers are doing. (read the Bible) Today mahjority of Christians think faith can save them rather than helping their neighbours. What fools they are.As I told you previously do research on Shroud and see that how real is it. Find out for yourself why Jesus left that image on his burial cloth. Rather than studying the image on the Shroud you are just condemning it. Why? Are you brain washed.Shroud is not a false prophet, it a piece of cloth showing how Jesus suffered for you and me.God Bless You.Sampath","date":"April 20, 2015 at 4:52 pm","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"author":"sampath_fernando","post":"According to your Bible, when Jesus said we are saved by Grace?","date":"April 21, 2015 at 1:35 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"author":"sampath_fernando","post":"Then Matthew, Mark and Luke Gospels are contradicting John. Who is correct?","date":"October 27, 2015 at 1:11 am","url":"https://shroudstory.com/2015/10/26/dan-spicer-we-have-a-simple-explanation/","cat":"critical_summary","title":"Dan Spicer:  We have a simple explanation."},{"author":"sampath_fernando","post":"This Critical Summary does not mention anything about Blood on hair. As I mentioned few days ago Blood on Hair is the Trade Mark of Authenticity of the Shroud of Turin. This is the best evidence to prove that image was formed due to Radiation. No forger like painter or scorcher never place blood marks on hair. (I like B4.1 – Image)However I like the following:589-711AD in Spain – Peter ran to the tomb with John and saw the recent imprints of dead and risen One on the clothes.Yet in 1203 painters placed Nail Marks on the Palm and not on the wrist..","date":"October 22, 2015 at 4:31 pm","url":"https://shroudstory.com/2015/10/22/available-critical-summary-version-3-0/","cat":"critical_summary","title":"Available: Critical Summary Version 3.0"},{"author":"sampath_fernando","post":"So far conventional physics couldn’t give an answer to the image formation on Turin Shroud.However from the miracles Jesus performed including raising 3 people from dead, the fall-through hypothesis is the most obvious answer to the Image on Turin Shroud.Yes body got dematerialised and some sort of radiation emitted during that process may be the cause for the image formation. Statements from the Gospels we know that Jesus had a body like Angel after the resurrection. Remember before his death Jesus told that at resurrection we get a body like an Angel.","date":"October 27, 2015 at 8:12 pm","url":"https://shroudstory.com/2015/10/26/dan-spicer-we-have-a-simple-explanation/","cat":"critical_summary","title":"Dan Spicer:  We have a simple explanation."},{"author":"sampath_fernando","post":"I think resurrection of Jesus is a miracle and also a process.If it a miracle, then the body of Jesus should not change and it had to be the same bodies like Lazarus and the other two who were raised by Jesus from the dead. However unlike those three bodies, Jesus did not have the same body after the resurrection. According to Gospels Jesus acted differently after the resurrection. Jesus appeared and disappeared. What was the reason for that?So far no one has given an acceptable explanation how the image was formed. Then if Shroud of Turin is Authentic, then what was the reason for the image formation?If resurrection is a miracle then we may not get an image on the Shroud. So then some sort of process should have taken place during the resurrection.","date":"November 8, 2015 at 5:46 pm","url":"https://shroudstory.com/2015/11/08/the-process-of-resurrection/","cat":"critical_summary","title":"The Process of Resurrection"},{"author":"sampath_fernando","post":"Dear Mr. Frias MoreiraThank you for your comments. Yes resurrection is a miracle. However unlike in other miracles, Jesus left us his battered image on his burial cloth for the future generations to believe. But unlike other miracles performed by Jesus, during the resurrection some sort of process had occured and this extra ordinary process created the image on the linen cloth. That is why no one can give a reasonable explaination about the formation of Negative Image. (during the first century or 14th century no one knew how to paint a negative image of a full size person or even did not have technology to uniformly scorch full image of a person) Image formation can not be explain by today’s scientific knowledge. So for any laymen resurrection image formation also a miracle.God Bless YouSampath","date":"November 9, 2015 at 7:52 pm","url":"https://shroudstory.com/2015/11/08/the-process-of-resurrection/","cat":"critical_summary","title":"The Process of Resurrection"},{"author":"sampath_fernando","post":"Thank you very much Thomas. My opinion about Holy Bible is quite different. I think Holy Bible was given to Christians by Constantine as a political solution to satisfy various Christian groups existed at that time. As an example, to satisfy Jewish Christians compilers included Old Testament, although Moses plagiarised the Creation story, the Flood story and also the Ten Commandments from other nations. Also to satisfy Pauline Christians they included Epistles of Paul. Surprisingly those who compiled the Bible did not use any records of majority of other Apostles. They did not include anything about Thomas especially what he did in India and neighbouring countries of India. In addition they burnt many books inherited by other Christian groups.Jesus never mentioned anything about the creation story and/or the great flood. Only thing Jesus mentioned from the creation story is that at the beginning Father made man and woman and when they united they become one. Also Jesus told that no one knows the end but only the Father.Most of the Epistles written by Paul contradict the new commandment of Jesus and the two Great Commandments mentioned by Jesus.So as a follower of Jesus either Old Testament or Epistles give me no help to understand the Kingdom of God. (or the Kingdom of Love). Only four Gospels tell about the Kingdom of God and how can we enter into it.As a follower of Jesus (not as a Christian or fundamentalist Christian) I believe all stories of Jesus from 4 Gospels. I have to believe those stories because I believe that Jesus really resurrected from death. Although there are many sceptics, my wisdom always tells me that Shroud of Turin is authentic. So the Shroud of Turin is the main and first Gospel for me. From 1st April 2010, the day I was introduced to the Shroud, I believe that Jesus really existed, died on the cross and resurrected. So to believe other Gospels and its stories are not a problem for me.","date":"November 11, 2015 at 6:19 pm","url":"https://shroudstory.com/2015/11/08/the-process-of-resurrection/","cat":"critical_summary","title":"The Process of Resurrection"},{"author":"sampath_fernando","post":"If you are believing in Jesus (ie Vigin birth and resurrection) then you have to believe all the miracles mentioned in the four Gospels. Otherwise you are like a lost sheep.","date":"November 10, 2015 at 7:39 pm","url":"https://shroudstory.com/2015/11/08/the-process-of-resurrection/","cat":"critical_summary","title":"The Process of Resurrection"},{"author":"sampath_fernando","post":"Mr Freeman It is a miracle to get a photographic negative Image after pigments have disintegrated from a original painting.Furthermore in fourteenth century no one knew how to paint a photographic negative image with such a detail.","date":"May 22, 2015 at 1:51 am","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin"},{"author":"sampath_fernando","post":"Mr Freeman – Do you know anything about the Negative Photographic images? or X-Ray images?","date":"May 21, 2015 at 6:14 pm","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin"},{"author":"sampath_fernando","post":"Daveb – In the meanwhile, the Shroud can serve its purpose as an object of religious meditation, which in these pages is too seldom considered.Yes you are correct Daveb. Today for the first time I saw my wife was meditating in front of a photograph of the Shroud.Thank to Shroud I am still a follower of Jesus. Otherwise I don’t where I stand. For me Shroud is the only Gospel which shows that how God Loved us.","date":"May 21, 2015 at 7:30 pm","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin"},{"author":"sampath_fernando","post":"John is correct. We are blind men and trying our best how to explain the image formation on the Shroud. Scientists have concluded many aspects of the image yet historians are trying their best to explain that image is a painting.","date":"May 21, 2015 at 4:20 pm","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin"},{"author":"sampath_fernando","post":"Thank you Mr. Klotz I agree with you.","date":"May 21, 2015 at 11:58 pm","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin"},{"author":"sampath_fernando","post":"Agree with Max. Colin does only trial and error experiments. However todate noone has found a real mechanism of the formation of the TS image.No one can achieve that unless they understand the resurrection process of Jesus. Remember this image was formed in either 14th century or 1st century and that time they did not have technology what we are using today.","date":"July 28, 2015 at 4:51 pm","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"}],"resources":[{"author":"sampath_fernando","post":"PHPL: How can documents that sometimes don’t even agree with one another be described as accurate in the first place ?Thank you PHPL. I am having the same difficulty with the books of NT.  But one day Shroud of Turin will reveal that Jesus died for fighting the injustice of the world (some say sins of the world) and the resurrection (created image on the shroud) will show that God sent the perfect human being to us to believe the message of Love and also  to reveal God is in full control over the Universe.","date":"June 14, 2015 at 4:29 am","url":"https://shroudstory.com/2015/06/13/also-because-of-the-shroud-of-turin/","cat":"press_coverage","title":"Also Because of the Shroud of Turin"},{"author":"sampath_fernando","post":"Thank you Daveb. As engineer like you I have some difficulty between the teaching of Jesus and some theology of Paul. That is why I quote NT but not the Gospels.","date":"June 14, 2015 at 4:25 pm","url":"https://shroudstory.com/2015/06/13/also-because-of-the-shroud-of-turin/","cat":"press_coverage","title":"Also Because of the Shroud of Turin"},{"author":"sampath_fernando","post":"Thank you Louis. I went to Agra but I couldn’t go to see this monument. One day Stephen Hawking will reincarnate. Then he will realise that there is a after life. Actually I have met 3 people who remembered their past life.I hope that one day Catholic Church  will certify that Shroud of Turin is a genuine burial cloth of Jesus or before that scientists will confirm it.","date":"June 19, 2015 at 5:42 pm","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","title":"BBC News Magazine:  The Perplexing Image"},{"author":"sampath_fernando","post":"Majority of people living on this earth are like Martin Saunders, They can mis- guide many ignorant Christians. How can he condemned Shroud based on Carbon dating results. This ignorant guy knew only about the results but did not know how and from where the sample was taken to test. Also he did not know sample was contaminated or not. What a fool.Todate no one has given any conclusive idea how the image was formed on the Shroud of Turin.People like Martin Sauders write these articles only to earn money and also for the popularity. When you analyse 3 temptations Jesus overcame you can uderstand that how Jesus denied Popularity, Pride, Corruption, Material desires and Material Wealth.","date":"July 23, 2015 at 4:54 pm","url":"https://shroudstory.com/2015/07/23/because-if-it-looks-unbelievable/","cat":"article","title":"Because If It Looks Unbelievable"},{"author":"sampath_fernando","post":"Thank you Louis. I am not agreeing or disagreeing with you. To understand Miracles, Resurrection, Creation of image on Turin Shroud, NDE, reincarnation we need some sort of divine inspiration.","date":"June 19, 2015 at 9:39 pm","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","title":"BBC News Magazine:  The Perplexing Image"},{"author":"sampath_fernando","post":"Before destroying Mr Wilson’s argument we can destroy the Paint hypothesis of Mr. Freemans. How painted image became a Negative Image after flaking off the pigments? Shroud of Turin image is not a painted one.","date":"May 7, 2015 at 4:48 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"author":"sampath_fernando","post":"Why Canonical Gospels have not mentioned anything about the Shroud. (also about the other disciples of Jesus)?According to Gospel of John we know that Peter and John saw the burial clothes of Jesus at the Tomb. But John did not write that they took the burial clothes with them. Why?  Most probably they did not want to steal the clothes which were belonging to Joseph of Arimathea. During the last 3 months 3 reformed Christians (born again) condemned the Shroud of Turin because it is an image. They did so because they believe that Scriptures (Bible) are inspired by God.  So is this the same reason Gospel writers did not want to mention the image on the burial cloth of Jesus? They may have thought their eye witness record (of resurrection) is more important than the image on the burial cloth. However according to Gospel of Hebrews Jesus gave the Linen Cloth to the Servant of Priest. Who is this servant? Most probably this servant is one of the other disciples not mentioned in the canonical Gospels (after Jesus death). Four canonical gospels are not giving any information about the other disciples after the death of Jesus.  We can read only about Peter, John and Thomas before the ascension. There some names in John 21:1-3. We can’t read anything about Thomas who preached in India.Gospel of Hebrews was written in middle of the second century and the writer of this Gospel knew about the linen cloth. May the writers of canonical gospels did not know about it or just ignored it.","date":"May 7, 2015 at 6:43 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"author":"sampath_fernando","post":"Mr Berry and Mr Freeman are helping us to believe in Shroud of Turin as a genuine one.I like Mr. Berry’s experiments. Still he struggling to achieve the features of Shroud of Turin.Furthermore Mr. Freeman’s hypothesis is very interesting. His painted image became a photographic Negative with 3D coding. (painted pigments flaked off miraculously giving us a negative image). What sort of miracle is it.","date":"May 4, 2015 at 6:04 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"author":"sampath_fernando","post":"If non-scientists created the shroud image then why today’s expert scientists can’t create a similar image?","date":"August 16, 2015 at 8:23 pm","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"author":"sampath_fernando","post":"Sorry When Mr. Farey called Daveb is not a scientist, as an (civil/environmental) engineer I realised what is the real meaning of ignorance.","date":"August 18, 2015 at 5:37 pm","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"author":"sampath_fernando","post":"When Mr. Farey called Daveb is not an engineer, as an (civil/environmental) engineer I realised what is the real meaning of ignorance.","date":"August 18, 2015 at 5:35 pm","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"author":"sampath_fernando","post":"Yes everyday I am learning and undersatanding many things including people","date":"August 18, 2015 at 6:25 pm","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"author":"sampath_fernando","post":"Thank you Colin for your determination. However either on 1st century or 14th century no one had that sort of technology to print an imgage similar to image like Shroud of Turin. Shroud is 14 feet long and 3 feet wide. If they had the technology, today we could have seen many diferent type of images printed in either 1st or 14th century.","date":"August 20, 2015 at 4:54 pm","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"author":"sampath_fernando","post":"Thank you Louis. That is an opinion of individual.","date":"August 18, 2015 at 7:12 pm","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"author":"sampath_fernando","post":"Yes Louis Jesus did not go to India but according to legends St Thomas went to Kerala and later some Jewish traders went to Sri Lanka and established a small Christian community in 4th centaury. Recently they found a Nasrine or Persian cross in place call Anuradhapura and now that cross is in Anuradhapura (small) museum. However Sri Lankan Methodists printed a sketch of that cross in the front cover of their Hymn book. I am planning to go to Kerala to find more information about the mission of St Thomas.","date":"May 28, 2015 at 4:32 pm","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"author":"sampath_fernando","post":"Thanks Louis I have been that Church in Mylapore.","date":"May 28, 2015 at 7:01 pm","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"author":"sampath_fernando","post":"John confirmed in his Gospel that Jesus really died. Who is not believing that?","date":"May 29, 2015 at 5:18 am","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"author":"sampath_fernando","post":"Thank you Daveb.Without knowing any scientific research (today), the fisherman John mentioned that the blood and water came from the body to prove that Jesus was really died on the cross. That is is why I like Gospel of John very much. It gives us a good summary of Jesus mission, his death and also the resurrection (including the burial clothes).","date":"May 28, 2015 at 4:21 pm","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"author":"sampath_fernando","post":"Miguel Lorente Acosta: Our hypothesis is that during the process of the preparation of the body, it was discovered that Jesus had not died on the cross. It is not an idea conceived beforehand nor is it a questioning of seemingly inexplicable specific events, but rather the consequence of the study of objective elements that appear on the Shroud of Turin. The arguments are to be found in the Shroud itself and have been divided under two broad headings: On the one hand, the signs that indicate that the body which produced the image was not that of a dead person, and, on the other hand, the evidence of signs that somehow reflect vitality in the elements of the Shroud.Good on you Louis. We can kill two birds in one stone: (Gospel John tells that Jesus really died)So what can we deduce from his hypothesis1. Image was created during the process of resurrection (Louis – split second between death and life – or body started moving with the flow of blood??)2. Blood is real Am I wrong?","date":"May 29, 2015 at 11:10 pm","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"author":"sampath_fernando","post":"Hi Louis I am going to Kerala in Jan 2016. However next month I am going to Spain. This time I can’t go to Oviedo. Where did they keep Sudarium in Seville? Any idea/","date":"May 31, 2015 at 12:05 am","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"author":"sampath_fernando","post":"Thank you so much Louis. if I need more information I will email to you.Earlier when I wrote – “body started moving with the flow of blood” – I realy meant recirculation of blood inside the body and not flowing out blood from the body.","date":"May 31, 2015 at 4:43 pm","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"author":"sampath_fernando","post":"Shroud of Turin is the only evidence we have today to prove that Jesus really died on the cross. As most of us are suspecting Resurrection of the dead body of Jesus is the only reason to print an image on the Shroud.Furthermore we have never seen a piece of linen cloth had an printed image similar to the Shroud of Turin, from a wrapped body of a living person.If Jesus had not died on the cross then we never get an image on the Shroud of Turin.To prove Shroud of Turin as a fake item, then scientists have to create a image similar to the Shroud of Turin using a living person and also have to confirm that such technology was available in the 14th century.","date":"June 8, 2015 at 3:42 am","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"author":"sampath_fernando","post":"Hi Mr. Felzmann; Do you have any idea about the formation of the image on the Shroud if the man under the shroud must have still been alive?","date":"June 2, 2015 at 5:28 pm","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"author":"sampath_fernando","post":"Hugh: Now, what is the probability that a Spanish cloth dating from the 8th century and a French cloth dating from the 14th century both wrapped the head of a man in the 1st century?I have no doubt that, it all depends on the amount of Contamination. Did anyone found that those two clothes are without any contamination and are on the original state? Who think those two clothes are suitable for Carbon dating to decide their age?","date":"April 8, 2015 at 3:54 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","title":"Easter Ink"},{"author":"sampath_fernando","post":"Thank you Daveb: I have not read in any other religions a person like Jesus. Jesus is only person died and resurrected. Most probably Shroud is the only witness to that.","date":"April 27, 2015 at 6:42 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"author":"sampath_fernando","post":"Interesting Daveb. However you did not touch; reincarnation, eternal conciousness, results from regression therapies and NDE. Upanishads tell that at the begining all were with the Creator and they left the creator and finally all who left the creator wanted to unite with the creator again.In Revelation we can read about the fallen angels. According to parable of Prodigal son who is this son and why father is waiting for his return? That is why Jesus came to this world to take lost angels back to the kingdom of God. Jesus main message was “Love”.Look at the Shroud. You can see that Love there. See how much Jesus suffered tell us how much father is loving us. Until science tell me how the image got printed on that linen piece Shroud is real for me. I never believe controversial Carbon Dating results.","date":"April 27, 2015 at 4:45 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"author":"sampath_fernando","post":"If Gospels are true;Luke 23:46 (New International Version) Jesus called out with a loud voice, “Father, into your hands I commit my spirit.” When he had said this, he breathed his last.Mark 15:38 (New International Version) The curtain of the temple was torn in two from top to bottom.From the above we can see that when Jesus handed over his spirit to the Father, how much energy dispatched from his body. That energy was so powerful that even the curtain of the temple was torn in two from top to bottom.As I mentioned previously no one knows about the resurrection process and no one knows how much energy is required to enter the spirit of Jesus back to his dead body.Can anyone explain about this energy? What type? and What quantity?","date":"April 14, 2015 at 4:53 pm","url":"https://shroudstory.com/2015/04/14/interview-with-paolo-di-lazzaro/","cat":"article","title":"Interview with Paolo Di Lazzaro"},{"author":"sampath_fernando","post":"At resurrection:Matthew 28:2 (New International Version) There was a violent earthquake, for an angel of the Lord came down from heaven and, going to the tomb, rolled back the stone and sat on it.At resurrection where this energy came from to have violent earthquake?","date":"April 14, 2015 at 6:30 pm","url":"https://shroudstory.com/2015/04/14/interview-with-paolo-di-lazzaro/","cat":"article","title":"Interview with Paolo Di Lazzaro"},{"author":"sampath_fernando","post":"Hi Mr. Farey – As a logical thinker I knew you are going to ask that question. Before giving my answer I must thank to Dan for this valuable and unique site on Shroud of Turin.I was exposed to Shroud on 1 April 2010 and after that I gave my leisure time to do research on Shroud and this Dan’s site helped me to learn almost all about the Shroud. It is nice and good experience to listen to all sort of people and absorb many positive as well as negative things about the Shroud.Mr. Farey, the blood on hair is the Trade Mark of Authenticity of the Shroud. It tells that image on Shroud is not a painting as well as not a contact process. Furthermore Blood on Hair tell us that image was formed due to some form of Radiation. This Blood on Hair confirmed that it is not a work of a forger.Resurrection is a unique incident in Human history. No one ever resurrected from the death after three days.  So my imagination is that at Resurrection Jesus body got dematerialized and radiation emitted from the body including Hair.  That is why we can see blood on Hair on the image.Scientific research on Shroud tells us that the body which was caused the image on Shroud never got deteriorated. Furthermore STURP research tells us that blood came first before the formation of image.  Dr. Lavoie’s observation also confirmed that blood on cheeks came first before the formation of image.OK is 90% correct to say that image was formed by shortest distance due to some sort of emission of waves from the body. Dr. Lavoie is also 1-5% correct shroud was flat and vertical projection was the mechanism.Now I give the possible missing link (say 5% accuracy)Mr. Farey can you remember I posted a clip which shows that when radiating hair blows out. What can we get from that clip?This is my hypothesis: At resurrection Jesus body got dematerialized and radiation emitted from the body.  Due to this radiation image was formed on the Shroud. During this process hair got blown out and as a result of that draped cloth expanded on the cheek area and image of hair got printed on the blood absorbed area of the cheek.Mr. Farey what do you think?Unlike Engineer Daveb, my communication is not that good because English is my second language.","date":"October 19, 2015 at 4:23 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"author":"sampath_fernando","post":"I think Shroud got expanded less than 30 degrees from the verticle plane. If Shroud is fully flat then blood marks goes outside the hair.Of course hair covered the ears.","date":"October 20, 2015 at 6:34 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"author":"sampath_fernando","post":"Hi OK – I am agrreing with you. But how can you explain the image formation of hair. Was it followed the shortest direction or the verticle direction?","date":"October 18, 2015 at 11:05 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"author":"sampath_fernando","post":"Every piece of these timber (or none) may not be from the true cross But how this brain washed John Calvin – second generation reformist – spread false rumours to attract people from Catholic Church to their new church?","date":"October 13, 2015 at 6:43 pm","url":"https://shroudstory.com/2015/10/13/more-carbon-dating-and-other-studies-of-christian-relics/","cat":"article","title":"More Carbon Dating and Other Studies of Christian Relics"},{"author":"sampath_fernando","post":"Yes, to date no one knows or can explain how the image was formed on the Shroud of Turin. But we know that it is a negative photograph and in 14th Century no one had any technology to produce a such an image on 14 feet by 3 feet long sheet with three dimensional coding.","date":"March 10, 2015 at 4:02 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"author":"sampath_fernando","post":"Dear Mr. Farey.Do you believe Image on Shroud of Turin was produced in 14th century based on Carbon Dating results of the shroud? According to your opinion how the image on Shroud of Turin was produced or formed?Thank you.","date":"March 9, 2015 at 6:27 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"author":"sampath_fernando","post":"When human can’t understand how image was created then we need help from heaven. As Christians we are believe in God the Father then we have to believe in his heavenly hosts including Guardian Angels. I believe in Guardian Angels. So Leon I believe you.","date":"March 10, 2015 at 4:54 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"author":"sampath_fernando","post":"Dear DavebOne skeptic says it is a painting. He says so, because he doesn’t know the difference between a painting and a negative photographic image. Other skeptics do not know how the image was formed. Some says it is a scorch. No one even Christians do not know what was involved in Resurrection Process. So without telling us how it was formed they tell us it is a fake.No one can produce any other image similar to image on shroud of Turin or can produce any other image which was produced in 14th Century or even 21st Century.Furthermore these skeptics can not understand the difference between Grab sample and composite sample. They don’t know what is the meaning of represetative sample. Even they don’t know what is the meaning of contamination.So Daveb please don’t give up. I have learnt many from you. Hope to learn more in the future.God Bless You.","date":"March 9, 2015 at 5:03 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"author":"sampath_fernando","post":"Of course, the image is the work of that greatest scientice.","date":"August 5, 2015 at 8:26 pm","url":"https://shroudstory.com/2015/08/05/scientist-barrie-schwortz/","cat":"article","title":"Scientist Barrie Schwortz"},{"author":"sampath_fernando","post":"Very interesting discussion.I don’t know the person who created an image on the Shroud is a Scientist or Artist or Photographer or a any other person or the creater of this universe?However I can describe that person as a one of the greatest scientist as he created this image before highly developed science came to existence. Still so call scientists are struggling to explain how the image was formed.","date":"August 5, 2015 at 5:42 pm","url":"https://shroudstory.com/2015/08/05/scientist-barrie-schwortz/","cat":"article","title":"Scientist Barrie Schwortz"},{"author":"sampath_fernando","post":"Hope one day Colin can get an image only on the top of a surface of a linnen giving 3D coding.","date":"August 13, 2015 at 10:25 pm","url":"https://shroudstory.com/2015/08/05/scientist-barrie-schwortz/","cat":"article","title":"Scientist Barrie Schwortz"},{"author":"sampath_fernando","post":"As daveb says those who involved in taking the sample did not follow proper proceedure. They took a grab sample (no engineer do that sort of mistake) instead of representative sample and told the world that Shroud is a medieval forgerry. They may have adopted correct laboratory procedures but this do not imply that their results are correct.No one knows when the textile was woven. No one knows how the image got printed. No one knows whether they took the sample from an original linen cloth. Very interesting.","date":"September 9, 2015 at 6:15 pm","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"},{"author":"sampath_fernando","post":"Mr Farey: Could you please explain how the image was created? Any idea?","date":"May 14, 2015 at 6:16 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","title":"Too Great to Be a Work of Art"},{"author":"sampath_fernando","post":"Today we know that the one who painted (scorched, chemist) the Image knew all the following information in 14th century:1. Photographic Negatives2. X-Ray like properties3. Nail was punched at wrist but not at the palm (innovation)4. How blood is flowing (knowledge of Fluid Mechanics)5. How to create the image only at top (thickness of 2nm) but blood has to penetrate first6.Not a 2D image but accurate measurement for a curved image (as sheet was covered the dead body)7. Three Dimensional coding8. Crown of thorn as a helmet like thing9. One leg bent over the other leg (one leg is short)10. To show 4 fingers (not the thumb) due to nailed the person from the wrist and not from the palm.11. What type instrument used the beat the person12. How to find suitable linen to create the imageWhat a wonderful person is that painter (scorcher, chemist). If that person is born today he will do marvellous things as he can see many things which will come in the future. (What sort of innovator is he?","date":"May 14, 2015 at 4:55 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","title":"Too Great to Be a Work of Art"},{"author":"sampath_fernando","post":"I prefer the experiments done by Dr. P. Di. Lazzaro. Compared to the experiments done by other scientists, Dr. Lazzaro’s experiments give us some sort of food for thought to imagine how the image on TS was created.Definitely some sort energy dissipated from the dead body of Jesus as resurrected body of Jesus quite different to the body he had before his death.","date":"August 17, 2015 at 7:30 pm","url":"https://shroudstory.com/2015/08/17/and-now-antonaccis-test-the-shroud-proposal-is-to-be-a-book/","cat":"books","title":"And Now Antonacci’s Test the Shroud Proposal is to be a Book"},{"author":"sampath_fernando","post":"But TS is the only one have those properties.","date":"May 16, 2015 at 2:51 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","title":"Too Great to Be a Work of Art"},{"author":"sampath_fernando","post":"Mr. Mattingly going on a wrong path.","date":"May 8, 2015 at 5:20 pm","url":"https://shroudstory.com/2015/05/08/new-book-by-stephen-mattingly-proposes-image-mechanism/","cat":"books","title":"New Book by Stephen Mattingly Proposes Image Mechanism"},{"author":"sampath_fernando","post":"This is what I read in an article:I was puzzled by the fact that on certain photographs these letters were visible and not on others, so I consulted professional photographers. They told me that because the image is present only on the most superficial one to two fibers of the cloth, (each thinner than a human hair), the FOCUSING OF THE LENS (distance) by the individual photographers is of the utmost importance and that varies from photographer to photographer.","date":"November 12, 2015 at 8:17 pm","url":"https://shroudstory.com/2015/11/11/psychological-influences-in-seeing-inscriptions-on-the-shroud-of-turin/","cat":"paper_chase","title":"Psychological Influences in Seeing Inscriptions on the Shroud of Turin"},{"author":"sampath_fernando","post":"Confused people who don’t know how the image got printed (or cannot explain) on the burial cloth of Jesus (or Shroud of Turin) use Controversial Carbon-dating results to prove their claims that TS is a fake.","date":"March 4, 2015 at 7:09 pm","url":"https://shroudstory.com/2015/03/04/inside-the-popes-bedroom-and-more/","cat":"books","title":"Inside the pope’s bedroom and more"},{"author":"sampath_fernando","post":"Thank you Barrie for your honest explainations. I believe.","date":"August 1, 2015 at 1:36 am","url":"https://shroudstory.com/2015/07/29/barrie-schwortz-on-catholic-radion-indy/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Catholic Radio Indy"},{"author":"sampath_fernando","post":"I am agreeing with you Mr. Freeman. But we do not have any evidence. To prove that we should have more images similar to Shroud of Turin.","date":"September 14, 2015 at 12:43 am","url":"https://shroudstory.com/2015/09/12/new-barrie-schwortz-podcast/","cat":"radio_and_podcasts","title":"New Barrie Schwortz Podcast"},{"author":"sampath_fernando","post":"Thank you Louis. Even yesterday I told an Anglican that this is not an image to worship but to prove that resurrection is real.How lucky we are because non Christian,  Barrie,  is taking major role to tell the world that Shroud is not a man made image.When I am talking to Buddhists, Hindus and Atheists I am using Shroud to convince them that resurrection is real.Unfortunately still people can’t understand that any thing about negative image and today we don’t have any negative image man made negative image either in 13th century or 1st century.How a flaked out painting give us a perfect negative.","date":"September 12, 2015 at 7:08 pm","url":"https://shroudstory.com/2015/09/12/new-barrie-schwortz-podcast/","cat":"radio_and_podcasts","title":"New Barrie Schwortz Podcast"},{"author":"sampath_fernando","post":"Yes Mr Farey,  today we have all this scientific knowledge. Other than TS do have any other painting to support your claim (painted in 14th or 1st century). TS is a unique image which no one can explain accurately how was created. I am believing in miracles and that is why I am follower of Jesus. No human can explain how Jesus did those miracles including the image printed on the Shroud. Today human’s can give all sort of theories or hypothesis about the creation of the TS image unfortunately no one was able to produce an exact image like TS which was revealing the passion of Jesus.","date":"January 9, 2015 at 2:42 pm","url":"https://shroudstory.com/2015/01/08/an-early-morning-google-find/","cat":"video","title":"An Early Morning Google Find"},{"author":"sampath_fernando","post":"Mr. Farey – “A bas relief covered with an acidic paste, on the other hand, would do the trick quite nicely, if the paste was thoroughly washed off”Has anyone done simmilar technique to a Proto Type Image  – Full size image of a person for both frontal and Dorsal sides?","date":"November 12, 2015 at 6:06 pm","url":"https://shroudstory.com/2015/11/09/because-i-dont-see-it/","cat":"video","title":"Because I Don’t See It"},{"author":"sampath_fernando","post":"Zittau Veil is not a negative image. Furthermore if you take a negative photograph of those shadowy images that will never give you a positive image.","date":"January 9, 2015 at 9:30 pm","url":"https://shroudstory.com/2015/01/08/an-early-morning-google-find/","cat":"video","title":"An Early Morning Google Find"},{"author":"sampath_fernando","post":"Thank you Louis. Here most interesting point is outsiders who do not know the language saw the letters. Later person who knew the language interpret it.If Ms Frale see the letters and translate it then it is real forgery.But in this case people who don’t know each other saw the letters and interprit it.I can’t see any forgery there.","date":"November 12, 2015 at 7:41 pm","url":"https://shroudstory.com/2015/11/09/because-i-dont-see-it/","cat":"video","title":"Because I Don’t See It"},{"author":"sampath_fernando","post":"Mr Farey – “the homogeneity of the image is one of the arguments in favour of a medieval creation”Mr Latendresse’s explanation is very interesting. Mr Farey there is no logic in your statement. Why the Artist or scorcher placed blood on hair?I don’t know why Mr. Freeman is blaming Ms Frale without any reason. As Louis said she did not see the letters but someone else saw it and sent it to her to interpret.Other interesting we get the mirror image of letters on the shroud and could see it only on the positive image.","date":"November 12, 2015 at 4:13 pm","url":"https://shroudstory.com/2015/11/09/because-i-dont-see-it/","cat":"video","title":"Because I Don’t See It"},{"author":"sampath_fernando","post":"Hi Mr. Farey – Do you have any idea why those medieval painters (or scorchers) created a negative image rather than a positive image of battered body.","date":"November 12, 2015 at 10:06 pm","url":"https://shroudstory.com/2015/11/09/because-i-dont-see-it/","cat":"video","title":"Because I Don’t See It"},{"author":"sampath_fernando","post":"Disciple John took Mother Mary to Ephesus in Turkey. According to word of mouth John made a small house for Mother Mary on a top of a mountain and I was lucky to visit that place.Furthermore I believe that Jesus had step brothers and sisters or cousin brothers and sisters.","date":"March 12, 2015 at 6:33 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"author":"sampath_fernando","post":"Hi Daveb – logically you are correct. Only thing I can’t understand is why Jesus asked John to look after Mother Mary after his death. Usually mother stays with daughters or sons. That is why I thought those brothers and sisters are children of Joseph but not of Mary. No one knows about whether Mary had sexual relationship with Joseph or not. it is a private thing which no one discloses.","date":"March 13, 2015 at 4:23 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"author":"sampath_fernando","post":"I believe Gospel of John than other three Gospels as it is the only Gospel ention about the burial cloth of Jesus and as well as the face cloth.So I am alinged to believe this author that Mother Mary did not have any other children and that is the reason Jesus asked the disciple he loved most to look after his mother after his death. Furthermore Mother Mary accepted Jesus advise and accepted this person as her son. If she had other children by her own she never accepted the advise of Jesus.","date":"March 15, 2015 at 4:58 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"author":"sampath_fernando","post":"Hi Daveb – “disciple whom Jesus loved”. I don’t think that person is a family member. Jesus supported his disciples more than his brothers and sisters (read Matthew 12:46-50). Yes according to this passage Jesus supported his disciples more than his brothers and sisters (including the James the leader of church in Jerusalem). Jesus never asked James to look after his mother. Why? There must be a reason. Why mother Mary accepted that person as his son rather than her own children.Definitely disciple whom Jesus loved is not a family member of Jesus. That person must be the person who wrote Gospel of John.","date":"March 13, 2015 at 6:42 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"author":"sampath_fernando","post":"Skeptics never give sources because they are working on speculations. Why these people are ignoring published scientific work?","date":"March 5, 2015 at 4:14 pm","url":"https://shroudstory.com/2015/03/05/keeping-an-audience-in-suspense/","cat":"television","title":"Keeping an audience in suspense"},{"author":"sampath_fernando","post":"Thank you Dan. I like the explaination by Gilbert Lavoie about the showing of blood in the hair. ” It is not from hair but from cheeks. So it is a very good evidence to show that image is not a painting also not formed by a contact process”. I like his demonstation.","date":"October 18, 2015 at 9:14 pm","url":"https://shroudstory.com/2015/10/18/raymond-arroyos-special-report-from-april/","cat":"video","title":"Raymond Arroyo’s Special Report from April"},{"author":"sampath_fernando","post":"Thank you Louis.But Jesus tells us “Spirit is willing but flesh is weak”","date":"September 24, 2015 at 6:38 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","title":"Recent Interview with Russ Breault"},{"author":"sampath_fernando","post":"Hi Mr. Russ Breault and Mr. Simon Brown.Than you very much for that interveiw.This my understanding about the burial procedure.According to Gospels of Matthew, Mark and Luke, Joseph of Arimathaea and Nicodemus wrapped the body of Jesus with a clean linen cloth and Mary Magdalene and Mary the mother of Joses and also other women which came with him from Galilee were there. Furthermore those Gospels do not tell anything about applying spices.But John who was not at the tomb tell us that Joseph of Arimathaea and Nicodemus wound the body of Jesus with the spices.Furthermore Gospels Matthew, Mark and Luke tell us that these ladies came to tomb at the end of the Sabbath (at dawn) with spices to anoint the body.I think John who was not at the tomb on Friday evening assumed that Joseph of Arimathaea and Nicodemus anoint the body of Jesus spices and wound the body of Jesus with linen clothes. Contrast to the other synoptic gospels John does not tell that women went to tomb to anoint the body with spices.So what did John see at the tomb on the Sunday morning? He saw the face cloth, he saw the linen cloth which was used to wrap the body of Jesus and also he saw the other linen clothes which was not used but intend to use on Sunday, to wrapped the body of Jesus, after anointing the body with spices.","date":"September 24, 2015 at 6:17 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","title":"Recent Interview with Russ Breault"},{"author":"sampath_fernando","post":"Hi Louis:Very interesting discussion.What is Sin?Doing something against your consciousness?OrNot loving your neighbor as thyself?OrBreaking the New Commandment of Love?","date":"September 24, 2015 at 5:42 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","title":"Recent Interview with Russ Breault"},{"author":"sampath_fernando","post":"Thank you Louis. Question to Historians – Which one came first?  Jesus mosaic in Sanliurfa ( ancient Edessa) or the Shroud of Turin?","date":"October 1, 2015 at 5:09 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","title":"Recent Interview with Russ Breault"},{"author":"sampath_fernando","post":"Very interesting article Daveb. Thank you.","date":"September 29, 2015 at 8:11 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","title":"Recent Interview with Russ Breault"},{"author":"sampath_fernando","post":"What is meaning of This Simon: “That means not by Allah, not by Mary, not by Buddha, but Jesus Christ of Nazareth alone, and not by being “loving and caring people.” alone.”Why did you discard, Allah, Mary and Buddha. Also by following the religions founded by others you can behave like Jesus and show your love to others.","date":"August 26, 2015 at 6:22 pm","url":"https://shroudstory.com/2015/08/25/simon-brown-video-of-barrie-schwortz-at-jalsa-salana-uk/","cat":"video","title":"Simon Brown Video of Barrie Schwortz at  Jalsa Salana UK"},{"author":"sampath_fernando","post":"Thank you Daveb I like Acetta’s original paper.","date":"May 26, 2015 at 3:25 am","url":"https://shroudstory.com/2015/05/20/shroud-prompted-return-to-faith-for-august-accetta/","cat":"video","title":"Shroud Prompted Return to Faith for August Accetta"},{"author":"sampath_fernando","post":"Jesus never asked us to be a Christian or Catholic. His main message was Kingdom of Heaven is here “Repent” or change our ways. (or follow me and practice the concept of Love”","date":"August 27, 2015 at 1:34 am","url":"https://shroudstory.com/2015/08/25/simon-brown-video-of-barrie-schwortz-at-jalsa-salana-uk/","cat":"video","title":"Simon Brown Video of Barrie Schwortz at  Jalsa Salana UK"},{"author":"sampath_fernando","post":"Wrong understanding Simon, to save we have to be like Jesus or have to love everyone (our neighbours) as ourselves like Jesus did (don’t discriminate any religion or any person). Please refer 1 John 4:17.","date":"August 25, 2015 at 11:59 pm","url":"https://shroudstory.com/2015/08/25/simon-brown-video-of-barrie-schwortz-at-jalsa-salana-uk/","cat":"video","title":"Simon Brown Video of Barrie Schwortz at  Jalsa Salana UK"},{"author":"sampath_fernando","post":"All are children of God whether you are Christian or not and so anyone can born again.","date":"August 27, 2015 at 2:46 am","url":"https://shroudstory.com/2015/08/25/simon-brown-video-of-barrie-schwortz-at-jalsa-salana-uk/","cat":"video","title":"Simon Brown Video of Barrie Schwortz at  Jalsa Salana UK"},{"author":"sampath_fernando","post":"Louis I noticed the same thing. I could not believe the explanations given by Hugh to the community.","date":"August 26, 2015 at 6:27 pm","url":"https://shroudstory.com/2015/08/26/youtube-of-barrie-schwortz-at-ahmadiyya-annual-convention/","cat":"video","title":"YouTube of Barrie Schwortz at Ahmadiyya Annual Convention"},{"author":"sampath_fernando","post":"Yes Don radiation emitted from the dead body of Jesus and creating an image on the burial cloth is a miracle. No scientist can re-enact the resurrection process.","date":"June 18, 2015 at 7:50 pm","url":"https://shroudstory.com/2015/06/17/the-shroud-on-nbcs-today-show/","cat":"television","title":"The Shroud on NBC’s Today Show"}],"sudarium":[{"author":"sampath_fernando","post":"CF -As Hugh has pointed out in the British Society bulletin there are major problems with the pollen on the Shroud. What are the major problems with the pollen on the Shroud? .","date":"February 16, 2015 at 4:00 am","url":"https://shroudstory.com/2015/02/15/important-new-pollen-discovery-on-the-sudarium-of-oviedo/","cat":"press_coverage","title":"Important New Pollen Discovery on the Sudarium of Oviedo?"},{"author":"sampath_fernando","post":"Thank you Dan for publishing Mr. Breault’s interviews. For me Shroud and Sudarium is genuine.I agree with Yannick for further research to confirm those claims.","date":"August 2, 2015 at 4:29 pm","url":"https://shroudstory.com/2015/08/02/interview-with-mark-guscin/","cat":"sudarium","title":"Interview with Mark Guscin"},{"author":"sampath_fernando","post":"Thank you Dan giving us this translation. Day by day we are coming closer to the truth. Which one is more powerful Faith or Science (carbon dating results)?","date":"May 3, 2015 at 6:42 am","url":"https://shroudstory.com/2015/05/03/shroud-and-sudarium-blood-agreement/","cat":"2015","title":"Shroud and Sudarium Blood Agreement"},{"author":"sampath_fernando","post":"Louis: Thank you for your interesting paper. I know, oneday some one will prove that both the Shroud of Turin and the Sudarium of Oviedo wrapped the same person in first centuary.","date":"April 8, 2015 at 4:44 pm","url":"https://shroudstory.com/2015/04/06/new-paper-on-the-sudarium-of-oviedo/","cat":"sudarium","title":"New Paper on the Sudarium of Oviedo"},{"author":"sampath_fernando","post":"As no one has seen the crucifixion and also the resurrection process people are making a lot of assumptions. Some assumptions may be correct and the other may be wrong.My assumption for the formation of image is dematerialization of the body and related radiation from it. As most of the Christians believe, Jesus did not resurrect bodily but resurrect only spiritually. Jesus resurrected with his spiritual body and discarded his material body. (Remember Jesus once said that spirit (or spiritual body) is willing but flesh (material body) is weak)So no one knows how the radiation initiated and also during that process how the body was reacted. Also no one knows what happen to the hair. My assumption is that most probably hair got blown out during this process. As I have previously stated the force of the blown out hair helped to raise the wrapped cloth such a way the image of the hair got printed on the formally blood tainted area of the cheeks. That was the main reason that image got blood in hair. This expansion of cloth in the face area is main reason for not to have image from the top of the head.No forger or no painter place blood in the hair. Blood in the area of the hair of the image is the trade mark of authenticity of the Shroud of Turin.","date":"December 2, 2015 at 8:19 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"author":"sampath_fernando","post":"Thank you Colin for this interesting information.","date":"December 4, 2015 at 1:03 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"author":"sampath_fernando","post":"Thank you Mr. Carney.  Yes I have meditated many times on Luke 24:39, then when I read the word Jesus “disappeared” from the site I couldn’t understand how a solid body able to disappear from the site or able to enter from the solid walls and locked door.I think like angles Jesus spiritual body also managed to gain material features when essential. This transformation body status is the most difficult thing to understand.","date":"December 3, 2015 at 3:50 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"author":"sampath_fernando","post":"Mr. Carney “It is also common Christian understanding that after our lives on earth, the resurrected body that we will eventually have will be physical but have far more capabilities (and permanence) than the sin-laden one we have here”.Jesus never mention anything like this and from where this thought originated?Mr. Carney I also believe in Multiverse. Spiritual Universe and Material Universe have a common area. (intersection of set theory). That is why Guardian angles can take material bodies when they want.Sorry this is only a logical question. If Jesus died for our sins then why did he resurrect with same body? If he resurrected from the same body then purpose dying for our sins is lost.","date":"December 4, 2015 at 2:58 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"author":"sampath_fernando","post":"We engineers are trained to deal with forces. I think no one has ever seen a crucifixion. May be Jesus on the standing position initially but when time goes on he had to be on the hanging position. His legs couldn’t take the weight of his body after loosing blood That is why they nailed Jesus from wrists rather than from the palm.","date":"December 1, 2015 at 3:40 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"}],"textile":[{"author":"sampath_fernando","post":"Banding can’t tell you that whether Shroud was repaied or not. If you follow the same weave pattern in the repaired area then you get the same banding pattern from that area.","date":"October 28, 2015 at 4:16 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"}]}
