{"art":[{"id":"comment-21619","author":"sandra","post":"What a great stories i read here. So happy to found this site. I also had a amazing experience. I was always a athiest but when i was 19 years old (I am now 26) I started to believe that there is a God but I was not sure if it is a personal god. The bible i didn’t believe in and also Jesus was for me a fake figure that people have made up. Just could not believe how that can be true. Then a few weeks ago I had a dream. I saw a man walking on the street with a few other men around him. I reconised him into what people would call: Jesus. He was all in white and over his left shoulder was a red piece of cloth hanging (sorry for the bad english its not my mother language and so its not easy to explain). He turned around and saw me and he was so intens happy to see me. (never saw anyone so happy to see me) I stand still and look at him and are very surpriced that he is so happy to see me. Because why me? Nothing special about me but his face made me feel like i am the most imporant person in the world. He had so much love in his eyes and he opened his arms for me to give me a hug and I asked him in my thoughts: But if i see you where is God then? God has to be then here also or not? And he spoke to me also telepathic and said: But I am also God! And i said: no way! you are Jesus i know stories about you You are Jesus and not God. And he said: But God Is through me! I am THE WAY. If you see me, you see God. And at the same time i feel that all things i ever did wrong in my life didnt mather anymore. All was forgiven. I was not busy with that in my daily life but in my dream it was very important for me to know that he forgave me all my mistakes. There was no need to even mention my mistakes anymore it was all good. And he keep looking at me with so much love. I wanted to walk to him but I was thinking that i might then not more wake up and I didnt know what to do. I looked at my feed and they were heavy standing on the ground. When I wanted to look up again I woke up. When i woke up i was so happy and this dream has changed my life forgood. I started to search on google pictures about Jesus that would come close with how i have seen him because did not wanted to forget how he looked. I wanted to have something so I can remember his face. Then i saw the painting of Akiane and I was in shock. That was the man i saw! Only his hair was a little bit differend but that was the man! a few weeks later I also saw the pictures of the shroud of turin (i did before not even knew that there was anything like the shroud of turin) and all felt on its place. Now my life and me as a person is totaly changed. I devoted my life to Jesus. I have alot emptahy for other people (before that I could not feel empathy for people) and are every day busy with doing the right thing. My life is in total peace and I even bought the bible and read in it and my questions are answered one by one. I’m also very interessted in sciense and I read now alot books and whatch alot documentaries about our universe from scientists who also believe in a Intelligent Design. Life is good and I’m very blessed to have had this dream and I hope everyone will get a visit from our great and loving Lord! Much Love to you all, Sandra.","date":"2013-01-04","mins":"12:50 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
