{"dating":[{"id":"comment-3123","author":"sciphile","post":"Thank you for your kind words and criticism. I would say however, that although these kinds of discussions may seem like “preaching to the choir” for those of us who are involved in science and skepticism, I think that a site that promotes science and skepticism towards the general public is valuable. Keep in mind, most of this is unknown or uninteresting to the laity..","date":"2011-05-12","mins":"11:26 pm","url":"https://shroudstory.com/2011/05/12/kcs-life-based-science-and-the-shroud-of-turin/","cat":"carbon_14_dating","title":"KC’s Science-Based Life and the Shroud of Turin"},{"id":"comment-3098","author":"sciphile","post":"I hope that you will bear with me concerning a response to this post. I am a busy student, and graduating in the next week. I greatly appreciate your praise and interest in my blog, the response to this post will be forthcoming. It will come as no surprise to you that I am going to take issue with your assertion that the shroud is authentic; it should be fun. Sincerely, K.C. Sciencebasedlife.wordpress.com.","date":"2011-05-09","mins":"2:52 pm","url":"https://shroudstory.com/2011/05/09/kyle-c-hill-and-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Kyle C. Hill and the Shroud of Turin"},{"id":"comment-3146","author":"sciphile","post":"I have posted my response on Science Based Life. Http://wp.me/p13ype Ks.","date":"2011-05-16","mins":"2:01 pm","url":"https://shroudstory.com/2011/05/09/kyle-c-hill-and-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Kyle C. Hill and the Shroud of Turin"}],"opinion":[{"id":"comment-3155","author":"sciphile","post":"If you read my post I did not call anyone a fake, and I think that the reader who posted here, as well as the above commenter, has gotten confused with what I mean by skepticism. First, the reader is making a mistake. Dan Porter, the author of this blog, explicitly states that since there is not conclusive evidence, that “a leap of faith over unanswered questions is essential.” So yes, even though Dan does not have evidence of authenticity either way, he asserts that it is authentic. And I think that this is a non skeptical assertion from a foundation of Christian belief. This is why I have replied in the manner in which I did on my blog, where I argue for a natural, non authentic, conclusion. I still would like to know what your (reader and Dan) thoughts would be on the shroud if you were not Christians. Secondly, Joe Marino says: “So the basis for determining if Dan is a skeptic of the Shroud or not is NOT anything to do with examining the data but K.C.’s educated opinion? Gosh, what a great system!” Thanks for considering my opinion educated, but the sarcasm is palpable and unneeded. Further, Dan is not a skeptic of the shroud. He said that he once was, and that he since has made a (presumably) faith based conclusion about its authenticity. This is not my opinion, Dan says so right in the “About the Author” tab. Also, what is all this “data”? From what I have read, and what Dan has stated as well, there is not enough evidence to make a determination either way (and this is why I advocate skepticism). There is no positive, conclusive, “smoking gun”. It is more reasonable then, I think, to remain skeptical, and not make faith based assumptions. So no, Dan is not a skeptic of the shroud because there is not enough evidence to not be a skeptic, and he has stated that he is not a skeptic outright. This was not my opinion..","date":"2011-05-17","mins":"1:49 pm","url":"https://shroudstory.com/2011/05/17/you-said-that-you-too-were-once-a-skeptic-of-the-shroud-and-i-dont-think-that-i-truly-believe-you/","cat":"other_blogs","title":"You said that you too were once a skeptic of the shroud, and I don’t think that I truly believe you . . ."}]}
