{"blood":[{"author":"sheila","post":"Thanks for posting that link, Dan!  It’s not often I get to read those sorts of papers.","date":"August 27, 2012 at 6:07 pm","url":"https://shroudstory.com/2012/08/26/standing-ovations-all-around/","cat":"blood_studies","title":"Standing Ovations All Around"}],"dating":[{"author":"sheila","post":"Not to mention that there are 2.1 Billion people worldwide who still believe 2000 years later.  The very small minority that abstain are just that.  It’s that they speak louder than we do.  We don’t go after them but they’re on a mission to come after us wherever we happen to be.  As Frank Turek says, “I don’t have enough faith to be an atheist.”That fellow, Thomas, is confused between scientific evidence which has been continuous since the STRP Team went in, and the writings in the Bible.  None of the Scientists’ evidence becomes proof of the Bible.  It’s purely scientific–nothing to do with religion.  That is until you realize the implication of the Shroud.  Scientists do not know how it was imprinted.  They do know it was not painted.  They do know it portrays a man crucified according to the Roman penchant for torture.  Therefore when faced with the “evidence” one must make a decision.  Either believe the science or don’t.  You can’t have it both ways guys!","date":"June 28, 2012 at 9:10 am","url":"https://shroudstory.com/2012/06/19/who-is-evolving-into-stupid/","cat":"carbon_14_dating","title":"Who is Evolving Into Stupid?"}],"art":[{"author":"sheila","post":"I loved the book, it  was very refreshing.  Children know what they see and hear.  How isTodd doing now?  Will you write another book?   I loved reading the Book.","date":"April 24, 2013 at 2:16 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}],"events":[{"author":"sheila","post":"Sorry for you, Andy, but I’m saying “Yahoo! (not that one) and Yippy!  Finally something within reach of where I live.  (South Carolina) That’s super!  Thanks Dan for posting this news.  You’re a real champion!","date":"September 10, 2012 at 10:46 am","url":"https://shroudstory.com/2012/09/09/russ-breault-to-speak-at-first-baptist-church-of-matthews/","cat":"event","title":"Russ Breault to Speak at First Baptist Church of Matthews"},{"author":"sheila","post":"Tickets are only 7.50!  They’re not making money on it, just covering the costs of getting Russ Breault to the church.  No advance ticket sales to put on credit card or such, so just get there if you’re close by!  It’s a two-hour presentation, btw.  You can talk to David Witz by calling the number for the church.I’m so happy, I have the giggles!","date":"September 10, 2012 at 11:34 am","url":"https://shroudstory.com/2012/09/09/russ-breault-to-speak-at-first-baptist-church-of-matthews/","cat":"event","title":"Russ Breault to Speak at First Baptist Church of Matthews"}],"history":[{"author":"sheila","post":"Amen to our risen Savior and Lord!  Personally, I’m looking forward to the day He puts down all earthly authority and commences a’reignin’!   ;)","date":"April 22, 2014 at 1:12 am","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!"},{"author":"sheila","post":"I’m new to the conversation so go easy on me please.  Can you elaborate for me what you mean by the “negative imprint of three fingers…on back foot image?”  The first thing I thought was that an angel had untied the Lord from the burial cloth!  No kidding!","date":"June 29, 2012 at 10:27 am","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"author":"sheila","post":"Hi Fellows,Let’s not forget that the forger gathered pollen from a good many of the plants blooming in Spring in and around Jerusalem.  He then sprinkled the pollen on the cloth at various points making certain to put a little extra where the crown of thorns was on the head.  Not only that, but he dabbed a smattering of limestone near the crucified man’s feet that is only present in Jerusalem.  I’VE GOT IT, I’VE GOT IT, I’VE GOT IT!!  The forger was a time-traveler who came from our future and went back to our past just to mess with us!!  I say that because of the pollen.  How did he know?","date":"November 9, 2012 at 10:29 pm","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","title":"The Central Dilemma of the Shroud?"}],"image":[{"author":"sheila","post":"So, he’s thrown down the gauntlet and now the plot thickens…will Dawkins ever get the money?  I guess we’ll have to stay tuned…:)  I’m enjoying your site by the way.","date":"June 29, 2012 at 10:09 am","url":"https://shroudstory.com/2012/06/29/three-months-today-the-dawkins-challenge/","cat":"image_theory","title":"Three Months Today: The Dawkins Challenge"}],"misc":[{"author":"sheila","post":"TouchéI’m sorry Daveb, but science and religion have never been the enemies you think.  Much as people like to repeat it, for the most part, it’s just not true.  You do have your “young earth” proponents but it matters not to the faithful when “God created…”  He inhabits eternity–what’s a few million years?  Can you wrap your mind around that?Blessings!Dan,Your answer was very kindly fielded and made me laugh!  And thanks to you, I’m headed to Charlotte next weekend with some others!  Thanks again!","date":"September 22, 2012 at 11:13 am","url":"https://shroudstory.com/2012/09/20/mount-everest-is-only-29000-feet-high/","cat":"news_&_views","title":"Mount Everest is only 29,000 feet high"},{"author":"sheila","post":"Daveb,My apologies to you!  I suppose I misunderstood your generalization of “creationists.”  Sorry ’bout that.","date":"September 23, 2012 at 10:41 am","url":"https://shroudstory.com/2012/09/20/mount-everest-is-only-29000-feet-high/","cat":"news_&_views","title":"Mount Everest is only 29,000 feet high"},{"author":"sheila","post":"That is really way too good!  Excellent.","date":"June 29, 2012 at 10:33 am","url":"https://shroudstory.com/2012/06/27/the-poetic-skepticism-of-russell-blackford/","cat":"news_&_views","title":"The Poetic Skepticism of Russell Blackford"}],"researchers":[{"author":"sheila","post":":'(","date":"April 7, 2014 at 12:08 pm","url":"https://shroudstory.com/2014/04/06/more-on-the-y-from-stephen-jones/","cat":"news_&_views","title":"More on the Y from Stephen Jones"}]}
