{"dating":[{"author":"sheona","post":"Le pauvre peit vieux qui n’a pas de diplômes dont il veut nous parler ,mais qui prétend avoir droit au titre de “professor” après deux ans passés à participer “à la création du Centre for European Languages and Translation – CELT … et à la création de la section française de la bibliothèque de la Faculté des Lettres de Ryad”  ou plutôt à l’Ecole Normale là-bas, entre 1976 et 1978.  Mais ce n’est pas croyable. Et depuis qu’est-ce qui s’est passé?  Des diplômes,  des thèses doctorales,  des livres et des articles publiés, des universités qui se bousculent pour lui offrir des emplois comme cela se ferait s’il était vraiment un “professor”?  Entre 1978 et 2005 il paraît qu’il y a ce que Goethe appelerait “die grosse Lücke” dans la carrière académique de Monsieur Hamon.  \nMonsieur Hamon, tout le monde a le droit de se nommer comme il veut, mais personne n’a le droit de s’attendre à ce que les autres le croient, faute de preuves.  “Mais puisque je le dis …”, cela ne marche pas.\n\n","date":"June 24, 2013 at 5:38 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"author":"sheona","post":"No one is spitting on you, you silly little man.  You can call yourself Winnie the Pooh (Winnie l’Ourson)  for all I care but should not expect people to take you seriously.  The title of teacher to which you cling so desperately was no longer applicable after 1978.  As you say, at that time you had your whole life ahead of you. What happened?  No publications, no qualifications you admit to, no Palmes Académiques after a successful career. Just a self-taught archeocryptomedievalpsychphysiotherapist, with metal detector.\nBTW, don’t tell me about my French since I know precisely how good it is. I’ve got a degree, you see.\n\n","date":"June 25, 2013 at 5:32 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"}],"forgery":[{"author":"sheona","post":"How about BRAINWASHING? Of course that presupposes the existence of a brain.\n","date":"November 27, 2016 at 11:07 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/09/18/the-turin-shroud-surely-the-most-cunning-dastardly-con-trick-in-history-14th-century-france/","cat":"turin_shroud","title":"The Turin Shroud – surely the most cunning, dastardly con trick in history (14th century France)"}],"image":[{"author":"sheona","post":"Good grief. What does one have to do to make some folk here see the difference between a contact imprint and a free-hand painting? Making an imprint may take skill, but if taken from a real human being, as distinct from bronze bas relief etc, then it is NEVER a work of art. It is what the name implies – simply an imprint- with the properties of an imprint (correctly spaced ventral v dorsal surfaces, negative character, 3D properties etc). It’s the difference between a sand sculpture and a footprint in the sand…\nIt is exceedingly tiresome to have Charles Freeman continuing to drone on about a “painting” when it’s so abundantly obvious – or should be – that the TS is an IMPRINT, and consequently NOT a work of art, at least where the body image is concerned. Blood additions are a different matter. They may well be considered “artistic”.\n\n","date":"September 10, 2015 at 2:33 pm","url":"https://shroudstory.com/2015/09/03/colin-berrys-latest-and-greatest-is-it-enough/","cat":"3d","title":"Colin Berry’s Latest and Greatest. Is it Enough?"},{"author":"sheona","post":"Sorry to read you are no longer posting. I don’t say much, but I enjoy reading.\n","date":"February 19, 2017 at 10:22 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/01/04/testing-my-flour-imprint-hypothesis-might-those-be-solid-gluten-flecks-one-sees-on-the-shroud-scope-body-image/","cat":"medieval_hoax","title":"Might those be flecks of congealed wheat gluten one sees on the Turin Shroud? Evidence for unique one-off white flour imprinting?"},{"author":"sheona","post":"Oh Colin, if you seriously expect any comments, let alone an intelligent or relevant one, from characters like those who turned up at Pasco, you are deluded. They just sat there listening to the same old stuff over again. They can’t cope with anything new or outside their blinkered vision.\n","date":"October 18, 2017 at 12:46 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc)."}],"researchers":[{"author":"sheona","post":"You’ve been quiet for quite a long time, Colin. I do hope you’re not saving up anything worthwhile for this conference in the oversized garden shed in Pasco. Why do you suppose such an out of the way place was chosen? Is it so that just one Canuck setting foot across the border would make it “international”? Or are the organisers hoping that the vast amount of radioactive waste at Hanford might add some spark to what will otherwise be the usual stale repetition of dodgy “facts”.\n","date":"June 4, 2017 at 11:08 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/04/07/sturp-space-age-technology-unleashing-religious-propaganda/","cat":"turin_shroud","title":"STURP: Space-age Technology Unleashing Religious Propaganda!"}]}
