{"art":[{"author":"shroudenigma","post":"In short, yes.  It was also quite a shock to see how much more subtle the image is to the eye in natural light.  The nature of any image reproduction process tends to accentuate the inherent contrast of the image.  When copies of the Shroud are reproduced there is an even greater tendency to accentuate contrast to enable the viewer to perceive the image easily.  All ordinary computer screens vary in their contrast so I cannot predict what may actually be seen on any individual screen but I have tried to recreate an image that can be downloaded here: http://we.tl/YG9iVXHwyD that more faithfully shows the actual colours.  The background cloth is almost ivory and the image, even for someone as used to seeing its photographs as I am, is barely perceptible and –  close up – is almost impossible to decipher. However, as we well know, once “unlocked” by photography, so much more depth and contour becomes readily seen.My other main thought about the image in line with its “perfection” is its nakedness.  As such it is devoid of any single thing that would betray an attribute that might identify the body with a specific culture or, indeed, faith. It is “Everyman”","date":"August 25, 2013 at 10:14 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem"},{"author":"shroudenigma","post":"Thanks, Anon.  The advice from Christian Newswire was to delay sending until tomorrow because of the holiday.  And that’s the plan.  Fingers crossed.David","date":"September 2, 2013 at 7:32 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"author":"shroudenigma","post":"While the issue of authenticity is such a dead duck as far as the general public is concerned, with respect, the minutiae of this debate, is a side show. In referring to Ian Wilson’s theory, Dr. Williams was simply affirming that a case for one particular provenance can be made.  I am sure he does not do so at the exclusion of others.  They simply have not been made in any detail in his hearing and they are unlikely to be while the C14 shadow excludes illumination.  He finds the general arguments for the Shroud persuasive and the C14 less than perfect in its application. Therefore, a potential injustice may have been done.  That’s why he has come out on the subject the way he has. The question of the Shroud does not hang on Edessa.  I personally find it persuasive but I am prepared to take into account the work of Max Frei. Having trekked round the Middle East and Anatolia with him on two trips totaling four weeks I got to know him well and give credence to his identification of Anatolian pollens. His methodology for removing such samples from the linen cloth was much too rough for STURP and that may explain why their own delicate application of the tape failed to pull out what would have been very deeply embedded.  Debates as this are likely to remain the equivalent of “Angel Dancing” until the Vatican allows a properly structured re-examination. That is what my own campaign of The Shroud Affair is hoping to bring about.  Despite the endorsement of the man who puts the case for the re-examination to the Vatican, Dr. Bruno Barberis in Turin, and now the former world-wide head of the Anglican Church, less than .05% of what one might call “shroudies” can be bothered to raise at least  a $10 finger of support. Thank you.","date":"September 4, 2013 at 5:37 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"author":"shroudenigma","post":"David, your comments are accurate as far as a screenwriter is concerned. My hope is that as I am primarily a producer, once armed with some independent financial backing, I can navigate through to a successful conclusion. I did it with The Silent Witness all the way to a worldwide theatrical release.   It was made possible by some initial funding secured from the heir to the Millers beer empire and that was negotiated by the wonderful Salesian priest and Shroud scholar the late Fr. Peter Rinaldi of the Holy Shroud Guild of America.  Some of the films profits seeded STURP. Approximately 8% of those who view the campaign video become contributors. The average contribution is: $91. On that basis I need to get just under 2,500 more to watch the video to reach the initial target. (Assuming they come from a sympathetic audience segment.  Either active Christians or others interested in the Shroud for its own sake). I am about to move the debate into the Twittersphere. It’s not something I am fully up to speed with but theoretically it looks encouraging. My initial group of Shroud Affair followers (22)  have well over 100,000 potentially sympathetic  followers between them. If they retweet the message I send them only 2% need to respond. As I am recruiting followers daily these figures should improve.You can tell that, as a producer, I am fundamentally an optimist.","date":"September 6, 2013 at 6:24 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"author":"shroudenigma","post":"That may be. The fact remains that the British Museum put out a call world wide for one and answer came there none. At the very least, it is extremely rare and hence the significance.","date":"September 9, 2013 at 8:53 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"}],"blood":[{"author":"shroudenigma","post":"I don’t see how over-painting the blood stains would have any impact on the initial stain and its prior appearance on the cloth to the body image.","date":"April 8, 2013 at 1:56 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"author":"shroudenigma","post":"So, you accept that it would make no difference to the prior appearance. Thank you.","date":"April 8, 2013 at 4:01 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"}],"events":[{"author":"shroudenigma","post":"The venue is  just two minutes walk from Beaconsfield Station on the Chiltern Line.  By road, just follow the signs on the M40 to the Model Village which is in the same road. Please let me know if you are attending to ensure adequate refreshments etc.","date":"September 27, 2012 at 9:44 am","url":"https://shroudstory.com/2012/09/27/update-on-the-upcoming-meeting-of-the-british-society-for-the-turin-shroud/","cat":"event","title":"Update on the upcoming meeting of the British Society for the Turin Shroud"}],"image":[{"author":"shroudenigma","post":"Well, I’m not sure about the rats and cockroaches, but I welcome this positive turn of events and thoughts and I’m sure Denis will, too.Thinking outside the box is always going to be the key to solving the riddle of the Shroud’s image.","date":"September 28, 2012 at 6:32 am","url":"https://shroudstory.com/2012/09/28/a-touch-of-miracle-plus-a-maillard-reaction/","cat":"image_theory","title":"A Touch of Miracle Plus A Maillard Reaction"},{"author":"shroudenigma","post":"I hope someone will be forthcoming with a critique, additions, suggestions…indeed anything that will aid Denis Mannix in formulating a methodology to test the Maillard theory in principle. With respect to Yannick, it cannot be necessary to have a crucified body to do this.  To enable skeptics like myself to give the idea some credibility all I ask is for an image with a small degree of resolution no bigger than a little finger.","date":"September 27, 2012 at 9:54 am","url":"https://shroudstory.com/2012/09/20/agenda-driven-shroud-science-what-a-pity/","cat":"image_theory","title":"Agenda Driven Shroud Science?  What a pity."},{"author":"shroudenigma","post":"I welcome the analogy and the comment. Dan is right, it was Goliath who issued the challenge, but Dawkins has and continues to challenge every thinking deist. I have a hunch that, in the long term, the Shroud may well be the stone that topples him. With the momentum gathering for this challenge, we shall see. The timing of the conference in Valencia, attended by representatives from Turin, could not be better. Another very auspicious event has been the publication of Thomas de Wessellow’s new book, The Sign, which I am still working through. De Wesselow’s qualifications as an art historian are impeccable. His conviction that the Shroud cannot be mediaeval is forceful. (Not much of a surprise to sindonologists, of course, but impressive to the secular world). It would appear his tome rests on the Maillard reaction. As a foundation, quicksand is probably better. David","date":"April 20, 2012 at 8:22 am","url":"https://shroudstory.com/2012/04/20/david-and-richard-goliath-dawkins/","cat":"image_theory","title":"David and Richard Goliath Dawkins"},{"author":"shroudenigma","post":"As I understand it, Roger’s Maillard-based theory involves creating the equivalent of an emulsion layer on the surface of the fibers.  This layer reacts with the ammonia-based products associated with the process of putrefaction and discolors to produce an image. It is an interesting and indeed ingenious theoretical construct in many ways.  One of its attractions is that it can be seen as an entirely natural process without recourse to more esoteric explanations. Indeed, from my own discussions with Ray Rogers, it is clear that he set out to find some kind of theory for image formation that was a natural process to counteract the claims for the “miraculous” that he felt had tarnished the reputation of STURP.  He succeeded in finding a theory. However, as anyone who has any technical experience of creating images will quickly testify, the possibility that the process could account for an image of the size, complexity and, above all, homogeneity of the Shroud image is zero.  I would gladly raise that numerical estimate if anyone, anywhere can cite a meaningful image of anything created by a Maillard reaction.","date":"July 11, 2012 at 6:21 am","url":"https://shroudstory.com/2012/07/11/rejecting-all-the-energetic-hypothesis-for-the-shroud-of-turin-image/","cat":"image_theory","title":"Rejecting all the “energetic” hypothesis for the Shroud of Turin image"},{"author":"shroudenigma","post":"Nothing I say should suggests anything but the deepest respect for Ray Rogers. Neither does it follow that my criticism of the Maillard hypotheses indicates favoring any other particular image formation theory.  The fact is that nowhere in history or indeed today can anyone point to any kind of image produced by a Maillard reaction. If its supporters deem it possible to create a 14ft evenly graduated image of both sides of a corpse then they should be able to show, say, a 6 inch version of anything.  Until they can, I suggest that time spent theorizing and eulogizing would be better spent making one.","date":"July 12, 2012 at 4:41 am","url":"https://shroudstory.com/2012/07/11/rejecting-all-the-energetic-hypothesis-for-the-shroud-of-turin-image/","cat":"image_theory","title":"Rejecting all the “energetic” hypothesis for the Shroud of Turin image"},{"author":"shroudenigma","post":"I was only addressing the issue of the creation of a negative image in medieval times. It is a fallacy that such a thing was impossible. However, the myriad characteristics of the Shroud image defy understanding as a medieval – or modern- creation.","date":"January 15, 2015 at 7:23 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"author":"shroudenigma","post":"Colin, what’s driving the comment is an open-minded critical approach to the subject over a forty year period. You will always be a johnny-come-lately but you could at least try the open-minded and critical approach.","date":"January 15, 2015 at 8:03 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"author":"shroudenigma","post":"From memory, and given that the the backing card was ivory, the tonal quality of the image was very similar to the Shroud.  The only factor was the inverse bleaching by the sun.","date":"January 15, 2015 at 9:41 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"author":"shroudenigma","post":"Here’s a suggestion: Among the many readers of this blog and their friends, somewhere there must be an engraving that has hung for a long time in a fairly well-lit space.  Could they examine the backing? We may find another example of a naturally produced perfect negative.","date":"January 15, 2015 at 9:44 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"author":"shroudenigma","post":"Paolo Di Lazarro has drawn attention elsewhere to this quote which seems very relevant.“Naturally there can be no contradiction of clear scientific data. The Resurrection accounts certainly speak of something outside our world of experience. They speak of something new, something unprecedented — a new dimension of reality that is revealed. What already exists is not called into question. Rather we are told that there is a further dimension, beyond what was previously known. Does that contradict science? Can there really only ever be what there has always been? Can there not be something unexpected, something unimaginable, something new? If there really is a God, is he not able to create a new dimension of human existence, a new dimension of reality altogether? Is not creation actually waiting for this last and highest ―evolutionary leap, for the union of the finite with the infinite, for the union of man and God, for the conquest of death?J. RATZINGER: Jesus of Nazareth: Holy Week: From the Entrance into Jerusalem to the Resurrection, Ignatius, San Francisco 2011, translated by Philip J. Whitmore from the original German Jesus von Nazareth: Zweiter Teil: Vom Einzug in Jerusalem bis zur Auferstehung, Libreria Editrice Vaticana, Vatican City 2011, pp. 246-7.This opens the debate to the issue of the Resurrection, obviously, but so, too, to other possibilities. The speculations of Dr. Andrew Silverman and “New Physics” is a good example. http://www.lightoftheshroud.com/Presentations.htmlYannick, have you given any consideration to how Ray Rogers might have accounted for the homogeneity of the image?  The theory might account for a few square inches. Perhaps even, say, the area of the face.  But to assume that the impurity layer and the transfer mechanism was homogenous over 14ft x 4ft and (probably) acting over parallel planes is stretching credulity further than any alternative.  You paint a picture of a scientist proceeding without any motivation other than to reach a conclusion based only on the available evidence. All scientists in my experience claim this. In practice, they, at best, can impose the strictest self-discipline on themselves to minimize bias.  Ray was “furious” (his word) that STURP was “hi-jacked” and came to be dominated by Jackson’s (in his view “unscientific”) collapse theory.  His avowed motivation was to produce an alternative “rational” explanation.  He was fighting a highly charged “war” with a rival.  Chemistry against physics,  and science versus (his view) pseudo science.  That is a very different reality.","date":"September 4, 2013 at 7:19 am","url":"https://shroudstory.com/2013/09/04/thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","title":"Thoughts on the newly published paper by Ray Rogers (REVISED)"},{"author":"shroudenigma","post":"My background is in photography. My first job was to photograph 10″ steel plates that had been coated with the latest battleship grey and then subjected to the equivalent of 10 years at sea. My (5×5) plates had to capture every nuance and minute crack that may have been present. The development process required mechanical agitation to ensure that it matched the precision of the photography. Even then, it was difficult to ensure an even graduation over that small size.  The Shroud confronts us with a 14ft cloth with an image (not a photograph, admittedly, at least not in any normal sense) that has an entirely even graduation over the entire length.  When you consider this in the light of all its other attributes, and, bearing in mind, if it is authentic, then you might expect something “miraculous” or, at least, mystifying, any open minded person would, at least, give that possibility a fair hearing. You seem hell-bent on ignoring the wood and only focussing on the trees. It’s the big picture, in every sense, that is key to understanding this mysterious cloth. Step back a bit. The view is always better. When you can, I would be delighted to continue this discourse.","date":"August 24, 2016 at 11:41 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?"},{"author":"shroudenigma","post":"Hello ColinYou must not be too downhearted about a lack of comment. Now that Dan Porter has hung up his mouse there is no one to whistle up much of a controversy.  The other thing to bear in mind is that, as far as 99.99% of the population is concerned, what you are attempting to prove they already believe. i.e. the Shroud is some kind of clever fake. And, frankly, while that remains the case they are not that interested in the details.What would get some attention is how you might explain how the medieval forger used something like invisible ink to create the image he did and bestow it with so many other features that give the semblance of authenticity. I have taken the liberty of setting out my description of them below:A letter of congratulation to the medieval forger who created The Shroud of TurinYour choice of an image left on a Shroud is a perfect encapsulation of the mystery that surrounds him. After all, it is the reporting of his death by crucifixion that is the principal independent corroboration that Jesus lived at all.  Congratulations.Here lies a man that died in the most vile and cruel way yet devised by mankind.  The awful details reveal it was what we now know to be a Roman crucifixion.  This is uncanny because when you were commissioned you had no knowledge of these details.  Congratulations. Your depiction makes real the one description we have of the man’s death in that it bears the minute forensic details that makes sense of what is written. Congratulations.You have echoed the bare facts we have about the man’s life by making it ethereal but perceptible enough for it to be recognised for what it is by crowds at a distance on a glaring hot day when thousands flock to see it held aloft in the open air. Congratulations.  By restricting yourself to a monotone you have emphasised the singularity involved in the event of this man’s life and death. Indeed, the image is its own singularity as it has no comparison or equal. Congratulations.This tone, so sparsely applied, has, centuries after your work was completed, yielded to the new science of photography an image of even greater perceptibility just when the world had almost forgotten it. Congratulations. You have maintained such evenness of hand of the single tone along its entire length and breadth that stellar science has been able to translate your pains into a homogenous lifelike three-dimensional representation of the man in death.  Congratulations. Somehow, although making sense as a two dimensional depiction, you have applied the blood and arranged the position of the limbs to enable it to make sense when wrapped around a corpse even to the soles of the feet. Congratulations.By applying the blood first and leaving no image beneath you have confounded further anyone who might seek to imitate you. Congratulations.You have been faithful by depicting him unmistakably in the likeness as the Jew he was. Congratulations.Your canvas has been a linen cloth of dimensions used at the time and woven on a loom that worked under the laws that governed the man’s world.  Congratulations. The cloth is nothing like the rough linen grave clothes discovered in the excavated tombs in the hills of Jerusalem. Its quality matches the esteem in which those who followed held the man it must have wrapped.  Congratulations. Despite our preference you have been brave enough to leave him naked and kept him devoid of any artefact that would allow one group above another to claim him for themselves.  Yet, you have kept his dignity and repose. Congratulations. Indeed you have excelled even this. This savagely tortured man in death is at peace with himself and with us. Indeed, he appears, somehow, to have transcended his fate and cheated death.  Congratulations.","date":"August 22, 2016 at 4:20 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?"}],"misc":[{"author":"shroudenigma","post":"If the image purported to be a pharaoh or any other character from history, academics and scientists would have not slept until they had answered every question and written every thesis about it to satisfy their curiosity and further their careers.  But this man?  What are they afraid of?","date":"September 15, 2013 at 9:13 am","url":"https://shroudstory.com/2013/09/15/more-scientific-research-on-the-shroud-of-turin-why/","cat":"uncategorized","title":"More scientific research on the Shroud of Turin? Why?"},{"author":"shroudenigma","post":"I’m pleased you agree that a film could be a catalyst. This campaign now enters its final and crucial week. http://www.indiegogo.com/projects/the-shroud-affair/x/3953890","date":"September 16, 2013 at 6:21 am","url":"https://shroudstory.com/2013/09/15/more-scientific-research-on-the-shroud-of-turin-why/","cat":"uncategorized","title":"More scientific research on the Shroud of Turin? Why?"}],"researchers":[{"author":"shroudenigma","post":"Paulette, thanks for this observation.  My language is somewhat clumsy.  It was a positing about the Shroud on Dawkins blog that I was referring to my “your Shroud blog” might be a little too pithy.  Sorry for the confusion but hope that would not diminish the challenge itself. Prof Giulio Fanti had already “stepped up to the plate” with his publication and readily accepted the challenge when I put it to him.   So far, Dawkins has not.  If you go to the page now you will see that the Challenge is on hold pending the outcome of these open discussions from as many qualified interested parties as possible.  Professor Fanti has kindly accepted this process and the forthcoming Valencia conference has agreed to provide a forum for the conclusion of the criteria consolidation process.    Once this has happened I hope you and as many other visitors to this blog will apply whatever pressure they can on the Dawkins and his foundation to accept.  Ron’s K.I.S.S. approach could well makes a lot of sense.","date":"April 19, 2012 at 5:43 am","url":"https://shroudstory.com/2012/04/18/an-email-from-david-rolfe-to-the-shroud-science-group/","cat":"news_&_views","title":"An Email from David Rolfe to the Shroud Science Group"},{"author":"shroudenigma","post":"In answer to Yannick’s request I am happy to declare what I believe.  The Shroud image is a  mystery in much the same way the Big Bang is. Science is, as yet, unable to give us an answer to both. I do know the universe was not made in six days and I do know the Shroud is not a painting or, for that matter, the result of a series of random effusions. Sorry Yannick, but a theory that can account for a smudge cannot be extrapolated indefinitely to explain the Shroud image. It’s homogeneity over distance and on opposing plains puts that beyond reason.  It is perfectly scientific to say “I have no idea”.  That is what makes studying the Shroud so interesting.","date":"January 3, 2013 at 8:45 pm","url":"https://shroudstory.com/2013/01/02/david-rolfe-some-hip-dude-in-england/","cat":"other_blogs","title":"David Rolfe, some hip dude in England"},{"author":"shroudenigma","post":"Yannick, can I suggest that, for the sake of brevity, in future, you could encapsulate the above as ‘The Smudge Theory’.    It seems to be a good pithy description.Yours, David ‘cool dude’ Rolfe.","date":"January 2, 2013 at 8:38 pm","url":"https://shroudstory.com/2013/01/02/david-rolfe-some-hip-dude-in-england/","cat":"other_blogs","title":"David Rolfe, some hip dude in England"},{"author":"shroudenigma","post":"Dan, in our conversation on SSG I said the following in relation to the possibility that the List, as drawn, might inadvertently have excluded Rogers’ hypothesis :“Should this point remain unclear despite the scientific reality and it remains a stumbling block to unanimity, I would be prepared to go back to the original signatories to seek any necessary re-wording as required.  There was definitely no intention to exclude any of the major contending image formation theories from consideration.” Dan, you rejected this offer.  Why seek confrontation when conciliation and cooperation is on offer?","date":"May 11, 2012 at 5:27 am","url":"https://shroudstory.com/2012/05/11/sentence-one-in-the-richard-dawkins-challenge-is-wrong-period/","cat":"challenge","title":"Sentence One in the Richard Dawkins Challenge is Wrong. Period."}]}
