{"blood":[{"author":"shroud_encounter","post":"The news piece also says he will show how the image is not really on the cloth.  I am hoping he is only referring to the superficiality of the image.","date":"April 18, 2012 at 10:05 am","url":"https://shroudstory.com/2012/04/18/did-he-say-blood-underneath-the-hands-or-was-he-misquoted/","cat":"news_&_views","title":"Did he say blood underneath the hands?  Or was he misquoted?"}],"art":[{"author":"shroud_encounter","post":"I thought you might get a kick out of being in my dream!","date":"April 28, 2015 at 3:08 pm","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","title":"Having Nightmares"}],"dating":[{"author":"shroud_encounter","post":"I personally don’t think the Shroud will ever be carbon dated again. I am not even sure any new testing at all will ever be done.  I don’t see that there is a will to undertake all the logisitics necessary to make it acceptable to all parties.  The position of the Church, calling it a “symbol of Christ’s sufferings worthy of veneration” gets them off the hook.  Who can argue with word, “symbol”?  It is a smart position for them to take…not calling it a relic or an icon.  That position however allows them to be perfectly comfortable with the ambiguity regarding the carbon date or any other unanswered questions of science.","date":"April 29, 2012 at 9:13 am","url":"https://shroudstory.com/2012/04/29/carbon-dating-the-shroud-of-turin-again/","cat":"carbon_14_dating","title":"Carbon Dating the Shroud of Turin Again?"},{"author":"shroud_encounter","post":"Here is where the materialists like Dawkins, Hawking and Krauss get it wrong. They fail to understand that theology is a continuum of science…it picks up where science leave off. For instance, Hebrews 11:3 says, ” By faith we understand that the universe was formed at God’s command, so that what is seen was not made out of what was visible.”  That is a big clue: “WHAT IS SEEN WAS NOT MADE OUT OF WHAT WAS VISIBLE.” But if all you are looking for is what is visible, you will totally miss it.  I don’t know where the realm of the spirit is, it is probably parallel to our own physical world. Yet the scripture tells us that the spirit is eternal and the physical world is temporal.  Ironically, the atheists of our day are consumed with what is temporary while denying that which is eternal.  Scripture declares that Jesus is the image of the invisible God (Col 1:15).  He came from the spirit realm, became physical for 33 years and returned to the spirit realm. Did the Shroud capture that split second in time when the physical body of Jesus returned to spirit (light)?","date":"April 30, 2012 at 12:47 pm","url":"https://shroudstory.com/2012/04/30/paper-chase-new-paper-challenges-rogers/","cat":"carbon_14_dating","title":"Paper Chase: New Paper Challenges Rogers"},{"author":"shroud_encounter","post":"There are too many references to light in Scripture for it to be ignored.  Especially when you consider that the bible says that “God is spirit” and it also says “God is light”. It is therefore not unreasonable to postulate that when Jesus returned to pure spirit, light was involved.  The Mount of Transfiguration was a major clue:  “His face shone like the sun and his clothing became white as the light.”  You can believe that he just vanished without a trace. But I believe like a rock thrown into a pond…the ripple effect of his departure was light.","date":"April 30, 2012 at 2:18 pm","url":"https://shroudstory.com/2012/04/30/paper-chase-new-paper-challenges-rogers/","cat":"carbon_14_dating","title":"Paper Chase: New Paper Challenges Rogers"}],"events":[{"author":"shroud_encounter","post":"John, I agree that it is significant that it was women who first communicated the message of Christ’s resurrection.  It hugely elevated the status of women. If the story was made up, they would have never casted women as the messengers.  The numerous eye witness accounts of his post resurrection appearances are also huge because he didn’t just “appear” like some kind of UFO sighting but he sat and talked with them about the Kingdom.  My point however was that there we no eyewitnesses to the actual resurrection event itself.  Yet we DO have three witnesses to fulfill the mandate of Deuteronomy 19:15—an empty tomb, a vacant shroud, and a napkin lying next to it.","date":"May 23, 2013 at 6:03 pm","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","title":"A kind of witness?"},{"author":"shroud_encounter","post":"Dan, is there any way to find out if this talk will be taped or webcast? If yes, how would one obtain a copy or tap into a webcast.","date":"January 25, 2013 at 6:49 pm","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","title":"Eric J. Jumper to Speak on the Shroud of Turin"},{"author":"shroud_encounter","post":"This will be the first US conference in 6 years.  Regardless of who is speaking, whether you agree with their particular paper or not, it will be a wonderful time for all involved to connect or connect again.  Some of my fondest memories dating all the way back to the Paris conference in 1989 are simply making new friends and then reconnecting at subsequent conferences.  It is a time of wonderful camaraderie and fellowship.  Stop worrying about the minutia.  There will be papers you agree with and those you won’t.  But the relationships you build and cultivate will be priceless.  Mealtime get togethers and late night cocktails  with old friends and new–that is what I look forward to.  With the right attitude, we can all help make this a great conference–even if we don’t all agree.","date":"October 26, 2013 at 6:39 pm","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","title":"Some thoughts on the St. Louis conference announcement"},{"author":"shroud_encounter","post":"That is what many are experiencing.  It varies.  I am seriously bummed.  We will have to pull each one into an edit program, raise the audio levels and then repost to Youtube.  I think the first thing to do is take them all down and gradually replace them as we get them edited.  Thanks for your input.","date":"November 27, 2014 at 8:20 am","url":"https://shroudstory.com/2014/11/26/st-louis-videos/","cat":"st_louis_2014","title":"St. Louis Videos"},{"author":"shroud_encounter","post":"Ron,  I will be in Kitchener, Ontario March 21, 22 and 23.  I will be at Blessed Sacrament Catholic Church as part of an exhibit of the Vancouver Shroud Association.  Hope you can make it!  Times are 7:00 PM thurs and friday and 1:00 and 8:00 on Saturday.","date":"February 19, 2013 at 8:47 pm","url":"https://shroudstory.com/2013/02/19/upcoming-shroud-encounter-talks-with-russ-breault/","cat":"event","title":"Upcoming Shroud Encounter Talks with Russ Breault"}],"history":[{"author":"shroud_encounter","post":"Also consider that Jesus is shown with only four fingers and no thumbs as we see on the Shroud.  If you look at the other panels of this codex series, all the other cast of characters show their hands with thumbs.  Why no thumbs for Jesus?  Yet another similarity between the HPM and the Shroud.  John is right about the fingerprint analogy.  How many points of congruence do we need to have a probable match?  I think we already have more than enough.","date":"September 21, 2013 at 8:32 pm","url":"https://shroudstory.com/2013/09/21/so-is-that-the-shroud-of-turin-depicted-in-the-hungarian-pray-codex/","cat":"history","title":"So is that the Shroud of Turin depicted in the Hungarian Pray Codex?"},{"author":"shroud_encounter","post":"I agree, when looking at the 1516 copy, the poker holes are extremely prominent probably because the image itself is so faint as to create a striking contrast.  We see in later copies of the Shroud after 1532, the various artists make a point of painting the burns and patches.  So it stands to reason that artistic renderings of the Shroud prior to 1532 would include the poker holes which is why we see it on the HPM and therefore proof of the HPM’s genesis.  Those holes are not random.","date":"September 22, 2013 at 9:49 am","url":"https://shroudstory.com/2013/09/21/so-is-that-the-shroud-of-turin-depicted-in-the-hungarian-pray-codex/","cat":"history","title":"So is that the Shroud of Turin depicted in the Hungarian Pray Codex?"},{"author":"shroud_encounter","post":"I always thought this story would make a fantastic book.  Think Indiana Jones beating the Nazis to the Ark of the Covenant.  I read an article that told how Hitler’s storm troopers came to this monastery looking for the Shroud…no doubt after applying some enhanced interrogation techniques on authorities in Turin.  The story goes that the Shroud was kept in a special space hidden inside the altar.  When the troops arrived, all the monks gathered around the altar to pray.  The troops ransacked the monestary but decided not to bother the monks praying around the altar…the exact place where the Shroud was hiding covered by the altar and the prayers of the monks.  Somebody please turn this into a book!","date":"July 30, 2012 at 9:34 am","url":"https://shroudstory.com/2012/07/30/why-was-the-shroud-hidden-in-a-monastery-during-wwii/","cat":"history","title":"Why was the Shroud hidden in a monastery during WWII?"},{"author":"shroud_encounter","post":"I had an interesting thought regarding the significance and meaning of the Shroud. The scripture says, “You were bought with a price.” That Jesus gave his life as a “ransom.” That we were “purchased”. The Shroud is a the RECEIPT demonstrating the PRICE that was paid, not in dollars but in blood. However the image represents the PROMISE of future glory. So the Shroud reveals both the price paid and the promise of transformation for all who believe. Here is the future promise: But our citizenship is in heaven. And we eagerly await a Savior from there, the Lord Jesus Christ, who, by the power that enables him to bring everything under his control, will transform our lowly bodies so that they will be like his glorious body. Philippians 3:20-21This is a future event…I hope its soon!Happy Easter!","date":"April 8, 2012 at 8:43 am","url":"https://shroudstory.com/2012/04/08/the-lord-is-risen-he-is-risen-indeed/","cat":"history","title":"The Lord Is Risen! He is Risen Indeed!"},{"author":"shroud_encounter","post":"Dave,  Thanks for that bit of history and perspective.  I found the original articles online but would love to read the entire interview given to Diva e Donna magazine by Rev. Andrea Davide Cardin, the librarian at the Abbey. He was also interviewed by Le Stompa newspaper around that same time.  The online articles are all published around April 8, 2010.","date":"July 30, 2012 at 6:36 pm","url":"https://shroudstory.com/2012/07/30/why-was-the-shroud-hidden-in-a-monastery-during-wwii/","cat":"history","title":"Why was the Shroud hidden in a monastery during WWII?"}],"image":[{"author":"shroud_encounter","post":"BTW, excellent article Yannick.  I just think Maillard reaction alone cannot explain all the attributes of the image.","date":"September 14, 2014 at 8:48 am","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level"},{"author":"shroud_encounter","post":"I agree with you Dan. To not spell out with clarity the superficiality of the image is ludicrous.  It is a key attribute of the image.  We all know the story of the camel–a horse designed by committee…","date":"May 5, 2012 at 12:09 pm","url":"https://shroudstory.com/2012/05/05/colin-berry-and-luigi-garlaschelli-may-have-already-won-the-prize-with-different-solutions/","cat":"image_theory","title":"Colin Berry and Luigi Garlaschelli may have already won the prize with different solutions."},{"author":"shroud_encounter","post":"Paint…I meant blood.  McCrone says its vermilion.","date":"October 23, 2013 at 4:42 pm","url":"https://shroudstory.com/2013/10/23/is-the-shroud-of-turin-a-medieval-photograph/","cat":"image_theory","title":"Is the Shroud of Turin a Medieval Photograph?"},{"author":"shroud_encounter","post":"What baffles me about all these attempts to reverse engineer the shroud image and claim they have found how it was fabricated in the middle ages, is that only historical reference from that era asserting the shroud to be a fake is the D’Arcis Memorandum which claims the shroud was “cleverly painted.”  We also know that this document was never sent to the pope and had clear economic and political motives.  But the question remains…who was the artist?  How did he “paint” the image when there is no visilbe trace of paint or pigment on the shroud?  The critics all start with this document but then ignore the fact that it was alleged to be a painting.","date":"April 12, 2012 at 6:19 am","url":"https://shroudstory.com/2012/04/10/onion-skins-and-dawkins/","cat":"image_theory","title":"Onion skins and Dawkins"}],"misc":[{"author":"shroud_encounter","post":"Angel, Excellent point!  Thanks for posting.","date":"October 9, 2013 at 11:15 pm","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"author":"shroud_encounter","post":"A few comments:  Only the gospel of John mentions “strips” of linen, the other gospels only refer to a linen cloth.  The strips were likely strips of linen used to bind the wrists, ankles and head and perhaps strips around the outside of the cloth.  The use of a single linen cloth is mandated in the event of violent death with significant loss of blood.  The other cloth referred to as a “napkin” in John’s gospel is not the usual talit (prayer cloth) but was a cloth used to cover his face from the cross to the tomb.  It was folded up and placed next to the body and was not on the face in final burial.  The spices and oil were brought to the tomb but probably not applied due to the impending Passover sabbath.  The women were on their way to the tomb Sunday morning to finish anointing the body when they encountered the empty tomb.","date":"April 15, 2012 at 7:44 am","url":"https://shroudstory.com/2012/04/15/francis-turretin-had-long-hair/","cat":"news_&_views","title":"Francis Turretin had long hair"},{"author":"shroud_encounter","post":"Well perhaps “serious scholars” wouldn’t put forth a theory that Jesus was married but popular media…you know the ones that influence culture, movies, junk novels, Discovery Channel “documentaries” and our children…is replete with it.  The the DaVinci Code sold over 60 million copies worldwide.  The Harvard Journal may yet print the paper and it may be read by a couple thousand people at best.  Meanwhile our junk media will cover the story as though it was a breaking news headline and Hollywood won’t be far behind.  That is the problem, no one pays attention to the serious scholars.  If they did, this paper would never get published.","date":"January 9, 2013 at 5:03 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","title":"Jesus’ Wife Papyrus Update"},{"author":"shroud_encounter","post":"Thanks for posting Dan.  My daughter is a film major at UGA…I am finally getting a return on my investment.  The purpose of the video is to make use of social media.  Of course all the standard fare is also produced such as a press release and posters but the world communicates now through Facebook and video.  Hopefully those interested will re-post to their own FB pages to invite their friends.","date":"February 23, 2012 at 3:05 pm","url":"https://shroudstory.com/2012/02/23/shroud-encounter-coming-to-the-richmond-virginia-area-in-march/","cat":"uncategorized","title":"Shroud Encounter coming to the Richmond, Virginia area in March"},{"author":"shroud_encounter","post":"A great milestone Dan!  Kudos!","date":"August 4, 2012 at 3:33 pm","url":"https://shroudstory.com/2012/08/04/while-you-were-sleeping-a-million-page-views/","cat":"news_&_views","title":"While you were sleeping: A million page views"}],"opinion":[{"author":"shroud_encounter","post":"In fact her phrase, “may at last give some definitive answers” betrays her own bias–as if to say there have been no definitive answers given to date.","date":"October 31, 2014 at 4:05 pm","url":"https://shroudstory.com/2014/10/31/how-knowledge-is-created-the-shroud-of-turin/","cat":"other_blogs","title":"How Knowledge is Created:  The Shroud of Turin"},{"author":"shroud_encounter","post":"I guess April 1st is becoming a major holiday!","date":"August 15, 2012 at 9:36 am","url":"https://shroudstory.com/2012/08/15/off-topic-major-shifts-in-religiosity-and-atheism-reported/","cat":"news_&_views","title":"Off Topic:  Major Shifts in Religiosity and Atheism Reported"}],"researchers":[{"author":"shroud_encounter","post":"There must be a typo, Barrie was not 50 during the STURP effort, he was 30.  Don’t want anyone thinking Barrie is now in his 80’s!","date":"April 21, 2012 at 2:53 pm","url":"https://shroudstory.com/2012/04/21/rosetta-correa-interviews-barrie-schwortz/","cat":"news_&_views","title":"Rosetta Correa interviews Barrie Schwortz"},{"author":"shroud_encounter","post":"I meant to say “one hour lecture.”","date":"June 10, 2013 at 2:34 pm","url":"https://shroudstory.com/2013/06/09/in-case-anyone-thinks-thomas-de-wesselow-isnt-important/","cat":"books","title":"In case anyone thinks Thomas de Wesselow isn’t important"}],"resources":[{"author":"shroud_encounter","post":"It is hard to know where the middle ground is.  On one hand no one wants to be described as “anti-science.” Yet I am smart enough to know that science is often agenda driven and heavily influenced by money, politics and the world view of those doing the science. Once something has become dogma in the scientific world, try getting a peer reviewed journal article published that espouses a contrary view. Science can be just as dogmatic as any religion.  While I don’t describe myself as a “young earther”, I also hold great skepticism towards science models that hold to a godless evolutionary view where all can be explained by random chance and natural selection.  Within academia, to even mention Intelligent Design is tantamount to treason and heresy.  Yet the principle of ID is clearly taught in Scripture….”The heavens declare the glory of God and the firmament reveals his handiwork.”  God is first and foremost the Creator.  Secular science wants to strip Him of this glory by attributing everything to natural causes.  I don’t buy it.  Until the day I die and meet my maker, no one will convince me a process that by definition is unguided, undirected, with no plan and no purpose can result in a universe and a world characterized by complexity, order and design (“apparent design” for the evolutionist).  I see Intelligent Design all around me but that is because I choose to see it.  Jesus has much to say about the Pharisees of his day who had eyes but could not see.  Science often promotes its own form of spiritual blindness.","date":"May 27, 2014 at 8:32 am","url":"https://shroudstory.com/2014/05/27/can-doubts-about-the-shroud-strengthen-christian-faith/","cat":"books","title":"Can doubts about the shroud strengthen Christian faith?"},{"author":"shroud_encounter","post":"Good point.  We have no idea what happened.  I assume light is involved, but that may not be the case.  His appearance in the upper room was physical yet was not bound by walls.  I am still in for light of some kind but you make a good point.","date":"February 28, 2014 at 12:11 am","url":"https://shroudstory.com/2014/02/26/giulio-fantis-book-launched/","cat":"books","title":"Giulio Fanti’s Book Launched"},{"author":"shroud_encounter","post":"Certainly would have to agree that it is stupid beyond stupid.","date":"April 10, 2012 at 10:20 am","url":"https://shroudstory.com/2012/04/10/the-single-dumbest-idea-in-the-history-ofdumb-stuff/","cat":"books","title":"The single dumbest idea in the history of…dumb stuff"},{"author":"shroud_encounter","post":"Good gracious! I have never seen made up facts certified with “100% certainty.”  Where do these people come from?","date":"July 6, 2012 at 10:03 am","url":"https://shroudstory.com/2012/07/06/an-image-in-myrrh-resin-do-the-math/","cat":"video","title":"An image in Myrrh Resin? Do the math?"},{"author":"shroud_encounter","post":"Good grief! It is certainly NOT a fact that the Shroud was created by Christians in the 1st or 2nd century. Second, a “theory” unsupported by data is nothing more than a hypothesis that may or may not have any merit.","date":"February 9, 2014 at 1:51 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"}]}
