{"dna":[{"author":"simon_brown","post":"Thanks Dave, I received your last article. I will add it on your first article, and send it out this weekend. \nThere is an interesting article below for you to read. \nI hope you are getting better. As Jesus and I need you. \n Simon Brown. http://wwwrealdiscoveriesorg-simon.blogspot.co.uk/ \nFor God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life. John 3:16King James Version (KJV)\n\n","date":"December 8, 2015 at 8:08 am","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"}],"events":[{"author":"simon_brown","post":"Our Almighty God did not create a 3 D image of Jesus revealing the most important time in world history for ALL to SEE, for no REASON.\nIf we read John 3:16 we truly understand why God preserved a 3 D image of Jesus.\nFor God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.\nThe Lord is not slack concerning his promise, as some men count slackness; but is longsuffering to us-ward, not willing that any should perish, but that all should come to repentance. 2 Peter 3:9. King James Bible\nWhat more evidence do we need to believe, repent, FOLLOW Jesus and be SAVED?\n\n","date":"July 14, 2015 at 6:26 am","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","title":"Does it Matter if the Shroud is a Fake?"},{"author":"simon_brown","post":"If anyone can prove the Shroud is a fake? then they will be more famous than Jesus.\n\n","date":"July 14, 2015 at 6:31 am","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","title":"Does it Matter if the Shroud is a Fake?"},{"author":"simon_brown","post":"100’s of the BEST scientists on the planet have already proved the Shroud is the same cloth as told in the gospel of John 19 – 20.\nPlease read the 100’s of peer reviewed, scientific, facts, papers and evidence proving the visible and physical evidences of the crucifixion, death, and the ultimate Resurrection of Jesus (Yeshua) meaning Salvation.\nResearched by the best researchers, experts and scientists in the world, proving the facts of God’s love for ALL humans, by sending Jesus who suffered severe pain and punishment by being whipped and nailed to a cross. NOT to condemn us. NO. But to save us. ALL HERE http://wwwrealdiscoveriesorg-simon.blogspot.co.uk/2015/02/read-100s-of-peer-reviewed-scientific.html\n\n","date":"July 14, 2015 at 10:52 am","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","title":"Does it Matter if the Shroud is a Fake?"},{"author":"simon_brown","post":"[removed by moderator]\n\n","date":"July 14, 2015 at 1:00 pm","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","title":"Does it Matter if the Shroud is a Fake?"}],"resources":[{"author":"simon_brown","post":"Hello Hugh, thanks for the useful info and letting me know about the spelling mistakes.\nIt was also very good to meet you at the Jalsa Salana conference and get to know you.\nI will also add on my channel your interview I took of you explaining your views on the Shroud.\nMy editor has checked the spelling mistakes out, and said some are not mistakes but are correct and has now rectified the wrong one, thanks.\nPlease don’t let the errors put you of, I always make mistakes, like most people, and people like you always let me know about them, which I always then rectify.\nAnd the many mistakes which was on my first Shroud booklet which has been no 1 on Amazon for over 2 years is a good example and proves errors make no difference, after they have been rectified.\nAs I said, I will send you a free copy to let me know of any more, which I doubt you will find as the majority of the book are articles and research by other Shroud experts.\nGod Bless You.\n\n","date":"August 23, 2015 at 5:57 am","url":"https://shroudstory.com/2015/08/20/new-book-on-the-shroud-of-turin-2/","cat":"books","title":"New Book on the Shroud of Turin"},{"author":"simon_brown","post":"The info about NASA was not my own source. And if it is incorrect it will be remmoved.\nThe Three Dimensional Properties Of The Shroud\nColorado USAF STURP team – click to view larger image\nOn February 19th 1976 the unique Three Dimensional properties of the Shroud were discovered by Dr John Jackson, Dr Eric Jumper Rev Dr. Kenneth Stevenson, Giles Charter and Peter Shumacher of the Colorado USAF STURP team, using a VP8 NASA 3 dimensional computer designed for NASA and the Gemini space project. The experiment was performed at Albuquerque, New Mexico.\nDr. John Jackson, is a former physics Professor at the US Air Force Academy, Colorado, and founder of the Turin Shroud Center of Colorado, P.O.Box 25326, Colorado Springs,\nCO 80918, USA\nWeb site: http://www.shroudofturin.com\n\n","date":"August 20, 2015 at 9:47 am","url":"https://shroudstory.com/2015/08/20/new-book-on-the-shroud-of-turin-2/","cat":"books","title":"New Book on the Shroud of Turin"},{"author":"simon_brown","post":"THE IMAGES ON A VP8 IMAGE ANALYSING COMPUTER\nThe VP8 Image Analysing Computer was originally designed to create a three dimensional image of serial images, and used for military purposes.\nNASA was interested in images taken by satellite, of the reverse side of the moon. The image formed on the VP-8 Image Analysing Computer are created by computer analysis of serial photographs taken by an orbiting satellite. The images are formed by the computer processing of multiple images normally taken, in this case, by a space telescope. Multiple images of the moon taken by a space telescope can be processed by the VP8 computer, and a three dimensional image of the moon computed and displayed on a computer monitor.\n\n","date":"August 20, 2015 at 9:49 am","url":"https://shroudstory.com/2015/08/20/new-book-on-the-shroud-of-turin-2/","cat":"books","title":"New Book on the Shroud of Turin"},{"author":"simon_brown","post":"And the info on Raymond Rogers was not made up by myself.\nRaymond Rogers\nFrom Wikipedia, the free encyclopedia\nRaymond N. Rogers (1927–2005) was an American chemist who was considered a leading expert in thermal analysis. To the general public, however, he was best known for his work on the Shroud of Turin.\nBiography\nRogers was born in Albuquerque, New Mexico. At the University of Arizona he studied chemistry receiving a BS in 1950. From 1951 to 1988 he was an explosives research expert and thermal analyst with the Los Alamos Scientific Laboratory (later called Los Alamos National Laboratory or LANL). From 1987 until 1992 he served on the Department of the Air Force Scientific Advisory Board with the equivalent rank of ‘Lt. General’ and received a Distinguished Service Award. He received other awards and recognitions from LANL and many professional organizations. He was granted a sabbatical in 1968 to pursue post-graduate studies in archaeology.\nDuring his career Rogers published over forty peer-reviewed papers on chemistry. In 1981 he was named Laboratory Fellow at Los Alamos National Laboratory. Other honors included being named a Tour Speaker for the American Chemical Society in 1971, the Los Alamos National Laboratory, Distinguished Performance Award in 1984 and the Department of the Air Force Exceptional Civilian Service Medal in 1991. He also served as the editor for Energetic Materials, a peer-reviewed scientific journal from 1983-1988. He was also on the editorial board of Thermochimica Acta from the first issue of this journal in 1970 (also the very first paper published in the first issue of this journal is authored by him) until his retirement in 1988.\n https://en.wikipedia.org/wiki/Raymond_Rogers\n\n","date":"August 20, 2015 at 10:03 am","url":"https://shroudstory.com/2015/08/20/new-book-on-the-shroud-of-turin-2/","cat":"books","title":"New Book on the Shroud of Turin"},{"author":"simon_brown","post":"Thank you everyone on this page, as I have now rectified the small mistakes. Please do let me know of anymore.\nGod Bless you all.\n\n","date":"August 20, 2015 at 12:03 pm","url":"https://shroudstory.com/2015/08/20/new-book-on-the-shroud-of-turin-2/","cat":"books","title":"New Book on the Shroud of Turin"},{"author":"simon_brown","post":"Dear Dan thank you for sharing this wonderful story. Lets hope and pray it is true and Elvis gave his life to Jesus. Then we will see him again. Amen. I will make a link from my web site http://www.realdiscoveries.info/ to this page. May God bless you Dan for your dedicated work. Simon Brown.\n\n","date":"February 6, 2014 at 12:44 pm","url":"https://shroudstory.com/2011/08/17/what-book-was-elvis-reading-when-he-died/","cat":"books","title":"What Book Was Elvis Reading When He Died?"},{"author":"simon_brown","post":"And where the heck did I say I did not love my neighbours. The reason why I went to this Muslim event was to reach them, and share the truth with them, simple because I care for them, that’s something called love.\nSo please show my one word I said proving I am wrong in understanding and do not love them.\nI also added in my article if you had read it – It must be noted. The Muslims are loving and caring people. In fact they believe love all and hate non. And I believe they practice what they preach.\nLet me add more to that statement –  I love all people including people who may hate me, including you.\nGod Bless.\n\n","date":"August 26, 2015 at 6:01 am","url":"https://shroudstory.com/2015/08/25/simon-brown-video-of-barrie-schwortz-at-jalsa-salana-uk/","cat":"video","title":"Simon Brown Video of Barrie Schwortz at  Jalsa Salana UK"},{"author":"simon_brown","post":"Telling the truth does NOT mean I do not love everyone or other people, in fact it means I do love and care for all, by helping them to know the truth, as Jesus said we are to confess Him and the truth.\nKing James Bible\nWhosoever therefore shall confess me before men, him will I confess also before my Father which is in heaven. Matthew 10:32.\nLuke 12:8\n“I tell you, whoever publicly acknowledges me before others, the Son of Man will also acknowledge before the angels of God.\nLuke 15:10\nIn the same way, I tell you, there is rejoicing in the presence of the angels of God over one sinner who repents.”\nRomans 10:9\nIf you declare with your mouth, “Jesus is Lord,” and believe in your heart that God raised him from the dead, you will be saved.\nRevelation 3:5\nThe one who is victorious will, like them, be dressed in white. I will never blot out the name of that person from the book of life, but will acknowledge that name before my Father and his angels.\nSadly truth is hatred to those who hate the truth.\n\n","date":"August 27, 2015 at 1:26 am","url":"https://shroudstory.com/2015/08/25/simon-brown-video-of-barrie-schwortz-at-jalsa-salana-uk/","cat":"video","title":"Simon Brown Video of Barrie Schwortz at  Jalsa Salana UK"},{"author":"simon_brown","post":"Your comment is incorrect saying – Jesus never asked us to be a Christian. Yes He did. He Said –\nMarvel not that I said unto thee, Ye must be born again. John 3:7. King James Bible\n\n","date":"August 27, 2015 at 1:41 am","url":"https://shroudstory.com/2015/08/25/simon-brown-video-of-barrie-schwortz-at-jalsa-salana-uk/","cat":"video","title":"Simon Brown Video of Barrie Schwortz at  Jalsa Salana UK"},{"author":"simon_brown","post":"Yes, true, absolutely anyone can be excepted by Jesus if they except and believe in Him and repent and become born again.\nThe Shroud is another proof of our beautiful Creator God who confirms our Christian faith is not a blind faith, but the fact that Jesus has left the visible evidence of Him behind and our Heavenly Fathers love can still be seen like a fossil in a time capsule proving God’s love for ALL the world, inviting all, no matter what colour or race, to come, see, believe, follow Jesus and be saved, all because God desires not one to parish, but all to have eternal life.\nMay God bless you.\n“Very truly I tell you, whoever hears my word and believes him who sent me has eternal life and will not be judged but has crossed over from death to life. John 5:24\n\n","date":"August 27, 2015 at 3:03 am","url":"https://shroudstory.com/2015/08/25/simon-brown-video-of-barrie-schwortz-at-jalsa-salana-uk/","cat":"video","title":"Simon Brown Video of Barrie Schwortz at  Jalsa Salana UK"},{"author":"simon_brown","post":"Yes, I totely agree Louis with your comment. There are lots of validations confirming the gospels outside the Bible and well. \nHere is one of many I wrote about.\nIs this the earliest validation confirming the gospels outside the Bible, By Thallus the (historian)\nDid you know there are ancient writings believed to be traced back before any of the gospels were written and dated, 50 – 52 AD, and later told by Thallus, an early historian which some Christians believe to be non-Christian validation confirming what happened at the crucifixion of Jesus, and the darkness over the whole land and an earthquake, the rending of rocks, just as we are told happen in the gospels.\nAnd when the sixth hour was come, there was darkness over the whole land until the ninth hour. Mark 15:34\nNow from the sixth hour there was darkness over all the land unto the ninth hour.\nMatthew 27:45\nAnd, behold, the veil of the temple was rent in twain from the top to the bottom; and the earth did quake, and the rocks rent. Matthew 27:51\nEarly Christian use of Thallus\nThe 9th-century Christian chronologer George Syncellus cites Sextus Julius Africanus as writing in reference to the darkness mentioned in the synoptic gospels as occurring at the death of Jesus: Ref: From Wikipedia,\n“Julius Africanus – Extant Writings, Fragment XVIII”. \n“On the whole world there pressed a most fearful darkness; and the rocks were rent by an earthquake, and many places in Judea and other districts were thrown down. This darkness Thallus, in the third book of his ‘History’, calls, as appears to me without reason, an eclipse of the sun.” \nAfricanus then goes on to point out that an eclipse cannot occur at Passover when the moon is full and therefore diametrically opposite the Sun.\nRef: From Wikipedia,\nVoorst, Robert E. Van (2000). Jesus Outside the New Testament : An Introduction to the Ancient Evidence. Eerdmans. pp. 20-23. ISBN 0802843689.\nEusebius (fourth century) mentions a history of Thallus in three books that according to an Armenian translation of Eusebius ranged from the sack of Troy to the 167th Olympiad. Some have argued that the reason Africanus doubted the eclipse is because Easter happens near the full moon and a solar eclipse would have been impossible at that time, as was well-known. Compounding the matter is the Armenian translation of Eusebius has many corrupt numerals and so many apologists claim that 167th Olympiad (or 109 BCE) should really be 217th Olympiad.\nRef: From Wikipedia,\nhttp://rbedrosian.com/euseb14.htm\nJump up ^ Mosshammer, Alden E., The Chronicle of Eusebius and Greek Chronographic Tradition Bucknell University Press (Lewisburg, PA: 1979).\nDr Craig, in his article:\nThallus on the Darkness at Noon states:\nHere is the passage from Africanus reproduced by Syncellus:\nOn the whole world there pressed a most fearful darkness; and the rocks were rent by an earthquake, and many places in Judea and other districts were thrown down. This darkness Thallus in the third book of his History , calls, as appears to me without reason, an eclipse of the sun. For the Hebrews celebrate the Passover on the 14th day according to the moon, and the passion of our Saviour falls on the day before the Passover; but an eclipse of the sun takes place only when the moon comes under the sun. And it cannot happen at any other time but in the interval between the first day of the new moon and the last of the old, that is, at their junction: how then should an eclipse be supposed to happen when the moon is almost diametrically opposite the sun? Let that opinion pass however; let it carry the majority with it; and let this portent of the world be deemed an eclipse of the sun, like others a portent only to the eye. Phlegon records that, in the time of Tiberius Caesar, at full moon, there was a full eclipse of the sun from the sixth hour to the ninth-manifestly that one of which we speak. But what has an eclipse in common with an earthquake, the rending of rocks, and the resurrection of the dead, and so great a perturbation throughout the universe? Surely no such event as this is recorded for a long period. But it was a darkness induced by God, because the Lord happened then to suffer. Ref: Reasonable Faith. Please see link below to the main article.\nThallus (historian)\nFrom Wikipedia, the free encyclopedia Thallus ( Greek : Θαλλός ) was an early historian who wrote in Koine Greek. He wrote a three-volume history of the Mediterranean world from before the Trojan War to the 167th Olympiad, c. 112-109 BC. Most of his work, like the vast majority of ancient literature, has been lost, although some of his writings were quoted by Sextus Julius Africanus in his History of the World .\nThe works are considered important by some Christians because they believe them to confirm the historicity of Jesus and provide non-Christian validation of the Gospel accounts: a reference to a historical eclipse, attributed to Thallus, has been taken as a mention of the worldwide darkness described in the Synoptic gospels account of the death of Jesus, although an eclipse could not have taken place during Passover when this took place.\nCould this be genuine? Visit the links below for further study.\nI am Simon Brown, thank you for reading this article.\nLINKS\nThallus on the Darkness at Noon http://www.reasonablefaith.org/thallus-on-the-darkness-at-noon#ixzz3Za8OmJod\nThallus (historian)\nFrom Wikipedia, the free encyclopedia http://en.wikipedia.org/wiki/Thallus_(historian)\n\n","date":"August 25, 2015 at 9:50 am","url":"https://shroudstory.com/2015/08/25/simon-brown-video-of-barrie-schwortz-at-jalsa-salana-uk/","cat":"video","title":"Simon Brown Video of Barrie Schwortz at  Jalsa Salana UK"},{"author":"simon_brown","post":"Yes, I agree. And there are many more ways of knowing if Jesus (YESHUA) is true and is God.\nWithout having to read what others say. But just reading what Jesus says.\nPeople ask me how do you know you’re Jesus is who He claims to be? And is the true God?\nI tell them by the examples of Jesus skill in telling parables. No person in the world could reveal such great secrets, unless He was from heaven, and was God Himself.\nNo prophet knew what Jesus knew. And it is very clear Jesus taught the prophets.\nNice to talk to you.\nMay God bless you.\n\n","date":"August 25, 2015 at 11:21 am","url":"https://shroudstory.com/2015/08/25/simon-brown-video-of-barrie-schwortz-at-jalsa-salana-uk/","cat":"video","title":"Simon Brown Video of Barrie Schwortz at  Jalsa Salana UK"},{"author":"simon_brown","post":"Absolutely. To divide and separate the scoffers.\n\n","date":"August 25, 2015 at 12:37 pm","url":"https://shroudstory.com/2015/08/25/simon-brown-video-of-barrie-schwortz-at-jalsa-salana-uk/","cat":"video","title":"Simon Brown Video of Barrie Schwortz at  Jalsa Salana UK"},{"author":"simon_brown","post":"It must be noted. The Muslims are loving and caring people. In fact they believe love all and hate non. And I believe they practice what they preach.\n\n","date":"August 25, 2015 at 6:23 am","url":"https://shroudstory.com/2015/08/25/simon-brown-video-of-barrie-schwortz-at-jalsa-salana-uk/","cat":"video","title":"Simon Brown Video of Barrie Schwortz at  Jalsa Salana UK"},{"author":"simon_brown","post":"But Dan the difference is, I did not highlight that part and send it out all over the world as you made a point of doing, instead you could of nicely contacted me beforehand by email first.\nAnyway thanks for updating people with the revised part.\n\n","date":"August 25, 2015 at 8:09 am","url":"https://shroudstory.com/2015/08/25/simon-brown-video-of-barrie-schwortz-at-jalsa-salana-uk/","cat":"video","title":"Simon Brown Video of Barrie Schwortz at  Jalsa Salana UK"},{"author":"simon_brown","post":"And if you are a Christian you should believe what Jesus said and taught. King James Bible\nJesus saith unto him, I am the way, the truth, and the life: no man cometh unto the Father, but by me. John 14:6\nThat means not by Allah, not by Mary, not by Buddha, but Jesus Christ of Nazareth alone, and not by being “loving and caring people.” alone.\n\n","date":"August 25, 2015 at 8:41 am","url":"https://shroudstory.com/2015/08/25/simon-brown-video-of-barrie-schwortz-at-jalsa-salana-uk/","cat":"video","title":"Simon Brown Video of Barrie Schwortz at  Jalsa Salana UK"},{"author":"simon_brown","post":"David I could give you countless verses confirming what Jesus said Himself saying He is the only way to be saved. Do you really want me to send you them all? Here are just some.\nKing James Bible\nThen spake Jesus again unto them, saying, I am the light of the world: he that followeth me shall not walk in darkness, but shall have the light of life. John 8:12.\nKing James Bible\nI am the door: by me if any man enter in, he shall be saved, and shall go in and out, and find pasture. John 10:9.\nKing James Bible\nVerily, verily, I say unto you, He that entereth not by the door into the sheepfold, but climbeth up some other way, the same is a thief and a robber. John 10:1\nKing James Bible\nThen said Jesus unto them again, Verily, verily, I say unto you, I am the door of the sheep. John 10:7\n\n","date":"August 25, 2015 at 9:21 am","url":"https://shroudstory.com/2015/08/25/simon-brown-video-of-barrie-schwortz-at-jalsa-salana-uk/","cat":"video","title":"Simon Brown Video of Barrie Schwortz at  Jalsa Salana UK"}]}
