{"misc":[{"author":"stan_chaz","post":"Re Occupy &Trinity Church: You don’t need to be religious to understand -and embrace- the idea that “Whatsoever you did for one of the least of these brothers and sisters of mine, you did for me.” But many of the 1%, in blind greed and endless schemes, have forgotten this. They have closed their eyes to what the word “society” should really mean, what it can mean. But due to Occupy Wall Street, we are finally talking less about CUTS and more about BLEEDING. Instead of demanding m-o-r-e budget cuts -to be borne by the middle class and poor- we are FINALLY focusing on the shameful bleeding that the poor and middle class has endured, for all too long. Instead of talking about even m-o-r-e cuts in the taxes of millionaires….we are now talking about fairness and justice – about an economy and a political system that is increasingly run for the rich, and by the rich. Instead of talking about LESS government, we are talking about a government that WORKS FOR ALL OF US, not just a favored few. Thank you OWS, for reminding us that people -ordinary working people- really DO matter, and for helping open our eyes to what’s  going on in this country, and why. The attempt by OWS to occupy Duarte Square (the empty lot owned by Trinity Church) is much more than a plea for sanctuary. For like Zuccotti Park, it’s an attempt to carve out a protected space, a living conscience for the city, amid the repression. A refuge…in a city where control-freaks would sweep us under the rug, and out of the way. In a city where they would pen us in, and permit us to death. In a city that tells us  to “move on, move on”….. you don’t belong, you don’t count, you don’t have a right to be here…don’t assemble, don’t block the street, don’t trespass, don’t EXIST! They would deny us, deny our lives, deny our very futures. IF WE LET THEM. But OWS responds, both in word and in DEED: it says we’ve had ENOUGH – we BELONG, we STAND our ground, and we DO matter! This IS our land, and we want it BACK! The word OCCUPY…says it all! That’s why OWS has captured our imagination. That’s why a living breathing OCCUPIED public space is important for OWS. Like Lady Liberty’s never extinguished torch that burns in our harbor, OWS needs to have a concrete, persistent in-your-face presence.. to continually remind us of what we’ve lost, of what we are, and what we can be …to affirm, illuminate, defy…and inspire. Trinity Church, with its oft-proclaimed ideals (and its huge land holdings), should look deep into its collective soul, do the right thing, and help OWS secure a sanctuary, a space of refuge and hope. And dare I say: a space of love – both love of country, and love of your fellow man and woman. Can thoughtful Christians argue with these simple Christian/human values? For if Christ were physically with us today, as He was 2000 years ago, He would be among the FIRST to climb those fences, and occupy Trinity’s Duarte Square. Of this I am certain… \n\n","date":"December 23, 2011 at 5:04 am","url":"https://shroudstory.com/2011/12/18/occupy-my-local-parish-church/","cat":"news_&_views","title":"Occupy my local parish church"}]}
