{"events":[{"author":"stefree","post":"And the further clarify the Papal attempts at distraction – ‘Christ commands His children to seek His face (MERCY) and His Body is His ‘Church’  –","date":"March 16, 2013 at 6:01 pm","url":"https://shroudstory.com/2013/03/08/pope-benedict-says-shroud-of-turin-authentic-burial-robe-of-jesus-it-doesnt-matter-what-science-says-about-its-authenticity/","cat":"event","title":"Pope Benedict says Shroud of Turin authentic burial robe of Jesus & it doesn’t matter what science says about its authenticity"},{"author":"stefree","post":"Why would God, WHO FORBADE IMAGES OF ANY KIND, allow an image of His Son to appear on a burial cloth, to be venerated and worshiped. Like the other catholic ‘relics – the shroud of Turinis is a distraction of the “Deny, Distract and Discredit” strategy of any damage-controlling corporation, and it doesn’t matter how many times the popes try to deceive the masses with their lies – “Worship a bogus burial cloth’ instead of the Son of the God of Israel, whose resurrection they deny as they love the empire  power of satan on earth  – Ancient Hebrew burial customs are clear…Great care was taken by Joseph of Aramathea and Nicodemus (whose name means ‘codified sum’) to prepare the body of  the ‘Christ’ for burial – this included ‘wrapping’ it in swaddling cloth – the same kind that He was wrapped in at his birth.  These strips of cloth were wound, mummy style, around the body while a separate head cloth, or ‘napkin’ was wrapped around His headThen took they the body of Jesus, and wound it in linen clothes with the spices, as the manner of the Jews is to bury. (John 19:38-42)  And he that was dead came forth, ‘bound hand and foot’ with grave clothes: and his face was bound about with a napkin. (John 11:44) And the napkin, that was about his head, not lying with the linen clothes, but wrapped together in a place by itself. John 20:7. The Greek word for napkin, face cloth, or burial cloth is “soudarion”.   The word is of Latin origin and means any of the following:1.a sweat cloth, a towel for wiping perspiration2.a handkerchief3.a napkin4.a cloth for binding the face of a corpseThe Greek word for folded, wrapped, or rolled up is ‘entulisso’.  It means any of the following:1.      to twist2.      to entwine3.      to wind up in4.      to wrap in (together)This face cloth would have been wound around the jaws and up around the head, probably in a twisted manner to make somewhat of a rope in order to make the jaw securely closed.","date":"March 16, 2013 at 5:55 pm","url":"https://shroudstory.com/2013/03/08/pope-benedict-says-shroud-of-turin-authentic-burial-robe-of-jesus-it-doesnt-matter-what-science-says-about-its-authenticity/","cat":"event","title":"Pope Benedict says Shroud of Turin authentic burial robe of Jesus & it doesn’t matter what science says about its authenticity"}]}
