{"art":[{"id":"comment-2884","author":"stephanie","post":"It saddens me how most people look for the “reasons” behind Akianes and Coltons visions/truths. Instead of trying to ‘make sense’ of it and bring it into black and white for our own worldly minds, try asking Him to show you Himself and make sure your heart is open. Jesus doesn’t want to be kept a secret from you. He also doesn’t want, or is able, to bring confusion. I think the deeper issue here is not what Jesus looks like in the flesh, but what He looks like in your heart. We’ll all know soon enough if these children of God were right. I personally believe them, but if I had never seen a picture of Jesus, I would know He looks like love..","date":"2011-04-13","mins":"10:22 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud"},{"id":"comment-5216","author":"stephanie","post":"I absolutely loved reading, “Heaven is for Real.” One of the things that intrigued me was Colton meeting his sister in heaven. My brother, who was 19, died almost 8 years ago from a skiing accident. I have had many dreams of my brother since then, some I believe are from God. One of my most vivid dreams was about a year and half after my brother died. In my dream, I was napping on the couch, and I woke up to see my brother sitting in a chair with two little children sitting on his lap. I asked my brother if they were my new siblings and he said, “yes.” The children looked almost like twins, both with blonde hair and blue eyes, (and fluffy cheeks, I made sure to check for that :) ). I told my mom about my dream about a month after it happened, and she said that she had two miscarriages within 2 years of each other. I knew that my mom had one miscarriage before I had my dream, but I never knew that she had two until she told me. I look forward to seeing my brother again and meeting my two “new siblings” in heaven someday!.","date":"2011-12-04","mins":"2:56 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3531","author":"stephanie","post":"Heaven is for real is absolutely wonderful! I finished it in less than a day and I’m not that big of a reader. I have always been a Christian with my faith and beliefs and reading this book makes me all the more sure of my faith. It’s a wonderful book and I feel everyone should read it and I thank the Burpos for sharing their story! God Bless!.","date":"2011-08-07","mins":"5:21 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud"}]}
