{"forgery":[{"author":"steve","post":"The truth of it all.People are afraid of the truth that they are sinners just like God told them.There minds are marked just like God told them they would be but yet they refuse him.Noah had his hands full when building the ark.Think of all the non believers back then.Its no different now.I will say this as how brave you are to know what’s coming for your soul.You will cry but no tears will fall.You will plead but you will here no answer.How many times will you turn your back on God just as they did in Noah’s days.Remember what Jesus told his Disciples,be in constant prayer for you know not the day nor the hour.Even Jesus knew they would go on sinning.Be sure you hold Jesus close to your heart.\n","date":"January 9, 2018 at 4:11 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/09/18/the-turin-shroud-surely-the-most-cunning-dastardly-con-trick-in-history-14th-century-france/","cat":"turin_shroud","title":"The Turin Shroud – surely the most cunning, dastardly con trick in history (14th century France)"}],"image":[{"author":"steve","post":"Menedemus, you note, “Isn’t Dawkins a biologist – i can’t see why he might be interested” What you are arguing is it is naïve to expect Dawkins to extend himself beyond his area of expertise. Yet this very same Richard Dawkins, Dawkins the evolutionary scientist, evangelizes about how accepting the divinity of Christ is a “delusion” and he goes so far as to advise atheists (last March) to publically mock and ridicule his followers. \nI leave it to you to explain why this biology expert should be interested in advising atheists to ridicule Christians. The fact is, Dawkins tends to be keenly interested in expounding upon matters far beyond his own area of expertise.\nWhat intrigues me about Richard Dawkins mental habits and your explanation for his ostensive lack of interest in the Shroud is the how whimsically arbitrary both are. The Shroud is an artifact, not a religious creed, and yet it seems to suggest something ultimately religious in nature about Christianity’s founder, who happens to be a real person. \nEven without the connotations to Christianity’s founder, what should interest Dawkins about this artifact, as the Shroud should interest any thinking person, is that the Shroud almost perfectly encapsulates the frailties and pitfalls of empirical inquiry: the more we know empirically about the Shroud, the more new questions arise about it and about our scientific methods. Thomas Aquinas said we should affirm the goodness of empirical science even as we acknowledge this inherent problem with it. This is the real reason why Richard Dawkins doesn’t talk about the Shroud and this is also why he says he doesn’t have much use for Aquinas. Hearing selectively, he is a Pharisee for the contemporary age.\n\n","date":"June 30, 2012 at 4:10 pm","url":"https://shroudstory.com/2012/06/29/three-months-today-the-dawkins-challenge/","cat":"image_theory","title":"Three Months Today: The Dawkins Challenge"},{"author":"steve","post":"“But why should anyone outside the Shroud world be interested? The letter/challenge seems to assume that the fact that the image on the Shroud is not understood makes it somehow unique. Yet there are hundreds of other scientific issues that we still don’t understand e.g. why some people get cancer and others dont.”\nMenedemus, skeptics outside the “Shroud world” ARE INTERESTED, but they are generally interested in proclaiming the Shroud a fake. These skeptics, if they’re serious about science, should explain why their preferred conclusion is valid science in the face of all currently available evidence.\n\n","date":"June 30, 2012 at 1:57 am","url":"https://shroudstory.com/2012/06/29/three-months-today-the-dawkins-challenge/","cat":"image_theory","title":"Three Months Today: The Dawkins Challenge"},{"author":"steve","post":"Resources shouldn’t be allocated to Shroud inquiries until urgent humanitarian concerns are thoroughly addressed? When a woman bought expensive oil and wiped Jesus’ feet with it, Judas advised that the woman wasted her money and she should have given it to the poor instead. How nearly right was he?\nYou allocate your own mental resources to thinking about the Shroud. Perhaps you can explain why you’re still interested despite pressing humanitarian problems.\nWe need to address your quandary: “I wish someone could explain why the issue of not knowing how the Shroud was created is such a big one.” It is not an especially big issue for everyone, although it clearly is a big issue for Richard Dawkins (and you, apparently). Dawkins does not want to think or talk about the Shroud precisely because he can’t explain it. Instead, he prefers to be lazy and say “science” has already refuted this artifact’s authenticity. \nThe truth is, the more science is applied to the Shroud, the more difficult it becomes to explain it away. A less ham-handed mind, a mind endowed with at least some humility, would acknowledge this simple fact. The fact that he does not should serve as a warning to his followers because being selective about the truth is a costly business.\nIncidentally, much bigger problems than the Shroud’s inexplicable reality are the clumsy application of words like “PROOF” and fundamentalist science. Science might provide illumination of certain circumstantial evidence lending to the inferential conclusion of the Shroud’s authenticity, but it is ridiculous to expect science to “prove” the Shroud belongs to Jesus of Nazareth, who rose from the dead. Fundamentalist science is the unexamined belief that anything not subject to science does not exist, and should therefore be dismissed and probably ridiculed in the name of science.\n\n","date":"July 4, 2012 at 12:54 pm","url":"https://shroudstory.com/2012/06/29/three-months-today-the-dawkins-challenge/","cat":"image_theory","title":"Three Months Today: The Dawkins Challenge"}],"misc":[{"author":"steve","post":"Its exciting to think that this bit of cloth may have been the actual cloth that was wrapped around christ himself. However some so-called “christian” religions are HUGE on using relics, and miss the point that  the important FREE gift of Christ and the apostles was the Bible – and they are given away free.\n*sigh*\n\n","date":"March 25, 2010 at 11:50 pm","url":"https://shroudstory.com/2009/02/21/shroud-of-turin-shows-another-mystery-face/","cat":"news_&_views","title":"Shroud of Turin shows another mystery face"}],"researchers":[{"author":"steve","post":"A question that has always intrigued me about the Shroud being a painting, is why has no other work by the artist ever surfaced?\nI mean, what does an artist do all day…and even more so given that this artist was able to paint a perfect photographic negative 100s of years before proof could be established. I wonder how he/she explained that little plus-point to their patrons?  :)\n\n","date":"April 22, 2015 at 6:58 am","url":"https://shroudstory.com/2015/04/21/charles-freeman-and-the-huffington-post-caption-writer/","cat":"2015","title":"Charles Freeman and the Huffington Post Caption Writer"}],"resources":[{"author":"steve","post":"Paul’s “seven authentic” letters attest to his personal acquaintance with some of Jesus’ closest disciples, as well as Jesus’ own brother, James, head of the Jerusalem church. Many of Paul’s comments about these “Pillars” are negative, which probably satisfies the criterion of embarrassment. SInce Paul knows James, and knows that James’ brother was Jesus, there is very little wiggle room here for the mythicists. Therefore, in order to refute the historical Jesus, we must refute Paul’s seven authentic letters, and to my knowledge, to date, this has not been accomplished.\n\n","date":"March 22, 2012 at 3:42 am","url":"https://shroudstory.com/2012/03/21/bart-ehrmans-new-book-did-jesus-exist/","cat":"books","title":"Bart Ehrman’s new book: ‘Did Jesus Exist?"},{"author":"steve","post":"I have my doubts on this one. Like the James ossuary, it’s all a little too “pat”.\nAlso, if I understand correctly, there is a Greek or Latinized version of the name, “Mary” (“Maria”). \nBut if that’s the case, and the authors are arguing for a very early, Jewish provenance for the tomb’s contents, then why in the world would any of its artifacts contain non-Judean Greek or Latin script? Would not “Mary” be rendered in Hebrew or Aramaic as “Miriam” or some such Hebraic-Jewish name?\n\n","date":"March 6, 2012 at 3:27 am","url":"https://shroudstory.com/2012/03/05/even-more-on-archaeology-from-tabor-and-jacobovic/","cat":"books","title":"Even more on Archaeology from Tabor and Jacobovic"}]}
