{"art":[{"id":"comment-9531","author":"sue_bonar","post":"My good friend took a photograph of the clouds in fairly rare a snowstorm in southern NM. We both loved the picture but didn’t know why until a child pointed to the picture and said “I see Jesus!” As we turned to look where the child pointed, His face was revealed to us. I believe that the purity of children allows them to see and be open to truths we can become closed off to as we become adults. The photograph is at http://aliapinedo.com/artwork/1358605 the Son in a sky of snow.html Some people see Him, others don’t, but it’s there if you wish to look and see for yourselves. I haven’t read Colton’s book, simply because I don’t need to – I already know in my heart it is true. Jeshua is the true Light, and He shows himself to us in countless ways every day..","date":"2012-03-22","mins":"7:13 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9560","author":"sue_bonar","post":"Meant to ask if you could see the dove on his left cheek? Many have also seen the crown of thorns…..","date":"2012-03-23","mins":"9:32 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9559","author":"sue_bonar","post":"You’re very welcome! Thank you for looking at it. It’s better in person, but you can still see Him. =).","date":"2012-03-23","mins":"9:30 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9699","author":"sue_bonar","post":"I feel this forum is a good place for me to tell you all (believers, skeptics, those who still yearn for the Truth to be revealed) of a book that tells of my personal journey and my friend Alia’s personal journey of finding the Creator and Jeshua. It tells of how she photographed Jeshua in the clouds, how both our lives were changed…. I don’t intend for this to be a self promotion type of thing – we just want to share our story with others to spread hope and faith. You can find it as an ebook at http://www.amazon.com/Jesus Seven Angels ebook/dp/B004 VWLE9 O#  It’s titled ‘Jesus and the Seven Angels’ it’s at Barnes & Noble as well, just search by title if you’re interested. There’s another piece that Alia and I collaborated on – we each had a photograph that we liked but didn’t feel was complete. We brought them into one piece. It’s at http://studiowestwind.com/artwork/1518758 Ascent Collaboration with Alia Pinedo.html. Similar to Alia’s photograph of Jeshua in the clouds, this was piece turned out to be more than we originally thought. Seen from up close it is one thing, but viewed from a short distance it shows the profile of Jeshua standing, with the dove ascending above his head, its wings touching together behind its body, tail fanned out. Before an accident I was in about 5 1/2 years ago, I was basically an atheist. I had justified that belief from terrible past experiences, but I can see now that it was fear that held me back. The accident changed pretty much everything in my life. I’m a photographer, and about 3 years ago I was able to photograph some rediscovered and restored Tiffany stained glass windows of the Angels of Revelation. It was an experience that changed me forever, and I am so thankful for it. Many people struggle, as I did, with the doctrines of religion and how they relate to the Creator and to Jeshua. While the Bible is the book of passages and mysteries, it by no means tells the whole story. There is Truth in the words, and people who read it will find help with the answers they are searching for. The downside is the Bible as it is today doesn’t even contain all of the books that were written – countless have been lost or simply edited out by the church to suit their needs. While I have total belief in the Creator, Jeshua and the Angels, I do not support the idea of religion, per se. Religion is a man made thing – which is why it is rife with the sins of man – greed, hate, manipulation in addition to the positive aspects. My ‘religion’ if you will, is love. Ask yourself this – what religion was Jeshua? Do you really believe that the Creator separated us by Muslim or Christian or Buddhist, etc? Those differences were defined by man and enforced by man under the auspices of divine or other authority. It is the same as how man defines borders of countries for their own gain and power. Jeshua is of pure love, for all – beings, creatures, fowl and foliage. All that is of life.That love is not limited by anything – borders, titles, buildings or man. Jeshua told us to look at your neighbor and see yourself – to have compassion and forgiveness. Even his name, Jeshua ben Joseph, was changed by the church and authorities to Jesus. How do I know this? Because Jeshua told me so in a dream, and how he wishes it were not so. The book title uses Jesus because that is what he is popularly known as, but it not his true name. We all have guidance given to us all the time, though you must learn how to listen with your heart and trust what it is telling you. I’m not saying it’s easy, but it is possible..","date":"2012-03-27","mins":"3:18 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9594","author":"sue_bonar","post":"That would be very cool – the more people that see Jeshua, the better! Thank you for sharing it to others!.","date":"2012-03-24","mins":"6:55 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-18512","author":"sue_bonar","post":"Thank you, although I’m not sure how enlightened I am! lol Just trying everyday to be a better person. The book is only available online right now – if you need a hardcopy, please let me know..","date":"2012-10-29","mins":"11:16 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9750","author":"sue_bonar","post":"That is absolutely beautiful. It feels like you can see your vision as clearly now as when you were 28! The angel will come for you when it is time – no doubt about it. It is a wonderful gift you were given..","date":"2012-03-29","mins":"11:28 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9757","author":"sue_bonar","post":"I know they come to you how they need to, and it’s not always in the expected form. How amazing that you have seen them!.","date":"2012-03-29","mins":"1:39 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
