{"resources":[{"id":"comment-8191","author":"superfluousblogger","post":"Dear Sir: Thank you very much for the favorable review of my post. I do not pretend to be an expert on the Shroud and am entirely unfamiliar with the state of the art when it comes to sindological research. My main wish in reading Wilcox’s book was that he would have grappled more with the *best* arguments that may be put forward for the opposite side, even if he ultimately comes down in favor of the Shroud’s authenticity. I assume here, based on no knowledge or research, that there must be someone out there who has recently written from a persuasive “anti” perspective when it comes to the Shroud’s authenticity. I’d have liked to see more thrust and counter thrust from the litigants. In some respects, the question of the Shroud is similar to the Shakespeare authorship controversy, which in recent years has been pursued through the “adversarial” methods of moot courts, including one broadcast on PBS that involved justices of the Supreme Court. (Incidentally, the Man from Stratford is almost universally vindicated in such reviews of the evidence.) As you note on your site, the Shroud is a matter of faith. However, unlike many matters of faith (e.g., the burning bush, the Resurrection, etc.), the Shroud’s authenticity is at least partially subject to disproof. This is a good thing for sindonologists: the Shroud’s authenticity is “falsifiable”—either it is or it is not old enough, and if it is not old enough, it definitely is not authentic. Thus, sindonology can aspire to use of the scientific method, as Karl Popper or Thomas Kuhn might define it. I grant that it would be a challenge to prove dispositively that the Shroud is indeed the Shroud of Christ. If one were able to prove that the Shroud *cannot* be older than the 15th century, that would dispose of the issue in one direction. Technically, if one were able to prove that the Shroud was *certainly* from the year 33 A.D., even this still would not conclusively prove that it belonged to *Christ* (i.e., there were many other men who were crucified and died in or around that period). However, were the Shroud to be proven to have originated in the time of Christ, one would have to be pretty hard headed in one’s skepticism to deny its authenticity, given the various other indicia of the Gospel story (the wounds match those described in the Bible, etc.). I was agnostic as to the Shroud’s authenticity before reading Wilcox and remain so now–perhaps I lean a trifle closer toward belief than I did previously, but the title that Wilcox’s publisher slapped on his book strikes me as perhaps an oversell of its contents. In any event, I was very interested to see your site and grateful for the hat tip. Sincerely yours, A Superfluous Man.","date":"2012-02-13","mins":"5:46 am","url":"https://shroudstory.com/2012/02/12/another-book-review-of-wilcoxs-the-truth-about-the-shroud-of-turin/","cat":"books","title":"Another Book Review of Wilcox’s “The Truth about the Shroud of Turin”"}]}
