{"misc":[{"author":"tabletto","post":"Archeologist Shimon Gibson with his colleagues found the tomb discovery in Jerusalem 2009. The discovery exposed remains of the man who had suffered leprosy and died tuberculosis. The researches records that deceased have lived in 1-50 A.D. (in the time of Jesus) and the tomb was obviously the family tomb of upper class or priest family.Gibson said that the man had been buried according to manners of the Jews at that time. The manner was that the body wrapped to linen clothes, and the head wrapped with separate face linen. Gibson said that if the person wasn’t actually dead and woke up, he could shake and blow off the face linen and shout for help.Professor Shimon Gibson said that the shroud of Turin doesn’t fit together for burial practices in first century Palestine. Gibson said that the shroud of Turin is a single sheet made with a twill weave. According to Gibson the twill weave was known only from the medieval period.Copied; http://koti.phnet.fi/petripaavola/shroudofturin.html#12","date":"April 8, 2013 at 3:19 am","url":"https://shroudstory.com/2013/04/01/an-easter-meditation-on-the-shroud-as-a-sign/","cat":"news_&_views","title":"An Easter Meditation on the Shroud as a Sign"}],"opinion":[{"author":"tabletto","post":"http://www.kotipetripaavola.com/shroudofturin.htmlWorthty reading.","date":"October 20, 2013 at 2:51 am","url":"https://shroudstory.com/2010/10/07/more-on-petri-paavola-from-finland/","cat":"other_blogs","title":"More on Petri Paavola from Finland"}],"resources":[{"author":"tabletto","post":"There are various opinions and researches of the shroud of Turin. Some people say that it is the genuine and some that it is the fake and the hoax. The fact is that the shroud of Turin doesn’t present Jesus of the Bible. If we can find even one evidence, which disprove the shroud of Turin theory, so the whole story shall be invalidated. We can find a large number of evidence from the Bible, which show that the shroud of Turin cannot be the shroud of the Lord Jesus.http://koti.phnet.fi/petripaavola/shroudofturin.html","date":"April 7, 2013 at 1:53 am","url":"https://shroudstory.com/2013/04/04/a-critical-review-of-giulio-fantis-new-book-unreliable-results-because-of-inadequacy-of-methods/","cat":"books","title":"A Critical Review of Giulio Fanti’s New Book:   Unreliable Results Because of Inadequacy of Methods"}]}
