{"dating":[{"author":"tamara","post":"With respect to the erroneous C14 dating results of 1988, I, for one, was surprised to learn the cloth sample tested for Carbon 14 dating was not placed under the Electron microscope prior to Carbon 14 dating.  \nWhen a scientist has a small amount of sample to be tested, other non-destructive chemical physical or biological type tests should be done before using his or her precious sample.  Had this small amount of cloth been placed under the Electron microscope initially, it would have been obvious that the particular linen sample was contaminated with the cotton fibers.\nAt that point, the sample should NOT have been C14 dated.  Ultimately, the testing done in 1988 was nothing more than a waste of sample, time, money and a clear disappointment for many around the world, including the Vatican, who truly believe the Shroud is the actual burial cloth of Christ.  \nTo my mind, it is amazing that six different labs had access to the cloth samples and all six labs destroyed what little they were given without so much as placing the small piece of cloth under a microscope first.  \nBest,\nTamara Beryl Latham\n\n","date":"January 22, 2012 at 2:11 pm","url":"https://shroudstory.com/2011/09/27/bad-shroud-of-turin-errors-spread-and-live-on/","cat":"carbon_14_dating","title":"Bad Shroud of Turin Errors Spread and Live On"}],"researchers":[{"author":"tamara","post":"\n\nDear Stephen E. JonesThe Latest News on Shroud of Turin Hologram - shown by Physicists that an Event Horizon occurred when Jesus was resurrected - Shroud authentic - Nothing like it in the world. The Shroud may also have the code to the universe. See Links.An Easter Surprise:[b] A Quantum Hologram of Christ's Resurrection ...Apr 7, 2009 ... The Shroud of Turin is arguably the single most studied artifact in human ... In general relativity, an event horizon is a boundary in ...www.jesuslives.co.za/.../an-easter-surprise-a-quantum-hologram-of-christs-resurrection/Cryptic Science-Prophecy Monday, Part II « New WineskinsApr 13, 2009 ... (Scientific American, February, 2009). Physicists have yet to figure out what ... fascinated by the total absence of distortion of the Shroud [of Turin] image, ... In general relativity, an event horizon is a boundary in ...www.newine.wordpress.com/2009/.../cryptic-science-prophecy-monday-part-ii/Shroud of Turin Education ProjectNew Documentary with 3D Hologram. From: GRIZZLY ADAMS® PRODUCTIONS, ... Forensic scientists and chemists have determined that the bloodstains on the shroud ..... What Did Jesus Look Like as a Boy? Forensic experts use computer images ...http://www.shroud2000.com/LatestNews.htmlScience prooving the Resurrection of Christ - Jokeroo Community1 post - Last post: 6 hours agoA Quantum Hologram of Christ's Resurrection? by Chuck Missler Dame ... The Shroud of Turin is arguably the single most studied artifact in human history. ... The phenomenon of the image brings us to a true event horizon, ...www.board.jokeroo.com/.../135801-science-prooving-resurrection-christ.htmlBest,Tamara Beryl Latham\n\n","date":"September 29, 2009 at 7:50 AM","url":"http://theshroudofturin.blogspot.com/2008/02/shroud-of-turin-may-not-be-fake-after.html","title":"\nShroud of Turin may not be a fake after all!\n"}]}
