{"image":[{"author":"tersio","post":"What all skeptics do not notice is the fact that a forger only fakes something either preexisting or something which is known throughout the history. He never will fake something which was invented by him, because this is nonsense at all. Both conditions are not satisfied in the case of the Shroud of Turin, because neither the New Testament nor the apocryphal writings mention a single line about the existence of a cloth with the dorsal and frontal images of Jesus’ body. Christian tradition, on the contrary, mentions a cloth with only Jesus’ face (the Veronica veil). Before the Middle Age, nothing is mentioned about it, as well. Why will a supposed forger be at the same time so skilled in order to make such an astonishing masterpiece (which even today is very difficult-if not impossible- to copy) and so silly in order to ‘fake’ something unknown at his time? This would be the greatest paradox of all time!","date":"April 12, 2010 at 11:29 am","url":"https://shroudstory.com/2009/02/21/nicholas-allens-photograph-theory-just-wont-die/","cat":"image_theory","title":"Nicholas Allen’s Photograph Theory Just Won’t Die"},{"author":"tersio","post":"What all skeptics do not notice is the fact that a forger only fakes something either preexisting or something which is known throughout the history. He never will fake something which was invented by him, because this is nonsense at all. Both conditions are not satisfied in the case of the Shroud of Turin, because neither the New Testament nor the apocryphal writings mention a single line about the existence of a cloth with the dorsal and frontal images of Jesus’ body. Christian tradition, on the contrary, mentions a cloth with only Jesus’ face (the Veronica veil). Before the Middle Age, nothing is mentioned about it, as well. Why will a supposed forger be at the same time so skilled in order to make such an astonishing masterpiece (which even today is very difficult-if not impossible- to copy) and so silly in order to ‘fake’ something unknown at his time?","date":"April 12, 2010 at 9:58 am","url":"https://shroudstory.com/2009/02/21/nicholas-allens-photograph-theory-just-wont-die/","cat":"image_theory","title":"Nicholas Allen’s Photograph Theory Just Won’t Die"}],"misc":[{"author":"tersio","post":"Well, I don’t know very much about the history of USA money, but the logic of my comment can be easily understood.","date":"April 2, 2011 at 4:58 pm","url":"https://shroudstory.com/2011/04/02/great-comment-but-what-about-the-thirty-dollar-bill/","cat":"news_&_views","title":"Great Comment, But what about the Thirty Dollar Bill?"}],"researchers":[{"author":"tersio","post":"What all skeptics do not notice (or simulate  ignorance, according to their interests) is the fact that a forger only fakes something either preexisting or something which is known throughout the history. He never will fake something which he invented, because this is absolutely nonsense. Both conditions are not satisfied in the case of the Shroud of Turin, because neither the New Testament nor the apocryphal writings mention a single line about the existence of a cloth with the dorsal and frontal images of Jesus’ body. Christian tradition, on the contrary, mentions a cloth with only Jesus’ face (the Veronica veil). One would expect that this veil would be faked instead. Before the Middle Age, nothing is mentioned about it, as well. Why will a supposed forger be at the same time so skilled in order to make such an astonishing masterpiece (which even today is very difficult-if not impossible- to copy) and so silly in order to ‘fake’ something unknown at his time? This would be the greatest paradox of all time!","date":"April 15, 2010 at 9:13 PM","url":"http://theshroudofturin.blogspot.com/2009/12/shroud-of-turin-is-burial-sheet-of.html","title":"The Shroud of Turin is the Burial Sheet of Jesus!"}]}
