{"art":[{"author":"the_deuce","post":"The forked beard and overall shape of the face stand out the most to me.\n\n","date":"February 6, 2012 at 11:00 pm","url":"https://shroudstory.com/2012/02/06/another-justinian-this-one-circa-652/","cat":"art","title":"Another Justinian, this one circa 652"},{"author":"the_deuce","post":"we cannot analyse one element alone and then, analyse another element alone. No, we have to look at the WHOLE PICTURE AT ONCE ! And what it the whole picture ?\nExactly. I think it can be argued within reason that the Codex wasn’t *directly* copied from the Shroud, but the people who persuade themselves that there is no connection between the two at all, simply because they can find some of the individual elements in different contexts, are simply deluding themselves, imo. It’s like finding a written work and conjecturing that it was created by random banging on a keyboard because you’ve seen all the same letters elsewhere. The confluence of the naked Christ and his general appearance, hidden thumbs and long fingers, hands crossed over the genitals, and long shroud establish the connection. The question from that point is which direction the connection is in (I consider it more plausible that the Shroud was the ultimate source for a number of reasons). The L-shape and herringbone pattern wouldn’t be significant on their own, imo, but they become suggestive in light of the connection established by the other factors.\n\n","date":"June 6, 2012 at 9:24 am","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"author":"the_deuce","post":"no blood trails on the forearms, hair or elsewhere, no scourge marks, no swollen cheek, no wrist wound\nBecause clearly the artist didn’t think Jesus had been scourged or crucified….\n\n","date":"June 6, 2012 at 9:03 am","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"author":"the_deuce","post":"Those other paintings of Christ naked are interesting, though I don’t think they make good counterexamples, since they are rather obviously based on the Pray Codex itself, or otherwise based on the same source as the Pray Codex, either directly or indirectly, so they would share the same “excuse” for depicting Him that way.\n\n","date":"June 5, 2012 at 10:22 am","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"}],"blood":[{"author":"the_deuce","post":"ArtScience, don’t know if you find this helpful. It’s from that Joe Jackson paper Stephen Jones put online:\n“There are, in addition, other aspects of the Shroud which indicate that the cloth enveloped a real body. This is demonstrated by the numerous bloodstains, labeled B-F in Figure la, which correspond to distinctly [328] different flow directions, consistent with a vertical crucifixion first, followed by a horizontal burial of a real corpse. Several examples that illustrate flows in the vertical position are the wound in the side (Feature B), trickles along the forearms (Feature D), puncture wounds on the head (Feature E) and the wrist wound (Feature C). Conversely, the bloodstain across the small of the back (Feature F) and the trickle at the dorsal foot (Feature G-1) correspond to a body oriented in the horizontal position. The latter set of bloodstains depict liquid and, therefore, presumably late time post-mortem flows. In contrast, the vertical bloodstain set corresponds to clot transfers and, hence, earlier flows that had dried to some extent. Thus, the bloodstains are consistent with crucifixion followed by burial.”\n\n","date":"February 17, 2012 at 2:55 pm","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"author":"the_deuce","post":"Here’s another interesting paper that summarizes a lot of the interesting features of the Shroud as of 2000, including the blood and why we know it’s blood: http://www.shroud.com/pdfs/ford1.pdf\nIn particular, from page 7:\n“Adler and others answer Vignon’s question and McCrone’s objection in the following manner. For one thing, not all the ‘blood’ material is red, for its color ranges from yellow to orange to red to brown. Also, the ‘blood’ is not whole blood, but exudate from a blood clot (when a blood clot dries, it contracts, exuding liquid blood material). The ‘blood’ moreover is blood clot exudate from a beaten, traumatized individual.A traumatic beating would destroy red blood cells, and the red cell debris would go to the liver, which in turn would take the debris’s hemoglobin and convert it to the bile pigment bilirubin.\nBilirubin levels in the blood would rapidly rise, meaning that should a cut form, the resulting blood clot’s exudate will contain serum albumin (a protein found in blood serum), and that albumin will bring with it bilirubin. The clot exudate’s hemoglobin oxidizes to become “methemoglobin,” which is reddish-brown/ brown; this reddish-brown/ brown + the yellow-orange bilirubin = red.”\nIn other words, many of the various puzzles regarding the blood are actually further evidence of authenticity. In this case, we have evidence that it’s not just any human blood, but blood from a heavily traumatized individual, and furthermore that it’s partial blood exuded from already drying blood clots, rather than whole liquid blood painted on.\n\n","date":"February 19, 2012 at 5:40 pm","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"}],"forensic":[{"author":"the_deuce","post":"\n\nI don't get Porter's point. *Obviously* the square isn't strong evidence for the Shroud's authenticity all by itself, and could be discounted as a strange but not too extraordinary coincidence in isolation, but nobody has ever suggested taking it in isolation in the first place. Obviously the point of the Vignon markings argument is that lots of odd little coincidences, which wouldn't be all that significant in the absence of the others, add up together and reinforce each other, in combination with all the other evidence for the Shroud's authenticity.Particularly for someone who already believes the Shroud's authenticity on other grounds, or even strongly suspects it, the neatest explanation for these coincidences would be that they're based on the Shroud itself.\n\n","date":"May 2, 2014 at 12:35 AM","url":"http://theshroudofturin.blogspot.com/2014/04/how-valid-are-vignon-markings-my.html","title":"\n\"How Valid are the Vignon Markings?\": My response to Dan Porter\n"},{"author":"the_deuce","post":"\n\nThat there is NO such comprehensive and internally consistent forgery theory, is itself evidence that the Shroud is NOT a forgery.Indeed. In fact, it's logically impossible for there to EVER be a theory on how the most prominent features, like the photo negativity and 200nm depth of the image, were formed, since those things were completely unknown at the time of the supposed forgery, and couldn't be detected or known until hundreds of years later.So there can never be a Shroud forgery theory. At best there can be a \"How some guy forged an elaborate image on a cloth, and ended up producing all these amazing puzzling features he couldn't see or know about completely by accident.\"Of course, the anti-authenticists aren't even at the point of being able to produce on purpose what was supposedly produced by blind luck.\n\n","date":"May 2, 2014 at 8:24 PM","url":"http://theshroudofturin.blogspot.com/2014/04/how-valid-are-vignon-markings-my.html","title":"\n\"How Valid are the Vignon Markings?\": My response to Dan Porter\n"},{"author":"the_deuce","post":"\n\nHi Steve!I'd never been able to make out the square with open top or the triangle underneath it before, but I just realized that's because I've always been looking at the contrast-enhanced negatives of the Shroud, which actually obscure those details. On the original image (which of course is what 6th to 12th century artists would have seen) they're as clear as day!And you're right. The repeated, uncanny reproduction of such details, which are the result of flaws in the cloth rather than part of the actual image that's on it, demonstrates, all by themselves and beyond a reasonable doubt, that the Shroud existed at that time.\n\n","date":"March 21, 2012 at 9:43 PM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","title":"\nFour proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)\n"},{"author":"the_deuce","post":"\n\nHow can people cling on too and repeatedly use the 1988 c14 dating as proof or evidence for the Shroud being medieval?The anti-authenticists cling to it because it's pretty much the only thing they have to cling to. Everything else about the Shroud presents only problems for them.\n\n","date":"March 22, 2012 at 8:10 PM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","title":"\nFour proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)\n"}],"history":[{"author":"the_deuce","post":"\n\nHi, Stephen,It occurs to me that, while there is no contradiction between the Shroud and the Gospel accounts, the fact that so many people perceive such a conflict, by taking a naive reading of the Gospels as a fully exhaustive account, offers further evidence that the Pray Codex is based on the Shroud.The Codex depicts a single long cloth under the body and wrapped (or about to be wrapped) over top of the head, like the Shroud. However, a naive reading of only the Gospels themselves, and taking the Gospel descriptions as an exhaustive description of the cloths, would tend to give a different impression. It seems very unlikely that the artist would have drawn the burial cloth the way he did based only on the Gospel accounts, without additional information to go on. Together with the naked body, crossed wrists, etc, we have good evidence that the additional information was the Shroud.\n\n","date":"July 19, 2012 at 9:42 PM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n"},{"author":"the_deuce","post":"Hmm, I don’t think that the Edessa link can be dispensed with quite that easily. If the only thing we had to go on was the legend about St. Jude bringing a cloth that Jesus wiped his sweat on to Edessa, then yes, that would be extremely weak, even contradictory. But there are other stories and descriptions that mention there being blood on it for certain, including blood from the spear wound on his side specifically, and that seem to indicate that it was a full length image. There are other descriptions that describe it as a very faint, ghostlike image, and which indicate that the Edessa cloth was stored in a way that it wasn’t totally visible. And there appears to be internal evidence from the Shroud itself that it was kept folded in a way that may have only made the face and upper chest visible.\nI think you can conclude from the Edessa stories themselves that there was confusion caused by people’ limited knowledge of the image. For instance, the image almost certainly had blood on it, but the story of Jesus merely wiping his face on it was developed by someone who didn’t know that. The story that attributed it to him wiping his face at Gethsemane was developed by someone who was aware of the facial blood and tried to account for it, but wasn’t aware of the blood elsewhere on the Shroud, later attributed to his side wound. Legends that involved Jesus imprinting his whole body by wiping his face were developed by people who realized there was more than just a face there and wanted to explain it, etc.\nThat’s all to say that there are some descriptions of the Edessa cloth that seem to fit an identification with various aspects the Shroud and some that don’t, but also internal evidence from just the descriptions themselves that some of those stories were developed by people who weren’t aware of many of the Edessa cloth’s properties, likely because of the way the cloth was stored and displayed (much as how we didn’t learn about the reverse-side image on the Shroud until just a couple years ago!)\nI don’t think the identification of the two is a lock, but I do think it’s a plausible conclusion, and not based just on pure supposition.\n\n","date":"February 4, 2012 at 10:18 am","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","title":"Calling all history buffs: Interesting comments from Yannick Clément"},{"author":"the_deuce","post":"Yeah, just by looking at the Shroud itself, you can tell that the sides were folded in at about shoulder width, and that it was also folded in half lengthwise several times.\nI think the idea that there was a copy of the Shroud face that was often shown in its place is plausible to explain the confusion over whether the Edessa cloth had blood on it, but not necessary. The blood stains and their placement don’t become obvious for what they are until you look at the Shroud image in negative and brightened up (and particularly when you see the whole body, front and back). It would be easy for someone peering into only a part of it, stored inside a box with a view hole at the very faint facial image (which is appears to be how the Edessa image was kept) to miss it. And then there’s the circumstantial evidence of Christ Protector, the coins, etc\nIt’s not a complete lock, but there are many disparate puzzle pieces that fit together pretty nicely there.\n\n","date":"February 4, 2012 at 4:28 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","title":"Calling all history buffs: Interesting comments from Yannick Clément"},{"author":"the_deuce","post":"Btw, I thought the image at Taylor Marshall’s place, of what you get if you fold the Shroud along its fold lines, was pretty interesting. The upper chest is still in the picture, but without the context of the rest of the image in view and the aid of photo negativity, you really can’t tell that there’s anything there but the face.\nhttp://cantuar.blogspot.com/2011/05/christs-holy-image-of-edessa-and-is-it.html\n\n","date":"February 4, 2012 at 4:32 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","title":"Calling all history buffs: Interesting comments from Yannick Clément"},{"author":"the_deuce","post":"Yannick:\nTaking a legendary account like that for a real and pure physical description of the Mandylion is purely speculative…\nIt’s notable in that the account illustrates that they were trying to explain an image with blood on the face, not just possible sweat. And the “side wound” reference illustrates that it had blood on it for certain, and not just on the face, contrary to the impression you’d get just from the version of the story where Christ merely wipes his face on it.\nHOW IN THE WORLD A CHRISTIAN WRITER COULD LOOK AT THE SHROUD FACE, THEN HE WOULD NOT RECONGNISED THE EVIDENT SET OF BLOODSTAINS COMING FROM A CROWN OR CAP OF THORNS AND CONFUSE THEM WITH THE BLOODY SWEATOF CHRIST IN GETHSEMANE ???\nI think it would be quite easy. Take a look at what the Shroud looks like when folded along its fold lines, in which configuration it was evidently stored for a long time (long enough to permanently imprint the fold lines):\n\nNow, imagine that was *all* you’d ever seen of the Shroud. Imagine that you’d never seen it in negative, and that you’d never seen the rest of the body and crucifixion wounds, or the back side of the image with the blood all over the top of the head. Even though the upper chest is in the picture, you can’t really make it out without more context, and it’s not obvious that the blood stains are blood stains. Now imagine that you’d only seen it indoors in pre-electricity lighting conditions, stored inside a box with a view hole with a lattice.\n\n","date":"February 6, 2012 at 9:58 am","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","title":"Calling all history buffs: Interesting comments from Yannick Clément"},{"author":"the_deuce","post":"Btw, while not related to the Shroud’s possible presence at Edessa specifically, I think we need to remember the Sudarium of Oviedo as corroborating evidence for the Shroud’s ancient existence.\n\n","date":"February 4, 2012 at 10:25 am","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","title":"Calling all history buffs: Interesting comments from Yannick Clément"},{"author":"the_deuce","post":"Thanks for the reminder that Colin Berry is completely out of his gourd. I’d almost forgotten.\nAlso:\n“looks nothing like Christ – no long hair, beard”\nAre we looking at two different Shrouds, or is Colin so desperate to see what he wants to see that he’s managed to convince himself that there’s no long hair or beard?\n\n","date":"April 26, 2012 at 12:03 pm","url":"https://shroudstory.com/2012/04/23/colin-berry-historybod-a-tale-of-two-meanings/","cat":"history","title":"Colin Berry, Historybod: A Tale of Two Meanings"}],"image":[{"author":"the_deuce","post":"Well, he can be given credit for (sort of) attempting to explain the 3D information in the image, which is at least an improvement over denying its existence. Other than that, it contradicts much of what is known about the Shroud (the extreme shallowness of the image, for instance, such that the cells of the linen fibers are essentially intact rather than scorched), and it’s bizarre and convoluted in a way that this picture captures nicely.\n\n","date":"February 1, 2012 at 12:38 pm","url":"https://shroudstory.com/2012/02/01/a-new-theory-for-how-the-turin-shroud-was-faked/","cat":"image_theory","title":"A new “theory” for how the Turin Shroud was faked"},{"author":"the_deuce","post":"Yes, obviously if you’re trying to lower a metal statue at 220°+ C into a cloth on a sand bed, and press it down enough so that it makes contact with all the features, it’s going to be in contact with it for more than 3 seconds. And the parts that stick out the most are going to be in contact for longer and exert more pressure, and thus burn deeper. And you’re not going to have perfectly even pressure and contact time across the whole statue either.\n\n","date":"February 21, 2012 at 6:30 pm","url":"https://shroudstory.com/2012/02/21/colin-berrys-idea-is-untenable-and-heat-cannot-produce-a-superficial-coloration/","cat":"image_theory","title":"Colin Berry’s idea is untenable, and heat cannot produce a superficial coloration"},{"author":"the_deuce","post":"Another issue is that the half-tones in the Shroud show great detail, which shouldn’t be the case if they are simply the result of burnoff in a radius around the areas of a statue that were in direct contact. Also, the edges of the Shroud image are pretty well-defined, which you likewise wouldn’t expect. And as always, we have to remember that a purported forger couldn’t possibly have been deliberately trying to make a 200nm image, or to create detailed half-tones that would only be really apparent under photo negativity with contrast enhancement, so we have to imagine them sort of stumbling into whatever method we are imagining them to have used. I’m also skeptical that hemicelluloses coated linen fibers would actually burn in the way described under a hot statue, but only experimentation can show for sure.\n\n","date":"February 19, 2012 at 9:27 am","url":"https://shroudstory.com/2012/02/19/i-dont-get-it-writes-a-reader-about-colin-berrys-hypothesis/","cat":"image_theory","title":"I don’t get it, writes a reader about Colin Berry’s Hypothesis"},{"author":"the_deuce","post":"Ron:\nYes, you’d get side images from forming an indentation with a cold run, and like ArtScience pointed out, the even bigger problem is that you’d completely lose the 3D effect by having all parts of the statue exert the same pressure for the same amount of time.\n\n","date":"February 21, 2012 at 8:10 pm","url":"https://shroudstory.com/2012/02/21/colin-berrys-idea-is-untenable-and-heat-cannot-produce-a-superficial-coloration/","cat":"image_theory","title":"Colin Berry’s idea is untenable, and heat cannot produce a superficial coloration"},{"author":"the_deuce","post":"Some fibers have color while adjacent ones do not. Rogers, Adler and others have noted that the color luminosity doesn’t vary much, not by more than 2% according to micro-densitometer readings taken by Adler. But the thread’s apparent luminosity, the visual tone as we see it, varies significantly according to the concentration or pattern of color discontinuities.\nThat’s fascinating! I didn’t know about that! So the fibers in the darker parts of the Shroud image aren’t colored more darkly, or more deeply, than the fibers in the lighter parts. It’s just that colored fibers are in greater concentrations relative to uncolored fibers in the darker areas of the Shroud!\nOn the shroud, image color has formed on the back side of the cloth in the region of the hair. It is interesting to note that the image is superficial to both surfaces of the cloth and that there is no image within the many dozens of fibers that constitute the yarn.\nAnd don’t forget the much fainter image on the reverse side of the front image. Somehow it created an image on one side of the cloth, and a much fainter mirror image on the other side, but without “burning” (or whatever) the material in between.\n\n","date":"February 6, 2012 at 1:32 pm","url":"https://shroudstory.com/2012/02/06/sciencebod-and-his-experiments/","cat":"image_theory","title":"Sciencebod and his experiments"},{"author":"the_deuce","post":"If the burnoff from a point of contact is only .1 mm, then this idea ceases to be an explanation for large, visible half-tone effects in the first place.\n\n","date":"February 19, 2012 at 11:53 am","url":"https://shroudstory.com/2012/02/19/i-dont-get-it-writes-a-reader-about-colin-berrys-hypothesis/","cat":"image_theory","title":"I don’t get it, writes a reader about Colin Berry’s Hypothesis"},{"author":"the_deuce","post":"I can understand someone arguing that the 3D information in the image wasn’t created by an actual 3D body – ie, that the image was deliberately fabricated somehow to *seem* 3D by shading areas such that their hue would correspond with their depth on a real face. I don’t believe that, or think it’s even a tiny bit plausible given what we know about the Shroud, but at least it’s a logical statement. If, on the other hand, sciencebod is really trying to say that the 3D encoding is all an illusion, that it’s just pure luck that it has the appearance of depth and that plotting the depth based on hue with a computer produces such an accurate 3D image of a face, based on the fact that the burn holes produce a variation in hue as well, then he’s simply nuttier than a Snickers bar, and it’s amazing that anybody is wasting more than a single breath dismissing his idea as less than wrong.\n\n","date":"January 30, 2012 at 4:56 pm","url":"https://shroudstory.com/2012/01/30/sciencebods-3d-problem/","cat":"image_theory","title":"Sciencebod’s 3D Problem"},{"author":"the_deuce","post":"Colin, your comparison to Piltdown man is exceedingly weak.\nHe knows. It’s so nonsensical that it’s not even an analogy, let alone a bad one. I think we’re well past the point where arguing with Colin risks “answering a fool according to his folly”.\n\n","date":"March 4, 2012 at 4:15 pm","url":"https://shroudstory.com/2012/03/04/stephen-jones-has-an-important-posting-on-heated-bas-relief-images/","cat":"image_theory","title":"Stephen Jones has an important posting on heated bas relief images"},{"author":"the_deuce","post":"“Are [the moustache and beard] really there, or do we just interpret the darker image above and below the mouth as facial hair?”\nThat can’t be a serious question.\n\n","date":"April 16, 2012 at 9:37 am","url":"https://shroudstory.com/2012/04/16/the-image-on-david-rolfes-website-absence-of-eyebrows/","cat":"image_theory","title":"The Image on David Rolfe’s Website:   Absence of Eyebrows?"},{"author":"the_deuce","post":"One other thing that should be obvious: A scorch caused by a heated statue would be deeper in the darker areas where there was more pressure, not with an even depth (much less one only 200nm) along the whole image.\n\n","date":"February 11, 2012 at 12:19 pm","url":"https://shroudstory.com/2012/02/10/the-image-on-the-shroud-of-turin-is-not-a-scorch/","cat":"image_theory","title":"The image on the Shroud of Turin is not a scorch"},{"author":"the_deuce","post":"Yup, I tend to agree with you Dan. I don’t think the Shroud was a side-effect of the resurrection, but that the image was formed as a deliberate miracle of its own, sort of like the changing of water into wine, such that no theory that tries to explain it as a “side-effect” or “byproduct” of something else, even if that something else is another miracle, can explain all of the salient properties of the result.\n\n","date":"February 8, 2012 at 12:07 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","title":"Why do we think the Resurrection was a process? What if it was not?"}],"misc":[{"author":"the_deuce","post":"And don’t forget that Stephen Jones is a “a boil on the bum of the blogosphere,” LOL. Honestly, I’ve sort of come to appreciate Colin’s writings as bombastic self-parody, but I can see why people trying to have a serious conversation would be less amused by it.\n\n","date":"March 12, 2012 at 2:49 pm","url":"https://shroudstory.com/2012/03/12/regrettably/","cat":"news_&_views","title":"Regrettably"},{"author":"the_deuce","post":"I’m not too far from there. I just might go to it!\n\n","date":"February 24, 2012 at 11:39 am","url":"https://shroudstory.com/2012/02/23/shroud-encounter-coming-to-the-richmond-virginia-area-in-march/","cat":"uncategorized","title":"Shroud Encounter coming to the Richmond, Virginia area in March"}],"opinion":[{"author":"the_deuce","post":"CO, he doesn’t want to understand because he’s not interested.\nThat’s not quite right. He’s actually extremely interested in not understanding. Between sciencebod, Bad Archeology, and the reader Dan mentioned who denied there was any image at all, I’m reminded of that story about Galileo’s scientific contemporaries who refused to look in the telescope, or did look and claimed to have seen nothing but smudges. When someone wants badly enough to not know something, their will can overcome their very senses.\nIf he’s truly interested let him put his money where his mouth is and make a copy of the shroud with all the same properties and submit it for analysis.\nActually, to make it relevant to what he’s claiming, he needs to create an image (photograph or painting) that creates a realistic 3D shape of a human face and body when the brightness of the image is translated into elevation, but without doing it on purpose.\n\n","date":"February 1, 2012 at 1:19 am","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","title":"Badder Still: Bad Archaeology at Bad Archaeology"},{"author":"the_deuce","post":"Sciencebod, are you seriously this dense? *Obviously* any photograph or painting will give you *some* result or other if you map brightness to elevation. But, like that Einstein photo (which came out mostly flat and with lines and inverted eyebrows), the result will not be anything like the actual elevation of a real human face. That’s the whole point. Actual photographs and paintings produce garbage when you run that sort of algorithm on them, whereas the Shroud produces an accurate elevation of a real human face.\nHence, either some super-skilled artisan deliberately encoded 3D information by “painting” the image in such a way that elevation would correspond with brightness, or the image was somehow produced by a real human body (or model of a human body) such that elevation would correspond to brightness. Showing us examples of how photos and paintings produce garbage results merely illustrates our point for us that the Shroud is not a painting or a photo, but an elevation map.\n\n","date":"January 31, 2012 at 8:21 pm","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","title":"Badder Still: Bad Archaeology at Bad Archaeology"},{"author":"the_deuce","post":"And your willful, obstinate, invincible ignorance of the most basic data disqualifies you from courtesy.\n\n","date":"February 1, 2012 at 1:06 am","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","title":"Badder Still: Bad Archaeology at Bad Archaeology"}],"researchers":[{"author":"the_deuce","post":"\n\nHi Steve,This is pretty interesting. In addition to reading your blog, I've also been poking around Dan Porter's blog, where you posted on this hypothesis here, as well as the finding that the Shroud actually does have a faint image on the back side of the front image, as predicted by Jackson.I think it's increasingly obvious that, at the bare minimum, the Shroud image *must* have been caused by a real human body, and that skeptical arguments, if they are to have any merit at all, must start with that premise. We already went into the sheer absurdity that results when you try to imagine what it would require for some medieval artist to forge such an image.With that said, what do you make of Ray Rogers' hypothesis of some kind of \"naturalistic\" image formation caused by some sort of chemical reaction of the Shroud to the corpse of the man on it? Personally, I find several things wrong with it. First, if the image was created by the Shroud folding into the crevices of the dead man's body and undergoing some sort of chemical reaction as it made contact with his skin, it seems to me that you would expect the image to come out distorted when the cloth was removed made flat again.Second, it strikes me as wildly implausible that such a \"naturalistic\" process would just happen to occur on the body of Jesus, and nobody else in history that we're aware of. Alternatively, if we wish to propose that it's not really Jesus' body, but some other body, we must suppose that some forger knew about this mysterious \"naturalistic\" process that still eludes us, found some guy who looked like Jesus in the artwork, then whipped him, crucified him, stuck a crown of thorns on his head, and speared him in the side to make his injuries look like Jesus', then put what would become the Sudarium of Oviedo on his face, then removed the Sudarium and put the Shroud over him, and performed whatever type of chemical wizardry was necessary to make the man's image transfer to the Shroud (but unknown to everyone else of his day and still unknown to us), then somehow passed the Shroud and Sudarium off as legitimate.Still, from reading Dan Porter's blog, there seems to be some disagreement between Ray Rogers' description of the image and the ENEA's, with Ray Rogers claiming that the image only exists in some sort of film of impurities on the surface of the Shroud, without perturbing the actual linen fibers at all, and the ENEA team postulating that the image is burned into the primary cell walls of the linen fibers. Do you have any insight into this?\n\n","date":"January 24, 2012 at 5:32 AM","url":"http://theshroudofturin.blogspot.com/2012/01/john-p-jackson-unconventional.html","title":"\nJohn P. Jackson, \"An Unconventional Hypothesis to Explain all Image Characteristics Found on the Shroud Image\" (1991)\n"},{"author":"the_deuce","post":"\n\n(cont)Also, what do you make of Max Patrick Hamon's argument, in reply to your comment on that thread, that Jackson's theory can't work because the image on the reverse side of the Shroud contains only the face and hands and not the rest of the body? Hamon attributes it to \"more pressure\" on the cloth by the hands and face. Personally, I find Hamon's idea problematic because if the reverse-side image were the result of more pressure, then there should have been a *much stronger* image of Jesus' back on the reverse side of the back image than there is of his face and hands on the reverse of the front side. After all, the back is the side of the Shroud he was laying on, with the full pressure of his body weight! And, finally, why do we see Jesus' hair so clearly on the Shroud, which shouldn't have exerted any significant pressure at all (actually, it occurs to me that the hair is just as serious and maybe fatal a problem for Ray Rogers and any other possible \"naturalistic\" explanation involving chemical reaction with a dead body as well)? In any event, the idea that the reverse image was caused by pressure presupposes that this is a real body we're talking about. In fact, the existence of the reverse-side image puts further paid to the notion that this was some sort of paint job.Btw, I got a bit of a chuckle out of sciencebod's objection that started the thread at Dan Porter's blog that I linked to. He tries to argue that the image isn't really 3D because the burn holes create a 3D appearance under topological analysis as well, and he seems to think that this is some sort of major revelation. Um, duh. Isn't it obvious that the 3D image arises from differences in hue caused by the different intensities of \"burn-in\" on the image, so that anything else that causes a gradation of hue (such as a burn mark) will produce a \"3D effect\" in an analysis that estimates depth based on hue? What was sciencebod expecting? An actual hologram on a linen cloth?! Anyhow, by making the argument that the 3D image is fake, and that it's actually some sort of 2D image masterfully made to look 3D, he's implicitly committed himself to precisely those absurdities that we covered earlier. In fact, he seems to compound the insanity by insisting that the image was made with \"a converging lens, concave mirror, or even pinhole camera\" (just try to imagine a medieval forger performing such a feat)!\n\n","date":"January 24, 2012 at 5:33 AM","url":"http://theshroudofturin.blogspot.com/2012/01/john-p-jackson-unconventional.html","title":"\nJohn P. Jackson, \"An Unconventional Hypothesis to Explain all Image Characteristics Found on the Shroud Image\" (1991)\n"},{"author":"the_deuce","post":"\n\nThis really is fantastic news. With this, the single solitary piece of evidence against the Shroud's authenticity, the one thing the skeptics had to cling to, has been shattered. And just in time for Easter!I doubt many skeptics will be persuaded by this, or any possible evidence no matter how strong. If they won't believe Moses and the Prophets, after all, they will not believe even if one is raised from the dead.However, I expect we're going to see a lot of even loopier theories about the Shroud from them, as these findings paint them into an even smaller and more untenable corner than they were already in. In particular, I think we're going to see a lot more Wesselow-style \"real but fake\" nonsense, where the skeptic admits the Shroud was the real burial cloth of Jesus, but tries to explain away the image as somehow an accident rather than a miracle.\n\n","date":"April 1, 2013 at 11:06 PM","url":"http://theshroudofturin.blogspot.com/2013/03/new-experiments-on-shroud-show-its-not.html","title":"\nNew experiments on Shroud show it's not medieval\n"}],"resources":[{"author":"the_deuce","post":"On a more general point of view, Fanti’s own credibility as an unbiased scientist free of any preconceived notions regarding Shroud research\nThat’s an absurd standard. Your grandstanding notwithstanding, *nobody* is “free of any preconceived notions” regarding Shroud research, and that’s especially going to be true of anyone who is interested enough in the subject to actually perform Shroud research.\nPersonally, I didn’t even had to read Mr. Rinaldi’s critical review before I took my decision… It was like a “no contest” for me because I know the guy’s ideological views about the Shroud since a very long time.\nHonestly, that causes me to doubt you more than anything. Everyone has biases, and we need to take them into account when weighing claims, but to reject someone’s claims out of hand because you “know their ideological views” is a far more extreme version of what you’re accusing Fanti of.\n\n","date":"April 9, 2013 at 11:31 am","url":"https://shroudstory.com/2013/04/04/a-critical-review-of-giulio-fantis-new-book-unreliable-results-because-of-inadequacy-of-methods/","cat":"books","title":"A Critical Review of Giulio Fanti’s New Book:   Unreliable Results Because of Inadequacy of Methods"}]}
