{"history":[{"author":"tom","post":"The image on the shroud was caused by intense gamma radiation.  The body was disintegrated.\n\n","date":"June 1, 2011 at 10:38 pm","url":"https://shroudstory.com/2010/12/16/a-special-posting-a-letter-from-john-jackson/","cat":"history","title":"A Special Posting: A Letter from John Jackson"}],"art":[{"author":"tom","post":"\nAnnieCee :\nI agree. I read it twice in a week, and re-read some favorite sections. I basically memorized it!  Such wonderful confirmation of what God has planned for those who love him.\nRecently I saw this video of a man who had a near-death experience, and I have thought about his story a lot. It’s very compelling:Very compelling story by this man, though it seems to me that the interviewer doesn’t believe a third of what she is hearing.\n\n","date":"October 25, 2011 at 8:51 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}],"misc":[{"author":"tom","post":"“And, Lord, if it be your will,\nLet Christopher speak some more”\nAt this point I’m sure God has turned His back on Hitchens. Why should God grant him full or partial healing when Hidchens has blasphemed and ridiculed God all of his adult life. Hitchens destiny is eternally set from which he’ll reap his rewards for all eternity, I’m really sorry Hitchens…\n\n","date":"August 11, 2011 at 3:39 pm","url":"https://shroudstory.com/2011/05/11/the-great-christopher-hitchens-has-lost-his-voice/","cat":"news_&_views","title":"The Great Christopher Hitchens Has Lost His Voice"}],"researchers":[{"author":"tom","post":"Jealousy is such a negative emotion, Loomis.\n","date":"February 19, 2014 at 7:51 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2014/02/18/brief-message-to-joel-achenbach-washington-post-re-your-hijacked-posting-on-pseudoscience-and-the-turin-shroud/","cat":"chatroom","title":"Brief message to Joel Achenbach, Washington Post, re your hijacked posting on pseudoscience and the Turin Shroud"}]}
