{"events":[{"id":"comment-24280","author":"tom_devins","post":"We could argue forever over the Church’s response science. But, the cold hard fact remains, ordinary people have been able to avoid “returning to dust” , the last such incident taking place in September, 1998 in Tibet. The next most recent incident took place in 1955. Before that it was 1948. The Catholic Church, through Father Francis Tiso’s on site investigation, has confirmed the most recent incident. (See Father Tiso’s web site to learn of his substantial credentials). How come I don’t hear about it from the pulpit on Sunday morning? “…to dust thou shall return…..but only if you so choose.” The incident sends shock waves through the entirety of Christian thought, undermining the notion of Original Sin all the way to the Resurrection on the last day. If the Church is so progressive in dealing with new revelation, when can I expect a response? How much longer will this vital piece of salvation information continue to gather dust in the Vatican library?.","date":"2013-02-14","mins":"4:11 pm","url":"https://shroudstory.com/2013/02/13/ash-wednesday-2013/","cat":"event","title":"Ash Wednesday 2013"},{"id":"comment-24235","author":"tom_devins","post":"It is not inevitable that our earthly remains shall return to dust. The Rainbow Body adepts in the Buddhist tradition, the Tamil Siddhas in Hinduism and Enoch, Elijah, Moses, Jesus and Mary in the Christian tradition (not to mention over 100 accounts of incorrupt bodies) all avoided “return to dust.” How? They took lifestyles of love (promoting happiness), compassion (eliminating suffering) and ascetic values to the extreme. They walked the walk. The words on Ash Wednesday, “….to dust you shall return” need to be modified to say, “….to dust you shall return, provided you so choose.” We are all spiritual entities seeking a human experience and not the other way around. Death and decay are the result of the spiritual us being overly caught up in the material world causing us to lose our way. As it turns out, the Essenes and Gnostics were right after all. Today’s faithful would categorically reject that message because it tampers with otherwise plush and comfortable lifestyles and membership would decline as would the proceeds in the Sunday collection plate. But, the facts are the facts are the facts. We all have free will and can have an opinion about anything one wishes to opine about. But, you cannot have an opinion about fact. The human mind as a serious defect. It can’t take a joke. So, if you keep saying something over and over it will accept it as fact no matter how wrong it might be and the conscious self will act accordingly. Politicians have known about this defect for eons and fully take advantage of it at the peril of the unsuspecting. We need to stop accepting the certainty of death and decay. Death and decay are alternatives, not fate. Lets face it; Adam and Eve are corporate characters, it is not possible to build a boat that will hold two of every creature (let alone find two of every creature) and God is not a man that lives up in the sky, having a son but not being married, and he does not have a super computer that keeps track of every deed, good and bad, that his subjects commit. The sooner we admit to these things the better off the world will be. The first step is to stop saying it. The only way to cure a broken leg is to recognize that the leg is broken. And, while churches may be full from time to time, the fact is in the U.S. 30% of the people raised Catholic leave the Catholic faith before their late 20’s. My impression is that a similar thing is happening in Europe. Were it not for the influx of Mexican immigrants the US Catholic population would be in serious decline. On top of that, almost 50% of those who claim to be Catholic practice the “cafeteria” version of the religion. They freely choose their personal preference on a variety of key issues, such as Original Sin, abortion rights, gay marriage, Mary’s virginity, transubstantiation and even the divinity of Jesus. About 40% of U.S. Christians believe in reincarnation and another 25% remain open to the possibility. The notion of Jesus’ second coming and the faithful being raised on the last day has been relegated to myth and metaphor. The Church has lost control of the congregation. The faithful speak proudly of the way the Church has held steadfast to its 2,000 year old traditions. I stand disappointed, even embarrassed, in front of my non Catholic friends, that this powerful institution has arrogantly refused to update its teachings and bring them inline with modern advances in Biblical scholarship, archaeological discovery, quantum physics, East West dialogue and social understandings. Ask the Dali Lama what he would do if science proved Buddhist teaching to be in error and he would say “change the teaching”. Ask the Pope what he would do if science proved Catholic teaching to be in error and he would say, looking down his nose on the questionnaire, “Sonny (or young Lady) we are the truth, science is wrong.” Speaking of truth, truth be known, the Church is so culturally invested in what it says and does that it cannot change and preservation of its priestly structure has taken priority over propagation of the truth and mediating salvation. The new Pope has a lot of work to do..","date":"2013-02-14","mins":"11:05 am","url":"https://shroudstory.com/2013/02/13/ash-wednesday-2013/","cat":"event","title":"Ash Wednesday 2013"},{"id":"comment-24141","author":"tom_devins","post":"Ash Wednesday…..”and to dust you shall return”. In September, 1998 the Buddhist monk Khenpo A Chos passed from this world by dissolving his body into a stream of light leaving nothing behind except the burial clothes. Called the Rainbow Body, he followed in the footsteps of the thousands of practitioners, ordinary people like you and me, who preceded him, all of whom exemplified the ultimate in love, compassion and abstention from indulgences of all types in their earthly lives. Kind of adds new meaning to the words used at Ash Wednesday services. Perhaps the words should be amended to say “…..but only if you so choose.”.","date":"2013-02-13","mins":"8:41 am","url":"https://shroudstory.com/2013/02/13/ash-wednesday-2013/","cat":"event","title":"Ash Wednesday 2013"}],"history":[{"id":"comment-118599","author":"tom_devins","post":"“Two revolutionaries were crucified with him, one on his right and the other on his left.” Matthew 27:38.","date":"2014-05-13","mins":"11:01 am","url":"https://shroudstory.com/2014/05/12/the-slanted-footrest-of-the-orthodox-cross/","cat":"history","title":"The Slanted Footrest of the Orthodox Cross"},{"id":"comment-118061","author":"tom_devins","post":"Point of order. The two men who were crucified with Jesus were not thieves. Romans didn’t crucify people for robbery; only insurrection. They were revolutionaries. The Greek word for robber is lestes but is also translated as brigand or insurrectionist. Interestingly, when Jesus is arrested in the Garden He asks if the mob came to seize him as a “lestes”. But here the word gets translated as robber. The same word, “lestes” is used to describe the two men, but here it gets translated as revolutionary. It appears that the Gospel writers sanitized the story of the arrest in order to gloss over the true reason as to why He was crucified..","date":"2014-05-12","mins":"5:15 pm","url":"https://shroudstory.com/2014/05/12/the-slanted-footrest-of-the-orthodox-cross/","cat":"history","title":"The Slanted Footrest of the Orthodox Cross"},{"id":"comment-118249","author":"tom_devins","post":"The were insurrectionists as was Jesus. Saying “The Kingdom at God is at hand” sends a clear message to Temple and Roman authorities that your days are numbered. A new king has arrived. I think he knew the consequence of His actions..","date":"2014-05-12","mins":"10:30 pm","url":"https://shroudstory.com/2014/05/12/the-slanted-footrest-of-the-orthodox-cross/","cat":"history","title":"The Slanted Footrest of the Orthodox Cross"},{"id":"comment-118562","author":"tom_devins","post":"Thanks. I didn’t know that. I just bought the book. I still think He met the test as a revolutionary, one who seeks to undermine authority. Non observance of the Sabbath, dining with the unacceptable, even healing, a job reserved for the Temple priests, set the tone for His ministry. He had a large following and taught them that this type of behavior was OK..","date":"2014-05-13","mins":"9:31 am","url":"https://shroudstory.com/2014/05/12/the-slanted-footrest-of-the-orthodox-cross/","cat":"history","title":"The Slanted Footrest of the Orthodox Cross"}],"misc":[{"id":"comment-127749","author":"tom_devins","post":"I find Barrie Schwortz’s defense against religious bias incredulous. Mentioning the religious representation on the team he says, “Never mind that our team included three Jewish members (Al Adler, Don Devan and me), one Mormon, one Evangelical, several Catholics, several Protestants and some avowed atheists and agnostics.” Notably absent on the team is the Buddhist Master. No matter, I guess, that Buddhists (and Hindu’s) have been vanishing from planet earth in a blast of radiation, all well documented, for thousands of years. It is a foundational article of their beliefs. The last incident occurred in September, 1998 and was thoroughly investigated and found authentic by the Catholic Church. The Buddhists have much to add in the matter of image formation yet the “team” steadfastly avoids soliciting their input. What is wrong with this picture?.","date":"2014-06-08","mins":"8:44 am","url":"https://shroudstory.com/2014/06/08/answering-charges-of-pseudoscience-bias-and-more/","cat":"news_&_views","title":"Answering Charges of Pseudoscience, Bias and More"},{"id":"comment-20361","author":"tom_devins","post":"The image on the Shroud was created when Jesus’ body dissolved into a stream of radiation, creating a photographic negative on the cloth. Called the Rainbow Body, it has occurred thousands of times in the past in the Tibetan Buddhist tradition, the most recent being in September, 1998 by the Buddhist monk Khenpo A Chos. Other examples of Rainbow Body in the Christian tradition are Enoch, Elijah and possibly Moses. The non cannonical reports of Mary’s death, called the Assumption, indicate that she too acquired Rainbow Body. In late August of 1998, A Chos told his disciples he was going to leave this world. Without signs of any illness he passed peacefully and comfortably while chanting a mantra. Following Buddhist tradition his body was covered in a yellow cloth whereupon it was noticed that his now unwrinkled skin had turned a soft, pinkish color. As days passed his body continually shrank to childlike proportions until finally, on the seventh day, it completely disappeared. During this seven day period outsiders noted a display of rainbow colored radiation coming from the burial hut. The truth is, something very significant and natural happens to the human body when it is exposed to a lifestyle of selflessness and love and compassion to others, all taken to the extreme and demonstrated in an unwavering commitment to a virtuous cause. Such a lifestyle is the common denominator among the Rainbow Body adepts. A human body that vanishes into mid air seems miraculous. However, when viewed from a quantum perspective it all makes sense. Quantum particles of which we (and everything else in the universe) are made cannot exist unless they are observed through human consciousness. Now, one can have an opinion about anything except one cannot have an opinion about fact. And, that atomic particles do not have an independent existence is a proven fact. So, if an atomic particle can be brought into existence by observing it then it necessarily follows that it can be made to disappear by not observing it. And that is exactly what the Rainbow Body adepts do; they stop observing (and catering) to self through extreme asceticism and compassion for others. Atomic particles are nothing more than vibrating energy. So, when they cease to exist the vibrating energy is released into the surrounding area. Jesus’ death was the most spectacular Rainbow Body of them all for his body dissolved in less than thirty six hours while most dissolutions take place in seven days. Thus, the energy that was released as H Is body dissolved was released in a much shorter period of time producing a high intensity radiation. Italian researches at the National Agency for New Technologies have confirmed that linen cloth is sensitive to high intensity radiation. The short nature of His release compared to other adepts confirms Him to be the greatest manifestation of the divine the world has ever seen. And the thing about it is, the Rainbow Body adepts have no special skills or traits. We all come from the factory with the same factory installed equipment. The adepts knew how to bring forth the spiritual component better than most. The question each person has to answer is, “how spiritual do I want to be”? “How much material lifestyle do I want to sacrifice in order to bring forth my innate spiritual nature”? Even though the Catholic Church has studied the strange death of Khenpo A Chos you don’t hear much about it. For its implications are far reaching. It questions the claim of divinity that early Church fathers made on Jesus. Without question the greatest human to ever live, the operative word is “human”. Human yes, divine no. And when that claim is removed the virginity of Mary comes under the microscope, then the notion of original sin and so forth. And the walls come tumbling down. As the Catholic Priest who conducted an on site investigation of Khenpo A Chos death said, “we may have done a number on the flock.” For sure, the words in Genesis, “…and to dust thou shalt return” need to be appended with the words “but only if you so choose.”.","date":"2012-12-13","mins":"11:15 am","url":"https://shroudstory.com/2012/12/13/livescience-goofs-again/","cat":"uncategorized","title":"LiveScience Goofs Again"},{"id":"comment-26894","author":"tom_devins","post":"The quinnipiac poll, like all other polls, failed to ask THE question. Do you believe in karma and reincarnation? Well over 1/2 the world does. The answer makes a huge difference in one’s life. Its one thing to commit a little indiscretion in the hear and now with the understanding that eventually an all loving merciful God will hold you responsible in the here after. It is another to realize that you will need to correct it the next time around in a worldly setting, hopefully in a human body suit. Belief in reincarnation would shut down the travel industry; the notion of a “bucket list”, so prevalent in the thoughts of the seniors who believe you only get one shot at this world, would disappear. Karma and reincarnation are trump cards in the game of human behavior. It is the only question that really needs to be asked..","date":"2013-03-09","mins":"10:25 am","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","title":"But they didn’t ask about the Shroud of Turin"},{"id":"comment-69830","author":"tom_devins","post":"I’ve followed your blog for several years now and it seems to me you are unduly biased, to a fault, toward scientific inquiry. Three key disciplines are missing from the Shroud research teams; 1) a Buddhist Master who understands the practice of Dzogchen and the Buddha’s teachings on Emptiness and the Nature of Mind, 2) a bold, open minded, free thinking Christian theologian to reframe Jesus’ teachings in an Eastern context so that we will know truly who He was and what he taught, and 3) a cell biologist who can can explain why human cells dissolve into their atomic elements (emitting radiation) when exposed to a blood stream that is totally empty of emotion chemicals when all sensory experience ends. Human bodies have been disappearing in a burst of radiation for thousands of years. For sure we know that the words of Genesis 3:19, “You are dust and to dust you shall return” are wrong. They need to be appended with the words, “….unless you so choose.” And, with that change the doctrine of Original Sin and the walls of Christianity come tumbling down. A practicing Catholic for almost 74 years I fear for my religion. It is teetering on the precipice. For years now we have recognized the Shroud as the great evidence in support of Christian teaching. As it turns out, it is its undoing. And therein lies the true roadblock to understanding..","date":"2013-12-29","mins":"11:07 am","url":"https://shroudstory.com/2013/12/29/questions-questions-everywhere-and-not-one-on-the-shroud-of-turin/","cat":"news_&_views","title":"Questions, Questions Everywhere and not one on the Shroud of Turin"},{"id":"comment-79128","author":"tom_devins","post":"Dr. Paolo Di Lazzaro of Italy’s National Agency for New Technologies was able to create many of the Shroud’s body image characteristics by exposing a linen cloth to short, intense bursts of radiation. Most of the Rainbow Body events I know of involve a release of radiation in the visible spectrum; hence the word “Rainbow.” Shardza Gyalteson (1859 1935) died with a Rainbow Body. His followers, fearing loss of relics, interrupted the dissolution process only to find a body the size of a one year old child suspended three feet of the ground wrapped in an envelope of light. The Old Testament prophet Elijah left this world in a whirlwind accompanied by a flaming chariot. In Matthew 28:3 we read that an angel descended to Jesus’ tomb and his (the angel) appearance was like lightening. I think the radiation comes about as the atoms which make up the body revert to their native, low energy state in accordance with the laws of Quantum Mechanics. Atoms are in reality dense energy which gets released in the dissolution process..","date":"2014-02-13","mins":"6:53 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"id":"comment-78998","author":"tom_devins","post":"Google the name “Khenpo A Chos” and you will begin to understand the Shroud is not nearly as mysterious as it is made out to be. If my paper, “Beyond Contemporary Thought” gets accepted I will explain it to you this Fall at the St. Louis conference. An alternate title could be “Where East Meets West.”.","date":"2014-02-13","mins":"9:17 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"id":"comment-79201","author":"tom_devins","post":"Elijah didn’t need a chariot. He vanished in a shower of radiation which the scripture writer described as a fiery chariot. Belief is a huge modifier of perception..","date":"2014-02-13","mins":"10:40 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"id":"comment-79380","author":"tom_devins","post":"Indicative of what? Father Tiso told me (e mail) that funding dried up. As best I can tell, his initial inquiry was funded by the Institute of Noetic Sciences. IONS is the creation of former astronaut Edgar Mitchell to investigate the paranormal. It is Mitchell’s response to some pre planned clairvoyance experiments he was conducting in outer space. The people at IONS tell me their paranormal research program is floundering ( the retreat center is flourishing) because of an overall lack of interest by the public in general. There is a persistent “so what” attitude that is slowing them down. I can assure you Father Tiso is very much convinced of the reality of the Rainbow Body. As you might expect he is reluctant to compare it to Jesus’ resurrection as the phenomenon potentiality undermines fundamental Christian philosophy. A life long Catholic (73 years) I am not as inhibited. If it looks like a duck, walks like a duck and talks like a duck, then, in all probability, it is a duck. As a presenter, I am looking at the upcoming St Louis Shroud conference as my coming out party. In fact, I am considering organizing a Shroud conference on my own. It will be a joint Buddhist Christian endeavor called WHERE EAST MEETS WEST..","date":"2014-02-14","mins":"12:39 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"id":"comment-79063","author":"tom_devins","post":"I’ve identified some 30 incidents of Rainbow Body in the Buddhist, Hindu and Taoist religions. When you study the Eastern doctrines of Emptiness and Nature of Mind and combine them with the core principles of quantum science you find an interesting connection. The Rainbow Body casts a cloud over the Christian doctrines of Original Sin and Resurrection. It is an accepted, matter of fact phenomenon in Himalayan countries. Lest we forget, Biblical heroes Enoch, Elijah, Moses and Mary, in addition to Jesus, all left the planet in very unusual ways. For whatever reason, lives filled with wisdom, love, compassion and detachment cause something strange to happen to human body cells. Witness the 250+ incorruptible bodies found in the Catholic tradition. Here’s hoping I get the opportunity to elaborate on all of this in St. Louis in October..","date":"2014-02-13","mins":"2:55 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"}],"image":[{"id":"comment-24705","author":"tom_devins","post":"I have communicated to Father Tiso by e mail and hope to solicit his help in bringing the Rainbow Body phenomenon to light in the form of a video and/or book. He currently lives in Rome. The phenomenon is real and he most certainly confirms its authenticity. Other Rainbow Body adepts include; Dilgo Khyentze Rinpoche (1992), Togden Ugyen Tendzin (1962), Ayu Khandro Dorje Peldron (1953), Khenchen Tsewang Rigdzin (circa 1953), Yilunga Sonam Namgyel (1952), Pema Dudul (1872), Milarepa (1135), Padmasmbhava (8th century) and in later antiquity, dates uncertain: The Ancient Kings of Tibet, Mamkel Nyingpo and the Eighteen Tamil Siddhas (H Indu). There are more. Those identified were enough to satisfy my needs and I have researched their lives in enough depth to be able to correlate lifestyle with the strange deaths they incurred. I have interviewed a prominent Buddhist scholar who also confirms the phenomena. It is a real thing that happens to ordinary people who choose to walk the difficult walk and not just talk the talk as most of us everyday people do. It is time for the Church to fess up..","date":"2013-02-18","mins":"12:48 pm","url":"https://shroudstory.com/2013/02/18/one-handed-clapping-for-colin-berrys-criticism-of-the-colorado-paper/","cat":"image_theory","title":"One Handed Clapping for Colin Berry’s Criticism of the Colorado Paper"},{"id":"comment-24690","author":"tom_devins","post":"I have comment on this before but can’t seem to get recognition or rebuttal. In September, 1998 the Buddhist Monk Khenpo A Chos acquired Rainbow Body. At death (if in fact he ever stopped breathing) over a period of seven days his body proportionately shrunk to the point that it finally disappeared. The shrinkage was accompanied by the display of multi colored radiation, hence the name Rainbow Body. It is also referred to as the Light Body and the adepts, of which there are thousands, also have the ability to re materialize in the confines of space and time. The phenomena occurs also occurs in the Hindu tradition and reminds us too of the strange deaths of Enoch, Elijah, Moses, Mary and Jesus. Father Francis Tiso (who has impeccable scholarly credentials) visited Khenpo A Chos’ hermitage at which the disappearance took place and confirmed its authenticity. Google his name and read for yourself. All the adepts from contemporary to antiquity had one thing in common; lifestyle of love, compassion and asceticism taken to the extreme. These are virtues that we can also assign to the Old and New Testament figures who experienced Rainbow Body like deaths and are available to every living creature that chooses the path. These qualities, taken together, result in the absolute destruction of ego. Said another way, they indicate the cessation of observation of self. From quantum physics (i.e. The Thomas Young Double Slit Experiment) we know that in the atomic realm, when human consciousness ceases to observe something, that something ceases to exist. It returns to the realm of invisible wave, formless and everywhere at the same time, releasing the energy that it held when it existed in form and substance. The most plausible explanation for the image on the Shroud is that Jesus achieved Rainbow Body and the burst of radiation that followed produced a scorching effect on the burial cloth. This conclusion is a bitter pill to swallow as it sends shock waves through fundamental Christian thought, from the alpha to the omega, the story of creation to that of resurrection of the body. For sure, whether one imputes Rainbow Body to Jesus or not, the words in Genesis “to dust you shall return” need to be appended with the words, “but only if you so choose.” And once you do, it is all downhill from there for the Christian theologian..","date":"2013-02-18","mins":"10:46 am","url":"https://shroudstory.com/2013/02/18/one-handed-clapping-for-colin-berrys-criticism-of-the-colorado-paper/","cat":"image_theory","title":"One Handed Clapping for Colin Berry’s Criticism of the Colorado Paper"}],"researchers":[{"id":"comment-103550","author":"tom_devins","post":"Wild Turkey is made in Kentucky, not Virginia..","date":"2014-04-25","mins":"7:44 am","url":"https://shroudstory.com/2014/04/25/some-advice-from-stephen-jones/","cat":"other_blogs","title":"Some Advice from Stephen Jones"},{"id":"comment-19915","author":"tom_devins","post":"I think Di Lazzaro’s work is in the right direction. There is a mysterious, well documented phenomena in Tibetan Buddhist culture called the Rainbow Body. It is where the bodies of adepts who have achieved a high degree of spiritual awareness simply disappear at death, vanishing in a shower of multi colored light. Hence the name Rainbow Body. Jesus, being fully developed spiritually by following the same ascetic, selfless, compassion laced life style as the Buddhist counterparts, may have attained a Rainbow Body (Resurrection in the Christian tradition.) Typically the Buddhist adept’s body dissolves in seven days. Jesus’ body dissolved in thirty six hours or less. This could point to a higher frequency radiation in the Resurrection than in the Buddhist tradition. The point is, the human body can be a source of light, adding credibility to the notion that the image on the Shroud was somehow produced by a sudden burst of radiation..","date":"2012-12-06","mins":"10:05 am","url":"https://shroudstory.com/2011/12/30/an-interview-with-paolo-di-lazzaro/","cat":"news_&_views","title":"An Interview with Paolo Di Lazzaro"}],"resources":[{"id":"comment-24274","author":"tom_devins","post":"I am strongly offended that anyone would summarily and insultingly dismiss another person’s ideas, calling them “goof ball”, in face of a large body of supporting evidence. It makes me wonder who is the real “goof ball” in the dialogue. I don’t know, nor does anyone know with certainty, where Jesus is buried… if He is buried at all. The connection between East and Christianity is a lot stronger than most people realize. In the East’s ancient structures we find an abundance of Greco Roman architecture. There are lot of people in the East who believe Jesus’ tomb is in Kashmir and have located and revere it. Murree beer in Pakistan is named after Mary. According to the Pakistanis her grave is located in their country. The names Abraham and Sara are curiously similar to the names of the Hindu God Brahma and his wife Sarasvati. Hebrews eat beef but do not worship cows. Hindu’s worship cows but do not eat beef. After all, the Messiah’s job description included the duties of gathering in the lost tribes and a trip to the East would be of necessity. The 4,000 mile Silk Road from China to Alexandria was an active avenue that blossomed with trade and cultural exchange. That is what traders do when the merchant deal is completed; they celebrate over a beer or two and exchange ideas. You know, Abraham did dispatch some of his sons to the East. St. John Chrysostom in his Homily 26 from The Homily of Hebrews tells us the bones of Moses were laid in a strange [East] land. The seraph used by Moses for healing (Numbers 221:8) is taken straight from the ancient Buddhist Hindu practice of Kundalini Yoga. What is “goof ball” is to believe that an unbelievably talented thirteen year old kid could stand toe to toe with Temple scholars debating scripture and then spend the next seventeen years of His life in the boon docks of Nazareth, “growing in strength and wisdom” while happily working away in his father’s carpenter shop; a whistle while you whittle kind of upbringing. If Jesus didn’t die in the East could he have spent time there? Occult skills, like food multiplication, healing and so forth are acquired and emerging skills available to saintly people and in the ancient East there were many schools for that purpose. The great Buddhist Saint Milarepa attended one and acquired magical skills which he used to extract revenge against his family’s enemies. Moses had them and used them effectively against the Pharaoh. What is equally “goof ball” is to not ask the question, if Jesus acquired the resurrected body He is said to have acquired, then why did the stone need to be rolled away from the tomb? Doors, walls and grave stones don’t mean anything to spirits. If the full Sanhedrin had voted on Jesus’ fate the vote would have been 69 to 2 in favor of executing him. The abstainers…..Nicodemus and Joseph of Arimathea. Did Joseph of Arimathea, wealthy and influential as he was, work a deal with Pilate? After all, Pilate’s wife advised against the guilty verdict because of a dream she had. Pilate did what He did, at least in part, in order to avoid a riot in a population that was swollen because of the Passover Feast. How come Jesus died so quickly on the cross? Death from crucifixion could take days. Why is it the two thieves were alive at the end of the day but not Jesus? Can blood gush from the wounds of a dead man? Why wasn’t His body dumped into a heap along with the bodies of the two thieves (and their broken legs) to be consumed by scavenging creatures as was the practice? Why weren’t His disciples and relatives rounded up, their wealth confiscated and then sold into slavery as was Roman practice? When one man and a small army revolted in Sepphoris in 6 AD, the then capital of Galilee with a population of 30,000, the Romans crucified 2,000 men, sold the residents into slavery and burned the city to the ground. The Romans were brutal. Perhaps a deal was struck between Joseph and Pilate. Just maybe, just maybe, Jesus wasn’t dead when taken from the cross. Maybe after all he didn’t refuse the soothing “medication” that was offered to Him at the outset. Maybe the image on the Shroud was created in the same fashion as the one He deposited on the veil of Veronica while He was alive. Maybe the gospel writers, in their enthusiasm for promoting their brand of Christianity, got carried away with their work. Who knows? Who will ever know? The facts and reasonable (but unanswered) questions at least suggest other possibilities for explaining Jesus’ death and resurrection. Where there is smoke there is usually fire. Lets be more accepting of the opinion of others and stop from calling “goof ball” those who have legitimate concerns and the courage to raise them..","date":"2013-02-14","mins":"3:50 pm","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","title":"The Evidence Strongly Suggests Nothing of the Kind"},{"id":"comment-24441","author":"tom_devins","post":"You know, I just don’t know. I have ordered Silvia’s book because I am interested in the subject. Last September I had the privilege of sitting next to a thirteen year old boy named Norpa Rinpoche at the Buddhist Drikung Monastery about 50 miles from Lhasa. He is said to be the reincarnate of the monastery’s abbott who passed away 30 years ago. Being the ignorant, uninformed Westerner that I am I asked his superior, “how do you know?” Reincarnation is such an accepted belief among Easterners that the question is just not asked. It is not a belief; it is a way of life. At age 3 Norpa Rinpoche identified the home in which the deceased abbott was born. At age 7 he picked out the abbott’s personal effects from an assortment of the personal effects of others, all mixed together randomly. I was told that a review of the deceased’s writings also pointed to Norpa Rinpoche as his reincarnate. The Tibetan Buddhists are closely monitored by the Chinese who, among other controls over Tibetan religious expression, require that all reincarnates be approved as such by the government. After documenting the case the Chinese approved Norpa Rinpoche as a reincarnate. For me personally, while I am not quiet sure if reincarnation is real of not, I can’t afford to be wrong. If I do return I want to bring as much of what I have learned in this life back with me and am living accordingly, making sure that I have sufficient mind control to deal with the barrage of thoughts that will hit me when that last breath is taken. My Christian belief that you get one and only one shot at life gave rise to a “bucket list” and the need to cram as much worldly experience as I can into my one and only lifetime. Needless to say, the first think to hit the trash can in my preparation for death(I am 72 years young) was my bucket list, replaced by meditation exercises. I am afraid the Western travel and entertainment industry would be devastated if everyone adopted reincarnation..","date":"2013-02-16","mins":"10:31 am","url":"https://shroudstory.com/2013/02/16/tinfoil-hats-all-around-quickly/","cat":"books","title":"Tinfoil Hats All Around, Quickly"}]}
