{"art":[{"id":"comment-103500","author":"tristan_casabianca","post":"Dan, A letter to the editor has published in Injury in response to Bevilacqua’s paper. The article is behind a paywall ( http://www.injuryjournal.com/article/S0020 1383(14)00115 6/abstract ).","date":"2014-04-25","mins":"4:50 am","url":"https://shroudstory.com/2014/04/25/paper-chase-pam-moon-suggests-lucas-cranach-the-elder-painted-the-lier-copy/","cat":"art","title":"Paper Chase:  Pam Moon Suggests Lucas Cranach the Elder Painted the Lier Copy"},{"id":"comment-133302","author":"tristan_casabianca","post":"Daveb, you can will find an answer to your question here: http://www.elpenor.org/athos/en/e218ck20.asp “The work appears to belong to two different periods, with sections of an older epitaphios, apparently damaged or worn, having been patched on the red silk. Both the large ‘linen cloth’ impinging on the symbols of the Evangelists in the lower corners and disrupting the balance of the composition, and the second border, seem to indicate that the figure of Christ was not part of the initial design. The iconographic theme is the symbolic representation of the sacrificial Lamb, surrounded by angelic hosts and the symbols of the Evangelists. The symmetrical composition, with the horizontal shroud (in some examples the sepulchre), the two angel deacons with their liturgical fans venerating behind, the symbols of the Evangelists in the corners, and the ornamental motifs on the ground and the inner border recur in a series of fourteenth century epitaphioi studied by Millet. A variation of the spiral motif decorating the arcs in the corners appears on the collar of a sakkos in the Vatican (14th c.) and on the epigonation of Metropolitan Anthimos in the Tismana Monastery (1370): these comparanda may indicate the approximate date of the earlier epitaphios. For the later work, comparisons may be made with the epitaphios of Metropolitan Makarios of Moldavia Wallachia (1428) and those in the Meteora Monastery and in the Church of St Nicholas Radaut (today the Museum of Sucevita), although an even more recent ‘renovation’ based on older models cannot be excluded.”.","date":"2014-06-28","mins":"9:35 am","url":"https://shroudstory.com/2014/06/28/comment-promoted-the-stavronikita-epitaphios/","cat":"art","title":"Comment Promoted:  The Stavronikita Epitaphios"},{"id":"comment-132338","author":"tristan_casabianca","post":"Here is the point of view of french medievist Emmanuel Poulle on the Pray Codex and the Turin Shroud (“Les sources de l’histoire du linceul : revue critique”, Revue d’histoire ecclésiastique, 2009, p. 773). He was almost certain that the Pray Codex represented the Turin Shroud. Poulle made a very interesting comparison with the holes visible in the Lierre Copy in 1516. (sorry, just in french) “Ce manuscrit Pray […] aujourd’hui conservé à Budapest et dont la provenance originale est hongroise, contient une série de cinq dessins consacrés à la Passion, dont le quatrième représente l’arrivée des saintes femmes au tombeau du Christ; y figure en bonne place une représentation du Linceul dans le sépulcre vide, représentation que des indices permettent d’identifier de façon quasi certaine comme figurant le Linceul aujourd’hui conservé à Turin : sur le dessin du Linceul ont été tracées en effet deux séries (une complète et une partielle) de quatre trous disposés en forme de L qui se retrouvent, en quatre emplacements symétriques, sur le Linceul aujourd’hui à Turin, et qu’on ne voit sur aucun des autres prétendus linceuls, sinon sur celui d’une copie du début du 16e siècle conservé à Lierre en Belgique, et qui est une copie, reconnue comme telle, du Linceul alors détenu par la maison de Savoie ; on ignore la raison de ces trous, qui sont vraisemblablement le résultat d’un accident dérisoire, mais les dessinateurs, celui du Codex Pray et de la copie de Lierre, ont eu conscience que ces petits trous sans importance faisaient partie intrinsèque du Linceul qu’ils reproduisaient.” \b\u0011.","date":"2014-06-22","mins":"2:53 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133239","author":"tristan_casabianca","post":"Of course you can prove a negative! 1) You can “prove” (strong sense) that something is a self contradiction, therefore does not exist: a married bachelor. 2) You can “prove” (weak sense) that something does not exist with an inductive argument. See, for example, Steven D. Hales, in Think, 2005: “So why is it that people insist that you can’t prove a negative? I think it is the result of two things. (1) an acknowledgement that induction is not bulletproof, airtight, and infallible, and (2) a desperate desire to keep believing whatever one believes, even if all the evidence is against it.” Or, in a nutshell, from a William Craig’s debate: “a popular line you hear on a popular level all the time, but that sophisticated atheists don’t take”..","date":"2014-06-28","mins":"3:13 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133247","author":"tristan_casabianca","post":"Colin, “no one can be reasonably expected to prove a negative”: thus, according to you, no one can be reasonably expected to prove that Napoleon Bonaparte was not born in the 17th century? Hmmm…. “one must surely agree that the [claims for congruence] fall short of proof” : quite the contrary. According to my knowledge of the fields (historiography, medieval period, etc.) i think the evidence compelling : there is a link between the TS and the HPM. And indeed many experts, believers and unbelievers, agree with me: I mentioned medievist Emmanuel Poulle ( https://fr.wikipedia.org/wiki/Emmanuel Poulle ), others mentioned de Wesselow, etc..","date":"2014-06-28","mins":"4:32 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132989","author":"tristan_casabianca","post":"Hugh, the defence of your point of view is desperate, really… Over skepticism kills skepticism..","date":"2014-06-26","mins":"5:37 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132006","author":"tristan_casabianca","post":"Don’t you think that your probabilistic approach should be based on Bayes’ theorem? Otherwise, it just sounds like “dwindling probabilities”..","date":"2014-06-21","mins":"5:04 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"}],"dating":[{"id":"comment-209795","author":"tristan_casabianca","post":"So, Marco, when you wrote your paper, you never studied Rogers’ writings in A chemist’s Perspective, because, according to you, your editorial was focused on Rogers’ article in TA and therefore Rogers’ book was “irrelevant”? I’m not sure this argument based on a serious lack of research is good for your case..","date":"2015-09-07","mins":"1:01 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209601","author":"tristan_casabianca","post":"I’m not a chemist, so, at first glance, I’m being disturbed by some of their references: they don’t mention Benford and Marino’s article on discrepancies in the radiocarbon dating area published in Chemistry Today, but they quote their first papers already mentioned by Rogers in 2005? Why (real question, no irony)? Is it because Quad mosaic analysis doesn’t fit well with their sentence:”Among those [theories], a popular one is the so called “invisible mending”, disclosed by S. Benford and J. Marino and based on the analysis of low resolution (JPEG format) pictures of the Shroud”? They don’t want to engage with other confirmations (Villarreal), they don’t want to mention other results (Riani’s article in Statistics and Computing). By the way, I hope that this editorial was not reviewed by a historian… Look at the “medieval” title, and look at this sentence: “According to these authors [Benford and Marino], the part of the Shroud from where a C14 sample was obtained does not belong to the main linen, but is a Middle Age addition which precisely matches the kind of weaving, and moreover has been painted to exactly match the color of the main Shroud. ” But of course Benford and Marino, in the same paper quoted by Bella et alii, deal explicitely with the art of tapestry in the Renaissance. They knew the difference between the Middle Ages and the Renaissance… It’s not so difficult to grasp ;) So, why was “medieval” added in the title, when it’s not even in the quotation given above (just “invisible mending”)?.","date":"2015-09-04","mins":"2:09 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209612","author":"tristan_casabianca","post":"Just to be sure, Marco, even after reading Rogers’ book pp. 53 54 (google books is your friend), do you still maintain that you are correct? Because I tend to think that Thibault is right. It seems to me that your medieval blunder is maybe not the only one….","date":"2015-09-04","mins":"4:54 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209832","author":"tristan_casabianca","post":"Marco, I don’t want be too harsh, but before writing on a topic, even for an “editorial”, you have to be at least familiar with it. Otherwise it looks much more like a lampoon than an editorial. Your “medieval” blunder is horrific and demonstrates that you don’t know the topic in and out, to say the least. Your misintepretation of the data in a paragraph was easily detected within a couple of minutes by Thibault. Why? Because he knows the topic in and out. I guess that before this week you never opened Rogers’ book… This not how serious science works: You should have been more familiar with the bibliography. It’s the beginning of all serious research, or all good editorial in a peer review. Mi dispiace..","date":"2015-09-07","mins":"12:51 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209644","author":"tristan_casabianca","post":"Sorry Hugh, i’m not convinced so far (quite the contrary). I think the first diagram does not come from blood area. Rogers is 100% clear in his book. Rogers, Achemist’s perspective, p. 54: “Figure VIII 3 [figure 4 in Thermochimica acta] shows a mass spectrum that was taken when the first decomposition products started to appear over a sample image fibers. The sample appears to be nearly pure polyhexose material, e.g. Cellose. There is a significant peak at m/e 126 (hydroxyméthylfurfural) but there is not much at m/e 96 (furfural). The shroud is nearly pure linen, but linen is not pure celluose like cotton”. The legend of diagram: “Mass spectrum obtained by from the pyrolisis of sugars from Shroud image sample 1 EB. The sample didi not contain any pentose sugars”. As already stated by Thibault, Rogers explicitly writes that sample 1 EB comes from a image area, with no blood, no schorch, no water (p. 53). Https://books.google.fr/books?isbn=0615239285.","date":"2015-09-05","mins":"5:29 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-210345","author":"tristan_casabianca","post":"According to Bella, “Of course, no one was able to criticize the key findings of [their] work” on this blog!!! His definition of “pseudoscience” shows clearly that, unfortunately, you don’t need to understand philosophy of science to become a chemist..","date":"2015-09-14","mins":"4:44 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"}],"blood":[{"id":"comment-129340","author":"tristan_casabianca","post":"To call this “stochastic process” a “natural stochastic process” is of course excessive. Look at the sentence in the introduction: “the hypothesis involving an artistic forgery or a miraculous event must be discarded”. It is in my humble opinion far beyond what a scientist with just a possible explanation (and no definition of what a miracle is) is entitled to write. This stochastic process could be a part of the answer, I really don’t know. But if we are talking of the burial cloth of Jesus, then you have a big problem with this “natural stochastic process”: you first have to assume that the tomb of Jesus wasn’t found empty… and this goes against the consensus view of New Testament scholars. ..","date":"2014-06-14","mins":"3:46 am","url":"https://shroudstory.com/2014/06/14/paper-chase-a-natural-stochastic-process-may-explain-the-coexistence-of-bloodstains-and-an-image-on-the-shroud-of-turin/","cat":"blood_studies","title":"Paper Chase:  A Natural Stochastic Process May Explain the Coexistence of Bloodstains and an Image on the Shroud of Turin"}],"dna":[{"id":"comment-211879","author":"tristan_casabianca","post":"Of course, what strikes me the most are not the cautious conclusions, but the simple fact that this kind of paper could be accepted in a Nature Journal with direct references to Riani, Rogers and Poulle. I think that the results regarding Plants Dna should now be compared with a new paper just published in a much less serious peer reviewed (?) journal: Gérard Lucotte, “Exploration of the Face of the Turin Shroud. Pollens Studied by SEM Analysis”, Archeological Discovery, 3, 4, 2015. Http://www.scirp.org/journal/Paper Information.aspx?Paper ID=60135 And another fresh peer reviewed paper also here, on pareidolia and the TS: Sheen, M., & Jordan, T. R. (2015). Effects of Contextual Information on Seeing Pareidolic Religious Inscriptions on an Artifact: Implications for the Shroud of Turin. Perception, 0301006615607156. Http://pec.sagepub.com/content/early/2015/09/30/0301006615607156.abstract.","date":"2015-10-06","mins":"5:14 am","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"}],"history":[{"id":"comment-101311","author":"tristan_casabianca","post":"For camels in Israel, don’t generalize. Many scholars think that camel domestication in Genesis is not an anachronism. Http://www.christianitytoday.com/ct/2014/february web only/latest challenge bible accuracy abraham anachronistic camel.html.","date":"2014-04-19","mins":"12:33 pm","url":"https://shroudstory.com/2014/04/19/happy-easter-from-discovery/","cat":"history","title":"Happy Easter from Discovery"},{"id":"comment-72428","author":"tristan_casabianca","post":"@O.K. : “There are no HISTORICAL FACTS per se, only facts that were described in historical sources. ” So glad to meet the last postmodernist! ;).","date":"2014-01-06","mins":"4:07 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"}],"image":[{"id":"comment-39336","author":"tristan_casabianca","post":"I think we have a lot of good reasons for associating something supernatural with the shroud.The result is really clear when you apply the classical criteria of historical assessment. Http://onlinelibrary.wiley.com/doi/10.1111/heyj.12014/abstract.","date":"2013-07-20","mins":"11:25 am","url":"https://shroudstory.com/2013/07/20/any-good-reasons-for-associating-anything-supernatural-with-the-shroud/","cat":"image_theory","title":"Any good reasons for associating anything supernatural with the shroud?"},{"id":"comment-91475","author":"tristan_casabianca","post":"Daveb, I have never said that the Resurrection hypothesis was “a fact”, only the most likely… it’s quite different If you have not read it, I cansend you my article published last year (The Shroud of Turin: A historiographical approach”)..","date":"2014-03-21","mins":"4:06 am","url":"https://shroudstory.com/2014/03/20/comment-promoted-another-hypothesis-about-the-image-formation/","cat":"image_theory","title":"Comment Promoted:  Another hypothesis about the image formation"},{"id":"comment-91324","author":"tristan_casabianca","post":"Hugh, i think that the main interest of this short peer reviewed communication is to show us, once again, how unlikely the “natural” hypothesis is. You need a set of circumstances that is fantastically low. And a side interest of the paper : new forensic experts who say there was a corpse (not a giant bas relief made by an unknown genius…) in the shroud..","date":"2014-03-20","mins":"6:44 pm","url":"https://shroudstory.com/2014/03/20/comment-promoted-another-hypothesis-about-the-image-formation/","cat":"image_theory","title":"Comment Promoted:  Another hypothesis about the image formation"},{"id":"comment-91446","author":"tristan_casabianca","post":"Oh I do think the natural hypothesis is totally unconvincing/unlikely: its plausibility (does our knowledge in other fields support or reinforce the hypothesis?) is clearly insufficient : the image on the shroud is unique. The natural hypothesis relies on unverified and complicated data (with the corona hypothesis, you need an earthquake at the right time and place). If the man on the shroud is Jesus, the Natural hypothesis cannot explain historical facts widely accepted by New Testament scholars: the empty tomb, the early paulinian creed (1 Co 15, 3 7) which appeared in the first decade after the crucifixion..","date":"2014-03-21","mins":"2:29 am","url":"https://shroudstory.com/2014/03/20/comment-promoted-another-hypothesis-about-the-image-formation/","cat":"image_theory","title":"Comment Promoted:  Another hypothesis about the image formation"}],"misc":[{"id":"comment-56797","author":"tristan_casabianca","post":"Maybe some statements are inaccurate, but they are not misleading. Habermas is right : the Turin Shroud is significant, especially in our secular society. Much more than that, the TS is significant because it gives to the historian (and to the apologist) an other very good reason for thinking that Jesus rose from the dead..","date":"2013-12-05","mins":"4:13 pm","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes"},{"id":"comment-72511","author":"tristan_casabianca","post":"John, I think the criterion of simplicity is not the only one, and not even the most important of all. According to Christopher B. Mac Cullagh you have (Justifying historical descriptions, p.28), in decreasing order: 1) plausibility: does our knowledge in other well known fields support or reinforce the hypothesis? 2) Explanatory scope: can the hypothesis do justice to all the facts? 3) Explanatory power: the hypothesis has to be specific and accurate, rather than ambiguous. 4) Less ad hoc: ceteris paribus, the hypothesis should not invoke or rely on unverified data (this includes the criterion of simplicity)..","date":"2014-01-07","mins":"5:10 pm","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","title":"Keep it Simple: Can Anyone Help?"}],"opinion":[{"id":"comment-214352","author":"tristan_casabianca","post":"I agree. “Extraordinary” claims do not require “extraordinary” evidence. It’s not the way it works. Cf. My article here that also deals with bayesian probability: The Shroud of Turin, The Resurrection of Jesus and the Realm of Science: One View of the Cathedral. Http://www.academia.edu/8531212/The Shroud of Turin the Resurrection of Jesus and the Realm of Science One View of the Cathedral.","date":"2015-11-07","mins":"9:43 am","url":"https://shroudstory.com/2015/11/07/a-guest-posting-by-o-k/","cat":"guest_posting","title":"A Guest Posting by O.K."},{"id":"comment-65126","author":"tristan_casabianca","post":"Kelly, your point 3 refers to what theologians and philosophers call “the argument from experience”. If it is a powerful argument for yourself (unless and until you have a good reason for thinking you are deluded), it is not an argument based on a logical reasoning, it is not an argument that can convince even an unbeliever. And muslims or hindus can describe the same kind of fruitful transformations. Look at an argument from history. If we use traditional criteria of historical assessment, we can be pretty sure that the Turin shroud is the burial cloth of Jesus of Nazareth. But much more that that, the probability that the image is the consequence of the bodily resurrection of Jesus of Nazareth is very high. An extract of the conclusion of my article published this year in the Heythrop Journal: “As judged by our current knowledge, [the Resurrection Hypothesis] is the most likely of the three hypotheses that have come under scrutiny [Garlaschelli Hypothesis and Natural Hypothesis]. Its level of plausibility is high, which is not the case for the other two hypotheses. Its explanatory scope does not constitute a major obstacle, although its explanatory power could be improved. It is less ad hoc than its rivals and offers the possibility of a substantive illumination on related fields of research. This does not mean, however, that the RH is proven to be historical; it is simply the most likely hypothesis when we adopt a Minimal Facts approach to test for the best explanation.” http://onlinelibrary.wiley.com/doi/10.1111/heyj.12014/abstract.","date":"2013-12-22","mins":"3:34 pm","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-201310","author":"tristan_casabianca","post":"Bonjour Yannick ! I think that your “semi natural hypothesis”, semi because it leaves the door open for Jesus’ resurrection, is interesting but contrived. It is strongly ad hoc (“who knows if”…). Moreover, one possibility offered by your semi natural hypothesis (“manual extraction”) doesn’t take into account an uncontroversial fact: the empty tomb. Best, Tristan..","date":"2015-06-08","mins":"6:19 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"}],"researchers":[{"id":"comment-57110","author":"tristan_casabianca","post":"Fanti, Malfi, A new cyclic loads machine for the measurement of micro mechanical properties of single flax fibers coming from the Turin Shroud, AIMETA, http://www.aimetatorino2013.it/cdrom/cdrom pdf fullpaper/001200008502.pdf Fazio, Malfi, “Multi parametric micro mechanical dating of single fibers coming from ancient flax textiles”, Textile Research Journal, 2013, http://trj.sagepub.com/content/early/2013/11/19/0040517513507366.abstract.","date":"2013-12-07","mins":"11:53 am","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-57128","author":"tristan_casabianca","post":"Thank you Hugh! I think there is another paper unknown to shroudies: Bevilacqua, Fanti, D’Arienzo, De Caro, “Do we really need new medical information about the Turin Shroud?”, Injury, 2013, http://www.sciencedirect.com/science/article/pii/S0020138313004221.","date":"2013-12-07","mins":"2:20 pm","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-57125","author":"tristan_casabianca","post":"The first author of the second ref. Is of course Giulio Fanti, and not Giovanni Fazio ! Sorry !.","date":"2013-12-07","mins":"1:57 pm","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"}],"resources":[{"id":"comment-115185","author":"tristan_casabianca","post":"Dan, it’s not new at all, the study (at least its first part) has been published online in 2013 and mentioned in your blog. A letter to the editor, by spanish experts in orthopaedics and traumatology, has already been published. For example, on the right shoulder dislocation, they write : “The image of both the shoulders on the Shroud is destroyed due to burn damage. So, any deductions made about the shoulders are based upon the angle formed by the upper edge of the trapezius muscle as compared to the contralateral side. In addition, it does not deﬁne the exact placement of the humeral head centre. The authors proposed an alternative interpretation of an anterior dislocation that could be consistent with an indirect mechanism of dislocation (as provoked by a fall during which the right hand came into contact with the ﬂoor). It could be argued that the movements, traction needed, and position in cruciﬁxion could reduce the dislocation if it was present. Alternatively, it also could be stated that the traction exerted during cruciﬁxion could dislocate the shoulder due to body weight as well. However, in this case, the dislocation would be inferior” Caja VL, Reverte Vinaixa MM. ‘‘Do we really need new medical information about the Turin Shroud?’’ published in Injury journal (Injury 2014; 45: 460–4) by Bevilacqua M, Fanti G, D’Arienzo M, and De Caro R. Injury (2014). Http://www.injuryjournal.com/article/S0020 1383(14)00115 6/abstract.","date":"2014-05-09","mins":"2:33 am","url":"https://shroudstory.com/2014/05/08/breaking-news-new-injury-details-seen-on-the-shroud-of-turin/","cat":"article","title":"Breaking News:  New Injury Details Seen on the Shroud of Turin"},{"id":"comment-91165","author":"tristan_casabianca","post":"Another hypothesis about the image formation process has just been published in a peer reviewed journal : Forensic Science, Medicine and Pathology : Tattoli, Tsokos, Buschmann, “Could the Shroud of Turin be an effect of post mortem changes?” You can have a free access to the first two pages. Http://link.springer.com/article/10.1007/s12024 014 9547 6#page 1 (parental discretion advised).","date":"2014-03-20","mins":"9:02 am","url":"https://shroudstory.com/2014/03/20/from-gethsemane-to-the-tomb/","cat":"article","title":"From Gethsemane to the Tomb"},{"id":"comment-79747","author":"tristan_casabianca","post":"Of course, the reference to Dante has a devastating effect on the credibility of the paper… What a shame… But, if we are fair minded, we have to say that neither the 11th on the Richter scale nor the “Dante effect”, have no impact whatsoever on the validity of the scientific conclusion (the possible effects of a 8 9 Richter Scale earthquake on the radiodatation of the shroud). By the way, Achenbach knows perfectly well (I hope) that Meccanica is a good peer reviewed journal and not open access (http://www.scimagojr.com/journalsearch.php?q=14471&tip=sid&clean=0). So why does he suggest the contrary? This is bad journalism (and bad faith?)..","date":"2014-02-16","mins":"4:14 am","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism"},{"id":"comment-171549","author":"tristan_casabianca","post":"Ockham’s razor (criterion of simplicity) is not at all the main weapon in the hands of historians and philosophers. For sure, it is the most popular, the most discussed, but not the most important. From my article published last year in the Heythrop Journal (“The Shroud of Turin: A Historiographical Approach”): “Historical criteria do not fall from the sky; they are part of a slowly built up methodology routinely used by historians, whatever may be their opinion on the subject being discussed. This article will use criteria specified by Christopher Behan Mc Cullagh. One can list these in order of priority from the most important to the least; this list, while not written in stone, provides a general idea of the most important conditions to satisfy. Thus one has: 1) plausibility: does our knowledge in other well known fields support or reinforce the hypothesis? 2) Explanatory scope: can the hypothesis do justice to all the facts? 3) Explanatory power: the hypothesis has to be specific and accurate, rather than ambiguous. 4) Less ad hoc: ceteris paribus, the hypothesis should not invoke or rely on unverified data (this includes the criterion of simplicity). 5) Illumination: does the hypothesis shed light on other widely accepted phenomena? This last criterion was added by Licona who believes it contributes further specification.”.","date":"2014-11-16","mins":"6:41 am","url":"https://shroudstory.com/2014/11/16/maybe-friar-ockham-was-wrong/","cat":"books","title":"Maybe Friar Ockham was wrong"},{"id":"comment-125859","author":"tristan_casabianca","post":"It’s simply because Craig follows a “Minimal facts approach”, that takes only into account historical data receiving the widest consensus among scholars (Jesus’ crucifixion, Paul’s conversion, the empty tomb, the rapid spread of christianity). Therefore he does not need the TS to prove the death of Jesus. Virtually all scholars already agree : Jesus died by crucifixion around 30 AD. Craig is familiar with the shroud : “The mystery of the shroud still remains. If it is a forgery nobody knows how it was done. It is so totally unlike medieval paintings of that time. If you’ve ever seen pre Renaissance paintings, the figures almost look like flat cartoon figures without any perspective, whereas the man on the shroud is anatomically accurate. It’s quite a striking image. So some scholars who’ve been working on this whole shroud thing believe the carbon 14 test may have been skewed in some way because the shroud was damaged by fire around the 1500s. When the nuns repaired the shroud, they may have interwoven cloth into the fabric of the shroud in order to repair tears, patches or rips. It may be where they took the piece, a centimeter square piece of the hem of the shroud, some would suggest, that this may have been part of the repair work on the edge rather than the original fabric. So they want to rerun the test, but the Catholic Church doesn’t permit it because when you carbon date these things it destroys the sample, and so for them it’s destroying this precious relic. It’s sacred so they don’t want people doing it. The Church hasn’t agreed to letting it be done again, but until those carbon dating tests are reversed, I think one can’t say that the shroud is authentic. You would need to have those tests somehow shown to be erroneous. Apart from those tests, the signs of authenticity on the shroud are quite remarkable.” http://www.reasonablefaith.org/forum on the resurrection with william lane craig#ixzz33 Gojw L9i.","date":"2014-05-31","mins":"2:39 am","url":"https://shroudstory.com/2014/05/30/bradley-bowen-craig-knows-better-than-to-put-the-shroud-of-turin-forward-as-historical-evidence/","cat":"books","title":"Bradley Bowen: Craig knows better than to put the Shroud of Turin forward as historical evidence"},{"id":"comment-214489","author":"tristan_casabianca","post":"I really don’t know if there are writings on the shroud. But I what I do know is that there is a significative difference between young students (less than 22 years old) unaware of pareidolia, like in this study, and professional optical engineers and historians well aware of this psychological phenomenon..","date":"2015-11-11","mins":"6:19 am","url":"https://shroudstory.com/2015/11/11/psychological-influences-in-seeing-inscriptions-on-the-shroud-of-turin/","cat":"paper_chase","title":"Psychological Influences in Seeing Inscriptions on the Shroud of Turin"}]}
