{"art":[{"author":"vina","post":"Colton Burpo is similar to what happen to my Daughter 3/04/1993 she had a vision when she had a fight with a classmate she went to say sorry to the girl and after that it happen there’s a pole that she hold on all of a sudden she went to trance and she cant open her eyes.the vision starts she was on the cross looking down and sees all the people beneath the cross they were wearing long white clothes and wearing sandals.brought her to the bear cave thats what she called and lay her on the rock bed. she saw 2 angels and told her to raise her hands she was raising up(sorry about my grammar english is second language but i will try my best to recall what she told me she was 10yrs old back then).when they are near heaven she said that heaven is so bright that she forgot her sunglasses. when she entered heaven the angel shout who can open the book.the book was sealed she said me she did and her face became red to wash the redness she went the pond and redness came out she said behind the throne there’ rainbow and the ponds have a lot of different fishes to it.and God show her how the earth was made she was looking for the map of Florida back then florida did not exist yet.family used to leave in florida.This events lasted about 40 days during lent she is 29 yrs old now. when this happen to my daughter brougt her to the priest told me i need to take my daughter to a psychiatrist. so I do not say anything to anybody even my husband my daughter is not his.She described heaven that all dead people go to a small tunnel going up and when you are not accepted the angel shove them. And she told me about hell she said it is on a bottom pit smokey and she met the devil and put his hand to her shoulder she got burn she said devil color is red and finger nails are long and have tail.she witness a boy got shot with a gun went to hell but he got send back kids innocent.evrybody that is in hell are smoking.She told me that anyone enter heaven become young again she mention the tree when you pluck the leaves it will grow again the path are made of gold.When she is on earth the angel bring her to heaven to eat supper she hear the bells ring.she described the table is very long and when they start to eat god pray he call himself the Almighty. the harp instrument give nice music.she told me about the fisherman that almost drown and rescued, the small girl that have a severe fever,when jesus went to the dessert walk no drinking and eating when my daughter wake up from sleep she was very thirsty.She said everything is like on a 3-d videos 10 mins is like forever.My daughter likes to draw she was in the marines for 4yrs and now she is in national guard spend a year in Iraque now still in national guard taking some classes communication just got done fire fighting classes which her real father retired fireman in the philippines.she was made in the fire department, i call her my fire baby.my husband work in realstate office keeping up computers and i work at fast food as a gm.I hope this gives somebody an eye opener to anyone that do not believe and believe that God is very real.\n\n","date":"February 5, 2012 at 1:10 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
