{"art":[{"id":"comment-2466","author":"vincenzo_giovanni_ruello","post":"The picture is funny no its not me firstly if you want me to stay and asnwer questions be nice and civil to me or I’ll leave. I have explained on the clip which is now spreading around the net like a virus about the ripped toes how I develope the images. The secret is filming between angles of light and then overlapping the results which incredibly reveal the most brilliant images ever seen. I want to go to a pshyisist to learn exactly why it works. The discovery was made in 2009 while I was experimenting on my music clips I then used it on the Mary Zeitoun Egypt apparition photo have you seen that one look at the baby Jesus with the labels He came from that ghostly white image. The system works and I expected may I call you my peers and friends to ask questions. If I can gain some trust and respect I will tell you all exactly how to do it because since revealing the severed toes I feel sad and a bit depressed and dont feel like developing the entire Shroud body.","date":"2011-02-15","mins":"7:28 am","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","title":"Using the Shroud of Turin as a Rorschach Ink Blot"},{"id":"comment-2505","author":"vincenzo_giovanni_ruello","post":"Dan this is my last message to you. You have treated me with disrespect and judging me before the jury is out and placing the picture of the priest that fellow next to me ridiculing me. How can any respected Shroud researcher scientist argue with my xray images of the 2 large toes side by side proving there is no crossover. Lastly why on God’s earth would I reveal my pioneering filming techniques to you or anyone to reproduce my findings and takel my hard work and credit. All true scientists protect their findings until respected scientists start seeing the truth. At this stage I will wait patiently for the Vatican officials or until I find someone I can work with. You know what I take extreme joy in Dan the xray images of the 2 large toenails side by side especially the clearly defined square left foot nail. But as you would say Dan its just video noise. Over and out.","date":"2011-02-17","mins":"9:41 pm","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","title":"Using the Shroud of Turin as a Rorschach Ink Blot"},{"id":"comment-2468","author":"vincenzo_giovanni_ruello","post":"Wait a minute you say that you cannot see anything on the eyes well thats is incredible as there is something I revealed on the eyes and the feet you cant see anything there either. Even the Shroud negative blown up with no processing reveals images to the eyes that people see as toes. How can I now take you seriously when you see nothing at all its a total waste of time then, you see nothing so why tell you anything maybe we both need glasses.","date":"2011-02-15","mins":"9:09 am","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","title":"Using the Shroud of Turin as a Rorschach Ink Blot"},{"id":"comment-2699","author":"vincenzo_giovanni_ruello","post":"Inner West Courier story published 1st March 2011, Sydney Australia 1.2 million readers a week, half page of the decoding of the Shroud by Vincenzo Ruello.","date":"2011-03-18","mins":"7:49 pm","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","title":"Using the Shroud of Turin as a Rorschach Ink Blot"},{"id":"comment-2492","author":"vincenzo_giovanni_ruello","post":"Hello Dan I have contacted the Catholic Church and will be only dealing from this moment on with the Vatican, their scientists and public relations media. Thankyou for your time and goodbye and Godbless you and your colleagues. Sincerely Vince.","date":"2011-02-17","mins":"2:23 am","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","title":"Using the Shroud of Turin as a Rorschach Ink Blot"},{"id":"comment-2504","author":"vincenzo_giovanni_ruello","post":"Clip posted xray imagery. The scientists who carried out 2 and 3d imagery tests were wrong. They made the biggest mistake of assumption when they noticed toe tips to the right of the right foot, then they assumed that the left foot must be crossing over the right foot and blaming mysterious unrecorded encrypted data. My close xray filming system has provan them wrong because you can now see 2 large toenails side by side. Forgive my arrow labels not clear but the large toenail on the left is of the right foot and the square clearly defined toenail next to it is from the left foot which is laying side by side to the right foot. There is no cross over, The Shroud is true and perfect in revealing all encrypted data if you have the means to see it..","date":"2011-02-17","mins":"8:24 pm","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","title":"Using the Shroud of Turin as a Rorschach Ink Blot"},{"id":"comment-2471","author":"vincenzo_giovanni_ruello","post":"Sorry I removed your post some words bothered me I am also a musician and very touchy with probably more feelings to hurt than most people. Thankyou for giving me your name. My next step is yes to find a scientist pysicist I believe to look at my work and then I will write or pay him to write the paper but you are not a scientist. Anyway I also have some issues about processing the entire body do you think its right to reveal in total photographic form a person who has died horrifically? I just concentrated on the feet and eyes. We may be in touch thankyou for your time if you do know any credited pyscists let me know. Sincerely Vince PS If I have made any mistakes in my findings and a qualified psycists shows me I will admit it but pictures Dan speak a thousand words..","date":"2011-02-15","mins":"10:20 am","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","title":"Using the Shroud of Turin as a Rorschach Ink Blot"},{"id":"comment-2469","author":"vincenzo_giovanni_ruello","post":"Secondly please asmswer this are you Barrie Swortz from Shroud.com if not what is your name and who are you associated with what qualified direct scientific colleagues do you know. Thanks Vinny.","date":"2011-02-15","mins":"9:17 am","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","title":"Using the Shroud of Turin as a Rorschach Ink Blot"}],"dating":[{"id":"comment-78582","author":"vincenzo_giovanni_ruello","post":"Interesting they speak of the earthquake that’s mentioned in the bible when Christ was resurrected but they failed to mention the link in the story.","date":"2014-02-12","mins":"3:59 am","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"id":"comment-52751","author":"vincenzo_giovanni_ruello","post":"How about we also see if new C14 tests are done the actual piece being taken from the Shroud by video tape.","date":"2013-11-25","mins":"8:19 am","url":"https://shroudstory.com/2013/11/14/colin-berry-is-writing-to-the-vatican/","cat":"carbon_14_dating","title":"Colin Berry is Writing to the Vatican"}],"events":[{"id":"comment-59632","author":"vincenzo_giovanni_ruello","post":"Hello Dan am setting up VVVP ……Vatican Veronica Veil Project do you or any colleagues wish to be involved. It will centre around copying and verifying my findings lexuscoleman1 email does not work its only good for blog submits email me at vincent@veronica veil.com if you or anyone is interested the time has come http://gloria.tv/?media=420117.","date":"2013-12-14","mins":"9:04 pm","url":"https://shroudstory.com/2013/12/14/update-on-the-st-louis-conference-october-9-12-2014/","cat":"event","title":"Update on the St. Louis Conference, October 9-12, 2014"},{"id":"comment-59846","author":"vincenzo_giovanni_ruello","post":"No wont have time to submit a paper and unless it is submitted by qualified scientists why bother have been there done that have noticed you have qualified scientists on your site who are your friends. I also appologise for what I said before about the ”old crowd”. Will post asap a deatailed abstract no more than 2 pages. Dan, the Vatican Veronica discovery is our only hope.","date":"2013-12-15","mins":"9:29 am","url":"https://shroudstory.com/2013/12/14/update-on-the-st-louis-conference-october-9-12-2014/","cat":"event","title":"Update on the St. Louis Conference, October 9-12, 2014"}],"history":[{"id":"comment-72867","author":"vincenzo_giovanni_ruello","post":"How much is it for sale Dan, is it real, where do you buy it.","date":"2014-01-10","mins":"7:05 am","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","title":"How many more purported pieces are out there?"},{"id":"comment-72888","author":"vincenzo_giovanni_ruello","post":"Complete and total fraud, the true cross was destroyed by Saladin during the Crusades.","date":"2014-01-10","mins":"9:11 am","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","title":"How many more purported pieces are out there?"},{"id":"comment-55650","author":"vincenzo_giovanni_ruello","post":"More interesting and only now becoming known is the Gospel of the Hebrews an ancient 2nd century text stating that Jesus himself gave the ”linen cloth” to the servant of the priest prior to His appearance to James, recently added to wikipedia. I believe it was Josephus the servant of Nicodemus who helped bury Jesus..","date":"2013-12-03","mins":"9:03 am","url":"https://shroudstory.com/2013/12/03/translation-when-you-come-bring-the-shroud-of-turin/","cat":"history","title":"Translation: When you come, bring the Shroud of Turin"}],"image":[{"id":"comment-58309","author":"vincenzo_giovanni_ruello","post":"It is as mysterious as the creation of the universe.What mere man can copy that and then explain how he did it. I agree with story, the true success of STURP was in proving it to this day as a mystery.","date":"2013-12-12","mins":"6:49 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"},{"id":"comment-52583","author":"vincenzo_giovanni_ruello","post":"Sturp examined the Shroud in 1978 and also took samples, could some one tell me why a carbon test was not done in 1978 or was it done and never told. It seems impossible to think they did all these tests without carbon dating it.","date":"2013-11-23","mins":"9:36 pm","url":"https://shroudstory.com/2013/11/23/is-the-image-on-the-shroud-of-turin-a-selfie/","cat":"news_&_views","title":"Is the Image on the Shroud of Turin a Selfie?"},{"id":"comment-52656","author":"vincenzo_giovanni_ruello","post":"Thats assuming quite a lot isnt David they were suppose to go in without bias not presuming anything and I think they took some samples too,.","date":"2013-11-24","mins":"9:30 am","url":"https://shroudstory.com/2013/11/23/is-the-image-on-the-shroud-of-turin-a-selfie/","cat":"news_&_views","title":"Is the Image on the Shroud of Turin a Selfie?"},{"id":"comment-52671","author":"vincenzo_giovanni_ruello","post":"C14 dating is now useless as after the tragic restoration the linen is covered in only God knows what chemicals.","date":"2013-11-24","mins":"10:12 am","url":"https://shroudstory.com/2013/11/23/is-the-image-on-the-shroud-of-turin-a-selfie/","cat":"news_&_views","title":"Is the Image on the Shroud of Turin a Selfie?"}],"misc":[{"id":"comment-60188","author":"vincenzo_giovanni_ruello","post":"This is it Dan, the foundation to the theory, I sink or swim on this. It involves the Shroud of Turin and the Vatican Veronica. The screen is tilted and the positive images appear in both cloths. This does not require even any scientific verification as it is self verifying, and there is no distortion. We can see the true face of Christ in the Shroud without reversal of left to right ,the Veronica because its small was photographed in close up once revealed and futher processed. Please show this to the prospective team as this is the foundation and evidence to the theory thanks. Please also understand I actually photographed the Veronica image and processed film revealing the same image on my website http://gloria.tv/?media=524164.","date":"2013-12-16","mins":"7:14 am","url":"https://shroudstory.com/2013/12/16/a-thread-dedicated-to-vincenzo-giovanni-ruellos-proposal/","cat":"news_&_views","title":"A Thread Dedicated to Vincenzo Giovanni Ruello’s Proposal"},{"id":"comment-60221","author":"vincenzo_giovanni_ruello","post":"What I have done in scientific terms is discover a form of infared filming where tilting the screen back filters out certain colours allowing us to see through the true images encoded in the Shroud and the Vatican Veronica. Infared cameras are programmed to filter or enhance colours allowing people to see in the dark or to examine paintings and the cosmos. This is a simple and effective form of infared filming, mechanical in nature..","date":"2013-12-16","mins":"8:12 am","url":"https://shroudstory.com/2013/12/16/a-thread-dedicated-to-vincenzo-giovanni-ruellos-proposal/","cat":"news_&_views","title":"A Thread Dedicated to Vincenzo Giovanni Ruello’s Proposal"},{"id":"comment-60637","author":"vincenzo_giovanni_ruello","post":"Hello Dan thankyou for this but have decided to bite the bullet and will now hire a freelance scientist to copy and verify my work and submit to journals. I do not need a team just one qualified person. Thankyou for your help anyway.","date":"2013-12-16","mins":"10:08 pm","url":"https://shroudstory.com/2013/12/16/a-thread-dedicated-to-vincenzo-giovanni-ruellos-proposal/","cat":"news_&_views","title":"A Thread Dedicated to Vincenzo Giovanni Ruello’s Proposal"},{"id":"comment-65506","author":"vincenzo_giovanni_ruello","post":"Merry xmas and safe new year Dr Dan.","date":"2013-12-23","mins":"7:23 am","url":"https://shroudstory.com/2013/12/16/a-thread-dedicated-to-vincenzo-giovanni-ruellos-proposal/","cat":"news_&_views","title":"A Thread Dedicated to Vincenzo Giovanni Ruello’s Proposal"},{"id":"comment-60299","author":"vincenzo_giovanni_ruello","post":"That link is not the Veronica from wikipedia it is a copy painted which I have processed also a fake. What is true regardless of my description whether or not it is a form or infared or solarisation is the fact the Shroud face has appeared and the Veronica image has appeared also. I am the first to use this technique on both cloths. Thanks for watching, I am only after qualified scientists who believe in my work and discovery..","date":"2013-12-16","mins":"10:43 am","url":"https://shroudstory.com/2013/12/16/a-thread-dedicated-to-vincenzo-giovanni-ruellos-proposal/","cat":"news_&_views","title":"A Thread Dedicated to Vincenzo Giovanni Ruello’s Proposal"},{"id":"comment-60303","author":"vincenzo_giovanni_ruello","post":"And ps you are incorrect in stating that AF does not work as a positive negative inverter because in the processing clip the Shroud face which is a HD photo is converted to a positive face image without reversal how can you dispute this ? Explain the face of Christ appearing in the angular tilt of the Shroud face. And I state once again that link you provided is a painting completely different frame and different image..","date":"2013-12-16","mins":"10:50 am","url":"https://shroudstory.com/2013/12/16/a-thread-dedicated-to-vincenzo-giovanni-ruellos-proposal/","cat":"news_&_views","title":"A Thread Dedicated to Vincenzo Giovanni Ruello’s Proposal"},{"id":"comment-60325","author":"vincenzo_giovanni_ruello","post":"The image you showed in the link is the Holy face of Vienna not the Vatican Veronica Veil Hugh Farey.","date":"2013-12-16","mins":"11:58 am","url":"https://shroudstory.com/2013/12/16/a-thread-dedicated-to-vincenzo-giovanni-ruellos-proposal/","cat":"news_&_views","title":"A Thread Dedicated to Vincenzo Giovanni Ruello’s Proposal"},{"id":"comment-34637","author":"vincenzo_giovanni_ruello","post":"Dr Dan I have processed the right eye and a Roman coin with a face in the middle has been revealed. This can easliy be verified by finding a Roman coin with these outer markings and middle face impressions.","date":"2013-05-24","mins":"11:57 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","title":"Max thinks I’m a half-blind arch-skeptic"},{"id":"comment-34697","author":"vincenzo_giovanni_ruello","post":"Dr Dan,its definitley a coin have done an extreme close up maybe Jewish not Roman.","date":"2013-05-25","mins":"12:20 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","title":"Max thinks I’m a half-blind arch-skeptic"},{"id":"comment-34695","author":"vincenzo_giovanni_ruello","post":"Max all I can identify is the round circular shape with pattern edges and a face in the centre. We now need a numismatic expert to try and reveal this coin.","date":"2013-05-24","mins":"10:28 pm","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","title":"Max thinks I’m a half-blind arch-skeptic"},{"id":"comment-34741","author":"vincenzo_giovanni_ruello","post":"No Max it may not have resolution but it has enough features to say it is a coin, and PS: Have commenced to process the left eye and it is virtually identical to this one,will place clip up of left eye asap.","date":"2013-05-25","mins":"11:00 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","title":"Max thinks I’m a half-blind arch-skeptic"},{"id":"comment-34826","author":"vincenzo_giovanni_ruello","post":"Max at this stage I would have to say that my latest image of the object on the eye is the best image ever seen of this object and am sure it will assist many experts..","date":"2013-05-25","mins":"9:51 pm","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","title":"Max thinks I’m a half-blind arch-skeptic"},{"id":"comment-34742","author":"vincenzo_giovanni_ruello","post":"Max if its not a coin it is a carved piece of stone with a face in the centre.","date":"2013-05-25","mins":"11:01 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","title":"Max thinks I’m a half-blind arch-skeptic"},{"id":"comment-34845","author":"vincenzo_giovanni_ruello","post":"The number 12 at bottom of the coin is seen and there is another number next to it..","date":"2013-05-26","mins":"1:16 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","title":"Max thinks I’m a half-blind arch-skeptic"},{"id":"comment-34988","author":"vincenzo_giovanni_ruello","post":"Max, I have just processed a stage 3 of the right eye,you can see it kindly placed up by Dr Dan on the other article abut conspiracy Vincenzo Giovanni Ruello. I never believed in the coin theory till now..","date":"2013-05-26","mins":"10:22 pm","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","title":"Max thinks I’m a half-blind arch-skeptic"},{"id":"comment-34589","author":"vincenzo_giovanni_ruello","post":"Very well written Max.","date":"2013-05-24","mins":"6:51 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","title":"Max thinks I’m a half-blind arch-skeptic"},{"id":"comment-35115","author":"vincenzo_giovanni_ruello","post":"Dr Dan your afraid to show the clip with the face processed from the coin ? please let people see it.","date":"2013-05-28","mins":"9:45 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","title":"Max thinks I’m a half-blind arch-skeptic"},{"id":"comment-54973","author":"vincenzo_giovanni_ruello","post":"That second paragraph in wikipedia about the 3 specialists who ”dated” the Shroud is very misleading is that in wikipedia too.","date":"2013-12-02","mins":"9:40 am","url":"https://shroudstory.com/2013/12/02/the-anti-shroudrelicscatholicchristian-propaganda-on-wikipediaguest-posting-by-o-k/","cat":"news_&_views","title":"The anti-Shroud/Relics/Catholic/Christian propaganda on Wikipedia–Guest Posting by O. K."},{"id":"comment-51544","author":"vincenzo_giovanni_ruello","post":"Thanks Dan for publishing some of my work.","date":"2013-11-15","mins":"10:54 pm","url":"https://shroudstory.com/2013/11/15/vinny-the-mystery-of-the-shroud-of-turin-has-been-solved/","cat":"tinfoil_hats","title":"Vinny: The mystery of the Shroud of Turin has been solved"},{"id":"comment-51545","author":"vincenzo_giovanni_ruello","post":"The digital dna clip should be seen in youtube as it does not play here Dan has just got a photo of it with the centre obscured. Its an image that I discovered and it does exist. Taken from the blood stain of the foot. Using Angular Filming it was then placed in a digital microscope at as I remember back in 2009 at 5000 times magnification..","date":"2013-11-15","mins":"11:00 pm","url":"https://shroudstory.com/2013/11/15/vinny-the-mystery-of-the-shroud-of-turin-has-been-solved/","cat":"tinfoil_hats","title":"Vinny: The mystery of the Shroud of Turin has been solved"},{"id":"comment-51578","author":"vincenzo_giovanni_ruello","post":"Silence is a great compliment.","date":"2013-11-16","mins":"6:12 am","url":"https://shroudstory.com/2013/11/15/vinny-the-mystery-of-the-shroud-of-turin-has-been-solved/","cat":"tinfoil_hats","title":"Vinny: The mystery of the Shroud of Turin has been solved"},{"id":"comment-51630","author":"vincenzo_giovanni_ruello","post":"Disappointing boys,the cat cut your toungues,Angular Filming has been provan from my web site clip of the Hologram appearing from the Shroud face and the Vatican Veronica without reversal of left to right. If any of you have blood in your faces ADMIT that I have solved the mystery by the identical face and injury markings from the decoded Vatican Veronica which appeared hundreds of years in Rome before the Shroud of Turin. Lastly I have revealed the worlds first true Holograms of the Shroud face without any CGI programmes creating unrealistic images of the Shroud face. I’m waiting.","date":"2013-11-16","mins":"12:16 pm","url":"https://shroudstory.com/2013/11/15/vinny-the-mystery-of-the-shroud-of-turin-has-been-solved/","cat":"tinfoil_hats","title":"Vinny: The mystery of the Shroud of Turin has been solved"},{"id":"comment-59881","author":"vincenzo_giovanni_ruello","post":"Like the Manappello cloth if it looks like a painting IT IS A PAINTING. I am disgusted that they even compare this to the Shroud of Turin.","date":"2013-12-15","mins":"11:41 am","url":"https://shroudstory.com/2013/12/15/what-if-there-is-a-breeze/","cat":"science_and_religion","title":"What if there is a breeze?"},{"id":"comment-35597","author":"vincenzo_giovanni_ruello","post":"People making money from the Holy face of Jesus Christ are a disgrace.","date":"2013-06-01","mins":"7:18 am","url":"https://shroudstory.com/2013/06/01/we-received-a-high-resolution-scan-from-one-of-the-priests/","cat":"news_&_views","title":"We received a high resolution scan from one of the priests . . ."},{"id":"comment-60059","author":"vincenzo_giovanni_ruello","post":"Please spare me the laughable reasoning,”the problem is the glass”regarding Manoppello,the problem is that when tested it will be what it is a painting of unknown origen. I have in depth photographic knowledge of all the relics in existance and have processed all of them. Pheiffer resoning that Manappello image miraculously appears on both sides is also ridiculous as if any artist paints on a silk it will be seen on both sides as silk and bysup is transparent. Unfortunately for Pheiffer he made his conclusions in the late 90s. My work and discovery on Vatican Veronica has debunked his theory. Once I set up my project team or some scientists decide to verify my findings, the Manoppello will be relegated to what it is a famous painting of unknown origen. The Guadalupe Mary if you study the history was created by an Aztec artist. It has survived 500 years because every few years it is painted over and over. There are only 2 miraculous cloths in existance, the Shroud and the Veronica Veil, The cloth of Olivedo in Spain is also authentic but does not have any encoded imagery.","date":"2013-12-16","mins":"12:46 am","url":"https://shroudstory.com/2013/12/15/what-if-there-is-a-breeze/","cat":"science_and_religion","title":"What if there is a breeze?"}],"opinion":[{"id":"comment-34210","author":"vincenzo_giovanni_ruello","post":"Thankyou Max. Stay tuned here as a clip called The Eyes Of God is about to be downloaded where I have isolated the human face from the lion face.","date":"2013-05-21","mins":"10:03 am","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"},{"id":"comment-34125","author":"vincenzo_giovanni_ruello","post":"Angular filming magnification is a simple process which we can begin to understand by this clip showing the front of the Shroud filmed live being tilted back from the lcd screen then before your eyes turning into a positive The technique converts negative film to positive and positive to negative when seen by the camera eye lense and even a human eye. In AFM yes there is a distortion rate of about 10% in length and width of created image but there is no visual noise. It is not correct to say I am overlaying images upon each other. The truth is when an image is processed revealing the positive aspects it is photographed or filmed. The second stage uses this image again tilted to an optimum degree to avoid length width distortion and filmed revealing more of the positive nature. A complete processing is difficult in one stage as AFM only works on sections at a time hence 2 4 separate processings. The illumination of the screen is what reveals the hidden elements and 3 D hidden characteristics. The process has also been used for many years in astronomical photography, I recently learnt this where they photograph stars and distant bodies from separate angles and compile them to create the image so my filming technique has a foundation. I am the first to use this technique in the second face and all of my Shroud research and for this reason I have found misunderstanding and hostility. The face of the lion cannot be denied nor the alive face of Christ from the back.","date":"2013-05-20","mins":"10:59 am","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"},{"id":"comment-34213","author":"vincenzo_giovanni_ruello","post":"I have downloaded a new clip having separated the face from the lion head face http://gloria.tv/?media447402 Dr Dan I think you will appreciate the music.","date":"2013-05-21","mins":"10:37 am","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"},{"id":"comment-34452","author":"vincenzo_giovanni_ruello","post":"What is interesting Max is that some see these images and others dont. I use to think that an eye was an eye but now see that our brain waves and thought are hardwired to our optics..","date":"2013-05-23","mins":"9:13 am","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"},{"id":"comment-34313","author":"vincenzo_giovanni_ruello","post":"I need to tread carefully ,I mean we need to. These initial results show something strange and maybe positive. If these images are tricks of light they have done a good job in communicating to my mind what I see. Can it be a coincidence that images of a lion head or maybe a leopard is seen. Am still working on the photographs slowly gaining more clarity. My goal is to be able to decipher the back as clear as the front face. This is more difficult as it now appears we may be dealing with 2 holographic images. Am attempting to separate the images with more clarity.","date":"2013-05-22","mins":"8:05 am","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"},{"id":"comment-34323","author":"vincenzo_giovanni_ruello","post":"Spectographic 3 D filming has confirmed the lion face.","date":"2013-05-22","mins":"10:18 am","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"},{"id":"comment-34326","author":"vincenzo_giovanni_ruello","post":"You may have a point about John in Revelations mentioning images of a lion leopard and human face with what was the 4th an Eagle. If John had the Shroud till it passed on to someoneelse having it opened up hanging with sunlight hitting it at an angle it may have revealed some of these images.","date":"2013-05-22","mins":"10:36 am","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"},{"id":"comment-34156","author":"vincenzo_giovanni_ruello","post":"This is a different angle live processing of the lion face. The image was revealed after 2 angles processed from the black and white negative photographed by Fanti. Third stage Angular Filming shows another lion face. Appollogies for using Sally Cooper as this was an annonomous name I was using to avoid hostilities towards myself. I will from now on use my real name in all communications here and elsewhere http://gloria.tv/?media444844.","date":"2013-05-20","mins":"10:16 pm","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"},{"id":"comment-34550","author":"vincenzo_giovanni_ruello","post":"Why am I the only person who has done an in depth analysis of the second face. I am sure a VP8 3 D analyser will prove me correct. Why has the front f the Shroud been analysed every inch using every piece of filming technology on the planet and the second face hasnt. I have used angular filming and spectography, I will be vindicated. I want Barry Schwortz , Fanti or any qualified photographic scientist or expert to analyse the second face and then the truth will emerge, I have revealed truth but it is at this stage only my word. When an in depth analysis is made and the images released to the public as I have done all will be much clearer. You say there is no conspiracy Dr Dan not about my work but there is a conspiracy,against the second face,tell me why it has not been analysed,all we have since 2002 other than myself is one positive photograph and one heavily banded black and white negative by Fanti. Place it under a VP8 3 D analyser.","date":"2013-05-23","mins":"9:51 pm","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"},{"id":"comment-34603","author":"vincenzo_giovanni_ruello","post":"A silk veil has been placed across the screen to diffuse excess light and glare. Please Dr Dan place this clip up.","date":"2013-05-24","mins":"8:05 am","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"},{"id":"comment-34874","author":"vincenzo_giovanni_ruello","post":"Hello Dr Dan just want to say thankyou for showing your viewers some of my work. I ask you if you could please place this last clip up. It heralds the end of my work on all the Holy cloths thankyou Dr Dan.","date":"2013-05-26","mins":"9:32 am","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"},{"id":"comment-34989","author":"vincenzo_giovanni_ruello","post":"The number that appears to be a 12 C at bottom may not be a 12 but a word when turned 360 degrees may commence with SI.","date":"2013-05-26","mins":"10:25 pm","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"},{"id":"comment-34163","author":"vincenzo_giovanni_ruello","post":"Chris B I have attempted to isolate the face and added more images http://gloria.tv/?media447240.","date":"2013-05-21","mins":"2:01 am","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"},{"id":"comment-34181","author":"vincenzo_giovanni_ruello","post":"This is using 35mm film Samsung SLR camera close ups http://gloria.tv/?media447275.","date":"2013-05-21","mins":"5:04 am","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"}],"researchers":[{"id":"comment-6182","author":"vincenzo_giovanni_ruello","post":"I accept your response, I have revealed this to you so you now know that we are not dealing with some primitive imprint or photograph. A mailard reaction from decomposing dead bodies or a sweat imprint Collin cannot create a hologram, I hope I have enlightened you because though you may not succeed entirely you now know what I know…. Your friend and colleague Vincenzo thanks for seeing it..","date":"2015-07-26","mins":"3:10 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/07/17/heres-an-updated-version-of-my-iconoplastic-modelling-of-that-turin-so-called-shroud-probably-a-misnomer/","cat":"uncategorized","title":"Here’s an updated version of my  ‘iconoplastic’ modelling of that Turin so-called “Shroud” (probably a misnomer)."},{"id":"comment-47751","author":"vincenzo_giovanni_ruello","post":"Interesting that The Gospel of the Hebrews, an ancient text writes that ” Jesus gave the cloth to the servant of the priest then appeared to James ”.","date":"2013-10-17","mins":"8:13 am","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","title":"Colin Berry: The 1532 fire  was no accident"},{"id":"comment-6180","author":"vincenzo_giovanni_ruello","post":"Thats a poor response Colin I want you to explain why a hologram is appearing when I tilt the laptop screen maybe being a chemist this is outside your expertise, I have provan it is a hologram before your eyes, now this will play against what you are subscribing too but I expect some answer as even chemist have an analytical mind am waiting do you accept the fact I have processed live a hologram which the Shroud is ?.","date":"2015-07-26","mins":"2:25 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/07/17/heres-an-updated-version-of-my-iconoplastic-modelling-of-that-turin-so-called-shroud-probably-a-misnomer/","cat":"uncategorized","title":"Here’s an updated version of my  ‘iconoplastic’ modelling of that Turin so-called “Shroud” (probably a misnomer)."},{"id":"comment-6177","author":"vincenzo_giovanni_ruello","post":"Hello Colin your very entertaining my name is Vincenzo Giovanni Ruello you may have heard of me from that arm chair critics blog site. I would like your thoughts on my live processing of the Shroud face showing holographic elements. I can do the same with your hand and compare the 2. In 2011 I discovered the encoded second shroud image in the Rome Veronica get back here is the live holographic processing using an lcd screen as a form of infrared negative processing quite simple but effective. Https://www.youtube.com/watch?v=G9v X I Wm XT0.","date":"2015-07-26","mins":"12:56 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/07/17/heres-an-updated-version-of-my-iconoplastic-modelling-of-that-turin-so-called-shroud-probably-a-misnomer/","cat":"uncategorized","title":"Here’s an updated version of my  ‘iconoplastic’ modelling of that Turin so-called “Shroud” (probably a misnomer)."}],"resources":[{"id":"comment-52386","author":"vincenzo_giovanni_ruello","post":"Could you please tell me Dan is this copy on actual material or paper, and if its on actual material how did they get it on or photograph it and does it exibit all the known elements thanks.","date":"2013-11-22","mins":"9:18 am","url":"https://shroudstory.com/2013/11/22/if-you-will-be-near-whippany-new-jersey-in-december/","cat":"press_coverage","title":"If you will be near Whippany, New Jersey, in December"},{"id":"comment-6843","author":"vincenzo_giovanni_ruello","post":"Not a bad photograph I discovered in the St Peters Veronica Veil eh Dr Dan Porter something very special and 2000 years old. Looks like the Shroud of Turin face too but your the expert Dr Dan good old angular filming. Cheers to you and happy new year.","date":"2012-01-12","mins":"8:43 am","url":"https://shroudstory.com/2012/01/11/you-couldnt-make-this-up-no-you-couldnt-no-really-you-could-not/","cat":"video","title":"You couldn’t make this up. No you couldn’t. No. Really. You could not."}]}
