{"events":[{"author":"william_mathis","post":"Shroud of Turin Expert Claims Molecular and Sub-Atomic Testing Would Resolve Current and Long-Standing Disputes Regarding the Shroud\nMonograph Publishing: One of the world’s leading experts on the Shroud of Turin, author and attorney Mark Antonacci, is petitioning Pope Francis to allow 21st century technology to be applied at the molecular and sub-atomic levels to Jesus’ purported burial cloth. Results of these tests would prove or disprove its authenticity and resolve the current dispute regarding samples that recently dated the shroud to 33 B.C. +/- 250 years.\n21st Century technology can now be applied at the molecular and sub-atomic levels to Jesus’ purported burial cloth that could answer an array of 2000 year-old questions.\nSt. Louis, Missouri (PRWEB) April 18, 2013\nThis unique cloth has only been scientifically examined in a comprehensive manner once, 35 years ago. While this examination revealed extensive, startling information, a new generation of promising research has since developed that could acquire far more information. Molecular and sub-atomic technology, applied to the Shroud could reveal its age, the cause of its unique images, the identity of the man buried within it, if it is a forgery and whether a miraculous event occurred to the dead body wrapped within it.\nAntonacci proposes that multi-spectral imaging be applied to the entire Shroud. This innovative technology could scan the Shroud in only six hours and scientists could then spend years analyzing its data. It could map the cloth and identify not just every fiber of every thread, but what is on every fiber. It could identify tissue at the molecular level, as well as individual chemical compounds. Further information at the molecular level could be acquired using similar technology, such as Molecular Spectroscopy.\nMore than a century of scientific and medical analysis has eliminated all proposed naturalistic and artistic attempts to duplicate the Shroud’s unique, full-length images. Only two hypotheses to explain these unique images have been published in peer reviewed scientific journals:\n1) The Corona Discharge hypothesis, by Dr. Giulio Fanti, who led scientists at the University of Padua in Italy to challenge previous C-14 or radiocarbon dating. Using three different methods to test fibers from various locations throughout the cloth, these scientists obtained an average date of 33 B.C. +/- 250 years.\n2) The Historically-Consistent hypothesis by Mark Antonacci that not only accounts for all of the Shroud’s unique body image features, but also its radiocarbon dating and its numerous non-body image features, which other hypotheses do not even attempt to explain (http://www.testtheshroud.com).\nBoth of these scientific hypotheses involve radiation and an extremely unusual or miraculous cause of these images. Many Shroud scientists conclude that radiation was the most likely cause of the Shroud’s images. If the radiation explained in Antonacci’s hypothesis occurred, its source was the body wrapped within the cloth. Multi-spectral imaging could demonstrate or refute this scientific hypothesis, along with all other proposed hypotheses to explain the Shroud’s images or its radiocarbon dating.\nScientists recognize that one form of radiation, neutron or particle, would create new C-14 atoms or isotopes within the molecular structure of the linen, blood, limestone and other material that was on the Shroud or present at the time of the radiation. Scientific tests sponsored by The Resurrection of the Shroud Foundation (RSF) demonstrate these C-14 atoms survive heat, age and all pretreatment cleaning methods and would still be present today. If the Shroud was irradiated with neutrons, this event would necessarily refute the cloth’s radiocarbon dating because it would add C-14 atoms within the cloth’s molecular structure, making it appear much younger than its actual age.\nNew technology could demonstrate or refute that this event occurred! Neutron radiation not only creates new C-14 atoms, but also creates Cl-36 and Ca-41 atoms which virtually do not exist in nature. If such an event occurred, these rarest of atoms would still be present within the molecular structures of the linen, blood, or other irradiated material. The presence of these atoms, well above their infinitesimal natural levels, could only result from neutron radiation, which could not be generated by humans until the 20th century.\nInterestingly, all three atoms (C-14, Cl-36 and Ca-41) are created by neutron radiation at rates that are known to scientists. Thus the amount of neutron radiation received by the Shroud, and the date this miraculous event occurred, can be calculated by scientists with the same accuracy as C-14 or radiocarbon dating. These tests could even be conducted on the original limestone walls of Jesus’ reputed burial tomb(s).\nAntonacci has recently begun a direct appeal to Pope Francis, who has a Masters Degree in Chemistry to approve the application of molecular and sub-atomic testing methods to the Shroud of Turin. These tests, in combination with many prior test results and studies, could prove or disprove with objective, independent evidence that:\n1. Particle radiation irradiated the Shroud of Turin linen, its blood and other material;\n2. Particle radiation emanated from the length, width, and depth of the dead body wrapped within the cloth;\n3. The event occurred in the first century to a first century cloth;\n4. The event happened inside Jesus’ burial tomb.\nMark Antonacci, President\nResurrection of the Shroud Foundation\n314-704-0537 – cell\n636-938-3708 – office\nmarkantonacci(at)testtheshroud(dot)com\nAbout The Resurrection of the Shroud Foundation (RSF):\nThe RSF designs, advocates and funds some of the most sophisticated scientific testing of the 21st century. For the last two decades it has supported a variety of scientific research and information relating to the age, origin and authenticity of the Shroud of Turin.\nAbout Monograph Publishing:\nMonograph Publishing is a multi-dimensional company based in St. Louis, Missouri specializing in high quality publications, design, fine art prints and photography. http://www.monographpublishing.com\n\n","date":"May 7, 2013 at 12:19 pm","url":"https://shroudstory.com/2013/05/07/shroud-of-turin-presentation-in-orlando/","cat":"event","title":"Shroud of Turin Presentation in Orlando"}]}
