{"history":[{"author":"wmw","post":"It did seem like Barrie did not know what the article was about. It would have been nice if Barrie had deferred to a medievalist or an art historian. We all love Barrie and no one has done more to advance Shroud knowledge in the world. But as Barrie is always telling us, stick to your field of expertise.\n\n","date":"October 29, 2014 at 3:53 pm","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science"}],"image":[{"author":"wmw","post":"HF has made what seems to be a brilliant observation (see Aug 28, 3:42 am). Would love to see some pictures of just what he is looking at. Is that possible? This may be a whole new paradigm for banding.\n\n","date":"August 29, 2014 at 4:29 am","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"}],"researchers":[{"author":"wmw","post":"There is nothing really new in the last 24 yrs. except this chart and a couple cites. See Stephen Jones at http://tinyurl.com/nedtsvg where he publishes Dr. Jackson’s whole 1991 paper as a blog post. He had permission. That paper was based on a March 1990 article in Shroud Spectrum International at https://www.shroud.com/pdfs/ssi34part3.pdf\n\n","date":"October 14, 2014 at 1:33 pm","url":"https://shroudstory.com/2014/10/14/dj-vu-squared/","cat":"critical_summary","title":"Déjà vu Squared"}],"opinion":[{"author":"wmw","post":"I thought the discussion board on the STLSC site was supposed to be a special forum for discussing papers presented at the conference, not a boil the ocean BB style message board. Yuk! Will I need to sign in just to read it?\n\n","date":"October 1, 2014 at 3:58 pm","url":"https://shroudstory.com/2014/10/01/new-discussion-facility-on-the-st-louis-conference-site/","cat":"other_blogs","title":"New Discussion Facility on the St. Louis Conference Site"}]}
