{"resources":[{"author":"yaven","post":"“Do not think I have come to bring peace on earth. I have not come to bring peace, but a sword.”  \nIs that not an example of “support for violence” by Jesus?  \nJesus was not a warlord inciting others to kill.. What we fail to understand is that Jesus always speak in parables. For instance “I am the good shepherd”, ” you are the salt of the earth” ” you are the light of the world” “When you do a charitable deed, do not let your right hand knows what your left hand is doing” ” The harvest is great but the labourers are few” ” I am the light of the world” It is in parable when he said “turn your other cheek” meaning be gentle with the aggressor. Jesus did not turn his cheek when the Chief Priest’s guard slap him on his cheek. Jesus spoke gently to him. In this manner Jesus said ” I have not come to bring peace, but a sword.” Here Jesus means division in the families, in the churches, because of him. If anyone in a family chooses Jesus, while others are worldly, there is a sword in the family. Even in a Christian family one is Pentecostal and the other is Catholic. It will be worse in a non-Christian family if one chooses Jesus. This ‘sword’ is a worldwide phenomena. There are more than 55.000 Christian denominations (divisions) in the world. Jesus was speaking in parable when he said ‘turn the other cheek” meaning be gentle with the aggressor. Jesus did not turn his cheek when High Priest’s servant slap on Jesus cheek. He spoke gently with him. The facts support Jesus gentleness. The people of other faiths are hardly persecuted in 130 countries where Christians are majority. I incline to think only chosen people can understand Jesus. Jesus said “many are called but few are chosen”. “Not everyone seeing sees; not everyone hearing hears”\n\n","date":"August 7, 2013 at 6:05 am","url":"https://shroudstory.com/2013/07/30/fox-news-propels-zealot-the-life-and-times-of-jesus-to-number-one/","cat":"books","title":"Fox News Propels Zealot: The Life and Times of Jesus to Number One"}]}
