[{"id":"comment-193028","author":"jason_engwer","post":"Max patrick Hamon, I doubt that George Rossman was involved in the 1982 test. If he was involved, it was probably in a secondary role: http://triablogue.blogspot.com/2014/04/the 1982 carbon dating of shroud of.html.","date":"2015-03-10","mins":"5:32 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-197099","author":"jason_engwer","post":"Regarding David Sox’s claims about an earlier carbon dating, it should be noted that Harry Gove comments on the subject in his book, Relic, Icon Or Hoax? (Bristol and Philadelphia: Institute of Physics Publishing, 1996), 281. According to Gove, he talked to Sox on the phone a few months after Sox’s alleged discussion with Peter Rinaldi occurred. Gove says that Sox told him that the earlier carbon dating occurred “six or seven years” earlier. If the Tablet article cited by Charles Freeman is claiming that the earlier carbon dating occurred in 1988, then Sox apparently contradicted himself. Does the Tablet article set the earlier carbon dating in 1988? Not that I noticed. I haven’t read much of Sox’s material. Does anybody know if he added any further details to his account anywhere else? The way Gove describes it, based on his phone conversation with Sox, makes the test sound like the 1982 one arranged by John Heller and Alan Adler and conducted in California. If that 1982 test was in view, that would help explain why Rinaldi and others remained so open to the Shroud’s authenticity, since the Heller/Adler 1982 test produced inconsistent results. By contrast, if the secret carbon dating cited by Sox had produced a consistent medieval result, why would Rinaldi and others in the know have remained so open to the Shroud’s authenticity? Sox’s 2010 article is referring to something other than the Heller/Adler test. It’s referring to a test in Italy that apparently produced more consistent results than the Heller/Adler one. The fourth paragraph in the Tablet article could be read as dating the test to 1988, but it seems ambiguous to me. If Sox did refer to a 1981 or 1982 test when speaking to Gove, but then referred to a 1988 test in his 2010 article, he contradicted himself. Even if he didn’t contradict himself, the notion that a 1981 or 1982 test consistently placed the Shroud around the same time as the official 1988 test is suspicious, since Rinaldi and others who would have been aware of that test from 1981 or 1982 didn’t act as if they knew the Shroud was medieval..","date":"2015-04-21","mins":"6:20 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-106107","author":"jason_engwer","post":"The fact that people like O.K. Are having to ask these questions in 2014, more than a quarter of a century after the tape of Adler was recorded, is a problem. Why has that portion of the tape not been posted online as an audio file, posted in transcript form online, described in detail online, or published in a book, for example? Why can we get occasional quotes and descriptions from people who have a copy of the tape, but with the full content withheld? What legal concerns would allow some people to have the tape, allow them to play it for some people, and allow them to discuss portions of the tape with some people (or with the general public, as Joe and his wife did in 2002), but wouldn’t allow them to make the fuller contents of the tape more widely known? Why do we keep getting such highly selective snippets of the tape’s contents after the tape has been in existence for more than a quarter of a century? And why did Joe and his wife not expand on their comments after their response to Caltech? They had years to describe and document the evidential nature of the phone records they had, explain how much Joe could corroborate the phone call, document that people had heard Rossman’s name circulating in association with the 1982 test prior to 2002, produce a transcript of the relevant portions of the tape, interact with Caltech’s claims about the dating capabilities their staff had in 1982, etc. Instead, it’s been a dozen years since Joe and his wife’s response to Caltech, and there’s been no follow up. That’s one of the reasons why their side of the dispute has some significant credibility problems..","date":"2014-04-29","mins":"7:13 pm","url":"https://shroudstory.com/2014/04/28/did-a-single-thread-get-tested-in-1982-is-it-important-to-know-and-why/","cat":"carbon_14_dating","title":"Did a single thread get tested in 1982. Is it important to know? And why?"},{"id":"comment-105285","author":"jason_engwer","post":"Joe, We’re in a situation in which reputations are at stake on both sides. If you’re going to frame this situation as one involving “casting aspersions”, then there’s no way to take a position on these matters without casting aspersions in one direction or the other. If it’s wrong in principle to do that to your wife, then it’s wrong in principle to do it to somebody on the other side. But that’s what you’ve been doing. My reference to misleading claims was about the distinction between Jerry Wasserman and George Rossman. In your 2002 article that Caltech responded to and your later reply to Caltech, you say that Adler identified the scientist in question as Rossman. That’s misleading. If Adler gives both the first and the last name of the scientist, and both names differ significantly from George Rossman, then making an unqualified statement that Adler identified Rossman is misleading. Your claim could have been made without any intent to deceive, yet still be misleading. (Elsewhere in my article, when discussing whether people like Heller and Adler lied, I refer to “lying”. I deliberately avoided that sort of terminology in the section we’re discussing. I was intentionally leaving the language ambiguous.) For reasons I explained in the article, it’s probable that Adler was referring to Wasserburg. To lead people to the conclusion that Rossman was identified instead is to mislead. Even if the misleading didn’t involve an intent to deceive, it’s still a form of misleading that Rossman hasn’t been guilty of in any relevant context, as far as I know. When Ray Rogers raised doubts about your wife’s credibility, as described in the Ottawa Citizen article I cited, did you respond to him with the sort of all caps, “I AM EXTREMELY UPSET” approach you’ve taken here? Rogers’ comments were harsher and more dismissive than mine. I think my comments were more restrained than they needed to be and appropriate for the context. You and your wife significantly mishandled your treatment of the 1982 test, and that mishandling has led a lot of people astray on that issue for more than a decade. But I’m grateful for the many good things you and your wife have done in Shroud research over the years, and I’m sure you’ll do more in the years to come. I hope your future work will include a revisiting of the 1982 test. You have the tape of the 1988 interview with Adler, which gives you a significant advantage that the vast majority of other researchers don’t have. I wish you well. I don’t want to be acrimonious. I’ll expand on some of these things when I get a chance to respond to your email, probably tonight or sometime tomorrow..","date":"2014-04-28","mins":"8:50 pm","url":"https://shroudstory.com/2014/04/28/did-a-single-thread-get-tested-in-1982-is-it-important-to-know-and-why/","cat":"carbon_14_dating","title":"Did a single thread get tested in 1982. Is it important to know? And why?"},{"id":"comment-106083","author":"jason_engwer","post":"O.K., How would we get to the conclusion that Rossman probably, not just possibly, was involved? I’m not aware of any evidence to that effect aside from Sue Benford’s alleged phone call with Rossman, which I doubt occurred as she described. I’ve explained some of the reasons why in my article, and I have other reasons. I suspect that most people over the years who have accepted the Rossman allegation have done so primarily on the basis of Al Adler’s alleged testimony. What if those people had known that Adler names the scientist he’s discussing as Jerry Wasserman?.","date":"2014-04-29","mins":"6:34 pm","url":"https://shroudstory.com/2014/04/28/did-a-single-thread-get-tested-in-1982-is-it-important-to-know-and-why/","cat":"carbon_14_dating","title":"Did a single thread get tested in 1982. Is it important to know? And why?"}]
