[{"id":"comment-39450","author":"jason_engwer","post":"Here’s a thread from this past May, in which the same issue was discussed. I still believe that the resurrection offers the best explanation for the Shroud image and other aspects of the Shroud. (Remember, it’s not just a matter of explaining the image. There’s more than an image to explain.) If anybody’s interested, I summarize my reasons for thinking the resurrection is the best explanation in post #14 in that thread. (If the post numbers change because of more posts being added to the thread, then look for a response I wrote to daveb of wellington nz at 6:21 P.M. On May 23.).","date":"2013-07-21","mins":"8:47 pm","url":"https://shroudstory.com/2013/07/20/any-good-reasons-for-associating-anything-supernatural-with-the-shroud/","cat":"image_theory","title":"Any good reasons for associating anything supernatural with the shroud?"},{"id":"comment-34517","author":"jason_engwer","post":"I was aware of the Jospice Mattress, but I wasn’t including it as a similar image. Even if we were to include it, the phenomenon would still be tremendously rare. Barrie Schwortz has described the sort of Maillard reaction that would produce something like the Shroud as “astronomically” unlikely as a natural occurrence. See minute 36 of the second hour of the July 21, 2012 program linked here. It could be suggested, as daveb has above, that “a secondary miracle” occurred, but that would still be distinct from what’s normally classified as a naturalistic explanation. An event, such as an apparent answer to prayer, is often considered miraculous because of its timing or some other aspect of its surrounding context, even if the event wouldn’t be considered miraculous independent of that context. If somebody wants to suggest that the Shroud image was produced by a Maillard reaction that was miraculous in that sense or was produced by some other miracle similar to a Maillard reaction, that’s not what would usually be classified as a naturalistic explanation. One of the questions here is whether we should prefer a series of naturalistic and/or secondary miraculous explanations over a single miraculous explanation (the resurrection). The latter is simpler, we have good evidence independent of the Shroud that it occurred, and it seems to have occurred in a way that’s consistent with the Shroud characteristics. The state of the body image on the Shroud seems consistent with the timing of Jesus’ resurrection, the failure of naturalistic explanations of the Shroud is consistent with the supernatural nature of the resurrection, and the uniqueness of the image is consistent with the uniqueness of the resurrection. Even if it would be argued that the resurrection produced a Maillard reaction or something similar, which in turn resulted in the image we see, the resurrection would still be behind those secondary causes as a root cause. Once you add the other characteristics of the Shroud, like the intact condition of the cloth and bloodstains, it becomes even more untenable to maintain that the Shroud is the result of a series of naturalistic and/or secondary miraculous causes. And the characteristics I’m highlighting here, namely the cloth image and the intact nature of the cloth and bloodstains, make sense as characteristics that an intelligent agent would want to produce. They aren’t just odd occurrences that don’t seem to serve any significant purpose. Rather, the Shroud image is highly significant in multiple contexts, such as in serving as evidence for the events surrounding Jesus’ death. And supernaturally removing the individual from the Shroud (as implied by the intact nature of the cloth and bloodstains) makes sense insomuch that a resurrected individual would have to somehow be removed from the cloths binding him, and that manner of removing the body is more effective in preserving the cloth. Less significantly, but still worth noting, removing the body that way is more dignified. Just as Jesus surely was provided with clothing supernaturally after the resurrection, instead of having to leave the tomb naked and having to find clothing somewhere, it makes sense for him to be removed from his burial cloths in a similar manner. The significance of these characteristics of the Shroud (the image and the intact nature of the cloth and bloodstains) serves as further evidence against the conclusion that the characteristics are just the results of a blind, aimless, purposeless naturalistic process, such as a non miraculous Maillard reaction..","date":"2013-05-23","mins":"6:21 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-34694","author":"jason_engwer","post":"Max Patrick Hamon, I don’t know much about the clothing of ancient Jewish gardeners. But when John 20 refers to “the linen wrappings” remaining in the tomb, the more natural reading seems to be to see the passage as referring to all of the wrappings, not just some. And I’ve tended to think of Jesus’ post resurrection clothing as more extensive than what you seem to be suggesting, perhaps including some sort of head covering. That would help explain why some people didn’t recognize him. That’s not much of an argument, but I think it carries a little weight. We don’t have much to go by here. You could be right. If you are right, then I’d just shift my illustration from the risen Jesus to somebody else. The angels God sometimes sends to earth in the Bible, for example, seem to be supernaturally provided with clothing. When angels visit earth in human form, it’s doubtful that they had to go search for clothing. It would have been provided for them in some supernatural manner, I would think. The same seems likely with the risen saints in Matthew 27:52 53..","date":"2013-05-24","mins":"9:55 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-34381","author":"jason_engwer","post":"Yannick, You’ve made some good points that I agree with. Belief in Jesus’ resurrection doesn’t depend on the Shroud. And I didn’t intend to imply that Ray Rogers was thinking of a miracle when he referred to more than a Maillard reaction being involved. I agree that it would be unreasonable to interpret Rogers that way. I don’t think Barrie Schwortz did anything wrong in mentioning Rogers’ comments in the way he did, and I don’t think I misrepresented anything in my post. Just after I quoted Schwortz’s comments, I mentioned how significant the Shroud would be even if it weren’t best explained by Jesus’ resurrection. I disagree with your comments about a God of the gaps appeal, however. Naturalism of the gaps is no substitute for God of the gaps. We’re under no obligation to endlessly suspend judgment until a naturalistic explanation comes along. Why assume that everything has a naturalistic explanation? You refer to what’s appropriate in “a scientific [discourse]”. But judgments about the Shroud, like judgments about many other matters in life, involve more than science. Philosophy, history, and other fields are involved as well. And the nature of science is itself a disputed issue. If there is a God, and he acts in history, why think that science wouldn’t be able to discern some aspects of that activity? Yes, more than science would be involved, but science wouldn’t be excluded. Similarly, science can discern some aspects of the activity of non supernatural agents, like humans, even though more than science is involved in analyzing human activity. We have good evidence for Jesus’ resurrection and its surrounding context independent of the Shroud. I’m not appealing to ignorance. I’m not appealing to some sort of God of the gaps. Rather, I’m appealing to something, the resurrection, that we have good reason to believe occurred at a time in Jesus’ life that seems to align with the timing of the Shroud image. I’m appealing to an event (the resurrection) that would involve the removal of the body from the Shroud in an unusual way, which aligns well with the unusual intact condition of the cloth and bloodstains. I’m appealing to the supernatural and unique nature of an event (the resurrection), which aligns well with the failure of naturalistic explanations for the Shroud and the Shroud’s apparent uniqueness. In other words, I’m appealing to a series of close alignments between an event we have good evidence for, Jesus’ resurrection, and the Shroud characteristics. That’s not an appeal to a God of the gaps. And it’s preferable to an appeal to multiple naturalistic alternatives, at least one of which has yet to be identified. An appeal to a known resurrection seems preferable to an appeal to a largely unknown naturalism of the gaps. I’m not impressed by the unpaid IO Us of naturalists. You ask how we can be “certain” and “sure” about my conclusions. We don’t need certainty. Probability is enough. And that probability is revisable. If a better naturalistic explanation becomes available in the future, then we can adopt it at that point in time. At the present, however, Jesus’ resurrection is a better explanation. You also ask, “What make you think Jesus is the only crucified person to have left an image on his burial cloth?” I see no reason to think that only crucifixion victims would meet the criteria. Even if we limited our analysis to such individuals, I doubt that no other historical references would have been made to such images if they occurred commonly or even if they occurred more than a tiny percentage of the time. What we have access to today isn’t all that’s relevant. We also have to consider the lack of such cloths mentioned in the historical record. Did people in the ancient world act as though seeing such images on burial cloths was a common thing? How did people in late antiquity and the early medieval era get the notion that such an image would be miraculous if they had been seeing it happen regularly for centuries in non miraculous contexts? Keep in mind, too, that crucifixions and other such executions continue to occur in the modern world. It’s not just a matter of what ancient or medieval sources tell us about burial cloths or equivalent objects. It seems to me that there have been many opportunities for the Shroud image to be duplicated under such scenarios. It hasn’t happened. And I didn’t just appeal to the image on the cloth. I also appealed to the condition of the cloth and what it suggests about how the body was removed. Even if it were common for images like the Shroud image to form, the image isn’t all that needs to be explained..","date":"2013-05-22","mins":"7:09 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-34520","author":"jason_engwer","post":"Yannick wrote: “You got the right to believe this and you also got the right to share it with others, but be certain that no credible scientist that is INDEPENDENT OF MIND on the subject would ever agree with you if he would study all the available data and observations coming from the Shroud.” Those “credible” and “independent of mind” qualifiers are ambiguous and debatable. But what’s the significance of your objection, even if I grant your premises? As I explained in my last reply to you, I’m not limiting myself to scientific conclusions, and I’ve been open about how my Christian beliefs affect what I conclude. All you seem to be saying above is that my conclusions wouldn’t be reached by somebody who’s limiting himself to science and meets your criteria for being “credible” and “independent of mind”. So what? I don’t deny that my conclusions would be different if I applied different standards. And you aren’t giving us any reason to adopt your alternative standards. If a scientist doesn’t believe in Jesus’ resurrection based on the good evidence we have for it that’s independent of the Shroud, then so much the worse for that scientist. He’s wrong. I’m not obligated to follow him in his error. You wrote: “That’s why I said that your opinion on the Shroud is much more a religious one than a scientific one.” Those aren’t the only two categories we should be concerned with. And a religion like Christianity, which bases itself on historical claims and appeals to objective evidence, involves fields of knowledge that are of an evidential nature, such as history. Furthermore, science is likewise associated with other fields of knowledge, such as philosophy and history. Your arguments about science in this thread are philosophical arguments. It’s not as though we can place your arguments in a beaker and test them in a laboratory. (Even if we could, as soon as somebody would report what happened in that experiment, the report would involve historical claims.) None of us rely strictly on science for our conclusions about the Shroud. All of us are bringing philosophical views, historical beliefs, and other non scientific perspectives to the table. You wrote: “But the thing is this : the fact that STURP came up empty doesn’t mean at all that the image is due to a supernatural event linked with the Resurrection of Christ.” I agree. But I didn’t base my argument on STURP’s failure to find a naturalistic explanation. I didn’t even mention STURP. The long train of failed naturalistic explanations goes well beyond STURP. You wrote: “I will conclude with this great quote from Carl Sagan that fits very well in the case of the Shroud image, absence of evidence (for the moment) is not the same thing as evidence of absence…” See what I said earlier about the evidence for the resurrection theory (not just an absence of evidence for an alternative), as well as what I said about naturalism of the gaps, endlessly suspending judgment, etc. Yannick, I agree with you on a lot of the issues that come up on this blog, probably the large majority. When I’m posting on Shroud topics at my blog, I often point people to your comments here. But I’ve never understood why you’re so adamant in opposing supernatural views of the Shroud, given how good the evidence is for such a view..","date":"2013-05-23","mins":"7:00 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-40542","author":"jason_engwer","post":"If Jesus would violate the second commandment by leaving an image on a cloth, then did he violate the commandment when he left footprints on the ground, left fingerprints on objects he touched, cast a reflection of himself on water he walked past, left an image of his appearance in the minds of people who saw him, etc.? Even before the New Testament era, the Jewish people were permitted to include images in the structure of the temple, create a bronze serpent, etc. The second commandment doesn’t forbid all images. Rather, it forbids the creation or use of images for improper veneration. See 2 Kings 18:4 for an illustration of that distinction. As we see in that passage, making and preserving the bronze serpent wasn’t sinful. What was sinful was the improper veneration of the image that eventually developed..","date":"2013-08-05","mins":"7:25 pm","url":"https://shroudstory.com/2013/08/05/why-would-jesus-defy-the-2nd-commandment-and-create-a-graven-image-unto-himself/","cat":"news_&_views","title":"Why would Jesus defy the 2nd commandment and create a \"graven image\" unto himself?"},{"id":"comment-40543","author":"jason_engwer","post":"Regarding Isaiah’s Suffering Servant passages, I see no reason to think the Shroud is inconsistent with them. Isaiah 52:14 refers to the human form in general, not just some parts of it. It seems to be referring to a significant disfigurement, a significant departure from what humans normally look like. The Shroud image meets that standard. Having thorns driven into your head, nails driven through your wrists and feet, scourging wounds covering your back, legs, and other parts of your body, a spear thrust through your rib cage, etc. Constitute a significant disfigurement. How far are we going to take our interpretation of Isaiah? How disfigured are we supposed to think Jesus was? If Jesus didn’t look like a human at all, then what are we supposed to think he looked like? A blob? A giraffe? How were people able to put clothes on Jesus (Matthew 27:31), how were the Roman soldiers able to tell where to place the nails, why did people continue to speak to him while he was on the cross, how was his mouth discernable (Matthew 27:48), how were the Roman soldiers able to discern that he was dead (John 19:33), how was the precise area of his rib cage that needed to be pierced discernable (John 19:34), etc.? Clearly, the Biblical authors I just cited didn’t take Isaiah in the absurd way that some critics of the Shroud suggest we should. Jesus was significantly disfigured. But his body as a whole and individual parts of it were still recognizable as human. That’s what the Bible reports, and it’s what we see in the Shroud..","date":"2013-08-05","mins":"7:45 pm","url":"https://shroudstory.com/2013/08/05/why-would-jesus-defy-the-2nd-commandment-and-create-a-graven-image-unto-himself/","cat":"news_&_views","title":"Why would Jesus defy the 2nd commandment and create a \"graven image\" unto himself?"}]
