[{"id":"comment-39806","author":"jason_engwer","post":"I want to correct something I remembered wrongly. In the study of the death experiences of felons, there was one who had a negative experience. You can read an article about the study here..","date":"2013-07-26","mins":"6:48 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Near Death Experiences and the Shroud of Turin?"},{"id":"comment-39807","author":"jason_engwer","post":"I apologize, but I need to correct something else. The right link for my series of articles on ND Es is here..","date":"2013-07-26","mins":"6:59 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Near Death Experiences and the Shroud of Turin?"},{"id":"comment-39818","author":"jason_engwer","post":"Jesterof wrote: “Except that these inmate studies were NOT standard ND Es” And I didn’t call them ND Es. But they’re closely related. You refer to “when a person experiences DEATH”. But the definition of death is disputed, and ND Es occur under a wide variety of circumstances. For example, they sometimes occur when death is being anticipated, but prior to the event that’s expected to cause it (e.g. A falling person leaving his body and seeing it fall before it hits the ground). Or they occur during the normal course of surgery, when the body is shut down in some way, but the person is expected to survive. To cite one study mentioned in the book by Greyson, et al. That I referenced above, “Whereas 82.5 percent of persons having the NDE believed they had been near death, medical records confirmed their claims in only 45 percent of cases.” (27 28) And having been “near death” isn’t the same as having died. The study of felons that I cited is noteworthy because of the involvement of felons. They’re a class of people who tend to have low moral character. But the same type of result (the nature of the experience not corresponding with the moral character of the experiencer) has been demonstrated in ND Es as well. Even if we were to set aside the felons study for the sake of argument, the same conclusion would remain. You can be a good person by common human standards, yet have a negative NDE. You can be a bad person by common standards, yet have a positive NDE. It happens frequently. And some of the ND Es are mixed (partly good and partly bad) or neutral in some significant way..","date":"2013-07-26","mins":"10:57 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Near Death Experiences and the Shroud of Turin?"},{"id":"comment-39861","author":"jason_engwer","post":"Jesterof wrote: “Death visions BEFORE actual death are not even close to described ND Es – at least not those in the link to the study you have provided – in terms of actual basic conditions they have to meet.” I cited a book by some of the foremost near death researchers in the world, which discusses many cases that are inconsistent with your standards. I also linked an article by Nancy Evans Bush, a prominent researcher in the field. In that article, she makes the same sort of comment I’ve made about similarities between deathbed visions and ND Es: “So far as anyone knows, deathbed visions differ from near death experiences only in the fact that their experiencers don’t come back afterwards. Otherwise, the descriptions are virtually identical.” If you read the book by Greyson, et al. That I cited earlier, you’ll see that ND Es occur under a wide variety of circumstances. And their contents differ widely. For example, tunnels (one of the features you mentioned) are common in ND Es in some parts of the world and among some groups, but not elsewhere. Researchers don’t exclude an experience just because it doesn’t have a tunnel or some of the other features you mentioned. You may disagree with the NDE standards that are commonly accepted in the field, but those are the standards. Remember, the definition of death is itself a disputed issue. For that and other reasons, it makes sense for researchers (and the rest of us) to define ND Es broadly. For example, if a person describes events that occurred far away from his body, events he shouldn’t have known about through his normal bodily senses, then objecting that the person didn’t experience “clinical death” is an insufficient response. In other words, evidence of the paranormal can be present without death having occurred. Even if we limit ourselves to a consideration of the afterlife (not something like the paranormal or religious miracles more broadly), which Dan didn’t do in his original post, there can be implications for the afterlife in ND Es that don’t meet your standard. An NDE can serve as evidence for the existence of the soul, evidence for how a soul would operate outside of a body, etc. Without having the criteria you’ve laid out. And it’s not as though we should expect God to decide what to do in people’s lives based on whether a human definition of clinical death has been met. If God knows that the person will ultimately return to normal human life, then he may withhold any experience of the afterlife from that person. In that sense, there aren’t any ND Es that qualify as experiences of the afterlife. Everybody involved comes back. The clinical death criterion that you’re focusing on has some value, but it has to be qualified by factors like what I’ve outlined above. And ND Es that don’t meet the clinical death criterion still have some significance..","date":"2013-07-27","mins":"1:49 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Near Death Experiences and the Shroud of Turin?"},{"id":"comment-39879","author":"jason_engwer","post":"Jesterof, You’re referring to “some” researchers you don’t name. By contrast, I’ve cited one of the standard books in the field, to which some of the leading researchers contributed. Similarly, see the broad definition of ND Es found at the IANDS web site here. I didn’t “equate” deathbed visions and ND Es. I said they’re closely related. You tell us, “Definition of death is not a disputed issue. TIMELINE is.” The timeline is part of the definition. You say that you’re “against lumping together into ND Es group everything, without clear cut distinctions”. I haven’t suggested that we shouldn’t make clear distinctions. But there’s no reason for you to expect me and other people to single out the one category of ND Es that you’ve singled out and only discuss that category. You tell us what we should do “If one wants to cut off all the possible dismissal from the skeptics”. We don’t need clinical death in order to demonstrate that skeptical explanations are unlikely. I’ve already explained some of the reasons why. Paranormal phenomena can be present without clinical death having occurred. We don’t need clinical death in order to judge that a skeptical scenario is improbable. For example, if a person’s brain is operating at a low level, yet a person had a high level of perception during his NDE, the fact that the person wasn’t clinically dead doesn’t explain why he had such a high level of perception during the NDE. The skeptic still has some explaining to do. You go on to refer to “pure” standards and how CPR “kind of clouds” our judgment. You seem to be setting the bar too high. All we need is a probability. Even if it’s just a slight probability, that’s enough. We’d prefer to have a higher level of probability, but a preference isn’t equivalent to a necessity. If there seems to be a probability that an NDE is paranormal, but a skeptic isn’t convinced by it, then so much the worse for the skeptic. He’s not our measuring stick. I agree that the Pam Reynolds case is significant. For those who don’t know much about ND Es, that case is a good one to start with. A lot of the popular ones are of a much less evidential nature..","date":"2013-07-27","mins":"7:20 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Near Death Experiences and the Shroud of Turin?"},{"id":"comment-39978","author":"jason_engwer","post":"Jesterof wrote: “I named her – it was YOUR link on Ms. Bush. The other one is Pim van Lommel” Even if we assumed that both of those researchers were following the standards you’re suggesting, they’d still be far outnumbered by the other researchers I cited. But nothing in the article by Nancy Evans Bush, which I linked above, suggests that she disagrees with what I said. She was a contributor to the book I cited by Greyson, et al. She served as president of IANDS in the past, the organization whose web site I linked above. And I quoted her comments on the relationship between ND Es and deathbed visions. She cited the felon study and related it to ND Es. And you can’t conclude that because Pim van Lommel conducted a study in a particular way, then he must deny that any experience that occurs under other circumstances is an NDE. Nor can you conclude that he’d deny that other ND Es have any relevance to a discussion like the one that’s occurring in this thread. If you want to cite van Lommel in support of your position, you’ll need more than what you’ve asserted above, and you’ll need to provide documentation for it. Here’s part of what van Lommel and his colleagues say about ND Es in their study results published in 2001: “NDE are reported in many circumstances: cardiac arrest in myocardial infarction (clinical death), shock in postpartum loss of blood or in perioperative complications, septic or anaphylactic shock, electrocution, coma resulting from traumatic brain damage, intracerebral haemorrhage or cerebral infarction, attempted suicide, near drowning or asphyxia, and apnoea. Such experiences are also reported by patients with serious but not immediately life threatening diseases, in those with serious depression, or without clear cause in fully conscious people. Similar experiences to near death ones can occur during the terminal phase of illness, and are called deathbed visions. Identical experiences to NDE, so called fear death experiences, are mainly reported after situations in which death seemed unavoidable: serious traffic accidents, mountaineering accidents, or isolation such as with shipwreck.” Notice that they not only disagree with you about the definition of ND Es, but also make comments about deathbed visions similar to my comments and those of Nancy Evans Bush. They applied narrower standards to the study they were conducting, but it doesn’t follow that they held the same view you do of any experience that doesn’t fall within those narrower standards. For example, if a researcher wanted to focus on ND Es among children, and thus only included children in a study he conducted, it wouldn’t’ follow that he thinks an experience involving an adult doesn’t qualify as an NDE..","date":"2013-07-28","mins":"5:16 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Near Death Experiences and the Shroud of Turin?"},{"id":"comment-40016","author":"jason_engwer","post":"Jesterof, Your first post in this thread refers to “the real experiences ( neurosurgeon’s do not fit) – when the person is in clinical death stage”. In later posts, you disputed my definition of ND Es and dismissed the sources I cited in support of it. You cited Evans Bush and van Lommel as examples of “some” researchers who define ND Es differently. Now that I’ve shown that those two researchers seem to have defined ND Es more broadly than you suggested, you’re acting as if you didn’t dispute the point. If you weren’t disputing the point, then you repeatedly miscommunicated your view in previous posts. You then go on to distinguish between what researchers “think” and “the data they present”. Since I’ve cited comments they and their colleagues have written, I’m not just appealing to what they think, in the sense of what thoughts are in their minds. Rather, I’ve been citing the definitions they’ve put forth in published works..","date":"2013-07-29","mins":"5:04 am","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Near Death Experiences and the Shroud of Turin?"},{"id":"comment-39980","author":"jason_engwer","post":"Jesterof, As I said earlier, Dan Porter’s original post in this thread doesn’t limit itself to people who were clinically dead, who went through a tunnel, and met all of the other criteria you’ve been suggesting. You keep expecting me to address a narrower topic than Dan suggested in his original post, a narrower topic I never claimed to be addressing. Your suggestion that the felons in the study cited by Evans Bush might have been falsely imprisoned is a weak objection. The vast majority of the felons had positive deathbed experiences. Are you going to suggest that there’s a 50/50 chance or a probability that all of them were innocent of the crimes they were imprisoned for? If so, why should we believe that? If not, then what are you suggesting? That perhaps most of them were falsely imprisoned? Again, why should we believe that? And if only most were falsely imprisoned, how do you explain the positive experiences among those who weren’t imprisoned falsely? You object that the experiences are pre death, but I’ve explained why ND Es that occur after clinical death are problematic as well. The experiencers haven’t died in the ultimate sense. If the afterlife is governed by God, he’d know who will return to life on earth and who won’t. He wouldn’t be dependent on a human definition of clinical death. Just as deathbed visions may not represent what happens after death in the ultimate sense of the term, the same may be true of ND Es (and I would argue that it is, indeed, true of ND Es). Your position on the relationship between the character of people who have ND Es and the nature of their experiences is ambiguous to me. I don’t know whether you’re only disputing the felon study I cited or you’re disputing my broader conclusion as well. Do you deny that ND Es sometimes don’t correspond to the character of the experiencer? If so, see pages 124 125 in the book by Greyson, et al. Cited above. For example, there’s discussion of “a physically abusive prostitution solicitor (‘pimp’) who had a pleasurable NDE – and was subsequently reformed” and “an NDE that included the distressing element of an encounter with the devil – in a five year old boy with no atypical history of antisocial acts”. The authors of the chapter (Janice Holden, Jeffrey Long, B. Jason Mac Lurg) say that further research into this topic is needed, but conclude that “It appears not to be the case that ‘good’ people have pleasurable ND Es and ‘bad’ people have distressing ND Es.” Nancy Evans Bush has reached the same type of conclusion, as I’ve documented. And she had a negative NDE herself. From what I can tell, she wasn’t an unusually bad person at the time. I would say he same of other people whose negative NDE accounts I’ve read. Then there are the cases where an experiencer has multiple ND Es, both heavenly and hellish, without any corresponding change in character (ibid., 76). Or a person will have an NDE that starts negative, then becomes positive or vice versa (ibid.). For other examples of negative ND Es among children, including young ones, see pages 89 and 246..","date":"2013-07-28","mins":"6:21 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Near Death Experiences and the Shroud of Turin?"},{"id":"comment-40018","author":"jason_engwer","post":"Jesterof, I’ve demonstrated that many ND Es don’t involve clinical death, according to common definitions used by researchers in the field. Therefore, it’s insufficient for you to object to the citation of deathbed visions on the basis that they’re pre death. You write: “Logically speaking one would assume that people with bad life history would experience hellish ND Es, and good ones – nice ones.” Whether we’d expect such a correspondence depends on the nature of the experiences. For reasons I’ve explained, I consider ND Es roughly analogous to dreams or virtual reality. Under my view, I wouldn’t expect what you’re saying we should logically assume. Just as a good person can have nightmares, a good person can have a negative NDE. Just as a bad person can have a pleasant dream, a bad person can have a pleasant NDE. Maybe this issue is part of what’s motivating your disagreement with me. Do you consider ND Es to be a highly objective experience of the afterlife or some sort of highly objective foretaste of it?.","date":"2013-07-29","mins":"5:23 am","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Near Death Experiences and the Shroud of Turin?"},{"id":"comment-39804","author":"jason_engwer","post":"Yannick wrote: “In other word, for Father Yves Girard, these near death experiences are something like visiting the vestibule of eternity; a place which is still far from God’s Kingdom.” I agree. That’s a good way of putting it..","date":"2013-07-26","mins":"6:31 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Near Death Experiences and the Shroud of Turin?"},{"id":"comment-39799","author":"jason_engwer","post":"Esquire magazine recently ran a story that’s critical of some of Eben Alexander’s claims about his alleged near death experience. See here for a summary..","date":"2013-07-26","mins":"5:52 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Near Death Experiences and the Shroud of Turin?"},{"id":"comment-39803","author":"jason_engwer","post":"Jesterof, I agree that the Esquire article isn’t enough of a basis for dismissing ND Es in general. My only intention was to address Eben Alexander’s case in particular..","date":"2013-07-26","mins":"6:27 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Near Death Experiences and the Shroud of Turin?"},{"id":"comment-39802","author":"jason_engwer","post":"The best resource I’m aware of on near death experiences (ND Es) is The Handbook Of Near Death Experiences (Santa Barbara, California: Praeger Publishers, 2009). It’s edited and authored by Bruce Greyson, Janice Holden, and some of the other foremost near death researchers in the world. It goes into a lot of depth and approaches the subject from many angles. My view is that ND Es are something like supernatural dreams. Other people compare them to virtual reality. What’s important to understand is that there’s both an objective and a subjective factor to them that needs to be explained simultaneously. If anybody is interested, here’s a series of articles I’ve written on the subject over the last few years. Keep in mind that not all ND Es are positive (heavenly). Nancy Evans Bush, probably the leading researcher in the world today on negative (hellish) ND Es, places the portion of reported ND Es that are negative at seventeen percent. Given how reluctant people often are to talk about negative ND Es, the actual percentage is likely significantly higher. In addition to heavenly and hellish ND Es, there are some that have elements of each. An NDE starts out negative in some manner, then becomes positive. Or the reverse happens. Or a negative element interrupts an otherwise positive experience. Sometimes one individual will have multiple ND Es, and there will be a combination of positive and negative experiences. And some could be called neutral in the sense that they don’t involve an arrival at anything like Heaven or Hell. There are shared death experiences (SD Es) as well. Multiple people share an experience. ND Es (and SD Es) widely contradict each other. They don’t just differ in religious content, but also in other ways. For example, they differ in whether there’s a judgment (or life review, etc.) and the nature of the judgment if there is one. A recent study of the deathbed experiences of felons (unrepentant murderers, rapists, etc.) found all of them having positive experiences. By contrast, people who are good by common human standards often have negative ND Es. It’s important to realize that, despite common perceptions to the contrary, the nature of ND Es does not correspond with the character of the people who experience them. If you think everybody or almost everybody goes to Heaven, or that you just need to meet some common standard of goodness to get there, ND Es do not confirm such a view. The best source for information on the afterlife remains the Bible. We can gain some information from ND Es. They are supernatural, and they do serve as evidence of an afterlife. But they’re also highly subjective and inconsistent. Again, I think it’s helpful to look at them as something like a supernatural dream or supernatural virtual reality..","date":"2013-07-26","mins":"6:24 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Near Death Experiences and the Shroud of Turin?"},{"id":"comment-33139","author":"jason_engwer","post":"Yannick, I don’t know just what distinction you’re drawing between a sign and evidence. But I agree with Ron. In the way in which I use the term “evidence” and have seen others commonly use it, I think it’s an appropriate term here. But you may be defining the term differently, and your objection may make sense under a different definition. We have good reason to believe in Jesus’ resurrection on grounds that are independent of the Shroud. Something left an image on the cloth and the body was removed, in the manner referred to by daveb and Ron above. The timing of the image and body removal line up well with the timing of the resurrection reported in the ancient sources. The resurrection is the best explanation we have for the combined data of the image formation, the body removal, and the timing of those events. What’s the alternative? That some highly unusual natural event, which would explain the image formation and/or body removal, happened to occur around the time of the resurrection? That some supernatural event other than the resurrection, which would explain the image formation and/or body removal, happened to occur around the same time? We already have good reason to accept the resurrection, and it explains the Shroud so well. Why look for some more complicated and more speculative alternative?.","date":"2013-05-07","mins":"6:13 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33201","author":"jason_engwer","post":"Yannick, I agree that we don’t have “sure scientific proof”. But I don’t think people usually have that concept in mind when they refer to “evidence”. Historians often refer to historical evidence for a conclusion when they have nothing more than a probability in mind..","date":"2013-05-07","mins":"5:54 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33100","author":"jason_engwer","post":"Dan, Have you considered including a more extensive topical index on your blog? Maybe have a section on your side bar that links to posts on a wider range of topics that frequently come up (like the objection based on the length of Jesus’ hair). That would make it easier for people to find things on the blog, and it would save you and others time when those topics come up again in the future. Also, have you ever put together a collection of audio and/or video files on the Shroud? Or do you know of anybody else who has? If nobody’s done it yet, it would be a good idea to have a large collection of audio files on Shroud related topics, for example, in one location. Maybe you’ve already done these things, and I don’t know about it. If you haven’t, I don’t want to burden you with it. I’m just making suggestions, if you’d have the time and interest to do these things at some point. Regardless, I appreciate the work you’re already putting into the blog. It’s a valuable resource..","date":"2013-05-06","mins":"7:12 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33135","author":"jason_engwer","post":"Jesterof wrote: “people had so many different hairstyles, and since society was so separated depending on the social ladder there is no reason not believe long hair together with a shorter one was totally possible.” I agree. Some of the scholars I wrote to on this subject made similar points. There probably would have been a wide variety of hairstyles, influenced by factors like where people were on the social ladder of their day. Still, although the principle you’re appealing to makes sense in the abstract, it’s helpful to have some concrete examples of long hair being accepted in ancient Jewish contexts. That’s what I wanted to provide in my article..","date":"2013-05-07","mins":"5:51 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33141","author":"jason_engwer","post":"The ancient Christians and their Jewish opponents were in agreement that the tomb was empty, as we see in Matthew’s gospel, Justin Martyr, and other ancient sources. The dispute was over how the tomb became empty, not whether it was empty. The idea of a non physical resurrection is highly inconsistent with the evidence we have. Paul and the other early Christians held the traditional Jewish belief in a physical resurrection. For a lengthy refutation of the notion that Paul and other ancient Christians believed in a non physical resurrection, see Michael Licona’s The Resurrection Of Jesus (Downers Grove, Illinois: Inter Varsity Press, 2010), which is based on his doctoral dissertation on the subject. For example, he writes the following about 1 Corinthians 15:44 “Moreover, it is worth observing that had Paul desired to communicate this sort of contrast [between the physical and the non physical], he had better words at his disposal, one of which he had employed just a few chapters earlier [in 1 Corinthians 9:11] while using a seed analogy similar to that of 1 Corinthians 15….if he had desired to communicate that our resurrection body would not be physical but rather immaterial in nature, why use the former term in a sense not employed earlier in his letter or for that matter anywhere else in the Pauline corpus, the New Testament or by any known author from the eighth century B.C. Through the third century A.D., while ignoring a clearer term used just a few chapters earlier in a similar seed analogy?…I located 846 occurrences of the former [the term ‘natural’ in 1 Corinthians 15:44] from the eighth century B.C. Through the third century A.D. And could not locate a single occurrence of the term that meant ‘physical’ or ‘material.’ This discovery in itself eliminates any interpretation of 1 Corinthians 15:44 that has Paul asserting physical corpses are buried while resurrection bodies will be immaterial (a la Wedderburn, RSV/NRSV et al.).” (414 415, 618).","date":"2013-05-07","mins":"6:22 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33132","author":"jason_engwer","post":"Daveb, Long hair on men is widely accepted among Evangelicals. (I’m an Evangelical myself.) Depictions of Jesus in Evangelical contexts frequently portray him with long hair. It’s common in artwork, movies, etc. I think only a small minority of people in Evangelical circles object to the long hair on the Shroud. But that minority is disproportionately vocal and has a significant tradition behind it. I’m familiar with the argument from long hair on modern Jewish men. While that argument has some significance, it doesn’t carry much weight. We’re two millennia removed from Jesus. Traditions often change over time, including on matters more important than hairstyle. We should be focused on the evidence we have for hairstyles closer to and before the time of Jesus. (I’m including the pre Christian era because opponents of long hair often suggest that ancient Jews or ancient cultures in general, not just right around the time of Jesus, were opposed to long hair on men.) It’s not enough for advocates of the Shroud to just do something like point to long hair among modern Jewish men or cite scholars claiming that ancient Jewish men had long hair, without any accompanying evidence. We ought to do more than that. In my experience, though, those who are defending the Shroud seldom do more. I agree that 1 Corinthians 11:14 is important in this context. I address the passage (by linking to some other articles on it) in my post I cited earlier. The apostle Paul spent a lot of time in Israel and was highly knowledgeable about Jewish life. We have good evidence that he saw the risen Jesus, performed many authenticating miracles as an apostle, and was supported in his authority claims by the other apostles and mainstream early Christianity in general. Paul is a highly credible historical witness, one whom Christians are obligated to obey. We shouldn’t be dismissive of Paul or 1 Corinthians 11. And neither Paul’s work in general nor 1 Corinthians 11 in particular is inconsistent with the Shroud..","date":"2013-05-07","mins":"5:40 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33142","author":"jason_engwer","post":"Matthias, Every gospel has the tomb empty. Three of the four have Jesus being physically touched and so forth. The only reason why Mark doesn’t is because his gospel ends at Mark 16:8, where the resurrection appearances have been promised, but haven’t been narrated. As 1 Corinthians 15:1 11 indicates, Paul was in agreement with the other early Christian leaders with regard to the resurrection. Later in the same passage, he refers to Jesus’ resurrection as the firstfruits of the future resurrection of believers, which is more than just a resuscitation. Furthermore, 1 Timothy 5:18 most likely is citing Luke’s gospel as scripture. Thus, Paul is indirectly affirming Luke’s highly physical portrayal of the resurrection. (I believe that Paul wrote 1 Timothy, but even if one were to reject that view, the document still represents the early beliefs of people who were close to Paul and thought highly of him. There’s a good chance that their view would be the same as Paul’s. Surely we wouldn’t assume that they contradicted Paul as our default position.) The earliest Pauline churches, as reflected in the early patristic literature, also accept a highly physical view of Jesus’ resurrection like that found in the gospels. This sort of evidence, and much more could be cited, suggests that Paul and the gospel writers held the same view of Jesus’ resurrection..","date":"2013-05-07","mins":"6:35 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33203","author":"jason_engwer","post":"Daveb wrote: “Firstly I am not being dismissive of 1 Cor 11:4 16. But I see it in the context of what was to be considered the proper conformity of dress and appearance of a Corinthian Christian in the 1st century, as addressed by a missionary well familiar with Greek and Roman culture. It might be seen as unnecessarily socially provocative not to conform in this way. To then argue that therefore Christ was necessarily short haired and beardless is grasping a straw and to read a message into scripture that is not there.” I agree. You write: “You may look in vain for images of 1st century Jews to discover their hair style, as you would be aware that they were averse to any kind of images. However in his 1978 ‘The Turin Shroud’, Wilson cites two authorities quite independently of the Shroud, H Gressman and Daniel Rops. Gressman’s work is in German; Daniel Rops work is ‘Daily Life in Palestine at the Time of Christ’ (Londom Weidenfeld 1962).” I was aware of both sources, and I got a copy of one of Daniel Rops’ books last year, when I was researching my article. I didn’t find any extra Biblical documentation in his book, and I was already familiar with the Biblical data. I’ve come across a lot of sources of that nature. They make a claim about ancient hairstyles, but they don’t offer much support, if any, for their claim. The testimony of scholars has some value, but it would be better if their claims were accompanied by evidence. I haven’t checked Gressman. I don’t know much German. There are some images depicting Jews in and around the first century, largely images produced by Gentiles. I mention some of them in my article. We also have comments on Jewish hairstyles in some ancient literature. Scholars could cite such sources when discussing this subject, but they often don’t. Maybe Gressman does. If Daniel Rops does so, it must be somewhere other than where I read him. The scholars I emailed didn’t have much to offer, and they often commented on how little evidence there is to go by..","date":"2013-05-07","mins":"6:20 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33098","author":"jason_engwer","post":"Regarding the issue of Jesus with long hair, I wrote an article on the subject here. I emailed several scholars on the subject, and they didn’t provide much that was helpful, so I pulled together some resources I found in my own research. If we want Christians (and others) to stop objecting to the Shroud on the basis of the length of the hair that’s depicted, then we ought to respond to that objection in detail and with direct and persuasive counterarguments. (It’s not enough to just quote a scholar, or more than one of them, saying that Jesus could have had long hair. Many people will want to know what evidence leads a scholar to that conclusion.) If we’re just dismissive of the objection, without addressing it in sufficient detail, then we’re not going to persuade people we might otherwise have persuaded, and we might alienate them even further. Some fundamentalists, atheists, and other people who often object to the Shroud could be persuaded if they’re offered evidence and argumentation. The fact that somebody currently holds a particular position, such as atheism, doesn’t tell you how close he is to transitioning to some other position or what would bring about that transition. But even if an atheist is unreasonable, why focus on him? Other people are looking on. In an online forum like this one, you don’t know who’s reading your posts. A good general approach to take is to follow the example set by the apostles in Acts: “explaining and giving evidence…welcoming all who come” (Acts 17:3, 28:30). The Holy Spirit converts people to Christianity supernaturally, but he often does so through evidence and argumentation. God, after all, is the one who gave us our minds. It’s not as though he’s opposed to the sort of intellectual activity that we see in Acts and so many other places in the Bible. To the contrary, anti intellectualism is a sin. Dan mentioned Thomas de Wesselow. Of course, Barrie Schwortz is another non Christian who accepts the Shroud. Another non Christian who comes to mind is Michael Prescott. He operates a popular paranormal blog, and he thinks the Shroud is authentic, even though he’s not a Christian. The Shroud is evidence of Jesus’ existence, and I think it’s evidence of his resurrection. But those aren’t the only issues involved. The Shroud also has implications for the accuracy of the gospels, for example (Jesus’ age, that he had something like a crown of thorns placed on his head, that he was crucified with nails, that he was pierced through his side, etc.). If an atheist were to accept the Shroud, yet deny that it implies Jesus’ resurrection, he’d still have to address what the Shroud implies about the accuracy of early Christian sources on other subjects..","date":"2013-05-06","mins":"6:53 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-35402","author":"jason_engwer","post":"I don’t know what you mean by “confused discussion”, daveb, but here’s the thread if anybody wants to read it..","date":"2013-05-30","mins":"7:03 pm","url":"https://shroudstory.com/2013/05/30/how-can-you-argue-with-this/","cat":"other_blogs","title":"How can you argue with this?"}]
