[{"id":"comment-212598","author":"jason_engwer","post":"Here’s a somewhat lengthy discussion of whether it makes sense to dismiss the Shroud as demonic. Most of the discussion is in the comments section of the thread, so you may want to read beyond the initial post. We have a lot of evidence for the acceptability of long hair among ancient Jews. I’ve provided some examples here, if anybody is interested. Regarding whether the Shroud is consistent with Isaiah 52:14, see my August 5 posts in the thread here..","date":"2015-10-15","mins":"5:17 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-210002","author":"jason_engwer","post":"Joe’s citation of Gove’s book, regarding Flury Lemberg, is found on page 155. Here are some of William Meacham’s comments regarding how much Flury Lemberg knew about the Shroud at the time of the 1986 workshop: “I recall feeling at the time that this was unthinkable – someone who knew nothing about radiocarbon dating and little about the Shroud, and who apparently had not seen the cloth or read the reports on its study, would be nominated to pick a spot and take a sample. Ultimately the responsibility for bringing Flury Lemberg into the Shroud arena lies with [Teddy] Hall.” (The Rape Of The Turin Shroud [Lulu, 2005], 71 2) And here’s Meacham’s description of Flury Lemberg’s comments and the responses at the 1986 workshop: “Flury Lemberg maintained that it did not matter where one took the sample from, since the Shroud was all a homogeneous cloth. Adler begged to disagree, citing the very different chemistries apparent in the scorched areas, the water stain margins, the image areas and the edges. I argued, as I had in correspondence with Gonella, that the edges were anomalous and might have been treated in some way. After more in this vein, Chagas put an end to the discussion by proclaiming that the Shroud was not an archaeological site, sampling should be straightforward and a single sample divided into six or seven pieces would be sufficient. Adler and I shook our heads in dismay. Although we did not know it, the seeds of the imminent disaster that was to befall the Shroud had been planted.” (74 5).","date":"2015-09-09","mins":"6:32 pm","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"},{"id":"comment-94327","author":"jason_engwer","post":"Jerry Coyne ought to interact with something like Craig Keener’s two volume work Miracles (Grand Rapids, Michigan: Baker Academic, 2011). Keener is a highly regarded New Testament scholar who recounts many miracles that he and his associates have experienced, as well as a large number of other miracles in modern times. He includes cases with medical documentation (e.g., before and after x rays), multiple eyewitnesses, and corroboration from hostile sources, for example. He also interacts at length with David Hume’s philosophical objections to miracles. He cites a lot of polling data from around the world showing that hundreds of millions of people claim to have experienced at least one miracle firsthand. If anybody is interested, I wrote a series of posts about Keener’s work a couple of years ago. You can find it here. In the series, I cite many of Keener’s findings and give examples of miracle cases he discusses that are accompanied by documentation. Coyne could also interact with the work done by modern paranormal researchers. Say, Stephen Braude’s documentation of some modern paranormal cases. His book The Gold Leaf Lady (Chicago, Illinois: The University of Chicago Press, 2007) is a good introduction to modern paranormal research. Here’s a video of a lecture Braude delivered a few years ago, in which he discusses the evidence for some modern paranormal cases. It should be noted that though the video is labeled as a discussion of the Ted Serios case, Braude discusses more than that one case. What Braude writes about the dishonesty of some (not all) skeptics is largely applicable to some (not all) skeptics of the Shroud as well: “Nevertheless, with his usual bluster, [James] Randi accepted a $10,000 challenge (a considerable sum in those days) to duplicate the Serios phenomena and make good on his claim. Of course, confidence is easy to feign, and Randi does it routinely in his role as magician. He also cleverly takes advantage of the occasional high profile case he successfully exposes as fraudulent, by publicizing those successes and creating the impression that he’s a generally reliable guide when it comes to the paranormal. So Randi’s dismissal of the Serios case was all it took for those already disposed to believe that Serios was a fake, and it was probably enough even for those sympathetic to parapsychology but unaware of Randi’s dishonesty….What the TV audience never learned was that when the show was over and Randi was pressed to make good on his wager, he simply weaseled out of it. To keep that side of the story under wraps, Randi prohibited publication of his correspondence on the matter. That was undoubtedly a shrewd move, because the letters show clearly how Randi backed down from his empty challenge. However, Randi’s original letters now reside in the library at the University of Maryland Baltimore County, and researchers, finally, can easily confirm this for themselves. When Serios’s principal investigator, Jule Eisenbud, died, I was assigned the task of going through his papers. I collected all the material relevant to the Serios case and deposited it in the Special Collections section of the UMBC library. (This includes correspondence, the original photos and film, and signed affidavits from witnesses.)…But there’s no documentary evidence of Randi having even attempted to duplicate the Serios phenomena under anything like the conditions in which Serios succeeded, much less evidence of his having actually pulled it off….In fact, the history of parapsychology chronicles some remarkable examples of dishonest testimony and other reprehensible behavior on the part of skeptics….Skepticism is just as glib and dishonest now as it was in 1882 when the British SPR was founded. In fact, despite sensible and careful dismantling of the traditional skeptical objections, the same tired arguments surface again and again. And those arguments all too easily mislead those who haven’t yet heard the other side of the story or examined the evidence for themselves.” (The Gold Leaf Lady [Chicago, Illinois: The University of Chicago Press, 2007], 22, 34, 126).","date":"2014-03-28","mins":"6:03 pm","url":"https://shroudstory.com/2014/03/28/thanks-for-mentioning-the-shroud-of-turin-again/","cat":"article","title":"Thanks for mentioning the Shroud of Turin again"},{"id":"comment-193234","author":"jason_engwer","post":"I agree with John Green, David O., and daveb of wellington nz. The evidence suggests that Mary wasn’t a perpetual virgin. I’ll get to the New Testament evidence below, but I first want to note that most of the earliest extrabiblical sources to address the subject are opposed to the concept that Mary was a perpetual virgin: Josephus, Hegesippus, Irenaeus, Tertullian, Hippolytus, and Victorinus, for example. See the following for a discussion of the earliest sources: http://triablogue.blogspot.com/2007/03/perpetual virginity of mary.html The New Testament uses multiple phrases that are most naturally interpreted as inconsistent with perpetual virginity. The authors used those terms even though terms more consistent with perpetual virginity were available to them and were used elsewhere, sometimes even by the same author. Consider Luke, for example. How do you explain a document like Luke’s gospel, which repeatedly uses the term “relative”, even distinguishing between “brothers” and “relatives” (21:16), yet uses “brothers” to refer to Jesus’ siblings? Did Luke believe in the perpetual virginity of Mary, yet repeatedly chose to use terminology that would suggest the opposite while refraining from using terminology he does use elsewhere, terminology that wouldn’t be so misleading? Luke was willing to qualify his description of Joseph as “supposedly” the father of Jesus (3:23), even though the earlier references to the virgin birth made it obvious that Joseph wasn’t Jesus’ father biologically. Yet, Luke never adds such qualifiers regarding Jesus’ siblings. Again, did Luke believe in the perpetual virginity of Mary, yet repeatedly used terminology that suggested the opposite and repeatedly refrained from adding clarification that he did add when discussing a similar subject? Luke uses the term “firstborn” when discussing Jesus (2:7), even though he could have used “only born”, as he does of people other than Jesus elsewhere (7:12, 9:38)..","date":"2015-03-12","mins":"5:08 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"id":"comment-193235","author":"jason_engwer","post":"By the way, in case Dan and others here aren’t aware of it, Antonio Lombatti has written a review of CNN’s Shroud program: http://bibleinterp.com/opeds/2015/03/lom398011.shtml If anybody’s interested, I’ve written a reply to him: http://triablogue.blogspot.com/2015/03/antonio lombattis claims about shroud.html.","date":"2015-03-12","mins":"5:11 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"id":"comment-193241","author":"jason_engwer","post":"Since it’s mentioned above, I want to address John 19:26 7. Most likely, the reason why Jesus entrusts Mary to John in that passage is because Jesus’ siblings were still unbelievers at the time (e.g., John 7:5). Jesus’ brothers would become believers shortly afterward, but becoming a believer isn’t the same as being mature in the faith. Jesus repeatedly emphasized the point that spiritual relationships are more important than biological ones, though the latter do have some significance. He’s addressing that issue again in John 19. For those who hold the position that the brothers of Jesus were cousins or relatives of some other sort, it still needs to be explained why Jesus chose John over those relatives. In other words, it’s not as though opponents of Mary’s perpetual virginity are the only ones who need to explain John 19:26 7. The best explanation for the passage is that Jesus was giving priority to spiritual ties over blood relations, as he does repeatedly elsewhere. Thus, the passage does nothing to advance the case for perpetual virginity..","date":"2015-03-12","mins":"5:25 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"id":"comment-193294","author":"jason_engwer","post":"Rick, In a 1:20 P.M. Post yesterday, you criticized the alleged dangers of “interpreting the Bible personally”. Yet, you’re giving us your personal interpretation of Fatima, your personal interpretation of Genesis 3:15, etc. There’s nothing wrong with personal interpretation. It’s unavoidable. How would you objectively determine that Roman Catholicism has the authority it claims to have, judge how to understand Roman Catholic documents, etc. Without engaging in personal interpretation? Since there’s nothing wrong with personal interpretation, and it’s impossible to avoid engaging in it, you shouldn’t have criticized it. With regard to the sinlessness of Mary, the Bible itself records some examples of Mary’s sins, and church fathers and Popes for hundreds of years denied that she was sinless: http://triablogue.blogspot.com/2006/09/some early sources on sinlessness of.html http://triablogue.blogspot.com/2006/09/some later sources on sinlessness of.html You refer to Mary as a New Eve. There’s a sense in which she is a sort of second Eve. But the concept is vague enough to be interpreted in a lot of ways. Mary’s alleged sinlessness, for example, doesn’t logically follow from viewing her as a New Eve. For instance, Tertullian refers to Mary as a New Eve and a sinner within the same document (see sections 7 and 17 in his treatise On The Flesh Of Christ). As Hans von Campenhausen noted: “To how small a degree Mary as a holy person forms the centre of interest can be realized from the fact that the comparison with Eve must by no means be concentrated on her alone. ‘Generally speaking, every woman who plays a part in the salvation of God’s people can be understood exegetically as a type of the new Eve’. Even in Hippolytus, for example, the women who go to the grave on Easter morning are similarly contrasted with Eve – a kind of view that lasts into the fifth century – and Origen compares the two ‘holy women’, Elizabeth and Mary, with Eve. Ambrose parallelizes Eve and Sarah, and emphasizes that there were many Marys before the one Mary brought the great fulfilment….Again and again it is a question here of the ‘woman’ or ‘the women’ as such, who thus receive their due. Nothing like that would have been possible if the Eve Mary typology had had only a ‘Mariological’ meaning from the outset.” (The Virgin Birth In The Theology Of The Ancient Church [Eugene, Oregon: Wipf & Stock, 2011], 45 6) Regarding Fatima, one problem with appealing to Marian apparitions is that they’re internally inconsistent. On the one hand, the latest apparitions supposedly support the latest Roman Catholic teachings on Mary. On the other hand, the same apparitions assume or assert a traditional, high Catholic view of scripture. Yet, scripture contradicts Catholic Marian doctrines, like her alleged sinlessness. Another problem with Marian apparitions is that they’re outweighed by other evidence. Much as Moses outperformed the magicians of Pharaoh and Jesus outperforms the miracles of Satan and the Antichrist in the book of Revelation, the Marian apparitions can be outweighed by other miracles. The network of miracles surrounding Jesus as an individual and the Bible as a collection of literature is far more significant than the miracles surrounding Marian apparitions. If a Marian apparition contradicts Jesus and the Bible, then so much the worse for the apparition. If anybody’s interested, here’s a place where I’ve made a case for the historicity of Christian miracles and how to judge between competing miracle claims: http://triablogue.blogspot.com/2012/11/a christian case for miracles 2.html.","date":"2015-03-13","mins":"11:44 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"id":"comment-193317","author":"jason_engwer","post":"Rick, Your claims about Jesus, the Holy Spirit, and the church depend on your personal interpretation. Why do you believe that Jesus existed as a historical figure, that he was the Messiah, that he founded a church, etc.? Those are all historical judgments that you’re making, using your own fallible personal interpretation. In order to arrive at the (false) conclusion that there’s a church with the attributes you’re assigning to the Roman Catholic denomination, you have to engage in a series of personal interpretations. Every time you interpret a Roman Catholic document, you’re relying on personal interpretation..","date":"2015-03-13","mins":"8:05 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"}]
