[{"id":"comment-214990","author":"robert_w_siefker","post":"Charles, TSC’s Critical Summary states the following: “This (reweave) hypothesis suggests that the corner of the Shroud from which the radiocarbon sample was cut was repaired with younger materials sometime during the Shroud’s history in Europe. While some evidence has been offered in support of the reweave hypothesis there are important counter arguments. Among the latter is the fact that the textile experts who were involved in the 2002 Shroud conservation project examined the sample area and reported they could not identify or find explicit evidence of any reweaving. Also, TSC has carefully studied the X ray and transmitted light photographs taken by STURP of the sample area and has seen no evidence of reweaving in this type of imagery. TSC thinks the negative evidence for reweaving is difficult to overcome and that the ultimate answer to the anomalous radiocarbon testing result lies elsewhere.” The conclusion that the Shroud was in Constantinople in 1204 is strongly supported, both historically and empirically. Such a conclusion means the radiocarbon dating of the sample cut from the Shroud failed to date the Shroud correctly. However, why the radiocarbon dating of the 1988 single sample cut from the Shroud did not properly date the Shroud’s true age remains a valid unresolved question that merits continued research. TSC is most interested in exploring “enhanced contamination” other than that associated with a reweave. Others are encouraged to continue to investigate the reweave hypothesis..","date":"2015-11-22","mins":"9:28 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-214977","author":"robert_w_siefker","post":"Jackson did not ever say there was no disturbance to the corner of the Shroud in question used for the radiocarbon “dating” of the Shroud. He simply said that the 1978 photos showed no disturbance. Those are two different things and should be properly distinguished..","date":"2015-11-22","mins":"2:50 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"}]
