[{"id":"comment-213441","author":"robert_w_siefker","post":"The Solidus coin entry in the Critical Summary is very interesting. Reading the reference to Giulio Fanti’s, et al’s work on research in this area is important. There is a full length chapter in his new book on the topic. Well worth the read. Certainly one may well justifiably judge the evidence of the Solidus coin as coincidence, or not even that strongly. It can in fact be justifiably judged to have not significant at all to the question of the provenience of the Shroud. The bigger issue however is context. If for instance, like Dan, you judge the Pray Manuscript to “probably” not be a coincidence then that judgment throws light on other items of evidence. This is why context is just as important as drilling down with an all or nothing focus on a singular item of evidence. Just one judgment of “probably” (or stronger) on one item in a long chain of pre 1204 Shroud evidence changes one’s entire perspective. Now everything pre 1204 is looked at differently including a justified judgment that the Solidus coin isn’t just coincidence..","date":"2015-10-23","mins":"2:04 pm","url":"https://shroudstory.com/2015/10/22/available-critical-summary-version-3-0/","cat":"critical_summary","title":"Available: Critical Summary Version 3.0"},{"id":"comment-213716","author":"robert_w_siefker","post":"Hugh, things can devolve very quickly as your comments show. There needs to be some trust in other’s integrity. Absent that, no dialogue can take place. Of course, all that you have said in your comment could be true. But it isn’t. The fall through hypothesis is not an agenda driven hypothesis. All that TSC can do is state that fact and hope that reasonable people will evaluate it on the merits. We would suggest that as a start interested individuals read the recent forward to the fall through hypothesis that is posted on the TSC website (www.shroudofturin.com) as well as the fall through hypothesis itself which is also posted there. TSC is in fact very open to other hypotheses. We are yet to be convinced that any that follow “conventional physics” are adequate. The first problem is methodological naturalism. None of Jesus’s reported miracles can be explained by standard physics. Reason – – it is proposed – – cannot know such truths. Thus all special revelation and the “mighty works of God” are ruled out in the realm of reality known by reason and are only preserved in the secondary realm of subjective “irrational” faith. Jackson acknowledges this in the forward mentioned above. Yet he has persisted. He knows he will be the target of statements like “made up physics can explain anything.” The second problem of course is the Shroud itself..","date":"2015-10-27","mins":"4:26 pm","url":"https://shroudstory.com/2015/10/26/dan-spicer-we-have-a-simple-explanation/","cat":"critical_summary","title":"Dan Spicer:  We have a simple explanation."},{"id":"comment-213350","author":"robert_w_siefker","post":"Dan, the “punch card chart” is not aimed at being “scientific” analysis. As clearly stated at the top of the chart with the word “judged”, this is TSC’s analysis. We have included only 17 image characteristics because we think that these seventeen, in and of themselves, can be used to evaluate image formation hypotheses that have gained at least some traction through the years. The chart itself does not stand alone. Appendix 1 gives our reasoning for each mark. Again it is judgment and if the image characteristics are indeed true, as we judge them to be, understandable to anyone. We also state that the The fall through hypothesis cannot be tested or proven. In fact it is a very “unscientific” explanation as we acknowledge in its description and in the Conclusion. It just fits the data. Read it. Think about it in the context of the whole body of Shroud evidence..","date":"2015-10-22","mins":"9:23 am","url":"https://shroudstory.com/2015/10/22/available-critical-summary-version-3-0/","cat":"critical_summary","title":"Available: Critical Summary Version 3.0"},{"id":"comment-213644","author":"robert_w_siefker","post":"TSC is very interested in Dan Spicer’s hypothesis. We include a comment on his and E.T. Toton’s work in the Critical Summary. A “naturalistic” image formation process should be able to be modeled experimentally. Fanti and his team have done a lot of work on their CD hypothesis and that should be applauded. We continue to think however that over time and even with great effort naturalistic explanations will fall short of a demonstration and that “judgment” will always be the last word with the Shroud. As we state in the conclusion to the Critical Summary the latest naturalistic hypotheses, including Fanti’s and Dan Spicer’s are all forcing hypotheses that stress the limits of believable, although possibly less than the fall through hypothesis. What can be concluded is that something very very remarkable happened to form the image on the Shroud. The image on the Shroud remains best described as an “impossible” image. The fall through hypothesis fits the data of the image characteristics. Individuals will have to “judge” what that means. The image characteristics included in the Critical Summary closely follow the lead of G. Fanti’s “Compendium” as noted in our references. Why these image characteristics are important, and why we have focused on them, is because we think they are sufficient to rule out any artistic hypothesis (respectfully yours too Colin)..","date":"2015-10-26","mins":"1:30 pm","url":"https://shroudstory.com/2015/10/26/dan-spicer-we-have-a-simple-explanation/","cat":"critical_summary","title":"Dan Spicer:  We have a simple explanation."},{"id":"comment-213718","author":"robert_w_siefker","post":"“If” the blood was transferred to the cloth before the image then it is TSC’s judgment that any subsequent artistic effort to create an image would leave evidence at the boundary of blood and serum retraction rings. No such evidence has been found. To the contrary the boundary between image and blood has shown remarkable coordination in the areas observed. The colored image fibers are colored up to the boundary. There is no evidence of a coloring agent being applied beyond the boundary, i.e. Paint being applied beyond the boundary over the blood. If the artistic method was a bas relief using a heated object then the blood areas would be damaged or even obliterated. Microscopic observations of the Shroud blood areas have not shown any degradation due to heat with the notable exception at the intersection of bloodstains with fire damage to the Shroud from the 1532 fire. This interpretation of the evidence is what the Critical Summary is attempting to express..","date":"2015-10-27","mins":"5:32 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213719","author":"robert_w_siefker","post":"Thank you Mario. We will add the reference to your document and adjust our comments. Along with Piero we had not seen your study: “The Shroud of Turin and the Sainte Chapelle.” Indeed it is a very interesting study and we can certainly use it to add better clarity to the entry in the Critical Summary on “The Relics of St. Louis of France”. The major point however of the narrative presented in the Critical Summary remains:The Mandylion is currently lost and it has been at least since the time of the French Revolution..","date":"2015-10-27","mins":"5:47 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213789","author":"robert_w_siefker","post":"Mario, we have not read these source documents. We relied on secondary references for our Sainte Chapelle item in the Critical Summary. TSC thinks the historical evidence strongly supports the position that the Shroud and the Image of Edessa or Mandylion were two separate cloths. Our entry on Sainte Chapelle simply aimed at showing how important the Sainte Chapelle relics were, including the Mandylion, and that the known history of the Mandylion ended there. Your comments are appreciated. We will familiarize ourselves with the documents you have identified, including yours, and make an effort to be sensitive to them in any future update. Thank you..","date":"2015-10-28","mins":"10:41 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"}]
