[{"id":"comment-3755","author":"adrie","post":"Hi Jabba and Yannick! Thanks for the reference, and I do have something to add and subtract: My thesis has nothing to do with a table cloth … It says that the garment left by the young man who “ran away naked” (Mr 14,51 52) became the burial shroud of Jesus, because Joseph Arimathea, when he had just received burial permission from Pilate in the temple fortress, bought it from the temple police who had snatched it off from this young man in Gethsemane. The properties of the Turin Shroud used for its identification as a garment, and more specifically a priest’s garment, are its Pharisaic enlarged border and (cut off) corner fringes, its threads’ Syro Palestinian sacerdotal Z twisting, and its images of a Jewish high priest’s oval ornament under the chin and cylinder seal with its cord on the hands. The most outstanding biblical fact that identifies Jesus’ shroud as a priest’s garment is the beloved disciple’s belief that Jesus had risen because he saw the shroud rolled up and placed aside (Jo 20,7 8), just as a priest’s garment was always rolled up and place aside in the temple. A shorter article than the one Jabba mentioned, and more specific on the Shroud (18 pages), is: http://www.jesusking.info/The%20seam%20and%20corners.pdf. And an even shorter excerpt (7,5 pages) is: http://www.jesusking.info/John%20 Mark%27s%20garment.pdf. In it, for shortness sake, I reckon that the beloved disciple was the fleeing secret disciple John Mark, the Sanhedrin’s priest secretary, for this has already been shown in my article/book (73 pages) http://www.jesusking.info/John%20 Mark.pdf). Adrie.","date":"2011-09-01","mins":"11:13 am","url":"https://shroudstory.com/2011/08/31/paper-chase-was-the-shroud-of-turin-also-the-tablecloth-of-the-last-supper/","cat":"history","title":"Paper Chase: Was the Shroud of Turin Also the Tablecloth of the Last Supper?"},{"id":"comment-6287","author":"adrie","post":"The Jewish Encyclopedia has a fifteenth century image of a tallit ( = Jewish rectangular prayer mantle) as long as the Shroud with long border(s) and corner fringes, worn thrown loosely around the shoulders. It now can be seen at: http://www.jewishencyclopedia.com/articles/14210 tallit.","date":"2011-12-30","mins":"6:30 am","url":"https://shroudstory.com/2011/08/31/paper-chase-was-the-shroud-of-turin-also-the-tablecloth-of-the-last-supper/","cat":"history","title":"Paper Chase: Was the Shroud of Turin Also the Tablecloth of the Last Supper?"}]
