[{"id":"comment-1108","author":"adrie","post":"Hi Colin, I didn’t see the detail from the links, but from the print of the ventral photo on p. 16 of Adler’s posthumous book “The Orphaned Manuscript” (available via http://holyshroudguild.org/orphaned manuscript.html , but with “All rights reserved” by Effatà Editrice, Turin). I do ‘think I see’ the calves and the feet and probably one of the thighs (right on the screen) in the online dorsal photo using the zoom facility, though. Adler said that the image had “almost completely disappeared” (Chemical and Physical Aspects, p. 17, also in Adler, The Shroud Fabric and the Body Image, in The Turin Shroud, past, present and future, p. 57), so at least some of it should visible. Today, I found a larger online ventral photo near the end of this page http://www.shroud.com/vanhels2.htm (reddish), and another one here (yellowish). Also these don’t have all the white lines and borders of the print in the book, so the print probably is distorted. Zooming in on the reddish photo, it seems to show some fingers. This page on shroud3d.com has a comparison of the head in reflectance and transmitted light (I can’t see the photo when on the page but it is this one: comparison head ). This one has a patch and forearm (click to enlarge). This is just the forehead in different lighting , probably to compensate for the overlighting of the forehead in the ventral photo by the upper light source. I didn’t ask Barrie Schwortz to release the HR images, but his gallery page says anyone can ask for them “for use in books, magazines, television programs, etc.” but not for the internet..","date":"2012-11-03","mins":"2:23 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/30/a-leisurely-thinking-aloud-appraisal-of-those-recently-released-shroud-photomicrographs/","cat":"medieval_forgery","title":"A leisurely, thinking-aloud appraisal of those recently-released Shroud photomicrographs."},{"id":"comment-1098","author":"adrie","post":"Could you change the “Antonacci” into “Rogers”? It was in Rogers’ comment on Antonacci’s work….","date":"2012-11-02","mins":"1:44 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/30/a-leisurely-thinking-aloud-appraisal-of-those-recently-released-shroud-photomicrographs/","cat":"medieval_forgery","title":"A leisurely, thinking-aloud appraisal of those recently-released Shroud photomicrographs."},{"id":"comment-1096","author":"adrie","post":"No, I wouldn’t mind..","date":"2012-11-02","mins":"12:59 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/30/a-leisurely-thinking-aloud-appraisal-of-those-recently-released-shroud-photomicrographs/","cat":"medieval_forgery","title":"A leisurely, thinking-aloud appraisal of those recently-released Shroud photomicrographs."},{"id":"comment-1094","author":"adrie","post":"Yes, I agree with you that the stars may be just an artefact of the decorator’s cloth. And you’re right about the difficulty in discerning the image in low magnification as well. These are the backlit photos of the Shroud http://www.shroud.com/gallery/pages/4 X5 FTA.htm http://www.shroud.com/gallery/pages/4 X5 DTA.htm (by “macroscopic scale” I meant ‘visible to the naked eye’). They show that some parts of the image are a bit darker than the background, for instance the abdomen and ventral thighs, but nowhere in the body image the net effect of oxidation+stars is a lighter image than the background, except perhaps at the four areas at the forehead, beneath a ventral knee, at the back of the head and next to a dorsal foot. But these lighter areas don’t constitute an image and seem to be artefacts of the light sources or wear. The book “The Orphaned Manuscript” has the backlit photo of the ventral side. It shows white borders around the burn patches and some white lines along the scorched longitudinal folds that are not visible in the online photo. I wonder if the back of the cloth was lighted uniformly. If the middle strip of the cloth received more backlight than the sides (and if the top and bottom parts of the image received more than the middle part of it), this might explain (at least partly) why the image is less visible than the light scorches and why only the middle part of the ventral image is visible. Adler said “In reflectance photographs the images of the waterstains, scorches, blood, and body images are all approximately of about the same intensity.” The text then has the two sentences about disappearance of the body image and the presence of the other marks in transmitted light (already quoted), and then follows a cryptic sentence: “In the reflectance mode the colored body image fibers produce 100% of the reflected radiation recorded, but in the transmitted mode they only contribute about 1% of the radiation recorded, thus demonstrating their superficial one fiber deep nature.” (Adler, Chemical and Physical aspects, p. 17). Pellicori wrote: “Figure 2 presents reflectances relative to background and normalized to ~1.0 at 700 nm for body image areas, scorches from the year 1532 fire, and bloodstained areas. […] A representative light scorch and a body stain have nearly the same color” (Spectral properties, p. 1915). Pellicori doesn’t discuss transmitted mode recordings of the Shroud, so perhaps the details, especially the (backlight corrected) percentages for the light scorches, are in another STURP article, which I haven’t got… John Jackson recently said “the STURP examination clearly showed that the body image is only on the surface of the cloth, whereas the 1532 scorch mark discolorations at the same intensity of the body image discolor the cloth throughout its bulk.” link Antonacci probed the Shroud with a dissecting needle under a microscope and testified to “the discontinuous nature of the color and the extremely shallow penetration of the color into the cloth” (http://www.shroud.com/pdfs/rogers.pdf p. 12). I don’t know if anyone ever did this with a representative light scorch. BTW, in 1982 Rogers and Schwalbe wrote “With properly controlled heat and timing, superficial scorches can be produced on cloth without affecting the gross mechanical properties of the fabric” (Physics and Chemistry, p. 25)..","date":"2012-11-02","mins":"12:26 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/30/a-leisurely-thinking-aloud-appraisal-of-those-recently-released-shroud-photomicrographs/","cat":"medieval_forgery","title":"A leisurely, thinking-aloud appraisal of those recently-released Shroud photomicrographs."},{"id":"comment-1127","author":"adrie","post":"Yes, I saw that theory (I saw all your postings), and that’s one of the reasons why I think you’re right about touched up wounds. Sorry about the pinkish. Later I thought I should have written reddish or purplish or the other word you used for the bloodcolor (found it again): shades of plum..","date":"2012-11-06","mins":"11:20 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/30/a-leisurely-thinking-aloud-appraisal-of-those-recently-released-shroud-photomicrographs/","cat":"medieval_forgery","title":"A leisurely, thinking-aloud appraisal of those recently-released Shroud photomicrographs."},{"id":"comment-1066","author":"adrie","post":"Hi Colin and Hugh, As to the shrinkage of image fibers/threads: I can’t remember reading about it, but I haven’t read everything and may have forgotten. It is said though, that “the body image fibers are more brittle than those of the non body image fibers” (Adler, Chemical and Physical Aspects, p. 15). “The image fibers are very brittle and show “corroded” surfaces (as would be expected for dehydratively oxidized material)” (Adler, The Nature of the Body Images, p. 105). On macroscopic scale, in transmitted light photography, “the waterstains, scorches, and blood marks are all still clearly evidenced, confirming that they do penetrate the cloth. However, the body images have almost completely disappeared” (Adler, Chemical and Physical Aspects, p. 17). So, it seems there are no ‘stars’ in the Shroud image, at least not revealing their presence in the photograph..","date":"2012-11-01","mins":"10:53 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/30/a-leisurely-thinking-aloud-appraisal-of-those-recently-released-shroud-photomicrographs/","cat":"medieval_forgery","title":"A leisurely, thinking-aloud appraisal of those recently-released Shroud photomicrographs."},{"id":"comment-1125","author":"adrie","post":"Well, I said the bloodcolored scourge marks can be considered an applied pigment, because you compared the haemoglobin of blood to an applied pigment in your earlier comment (“OK, so the scourge marks are faint, relative to blood on forearms etc, but it is still an applied pigment, albeit a natural one (haemoglobin).” And also because, guess what, I think you’re right about touched up “wounds”. Hope to write about that later. This backlit photo I called the patch and forearm in my earlier comment, and it has the patch next to the large bloodmark on the breast. I’m afraid I couldn’t win that contest … have to get back to that pesky fluorescence first ….","date":"2012-11-06","mins":"10:48 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/30/a-leisurely-thinking-aloud-appraisal-of-those-recently-released-shroud-photomicrographs/","cat":"medieval_forgery","title":"A leisurely, thinking-aloud appraisal of those recently-released Shroud photomicrographs."},{"id":"comment-1122","author":"adrie","post":"Yes, again I agree, Colin. That the lighting discriminates is what I suspected when I saw the photos, and now you’ve mentioned the absence of scourge marks and Hugh has found the quote about the uneven lighting, I’m sure. (Some marks on the breast that clearly look pinkish in my Picasa photo edit of the Shroud Scope breast area, and that can be considered an applied pigment, are missing in the detailed backlit photo of the patch forearm.) Unless there are backlighting corrected data from a representative light scorch, that can be compared to the data from “the colored body image fibers” (Adler mentioned a 100% radiation that dropped to 1%), this backlight experiment certainly can’t be used to dismiss the scorch hypothesis, imo..","date":"2012-11-05","mins":"7:52 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/30/a-leisurely-thinking-aloud-appraisal-of-those-recently-released-shroud-photomicrographs/","cat":"medieval_forgery","title":"A leisurely, thinking-aloud appraisal of those recently-released Shroud photomicrographs."},{"id":"comment-1112","author":"adrie","post":"Great quote and find, Hugh! I totally agree..","date":"2012-11-03","mins":"4:08 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/30/a-leisurely-thinking-aloud-appraisal-of-those-recently-released-shroud-photomicrographs/","cat":"medieval_forgery","title":"A leisurely, thinking-aloud appraisal of those recently-released Shroud photomicrographs."},{"id":"comment-1629","author":"adrie","post":"Hi anoxie, In my article Internal selvedge in starched and dyed temple mantle – No invisible repair in Turin Shroud – No Maillard reaction I describe the evidence for starch on the Shroud (par. 2.2) and how it may have got there and why (par. 1.1 and 2.5, with confirmation by the extraordinary seam, par. 4.3) and how it may have retrograded twice (par. 4.2.3). Starch retrogrades when it is allowed to cool down slowly and rest after having been gelatinised (e.g. Boiled in water). It is insoluble in water: water hardly gets into it at room temperature because of its semi crystallinity. On the Shroud, in retrograding twice, the starch coating may have got the shape of a continuous insoluble film around the surface fibers (par. 4.2.1). Polishing the cloth with a glass ball would have made the coating even more dense and waterproof (par. 2.3.2 Permanent Madder fluorescence). It is said that “The Shroud cloth is tightly woven, it is relatively thick, and it does not readily absorb water” (Scientific Method, p. 32)..","date":"2013-01-03","mins":"6:26 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/01/more-thoughts-on-the-fragility-of-image-bearing-fibres-on-the-shroud-of-turin/","cat":"anoxie","title":"More thoughts on the fragility of image-bearing fibres on the Shroud of Turin"},{"id":"comment-1110","author":"adrie","post":"Barrie Schwortz said “When the panels of the table were removed for the transmitted light photography, the light passed ONLY through the Holland backing cloth and the linen of the Shroud.” (http://www.shroud.com/vanhels2.htm , Caps by Van Haelst).","date":"2012-11-03","mins":"2:40 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/11/02/is-it-true-that-the-shroud-image-ceases-to-be-visible-when-backlit-and-viewed-with-transmitted-light-a-reader-comments/","cat":"adrie","title":"Is it true that the Shroud image (“unlike a scorch”) ceases to be visible when backlit and viewed with transmitted light? A reader comments…"},{"id":"comment-1241","author":"adrie","post":"Great Hugh! I’m curious..","date":"2012-11-22","mins":"2:53 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/12/stephen-jones-bsc-grad-dip-ed-persists-in-his-mistaken-belief-that-the-shroud-image-is-a-photograph-wheres-the-scientific-evidence/","cat":"junk_science","title":"Stephen Jones BSc. Grad Dip.Ed persists in his mistaken belief that the Shroud image is a photograph. (Where’s the scientific evidence?)"},{"id":"comment-1239","author":"adrie","post":"Hello Hugh, You’ve scorched some cloth that was all cotton. Did you happen to see any green yellow or other fluorescence on it? It may help us to know whether the green yellow fluorescence on scorched linen (partly) derives from scorched cellulose, as cotton is pure cellulose. Thanks for all your information!.","date":"2012-11-22","mins":"2:04 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/12/stephen-jones-bsc-grad-dip-ed-persists-in-his-mistaken-belief-that-the-shroud-image-is-a-photograph-wheres-the-scientific-evidence/","cat":"junk_science","title":"Stephen Jones BSc. Grad Dip.Ed persists in his mistaken belief that the Shroud image is a photograph. (Where’s the scientific evidence?)"}]
