[{"id":"comment-11367","author":"adrie","post":"In my (updated) article I give a number of (new) reasons why a Maillard reaction would not have colored the starch dye impurity layer: 1. Absence of (evidence of) reducing saccharides 2. Transformed alizarin of Madder explains the fluorescence peak shift in image areas, but alizarin can not be transformed by a Maillard reaction 3. Diffusion of gaseous reactants into the cloth would have produced a color gradient (Rogers and Arnoldi, Scientific Method, p. 5) As to the presence of starch on image fibers: Rogers found traces, but Heller and Adler found none. This can be explained by the variation of color along long image fibers. See “Internal selvedge in starched and dyed temple mantle – No invisible repair in Turin Shroud – No Maillard reaction”, http://jesusking.info/Internal%20selvedge.pdf , paragraph 2.2.1. And 4.2., respectively..","date":"2012-05-15","mins":"9:52 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","title":"Comment of the Week by Thibault Heimburger"},{"id":"comment-11415","author":"adrie","post":"Where image color is present on a fiber, it is uniform all around the circular surface of the fiber, but it needn’t be present all along the length of a fiber (Evidences, fact B15 http://www.shroud.com/pdfs/doclist.pdf ). 1. Heller and Adler deliberately tested image type fibers – i.e. Completely colored fibers – for starch, and didn’t detect it (A Chemical Investigation, p. 37, 43, 50). This is not speculative. 2. Rogers incidentally found traces of starch fractions when “testing for sulfoproteins in blood areas” (Comments on, p. 13 14 http://www.shroud.com/pdfs/rogers.pdf). Here, the tested fiber was possibly from a blood/image area, but it was not necessarily a completely image colored fiber. The detected starch fractions may have been present on a not colored length of it, perhaps even under the blood. Rogers added: “we should have tested for starch”, so he didn’t do any specific tests for starch on specific fibers then. His later remark in Scientific Method (p. 30 http://www.shroud.com/pdfs/rogers2.pdf ) “The hypothesis on carbohydrate impurities is supported by observations of traces of some starch fractions on image fibers” gives no specification or reference. This is not scientific. 3. Rogers’ book (p. 44) says Mc Crone “had found wheat starch on the Shroud”, but also here there’s no reference. 4. Kohlbeck found starch on sample 6 BF from the lance wound area, i.e. A blood/image area (http://holyshroudguild.org/dr raes problematic threads 3.html , and Mapping of research test points http://www.shroud.com/maptap2v.htm F=Front=Ventral). These observations prove that, where starch was present on a fiber, and if this starch was colored, it was completely transformed by the image formation process. A Maillard reaction can not do this: it can not transform starch. It can not color the primary cell wall either. VUV irradiation can color the primary cell wall (Di Lazzaro et al., http://www.acheiropoietos.info/proceedings/Di Lazzaro Web.pdf), and probably also starch if it is less stable. I added this to my article “Internal selvedge … – No Maillard reaction” http://jesusking.info/Internal%20selvedge.pdf (new 4.2.4). Thank you, Ron..","date":"2012-05-18","mins":"6:42 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","title":"Comment of the Week by Thibault Heimburger"},{"id":"comment-11414","author":"adrie","post":"Rogers’ (and Schwortz’) book A Chemist’s Perspective (p. 109) reads “A summary of observations … 5) The color of image fibers was often stripped off of their surfaces. … 6) … 8) Image color can be chemically reduced with diimide, leaving colorless cellulose fibers. The color resides only on the surface of the fibers, and it is the result of conjugated double bonds. The underlying cellulose (linen) fibers are not colored. 9) …” Now (I repeat), chemically reducing means ‘replenishing with electrons’, not ‘diminishing the size’. So, if diimide left colorless “cellulose”, this would mean that the top of the colored layer was cellulose, and there wouldn’t have been impurities at all. That is not what the author(s) had in mind (cf. Their #11), and that is why it reads “cellulose fibers”, meaning linen fibers plus any impurities. In the last sentence – saying that “cellulose (linen) fibers” are under the colored layer –, the addition of “(linen)” excludes the impurities again and tacitly includes the primary cell wall, as being under the colored layer. This inclusion isn’t based on the diimide or Ghost or any other published observation..","date":"2012-05-18","mins":"6:16 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","title":"Comment of the Week by Thibault Heimburger"},{"id":"comment-11416","author":"adrie","post":"The link to my next comment of today has disappeared from the “Recent Comments” list (column on the right). It is https://shroudofturin.wordpress.com/2012/05/12/comment of the week by thibault heimburger/#comment 11415.","date":"2012-05-18","mins":"7:08 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","title":"Comment of the Week by Thibault Heimburger"},{"id":"comment-1015","author":"adrie","post":"I think the point is that the image of the Shroud is not “non fluorescing”. It just fluoresces less than the background. The UV vis spectra of image and ‘red’ scorch are even almost the same: “When the photoelectric data are convolved with the scotopic response curve and normalized (Fig. 9), it becomes obvious that the background linen itself is responsible for the measured response of the blood and image areas, since there is an identical wavelenght characteristic. This agrees with the visual description. The curve for scorches having visual reflectance corresponding to that of image areas shows only a light weighting toward the orange region relative to the curves for body image, although the color difference is obvious to the eye and in the fluorescence photography. The explanation might be that the eye has an excellent ability to distinguish between colour differences when compared side by side.” (Pellicori, Spectral properties of the Shroud of Turin, Applied Optics, Vol. 19, No 12, 1980, p. 1919). So, it is is not that the image formation should produce no fluorescence at all, it should only produce less fluorescence than it takes away. If the Shroud threads were wiped with starch paste at weaving just as you dabbed the linen with your finger, Hugh, touching only individual fibers, this might indeed explain some of the ‘half tone effect’ of the Shroud image..","date":"2012-10-25","mins":"8:06 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/25/refining-a-model-childrens-invisible-writing-trick-with-lemon-juice-allows-thermal-imprinting-scorching-at-a-much-reduced-temperature/","cat":"medieval_forgery","title":"Refining a model: children’s ‘invisible ink’ trick with lemon juice allows thermal imprinting  (“scorching”) at a much reduced temperature"},{"id":"comment-1013","author":"adrie","post":"You guys sure are fast, I can only just keep up 🙂 (if this is good English) This is the comment I made on The Other Site a while ago http://shroudstory.com/2012/05/12/comment of the week by thibault heimburger/ So, Hugh, if you like, you might read my article http://jesusking.info/Internal%20selvedge.pdf or the parts you think are useful now. Sorry, Colin, that I only mentioned VUV light in the comment. Minimal scorching might do exactly the same. I posted my comment above before I saw yours of just now..","date":"2012-10-25","mins":"6:05 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/25/refining-a-model-childrens-invisible-writing-trick-with-lemon-juice-allows-thermal-imprinting-scorching-at-a-much-reduced-temperature/","cat":"medieval_forgery","title":"Refining a model: children’s ‘invisible ink’ trick with lemon juice allows thermal imprinting  (“scorching”) at a much reduced temperature"},{"id":"comment-1014","author":"adrie","post":"Http://shroudstory.com/2012/05/12/comment of the week by thibault heimburger/#comment 11415 this is the link to the comment I meant ….","date":"2012-10-25","mins":"6:20 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/25/refining-a-model-childrens-invisible-writing-trick-with-lemon-juice-allows-thermal-imprinting-scorching-at-a-much-reduced-temperature/","cat":"medieval_forgery","title":"Refining a model: children’s ‘invisible ink’ trick with lemon juice allows thermal imprinting  (“scorching”) at a much reduced temperature"},{"id":"comment-1012","author":"adrie","post":"Yes, STURP took four tape samples, and did other investigations. These margins at least contain: – many red iron oxide particles (from iron in water originally used for the retting of the linen. (H&A, A Chemical Investigation, p. 45 46, 50) – a higher concentration of calcium, compared to the almost uniform distribution on the cloth, implying it derives form the manufacture of the linen (Adler, Chemical and Physical, p. 23) – all sorts of debris, as all sticky tapes do. The water stain margin at the edge of the Raes corner contained a higher concentration of salts than those in the rest of the Shroud (Adler, http://www.shroud.com/adler2.htm ). My hypothesis is that the Shroud has a very thin film of starch that was dyed with an acidic dilute madder dye solution (pale yellow). A madder dye solution can be made by boiling dried crushed madder root in acidified water and/or by fermenting. (http://footguards.tripod.com/06 ARTICLES/ART33 madder.htm http://en.wikipedia.org/wiki/Madder ). First century Jews used vinegar for acidification of water (cf. The “vinegar” offered to Jesus on the cross Jn 19,29). Pliny talks about “some small drops of vinegar” (minimo aceti asperu) used in the water for making a fine starch paste. In Latin, acetum was sour wine, but perhaps sometimes lemon was used to acidify water. The colorants of madder are the carbohydrates alizarin and purpurin, which fluoresce in the violet blue and yellow red. Together with the light blue fluorescence of the lignin in uncompletely bleached linen, they could explain the faint and mottled yellow green background fluorescence of the Shroud. The image formation then transformed this film (plus perhaps the primary cell wall), quenching the background fluorescence..","date":"2012-10-25","mins":"5:45 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/25/refining-a-model-childrens-invisible-writing-trick-with-lemon-juice-allows-thermal-imprinting-scorching-at-a-much-reduced-temperature/","cat":"medieval_forgery","title":"Refining a model: children’s ‘invisible ink’ trick with lemon juice allows thermal imprinting  (“scorching”) at a much reduced temperature"}]
